// BlueprintGeneratedClass M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C
// Size: 0x4b0 (Inherited: 0x480)
struct AM_Flashbang_Blind_01_BP_C : ATslPostProcessEffect {
	struct F*a6c93df757 UberGraphFrame; // 0x480(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x488(0x08)
	float _____1______0_AFF6D5134D79CE6B543B1D8991A51AF6; // 0x490(0x04)
	enum class ETimelineDirection _____1__Direction_AFF6D5134D79CE6B543B1D8991A51AF6; // 0x494(0x01)
	char pad_495[0x3]; // 0x495(0x03)
	struct UTimelineComponent* АР„З|·xЗ_2; // 0x498(0x08)
	float _____0______0_2FD5CA0D48A747A9C536689E48D8A2F7; // 0x4a0(0x04)
	enum class ETimelineDirection _____0__Direction_2FD5CA0D48A747A9C536689E48D8A2F7; // 0x4a4(0x01)
	char pad_4A5[0x3]; // 0x4a5(0x03)
	struct UTimelineComponent* АР„З|·xЗ_1; // 0x4a8(0x08)

	void UserConstructionScript(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x22c9a0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x22c9a0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x22c9a0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x22c9a0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x22c9a0
	void ReceiveBeginPlay(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	float ExecuteUbergraph_M_Flashbang_Blind_01_BP(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.ExecuteUbergraph_M_Flashbang_Blind_01_BP //  // @ game+0x22c9a0
};

