// Class Slate.*a76964c6a4
// Size: 0x2e0 (Inherited: 0x38)
struct U*a76964c6a4 : USlateWidgetStyleContainerBase {
	struct F*23cea9d391 ButtonStyle; // 0x38(0x2a8)
};

// Class Slate.*b2e401f537
// Size: 0x618 (Inherited: 0x38)
struct U*b2e401f537 : USlateWidgetStyleContainerBase {
	struct F*9ea8125f90 *9ea8125f90; // 0x38(0x5e0)
};

// Class Slate.*696b47b2fe
// Size: 0x460 (Inherited: 0x38)
struct U*696b47b2fe : USlateWidgetStyleContainerBase {
	struct F*0e1269d5fe *0e1269d5fe; // 0x38(0x428)
};

// Class Slate.*5d1d054c4e
// Size: 0x418 (Inherited: 0x38)
struct U*5d1d054c4e : USlateWidgetStyleContainerBase {
	struct F*07432774cf *07432774cf; // 0x38(0x3e0)
};

// Class Slate.*e26df617bf
// Size: 0x8a8 (Inherited: 0x38)
struct U*e26df617bf : USlateWidgetStyleContainerBase {
	struct F*0704742c93 *0704742c93; // 0x38(0x870)
};

// Class Slate.*515848413d
// Size: 0x280 (Inherited: 0x38)
struct U*515848413d : USlateWidgetStyleContainerBase {
	struct F*44fef67a56 *44fef67a56; // 0x38(0x248)
};

// Class Slate.*8d88b98fb3
// Size: 0x1f0 (Inherited: 0x38)
struct U*8d88b98fb3 : USlateWidgetStyleContainerBase {
	struct F*314a470245 ProgressBarStyle; // 0x38(0x1b8)
};

// Class Slate.*b39a3ccfa1
// Size: 0x550 (Inherited: 0x38)
struct U*b39a3ccfa1 : USlateWidgetStyleContainerBase {
	struct F*4cc977c5e0 *4cc977c5e0; // 0x38(0x518)
};

// Class Slate.*45bdb06fc2
// Size: 0x280 (Inherited: 0x38)
struct U*45bdb06fc2 : USlateWidgetStyleContainerBase {
	struct F*a3b1d90177 *a3b1d90177; // 0x38(0x248)
};

// Class Slate.SlateSettings
// Size: 0x38 (Inherited: 0x30)
struct USlateSettings : UObject {
	bool bVirtualKeyboardSendsTextChanged; // 0x30(0x01)
	bool bVirtualKeyboardDisplayOnFocus; // 0x31(0x01)
	bool bExplicitCanvasChildZOrder; // 0x32(0x01)
	char pad_33[0x5]; // 0x33(0x05)
};

// Class Slate.*f6884b3067
// Size: 0x348 (Inherited: 0x38)
struct U*f6884b3067 : USlateWidgetStyleContainerBase {
	struct F*1fe5209940 *1fe5209940; // 0x38(0x310)
};

// Class Slate.*6887280a80
// Size: 0x240 (Inherited: 0x38)
struct U*6887280a80 : USlateWidgetStyleContainerBase {
	struct F*b8dc2e8406 *b8dc2e8406; // 0x38(0x208)
};

