// Enum TslGame.*62cdf2ca7f
enum class *62cdf2ca7f : uint8 {
	*48e9e75737,
	*1a093e0af2,
	*bf86687773,
	*62cdf2ca7f_MAX,
};

// Enum TslGame.EBreathType
enum class EBreathType : uint8 {
	Apnea,
	ADS,
	EBreathType_MAX,
};

// Enum TslGame.ERequestPartyState
enum class ERequestPartyState : uint8 {
	Wait,
	Accept,
	Decline,
	ERequestPartyState_MAX,
};

// Enum TslGame.ECastCancelReason
enum class ECastCancelReason : uint8 {
	Invalid,
	CasterAiming,
	CasterArming,
	CasterApnea,
	CasterSprinting,
	CasterJumping,
	CasterFallingLong,
	CasterFiring,
	CasterGroggy,
	CasterGroggyOnZeroTimeCast,
	CasterHipped,
	CasterInvalid,
	CasterNotAlive,
	CasterPickedUpDroppedItem,
	CasterPickedUpItemFromPackage,
	CasterReloading,
	CasterRolling,
	CasterTargeting,
	CasterUnarmAttacking,
	CasterVault,
	CasterStanceInvalid,
	CasterFreefalling,
	CastObjectInvalid,
	CastObjectNotExecutable,
	FailedCasterMovementDistCheckOnClient,
	FailedCasterMovementDistCheckOnServer,
	FailedCasterAndCastObjDistCheckOnClient,
	FailedCasterAndCastObjDistCheckOnServer,
	CharacterBeingRevivedDead,
	ManualCancel,
	NewCastOnClient,
	NewCastOnServer,
	VehicleLanding,
	VehicleSeatChanged,
	VehicleMoving,
	VehicleUpsideDown,
	StuntEmoteOnVehicle,
	VehicleJumping,
	EmergencyPickupAircraft,
	CasterAttackByZombieAI,
	BodyCarry,
	CasterStunned,
	VehicleFuelFull,
	CharacterBehaviorNotFound,
	TeamsPlantedBomb,
	ECastCancelReason_MAX,
};

// Enum TslGame.EBlueBlockerState
enum class EBlueBlockerState : uint8 {
	Show,
	Looping,
	Hide,
	Hidden,
	EBlueBlockerState_MAX,
};

// Enum TslGame.ETargetingType
enum class ETargetingType : uint8 {
	Targeting_None,
	Targeting_Aiming,
	Targeting_Scoping,
	Targeting_MAX,
};

// Enum TslGame.EWeaponAttachmentSlotID
enum class EWeaponAttachmentSlotID : uint8 {
	None,
	Muzzle,
	LowerRail,
	UpperRail,
	Magazine,
	Stock,
	Angled,
	TacPack1,
	TacPack2,
	TacPack3,
	TacPack4,
	DronePackage,
	EWeaponAttachmentSlotID_MAX,
};

// Enum TslGame.ESystemMessageType
enum class ESystemMessageType : uint8 {
	Debug,
	Notify,
	Warning,
	Error,
	Important,
	NotifyCommand,
	ESystemMessageType_MAX,
};

// Enum TslGame.EOutGamePlatformProvider
enum class EOutGamePlatformProvider : uint8 {
	Unknown,
	Bro,
	PcSteam,
	PcDmm,
	PcMailRu,
	PcKakao,
	PcTencent,
	ConsoleXbox,
	ConsolePsn,
	PcLiteGarena,
	PcLiteGlobalAccount,
	PcLiteGlobalAccountJp,
	ConsoleStadia,
	PcEpic,
	AI,
	Max,
	EOutGamePlatformProvider_MAX,
};

// Enum TslGame.EDamageReason
enum class EDamageReason : uint8 {
	None,
	HeadShot,
	TorsoShot,
	PelvisShot,
	ArmShot,
	LegShot,
	NonSpecific,
	Blocked,
	EDamageReason_MAX,
};

// Enum TslGame.EDamageTypeCategory
enum class EDamageTypeCategory : uint8 {
	Damage_None,
	Damage_Instant,
	Damage_Gun,
	Damage_Melee,
	Damage_Punch,
	Damage_ZombiePunch,
	Damage_Groggy,
	Damage_BlueZone,
	Damage_VehicleHit,
	Damage_VehicleCrashHit,
	Damage_Molotov,
	Damage_Explosion,
	Damage_Explosion_Grenade,
	Damage_Explosion_RedZone,
	Damage_Explosion_Vehicle,
	Damage_Explosion_PlantedTimeBomb,
	Damage_Instant_Fall,
	Damage_Drown,
	Damage_BleedOut,
	Damage_Explosion_JerryCan,
	Damage_ZombieBuff,
	Damage_CPPWinExit,
	Damage_MeleeThrow,
	Damage_Explosion_C4,
	Damage_Explosion_StickyBomb,
	Damage_Explosion_Breach,
	Damage_Explosion_PanzerFaustWarhead,
	Damage_Explosion_PanzerFaustWarheadVehicleArmorPenetration,
	Damage_Explosion_PanzerFaustBackBlast,
	Damage_Explosion_Mortar,
	Damage_Explosion_BlackZone,
	Damage_Explosion_Meteor,
	Damage_TrainHit,
	Damage_Explosion_PropaneTank,
	Damage_LootTruckHit,
	Damage_Explosion_LootTruck,
	Damage_ShipHit,
	Damage_Lava,
	Damage_KillTruckHit,
	Damage_KillTruckTurret,
	Damage_HelicopterHit,
	Damage_Explosion_Aircraft,
	Damage_BlueZoneGrenade,
	Damage_FBRMolotov,
	Damage_DronePackage,
	Damage_Monster,
	Damage_Ability,
	Damage_Ability_ChickAttack,
	Damage_Ability_ChickAttack_Wave,
	Damage_Ability_Jump_Wave,
	Damage_Ability_FireBreath,
	Damage_Ability_FeathZone,
	Damage_Rotor,
	Damage_MotorGlider,
	Damage_Gun_Penetrate_BRDM,
	Damage_Explosion_GasPump,
	Damage_Blizzard,
	Damage_SandStorm,
	Damage_CableCarHit,
	Damage_DropStructHit,
	Damage_Poision,
	Damage_ZombieDash,
	Damage_StunGun,
	Damage_MAX,
};

// Enum TslGame.*a1bff1b8c2
enum class *a1bff1b8c2 : uint8 {
	*c4805ca8e9,
	*86d1d5b68f,
	*e4f09f7049,
	*a1bff1b8c2_MAX,
};

// Enum TslGame.ESkydiveState
enum class ESkydiveState : uint8 {
	Skydive_None,
	Skydive_Freefall,
	Skydive_ParachuteDeploying,
	Skydive_ParachuteDeployed,
	Skydive_ParachuteCollapsing,
	Skydive_MAX,
};

// Enum TslGame.EMarkerType
enum class EMarkerType : uint8 {
	Normal,
	Attack,
	Danger,
	Defend,
	Loot,
	Regroup,
	Vehicle,
	EMarkerType_MAX,
};

// Enum TslGame.EPlatoonSupportRequestEventType
enum class EPlatoonSupportRequestEventType : uint8 {
	Start,
	Interactible,
	Finish,
	EPlatoonSupportRequestEventType_MAX,
};

// Enum TslGame.EPlatoonCarePackageType
enum class EPlatoonCarePackageType : uint8 {
	NotDesignated,
	WeaponPackage,
	HealingPackage,
	EPlatoonCarePackageType_MAX,
};

// Enum TslGame.EOPUIMonsterType
enum class EOPUIMonsterType : uint8 {
	None,
	Chicken,
	ZombieTanker,
	ZombieC4,
	MAX,
	EOPUIMonsterType_MAX,
};

// Enum TslGame.EEquipSlotID
enum class EEquipSlotID : uint8 {
	Head,
	Hat,
	Eyes,
	Mask,
	Torso,
	TorsoArmor,
	Outer,
	Backpack,
	Hands,
	Legs,
	Feet,
	Belt,
	Special01,
	Special02,
	WeaponPrimary,
	WeaponSecondary,
	WeaponMelee,
	WeaponThrowable,
	WeaponTacticalGear,
	Bluechip,
	MaxOrNone,
	EEquipSlotID_MAX,
};

// Enum TslGame.EThrownWeaponType
enum class EThrownWeaponType : uint8 {
	Thrown_Grenade,
	Thrown_Molotov,
	Thrown_Melee,
	Thrown_Trap,
	Thrown_StickyBomb,
	Thrown_C4,
	Thrown_JerryCan,
	Thrown_BZ_Grenade,
	Thrown_TacPack,
	Thrown_TraumaBag,
	Thrown_SpotterScope,
	Thrown_Drone,
	Thrown_BlueChipDetector,
	Thrown_Toolbox,
	Thrown_CanBomb,
	Thrown_SpareTire,
	Thrown_IntegratedRepairKit,
	Thrown_PlantedBombKit,
	Thrown_DefusingBombKit,
	Thrown_Other,
	Thrown_StructFlare,
	Thrown_MAX,
};

// Enum TslGame.EPickupAnimType
enum class EPickupAnimType : uint8 {
	None,
	EPickupAnimType_MAX,
};

// Enum TslGame.EHitDirection
enum class EHitDirection : uint8 {
	Hit_Front,
	Hit_Back,
	Hit_Left,
	Hit_Right,
	Hit_MAX,
};

// Enum TslGame.*f4cb42df42
enum class *f4cb42df42 : uint8 {
	*102053f9b1,
	*8b620c5b74,
	*d02b472e0f,
	*ffc66898ec,
	*bb53090617,
	*f74f33facf,
	*6fcefc476a,
	*c421fa1db2,
	*019c688976,
	*f4cb42df42_MAX,
};

// Enum TslGame.ECastAnim
enum class ECastAnim : uint8 {
	None,
	Bandage,
	FirstAid,
	Medkit,
	EnergyDrink,
	Painkiller,
	Adrenaline,
	Door,
	Battery,
	Crafting,
	SuperDrink,
	Key,
	EmergencyPickup,
	SelfRevive,
	MortarInstall,
	BicycleDeploy,
	BulletproofShield,
	VehicleSkin,
	UnlockDoor,
	Custom,
	VehicleRepair,
	ArmorRepair,
	BlueChipTower,
	RevivalTransmitter,
	OpenBox,
	PlantedBomb,
	DefusingBomb,
	BattleReadyKit,
	OpenStrongBox,
	ECastAnim_MAX,
};

// Enum TslGame.ECharacterNegativeEffects
enum class ECharacterNegativeEffects : uint8 {
	Blind,
	Burning,
	Stun,
	Taser,
	Total,
	ECharacterNegativeEffects_MAX,
};

// Enum TslGame.ETirePunctureReason
enum class ETirePunctureReason : uint8 {
	Shot,
	Environment,
	Explosion,
	PanzerFaustExplosion,
	SkipFX,
	ManualRemoval,
	Other,
	ETirePunctureReason_MAX,
};

// Enum TslGame.ETslSLBStageDifficulty
enum class ETslSLBStageDifficulty : uint8 {
	Easy,
	Normal,
	Hard,
	Max,
	ETslSLBStageDifficulty_MAX,
};

// Enum TslGame.ETslSLBStage
enum class ETslSLBStage : uint8 {
	Stage1,
	Stage2,
	Stage3,
	Stage4,
	Stage5,
	Stage6,
	Max,
	ETslSLBStage_MAX,
};

// Enum TslGame.ETslTrainingType
enum class ETslTrainingType : uint8 {
	Aim_Sound_Lab,
	Grenades,
	FiringRange,
	VehicleSpot,
	GunItemSpot,
	CarShootingRange,
	JumpSchool,
	PracticeRange,
	OneOnOneArena,
	NONE,
	ETslTrainingType_MAX,
};

// Enum TslGame.EVoiceInputMode
enum class EVoiceInputMode : uint8 {
	OpenMic,
	PushToTalk,
	Toggle,
	Disable,
	MAX,
	EVoiceInputMode_MAX,
};

// Enum TslGame.*8c3ab28891
enum class *8c3ab28891 : uint8 {
	*381b358e0b,
	*0b04383114,
	*6a0673cc77,
	*ab653bd4aa,
	*8cc3ff9021,
	*3b58ba623d,
	*5abf9d151b,
	*34f21c306d,
	*8c3ab28891_MAX,
};

// Enum TslGame.EServerStatType
enum class EServerStatType : uint8 {
	UE,
	NET,
	FRAMEPRO,
	EServerStatType_MAX,
};

// Enum TslGame.EBeginningState
enum class EBeginningState : uint8 {
	Invalid,
	Normal,
	StartIsland,
	Airplane,
	Skydiving,
	Parachuting,
	EBeginningState_MAX,
};

// Enum TslGame.ETslOvercastAction
enum class ETslOvercastAction : uint8 {
	Initialized,
	Prolonged,
	CreateThunder,
	ETslOvercastAction_MAX,
};

// Enum TslGame.EPartnerLevel
enum class EPartnerLevel : uint8 {
	None,
	Normal,
	Lead,
	EPartnerLevel_MAX,
};

// Enum TslGame.EQualityType
enum class EQualityType : uint8 {
	EMainQuality,
	EViewDistanceQuality,
	EShadowQuality,
	EAntiAliasingQuality,
	ETextureQuality,
	EVisualEffectQuality,
	EPostProcessingQuality,
	EFoliageQuality,
	EQualityType_MAX,
};

// Enum TslGame.EReadyToPlayState
enum class EReadyToPlayState : uint8 {
	AllFinished,
	OnPreLoadMap,
	OnPostLoadMap,
	CheckMapLoadFinished,
	NotMapFullyLoaded,
	CheckPreloadingMap,
	LoadMapRequested,
	EReadyToPlayState_MAX,
};

// Enum TslGame.EDistanceBasedEvent
enum class EDistanceBasedEvent : uint8 {
	Undefined,
	Bullet_Hitted_LivingThings,
	Bullet_Hitted_Others,
	Weapon_Gun_Firing,
	Weapon_Grenade_Bounce,
	Weapon_Grenade_Explosion,
	Weapon_Grenade_ExplosionSound,
	Vehicle_Exhausting,
	Vehicle_Crash,
	Character_FootStep,
	Character_Landing,
	MAX,
	EDistanceBasedEvent_MAX,
};

// Enum TslGame.EAIStateType
enum class EAIStateType : uint8 {
	AI_None,
	AI_Idle,
	AI_Patrol,
	AI_Alert,
	AI_Fight,
	AI_Death,
	AI_MAX,
};

// Enum TslGame.EArenaState
enum class EArenaState : uint8 {
	Idle,
	Active,
	Finished,
	EArenaState_MAX,
};

// Enum TslGame.ERevivalMethod
enum class ERevivalMethod : uint8 {
	None,
	BluechipTower,
	RevivalTransmitter,
	Cheat,
	ERevivalMethod_MAX,
};

// Enum TslGame.ERankType
enum class ERankType : uint8 {
	None,
	InvalidSMS,
	Penalty,
	Restricted,
	Unranked,
	Bronze,
	Silver,
	Gold,
	Platinum,
	Diamond,
	Master,
	ERankType_MAX,
};

// Enum TslGame.ETslAIPlayerType
enum class ETslAIPlayerType : uint8 {
	HumanPlayer,
	AITypeNone,
	CommonAI,
	PillarAI,
	DummyAI,
	ZombieAI,
	MonsterAI,
	UltronAI,
	ScriptBotAI,
	MarketAI,
	ETslAIPlayerType_MAX,
};

// Enum TslGame.ESubjectToReport
enum class ESubjectToReport : uint8 {
	None,
	Killer,
	Spectating_Player,
	Replay_Player,
	Team_Member,
	OtherTeam_Members,
	Assistant,
	GroggyCauser,
	ESubjectToReport_MAX,
};

// Enum TslGame.EMarketCategoryType
enum class EMarketCategoryType : uint8 {
	None,
	Store,
	Tuning,
	RandomItem,
	Weapon,
	GarageOpen,
	WhiteZoneRecon,
	Selling,
	EMarketCategoryType_MAX,
};

// Enum TslGame.EMarketUIEquipCategory
enum class EMarketUIEquipCategory : uint8 {
	None,
	Helmet,
	Vest,
	Backpack,
	MAX,
	EMarketUIEquipCategory_MAX,
};

// Enum TslGame.*374b5aa406
enum class *374b5aa406 : uint8 {
	*a02d5a4d19,
	*a030d0b6e9,
	*fca34bc5fb,
	*b96a86efa2,
	*374b5aa406_MAX,
};

// Enum TslGame.ETslCharacterType
enum class ETslCharacterType : uint8 {
	none,
	user,
	user_ai,
	npc_pillar,
	npc_guard,
	monster_bear,
	monster_chicken,
	zombie_user,
	zombie_ai,
	npc_killtruck,
	ETslCharacterType_MAX,
};

// Enum TslGame.EAliveNumChangeType
enum class EAliveNumChangeType : uint8 {
	None,
	Die,
	ReviveOrRespawn,
	EAliveNumChangeType_MAX,
};

// Enum TslGame.ESetHealthReason
enum class ESetHealthReason : uint8 {
	Undefined,
	ByPlayerHeal,
	ByPlayerDamage,
	ByPassiveRecovery,
	ByReviveOrDeploy,
	BySystem,
	ESetHealthReason_MAX,
};

// Enum TslGame.ETslMapName
enum class ETslMapName : uint8 {
	Other,
	Baltic,
	Desert,
	Sanhok,
	DihorOtok,
	Summerland,
	Paramo,
	Tiger,
	Chimera,
	Heaven,
	Kiki,
	Neon,
	ETslMapName_MAX,
};

// Enum TslGame.FTslHASModeAuraType
enum class FTslHASModeAuraType : uint8 {
	None,
	Prop,
	Generator,
	Character,
	FTslHASModeAuraType_MAX,
};

// Enum TslGame.EAscenderSettlePoint
enum class EAscenderSettlePoint : uint8 {
	INVALID,
	RopeAttachPoint_LOWER,
	RopeAttachPoint_UPPER,
	RopeAttachPoint_START,
	EAscenderSettlePoint_MAX,
};

// Enum TslGame.EAuxilaryIconRequestor
enum class EAuxilaryIconRequestor : uint8 {
	None,
	Minimap,
	OwningWidget,
	EAuxilaryIconRequestor_MAX,
};

// Enum TslGame.EAuxilaryIconType
enum class EAuxilaryIconType : uint8 {
	Invalid,
	Drone,
	Drone_Destroyed,
	Detected_Player,
	Detected_Player_Above,
	Detected_Player_Below,
	EAuxilaryIconType_MAX,
};

// Enum TslGame.EScopeType
enum class EScopeType : uint8 {
	Main,
	Right,
	Total,
	None,
	EScopeType_MAX,
};

// Enum TslGame.*1f3e245098
enum class *1f3e245098 : uint8 {
	*641ac20701,
	*ec5510a9ea,
	*e1f8013b5e,
	*aae045f9e1,
	*1f3e245098_MAX,
};

// Enum TslGame.*9ffa63a5b3
enum class *9ffa63a5b3 : uint8 {
	*a89d09e712,
	*f3af5c5241,
	*b749b00188,
	*1b81d0fbfe,
	*0b1779a968,
	*e9bc2646aa,
	*815800d87c,
	*349f12d841,
	*e228e7089e,
	*951f4bb790,
	*d816c6c0af,
	*00c910b2aa,
	*9ffa63a5b3_MAX,
};

// Enum TslGame.ECharacterActionEventType
enum class ECharacterActionEventType : uint8 {
	None,
	WeaponChange,
	ItemUseCast,
	TakeDamage,
	PostDealDamage,
	TryToUnarmedAttack,
	TryToMeleeAttack,
	ECharacterActionEventType_MAX,
};

// Enum TslGame.*ae2c15694e
enum class *ae2c15694e : uint8 {
	*187d898ff7,
	*b3e6feb7fa,
	*524f55ba4c,
	*aac9a8df74,
	*bfd5bc5237,
	*ae2c15694e_MAX,
};

// Enum TslGame.EInteractableActorType
enum class EInteractableActorType : uint8 {
	None,
	BlueChipTower,
	GasPump,
	JukeBox,
	PlantedBomb,
	Vehicle_Seat,
	Vehicle_Wheel,
	Door,
	DroppedItem,
	Ascender,
	Zipline,
	VendingMachine,
	Firework,
	StrongBox,
	EInteractableActorType_MAX,
};

// Enum TslGame.EInteractInputType
enum class EInteractInputType : uint8 {
	None,
	MainInteract,
	SecondaryInteract,
	EInteractInputType_MAX,
};

// Enum TslGame.EKickProcess
enum class EKickProcess : uint8 {
	Disconnect,
	Shutdown,
	ShutdownIn10Sec,
	DuplicatedLogin,
	EKickProcess_MAX,
};

// Enum TslGame.EDirectMessageType
enum class EDirectMessageType : uint8 {
	Radio,
	Direct,
	DirectReply,
	Warning,
	System,
	EDirectMessageType_MAX,
};

// Enum TslGame.EDirectMessageOutGameType
enum class EDirectMessageOutGameType : uint8 {
	Normal,
	Preset,
	System,
	ClanNormal,
	ClanSystem,
	EDirectMessageOutGameType_MAX,
};

// Enum TslGame.EFutsalGamePhase
enum class EFutsalGamePhase : uint8 {
	Waiting,
	FirstHalf,
	SecondHalf,
	AddedTime,
	End,
	EFutsalGamePhase_MAX,
};

// Enum TslGame.EUnarmedAnimType
enum class EUnarmedAnimType : uint8 {
	Default,
	Spray,
	EUnarmedAnimType_MAX,
};

// Enum TslGame.EInventorySlotStatePad
enum class EInventorySlotStatePad : uint8 {
	Normal,
	Focus,
	Link,
	Selfput,
	Disabled,
	EInventorySlotStatePad_MAX,
};

// Enum TslGame.EDualMatchingState
enum class EDualMatchingState : uint8 {
	NotMatchingState,
	Matching,
	GamePrepared,
	EDualMatchingState_MAX,
};

// Enum TslGame.ELastTeamIconState
enum class ELastTeamIconState : uint8 {
	Normal,
	Groggy,
	Die,
	ELastTeamIconState_MAX,
};

// Enum TslGame.ESeatState
enum class ESeatState : uint8 {
	Empty,
	Player,
	Teammate,
	Enemy,
	ESeatState_MAX,
};

// Enum TslGame.ETslInputDeviceTypeBranch_BPOnly
enum class ETslInputDeviceTypeBranch_BPOnly : uint8 {
	KeyboardMouse,
	XboxGamepad,
	PS4Gamepad,
	SwitchGamepad,
	QuailGamepad,
	ETslInputDeviceTypeBranch_MAX,
};

// Enum TslGame.ETslInputDeviceGroupBranch_BPOnly
enum class ETslInputDeviceGroupBranch_BPOnly : uint8 {
	KeyboardMouse,
	Gamepad,
	ETslInputDeviceGroupBranch_MAX,
};

// Enum TslGame.ETslPlatformTypeBranch_BPOnly
enum class ETslPlatformTypeBranch_BPOnly : uint8 {
	PC,
	Xbox,
	PS4,
	Quail,
	Invalid,
	ETslPlatformTypeBranch_MAX,
};

// Enum TslGame.ETslPlatformGroupBranch_BPOnly
enum class ETslPlatformGroupBranch_BPOnly : uint8 {
	PC,
	Console,
	ETslPlatformGroupBranch_MAX,
};

// Enum TslGame.EBuffPropertyType
enum class EBuffPropertyType : uint8 {
	CoolTime,
	MeleeDamageRatio,
	OtherDamageRatio,
	AllDamageRatio,
	MeleeAttackDamageRatio,
	OtherAttackDamageRatio,
	MeleeBehindAttackDamageRatio,
	LandingDamageRatio,
	GetBoostOnDeal,
	MovementSpeedModifier,
	OnFootSpeedAccelModifier,
	JumpVelocityModifier,
	MaxHpModifier,
	DecreaseRevivalCastTime,
	ReloadingSpeedModifier,
	MultiProperty,
	RecoilModifier,
	PlayerAttackDamageModifier,
	MonsterAttackDamageModifier,
	ReduceGaugeRatio,
	DebuffResistance,
	EBuffPropertyType_MAX,
};

// Enum TslGame.EAutoSpectatePriority
enum class EAutoSpectatePriority : uint8 {
	None,
	Vehicle,
	Distance,
	Combat,
	EAutoSpectatePriority_MAX,
};

// Enum TslGame.EFBRClass
enum class EFBRClass : uint8 {
	WARRIOR,
	RANGER,
	WIZARD,
	PALADIN,
	EFBRClass_MAX,
};

// Enum TslGame.ELeagueMatchStatistic
enum class ELeagueMatchStatistic : uint8 {
	Kill,
	Damage,
	Assist,
	ELeagueMatchStatistic_MAX,
};

// Enum TslGame.ELeagueMatchResultState
enum class ELeagueMatchResultState : uint8 {
	None,
	WinnerWinnerChickenDinner,
	Statistic,
	Ranking,
	ELeagueMatchResultState_MAX,
};

// Enum TslGame.EObserverHudAnimType
enum class EObserverHudAnimType : uint8 {
	TeamWipeOutAnim,
	PersonalKillingSpreeAnim,
	TeamTotalKillingSpreeAnim,
	EObserverHudAnimType_MAX,
};

// Enum TslGame.EPreviewPlatformIconType
enum class EPreviewPlatformIconType : uint8 {
	XboxOne,
	PS4,
	Switch,
	Quail,
	None,
	EPreviewPlatformIconType_MAX,
};

// Enum TslGame.EMovementBaseType
enum class EMovementBaseType : uint8 {
	None,
	Train,
	Ship,
	CableCar,
	Escalator,
	COUNT,
	EMovementBaseType_MAX,
};

// Enum TslGame.*dd1265e535
enum class *dd1265e535 : uint8 {
	*d17cc2af24,
	*d766457587,
	*7f17588228,
	*dd1265e535_MAX,
};

// Enum TslGame.EBlueZoneShape
enum class EBlueZoneShape : uint8 {
	None,
	Circle,
	Rectangle,
	EBlueZoneShape_MAX,
};

// Enum TslGame.EGameZoneType
enum class EGameZoneType : uint8 {
	SafeZone,
	PlayZone,
	BlueZone,
	RedZone,
	BlackZone,
	EGameZoneType_MAX,
};

// Enum TslGame.ERespawnType
enum class ERespawnType : uint8 {
	Airborne,
	DeadPoint,
	StartPoint,
	Selectable,
	RandomPoint,
	CheckPoint,
	ERespawnType_MAX,
};

// Enum TslGame.EPlatoonTeam
enum class EPlatoonTeam : uint8 {
	None,
	Blue,
	Red,
	EPlatoonTeam_MAX,
};

// Enum TslGame.EAutoRecoveryType
enum class EAutoRecoveryType : uint8 {
	None,
	Human,
	Zombie,
	HumanAndZombie,
	EAutoRecoveryType_MAX,
};

// Enum TslGame.EZombieVirusType
enum class EZombieVirusType : uint8 {
	None,
	Attacked,
	All,
	EZombieVirusType_MAX,
};

// Enum TslGame.EPrivateTrainingRoomType
enum class EPrivateTrainingRoomType : uint8 {
	IndoorRange,
	PracticalTrainingRoom,
	None,
	EPrivateTrainingRoomType_MAX,
};

// Enum TslGame.ETeamMateEmoteErrorType
enum class ETeamMateEmoteErrorType : uint8 {
	Normal,
	ExcessFollower,
	ExcessLimitDistance,
	ETeamMateEmoteErrorType_MAX,
};

// Enum TslGame.EInventoryRadioMessageType
enum class EInventoryRadioMessageType : uint8 {
	Vicinity,
	Inventory,
	Equipment,
	Weapon,
	Attachment,
	TacticalGear,
	Empty_Head,
	Empty_TorsoArmor,
	Empty_Backpack,
	Empty_PrimaryWeapon,
	Empty_SecondaryWeapon,
	Empty_WeaponMelee,
	Empty_WeaponThrowable,
	Empty_LowMagScope,
	Empty_HighMagScope,
	Empty_Muzzle,
	Empty_LowerRail,
	Empty_Magazine,
	Empty_Stock,
	Empty_Canted,
	None,
	EInventoryRadioMessageType_MAX,
};

// Enum TslGame.ERadioMessageInteractionType
enum class ERadioMessageInteractionType : uint8 {
	DroppedItem,
	Vehicle,
	CarepackageOrDeadbox,
	VendingMachine,
	RevivalTower,
	Normal,
	None,
	ERadioMessageInteractionType_MAX,
};

// Enum TslGame.ERadioMessageAlarmSoundCategory
enum class ERadioMessageAlarmSoundCategory : uint8 {
	Normal,
	Notify,
	Warning,
	Important,
	Invalid,
	ERadioMessageAlarmSoundCategory_MAX,
};

// Enum TslGame.ERadioMessageCategory
enum class ERadioMessageCategory : uint8 {
	Affirmative,
	ThankYou,
	NeedMed,
	Negative,
	Sorry,
	NeedAmmo,
	EnemySpotted,
	EnemyAreaSpotted,
	ItemSpotted,
	Ping,
	AreaPing,
	HelpMe,
	AreaNeedHelp,
	AreaBackup,
	WayPoint,
	EmergencyPickup,
	TeamMateEmote,
	Inventory,
	PlantingBomb,
	DefusingBomb,
	MovePlantedBombSite,
	BombCoin,
	Rush,
	RewardProvided,
	Max,
	Invalid,
	ERadioMessageCategory_MAX,
};

// Enum TslGame.ERadioMessageDecorateType
enum class ERadioMessageDecorateType : uint8 {
	None,
	EnemySpotted,
	WorldMapPing,
	RewardProvided,
	ERadioMessageDecorateType_MAX,
};

// Enum TslGame.*5e8ae09c18
enum class *5e8ae09c18 : uint8 {
	*3b2e1a6b27,
	*dd4140e72e,
	*f9a814142e,
	*107bdd5935,
	*5e8ae09c18_MAX,
};

// Enum TslGame.EEquippedWeaponRTPC
enum class EEquippedWeaponRTPC : uint8 {
	None,
	HandBomb_Bottle,
	HandBomb_Metal,
	Melee,
	Pistol,
	SMG,
	AR,
	SR,
	Max,
	EEquippedWeaponRTPC_MAX,
};

// Enum TslGame.*3867654c2b
enum class *3867654c2b : uint8 {
	*5641cb3f6f,
	*6a335a05b5,
	*348ae72795,
	*3867654c2b_MAX,
};

// Enum TslGame.EViewModeActorCenterPosition
enum class EViewModeActorCenterPosition : uint8 {
	None,
	Center,
	Bottom,
	EViewModeActorCenterPosition_MAX,
};

// Enum TslGame.EViewModeCategory
enum class EViewModeCategory : uint8 {
	None,
	Weapon,
	Parachute,
	Character,
	Vehicle,
	FloatingVehicle,
	LootCrate,
	EViewModeCategory_MAX,
};

// Enum TslGame.ESystemMenuButtonType
enum class ESystemMenuButtonType : uint8 {
	RESUME,
	SETTINGS,
	TEAM_MANAGEMENT,
	KEY_GUIDE,
	RESTART_LOBBY,
	LEAVE_MATCH,
	RETURN_TO_GAME,
	EXIT_TO_DESKTOP,
	GM_COMMAND_INGAME_HELPER,
	MATCH_LOG,
	ESystemMenuButtonType_MAX,
};

// Enum TslGame.*2cd739555d
enum class *2cd739555d : uint8 {
	*11796ec38a,
	*3f6591b0a5,
	*ecf0ba2828,
	*2cd739555d_MAX,
};

// Enum TslGame.*840c6c5c30
enum class *840c6c5c30 : uint8 {
	*d861b93f77,
	*a05780afff,
	*8fc76a490b,
	*ddef2b9620,
	*f203bf45d4,
	*840c6c5c30_MAX,
};

// Enum TslGame.*10a5c7c537
enum class *10a5c7c537 : uint8 {
	*b039359763,
	*50bc1470cf,
	*9012a9e361,
	*d1c7fd587e,
	*b5021844b9,
	*8e78b2fda7,
	*3c6ff619a6,
	*10a5c7c537_MAX,
};

// Enum TslGame.EReticleType
enum class EReticleType : uint8 {
	RedDot,
	HoloSight,
	Scope2x,
	Scope3x,
	Scope4x,
	Scope6x,
	Scope8x,
	EReticleType_MAX,
};

// Enum TslGame.EKeyHintType
enum class EKeyHintType : uint8 {
	Menu,
	Parachuting,
	Character,
	Driver,
	Rider,
	WeaponUse,
	WeaponChange,
	ADS,
	Aim,
	ADS_8x15x,
	ADS_6x,
	ADS_1x2x3x,
	ADS_CantedSight,
	ADS_IronSight,
	Throwing,
	Heal,
	Swimming,
	TeamSpectating,
	KillerSpectating,
	WorldMap,
	None,
	FreefallNew,
	ParachuteNew,
	SpikeTrap,
	MotorGlider,
	JerryCan,
	Melee,
	MeleeThrowing,
	ArenaModeHelpBox,
	Other,
	EKeyHintType_MAX,
};

// Enum TslGame.*6a409c3376
enum class *6a409c3376 : uint8 {
	*772b3cd758,
	*c0a85bf402,
	*09ab2131e9,
	*f51ff378a1,
	*748da87583,
	*54ea6b8f73,
	*95fecf977e,
	*6a1376b313,
	*ec8652ebe0,
	*6a409c3376_MAX,
};

// Enum TslGame.EWeatherChange
enum class EWeatherChange : uint8 {
	NoChange,
	Rainy,
	Foggy,
	EWeatherChange_MAX,
};

// Enum TslGame.*73209877e3
enum class *73209877e3 : uint8 {
	*96971315b9,
	*e3ad8376fe,
	*e051ea6ab9,
	*d42c4de8fd,
	*fd1284e917,
	*a89130a728,
	*73209877e3_MAX,
};

// Enum TslGame.EMinimapColorType
enum class EMinimapColorType : uint8 {
	DESATURATED,
	SATURATED,
	EMinimapColorType_MAX,
};

// Enum TslGame.EDamageZoneType
enum class EDamageZoneType : uint8 {
	Head,
	Torso,
	Arm,
	Pelvis,
	Leg,
	EDamageZoneType_MAX,
};

// Enum TslGame.*0ba1379a07
enum class *0ba1379a07 : uint8 {
	*910062ee54,
	*b22ab5a0d6,
	*55e8d60b11,
	*0ba1379a07_MAX,
};

// Enum TslGame.EWeaponStoreItemGroup
enum class EWeaponStoreItemGroup : uint8 {
	None,
	WeaponGroupA,
	WeaponGroupB,
	WeaponGroupC,
	EWeaponStoreItemGroup_MAX,
};

// Enum TslGame.EStoreItemGroup
enum class EStoreItemGroup : uint8 {
	None,
	ItemGroupA,
	ItemGroupB,
	ItemGroupC,
	EStoreItemGroup_MAX,
};

// Enum TslGame.EStoreCategory
enum class EStoreCategory : uint8 {
	None,
	Equipment,
	Attachment,
	ETC,
	Intermediate,
	HighLevel,
	AR,
	DMR,
	SR,
	SG,
	SMG,
	CarePackage,
	CarePackage2,
	EStoreCategory_MAX,
};

// Enum TslGame.EMarketLevel
enum class EMarketLevel : uint8 {
	None,
	GroupA,
	GroupB,
	GroupC,
	GroupD,
	EMarketLevel_MAX,
};

// Enum TslGame.ETslWidgetCreationMethod
enum class ETslWidgetCreationMethod : uint8 {
	CreateOnInit,
	OnDemand,
	OnDemandOnOnlyPC,
	OnDemandOnOnlyConsole,
	ETslWidgetCreationMethod_MAX,
};

// Enum TslGame.ERedZoneGenerateType
enum class ERedZoneGenerateType : uint8 {
	None,
	Uniform_Distribution,
	Ringtaw,
	Outsider,
	RingtawOrOutsider,
	ERedZoneGenerateType_MAX,
};

// Enum TslGame.ETslHudType
enum class ETslHudType : uint8 {
	None,
	CharacterHud,
	SpectatorHud,
	ObserverHud,
	ReplayHud,
	LeagueReplayHud,
	ETslHudType_MAX,
};

// Enum TslGame.ETargetAnimDynamicsType
enum class ETargetAnimDynamicsType : uint8 {
	None,
	Hair,
	Coat,
	ETargetAnimDynamicsType_MAX,
};

// Enum TslGame.EAnimatableCustomizableTypes
enum class EAnimatableCustomizableTypes : uint8 {
	Hair,
	Outer,
	Legs,
	Torso,
	Head,
	Mask,
	Backpack,
	Eyes,
	TorsoArmor,
	Hands,
	Feet,
	Belt,
	Face,
	EAnimatableCustomizableTypes_MAX,
};

// Enum TslGame.EGameEndState
enum class EGameEndState : uint8 {
	None,
	CereMony,
	Cinematic,
	MatchFinish,
	EGameEndState_MAX,
};

// Enum TslGame.*0662b54277
enum class *0662b54277 : uint8 {
	*bbf509c521,
	*e03cea5721,
	*4efddf2989,
	*0662b54277_MAX,
};

// Enum TslGame.ELobbyCameraStates
enum class ELobbyCameraStates : uint8 {
	XBox_Home,
	Main_1,
	Main_2,
	Menu_1,
	Custom_1,
	Custom_2,
	EventPass_Milestone_1,
	EventPass_Milestone_2,
	EventPass_Missions,
	ViewMode_Character,
	ViewMode_Weapon,
	ViewMode_Parachute,
	EventPass_Milestone_0_Particle,
	None,
	ELobbyCameraStates_MAX,
};

// Enum TslGame.EUiShowType
enum class EUiShowType : uint8 {
	AlwaysShow,
	TpsOnlyShow,
	FpsOnlyShow,
	AlwaysHide,
	EUiShowType_MAX,
};

// Enum TslGame.EMatchLogTab
enum class EMatchLogTab : uint8 {
	All,
	Squad,
	You,
	EMatchLogTab_MAX,
};

// Enum TslGame.EMatchLogRelative
enum class EMatchLogRelative : uint8 {
	None,
	You,
	Squad,
	Other,
	EMatchLogRelative_MAX,
};

// Enum TslGame.EMatchLogType
enum class EMatchLogType : uint8 {
	None,
	KillMessage,
	SystemMessage,
	EMatchLogType_MAX,
};

// Enum TslGame.ETslApRewardLogicType
enum class ETslApRewardLogicType : uint8 {
	None,
	Public,
	ETslApRewardLogicType_MAX,
};

// Enum TslGame.ETslBpRewardLogicType
enum class ETslBpRewardLogicType : uint8 {
	None,
	Public,
	ScoreBased,
	ETslBpRewardLogicType_MAX,
};

// Enum TslGame.ELobbyItemStateFlags
enum class ELobbyItemStateFlags : uint8 {
	Default,
	Vehicle_DoorOpened,
	ELobbyItemStateFlags_MAX,
};

// Enum TslGame.ELobbyCustomizingSlotType
enum class ELobbyCustomizingSlotType : uint8 {
	None,
	VehicleSlot,
	WeaponSlot,
	ELobbyCustomizingSlotType_MAX,
};

// Enum TslGame.EGamepadInputResponseForTapIconWidget
enum class EGamepadInputResponseForTapIconWidget : uint8 {
	None,
	Hold,
	DoubleTap,
	EGamepadInputResponseForTapIconWidget_MAX,
};

// Enum TslGame.EActionType
enum class EActionType : uint8 {
	Action,
	Axis,
	Action_Combo,
	EActionType_MAX,
};

// Enum TslGame.EEmergencyPickupState
enum class EEmergencyPickupState : uint8 {
	None,
	Prepare,
	Aircraft,
	EEmergencyPickupState_MAX,
};

// Enum TslGame.*7804c8a6e1
enum class *7804c8a6e1 : uint8 {
	*5f187418cb,
	*276035b966,
	*08a5e1e4ab,
	*98c4b588be,
	*d092e1008f,
	*7804c8a6e1_MAX,
};

// Enum TslGame.EGamepadInputResponseTypes
enum class EGamepadInputResponseTypes : uint8 {
	Pressed,
	Released,
	Tap,
	Hold,
	DoubleTap,
	EGamepadInputResponseTypes_MAX,
};

// Enum TslGame.ERadioMessagePresets
enum class ERadioMessagePresets : uint8 {
	Preset1,
	Preset2,
	ERadioMessagePresets_MAX,
};

// Enum TslGame.EGamepadPresets
enum class EGamepadPresets : uint8 {
	ControllerTypeA,
	ControllerTypeB,
	ControllerTypeC,
	CustomType,
	Max,
	EGamepadPresets_MAX,
};

// Enum TslGame.EKeyGuideShowCases
enum class EKeyGuideShowCases : uint8 {
	Reload,
	ExitVehicle,
	EKeyGuideShowCases_MAX,
};

// Enum TslGame.ETslInputModes
enum class ETslInputModes : uint8 {
	Toggle,
	Hold,
	DoubleTap,
	ETslInputModes_MAX,
};

// Enum TslGame.EGameplayClientReplay
enum class EGameplayClientReplay : uint8 {
	Replay,
	Killcam,
	KeyGuide,
	EGameplayClientReplay_MAX,
};

// Enum TslGame.*2f2d63c206
enum class *2f2d63c206 : uint8 {
	*cd1350da7b,
	*fb4059d0af,
	*2f2d63c206_MAX,
};

// Enum TslGame.EInputModeSettingActions
enum class EInputModeSettingActions : uint8 {
	Crouch,
	Prone,
	Walk,
	Sprint,
	HoldRotation,
	HoldBreath,
	Peek,
	Map,
	ADS,
	Aim,
	HoldAngled,
	EInputModeSettingActions_MAX,
};

// Enum TslGame.*62fed5afeb
enum class *62fed5afeb : uint8 {
	*20a9a6f95e,
	*3d289a77bd,
	*d03c4187d4,
	*62fed5afeb_MAX,
};

// Enum TslGame.EReportDetailCauseType
enum class EReportDetailCauseType : uint8 {
	None,
	AutoAim,
	NoRecoil,
	EspOrPenetration,
	Speedhack,
	WallPenetration,
	FlyingCar,
	Other,
	EReportDetailCauseType_MAX,
};

// Enum TslGame.EReportedSessionType
enum class EReportedSessionType : uint8 {
	PublicOrCustomGame,
	Killcam,
	Replay,
	EReportedSessionType_MAX,
};

// Enum TslGame.MatchResultTypeEnum
enum class MatchResultTypeEnum : uint8 {
	INVALID,
	DEFAULT,
	OBSERVER,
	ZOMBIE,
	LEAGUE,
	TYPE_NUM,
	MatchResultTypeEnum_MAX,
};

// Enum TslGame.EMarkStates
enum class EMarkStates : uint8 {
	Normal,
	Groggy,
	Dead,
	Vehicle,
	Parachute,
	Quitter,
	Aircraft,
	ItemRequest,
	EmergencyPickup,
	EMarkStates_MAX,
};

// Enum TslGame.ETeenageInfoType
enum class ETeenageInfoType : uint8 {
	Normal,
	Season,
	ETeenageInfoType_MAX,
};

// Enum TslGame.EGuideKeyType
enum class EGuideKeyType : uint8 {
	PickUp,
	Drop,
	QuickPickUp,
	QuickDrop,
	QuickPack,
	Equip,
	Unequip,
	Swap,
	Detach,
	Unpack,
	Use,
	SwitchSlot,
	Confirm,
	Cancel,
	Apply,
	Purchase,
	DetachAll,
	UnpackAll,
	PickUpAmount,
	DropAmount,
	SwapWeapon,
	DropWeapon,
	QuickEquip,
	QuickEquip_NoHold,
	MoveToTrunk,
	DropFromTrunk,
	VicinityToTrunk,
	WeaponToTrunk,
	Pack,
	Pack_NoHold,
	None,
	EGuideKeyType_MAX,
};

// Enum TslGame.EBlueBlockerStateUIType
enum class EBlueBlockerStateUIType : uint8 {
	None,
	Active,
	Deactive,
	Hide,
	EBlueBlockerStateUIType_MAX,
};

// Enum TslGame.EFiremode
enum class EFiremode : uint8 {
	FullAuto,
	ThreeRoundBurst,
	TwoRoundBurst,
	SemiAuto,
	Single,
	FullAutoFast,
	FullAuto_SG,
	ThreeRoundBurst_SG,
	SemiAuto_SG,
	EFiremode_MAX,
};

// Enum TslGame.ETraumaBagHealMode
enum class ETraumaBagHealMode : uint8 {
	NoHealItem,
	Bandage,
	FirstAidKit,
	Medkit,
	BattleReadyKit,
	MaxAndNone,
	ETraumaBagHealMode_MAX,
};

// Enum TslGame.EHeatState
enum class EHeatState : uint8 {
	Stable,
	IncreaseHeat,
	DecreaseHeat,
	OverHeated,
	CoolingDown,
	EHeatState_MAX,
};

// Enum TslGame.EKeyboardKeyIconDisplayType
enum class EKeyboardKeyIconDisplayType : uint8 {
	Tap,
	DoubleTap,
	Hold,
	EKeyboardKeyIconDisplayType_MAX,
};

// Enum TslGame.ETslHASInteractionState
enum class ETslHASInteractionState : uint8 {
	Normal,
	Buffed,
	Debuffed,
	Multiple,
	ETslHASInteractionState_MAX,
};

// Enum TslGame.ETslHASInteractionType
enum class ETslHASInteractionType : uint8 {
	None,
	Generator,
	Exit,
	Healing,
	BeingHealed,
	Chest,
	SelfHeal,
	Wiggle,
	Scoping,
	CabinetKnock,
	ETslHASInteractionType_MAX,
};

// Enum TslGame.ETslHASInteractionMethod
enum class ETslHASInteractionMethod : uint8 {
	None,
	Hand,
	Medkit,
	Toolbox,
	Win94,
	ETslHASInteractionMethod_MAX,
};

// Enum TslGame.EHASEndGamePhase
enum class EHASEndGamePhase : uint8 {
	NotStarted,
	Lv0,
	Lv1,
	Lv2,
	Lv3,
	Lv4,
	EHASEndGamePhase_MAX,
};

// Enum TslGame.*d012928124
enum class *d012928124 : uint8 {
	*47dc0d27ad,
	*4fc6f98475,
	*bb6b935fb6,
	*967136737c,
	*d012928124_MAX,
};

// Enum TslGame.EHASSeekerWeapon
enum class EHASSeekerWeapon : uint8 {
	None,
	Win94,
	Machete,
	StickyBomb,
	EHASSeekerWeapon_MAX,
};

// Enum TslGame.EConsoleHitDirections
enum class EConsoleHitDirections : uint8 {
	None,
	Front_Right,
	Front_Left,
	Rear,
	EConsoleHitDirections_MAX,
};

// Enum TslGame.EPresetNumSlotState
enum class EPresetNumSlotState : uint8 {
	Normal,
	Focus,
	Select,
	Lock,
	Disable,
	FocusConsole,
	SelectFocus,
	SelectFocusConsole,
	EPresetNumSlotState_MAX,
};

// Enum TslGame.ETslMapMarkerTowerState
enum class ETslMapMarkerTowerState : uint8 {
	Enable,
	Active,
	Disable,
	ETslMapMarkerTowerState_MAX,
};

// Enum TslGame.ETslNotificationMessageAnimationType
enum class ETslNotificationMessageAnimationType : uint8 {
	None,
	Appear,
	Loop,
	ETslNotificationMessageAnimationType_MAX,
};

// Enum TslGame.ETslNotificationMessageColorType
enum class ETslNotificationMessageColorType : uint8 {
	RichText,
	Default,
	Blue,
	Red,
	Yellow,
	ETslNotificationMessageColorType_MAX,
};

// Enum TslGame.ESoundType
enum class ESoundType : uint8 {
	Count,
	Start,
	ESoundType_MAX,
};

// Enum TslGame.ERoundEndPointType
enum class ERoundEndPointType : uint8 {
	Empty,
	Lost,
	Won,
	Draw,
	ERoundEndPointType_MAX,
};

// Enum TslGame.ETrainingInfoType
enum class ETrainingInfoType : uint8 {
	Latest,
	Best,
	ETrainingInfoType_MAX,
};

// Enum TslGame.ETrainingInfoSwitcherIndex
enum class ETrainingInfoSwitcherIndex : uint8 {
	Aim,
	Sound,
	ETrainingInfoSwitcherIndex_MAX,
};

// Enum TslGame.ELeaningState
enum class ELeaningState : uint8 {
	Normal,
	LeanLeft,
	LeanRight,
	ELeaningState_MAX,
};

// Enum TslGame.EEventBoostState
enum class EEventBoostState : uint8 {
	Normal,
	UsingBoost,
	CantUse,
	EEventBoostState_MAX,
};

// Enum TslGame.EVehicleAIAvoidanceMode
enum class EVehicleAIAvoidanceMode : uint8 {
	Off,
	SingleTrace,
	MultiTrace,
	EVehicleAIAvoidanceMode_MAX,
};

// Enum TslGame.ESpawnType
enum class ESpawnType : uint8 {
	Single,
	ContinuousOnTimer,
	ContinuousOnDeath,
	ESpawnType_MAX,
};

// Enum TslGame.*9c75caf959
enum class *9c75caf959 : uint8 {
	*61131e1d26,
	*8a28dfa617,
	*0d0333a6ca,
	*146b2faec1,
	*d856429ba6,
	*2cd381d273,
	*224cd7c953,
	*df859ceaee,
	*70a6e622ac,
	*c1f49b1929,
	*9c75caf959_MAX,
};

// Enum TslGame.*c35075e4ad
enum class *c35075e4ad : uint8 {
	*c9a707dc21,
	*2b14e63099,
	*b1e6eace61,
	*8f50b07b4c,
	*c35075e4ad_MAX,
};

// Enum TslGame.ESurfaceEffect
enum class ESurfaceEffect : uint8 {
	S_None,
	S_Concrete_Roll,
	S_Concrete_Skid,
	S_Concrete_Spin,
	S_Dirt_Roll,
	S_Dirt_Skid,
	S_Dirt_Spin,
	S_Water_Roll,
	S_Water_Skid,
	S_Water_Spin,
	S_Metal_Roll,
	S_Metal_Skid,
	S_Metal_Spin,
	S_Wood_Roll,
	S_Wood_Skid,
	S_Wood_Spin,
	S_Rock_Roll,
	S_Rock_Skid,
	S_Rock_Spin,
	S_Grass_Roll,
	S_Grass_Skid,
	S_Grass_Spin,
	S_Sand_Roll,
	S_Sand_Skid,
	S_Sand_Spin,
	S_Concrete_Brake,
	S_Dirt_Brake,
	S_Water_Brake,
	S_Metal_Brake,
	S_Wood_Brake,
	S_Rock_Brake,
	S_Grass_Brake,
	S_Sand_Brake,
	S_Snow_Brake,
	S_SnowRock_Brake,
	S_Ice_Brake,
	S_Common_BrakeDisc,
	S_Concrete_Punctured_Roll,
	S_Concrete_Punctured_Skid,
	S_Concrete_Punctured_Spin,
	S_Concrete_Punctured_Brake,
	S_Snow_Roll,
	S_Snow_Skid,
	S_Snow_Spin,
	S_SnowRock_Roll,
	S_SnowRock_Skid,
	S_SnowRock_Spin,
	S_Ice_Roll,
	S_Ice_Skid,
	S_Ice_Spin,
	S_Mud_Roll,
	S_Mud_Skid,
	S_Mud_Spin,
	S_Mud_Brake,
	S_Common_Neutral,
	S_MAX,
};

// Enum TslGame.EMortarWeaponInstallState
enum class EMortarWeaponInstallState : uint8 {
	None,
	InstallInprogress,
	InstallComplete,
	Installed,
	EMortarWeaponInstallState_MAX,
};

// Enum TslGame.EDeployState
enum class EDeployState : uint8 {
	INVALID,
	UNDEPLOYED,
	DEPLOYING,
	DEPLOYED,
	EDeployState_MAX,
};

// Enum TslGame.ERepairKitMode
enum class ERepairKitMode : uint8 {
	Helmet,
	Vest,
	None,
	ERepairKitMode_MAX,
};

// Enum TslGame.EWeaponAbilityType
enum class EWeaponAbilityType : uint8 {
	None,
	Digging,
	EWeaponAbilityType_MAX,
};

// Enum TslGame.*1c0db263c1
enum class *1c0db263c1 : uint8 {
	*0eaf973075,
	*ef2d50f889,
	*f4a8f394e5,
	*1c0db263c1_MAX,
};

// Enum TslGame.EInfoPointType
enum class EInfoPointType : uint8 {
	InfoPoint,
	ObjectPoint,
	SafePoint,
	BeachPoint,
	EInfoPointType_MAX,
};

// Enum TslGame.EBlendSequenceByBoolStartType
enum class EBlendSequenceByBoolStartType : uint8 {
	Restart,
	SameTime,
	EBlendSequenceByBoolStartType_MAX,
};

// Enum TslGame.EJumpStartAnimationType
enum class EJumpStartAnimationType : uint8 {
	Stationary,
	Forward,
	Backward,
	EJumpStartAnimationType_MAX,
};

// Enum TslGame.ERotateBoneInputType
enum class ERotateBoneInputType : uint8 {
	Rotator,
	AngleAxis,
	ERotateBoneInputType_MAX,
};

// Enum TslGame.ERotateBoneSpace
enum class ERotateBoneSpace : uint8 {
	BoneSpace,
	LocalSpace,
	WorldSpace,
	ERotateBoneSpace_MAX,
};

// Enum TslGame.ETslLocomotionNodeState
enum class ETslLocomotionNodeState : uint8 {
	Idle,
	Locomotion,
	Start,
	Stop_Left,
	Stop_Right,
	Pivot_Left,
	Pivot_Right,
	FastTurn_Pivot,
	ETslLocomotionNodeState_MAX,
};

// Enum TslGame.EGameStartupTimeRecordType
enum class EGameStartupTimeRecordType : uint8 {
	ExecPubgBegin,
	ClientBegin,
	MoviePlaying,
	MovieEnded,
	WelcomeScreenLoadStarted,
	WelcomeScreenLoadEnded,
	LobbyLoadStarted,
	LobbyLoadEnded,
	StartMoviePlaying,
	StartMovieEnded,
	Count,
	SkipPrevRecord,
	EGameStartupTimeRecordType_MAX,
};

// Enum TslGame.*d6d56f23e0
enum class *d6d56f23e0 : uint8 {
	*e532b80334,
	*b021e7572a,
	*de1bb40210,
	*5889d250a5,
	*d6d56f23e0_MAX,
};

// Enum TslGame.EReportCause
enum class EReportCause : uint8 {
	Default,
	Cheat,
	TeamKill,
	Teaming,
	InappropriateID,
	VerbalHarassment,
	Griefing,
	StreamSniping,
	InappropriateClanTag,
	Abusing,
	MarketingSpamming,
	EReportCause_MAX,
};

// Enum TslGame.ItemPackageType
enum class ItemPackageType : uint8 {
	None,
	RootBox,
	CarePackage,
	DroppedEventPackage,
	VehicleTrunk,
	ItemPackageType_MAX,
};

// Enum TslGame.ECarePackageIconType
enum class ECarePackageIconType : uint8 {
	Normal,
	Flying,
	Opened,
	ECarePackageIconType_MAX,
};

// Enum TslGame.EVehicleRideType
enum class EVehicleRideType : uint8 {
	None,
	Normal,
	Aircraft,
	Mortar,
	EVehicleRideType_MAX,
};

// Enum TslGame.ECharacterIconType
enum class ECharacterIconType : uint8 {
	Normal,
	Vehicle,
	Parachute,
	Die,
	Groggy,
	Quitter,
	Observer,
	Aircraft,
	EmergencyPickup,
	ECharacterIconType_MAX,
};

// Enum TslGame.EReportUiType
enum class EReportUiType : uint8 {
	Normal,
	Respawn,
	EReportUiType_MAX,
};

// Enum TslGame.EZombieRuleType
enum class EZombieRuleType : uint8 {
	None,
	BattleRoyale,
	Survival,
	Elimination,
	EZombieRuleType_MAX,
};

// Enum TslGame.EZombieModePlayerState
enum class EZombieModePlayerState : uint8 {
	None,
	Human,
	ReadyToRevive,
	Zombie,
	EZombieModePlayerState_MAX,
};

// Enum TslGame.ETeamChangeZombieMode
enum class ETeamChangeZombieMode : uint8 {
	None,
	LeaveTeam,
	JoinTeam,
	ETeamChangeZombieMode_MAX,
};

// Enum TslGame.*4cbc855d82
enum class *4cbc855d82 : uint8 {
	*6ef6facdd4,
	*a6cdba168a,
	*aec1321f33,
	*1de6341e10,
	*6e4b4b07ff,
	*0887b77b15,
	*4cbc855d82_MAX,
};

// Enum TslGame.EObserverCameraMode
enum class EObserverCameraMode : uint8 {
	FixedCamera,
	FreeCamera,
	PlayerCamera,
	FollowCamera,
	EObserverCameraMode_MAX,
};

// Enum TslGame.EObserverAuthorityType
enum class EObserverAuthorityType : uint8 {
	None,
	FromBeginning,
	AfterDeath,
	AfterExtermination,
	ArenaModeEagleEye,
	EagleEye,
	EObserverAuthorityType_MAX,
};

// Enum TslGame.*3dd8d57092
enum class *3dd8d57092 : uint8 {
	*e354d95074,
	*1ed6505c0c,
	*1636acd66f,
	*3dd8d57092_MAX,
};

// Enum TslGame.EGameModeType
enum class EGameModeType : uint8 {
	BattleRoyale,
	War,
	TDM,
	Zombie,
	ZombieDefense,
	Conquest,
	Training,
	ESports,
	Arena,
	Challenger,
	ZoneTag,
	OneShot,
	Racing,
	Futsal,
	AtoZTutorial,
	ChickenRoyale,
	HAS,
	IntenseBattleRoyale,
	OverPower,
	Bomb,
	SLB,
	None,
	EGameModeType_MAX,
};

// Enum TslGame.EValueType
enum class EValueType : uint8 {
	Float,
	Int,
	String,
	Bool,
	EValueType_MAX,
};

// Enum TslGame.*8efa41bcb0
enum class *8efa41bcb0 : uint8 {
	*5142778fa1,
	*67f9da9666,
	*a30a8bf325,
	*a0d73748d4,
	*fe921ed0df,
	*8efa41bcb0_MAX,
};

// Enum TslGame.*db660ae7a4
enum class *db660ae7a4 : uint8 {
	*cfb8a91c56,
	*a6f1d83ebb,
	*03b731c4c5,
	*db660ae7a4_MAX,
};

// Enum TslGame.ENearClippingLevel
enum class ENearClippingLevel : uint8 {
	Default,
	Low,
	Middle,
	High,
	ENearClippingLevel_MAX,
};

// Enum TslGame.EThingSpotGroupType
enum class EThingSpotGroupType : uint8 {
	GroupA,
	GroupB,
	GroupC,
	GroupD,
	GroupE,
	GroupF,
	GroupG,
	GroupH,
	GroupI,
	GroupJ,
	GroupK,
	GroupL,
	GroupM,
	GroupN,
	GroupO,
	GroupP,
	GroupQ,
	GroupR,
	GroupS,
	GroupT,
	GroupU,
	GroupV,
	GroupW,
	GroupX,
	GroupY,
	GroupZ,
	MAX,
	EThingSpotGroupType_MAX,
};

// Enum TslGame.EPhysMaterialType
enum class EPhysMaterialType : uint8 {
	Unknown,
	Asphalt,
	Dirt,
	Water,
	Wood,
	Stone,
	Metal,
	EPhysMaterialType_MAX,
};

// Enum TslGame.EUIAkEvent
enum class EUIAkEvent : uint8 {
	None,
	HoverWeak,
	HoverMedium,
	SettingSlider,
	Confirm,
	Cancel,
	PopupModal,
	SystemMessage,
	EUIAkEvent_MAX,
};

// Enum TslGame.EEquipableItemSoundType
enum class EEquipableItemSoundType : uint8 {
	None,
	Vest,
	LongCoat,
	HipSack,
	Cloth,
	BackPack,
	MilitaryShoes,
	Sneakers,
	EEquipableItemSoundType_MAX,
};

// Enum TslGame.EEquipableItemSoundGroup
enum class EEquipableItemSoundGroup : uint8 {
	Default,
	Shoes,
	EEquipableItemSoundGroup_MAX,
};

// Enum TslGame.EColorBlindType
enum class EColorBlindType : uint8 {
	Normal,
	Deuteranopia,
	Protanopia,
	Tritanopia,
	EColorBlindType_MAX,
};

// Enum TslGame.EFrameRateLimitType
enum class EFrameRateLimitType : uint8 {
	Unlimited,
	Fixed_31,
	Fixed_61,
	Customizable,
	DisplayBased,
	EFrameRateLimitType_MAX,
};

// Enum TslGame.ETslOutGameCloudRequestErrorType
enum class ETslOutGameCloudRequestErrorType : uint8 {
	Unknown,
	InternalError,
	ServerError,
	RequestTimedOut,
	DataCorrupted,
	CompressionFailed,
	DecompressionFailed,
	ETslOutGameCloudRequestErrorType_MAX,
};

// Enum TslGame.ETslOutGameCloudRequestType
enum class ETslOutGameCloudRequestType : uint8 {
	Invalid,
	SaveToCloud,
	LoadFromCloud,
	ETslOutGameCloudRequestType_MAX,
};

// Enum TslGame.ETslPhysMaterialType
enum class ETslPhysMaterialType : uint8 {
	Unknown,
	Concrete,
	Dirt,
	Water,
	Metal,
	Wood,
	Grass,
	Glass,
	Flesh,
	ETslPhysMaterialType_MAX,
};

// Enum TslGame.ETppAimCameraPosition
enum class ETppAimCameraPosition : uint8 {
	LatestAimPosition,
	LastPeekingPosition,
	ResetToRightShoulderPosition,
	ResetToLeftShoulderPosition,
	ETppAimCameraPosition_MAX,
};

// Enum TslGame.EAccessorySlot
enum class EAccessorySlot : uint8 {
	Slot_Primary,
	Slot_Secondary,
	Slot_SideArm,
	Slot_Melee,
	Slot_Thrown,
	Slot_Belt,
	Slot_None,
	Slot_MAX,
};

// Enum TslGame.EInventoryListPackageType
enum class EInventoryListPackageType : uint8 {
	CarePackage,
	InventoryOrDeathDropPackage,
	TrunkPackage,
	ItemPackage,
	Ground,
	TacPack,
	UnlockableItemPackage,
	Max,
	EInventoryListPackageType_MAX,
};

// Enum TslGame.EInventorySlotType
enum class EInventorySlotType : uint8 {
	Vicinity,
	Inventory,
	Crafting,
	Shop,
	Equipment,
	Weapon,
	Max,
	EInventorySlotType_MAX,
};

// Enum TslGame.ELobbyCharacterCameraType
enum class ELobbyCharacterCameraType : uint8 {
	None,
	WholeBodyCamera,
	TopCamera,
	HeadCamera,
	BodyCamera,
	LegCamera,
	FootCamera,
	Max,
	ELobbyCharacterCameraType_MAX,
};

// Enum TslGame.EAnimWeaponSpecificClass
enum class EAnimWeaponSpecificClass : uint8 {
	None,
	EAnimWeaponSpecificClass_MAX,
};

// Enum TslGame.EContinuousHealItem
enum class EContinuousHealItem : uint8 {
	Continuous_On,
	Bandaged_Only,
	Continuous_Off,
	EContinuousHealItem_MAX,
};

// Enum TslGame.EWeaponDisplayTypes
enum class EWeaponDisplayTypes : uint8 {
	None,
	Handgun,
	SMG,
	AR,
	Shotgun,
	SR,
	DMR,
	LMG,
	AMR,
	Melee,
	Throwable,
	Shield,
	Crossbow,
	Launcher,
	GrenadeLauncher,
	Mortar,
	TacticalGear,
	FlareGun,
	Special,
	EWeaponDisplayTypes_MAX,
};

// Enum TslGame.EWeaponClass
enum class EWeaponClass : uint8 {
	Class_None,
	Class_Pistol,
	Class_SMG,
	Class_Rifle,
	Class_Carbine,
	Class_Shotgun,
	Class_Sniper,
	Class_DMR,
	Class_LMG,
	Class_Melee,
	Class_Throwable,
	Class_Shield,
	Class_Crossbow,
	Class_Launcher,
	Class_GrenadeLauncher,
	Class_Mortar,
	EWeaponClass_MAX,
};

// Enum TslGame.EAllowedThrowMode
enum class EAllowedThrowMode : uint8 {
	Any,
	ThrowHigh,
	ThrowLow,
	EAllowedThrowMode_MAX,
};

// Enum TslGame.*207b4837ad
enum class *207b4837ad : uint8 {
	*9625a6a8d6,
	*9b8109adc7,
	*27c39f7da3,
	*207b4837ad_MAX,
};

// Enum TslGame.EAttachmentCalculateType
enum class EAttachmentCalculateType : uint8 {
	Addition,
	Multiply,
	EAttachmentCalculateType_MAX,
};

// Enum TslGame.EAutoEquipAttachmentForScopeMode
enum class EAutoEquipAttachmentForScopeMode : uint8 {
	Off,
	Sight_Only,
	ALL,
	EAutoEquipAttachmentForScopeMode_MAX,
};

// Enum TslGame.ECustomPartType
enum class ECustomPartType : uint8 {
	Vehicle,
	ECustomPartType_MAX,
};

// Enum TslGame.EItemCategory
enum class EItemCategory : uint8 {
	None,
	Equipment,
	Weapon,
	Attachment,
	Ammunition,
	Use,
	Skin,
	Event,
	Part,
	EItemCategory_MAX,
};

// Enum TslGame.EFiringMode
enum class EFiringMode : uint8 {
	Normal,
	Burst,
	FullAuto,
	FullAutoFast,
	EFiringMode_MAX,
};

// Enum TslGame.ECharacterGait
enum class ECharacterGait : uint8 {
	Walk,
	Run,
	Sprint,
	ECharacterGait_MAX,
};

// Enum TslGame.EWeaponHand
enum class EWeaponHand : uint8 {
	Left,
	Right,
	Total,
	EWeaponHand_MAX,
};

// Enum TslGame.EWeaponArmState
enum class EWeaponArmState : uint8 {
	None,
	NotArmed,
	Arming,
	Armed,
	UnArming,
	EWeaponArmState_MAX,
};

// Enum TslGame.*fa8d79ba4a
enum class *fa8d79ba4a : uint8 {
	*03436cd557,
	*eb5bf88e98,
	*ca9af4cd4e,
	*fa8d79ba4a_MAX,
};

// Enum TslGame.EAnimVehicleSeatType
enum class EAnimVehicleSeatType : uint8 {
	Rider,
	Pillion,
	VehicleDriver,
	VehiclePassenger,
	Pilot,
	AircraftPassenger,
	GliderPassenger,
	EAnimVehicleSeatType_MAX,
};

// Enum TslGame.ETurningDirection
enum class ETurningDirection : uint8 {
	None,
	Right_46,
	Right_91,
	Right_136,
	Right_181,
	Left_46,
	Left_91,
	Left_136,
	Left_181,
	ETurningDirection_MAX,
};

// Enum TslGame.*accf4f7b0b
enum class *accf4f7b0b : uint8 {
	*f0de7751cc,
	*2c123944ad,
	*f0b76c5e23,
	*8eea95f548,
	*158218b3ac,
	*efdcd8ec0c,
	*dc2f9ed840,
	*4a903e7fda,
	*5ad3471036,
	*accf4f7b0b_MAX,
};

// Enum TslGame.EAnimStance
enum class EAnimStance : uint8 {
	Stand,
	Crouch,
	Prone,
	Groggy,
	EAnimStance_MAX,
};

// Enum TslGame.EAnimWeaponType
enum class EAnimWeaponType : uint8 {
	None,
	Rifle,
	Launcher,
	Pistol,
	Throwable,
	SpikeTrap,
	Melee,
	Shield,
	Mortar,
	MAX,
	EAnimWeaponType_MAX,
};

// Enum TslGame.*fa2ebbe8e1
enum class *fa2ebbe8e1 : uint8 {
	*b76bcf07a8,
	*1b495ac6cf,
	*c7ba55708d,
	*fa2ebbe8e1_MAX,
};

// Enum TslGame.EBlueZoneInductorState
enum class EBlueZoneInductorState : uint8 {
	None,
	Banned_SafeZoneRecon_ByModeSetting,
	Banned_SafeZoneFlare_ByModeSetting,
	BannedBy_ModeSetting,
	Banned_SafeZoneRecon_ByOtherInductor,
	Banned_SafeZoneRecon,
	Banned_SafeZoneFlare_ByOtherInductor,
	Banned_SafeZoneFlare,
	BannedBy_OtherInductor,
	Banned_AnyType,
	ActiveBy_SafeZoneRecon,
	ActiveBy_SafeZoneFlare,
	ActiveBy_MagneticInductor,
	ActiveBy_AnyReason,
	EBlueZoneInductorState_MAX,
};

// Enum TslGame.ECameraViewBehaviour
enum class ECameraViewBehaviour : uint8 {
	FpsAndTps,
	FpsOnly,
	TpsOnly,
	ECameraViewBehaviour_MAX,
};

// Enum TslGame.EPlayerStartType
enum class EPlayerStartType : uint8 {
	OnePlace,
	SeveralPlace,
	EPlayerStartType_MAX,
};

// Enum TslGame.EMatchStartType
enum class EMatchStartType : uint8 {
	Normal,
	Airborne,
	Monster,
	EMatchStartType_MAX,
};

// Enum TslGame.EGender
enum class EGender : uint8 {
	Male,
	Female,
	EGender_MAX,
};

// Enum TslGame.EThermalItemType
enum class EThermalItemType : uint8 {
	Character,
	Vehicle,
	Blood,
	Fire,
	Ghillie,
	CountOrNone,
	EThermalItemType_MAX,
};

// Enum TslGame.ETslDestructibleObjectType
enum class ETslDestructibleObjectType : uint8 {
	None,
	JerryCan,
	BulletproofShield,
	Window,
	Door,
	Fence,
	Hay,
	Camera,
	Bamboo,
	Helmet,
	Vehicle,
	Wheel,
	Land,
	BirdCage,
	JukeBox,
	ETslDestructibleObjectType_MAX,
};

// Enum TslGame.*7db39c4871
enum class *7db39c4871 : uint8 {
	*e980382770,
	*9f5a25fb3c,
	*7b9b642108,
	*52c401a14a,
	*e359d456b3,
	*7db39c4871_MAX,
};

// Enum TslGame.ESpecialEquipmentType
enum class ESpecialEquipmentType : uint8 {
	Default,
	BluezoneBlocker,
	EmergencyParachute,
	Toolbox,
	TacPack,
	TraumaBag,
	SoftRole,
	ESpecialEquipmentType_MAX,
};

// Enum TslGame.EEquipableItemLevelType
enum class EEquipableItemLevelType : uint8 {
	None,
	Level1,
	Level2,
	Level3,
	Level4,
	EEquipableItemLevelType_MAX,
};

// Enum TslGame.EConstraintSlotType
enum class EConstraintSlotType : uint8 {
	Block,
	Hide,
	Max,
	EConstraintSlotType_MAX,
};

// Enum TslGame.*ae19195785
enum class *ae19195785 : uint8 {
	*3337bc06c2,
	*25d032b587,
	*6f647489c4,
	*ae19195785_MAX,
};

// Enum TslGame.*7ce5595ebb
enum class *7ce5595ebb : uint8 {
	*fae0c07e24,
	*edac7c9095,
	*c5881ffce6,
	*ded02e8c41,
	*4c41d9076f,
	*7ce5595ebb_MAX,
};

// Enum TslGame.EItemSpotGroupType
enum class EItemSpotGroupType : uint8 {
	GroupA,
	GroupB,
	GroupC,
	GroupD,
	GroupE,
	GroupF,
	GroupG,
	GroupH,
	GroupI,
	GroupJ,
	GroupK,
	GroupL,
	GroupM,
	GroupN,
	GroupO,
	GroupP,
	GroupQ,
	GroupR,
	GroupS,
	GroupT,
	GroupU,
	GroupV,
	GroupW,
	GroupX,
	GroupY,
	GroupZ,
	MAX,
	EItemSpotGroupType_MAX,
};

// Enum TslGame.EItemSpotType
enum class EItemSpotType : uint8 {
	TypeA,
	TypeB,
	TypeC,
	TypeD,
	TypeE,
	TypeF,
	TypeG,
	TypeH,
	TypeI,
	TypeJ,
	TypeK,
	TypeL,
	TypeM,
	TypeN,
	TypeO,
	TypeP,
	TypeQ,
	TypeR,
	TypeS,
	TypeT,
	TypeU,
	TypeV,
	TypeW,
	TypeX,
	TypeY,
	TypeZ,
	MAX,
	EItemSpotType_MAX,
};

// Enum TslGame.EItemOverrideType
enum class EItemOverrideType : uint8 {
	NONE,
	TypeA,
	TypeB,
	TypeC,
	TypeD,
	TypeE,
	TypeF,
	TypeG,
	TypeH,
	TypeI,
	TypeJ,
	TypeK,
	TypeL,
	TypeM,
	TypeN,
	EItemOverrideType_MAX,
};

// Enum TslGame.ECastableItemType
enum class ECastableItemType : uint8 {
	None,
	Bandage,
	FirstAid,
	Medkit,
	BattleReadyKit,
	EnergyDrink,
	Painkiller,
	Adrenaline,
	GasCan,
	Battery,
	Key,
	EmergencyPickup,
	SelfRevive,
	Ascender,
	RevivalTransmitter,
	TacticalGear,
	Bicycle,
	SkinVehicle,
	Buff,
	Bluechip,
	ECastableItemType_MAX,
};

// Enum TslGame.ECastLevel
enum class ECastLevel : uint8 {
	None,
	NoRestriction,
	Restriction,
	OnlyRotationRestriction,
	ECastLevel_MAX,
};

// Enum TslGame.ECastPriority
enum class ECastPriority : uint8 {
	None,
	Low,
	Normal,
	High,
	Max,
	ECastPriority_MAX,
};

// Enum TslGame.ELobbyItemPointSellingType
enum class ELobbyItemPointSellingType : uint8 {
	Normal,
	WeeklyDouble,
	ELobbyItemPointSellingType_MAX,
};

// Enum TslGame.ELobbyItemPlatform
enum class ELobbyItemPlatform : uint8 {
	PC_Steam,
	PC_NonSteam,
	Xbox,
	ELobbyItemPlatform_MAX,
};

// Enum TslGame.ELobbyItemTier
enum class ELobbyItemTier : uint8 {
	Basic,
	Common,
	Classic,
	Special,
	Rare,
	Elite,
	Epic,
	Legendary,
	Ultimate,
	Event,
	ELobbyItemTier_MAX,
};

// Enum TslGame.ELobbyItemCategory
enum class ELobbyItemCategory : uint8 {
	Belt,
	Body,
	Eyes,
	Feet,
	Head,
	Jacket,
	Legs,
	Mask,
	Hands,
	Box,
	Key,
	WeaponSkin,
	ParachuteSkin,
	HelmetSkin,
	BackpackSkin,
	TorsoArmorSkin,
	VehicleSkin,
	Multislot,
	ELobbyItemCategory_MAX,
};

// Enum TslGame.EDamageVictimActorType
enum class EDamageVictimActorType : uint8 {
	Default,
	Character,
	Vehicle,
	Wheel,
	DestructibleActor,
	ExplosiveItem,
	DummyAI,
	EDamageVictimActorType_MAX,
};

// Enum TslGame.EVehicleConvertState
enum class EVehicleConvertState : uint8 {
	None,
	Play,
	Cancel,
	Finish,
	EVehicleConvertState_MAX,
};

// Enum TslGame.EVehiclePartType
enum class EVehiclePartType : uint8 {
	BodyColor,
	WheelColor,
	BrakeCaliperColor,
	BoostEffect,
	WheelMesh,
	PinstripeColor,
	Spoiler,
	EVehiclePartType_MAX,
};

// Enum TslGame.*a39982f5b1
enum class *a39982f5b1 : uint8 {
	*40365d816b,
	*9bdfa0b366,
	*0891ab780d,
	*c5e0c86f44,
	*a39982f5b1_MAX,
};

// Enum TslGame.*34a832a87c
enum class *34a832a87c : uint8 {
	*16a46e8df3,
	*4e4c89c27c,
	*e13d7e68f2,
	*d844357a40,
	*9aa5d8424f,
	*c2a3a53f7a,
	*4cfb97f747,
	*f27a786c97,
	*91f9f5bf9d,
	*6c4e491f59,
	*d593eae799,
	*6f81545ea5,
	*a65487fcb8,
	*32ea63ce77,
	*839cca249f,
	*6f0b1467b0,
	*be919f57b2,
	*666c520506,
	*5fe829642d,
	*ee0a70f1bf,
	*50ea1a5e14,
	*436f00826a,
	*817287d8e5,
	*f6b35b3531,
	*c379e6d9c8,
	*5ae6cd0576,
	*d538581776,
	*f5ade1f37f,
	*8cd136bf13,
	*8bb27d23ef,
	*8dd010fe29,
	*c64772f602,
	*a36a93da43,
	*91fc62c7dc,
	*60b963d318,
	*96c34739f8,
	*363e2958b6,
	*24a6205407,
	*6e9843e588,
	*21f835cbc3,
	*8009a3d21a,
	*5a709dd921,
	*497fb143ca,
	*1a69cbf605,
	*2c0d2554b6,
	*e9a0781634,
	*8fb6eebbea,
	*2073fe2797,
	*2f502f2b65,
	*5f7c76c636,
	*3e29319900,
	*5889a3b780,
	*55c9ab8e24,
	*6478272fcb,
	*9e69a31b43,
	*34a832a87c_MAX,
};

// Enum TslGame.*d3b91baf28
enum class *d3b91baf28 : uint8 {
	*229757a144,
	*eadbfa72fc,
	*0c5d3f19eb,
	*d874e64f9e,
	*d3b91baf28_MAX,
};

// Enum TslGame.ERiderType
enum class ERiderType : uint8 {
	Driver,
	Passenger,
	ERiderType_MAX,
};

// Enum TslGame.EStatTrakState
enum class EStatTrakState : uint8 {
	Run,
	Locked,
	Error,
	EStatTrakState_MAX,
};

// Enum TslGame.*3d2bec6659
enum class *3d2bec6659 : uint8 {
	*0937aca5e0,
	*253b6a6b7d,
	*daaca6906e,
	*4ee9c52e41,
	*046e1d45e4,
	*3d2bec6659_MAX,
};

// Enum TslGame.ESkinMeshType
enum class ESkinMeshType : uint8 {
	SkeletalMesh,
	AsyncStaticMesh,
	StaticMesh,
	ESkinMeshType_MAX,
};

// Enum TslGame.EVehicleSkinCategory
enum class EVehicleSkinCategory : uint8 {
	None,
	FourSeaterSUV,
	FourSeaterSedan,
	TwoSeaterSportsCar,
	TwoSeaterMotorbike,
	EVehicleSkinCategory_MAX,
};

// Enum TslGame.ESkinCategory
enum class ESkinCategory : uint8 {
	Skin_None,
	Skin_Equipment,
	Skin_Parachute,
	Skin_Weapon,
	Skin_MeleeWeapon,
	Skin_Vehicle,
	Skin_Throwable,
	Skin_MAX,
};

// Enum TslGame.EBuffOverlapSolveMethod
enum class EBuffOverlapSolveMethod : uint8 {
	IgnoreLater,
	Overwrite,
	RestartTimer,
	Stack,
	EBuffOverlapSolveMethod_MAX,
};

// Enum TslGame.*908bd88e5f
enum class *908bd88e5f : uint8 {
	*6a045bc44c,
	*82940e9252,
	*d5d3bf07ff,
	*f3968fd22f,
	*908bd88e5f_MAX,
};

// Enum TslGame.EVaultAnimType
enum class EVaultAnimType : uint8 {
	VaultNone,
	Vault200_Stationary,
	Vault200_Mobile,
	Vault200_Narrow,
	Vault160_Stationary,
	Vault160_Mobile,
	Vault160_Narrow,
	Vault120_Stationary,
	Vault120_Mobile,
	Vault120_Slide,
	Vault120_Narrow,
	Vault90_Stationary,
	Vault90_Mobile,
	Vault90_Slide,
	Vault90_Narrow,
	Climb200_Stationary,
	Climb200_Mobile,
	Climb200_Slide,
	Climb200_Narrow,
	Climb160_Stationary,
	Climb160_Mobile,
	Climb160_Slide,
	Climb160_Narrow,
	Climb120_Stationary,
	Climb120_Mobile,
	Climb120_Slide,
	Climb120_Narrow,
	Climb90_Stationary,
	Climb90_Mobile,
	Climb90_Slide,
	Climb90_Narrow,
	Vault90Roll,
	Vault120Window,
	Vault60_Stationary,
	Vault60_Mobile,
	Vault60_Slide,
	Vault60_Narrow,
	Climb60_Stationary,
	Climb60_Mobile,
	Climb60_Narrow,
	LedgeGrab_Up_Climb,
	LedgeGrab_Up_Climb_Swing,
	LedgeGrab_Up_Climb_HalfSwing,
	LedgeGrab_Up_Vault,
	LedgeGrab_Up_Vault_Swing,
	LedgeGrab_Up_Vault_HalfSwing,
	LedgeGrab_High_Climb,
	LedgeGrab_High_Climb_Swing,
	LedgeGrab_High_Climb_HalfSwing,
	LedgeGrab_High_Vault,
	LedgeGrab_High_Vault_Swing,
	LedgeGrab_High_Vault_HalfSwing,
	LedgeGrab_Low_Climb,
	LedgeGrab_Low_Climb_Swing,
	LedgeGrab_Low_Climb_HalfSwing,
	LedgeGrab_Low_Vault,
	LedgeGrab_Low_Vault_Swing,
	LedgeGrab_Low_Vault_HalfSwing,
	LedgeGrab_Low_Vault_Narrow,
	LedgeGrab_Low_Vault_HalfSwing_Narrow,
	LedgeGrab_Low_Vault_Swing_Narrow,
	LedgeGrab_High_Vault_Narrow,
	LedgeGrab_High_Vault_HalfSwing_Narrow,
	LedgeGrab_High_Vault_Swing_Narrow,
	LedgeGrab_Up_Vault_Narrow,
	LedgeGrab_Up_Vault_HalfSwing_Narrow,
	LedgeGrab_Up_Vault_Swing_Narrow,
	EVaultAnimType_MAX,
};

// Enum TslGame.ECollisionProfileType
enum class ECollisionProfileType : uint8 {
	Profiles,
	DefaultChannelResponses,
	EditProfiles,
	ProfileRedirects,
	CollisionChannelRedirects,
	ECollisionProfileType_MAX,
};

// Enum TslGame.EMovingState
enum class EMovingState : uint8 {
	Walk,
	Run,
	Sprint,
	EMovingState_MAX,
};

// Enum TslGame.EPlayerInputType
enum class EPlayerInputType : uint8 {
	KeyboardMouse,
	Gamepad,
	Mixed,
	EPlayerInputType_MAX,
};

// Enum TslGame.EAntiCheatKickType
enum class EAntiCheatKickType : uint8 {
	Default,
	HWID,
	MouseMacro,
	InGame,
	BattleEye,
	EAntiCheatKickType_MAX,
};

// Enum TslGame.ECheatType
enum class ECheatType : uint8 {
	None,
	SpeedHack,
	IgnoreWall_Hit,
	IgnoreWall_Sight,
	IgnoreVelocity_Hit,
	IgnoreVelocity,
	IgnoreVelocity2,
	ItemPackage,
	CarePackageMount,
	Aimbot,
	VerifyLagSwitch,
	InvalidNetConnectionClose,
	InvalidImpact,
	InvalidImpactZ,
	InvalidImpact_Gun_C,
	InvalidOrigin_Melee,
	InvalidOrigin_Throwable,
	InvalidOrigin_MeleeThrow,
	InvalidSimStep_MeleeThrow,
	InvalidRange,
	InvalidRange2,
	InvalidRange_MeleeThrow,
	InvalidImpact_Adjusted,
	InvalidImpactZ_Adjusted,
	InvalidImpact_Gun_C_Adjusted,
	InvalidOrigin_Melee_Adjusted,
	InvalidOrigin_MeleeThrow_Adjusted,
	InvalidOrigin_Gun_C_Adjusted,
	InvalidRange2_Adjusted,
	InvalidReviving,
	InvalidKick,
	InvalidA0,
	InvalidB1,
	InvalidB1_2,
	InvalidH0,
	InvalidOrigin_Gun_C,
	InvalidD0,
	InvalidS0,
	InvalidH1,
	InvalidH2,
	InvalidH3,
	InvalidC0,
	InvalidC1,
	InvalidC2,
	InvalidC3,
	InvalidC4,
	InvalidC5,
	InvalidC6,
	InvalidC7,
	InvalidT0,
	InvalidT1,
	InvalidT2,
	InvalidAimDir,
	InvalidPelletDir,
	InvalidAmmoSpeed,
	InvalidAmmoDir,
	InvalidCharacterFlag,
	InvalidCharacterXRay,
	InvalidPropertyCrc,
	InvalidWeaponCrc,
	InvalidWeaponRecoil,
	InvalidSwayBuffer,
	InvalidCameraYaw,
	InvalidWeaponPackageCrc,
	InvalidWeaponFlag,
	InvalidHitComponent,
	InvalidCollisionProfileCrc,
	InvalidPakListCrc,
	InvalidCharacterCrc,
	InvalidHitLocation,
	InvalidSight,
	InvalidBackface,
	InvalidMovementCurveCrc,
	InvalidDriverFire,
	InvalidVehicleOverlap,
	InvalidViewRotation,
	InvalidPenetration,
	InvalidPunchSpeed,
	CHKSUM_PUNCH,
	CHKSUM_MELEE,
	CHKSUM_A0,
	CHKSUM_T0,
	CHKSUM_S0,
	CHKSUM_D0,
	CHKSUM_V0,
	CHKSUM_W0,
	CHKSUM_T1,
	CHKSUM_D1,
	CHKSUM_CD,
	CHKSUM_LC,
	CHKSUM_P0,
	CHKSUM_BP,
	CHKSUM_G1,
	CHKSUM_H2,
	CHKSUM_H3,
	CHKSUM_UO,
	CHKSUM_UF,
	VHC_RI,
	VHC_MG_FF,
	VHC_MG_FC,
	VHC_MG_SW,
	VHC_MG_OS,
	VHC_MG_BC,
	VHC_MG_TC,
	VHC_MG_PL,
	VHC_MG_HL,
	VHC_MG_SD,
	VHC_MG_AA,
	VHC_MG_AV,
	VHC_MG_AD,
	VHC_MGB_FF,
	VHC_MGB_FC,
	VHC_MGB_OS,
	VHC_MGB_BC,
	VHC_MGB_TC,
	VHC_MGB_PL,
	VHC_MGB_HL,
	VHC_MGB_AA,
	VHC_MGB_AV,
	VHC_MGB_AD,
	VHC_MGF_OS,
	VHC_MGF_TC,
	VHC_MGF_BC,
	VHC_MGF_SD,
	VHC_MGF_AA,
	VHC_MGF_AV,
	VHC_KILL,
	VHC_ED,
	VHC_SERVERSIMUL,
	VHC_SIMULATION_ACTIVATE,
	VHC_SIMULATION_DEACTIVATE,
	VHC_TRY_BYPASS_SERVERSIMUL,
	VHC_BYPASSED_SERVERSIMUL,
	VHC_FORCE_SERVERSIMUL,
	CK_ACTIVATE,
	CK_DEACTIVATE,
	AntiCheatKick_WallHack,
	AntiCheatKick_ESP,
	AntiCheatKick_SpeedHack1,
	AntiCheatKick_SpeedHack2,
	AntiCheatKick_SpeedHack3,
	AntiCheatKick_PLFC,
	AntiCheatKick_TCFC,
	AntiCheatKick_HL,
	AntiCheatKick_OS,
	AntiCheatKick_FC,
	AntiCheatKick_SV,
	VehicleSimulation_PLFC,
	VehicleSimulation_TCFC,
	VehicleSimulation_HL,
	VehicleSimulation_OS,
	VehicleSimulation_FC,
	CC_ACTIVATE,
	CC_DEACTIVATE,
	CC_FORCE_ERROR_CORRECTION,
	FLC_ACTIVATE,
	FLC_DEACTIVATE,
	FallingCorrection,
	VaultingCorrection,
	QS_AJ,
	QS_VZ,
	KGB_AF,
	InputLog,
	FireInputLog,
	ESPLog,
	ESPRatioLog,
	IsEnabledAntiESP,
	HighLocationVehicle,
	HighLocationBoat,
	UnderLandscapeBoat,
	UnderLandscapeCharacter,
	InsideMeshCharacter,
	BC_BoatCorrection,
	HBR_InvalidDashDistance,
	UNC_ACTIVATE,
	UNC_DEACTIVATE,
	UncAddUserFail,
	UncSetUserInfoFail,
	UncDeleteUserFail,
	UncGetCookieFail,
	UncCookieVerifyFail,
	UncCookieNotRespond,
	DESP_SelfInfo,
	DESP_SelfInvalidCheckSum,
	DESP_SelfInvalidCount,
	DESP_RemoteInfo,
	DESP_RemoteInvalidCheckSum,
	HitInSmoke,
	BoneFocusedShoot,
	CenterFocusedShoot,
	Combination_Undefined,
	Combination_FlyingCar,
	Combination_InsideMeshAttack,
	ECheatType_MAX,
};

// Enum TslGame.ETslCustomMovementMode
enum class ETslCustomMovementMode : uint8 {
	Vaulting,
	Freefalling,
	Parachuting,
	UsingAscender,
	ETslCustomMovementMode_MAX,
};

// Enum TslGame.*3324f7f181
enum class *3324f7f181 : uint8 {
	*2af8e7ef4f,
	*bb740071fb,
	*50f2be22eb,
	*90a1b78bbb,
	*3324f7f181_MAX,
};

// Enum TslGame.EPreoccupiedTeamType
enum class EPreoccupiedTeamType : uint8 {
	NEUTRAL,
	RED,
	BLUE,
	EPreoccupiedTeamType_MAX,
};

// Enum TslGame.*f380492015
enum class *f380492015 : uint8 {
	*a6bebb207f,
	*cc9446f658,
	*4f48d76f0e,
	*a83b50f738,
	*f380492015_MAX,
};

// Enum TslGame.EPopupStyle
enum class EPopupStyle : uint8 {
	Ok_Cancel,
	Ok,
	Yes_No,
	Controller_KeyboardMouse,
	EPopupStyle_MAX,
};

// Enum TslGame.EKillcamDisplayCode
enum class EKillcamDisplayCode : uint8 {
	NotVisible,
	OptionDisabled,
	Recording,
	Playable,
	Replay,
	FailToLoad,
	DemoFailure,
	DetectedUnusualMovement,
	EKillcamDisplayCode_MAX,
};

// Enum TslGame.EWidgetShowType
enum class EWidgetShowType : uint8 {
	Show,
	Hide,
	Toggle,
	EWidgetShowType_MAX,
};

// Enum TslGame.EAIPoseState
enum class EAIPoseState : uint8 {
	Stand,
	Crouch,
	Prone,
	Jump,
	Reload,
	UnArmed,
	EAIPoseState_MAX,
};

// Enum TslGame.ERaycastDirection
enum class ERaycastDirection : uint8 {
	Forward,
	Down_45_Degrees,
	Down,
	ERaycastDirection_MAX,
};

// Enum TslGame.EEmoteMoveType
enum class EEmoteMoveType : uint8 {
	None,
	MoveFoward,
	EEmoteMoveType_MAX,
};

// Enum TslGame.EEmotePlayType
enum class EEmotePlayType : uint8 {
	None,
	Normal,
	TeamMate,
	Interaction,
	EEmotePlayType_MAX,
};

// Enum TslGame.*7e3c44e045
enum class *7e3c44e045 : uint8 {
	*ebf89684b1,
	*c482be3f9a,
	*b8f6356af0,
	*e20405aa4a,
	*7e3c44e045_MAX,
};

// Enum TslGame.ESpecialZoneAdditionalEffect
enum class ESpecialZoneAdditionalEffect : uint8 {
	RemoveFireAndSmoke,
	DestructDrone,
	DeactivateBluezoneBlocker,
	DeactivateSpotterScope,
	DeactivateBlueChipDetector,
	DeactivateBlueChipRevival,
	DeactivateReticle,
	DeactivateVehicle,
	DeactivateMarket,
	DeactivateEscalator,
	ESpecialZoneAdditionalEffect_MAX,
};

// Enum TslGame.ESpecialZoneState
enum class ESpecialZoneState : uint8 {
	Disabled,
	BeforeMatch,
	WaitingStartDelay,
	Warning,
	Activating,
	ActivationDone,
	Deactivating,
	Removed,
	Finished,
	ESpecialZoneState_MAX,
};

// Enum TslGame.ESpecialZoneType
enum class ESpecialZoneType : uint8 {
	None,
	Blizzard,
	SandStorm,
	EMP,
	ESpecialZoneType_MAX,
};

// Enum TslGame.EMovementSpamType
enum class EMovementSpamType : uint8 {
	LeanRight,
	LeanLeft,
	Crouch,
	EMovementSpamType_MAX,
};

// Enum TslGame.EAttackType
enum class EAttackType : uint8 {
	None,
	Weapon,
	VehicleCrash,
	VehicleExplosion,
	Fall,
	BlueZone,
	RedZone,
	BlackZone,
	EAttackType_MAX,
};

// Enum TslGame.EPlayerMoveType
enum class EPlayerMoveType : uint8 {
	OnFoot,
	OnSwim,
	OnVehicle,
	OnParachute,
	OnFreefall,
	EPlayerMoveType_MAX,
};

// Enum TslGame.EVoiceChannelType
enum class EVoiceChannelType : uint8 {
	None,
	All,
	GlobalOnly,
	TeamOnly,
	EVoiceChannelType_MAX,
};

// Enum TslGame.EVivoxResponseState
enum class EVivoxResponseState : uint8 {
	NotRequested,
	Requested,
	Fail,
	Success,
	EVivoxResponseState_MAX,
};

// Enum TslGame.ELandingSoundSwitchState
enum class ELandingSoundSwitchState : uint8 {
	None,
	Light,
	Heavy,
	VeryHeavy,
	ELandingSoundSwitchState_MAX,
};

// Enum TslGame.ECustomGripBlendSpaceType
enum class ECustomGripBlendSpaceType : uint8 {
	None,
	Stand,
	Crouch,
	Prone,
	ProneTransition,
	ProneLocomotion,
	ECustomGripBlendSpaceType_MAX,
};

// Enum TslGame.EMasteryItemType
enum class EMasteryItemType : uint8 {
	Charm,
	Mesh,
	EMasteryItemType_MAX,
};

// Enum TslGame.TableType
enum class TableType : uint8 {
	Ammo,
	Attachment,
	Equipment,
	Skin,
	SkinThrowable,
	Weapon,
	WeaponThrowable,
	WeaponShield,
	Castable,
	UsedByAction,
	Event,
	Craft,
	VehiclePart,
	Bluechip,
	Market,
	TableType_MAX,
};

// Enum TslGame.ESoftRoleState
enum class ESoftRoleState : uint8 {
	Open,
	Closed,
	Inspect,
	ESoftRoleState_MAX,
};

// Enum TslGame.*11756e38de
enum class *11756e38de : uint8 {
	*7a31d6b7c3,
	*b86d059d17,
	*b06e6eca08,
	*26fd921940,
	*11756e38de_MAX,
};

// Enum TslGame.ESandboxConsoleGuideKeyType
enum class ESandboxConsoleGuideKeyType : uint8 {
	None,
	ExpandAndClose,
	SpawnAndBack,
	AdjustAndClose,
	ConfirmAndBack,
	SpawnAndClose,
	ESandboxConsoleGuideKeyType_MAX,
};

// Enum TslGame.ESandboxGroypType
enum class ESandboxGroypType : uint8 {
	None,
	Weapon,
	Attachment,
	Item,
	Vehicle,
	Sensitivity,
	Power,
	Special,
	ESandboxGroypType_MAX,
};

// Enum TslGame.ESandboxQuantityType
enum class ESandboxQuantityType : uint8 {
	None,
	Item,
	Vehicle,
	ESandboxQuantityType_MAX,
};

// Enum TslGame.ESandboxSpecialButtonType
enum class ESandboxSpecialButtonType : uint8 {
	None,
	EquipLv3,
	AddAmmo,
	SettingAPrevious,
	SettingAGunset,
	ESandboxSpecialButtonType_MAX,
};

// Enum TslGame.ESandboxPowerType
enum class ESandboxPowerType : uint8 {
	None,
	Fly,
	InvulnerableEffect,
	CarePackage,
	RedZone,
	Revive,
	TeamRevive,
	GiveItemToEveryone,
	BlueZone,
	ESandboxPowerType_MAX,
};

// Enum TslGame.ESandboxSoundType
enum class ESandboxSoundType : uint8 {
	None,
	ItemSpawnClick,
	ItemSpawnSuccess,
	ESandboxSoundType_MAX,
};

// Enum TslGame.*073db8da69
enum class *073db8da69 : uint8 {
	*c26be65375,
	*da1b9a37dd,
	*843057d535,
	*19a8ed613a,
	*4ae6f77cb1,
	*f31a9a182c,
	*35123f7569,
	*073db8da69_MAX,
};

// Enum TslGame.ECurrentSoundState
enum class ECurrentSoundState : uint8 {
	None,
	MovingUp,
	MovingUpSprinting,
	MovingDown,
	MovingDownSprinting,
	Stopping,
	ECurrentSoundState_MAX,
};

// Enum TslGame.*6a15d095b5
enum class *6a15d095b5 : uint8 {
	*05860a85b8,
	*da47d710f6,
	*b0b444fc67,
	*6a15d095b5_MAX,
};

// Enum TslGame.*8b4d6e2791
enum class *8b4d6e2791 : uint8 {
	*731e14f9b3,
	*ab50f210bb,
	*ca4dc8efb8,
	*f050e2288c,
	*8b4d6e2791_MAX,
};

// Enum TslGame.EAscenderDirection
enum class EAscenderDirection : uint8 {
	AscenderUp,
	AscenderDown,
	Max,
	EAscenderDirection_MAX,
};

// Enum TslGame.EAscenderRopeType
enum class EAscenderRopeType : uint8 {
	None,
	AscenderRope,
	AscenderZipline,
	EAscenderRopeType_MAX,
};

// Enum TslGame.EControlType
enum class EControlType : uint8 {
	Move,
	Jump,
	Fire,
	Aim,
	Arm,
	Unarm,
	Reload,
	Interact,
	Peek,
	Roll,
	Crouch,
	Prone,
	UseItem,
	ThrowMelee,
	CookThrowable,
	ItemCatch,
	ItemThrow,
	InspectWeapon,
	ToggleFiringMode,
	ToggleThrowMode,
	EControlType_MAX,
};

// Enum TslGame.ECharFlagsNormal
enum class ECharFlagsNormal : uint8 {
	IsGroggying,
	IsActiveRagdollActive,
	HasShieldEquipped,
	IsInBluezone,
	IsBeingHealed,
	IsSelfHemostasis,
	ECharFlagsNormal_MAX,
};

// Enum TslGame.ELandingState
enum class ELandingState : uint8 {
	None,
	Falling,
	HeavyFalling,
	ExtremeFalling,
	FallingRecovery,
	PostLandingRecovery,
	ELandingState_MAX,
};

// Enum TslGame.ECharFlagsSkipOwner
enum class ECharFlagsSkipOwner : uint8 {
	WantsToRun,
	WantsToSprint,
	WantsToSprintingAuto,
	WantsToRollingLeft,
	WantsToRollingRight,
	AimStateActive,
	IsThirdPerson,
	IsReviving,
	IgnoreRotation,
	IsWeaponObstructed,
	IsCoatEquipped,
	IsThrowHigh,
	WantsToCancelVault,
	IsScopingRemote,
	IsAimingRemote,
	IsFirstPersonRemote,
	IsInVehicleRemote,
	IsPeekLeftRemote,
	IsPeekRightRemote,
	IsHoldingAngled,
	ECharFlagsSkipOwner_MAX,
};

// Enum TslGame.*cbd0fbd7f9
enum class *cbd0fbd7f9 : uint8 {
	*f08d55cc3c,
	*eaa64cb217,
	*68096f8fd0,
	*cbd0fbd7f9_MAX,
};

// Enum TslGame.EMovementType
enum class EMovementType : uint8 {
	M_StandWalk,
	M_StandRun,
	M_StandSprint,
	M_CrouchWalk,
	M_CrouchRun,
	M_CrouchSprint,
	M_ProneWalk,
	M_ProneRun,
	M_ProneSprint,
	M_StandScope,
	M_CrouchScope,
	M_ProneScope,
	M_StandAim,
	M_CrouchAim,
	M_ProneAim,
	M_Swim,
	M_UnderwaterSwim,
	M_DBNO,
	Count,
	EMovementType_MAX,
};

// Enum TslGame.*1852d2b7c5
enum class *1852d2b7c5 : uint8 {
	*6de48e86c8,
	*bc99fdd057,
	*948b113377,
	*dfb41b7787,
	*c6f3ab7966,
	*faedeb998f,
	*76702017c8,
	*1852d2b7c5_MAX,
};

// Enum TslGame.*ae7c5d2cb1
enum class *ae7c5d2cb1 : uint8 {
	*4b5604fa9c,
	*8251db5bb3,
	*95d89cbb1e,
	*3140ef4518,
	*14ea250980,
	*ae7c5d2cb1_MAX,
};

// Enum TslGame.*acbee09004
enum class *acbee09004 : uint8 {
	*a8cffd74b6,
	*5209f464ee,
	*e5daa9d1f7,
	*88a5933779,
	*acbee09004_MAX,
};

// Enum TslGame.EAIPolyType
enum class EAIPolyType : uint8 {
	AIPoly_None,
	AIPoly_Attack,
	AIPoly_Moving,
	AIPoly_Moving_Directly,
	AIPoly_Jump,
	AIPoly_MovingTargetPos,
	AIPoly_Max,
};

// Enum TslGame.*996f6b1c2e
enum class *996f6b1c2e : uint8 {
	*67fe575a63,
	*a3b2ef5358,
	*713e4d9ecf,
	*059377cb6e,
	*e185a9ecfa,
	*996f6b1c2e_MAX,
};

// Enum TslGame.*0e762ae104
enum class *0e762ae104 : uint8 {
	*81f569c6d2,
	*6654768f0c,
	*1708fb78fc,
	*0e762ae104_MAX,
};

// Enum TslGame.ESurviveWeaponPropSlot
enum class ESurviveWeaponPropSlot : uint8 {
	SWPS_MainShootWeapon1,
	SWPS_MainShootWeapon2,
	SWPS_SubShootWeapon,
	SWPS_MeleeWeapon,
	SWPS_HandProp,
	SWPS_Max,
};

// Enum TslGame.*bb21983e8b
enum class *bb21983e8b : uint8 {
	*29487c291c,
	*df3c44122c,
	*99489c8820,
	*e10d3bbf3a,
	*3e0fb33600,
	*9f7efb8de4,
	*b69ca05e78,
	*6f19651d96,
	*bb21983e8b_MAX,
};

// Enum TslGame.*d8031bdfcd
enum class *d8031bdfcd : uint8 {
	*5c9b1ba4a1,
	*1f64cc3747,
	*7f46ef80a1,
	*aac0603e8f,
	*0e9a32aa35,
	*d8031bdfcd_MAX,
};

// Enum TslGame.ExtraPlayerLiveState
enum class ExtraPlayerLiveState : uint8 {
	InDefault,
	InPlane,
	InParachute,
	InVehicle,
	InDying,
	InDied,
	Offline,
	ExtraPlayerLiveState_MAX,
};

// Enum TslGame.*940f2ac99d
enum class *940f2ac99d : uint8 {
	*7f1e9e232b,
	*7d6b988ce6,
	*705cdfa586,
	*940f2ac99d_MAX,
};

// Enum TslGame.EAIWeaponShootType
enum class EAIWeaponShootType : uint8 {
	SingleShot,
	Auto,
	EAIWeaponShootType_MAX,
};

// Enum TslGame.EAINewFocusPriority
enum class EAINewFocusPriority : uint8 {
	Default,
	Move,
	Gameplay,
	EAINewFocusPriority_MAX,
};

// Enum TslGame.EAIMovePose
enum class EAIMovePose : uint8 {
	Walk,
	Run,
	CrouchSprint,
	KeepCurrentPose,
	EAIMovePose_MAX,
};

// Enum TslGame.EAITriggerAttrType
enum class EAITriggerAttrType : uint8 {
	None,
	Health,
	Energy,
	EAITriggerAttrType_MAX,
};

// Enum TslGame.EAIAttrCompareType
enum class EAIAttrCompareType : uint8 {
	None,
	Great,
	Less,
	EAIAttrCompareType_MAX,
};

// Enum TslGame.EAIEquipSpawnItemType
enum class EAIEquipSpawnItemType : uint8 {
	Shoot_Weap,
	Backpack,
	other,
	EAIEquipSpawnItemType_MAX,
};

// Enum TslGame.EWeaponReloadMethod
enum class EWeaponReloadMethod : uint8 {
	Magazine,
	OneByOne,
	OneByOneAndClip,
	EWeaponReloadMethod_MAX,
};

// Enum TslGame.ETslRedeployPlayerState
enum class ETslRedeployPlayerState : uint8 {
	None,
	Initialized,
	RespawnTarget,
	ReadyToFight,
	Fighting,
	Dead,
	Survived,
	Redeployed,
	RevivalTarget,
	RevivalRegisted,
	Revived,
	ETslRedeployPlayerState_MAX,
};

// Enum TslGame.EItemRequestType
enum class EItemRequestType : uint8 {
	None,
	Heal,
	Ammo,
	EItemRequestType_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_InteractionType
enum class ETslIngameMission_ConditionData_InteractionType : uint8 {
	None,
	VehicleRadio,
	BodyCarry,
	InteractableActor,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMission_Condition_PlaceType
enum class ETslIngameMission_Condition_PlaceType : uint8 {
	None,
	SecretRoom,
	Market,
	ETslIngameMission_Condition_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_VisitType
enum class ETslIngameMission_ConditionData_VisitType : uint8 {
	None,
	Region,
	Place,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_ReviveType
enum class ETslIngameMission_ConditionData_ReviveType : uint8 {
	None,
	SelfDBNO,
	TeamDBNO,
	Redeploy,
	Bluechip,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMission_Condition_ParkourType
enum class ETslIngameMission_Condition_ParkourType : uint8 {
	None,
	Vaulting,
	Cooperative,
	ETslIngameMission_Condition_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_KillType
enum class ETslIngameMission_ConditionData_KillType : uint8 {
	None,
	Vehicle,
	RidingShot,
	HeadShot,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_KillAssistType
enum class ETslIngameMission_ConditionData_KillAssistType : uint8 {
	Kill,
	Assist,
	KillOrAssist,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMission_Condition_ComparisonType
enum class ETslIngameMission_Condition_ComparisonType : uint8 {
	Less,
	Greater,
	ETslIngameMission_Condition_MAX,
};

// Enum TslGame.ETslIngameMission_CoditionData_VehicleType
enum class ETslIngameMission_CoditionData_VehicleType : uint8 {
	None,
	Floating,
	Wheeled,
	MotorBike,
	Flying,
	All,
	ETslIngameMission_CoditionData_MAX,
};

// Enum TslGame.ETslIngameMission_CoditionData_MoveType
enum class ETslIngameMission_CoditionData_MoveType : uint8 {
	None,
	Walk,
	Drive,
	Parachute,
	Swim,
	SafeZone,
	ETslIngameMission_CoditionData_MAX,
};

// Enum TslGame.ETslIngameMissionCondition_FlareGunUsage
enum class ETslIngameMissionCondition_FlareGunUsage : uint8 {
	None,
	BRDM,
	CarePackage,
	SafeZone,
	ETslIngameMissionCondition_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_ItemType
enum class ETslIngameMission_ConditionData_ItemType : uint8 {
	Any,
	Equipable,
	Weapon,
	Castable,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_ItemUseType
enum class ETslIngameMission_ConditionData_ItemUseType : uint8 {
	None,
	ItemConsume,
	Flaregun,
	ItemThrow,
	FireWeapon,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMission_ConditionData_ItemMissionType
enum class ETslIngameMission_ConditionData_ItemMissionType : uint8 {
	None,
	PickUp,
	Use,
	Request,
	Give,
	ETslIngameMission_ConditionData_MAX,
};

// Enum TslGame.ETslIngameMissionRewardType
enum class ETslIngameMissionRewardType : uint8 {
	Normal,
	Jackpot,
	ETslIngameMissionRewardType_MAX,
};

// Enum TslGame.ETslIngameMissionType
enum class ETslIngameMissionType : uint8 {
	Easy,
	Normal,
	Hard,
	Event,
	Newbie,
	None,
	ETslIngameMissionType_MAX,
};

// Enum TslGame.*8499417bc3
enum class *8499417bc3 : uint8 {
	*b83718b25a,
	*0f51f7bfba,
	*b06198104c,
	*8499417bc3_MAX,
};

// Enum TslGame.ETslIngameMissionFailReason
enum class ETslIngameMissionFailReason : uint8 {
	Success,
	Invalid_IngameMissionManagerClass,
	Invalid_IngameMissionManagerObject,
	Invalid_IngameMissionDataTables,
	Invalid_IngameMissionCondition,
	Fail_EnableIngameMission,
	Fail_CheckMissionActivation_MissionDataNull,
	Fail_CheckMissionActivation_Inactive,
	Fail_CheckMissionActivation_InvalidMap,
	Fail_CheckMissionActivation_InvalidMode,
	Fail_CheckMissionActivation_LackTeammates,
	Fail_CheckMissionActivation_GameStateNull,
	Fail_CheckMissionActivation_ReachSurvivalLvLimit,
	Fail_CheckMissionActivation_UsedMission,
	Fail_CheckRewardActivation_MissionDataNull,
	Fail_CheckRewardActivation_InvalidMap,
	Fail_ReplaceMission_InvalidMissionId,
	Fail_ReplaceMission_NoDataLeft,
	Fail_ReplaceMission_ReachReplacementLimit,
	Fail_ProcessNewMission_TooFewMissions,
	Fail_ProcessNewMission_InvalidIndex,
	ETslIngameMissionFailReason_MAX,
};

// Enum TslGame.EDestrucibleSurfaceSourceType
enum class EDestrucibleSurfaceSourceType : uint8 {
	Unknown,
	Projectile,
	Grenade,
	Warhead,
	Slashing,
	EDestrucibleSurfaceSourceType_MAX,
};

// Enum TslGame.EAttachParent
enum class EAttachParent : uint8 {
	None,
	Character,
	WeaponGun,
	EAttachParent_MAX,
};

// Enum TslGame.EDoorState
enum class EDoorState : uint8 {
	Closed,
	Closing,
	Opened,
	Opening,
	EDoorState_MAX,
};

// Enum TslGame.*3644527f08
enum class *3644527f08 : uint8 {
	*d5ffa49995,
	*f44b51506b,
	*f46eb8d1e1,
	*59e9b6f4f9,
	*fe47238a33,
	*3644527f08_MAX,
};

// Enum TslGame.eDESPMode
enum class eDESPMode : uint8 {
	None,
	UniformDivision,
	RadiusFromCenter,
	eDESPMode_MAX,
};

// Enum TslGame.ETdmSpawnKit
enum class ETdmSpawnKit : uint8 {
	Shotgun,
	Smg,
	Ar,
	Dmr,
	Sr,
	Etc,
	Max,
	ETdmSpawnKit_MAX,
};

// Enum TslGame.EWeaponReloadCancelReason
enum class EWeaponReloadCancelReason : uint8 {
	Default,
	PlayerInterrupted,
	PlayerMovement,
	PlayerInteraction,
	WeaponSwitch,
	PlayerIncapacitated,
	VehicleMoving,
	EWeaponReloadCancelReason_MAX,
};

// Enum TslGame.EWeaponReloadAnimExec
enum class EWeaponReloadAnimExec : uint8 {
	Tactical,
	Charge,
	Single,
	Loop,
	EWeaponReloadAnimExec_MAX,
};

// Enum TslGame.EWeaponState
enum class EWeaponState : uint8 {
	Idle,
	Firing,
	Reloading,
	EWeaponState_MAX,
};

// Enum TslGame.EWeaponTransitionState
enum class EWeaponTransitionState : uint8 {
	Stable,
	Arming,
	UnArming,
	EWeaponTransitionState_MAX,
};

// Enum TslGame.EPerceptionType
enum class EPerceptionType : uint8 {
	Sight,
	Disapp,
	Hearing,
	Attack,
	None,
	EPerceptionType_MAX,
};

// Enum TslGame.EBombGameJoinType
enum class EBombGameJoinType : uint8 {
	Normal,
	IntrusionStart,
	IntrusionFinish,
	EBombGameJoinType_MAX,
};

// Enum TslGame.EBombGameAreaType
enum class EBombGameAreaType : uint8 {
	None,
	StartArea,
	PlantedASite,
	PlantedBSite,
	NormalArea,
	EBombGameAreaType_MAX,
};

// Enum TslGame.EBombItemCategory
enum class EBombItemCategory : uint8 {
	None,
	Pistol,
	SMG,
	AR,
	SG,
	DMR,
	SR,
	Equipment,
	Throwable,
	ETC,
	EBombItemCategory_MAX,
};

// Enum TslGame.EBombTeamStateInfoType
enum class EBombTeamStateInfoType : uint8 {
	MoveASite,
	MoveBSite,
	SaveMoney,
	GiveMoney,
	Rush,
	SaveMe,
	MAX,
	EBombTeamStateInfoType_MAX,
};

// Enum TslGame.ECoinTakeType
enum class ECoinTakeType : uint8 {
	None,
	StoreSellItemToCustomer,
	CustomerSellItemToStore,
	KillReward,
	KillAssistReward,
	BombInstallReward,
	BombDefuseReward,
	RoundWin,
	Donate,
	Receipt,
	RoundStartNormal,
	RoundStartDecisive,
	RoundDefeat,
	TeamRoleChange,
	MinAllowanceCoin,
	MaxAllowanceCoin,
	ThriftyDiffSpendCoin,
	Admin,
	ECoinTakeType_MAX,
};

// Enum TslGame.EBombModeSoundType
enum class EBombModeSoundType : uint8 {
	Unknown,
	BombPlanting_Phase1,
	BombPlanting_Phase2,
	BombPlanting_Phase3,
	BombExplosion,
	BombDefusing,
	GiveCoin,
	ReceiveCoin,
	Purchase,
	BombTimerStart,
	BombTimerDismantle,
	BombTimeStop,
	RestrictionTimer,
	EBombModeSoundType_MAX,
};

// Enum TslGame.ETimeBombPhaseType
enum class ETimeBombPhaseType : uint8 {
	Unknown,
	Planting_Phase1,
	Planting_Phase2,
	Planting_Phase3,
	Explosion,
	Defusing,
	ETimeBombPhaseType_MAX,
};

// Enum TslGame.ETslBombMatchWinType
enum class ETslBombMatchWinType : uint8 {
	Draw,
	ExceedRoundWin,
	ExceedUseBombKit,
	ExceedKillCount,
	EnemyAllLogout,
	ETslBombMatchWinType_MAX,
};

// Enum TslGame.*16e5731d2c
enum class *16e5731d2c : uint8 {
	*4a1c44b663,
	*7e984db04c,
	*439dd11022,
	*967916ddac,
	*d84700dd9e,
	*16e5731d2c_MAX,
};

// Enum TslGame.ETslBombPlantedState
enum class ETslBombPlantedState : uint8 {
	NotSet,
	Planting,
	Planted,
	Defused,
	Exploded,
	ETslBombPlantedState_MAX,
};

// Enum TslGame.ETslBombRoundInProgressState
enum class ETslBombRoundInProgressState : uint8 {
	Invalid,
	TeamDecision,
	Preparing,
	Playing,
	Ending,
	ETslBombRoundInProgressState_MAX,
};

// Enum TslGame.EBombKeyNotifyState
enum class EBombKeyNotifyState : uint8 {
	None,
	InStartArea,
	DefenseTeam,
	AttackTeam,
	HoldBombPlantingKit,
	EBombKeyNotifyState_MAX,
};

// Enum TslGame.EBombRoundAttribute
enum class EBombRoundAttribute : uint8 {
	None,
	Normal,
	OverTime,
	TeamRoleChanged,
	EBombRoundAttribute_MAX,
};

// Enum TslGame.EBombRoundResultConditionType
enum class EBombRoundResultConditionType : uint8 {
	None,
	Excellent,
	Impressive,
	Overwhelming,
	Perfect,
	Thrifty,
	MAX,
	EBombRoundResultConditionType_MAX,
};

// Enum TslGame.ETslBombRoundResultHistoryType
enum class ETslBombRoundResultHistoryType : uint8 {
	None,
	TimeUp,
	BombExploded,
	BombDefused,
	TeamElimination,
	TeamGameLogout,
	ETslBombRoundResultHistoryType_MAX,
};

// Enum TslGame.EBombUITeamStatusType
enum class EBombUITeamStatusType : uint8 {
	None,
	Attack,
	Defence,
	MAX,
	EBombUITeamStatusType_MAX,
};

// Enum TslGame.EBombScopeInfo
enum class EBombScopeInfo : uint8 {
	None,
	Hologram,
	Reddot,
	Scope2x,
	Scope3x,
	Scope4x,
	Scope6x,
	Scope8x,
	Scope15x,
	MAX,
	EBombScopeInfo_MAX,
};

// Enum TslGame.ETslBombKDAMType
enum class ETslBombKDAMType : uint8 {
	Kill,
	Death,
	Assist,
	MissionInstallBomb,
	MissionDefuseBomb,
	ETslBombKDAMType_MAX,
};

// Enum TslGame.ETslBombTeamRole
enum class ETslBombTeamRole : uint8 {
	None,
	AttackTeam,
	DefenseTeam,
	ROLE_MAX,
	ETslBombTeamRole_MAX,
};

// Enum TslGame.EHealingItemType
enum class EHealingItemType : uint8 {
	HealItem,
	BoostItem,
	EHealingItemType_MAX,
};

// Enum TslGame.EComparisonTarget
enum class EComparisonTarget : uint8 {
	Value,
	BBKey,
	EComparisonTarget_MAX,
};

// Enum TslGame.EAIMapName
enum class EAIMapName : uint8 {
	Baltic,
	Desert,
	Sanhok,
	DihorOtok,
	Summerland,
	Paramo,
	Tiger,
	Chimera,
	Heaven,
	Kiki,
	Other,
	EAIMapName_MAX,
};

// Enum TslGame.ETeamModeType
enum class ETeamModeType : uint8 {
	Solo,
	Duo,
	Squad,
	ETeamModeType_MAX,
};

// Enum TslGame.*6d4cfb0321
enum class *6d4cfb0321 : uint8 {
	*c1009459fd,
	*aa94d14fb1,
	*b8a37a8993,
	*93338ec608,
	*61147c9ed9,
	*9edd4f48fb,
	*6d4cfb0321_MAX,
};

// Enum TslGame.EAICommand
enum class EAICommand : uint8 {
	None,
	Moving,
	Battle,
	EAICommand_MAX,
};

// Enum TslGame.EAIActionState
enum class EAIActionState : uint8 {
	Idle,
	Battle,
	BattleMoving,
	Healing,
	Farming,
	Moving,
	Swimming,
	EAIActionState_MAX,
};

// Enum TslGame.EAIAliveState
enum class EAIAliveState : uint8 {
	Alive,
	Groggy,
	Dead,
	EAIAliveState_MAX,
};

// Enum TslGame.EPickupItemStatus
enum class EPickupItemStatus : uint8 {
	NeedWeapon,
	NeedBaseEquip,
	NeedOneMoreWeapon,
	NeedHealItem,
	NeedBoostItem,
	NeedThrowableItem,
	NeedPan,
	NeedNoItem,
	EPickupItemStatus_MAX,
};

// Enum TslGame.EIntoCircleLevel
enum class EIntoCircleLevel : uint8 {
	AlreadyInWhite,
	NearWhite,
	MiddleWhite,
	ReachableWhite,
	UnreachableWhite,
	EIntoCircleLevel_MAX,
};

// Enum TslGame.EValueCompareFunc
enum class EValueCompareFunc : uint8 {
	MoreThan,
	MoreThanOrEqual,
	LessThan,
	LessThanOrEqual,
	Equal,
	NotEqual,
	EValueCompareFunc_MAX,
};

// Enum TslGame.EAIParameter
enum class EAIParameter : uint8 {
	None,
	Offensive,
	PrepareType,
	EAIParameter_MAX,
};

// Enum TslGame.EPrepareType
enum class EPrepareType : uint8 {
	StopMovement,
	MoveRandomLoc,
	ThrowToy,
	TypeEnd,
	EPrepareType_MAX,
};

// Enum TslGame.EAIBehaviors
enum class EAIBehaviors : uint8 {
	Normal,
	Chasing,
	Runaway,
	EAIBehaviors_MAX,
};

// Enum TslGame.ERightMoveDirection
enum class ERightMoveDirection : uint8 {
	Left,
	Right,
	Stop,
	ERightMoveDirection_MAX,
};

// Enum TslGame.EForwardMoveDirection
enum class EForwardMoveDirection : uint8 {
	Forward,
	Backward,
	Stop,
	EForwardMoveDirection_MAX,
};

// Enum TslGame.EUltronWithCircle
enum class EUltronWithCircle : uint8 {
	InWhiteCircle,
	InBlueCircle,
	OutBlueCircle,
	MaxNum,
	EUltronWithCircle_MAX,
};

// Enum TslGame.EComparisonTargetCircle
enum class EComparisonTargetCircle : uint8 {
	WhiteCircle,
	BlueCircle,
	EComparisonTargetCircle_MAX,
};

// Enum TslGame.ETurnDirection
enum class ETurnDirection : uint8 {
	Left,
	Right,
	Stop,
	ETurnDirection_MAX,
};

// Enum TslGame.EPercivedGrenadeType
enum class EPercivedGrenadeType : uint8 {
	FragGrenade,
	StickyBomb,
	C4,
	EPercivedGrenadeType_MAX,
};

// Enum TslGame.EEnemyCompareElement
enum class EEnemyCompareElement : uint8 {
	None,
	HouseId,
	EEnemyCompareElement_MAX,
};

// Enum TslGame.EInfoPointWithHouse
enum class EInfoPointWithHouse : uint8 {
	All,
	InHouse,
	OutHouse,
	EInfoPointWithHouse_MAX,
};

// Enum TslGame.ETargetLocation
enum class ETargetLocation : uint8 {
	WhiteCircle,
	OtherLocation,
	ETargetLocation_MAX,
};

// Enum TslGame.ETestMoveDirection
enum class ETestMoveDirection : uint8 {
	Front,
	Back,
	Left,
	Right,
	ETestMoveDirection_MAX,
};

// Enum TslGame.EThownWeapon_AI
enum class EThownWeapon_AI : uint8 {
	GRENADE,
	MOLOTOV,
	SMOKEBOMB,
	FLASHBANG,
	EThownWeapon_MAX,
};

// Enum TslGame.EThrowablePoseState_AI
enum class EThrowablePoseState_AI : uint8 {
	Idle,
	PinOffStart,
	Cooking,
	WaitForThrow,
	Throwing,
	EThrowablePoseState_MAX,
};

// Enum TslGame.EPatrolSpeed
enum class EPatrolSpeed : uint8 {
	Walk,
	Run,
	Sprint,
	EPatrolSpeed_MAX,
};

// Enum TslGame.*ff593eda08
enum class *ff593eda08 : uint8 {
	*61e0f49599,
	*e2d18f7576,
	*1ce64d62c2,
	*30988da725,
	*ff593eda08_MAX,
};

// Enum TslGame.EModifyBlackboardDataValueType
enum class EModifyBlackboardDataValueType : uint8 {
	Int,
	Float,
	Bool,
	String,
	Object,
	Vector3,
	EModifyBlackboardDataValueType_MAX,
};

// Enum TslGame.EAIBattleState
enum class EAIBattleState : uint8 {
	None,
	ReturnToSpawnLocation,
	Patrol,
	Battle,
	EAIBattleState_MAX,
};

// Enum TslGame.EThownWeapon
enum class EThownWeapon : uint8 {
	GRENADE,
	MOLOTOV,
	SMOKEBOMB,
	FLASHBANG,
	EThownWeapon_MAX,
};

// Enum TslGame.EThrowablePoseState
enum class EThrowablePoseState : uint8 {
	Idle,
	PinOffStart,
	Cooking,
	WaitForThrow,
	Throwing,
	EThrowablePoseState_MAX,
};

// Enum TslGame.EBoosterItem
enum class EBoosterItem : uint8 {
	ADRENALINE,
	PAINKILLER,
	ENERGYDRINK,
	EBoosterItem_MAX,
};

// Enum TslGame.*aea429c698
enum class *aea429c698 : uint8 {
	*15cb4256ae,
	*3679cb978b,
	*5949510587,
	*ab7f041fac,
	*739fe15796,
	*aea429c698_MAX,
};

// Enum TslGame.EFightMovingType
enum class EFightMovingType : uint8 {
	FM_Target,
	FM_TargetPos,
	FM_RandomPos,
	FM_Max,
};

// Enum TslGame.EMonsterPatrol
enum class EMonsterPatrol : uint8 {
	Patrol_BackDomain,
	Patrol_Flee,
	Patrol_RunawayHouse,
	Patrol_SpawnSpot,
	Patrol_Hearing,
	Patrol_Random,
	Patrol_Max,
};

// Enum TslGame.*c75eb07276
enum class *c75eb07276 : uint8 {
	*e508e6f1ce,
	*a48598134c,
	*28732e21b9,
	*0e2be2cef8,
	*a23aee2b88,
	*c75eb07276_MAX,
};

// Enum TslGame.*586d5a41d2
enum class *586d5a41d2 : uint8 {
	*5d14f85c1a,
	*30610158b0,
	*713b403087,
	*fed69c8c5d,
	*cdcf73e715,
	*586d5a41d2_MAX,
};

// Enum TslGame.*d98cef593f
enum class *d98cef593f : uint8 {
	*9de4e39b5c,
	*b8845fd8e3,
	*f57456d94c,
	*6e632bfa27,
	*d98cef593f_MAX,
};

// Enum TslGame.EReactionObjectType
enum class EReactionObjectType : uint8 {
	Fence,
	Hay,
	Camera,
	Bamboo,
	BirdCage,
	LandscapeReacting,
	EReactionObjectType_MAX,
};

// Enum TslGame.*da40bf1eb5
enum class *da40bf1eb5 : uint8 {
	*d39b15657d,
	*516f859f10,
	*6529b5bea3,
	*ff222ebfd6,
	*da40bf1eb5_MAX,
};

// Enum TslGame.ECraftResult
enum class ECraftResult : uint8 {
	Success,
	Invalid_Character,
	Invalid_Inventory,
	Invalid_Equipment,
	Invalid_CraftingRuleComponent,
	Invalid_CraftItemData,
	Invalid_ReservedCraftItem,
	Invalid_PlayerState,
	Not_Enough_Material,
	Not_Enough_Space,
	Miss_Matched_RestrictFilter,
	Restricted_Stance,
	ECraftResult_MAX,
};

// Enum TslGame.*06c3bc7c57
enum class *06c3bc7c57 : uint8 {
	*9e00131992,
	*393b2381d1,
	*1cc5e0b72d,
	*60a72a9102,
	*b571b658f3,
	*2837ed42c9,
	*3606a9b6df,
	*06c3bc7c57_MAX,
};

// Enum TslGame.ECustomCarepackageState
enum class ECustomCarepackageState : uint8 {
	Transporting,
	Falling,
	Landing,
	ECustomCarepackageState_MAX,
};

// Enum TslGame.EDecoyFiringState
enum class EDecoyFiringState : uint8 {
	Firing,
	BetweenShots,
	BetweenSequences,
	EDecoyFiringState_MAX,
};

// Enum TslGame.EDecoyState
enum class EDecoyState : uint8 {
	Uninitialized,
	Cooking,
	DelayedFiring,
	Firing,
	Reloading,
	DelayedEnding,
	EndOfLife,
	EDecoyState_MAX,
};

// Enum TslGame.EWhiteZoneShape
enum class EWhiteZoneShape : uint8 {
	None,
	Circle,
	EWhiteZoneShape_MAX,
};

// Enum TslGame.EBluezoneType
enum class EBluezoneType : uint8 {
	Normal,
	Fast,
	EBluezoneType_MAX,
};

// Enum TslGame.EVendingMachineType
enum class EVendingMachineType : uint8 {
	AMMUNITION,
	BOOSTING,
	THROWABLE,
	WEAPON,
	HEALING,
	EVendingMachineType_MAX,
};

// Enum TslGame.EMarketShopUINotifyType
enum class EMarketShopUINotifyType : uint8 {
	None,
	InsufficientSpace,
	Sold,
	Obtained,
	MAX,
	EMarketShopUINotifyType_MAX,
};

// Enum TslGame.EMarketUITuningPhase
enum class EMarketUITuningPhase : uint8 {
	None,
	init,
	PlayingAnim,
	Done,
	Empty,
	NotEnoughCoin,
	MAX,
	EMarketUITuningPhase_MAX,
};

// Enum TslGame.EMarketUIRandomPhase
enum class EMarketUIRandomPhase : uint8 {
	None,
	Reset,
	PlayingAnim,
	Result,
	MAX,
	EMarketUIRandomPhase_MAX,
};

// Enum TslGame.ELoadingScreenType
enum class ELoadingScreenType : uint8 {
	NONE,
	ICE_BRAKE,
	RULE_SET,
	WEAPON,
	ATTACHMENT,
	EQUIPMENT,
	ITEM,
	VEHICLE,
	SYSTEM,
	DEFAULT,
	GAME_MODE,
	EXPOSE_WITH_HIGHEST_PRIORITY,
	ELoadingScreenType_MAX,
};

// Enum TslGame.EPlayerAuthState
enum class EPlayerAuthState : uint8 {
	None,
	Login,
	Logout,
	EPlayerAuthState_MAX,
};

// Enum TslGame.EBlueChipTowerState
enum class EBlueChipTowerState : uint8 {
	IsUnavailable,
	IsAvailable,
	IsInUse,
	IsLaunching,
	RegisterFinished,
	NeedToCharge,
	Cancel,
	Broken,
	EBlueChipTowerState_MAX,
};

// Enum TslGame.EEmPickupAircraftStatus
enum class EEmPickupAircraftStatus : uint8 {
	Available,
	InvalidPhase_Early,
	InvalidPhase_Late,
	QueueFull,
	Disabled,
	EEmPickupAircraftStatus_MAX,
};

// Enum TslGame.EItemClientAnimSeqUnload
enum class EItemClientAnimSeqUnload : uint8 {
	None,
	Disable,
	Enable,
	EItemClientAnimSeqUnload_MAX,
};

// Enum TslGame.EFExplosivePropDataType
enum class EFExplosivePropDataType : uint8 {
	Default,
	PropaneTank,
	SmallTank,
	RacingExplosive,
	GasPump,
	EFExplosivePropDataType_MAX,
};

// Enum TslGame.*d0429aaf4c
enum class *d0429aaf4c : uint8 {
	*be927dc73f,
	*ef4e756dc5,
	*d584a7100d,
	*1828ba462e,
	*d0429aaf4c_MAX,
};

// Enum TslGame.ETslControllerType
enum class ETslControllerType : uint8 {
	Mouse,
	GamePad,
	Total,
	ETslControllerType_MAX,
};

// Enum TslGame.EVoiceInterfaceType
enum class EVoiceInterfaceType : uint8 {
	VIVOX,
	XIM,
	GVOICE,
	EVoiceInterfaceType_MAX,
};

// Enum TslGame.EVoiceTransmissionType
enum class EVoiceTransmissionType : uint8 {
	None,
	ToAll,
	ToChannel,
	EVoiceTransmissionType_MAX,
};

// Enum TslGame.EVoiceChannelJoinState
enum class EVoiceChannelJoinState : uint8 {
	NotJoined,
	Joining,
	Leaving,
	Joined,
	EVoiceChannelJoinState_MAX,
};

// Enum TslGame.EVoiceLoginState
enum class EVoiceLoginState : uint8 {
	NotLoggedin,
	Loggingin,
	Loggedin,
	EVoiceLoginState_MAX,
};

// Enum TslGame.EVoiceConnectionState
enum class EVoiceConnectionState : uint8 {
	NotConnected,
	Connecting,
	Connected,
	EVoiceConnectionState_MAX,
};

// Enum TslGame.ETableCheckerHideOption
enum class ETableCheckerHideOption : uint8 {
	Hide,
	Show,
	ETableCheckerHideOption_MAX,
};

// Enum TslGame.EKeyHintGradeSettingValue
enum class EKeyHintGradeSettingValue : uint8 {
	Basic,
	Advanced,
	EKeyHintGradeSettingValue_MAX,
};

// Enum TslGame.EKeyHintGradeBitmask
enum class EKeyHintGradeBitmask : uint8 {
	Basic,
	Advanced,
	EKeyHintGradeBitmask_MAX,
};

// Enum TslGame.ETslWeatherAction
enum class ETslWeatherAction : uint8 {
	NotDefined,
	Initialized,
	Prolonged,
	ETslWeatherAction_MAX,
};

// Enum TslGame.ECharacterInteractBehaviorType
enum class ECharacterInteractBehaviorType : uint8 {
	None,
	ExtraSlotForMode,
	Revive,
	BodyCarry,
	TraumaBag,
	InstantRevivalKit,
	TeamEmote,
	ItemRequest,
	RepairKit,
	ECharacterInteractBehaviorType_MAX,
};

// Enum TslGame.EInteractionPhase
enum class EInteractionPhase : uint8 {
	First,
	Second,
	EInteractionPhase_MAX,
};

// Enum TslGame.ETslSLBGeneratorState
enum class ETslSLBGeneratorState : uint8 {
	Breakdown,
	NeedFuel,
	BeforeActivate,
	Activate,
	MAX,
	ETslSLBGeneratorState_MAX,
};

// Enum TslGame.ELobbyItemBundleType
enum class ELobbyItemBundleType : uint8 {
	Bundle,
	Generator,
	ELobbyItemBundleType_MAX,
};

// Enum TslGame.EItemSpawnType
enum class EItemSpawnType : uint8 {
	FixedRatioAndAdjustableTotalNumber,
	AdjustableRatioAndFixedTotalNumber,
	AdjustableRatioAndAdjustableTotalNumber,
	Invalid,
	EItemSpawnType_MAX,
};

// Enum TslGame.EThreatType
enum class EThreatType : uint8 {
	Damage,
	Sight,
	Noise,
	EThreatType_MAX,
};

// Enum TslGame.ELocationType
enum class ELocationType : uint8 {
	LANDMARK,
	EXTRA_LANDMARK,
	CITY,
	CITY_DETAIL,
	TOWN,
	COMPOUNDS,
	EXTRA,
	TEST_SHOW_ALL,
	ELocationType_MAX,
};

// Enum TslGame.*0d1fe0558a
enum class *0d1fe0558a : uint8 {
	*1d6e2a04ee,
	*5967ec2fd1,
	*9fe8830485,
	*665787d8dc,
	*1645a2c641,
	*6caee492f2,
	*3ac21088cd,
	*c4e29ab813,
	*e86313f000,
	*b10721fe5e,
	*d5308467b9,
	*57218bc70f,
	*a662cf14b7,
	*0d1fe0558a_MAX,
};

// Enum TslGame.ELobbyLinkState
enum class ELobbyLinkState : uint8 {
	Disconnect,
	WaitInitialize,
	WaitStart,
	Gaming,
	Finished,
	ELobbyLinkState_MAX,
};

// Enum TslGame.ELobbyCharacterAnimationType
enum class ELobbyCharacterAnimationType : uint8 {
	Default,
	Wardrobe,
	Appearance,
	ELobbyCharacterAnimationType_MAX,
};

// Enum TslGame.EParameterLUTChannel
enum class EParameterLUTChannel : uint8 {
	R,
	G,
	B,
	A,
	RGBA,
	Undefined,
	EParameterLUTChannel_MAX,
};

// Enum TslGame.EMaterialParameterType
enum class EMaterialParameterType : uint8 {
	Bool,
	Scalar,
	Vector,
	Texture,
	Undefined,
	EMaterialParameterType_MAX,
};

// Enum TslGame.EBlackZoneState
enum class EBlackZoneState : uint8 {
	BZ_WaitingForMatchStart,
	BZ_SelectNewBlackZone,
	BZ_BeginStrike,
	BZ_FireMisile,
	BZ_EndBombing,
	BZ_MAX,
};

// Enum TslGame.*80c8fd85ea
enum class *80c8fd85ea : uint8 {
	*8fb720a6ff,
	*41ee549e79,
	*e10bcefa4c,
	*d4874166ba,
	*9252574bec,
	*80c8fd85ea_MAX,
};

// Enum TslGame.*27bd1c025d
enum class *27bd1c025d : uint8 {
	*93a31f31c7,
	*e4565429f8,
	*73cf5aa893,
	*34bdd06d35,
	*27bd1c025d_MAX,
};

// Enum TslGame.ENpcDirection
enum class ENpcDirection : uint8 {
	Forward,
	Backward,
	Left,
	Right,
	ForwardRight,
	BackwardRight,
	BackwardLeft,
	ForwardLeft,
	ENpcDirection_MAX,
};

// Enum TslGame.ENpcWalkingSpeedType
enum class ENpcWalkingSpeedType : uint8 {
	Idle,
	Walk,
	Run,
	Sprint,
	ENpcWalkingSpeedType_MAX,
};

// Enum TslGame.ENpcCharacterStateType
enum class ENpcCharacterStateType : uint8 {
	Default,
	Respawn,
	Fire1,
	Fire2,
	Fire3,
	Knockback,
	Knockdown,
	Getup,
	ThrowPhase1,
	ThrowPhase2,
	ThrowPhase3,
	Blind,
	Despawn,
	RunnerScream,
	ThrowBuff,
	Scream,
	Kidnap,
	Dash,
	InSafeZone,
	MeleeAttackWhileKidnapping,
	DoctorThrowPhase1,
	DoctorThrowPhase2,
	DoctorThrowPhase3,
	ENpcCharacterStateType_MAX,
};

// Enum TslGame.ERandomType
enum class ERandomType : uint8 {
	Random,
	Shuffle,
	Ascending,
	Descending,
	ERandomType_MAX,
};

// Enum TslGame.ECustomAnimDataType
enum class ECustomAnimDataType : uint8 {
	CustomAnimData,
	AnimSequence,
	ECustomAnimDataType_MAX,
};

// Enum TslGame.ECustomAnimSlotType
enum class ECustomAnimSlotType : uint8 {
	FullBody,
	UpperBody,
	FullBodyInstance,
	UpperBodyInstance,
	LowerBody,
	ECustomAnimSlotType_MAX,
};

// Enum TslGame.ERetriggerCounter
enum class ERetriggerCounter : uint8 {
	First,
	Sec,
	Third,
	Fourth,
	ERetriggerCounter_MAX,
};

// Enum TslGame.EPathDebugType
enum class EPathDebugType : uint8 {
	None,
	Location,
	SelectNpc,
	EPathDebugType_MAX,
};

// Enum TslGame.EOneOnOneRoomState
enum class EOneOnOneRoomState : uint8 {
	None,
	MatchPrepare,
	MatchStart,
	MatchEnd,
	MatchEndResult,
	RoundStart,
	RoundPlaying,
	GiveScore,
	BreakTime,
	RoundResult,
	RoundEnd,
	EOneOnOneRoomState_MAX,
};

// Enum TslGame.EOneOnOneStageType
enum class EOneOnOneStageType : uint8 {
	None,
	Arena,
	Audience,
	EOneOnOneStageType_MAX,
};

// Enum TslGame.EOneOnOneTicketState
enum class EOneOnOneTicketState : uint8 {
	None,
	Waiting,
	CountDown,
	Playing,
	EOneOnOneTicketState_MAX,
};

// Enum TslGame.EOneOnOneSideType
enum class EOneOnOneSideType : uint8 {
	None,
	Home,
	Away,
	Audience,
	EOneOnOneSideType_MAX,
};

// Enum TslGame.EOneOnOneInvenRecoverType
enum class EOneOnOneInvenRecoverType : uint8 {
	None,
	Empty,
	Recover,
	EOneOnOneInvenRecoverType_MAX,
};

// Enum TslGame.EOneOnOneResultType
enum class EOneOnOneResultType : uint8 {
	None,
	Lose,
	Win,
	Draw,
	Escape,
	EOneOnOneResultType_MAX,
};

// Enum TslGame.EOneOnOneMessageType
enum class EOneOnOneMessageType : uint8 {
	None,
	StartSearch_Message,
	StopSearch_Message_Normal,
	StopSearch_Message_UseDiffFacility,
	EnterArena_Message,
	ExitArena_Message_Normal,
	ExitArena_Message_FromAudience,
	CannotSearch_Message_NotInProgress,
	EOneOnOneMessageType_MAX,
};

// Enum TslGame.*0e8f71de4a
enum class *0e8f71de4a : uint8 {
	*d6ad368e6f,
	*4b690f0ff9,
	*436d17db8e,
	*a70222b0f2,
	*76c4c42892,
	*0e8f71de4a_MAX,
};

// Enum TslGame.*77f15b8f03
enum class *77f15b8f03 : uint8 {
	*4f3e19659f,
	*97b9d489ae,
	*4986f73a6d,
	*f1b807f42a,
	*77f15b8f03_MAX,
};

// Enum TslGame.*efcb09404e
enum class *efcb09404e : uint8 {
	*14f6d801e3,
	*955d55b298,
	*f5d06db23d,
	*e2a2b65ab4,
	*efcb09404e_MAX,
};

// Enum TslGame.*0623824d04
enum class *0623824d04 : uint8 {
	*45a9de9525,
	*381865cc28,
	*5a30f3f514,
	*3551f654d4,
	*6d9acc026b,
	*0623824d04_MAX,
};

// Enum TslGame.*ab3a38f38c
enum class *ab3a38f38c : uint8 {
	*9db6f9ad5d,
	*60ce0e4d91,
	*749c82e0eb,
	*ab3a38f38c_MAX,
};

// Enum TslGame.ECorrectedSpawnLocationTraceType
enum class ECorrectedSpawnLocationTraceType : uint8 {
	Sweep,
	Trace,
	ECorrectedSpawnLocationTraceType_MAX,
};

// Enum TslGame.EThrowableState
enum class EThrowableState : uint8 {
	Idle,
	PinOff,
	Cooking,
	Throw,
	Dropped,
	EThrowableState_MAX,
};

// Enum TslGame.EProjectileExplosionStartType
enum class EProjectileExplosionStartType : uint8 {
	NotStart,
	Impact,
	Delay,
	ImpactOrDelay,
	EProjectileExplosionStartType_MAX,
};

// Enum TslGame.*ef6c83101e
enum class *ef6c83101e : uint8 {
	*550cbf927f,
	*b2824a9553,
	*05377caab4,
	*d1d907f16f,
	*ef6c83101e_MAX,
};

// Enum TslGame.*fde18555bc
enum class *fde18555bc : uint8 {
	*2d9fddbc13,
	*85f9bcbc58,
	*020db4e9c8,
	*22cc8a0583,
	*fde18555bc_MAX,
};

// Enum TslGame.*1801a5a1d8
enum class *1801a5a1d8 : uint8 {
	*2b101c22ae,
	*c77e558fc2,
	*cf72ee7430,
	*91700fdf0f,
	*1801a5a1d8_MAX,
};

// Enum TslGame.ETslSLBAreaBlockActorState
enum class ETslSLBAreaBlockActorState : uint8 {
	Close,
	Open,
	MAX,
	ETslSLBAreaBlockActorState_MAX,
};

// Enum TslGame.ETslSLBExitActorState
enum class ETslSLBExitActorState : uint8 {
	Close,
	Open,
	MAX,
	ETslSLBExitActorState_MAX,
};

// Enum TslGame.ETargetInteractionPurpose
enum class ETargetInteractionPurpose : uint8 {
	Move,
	Reset,
	ETargetInteractionPurpose_MAX,
};

// Enum TslGame.ETrainingRoomInteractionType
enum class ETrainingRoomInteractionType : uint8 {
	None,
	Training_Stop,
	ETrainingRoomInteractionType_MAX,
};

// Enum TslGame.ESeatDirection
enum class ESeatDirection : uint8 {
	Forward,
	Backward,
	Left,
	Right,
	ESeatDirection_MAX,
};

// Enum TslGame.ESpareTireProcessState
enum class ESpareTireProcessState : uint8 {
	None,
	PutWorking,
	PutCancel,
	PutFinish,
	TakeWorking,
	TakeCancel,
	TakeFinish,
	ESpareTireProcessState_MAX,
};

// Enum TslGame.EMapColor
enum class EMapColor : uint8 {
	Undefined,
	Red,
	Green,
	Blue,
	Yellow,
	EMapColor_MAX,
};

// Enum TslGame.EVehicleEngineState
enum class EVehicleEngineState : uint8 {
	EEngineStateAutoOff,
	EEngineStateAutoOn,
	EEngineStateManualOff,
	EEngineStateManualOn,
	EVehicleEngineState_MAX,
};

// Enum TslGame.*ee237c3a51
enum class *ee237c3a51 : uint8 {
	*c1d8690da6,
	*3d5df9662e,
	*49a4fc0f41,
	*654de9db2c,
	*459f050ac5,
	*ee237c3a51_MAX,
};

// Enum TslGame.EPackageState
enum class EPackageState : uint8 {
	Normal,
	Broken,
	Empty,
	EPackageState_MAX,
};

// Enum TslGame.EPackageDoorState
enum class EPackageDoorState : uint8 {
	CLOSED,
	OPENING,
	OPENED,
	EPackageDoorState_MAX,
};

// Enum TslGame.EThingGroupSpawnType
enum class EThingGroupSpawnType : uint8 {
	None,
	Probability,
	TotalCount,
	EThingGroupSpawnType_MAX,
};

// Enum TslGame.EInteractionErrorType
enum class EInteractionErrorType : uint8 {
	None,
	Success,
	Fail_SearchingOneOnOne,
	Fail_PlayingOneOnOne,
	EInteractionErrorType_MAX,
};

// Enum TslGame.*3dd61137cb
enum class *3dd61137cb : uint8 {
	*cefdadb26f,
	*0ba1ad2cca,
	*d711f50767,
	*30c5ffc2c6,
	*3dd61137cb_MAX,
};

// Enum TslGame.*cb4b49374c
enum class *cb4b49374c : uint8 {
	*823b9f38c3,
	*4d211f1449,
	*97ef10ce89,
	*64e1f1811f,
	*cb4b49374c_MAX,
};

// Enum TslGame.EContainerState
enum class EContainerState : uint8 {
	Closed,
	Opening,
	Opened,
	EContainerState_MAX,
};

// Enum TslGame.ESpawnDestroyTiming
enum class ESpawnDestroyTiming : uint8 {
	Undefined,
	SpawnOnMatchStart,
	DestoryOnMatchStart,
	ESpawnDestroyTiming_MAX,
};

// Enum TslGame.*fba1fa3383
enum class *fba1fa3383 : uint8 {
	*de6ec3bde7,
	*fe6fee7d2e,
	*6916510eaf,
	*fba1fa3383_MAX,
};

// Enum TslGame.ELastMoveTask
enum class ELastMoveTask : uint8 {
	MoveTo,
	MoveDirectlyToward,
	ELastMoveTask_MAX,
};

// Enum TslGame.EEjectAllowed
enum class EEjectAllowed : uint8 {
	NotAllowed,
	Waiting,
	Allowed,
	EEjectAllowed_MAX,
};

// Enum TslGame.EUltAutoEquipItemType
enum class EUltAutoEquipItemType : uint8 {
	SubParts,
	Throwable,
	Boost,
	Heal,
	Other,
	EUltAutoEquipItemType_MAX,
};

// Enum TslGame.ECompareTeamDist
enum class ECompareTeamDist : uint8 {
	CurDest,
	FinalDest,
	SafeZone,
	ECompareTeamDist_MAX,
};

// Enum TslGame.EAirDropType
enum class EAirDropType : uint8 {
	NormalCarePackage,
	CustomAirDrop,
	Market,
	EAirDropType_MAX,
};

// Enum TslGame.EHelicopterState
enum class EHelicopterState : uint8 {
	Normal,
	Smoke,
	Explosion,
	EHelicopterState_MAX,
};

// Enum TslGame.EEmergencyAircraftState
enum class EEmergencyAircraftState : uint8 {
	None,
	Flame,
	Explosion,
	LastExplosion,
	Destroy,
	EEmergencyAircraftState_MAX,
};

// Enum TslGame.EEmPickup_PathValidationState
enum class EEmPickup_PathValidationState : uint8 {
	None,
	InProgress,
	Valid,
	Invalid,
	EEmPickup_MAX,
};

// Enum TslGame.*675d0ae66b
enum class *675d0ae66b : uint8 {
	*bfd3c11acd,
	*7b11f1fe8c,
	*675d0ae66b_MAX,
};

// Enum TslGame.*a918f31350
enum class *a918f31350 : uint8 {
	*bb323191d1,
	*a307e307c5,
	*86940c8f2c,
	*d4f3b0e025,
	*7070cf4784,
	*dbfcad796d,
	*ea9b03a786,
	*fbaba8f75c,
	*7c22c0cca6,
	*6368414a4a,
	*2aa2515bda,
	*1975d6cabe,
	*21a7907f86,
	*a918f31350_MAX,
};

// Enum TslGame.*46466626aa
enum class *46466626aa : uint8 {
	*e64c0f2c38,
	*53271209ab,
	*2d4aea50e5,
	*ba986c38af,
	*46466626aa_MAX,
};

// Enum TslGame.*93611b8209
enum class *93611b8209 : uint8 {
	*66ff9947df,
	*4857019c99,
	*b35bd9afcf,
	*94abfb96c2,
	*58e7c401fb,
	*b4bc3ce2c7,
	*93611b8209_MAX,
};

// Enum TslGame.EOPUIBuffLocationType
enum class EOPUIBuffLocationType : uint8 {
	None,
	TPP,
	FPP,
	FPPWithMosnterHp,
	MAX,
	EOPUIBuffLocationType_MAX,
};

// Enum TslGame.EClanNoticeUGCLevel
enum class EClanNoticeUGCLevel : uint8 {
	Hide,
	Show,
	EClanNoticeUGCLevel_MAX,
};

// Enum TslGame.EClanNameUGCLevel
enum class EClanNameUGCLevel : uint8 {
	HideAll,
	OnlyMine,
	MineAndOthersTag,
	ShowAll,
	EClanNameUGCLevel_MAX,
};

// Enum TslGame.EPlayerArenaObserverState
enum class EPlayerArenaObserverState : uint8 {
	Off,
	RoundPreview,
	FinalRoundPreview,
	WonAlive,
	WonDead,
	RoundFinished,
	RoundFinishedWhileLoot,
	RoundResultWithObserve,
	RoundResult,
	Eliminated,
	AfterRoundLoadout,
	EPlayerArenaObserverState_MAX,
};

// Enum TslGame.EArenaMoneySource
enum class EArenaMoneySource : uint8 {
	Initial,
	Kill,
	Revive,
	WinArena,
	LoseArena,
	Buy,
	EArenaMoneySource_MAX,
};

// Enum TslGame.EArenaScreenOpen
enum class EArenaScreenOpen : uint8 {
	Loadout,
	Leaderboard,
	EArenaScreenOpen_MAX,
};

// Enum TslGame.EArenaCameraObserveState
enum class EArenaCameraObserveState : uint8 {
	Off,
	FreeFly,
	AttachedToPlayer,
	EArenaCameraObserveState_MAX,
};

// Enum TslGame.*627dcd4840
enum class *627dcd4840 : uint8 {
	*e38378ca8f,
	*6e41a65838,
	*33f083ac51,
	*1b0cde6644,
	*f950819cc7,
	*ad2b1b3249,
	*d67792a147,
	*aed538e811,
	*cc1ced58ab,
	*627dcd4840_MAX,
};

// Enum TslGame.EStrictSelectObserveTarget
enum class EStrictSelectObserveTarget : uint8 {
	None,
	Arena,
	Player,
	EStrictSelectObserveTarget_MAX,
};

// Enum TslGame.EFutsalSoundType
enum class EFutsalSoundType : uint8 {
	Goal,
	Start,
	Finish,
	EFutsalSoundType_MAX,
};

// Enum TslGame.EHASSurvivorItemLevel
enum class EHASSurvivorItemLevel : uint8 {
	None,
	Lv1,
	Lv2,
	EHASSurvivorItemLevel_MAX,
};

// Enum TslGame.EHASSurvivorItemType
enum class EHASSurvivorItemType : uint8 {
	None,
	Flashbang,
	Healkit,
	Toolkit,
	SmokeBomb,
	EHASSurvivorItemType_MAX,
};

// Enum TslGame.EHASSurvivorCorruptPhase
enum class EHASSurvivorCorruptPhase : uint8 {
	None,
	PhaseOne,
	PhaseTwo,
	Corrupted,
	EHASSurvivorCorruptPhase_MAX,
};

// Enum TslGame.EHASSurvivorBreathState
enum class EHASSurvivorBreathState : uint8 {
	None,
	NormalBreath,
	FastBreath,
	Exhausted,
	EHASSurvivorBreathState_MAX,
};

// Enum TslGame.EHASSurvivorState
enum class EHASSurvivorState : uint8 {
	Normal,
	Injured,
	DBNO,
	BodyCarried,
	Captured,
	Dead,
	Escaped,
	Sacrificed,
	EndgameDead,
	EHASSurvivorState_MAX,
};

// Enum TslGame.EHASSeekerState
enum class EHASSeekerState : uint8 {
	Normal,
	Stunned,
	EHASSeekerState_MAX,
};

// Enum TslGame.EHASPlayerRole
enum class EHASPlayerRole : uint8 {
	None,
	Killer,
	Survivor,
	EHASPlayerRole_MAX,
};

// Enum TslGame.ETslParticleCullType
enum class ETslParticleCullType : uint8 {
	None,
	Distance,
	Frustum,
	LastRenderedTime,
	SameTransform,
	NearbyTransform,
	DistAndFrustumAndNear,
	All,
	ETslParticleCullType_MAX,
};

// Enum TslGame.ETslParticleGroupPriority
enum class ETslParticleGroupPriority : uint8 {
	High,
	Low,
	ETslParticleGroupPriority_MAX,
};

// Enum TslGame.ETslHASStencilColor
enum class ETslHASStencilColor : uint8 {
	None,
	SpectatedCharacter,
	SpectatedCharacterTeam,
	SpectatedCharacterEnemy,
	WithoutSpectatedCharacter,
	WithoutSpectatedTeamCharacter,
	InteractionFocusingColor,
	SandboxOutline,
	Invincible,
	ETslHASStencilColor_MAX,
};

// Enum TslGame.*062039cd9d
enum class *062039cd9d : uint8 {
	*86cf7f40af,
	*236785aa19,
	*66d921bace,
	*e12d1a7b5c,
	*ed7bdceb97,
	*39d50e2af2,
	*b1dfe238be,
	*062039cd9d_MAX,
};

// Enum TslGame.ETslHASInteractType
enum class ETslHASInteractType : uint8 {
	BlockAllInteractive,
	InteractionObjectCanPassThrough,
	ETslHASInteractType_MAX,
};

// Enum TslGame.ETslHASFixTargetState
enum class ETslHASFixTargetState : uint8 {
	PreStart,
	Normal,
	StopFixing,
	Fixing,
	Explode,
	Broken,
	Fixed,
	ETslHASFixTargetState_MAX,
};

// Enum TslGame.EHASSoundType
enum class EHASSoundType : uint8 {
	Breath,
	BreathStop,
	FastBreath,
	FastBreathStop,
	HeartBeat,
	ReadyToFire,
	Exhausted,
	ExhaustedStop,
	Moan,
	MoanStop,
	Panic,
	CabinetPanic,
	SeekerStun,
	EHASSoundType_MAX,
};

// Enum TslGame.ETslHAS_QTEType
enum class ETslHAS_QTEType : uint8 {
	Generator,
	Wiggle,
	Prison,
	Healing,
	None,
	ETslHAS_MAX,
};

// Enum TslGame.ETslHASActiveEffet
enum class ETslHASActiveEffet : uint8 {
	GeneratorActive,
	PrisonActive,
	ExitActive,
	None,
	ETslHASActiveEffet_MAX,
};

// Enum TslGame.*3a367d8624
enum class *3a367d8624 : uint8 {
	*b6cc2f0b7e,
	*568facfe9a,
	*3a367d8624_MAX,
};

// Enum TslGame.EPrivateTrainingRoomPhase
enum class EPrivateTrainingRoomPhase : uint8 {
	None,
	FinishSelect_Practice,
	StartSelect_Weapon,
	SetupStart_Practice,
	CountDownStart_Practice,
	Start_Practice,
	Cancel_Practice,
	Finish_Practice,
	Restart_Practice,
	Exit_Practice,
	EPrivateTrainingRoomPhase_MAX,
};

// Enum TslGame.EPrivateWaitingRoomPhase
enum class EPrivateWaitingRoomPhase : uint8 {
	None,
	LoadingMap,
	Ready,
	StartSelect_Practice,
	EPrivateWaitingRoomPhase_MAX,
};

// Enum TslGame.ETrainingScoreType
enum class ETrainingScoreType : uint8 {
	None,
	HeadShot,
	Kill,
	SoundCatch,
	TotalScore,
	AimAccuracy,
	ETrainingScoreType_MAX,
};

// Enum TslGame.ETrainingPracticeType
enum class ETrainingPracticeType : uint8 {
	None,
	Practice_Aim,
	Practice_Sound,
	ETrainingPracticeType_MAX,
};

// Enum TslGame.ETslTrainingTeleportType
enum class ETslTrainingTeleportType : uint8 {
	InfoThumnail,
	MapIconVolume,
	NONE,
	ETslTrainingTeleportType_MAX,
};

// Enum TslGame.EBombUIHUDTimerStatusType
enum class EBombUIHUDTimerStatusType : uint8 {
	None,
	RoundTime,
	Attack,
	Defence,
	MAX,
	EBombUIHUDTimerStatusType_MAX,
};

// Enum TslGame.EBombUIMatchResultType
enum class EBombUIMatchResultType : uint8 {
	None,
	Lose,
	Win,
	Draw,
	MAX,
	EBombUIMatchResultType_MAX,
};

// Enum TslGame.EBombUIPlayerStatusType
enum class EBombUIPlayerStatusType : uint8 {
	None,
	Alive,
	DBNO,
	Die,
	Disconnected,
	MAX,
	EBombUIPlayerStatusType_MAX,
};

// Enum TslGame.ETslPreloadPriority
enum class ETslPreloadPriority : uint8 {
	Static,
	Dynamic,
	ETslPreloadPriority_MAX,
};

// Enum TslGame.BlueChipTowerAnimState
enum class BlueChipTowerAnimState : uint8 {
	Wait,
	IsInUse,
	Success,
	BlueChipTowerAnimState_MAX,
};

// Enum TslGame.EFollowTargetType
enum class EFollowTargetType : uint8 {
	Bot,
	CurrentPlayer,
	EFollowTargetType_MAX,
};

// Enum TslGame.*2c2a3af4b6
enum class *2c2a3af4b6 : uint8 {
	*fec50c6b19,
	*0dc67d24a1,
	*2c2a3af4b6_MAX,
};

// Enum TslGame.EHASGamePhase
enum class EHASGamePhase : uint8 {
	NotStarted,
	Started,
	GeneratorAllFixed,
	EndGame,
	MatchEnded,
	EHASGamePhase_MAX,
};

// Enum TslGame.EHASPrisonSoundType
enum class EHASPrisonSoundType : uint8 {
	Bluezone,
	BluezoneStop,
	Sink,
	EHASPrisonSoundType_MAX,
};

// Enum TslGame.ETslHASPrisonState
enum class ETslHASPrisonState : uint8 {
	PreStart,
	Normal,
	Broken,
	SurvivorHooked,
	Sacrificed,
	Reload,
	ETslHASPrisonState_MAX,
};

// Enum TslGame.*c7fd0975aa
enum class *c7fd0975aa : uint8 {
	*a0b11b0904,
	*6241d030cb,
	*afcb762542,
	*e9bb9f6731,
	*91963bded7,
	*a1365cc453,
	*6bb159a229,
	*063fd33631,
	*82c76b2480,
	*c7fd0975aa_MAX,
};

// Enum TslGame.EHealthDebuffType
enum class EHealthDebuffType : uint8 {
	None,
	Bleed,
	EHealthDebuffType_MAX,
};

// Enum TslGame.EControlDebuffType
enum class EControlDebuffType : uint8 {
	None,
	Stun,
	Trap,
	Slow,
	EControlDebuffType_MAX,
};

// Enum TslGame.EBulletproofShieldDurabilityState
enum class EBulletproofShieldDurabilityState : uint8 {
	None,
	Normal,
	Damaged,
	DamagedSeverely,
	Destroyed,
	EBulletproofShieldDurabilityState_MAX,
};

// Enum TslGame.EBulletproofShieldInstallState
enum class EBulletproofShieldInstallState : uint8 {
	None,
	InstallInprogress,
	InstallComplete,
	Destroyed,
	EBulletproofShieldInstallState_MAX,
};

// Enum TslGame.*c9c6d899fc
enum class *c9c6d899fc : uint8 {
	*93006d7ead,
	*5a7c53033d,
	*8a59d9b1a0,
	*3c792d6656,
	*58b45677dd,
	*c410ff8d8a,
	*b0cf91e28d,
	*c1a77f5e32,
	*0e2abbe131,
	*c9c6d899fc_MAX,
};

// Enum TslGame.EAITaskState
enum class EAITaskState : uint8 {
	Idle,
	Tasking,
	Done,
	InValid,
	EAITaskState_MAX,
};

// Enum TslGame.EZombieTargetingType
enum class EZombieTargetingType : uint8 {
	Passive,
	Aggressive,
	AggresiveRandom,
	EZombieTargetingType_MAX,
};

// Enum TslGame.EZombieAttackType
enum class EZombieAttackType : uint8 {
	Melee,
	Throw,
	EZombieAttackType_MAX,
};

// Enum TslGame.EDroneOperationalState
enum class EDroneOperationalState : uint8 {
	INVALID,
	ENABLED_ENUM_START,
	ENABLED,
	ENABLED_CONTROLLED,
	ENABLED_RETURNING_TO_OWNER,
	ENABLED_ENUM_END,
	DISABLED_ENUM_START,
	DISABLED,
	DISABLED_IN_WATER,
	DISABLED_DESTROYED,
	DISABLED_ENUM_END,
	COUNT,
	EDroneOperationalState_MAX,
};

// Enum TslGame.EDroneState
enum class EDroneState : uint8 {
	INVALID,
	STOWED,
	STOWING,
	PICK_UP,
	EQUIPPING,
	EQUIPPED,
	DEPLOYED,
	COUNT,
	EDroneState_MAX,
};

// Enum TslGame.*184bce6b16
enum class *184bce6b16 : uint8 {
	*876f1281cf,
	*829da85c99,
	*1e872f679c,
	*bf4d9de848,
	*184bce6b16_MAX,
};

// Enum TslGame.ELivingThingState
enum class ELivingThingState : uint8 {
	Idle,
	Alert,
	Dead,
	Max,
	ELivingThingState_MAX,
};

// Enum TslGame.*ab0aa9cfdb
enum class *ab0aa9cfdb : uint8 {
	*381865cc28,
	*477f19e726,
	*51f0f81ce3,
	*ab0aa9cfdb_MAX,
};

// Enum TslGame.EBodyCarryState
enum class EBodyCarryState : uint8 {
	Inactive,
	Active,
	PickingUp,
	Dropping,
	EBodyCarryState_MAX,
};

// Enum TslGame.ECountInfoAnimType
enum class ECountInfoAnimType : uint8 {
	None,
	Default,
	Decreasing,
	Increasing,
	Warning,
	Emerging,
	Vanishing,
	ECountInfoAnimType_MAX,
};

// Enum TslGame.*d465c1792c
enum class *d465c1792c : uint8 {
	*06a1315951,
	*978e88192d,
	*d465c1792c_MAX,
};

// Enum TslGame.ETrainingDashboardRange
enum class ETrainingDashboardRange : uint8 {
	None,
	Range10,
	Range50,
	Range100,
	ETrainingDashboardRange_MAX,
};

// Enum TslGame.ECustomDamageEventReactionType
enum class ECustomDamageEventReactionType : uint8 {
	SpawnActor,
	StopSpawnedParticles,
	HideMesh,
	HideMeshInstance,
	HideBone,
	ApplyPhysicalAnimationProfile,
	SetCollisionEnabled,
	ECustomDamageEventReactionType_MAX,
};

// Enum TslGame.*3301e7cc6f
enum class *3301e7cc6f : uint8 {
	*ff7cf7d188,
	*ac52f628fb,
	*262256293e,
	*3301e7cc6f_MAX,
};

// Enum TslGame.EScmCollisionGroup
enum class EScmCollisionGroup : uint8 {
	Default,
	FireField,
	ExplosiveItem,
	EScmCollisionGroup_MAX,
};

// Enum TslGame.EDamageFieldType
enum class EDamageFieldType : uint8 {
	Default,
	DirectTick,
	EDamageFieldType_MAX,
};

// Enum TslGame.EOptionTab
enum class EOptionTab : uint8 {
	Graphics,
	Audio,
	Controls,
	Gameplay,
	KeyBindings,
	EOptionTab_MAX,
};

// Enum TslGame.ETslGameOptionKeyBindingType
enum class ETslGameOptionKeyBindingType : uint8 {
	None,
	Action,
	Axis,
	ETslGameOptionKeyBindingType_MAX,
};

// Enum TslGame.ETslGameOptionSupplementaryType
enum class ETslGameOptionSupplementaryType : uint8 {
	None,
	KeyboardLayout,
	PreviewImage,
	PreviewCrosshair,
	VolumeUnitMeter,
	PreviewMaterial,
	LinkButton,
	ETslGameOptionSupplementaryType_MAX,
};

// Enum TslGame.ENaviGamepadInputType
enum class ENaviGamepadInputType : uint8 {
	DPad_Pressed,
	DPad_Released,
	Axis,
	Axis_Hold,
	ENaviGamepadInputType_MAX,
};

// Enum TslGame.EDynamicWeather
enum class EDynamicWeather : uint8 {
	NotInitialized,
	Initialized,
	BlendInStarted,
	Saturated,
	BlendOutStarted,
	BlendOutEnded,
	Finished,
	EDynamicWeather_MAX,
};

// Enum TslGame.EEffectSpreadState
enum class EEffectSpreadState : uint8 {
	ESS_InitialTrace,
	ESS_InitialProcess,
	ESS_Spreading,
	ESS_SpreadDone,
	ESS_Ending,
	ESS_MAX,
};

// Enum TslGame.*ed55acacb6
enum class *ed55acacb6 : uint8 {
	*e6c7296991,
	*4d3980e4cd,
	*a9d4c501d9,
	*8f22fad3c3,
	*ed55acacb6_MAX,
};

// Enum TslGame.ETslFenceSelector
enum class ETslFenceSelector : uint8 {
	None,
	Use_2,
	Use_3,
	Use_4,
	Use_5,
	ETslFenceSelector_MAX,
};

// Enum TslGame.EFlowTextState
enum class EFlowTextState : uint8 {
	None,
	Wait,
	FlowLeftOut,
	FlowLeftIn,
	FlowRightOut,
	FlowRightIn,
	BlinkAnimation,
	EFlowTextState_MAX,
};

// Enum TslGame.*32a75670a9
enum class *32a75670a9 : uint8 {
	*c6762fbe9e,
	*a8a64acc57,
	*78b211d3da,
	*9ff448f5f9,
	*ebe9940846,
	*cddc10c9b9,
	*310754b5c6,
	*32a75670a9_MAX,
};

// Enum TslGame.EBBHolderSelectMethod
enum class EBBHolderSelectMethod : uint8 {
	Closest,
	Random,
	EBBHolderSelectMethod_MAX,
};

// Enum TslGame.*db49647d70
enum class *db49647d70 : uint8 {
	*b6f46adcab,
	*1dd1205295,
	*3112ea310a,
	*b84a8871b3,
	*db49647d70_MAX,
};

// Enum TslGame.ERacingBgmTheme
enum class ERacingBgmTheme : uint8 {
	Default,
	WinterRaicng,
	ERacingBgmTheme_MAX,
};

// Enum TslGame.EHungerState
enum class EHungerState : uint8 {
	Normal,
	Hunger,
	Starvation,
	Famine,
	EHungerState_MAX,
};

// Enum TslGame.EWarModeCarePackageKitType
enum class EWarModeCarePackageKitType : uint8 {
	CarepackageKit_Off,
	CarepackageKit_Basic,
	CarepackageKit_ARKit,
	CarepackageKit_SRKit,
	CarepackageKit_MAX,
};

// Enum TslGame.*2c9fffa468
enum class *2c9fffa468 : uint8 {
	*02b48a485b,
	*1e9ed81052,
	*7b3b9af60c,
	*2c9fffa468_MAX,
};

// Enum TslGame.*3e8211350e
enum class *3e8211350e : uint8 {
	*ec1c79f7ac,
	*82d1020624,
	*8478209286,
	*3e8211350e_MAX,
};

// Enum TslGame.EVoiceChatChannel
enum class EVoiceChatChannel : uint8 {
	All,
	TeamOnly,
	None,
	MAX,
	EVoiceChatChannel_MAX,
};

// Enum TslGame.EVoiceInputMode_Console
enum class EVoiceInputMode_Console : uint8 {
	OpenMic,
	Disable,
	MAX,
	EVoiceInputMode_MAX,
};

// Enum TslGame.EVoiceInputMode_PC
enum class EVoiceInputMode_PC : uint8 {
	OpenMic,
	PushToTalk,
	Toggle,
	Disable,
	MAX,
	EVoiceInputMode_MAX,
};

// Enum TslGame.ERacingGamePhase
enum class ERacingGamePhase : uint8 {
	NotStarted,
	PrepareState,
	InProgress,
	EndPhase,
	End,
	ERacingGamePhase_MAX,
};

// Enum TslGame.EGarageState
enum class EGarageState : uint8 {
	None,
	DoorClosed,
	DoorOpening,
	DoorOpenedWithSiren,
	DoorOpenedWithFlashing,
	FinalState,
	EGarageState_MAX,
};

// Enum TslGame.EGasPumpState
enum class EGasPumpState : uint8 {
	Inactive,
	StartFueling,
	StopFueling,
	StopFuelingFull,
	EGasPumpState_MAX,
};

// Enum TslGame.ETslHelperInputActionType
enum class ETslHelperInputActionType : uint8 {
	DPad,
	Shoulder,
	Face,
	Keyboard,
	ETslHelperInputActionType_MAX,
};

// Enum TslGame.*2a3cb1f5b1
enum class *2a3cb1f5b1 : uint8 {
	*42dac3d825,
	*55611f9796,
	*6821c6e660,
	*2a3cb1f5b1_MAX,
};

// Enum TslGame.*82468da5cd
enum class *82468da5cd : uint8 {
	*86cf7f40af,
	*66d921bace,
	*39a7d3a3a7,
	*7e344fbc89,
	*195feff8f4,
	*7dd8dd6485,
	*82468da5cd_MAX,
};

// Enum TslGame.*0411e8014d
enum class *0411e8014d : uint8 {
	*86cf7f40af,
	*807eb42869,
	*66d921bace,
	*7b7a5267b4,
	*0411e8014d_MAX,
};

// Enum TslGame.ETrainingButtonActiveType
enum class ETrainingButtonActiveType : uint8 {
	Default,
	AimTrainingOnly,
	ETrainingButtonActiveType_MAX,
};

// Enum TslGame.EFireworkLauncherState
enum class EFireworkLauncherState : uint8 {
	ACTIVATED,
	DEACTIVATED_TEMPORARILY_BY_FIRE_DELAY,
	DEACTIVATED_PERMENANTLY_BY_OUT_OF_STOCK,
	EFireworkLauncherState_MAX,
};

// Enum TslGame.EVendingMachineState
enum class EVendingMachineState : uint8 {
	ACTIVATED,
	DEACTIVATED_TEMPORARILY_BY_PICK_DELAY,
	DEACTIVATED_TEMPORARILY_BY_DAMAGE,
	DEACTIVATED_TEMPORARILY_BY_JACKPOT,
	DEACTIVATED_PERMANANTLY_BY_EXCEEDED_MAX_PICK_COUNT,
	EVendingMachineState_MAX,
};

// Enum TslGame.EOutGameMontageState
enum class EOutGameMontageState : uint8 {
	Default,
	Playing,
	Interrupted,
	Finished,
	EOutGameMontageState_MAX,
};

// Enum TslGame.JukeBoxAnimState
enum class JukeBoxAnimState : uint8 {
	OPEN,
	CLOSED,
	JukeBoxAnimState_MAX,
};

// Enum TslGame.ELivingThingThreatLevel
enum class ELivingThingThreatLevel : uint8 {
	NoChanged,
	IncrementThreatLevel,
	DecrementThreatLevel,
	Calm,
	Fear,
	Panic,
	Dead,
	MAX,
	ELivingThingThreatLevel_MAX,
};

// Enum TslGame.ELivingThingCustomEvent
enum class ELivingThingCustomEvent : uint8 {
	HittedByBullet,
	HittedByExplosion,
	HittedByCar,
	HittedByCharacter,
	HittedByLivingThing,
	HittedByPhysicsBody,
	HittedByOthers,
	Custom1,
	Custom2,
	Custom3,
	Custom4,
	Custom5,
	Custom6,
	Custom7,
	Custom8,
	Custom9,
	Custom10,
	Custom11,
	Custom12,
	Custom13,
	Custom14,
	Custom15,
	Custom16,
	Custom17,
	Custom18,
	Custom19,
	Custom20,
	MAX,
	ELivingThingCustomEvent_MAX,
};

// Enum TslGame.ETLMeshSelection
enum class ETLMeshSelection : uint8 {
	Auto,
	StaticMesh,
	SkeletalMesh,
	None,
	ETLMeshSelection_MAX,
};

// Enum TslGame.ELobbyCharacterPosition
enum class ELobbyCharacterPosition : uint8 {
	Position1,
	Position2,
	Position3,
	Position4,
	ELobbyCharacterPosition_MAX,
};

// Enum TslGame.ELobbyCharacterReadyType
enum class ELobbyCharacterReadyType : uint8 {
	Ready,
	NotReady,
	ReadyToNotReady,
	NotReadyToReady,
	EmoteToReady,
	EmoteToNotReady,
	ELobbyCharacterReadyType_MAX,
};

// Enum TslGame.ETurnTableAnimState
enum class ETurnTableAnimState : uint8 {
	PLAYING,
	STOPPED,
	ETurnTableAnimState_MAX,
};

// Enum TslGame.ETslSLBZombieSpawnType
enum class ETslSLBZombieSpawnType : uint8 {
	Instant,
	Time,
	ETslSLBZombieSpawnType_MAX,
};

// Enum TslGame.EObserverPlayerListType
enum class EObserverPlayerListType : uint8 {
	Distance,
	Kill,
	Survivor,
	Max,
	EObserverPlayerListType_MAX,
};

// Enum TslGame.ECustomDamageZoneType
enum class ECustomDamageZoneType : uint8 {
	Head,
	UpperBody,
	LowerBody,
	Arms,
	Legs,
	ECustomDamageZoneType_MAX,
};

// Enum TslGame.ECustomDamageWeaponClass
enum class ECustomDamageWeaponClass : uint8 {
	Bullet,
	Melee,
	ECustomDamageWeaponClass_MAX,
};

// Enum TslGame.EArenaStartType
enum class EArenaStartType : uint8 {
	Player,
	AircraftStart,
	AircraftEnd,
	EArenaStartType_MAX,
};

// Enum TslGame.ERacingItemIcon
enum class ERacingItemIcon : uint8 {
	Heal,
	Ammo,
	Boost,
	Gun,
	FlareAmmo,
	FlashBang,
	Granade,
	SmokeBomb,
	SpikeTrap,
	StickyBomb,
	FirstKillBombardItem,
	FirstKillBombardItem_NotActivate,
	ERacingItemIcon_MAX,
};

// Enum TslGame.ERacingGameScoreType
enum class ERacingGameScoreType : uint8 {
	CheckPoint,
	Trick,
	Kill,
	ERacingGameScoreType_MAX,
};

// Enum TslGame.ETslSLBInteractionType
enum class ETslSLBInteractionType : uint8 {
	None,
	Generator,
	Refueling,
	ClearDebuff,
	OpenLastDoor,
	MAX,
	ETslSLBInteractionType_MAX,
};

// Enum TslGame.EPGALOutput
enum class EPGALOutput : uint8 {
	Succeeded,
	Failed,
	EPGALOutput_MAX,
};

// Enum TslGame.*68550269ed
enum class *68550269ed : uint8 {
	*c7db89eb5a,
	*6e8a464524,
	*2d6cdebc58,
	*38852513a6,
	*16d8dde108,
	*68550269ed_MAX,
};

// Enum TslGame.ESpikeDeploymentState
enum class ESpikeDeploymentState : uint8 {
	PreDeploy,
	Deploying,
	PostDeploy,
	Popped,
	Idle,
	ESpikeDeploymentState_MAX,
};

// Enum TslGame.E40mmDeployState
enum class E40mmDeployState : uint8 {
	None,
	FuseTriggered,
	DeployStarted,
	DeployFinished,
	DeployFailed,
	E40mmDeployState_MAX,
};

// Enum TslGame.*eaea621dd7
enum class *eaea621dd7 : uint8 {
	*0325928260,
	*e5a54eda6f,
	*b2f69c2981,
	*eaea621dd7_MAX,
};

// Enum TslGame.ETslPubgIdAssetType
enum class ETslPubgIdAssetType : uint8 {
	NONE,
	NAMEPLATE,
	EMBLEM,
	EMBLEM_ANIMATED,
	MEDAL1,
	MEDAL2,
	CLANPLATE,
	CLANPLATE_LOW_DEFINITION,
	TIER,
	ETslPubgIdAssetType_MAX,
};

// Enum TslGame.*5dc8cee212
enum class *5dc8cee212 : uint8 {
	*960880b704,
	*3b85c7d435,
	*38d7d11c15,
	*5dc8cee212_MAX,
};

// Enum TslGame.ETslReferenceObjType
enum class ETslReferenceObjType : uint8 {
	GameMode,
	Character,
	Preload,
	ETslReferenceObjType_MAX,
};

// Enum TslGame.*cfbd317cc7
enum class *cfbd317cc7 : uint8 {
	*14d5648d39,
	*345b6380d7,
	*f27d5a913d,
	*e11fce922d,
	*b217c0fbb1,
	*cfbd317cc7_MAX,
};

// Enum TslGame.ESLBTriggerShapeType
enum class ESLBTriggerShapeType : uint8 {
	Box,
	Sphere,
	ESLBTriggerShapeType_MAX,
};

// Enum TslGame.ESandStormSoundType
enum class ESandStormSoundType : uint8 {
	None,
	StartSound,
	LoopSound,
	InSound,
	OutSound,
	ESandStormSoundType_MAX,
};

// Enum TslGame.EReplayTimelineMode
enum class EReplayTimelineMode : uint8 {
	ReplayPlay,
	ReplayEditor,
	ReplayRender,
	EReplayTimelineMode_MAX,
};

// Enum TslGame.*35f1ff6b3a
enum class *35f1ff6b3a : uint8 {
	*cdbe1b2bd6,
	*57d295e454,
	*966fddf52f,
	*0c0f4354dd,
	*6cf594ec90,
	*35f1ff6b3a_MAX,
};

// Enum TslGame.*22c5a10a84
enum class *22c5a10a84 : uint8 {
	*08aba00506,
	*1b63afdcd5,
	*0e37739e1d,
	*01c590084e,
	*973827da9a,
	*085b14adc7,
	*193c71cc80,
	*a9e3f9998c,
	*35ca991a39,
	*b73c18538c,
	*8f66675070,
	*22c5a10a84_MAX,
};

// Enum TslGame.ERideVehicle
enum class ERideVehicle : uint8 {
	None,
	Ride,
	Leave,
	ERideVehicle_MAX,
};

// Enum TslGame.*9634cfbd4d
enum class *9634cfbd4d : uint8 {
	*025b501ceb,
	*9a8d987ffa,
	*b09bf38de3,
	*9634cfbd4d_MAX,
};

// Enum TslGame.*c7acf2eeee
enum class *c7acf2eeee : uint8 {
	*b0d4e65466,
	*4d8c2cff10,
	*496453848f,
	*c7acf2eeee_MAX,
};

// Enum TslGame.ETslFlareGunWidgetDisplayType
enum class ETslFlareGunWidgetDisplayType : uint8 {
	Worldmap,
	Hud,
	ETslFlareGunWidgetDisplayType_MAX,
};

// Enum TslGame.ERedeployProgressDotType
enum class ERedeployProgressDotType : uint8 {
	None,
	Pass,
	Start,
	Recruit,
	NotOpenYet,
	PlayingRedeploy,
	MAX,
	ERedeployProgressDotType_MAX,
};

// Enum TslGame.ETslTrainingDashboardRangeUIType
enum class ETslTrainingDashboardRangeUIType : uint8 {
	None,
	Range10,
	Range50,
	Range100,
	ETslTrainingDashboardRangeUIType_MAX,
};

// Enum TslGame.ETslTrainingDashboardPracticeUIType
enum class ETslTrainingDashboardPracticeUIType : uint8 {
	None,
	Practice_Aim,
	Practice_Sound,
	ETslTrainingDashboardPracticeUIType_MAX,
};

// Enum TslGame.*beded2285b
enum class *beded2285b : uint8 {
	*72be1268b7,
	*7e678e8cd5,
	*fba0da61a9,
	*93d23a0f1b,
	*67c9d5c914,
	*6007370a93,
	*ca44f7509c,
	*beded2285b_MAX,
};

// Enum TslGame.*5be6ab4f38
enum class *5be6ab4f38 : uint8 {
	*e96e9633e8,
	*9a8e242139,
	*7677a59893,
	*5be6ab4f38_MAX,
};

// Enum TslGame.EMeleeThrowState
enum class EMeleeThrowState : uint8 {
	Idle,
	Prepare,
	Throw,
	EMeleeThrowState_MAX,
};

// Enum TslGame.*601b770921
enum class *601b770921 : uint8 {
	*45ddd031ee,
	*3b5bbcd093,
	*c3f67dfbcf,
	*601b770921_MAX,
};

// Enum TslGame.EMinimapFocus
enum class EMinimapFocus : uint8 {
	CharacterFocus,
	NextPlayzoneFocus,
	None,
	EMinimapFocus_MAX,
};

// Enum TslGame.ETslArenaLoadoutItemCategory
enum class ETslArenaLoadoutItemCategory : uint8 {
	PistolAndShotgun,
	Smg,
	Ar,
	Dmr,
	Sr,
	Equipment,
	ETslArenaLoadoutItemCategory_MAX,
};

// Enum TslGame.ETslArenaLoadoutDirections
enum class ETslArenaLoadoutDirections : uint8 {
	Up,
	Right,
	Down,
	Left,
	ETslArenaLoadoutDirections_MAX,
};

// Enum TslGame.*fffa2fe3ae
enum class *fffa2fe3ae : uint8 {
	*8f1370cf9c,
	*fb0ce92891,
	*0c852eb1e4,
	*82f8640d38,
	*fffa2fe3ae_MAX,
};

// Enum TslGame.EConditionOfDeath
enum class EConditionOfDeath : uint8 {
	HeadShot,
	DBNO,
	DBNOByHeadShot,
	None,
	EConditionOfDeath_MAX,
};

// Enum TslGame.ETslTeamInfoIconState
enum class ETslTeamInfoIconState : uint8 {
	Default,
	Vehicle,
	Parachute,
	Die,
	Groggy,
	Quitter,
	AirCraft,
	ItemRequest,
	EmergencyPickup,
	BlueBallHolder,
	Redeploy,
	RedeployFighting,
	Revival,
	SpecificMode,
	Tasered,
	ETslTeamInfoIconState_MAX,
};

// Enum TslGame.EControllerImageType
enum class EControllerImageType : uint8 {
	XboxOne,
	PS4,
	Quail,
	Quail_ThirdParty,
	None,
	EControllerImageType_MAX,
};

// Enum TslGame.EBinaryStepperType
enum class EBinaryStepperType : uint8 {
	OFF,
	ON,
	EBinaryStepperType_MAX,
};

// Enum TslGame.EKeyIconCombinationDisplayType
enum class EKeyIconCombinationDisplayType : uint8 {
	NotUsed,
	Empty,
	Plus,
	Slash,
	EKeyIconCombinationDisplayType_MAX,
};

// Enum TslGame.EGamepadKeyIconDisplayType
enum class EGamepadKeyIconDisplayType : uint8 {
	Tap,
	DoubleTap,
	ComboHold,
	TimerHoldCircle,
	TimerHoldBar,
	EGamepadKeyIconDisplayType_MAX,
};

// Enum TslGame.EDirectMessageColorType
enum class EDirectMessageColorType : uint8 {
	Alert,
	System,
	Chat,
	Clan,
	MAX,
	EDirectMessageColorType_MAX,
};

// Enum TslGame.*3447aa27f8
enum class *3447aa27f8 : uint8 {
	*bc8fdcadd2,
	*bfff5752f6,
	*c2ab162989,
	*fa1c226f84,
	*3447aa27f8_MAX,
};

// Enum TslGame.*c6484a48d8
enum class *c6484a48d8 : uint8 {
	*2a37b7973a,
	*3fd30387e4,
	*e39c0373ae,
	*c6484a48d8_MAX,
};

// Enum TslGame.EEmotePlayViewType
enum class EEmotePlayViewType : uint8 {
	Disable,
	TeamMate_Enable,
	Interaction_Enable,
	EEmotePlayViewType_MAX,
};

// Enum TslGame.*570ce0e479
enum class *570ce0e479 : uint8 {
	*0091bb8c68,
	*1df914e2d2,
	*a6b7572995,
	*e39c0373ae,
	*570ce0e479_MAX,
};

// Enum TslGame.EBluezoneState
enum class EBluezoneState : uint8 {
	Wait,
	Release,
	NoRestrict,
	EBluezoneState_MAX,
};

// Enum TslGame.EStatInfoType
enum class EStatInfoType : uint8 {
	Kill,
	Damage,
	Assist,
	EStatInfoType_MAX,
};

// Enum TslGame.EDisplayPlayerInfoType
enum class EDisplayPlayerInfoType : uint8 {
	PlayerList,
	EngagedEnemies,
	NearbyPlayers,
	OtherEngagements,
	ObserverTeamInfoList,
	EDisplayPlayerInfoType_MAX,
};

// ScriptStruct TslGame.*c9db24d090
// Size: 0x30 (Inherited: 0x00)
struct F*c9db24d090 {
	struct FString PartyId; // 0x00(0x10)
	bool IsPartyLeader; // 0x10(0x01)
	enum class ERequestPartyState PartyState; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	int32 *009f371409; // 0x14(0x04)
	bool *f0523a2398; // 0x18(0x01)
	char pad_19[0x17]; // 0x19(0x17)
};

// ScriptStruct TslGame.*fa099ca0b4
// Size: 0x60 (Inherited: 0x00)
struct F*fa099ca0b4 {
	float *f9732ea868; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct U*f1c3ddafe1* *4f87548b38; // 0x08(0x08)
	struct UClass* *0ad023d030; // 0x10(0x08)
	struct ATslPlayerState* *ebb2344eed; // 0x18(0x08)
	struct FVector_NetQuantize *ca49446e09; // 0x20(0x0c)
	struct FVector_NetQuantize *abd9e87a6a; // 0x2c(0x0c)
	struct FName BoneName; // 0x38(0x08)
	float *d33a176815; // 0x40(0x04)
	bool *ee42d82e73; // 0x44(0x01)
	bool *bbdcf168bd; // 0x45(0x01)
	char *3b4a22e970 : 1; // 0x46(0x01)
	char *b1b5b38fa5 : 1; // 0x46(0x01)
	char *fc1bf92eb1 : 1; // 0x46(0x01)
	char pad_46_3 : 5; // 0x46(0x01)
	bool *a9a25e1e05; // 0x47(0x01)
	struct FName *c0bc9dec4b; // 0x48(0x08)
	struct FVector AttackerLocation; // 0x50(0x0c)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct TslGame.*ffb09d99ff
// Size: 0x40 (Inherited: 0x00)
struct F*ffb09d99ff {
	enum class EWeaponAttachmentSlotID AttachmentSlotID; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName AttachmentTag; // 0x08(0x08)
	struct UStaticMesh* AttachmentMeshAsset; // 0x10(0x20)
	struct FName AttachmentMeshName; // 0x30(0x08)
	struct UClass* AttachmentTemplate; // 0x38(0x08)
};

// ScriptStruct TslGame.DeathMessage
// Size: 0x108 (Inherited: 0x00)
struct FDeathMessage {
	struct FText KillerName; // 0x00(0x18)
	struct FText VictimName; // 0x18(0x18)
	struct FText KillerUniqueId; // 0x30(0x18)
	struct FUniqueNetIdRepl GroggyCauserUniqueId; // 0x48(0x18)
	struct FText VictimUniqueId; // 0x60(0x18)
	char bKillerIsOwner : 1; // 0x78(0x01)
	char bVictimIsOwner : 1; // 0x78(0x01)
	char bVictimIsPillar : 1; // 0x78(0x01)
	char bVictimIsMonster : 1; // 0x78(0x01)
	char pad_78_4 : 4; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	int32 KillerTeamNum; // 0x7c(0x04)
	int32 VictimTeamNum; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UTslDamageType* DamageType; // 0x88(0x08)
	struct FText InsertMessage; // 0x90(0x18)
	enum class EDamageReason DamageReason; // 0xa8(0x01)
	bool bGroggy; // 0xa9(0x01)
	char pad_AA[0x2]; // 0xaa(0x02)
	int32 AlivePlayerNum; // 0xac(0x04)
	int32 AliveTeamNum; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct FText DamageCauserName; // 0xb8(0x18)
	int32 DamageCauserLevel; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct UTexture* DamageCauserIcon; // 0xd8(0x08)
	float DamageCauserIconRatio; // 0xe0(0x04)
	bool bIsKillerExist; // 0xe4(0x01)
	bool bIsStealKilled; // 0xe5(0x01)
	bool bIsObserver; // 0xe6(0x01)
	bool bIsObserverAndKillerIsSpectated; // 0xe7(0x01)
	bool bIsObserverAndVictimIsSpectated; // 0xe8(0x01)
	bool bIsMidGameBanMessage; // 0xe9(0x01)
	char pad_EA[0x2]; // 0xea(0x02)
	float DistanceFromKillerToVictim; // 0xec(0x04)
	enum class EOutGamePlatformProvider KillerPlatform; // 0xf0(0x01)
	enum class EOutGamePlatformProvider VictimPlatform; // 0xf1(0x01)
	char pad_F2[0x16]; // 0xf2(0x16)
};

// ScriptStruct TslGame.*4cf7537d4a
// Size: 0x18 (Inherited: 0x00)
struct F*4cf7537d4a {
	struct F*b1ff9d361b *5dc8bd98a3; // 0x00(0x08)
	struct F*b1ff9d361b WeaponPackage; // 0x08(0x08)
	struct F*b1ff9d361b HealingPackage; // 0x10(0x08)
};

// ScriptStruct TslGame.*b1ff9d361b
// Size: 0x08 (Inherited: 0x00)
struct F*b1ff9d361b {
	bool bEnable; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *9efd00caa3; // 0x04(0x04)
};

// ScriptStruct TslGame.MapMarker
// Size: 0x10 (Inherited: 0x00)
struct FMapMarker {
	bool Show; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D MarkerPosition; // 0x04(0x08)
	enum class EMarkerType MarkerType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*98fbf2194a
// Size: 0x20 (Inherited: 0x10)
struct F*98fbf2194a : F*f76dda2bad {
	struct FVector SpawnPosition; // 0x10(0x0c)
	float *5576533b56; // 0x1c(0x04)
};

// ScriptStruct TslGame.*f76dda2bad
// Size: 0x10 (Inherited: 0x00)
struct F*f76dda2bad {
	enum class EPlatoonSupportRequestEventType EventType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 *89cdd10526; // 0x04(0x04)
	bool *752c9b68e9; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float StartTime; // 0x0c(0x04)
};

// ScriptStruct TslGame.*a7198b60ca
// Size: 0x24 (Inherited: 0x10)
struct F*a7198b60ca : F*f76dda2bad {
	enum class EPlatoonCarePackageType CarePackageType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 *a027bb1cd6; // 0x14(0x04)
	struct FVector *bc70f81ca8; // 0x18(0x0c)
};

// ScriptStruct TslGame.*d8845fdbea
// Size: 0x20 (Inherited: 0x00)
struct F*d8845fdbea {
	char pad_0[0x8]; // 0x00(0x08)
	struct AActor* TargetActor; // 0x08(0x08)
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct TslGame.*ff80ea7857
// Size: 0x20 (Inherited: 0x00)
struct F*ff80ea7857 {
	int32 *fdbecca384; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FText *15fb949bac; // 0x08(0x18)
};

// ScriptStruct TslGame.*b2163fc7c4
// Size: 0x28 (Inherited: 0x00)
struct F*b2163fc7c4 {
	int32 *3344b9d70b; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct ATslCharacter* Rider; // 0x08(0x08)
	char pad_10[0x18]; // 0x10(0x18)
};

// ScriptStruct TslGame.*84f81f38b4
// Size: 0x10 (Inherited: 0x00)
struct F*84f81f38b4 {
	float *fcfa6c34a2; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)
};

// ScriptStruct TslGame.*a67c32bc95
// Size: 0x10 (Inherited: 0x00)
struct F*a67c32bc95 {
	struct FVector2D *695452dabd; // 0x00(0x08)
	struct FVector2D *5718ee2974; // 0x08(0x08)
};

// ScriptStruct TslGame.TslPlayerStateSummary
// Size: 0x40 (Inherited: 0x00)
struct FTslPlayerStateSummary {
	struct FString UniqueId; // 0x00(0x10)
	struct FString PlayerName; // 0x10(0x10)
	int32 TeamNumber; // 0x20(0x04)
	int32 Ranking; // 0x24(0x04)
	int32 HeadShots; // 0x28(0x04)
	int32 NumKills; // 0x2c(0x04)
	float TotalGivenDamages; // 0x30(0x04)
	float LongestDistanceKill; // 0x34(0x04)
	float TotalMovedDistanceMeter; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct TslGame.TslReplaySummary
// Size: 0x90 (Inherited: 0x00)
struct FTslReplaySummary {
	struct FString MatchId; // 0x00(0x10)
	bool bIsServerRecording; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString RecordUserId; // 0x18(0x10)
	struct FString RecordAccountId; // 0x28(0x10)
	struct FString RecordUserNickName; // 0x38(0x10)
	struct FString MapName; // 0x48(0x10)
	struct FString WeatherName; // 0x58(0x10)
	struct FString RegionName; // 0x68(0x10)
	int32 NumPlayers; // 0x78(0x04)
	int32 NumTeams; // 0x7c(0x04)
	struct TArray<struct FTslPlayerStateSummary> PlayerStateSummaries; // 0x80(0x10)
};

// ScriptStruct TslGame.*d426284fec
// Size: 0x10 (Inherited: 0x00)
struct F*d426284fec {
	float DemoTime; // 0x00(0x04)
	float FogFallOff; // 0x04(0x04)
	float FogStartDistance; // 0x08(0x04)
	float FogDensity; // 0x0c(0x04)
};

// ScriptStruct TslGame.*767e40cc49
// Size: 0x98 (Inherited: 0x00)
struct F*767e40cc49 {
	bool bIsCustomGame; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString MapName; // 0x08(0x10)
	struct FString ModeName; // 0x18(0x10)
	struct FString MatchId; // 0x28(0x10)
	int32 TeamCount; // 0x38(0x04)
	int32 MinPlayerCount; // 0x3c(0x04)
	int32 MaxPlayerCount; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TMap<struct FString, struct FString> StringParameter; // 0x48(0x50)
};

// ScriptStruct TslGame.*6db9e357c2
// Size: 0x38 (Inherited: 0x00)
struct F*6db9e357c2 {
	float DemoTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString Weather; // 0x08(0x10)
	enum class ETslOvercastAction Action; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float InitElapsedTime; // 0x1c(0x04)
	float SaturateTime; // 0x20(0x04)
	float BlendInTime; // 0x24(0x04)
	float BlendOutTime; // 0x28(0x04)
	float TimeMultiplier; // 0x2c(0x04)
	float ThunderAngle; // 0x30(0x04)
	float ThunderDistance; // 0x34(0x04)
};

// ScriptStruct TslGame.*01a9c8eb33
// Size: 0xe0 (Inherited: 0x00)
struct F*01a9c8eb33 {
	int32 DataSetNumber; // 0x00(0x04)
	int32 TimeMS; // 0x04(0x04)
	bool IsSkip; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct FString Type; // 0x10(0x10)
	float FOV; // 0x20(0x04)
	float PositionX; // 0x24(0x04)
	float PositionY; // 0x28(0x04)
	float PositionZ; // 0x2c(0x04)
	float RotationX; // 0x30(0x04)
	float RotationY; // 0x34(0x04)
	float RotationZ; // 0x38(0x04)
	float Angle; // 0x3c(0x04)
	struct FString Target; // 0x40(0x10)
	struct FString InterpolationType; // 0x50(0x10)
	struct FString CameraDirection; // 0x60(0x10)
	struct FString ReplaySpeed; // 0x70(0x10)
	bool IsAutoExposureEnable; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct FString DofMethod; // 0x88(0x10)
	float DofFocalRegion; // 0x98(0x04)
	bool IsDofAutoFocus; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float DofFocalDistance; // 0xa0(0x04)
	float DofNearTransitionRegion; // 0xa4(0x04)
	float DofFarTransitionRegion; // 0xa8(0x04)
	float DofBokehScale; // 0xac(0x04)
	float DofBokehMaxSize; // 0xb0(0x04)
	float DofGaussianNearBlurSize; // 0xb4(0x04)
	float DofGaussianFarBlurSize; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct FString ColorGradingLUT; // 0xc0(0x10)
	float ColorGradingLUTIntensity; // 0xd0(0x04)
	float BloomIntensity; // 0xd4(0x04)
	float VignetteIntensity; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
};

// ScriptStruct TslGame.*c60f0b3cc6
// Size: 0x50 (Inherited: 0x00)
struct F*c60f0b3cc6 {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.TslOutGameLog
// Size: 0x20 (Inherited: 0x00)
struct FTslOutGameLog {
	struct FString Type; // 0x00(0x10)
	struct FString Log; // 0x10(0x10)
};

// ScriptStruct TslGame.*cea799111c
// Size: 0x10 (Inherited: 0x00)
struct F*cea799111c {
	struct UExponentialHeightFogComponent* *c59ce74cab; // 0x00(0x08)
	bool *520bd36450; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct TslGame.*3b7fa34312
// Size: 0x20 (Inherited: 0x00)
struct F*3b7fa34312 {
	enum class EQualityType QualityType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText DisplayQualityLevelName; // 0x08(0x18)
};

// ScriptStruct TslGame.TslMissionInLobby
// Size: 0x88 (Inherited: 0x00)
struct FTslMissionInLobby {
	struct FString MissionId; // 0x00(0x10)
	bool bAchieved; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString Description; // 0x18(0x10)
	int32 Priority; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FString Type; // 0x30(0x10)
	bool bLocked; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float ProgressRatio; // 0x44(0x04)
	struct FString ProgressText; // 0x48(0x10)
	struct FString MissionIconName; // 0x58(0x10)
	int32 InitialProgress; // 0x68(0x04)
	int32 CurrentProgress; // 0x6c(0x04)
	int32 MaximumProgress; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct TArray<struct FName> TargetGameModeList; // 0x78(0x10)
};

// ScriptStruct TslGame.PointInfo
// Size: 0x08 (Inherited: 0x00)
struct FPointInfo {
	int32 *d3c32d4fa1; // 0x00(0x04)
	int32 *14974ea3ee; // 0x04(0x04)
};

// ScriptStruct TslGame.TeamInfo
// Size: 0x50 (Inherited: 0x00)
struct FTeamInfo {
	struct FString TeamName; // 0x00(0x10)
	struct FString *ef17a00b89; // 0x10(0x10)
	struct UTexture2D* TeamIcon; // 0x20(0x08)
	struct FLinearColor TeamColor; // 0x28(0x10)
	struct FLinearColor *ce5bbf4b12; // 0x38(0x10)
	struct UTexture2D* TeamMember; // 0x48(0x08)
};

// ScriptStruct TslGame.ReplayItem
// Size: 0x100 (Inherited: 0x00)
struct FReplayItem {
	struct FString FriendlyName; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	bool bIsLive; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FDateTime Date; // 0x28(0x08)
	int32 SizeInBytes; // 0x30(0x04)
	int32 LengthInMS; // 0x34(0x04)
	int32 NumViewers; // 0x38(0x04)
	bool bIncomplete; // 0x3c(0x01)
	bool bIsVersionCompatible; // 0x3d(0x01)
	bool bIsCorrupted; // 0x3e(0x01)
	bool bIsServerRecording; // 0x3f(0x01)
	bool bShouldKeep; // 0x40(0x01)
	bool bArchived; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct FString GameVersion; // 0x48(0x10)
	int32 MK3DReplayVersion; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FString Mode; // 0x60(0x10)
	struct FString RecordUserId; // 0x70(0x10)
	struct FString RecordUserNickName; // 0x80(0x10)
	struct FString MapName; // 0x90(0x10)
	bool bAllDeadOrWin; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	int32 ArchiveSizeInBytes; // 0xa4(0x04)
	bool bIsClip; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	int32 ClipTime; // 0xac(0x04)
	int32 ClipStartTime; // 0xb0(0x04)
	int32 ClipEndTime; // 0xb4(0x04)
	struct FString ClipTargetUserId; // 0xb8(0x10)
	struct FString ClipTargetUserNickName; // 0xc8(0x10)
	struct FString ReportToken; // 0xd8(0x10)
	struct FString RecordAccountId; // 0xe8(0x10)
	bool bHaveCameraEvent; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
};

// ScriptStruct TslGame.*febe2d9de9
// Size: 0xb8 (Inherited: 0x00)
struct F*febe2d9de9 {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString KillerName; // 0x38(0x10)
	struct FString KillerNetId; // 0x48(0x10)
	struct FString VictimName; // 0x58(0x10)
	struct FString VictimNetId; // 0x68(0x10)
	struct FString DamageCauseClassName; // 0x78(0x10)
	int32 DamageTypeCategory; // 0x88(0x04)
	int32 DamageReason; // 0x8c(0x04)
	bool bGroggy; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FString KillerPlayerId; // 0x98(0x10)
	struct FString VictimPlayerId; // 0xa8(0x10)
};

// ScriptStruct TslGame.*68854952aa
// Size: 0x110 (Inherited: 0x00)
struct F*68854952aa {
	float LastUpdateTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString KillerUniqueId; // 0x08(0x10)
	struct FString KillerName; // 0x18(0x10)
	struct FString KillerPlayerId; // 0x28(0x10)
	struct FString VictimUniqueId; // 0x38(0x10)
	struct FString VictimName; // 0x48(0x10)
	struct FString VictimPlayerId; // 0x58(0x10)
	char pad_68[0xa8]; // 0x68(0xa8)
};

// ScriptStruct TslGame.*98a6b99ffe
// Size: 0x58 (Inherited: 0x00)
struct F*98a6b99ffe {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString RecordTargetName; // 0x38(0x10)
	struct FString RecordTargetNetId; // 0x48(0x10)
};

// ScriptStruct TslGame.*3b6355f693
// Size: 0x68 (Inherited: 0x00)
struct F*3b6355f693 {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString EtceteraEventCode; // 0x38(0x10)
	struct FString TargetNetId; // 0x48(0x10)
	struct FString TargetName; // 0x58(0x10)
};

// ScriptStruct TslGame.*483e1fa8af
// Size: 0xb8 (Inherited: 0x00)
struct F*483e1fa8af {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString InstigatorName; // 0x38(0x10)
	struct FString InstigatorNetId; // 0x48(0x10)
	struct FString VictimName; // 0x58(0x10)
	struct FString VictimNetId; // 0x68(0x10)
	struct FString DamageCauseClassName; // 0x78(0x10)
	int32 DamageTypeCategory; // 0x88(0x04)
	int32 DamageReason; // 0x8c(0x04)
	bool bGroggy; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FString InstigatorPlayerId; // 0x98(0x10)
	struct FString VictimPlayerId; // 0xa8(0x10)
};

// ScriptStruct TslGame.*9ef789e479
// Size: 0x18 (Inherited: 0x00)
struct F*9ef789e479 {
	int32 *55cc07cfde; // 0x00(0x04)
	int32 *07e8fe2596; // 0x04(0x04)
	struct TArray<struct F*11a971a205> *6f6c6a141e; // 0x08(0x10)
};

// ScriptStruct TslGame.*11a971a205
// Size: 0x18 (Inherited: 0x00)
struct F*11a971a205 {
	struct TArray<struct F*69533f7d79> *34e9bef84b; // 0x00(0x10)
	bool bIsLastStage; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 *cd736047b7; // 0x14(0x04)
};

// ScriptStruct TslGame.*69533f7d79
// Size: 0x60 (Inherited: 0x00)
struct F*69533f7d79 {
	struct TArray<struct F*67441706fa> *e4c44bd057; // 0x00(0x10)
	struct TArray<int32> *167b269b54; // 0x10(0x10)
	int32 *f7e22b016d; // 0x20(0x04)
	int32 *d93468be5f; // 0x24(0x04)
	enum class EArenaState *69533f7d79; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float *0fb86256f4; // 0x2c(0x04)
	float *a4c9793993; // 0x30(0x04)
	float *ef929f64d2; // 0x34(0x04)
	float *a4313a1ef6; // 0x38(0x04)
	int32 *32f14d1504; // 0x3c(0x04)
	float *b6b9efe04b; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FString Name; // 0x48(0x10)
	int32 *d042fc5734; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct TslGame.*67441706fa
// Size: 0x14 (Inherited: 0x00)
struct F*67441706fa {
	int32 TeamId; // 0x00(0x04)
	int32 Score; // 0x04(0x04)
	int32 *68e57b52d9; // 0x08(0x04)
	float *c309f4fe43; // 0x0c(0x04)
	bool *1157160472; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.*3585ae81e7
// Size: 0x10 (Inherited: 0x00)
struct F*3585ae81e7 {
	struct TArray<struct F*6252fec45d> DynamicTeamsInfo; // 0x00(0x10)
};

// ScriptStruct TslGame.*6252fec45d
// Size: 0x28 (Inherited: 0x00)
struct F*6252fec45d {
	int32 TeamId; // 0x00(0x04)
	int32 Chances; // 0x04(0x04)
	struct TArray<bool> RoundHistory; // 0x08(0x10)
	struct TArray<struct F*7fe32abc47> DynamicPlayersInfo; // 0x18(0x10)
};

// ScriptStruct TslGame.*7fe32abc47
// Size: 0x14 (Inherited: 0x00)
struct F*7fe32abc47 {
	int32 Kills; // 0x00(0x04)
	int32 Deaths; // 0x04(0x04)
	int32 DamageDealt; // 0x08(0x04)
	int32 money; // 0x0c(0x04)
	int32 MemberIndex; // 0x10(0x04)
};

// ScriptStruct TslGame.*1ea1e9db1e
// Size: 0x08 (Inherited: 0x00)
struct F*1ea1e9db1e {
	int32 GoalScore; // 0x00(0x04)
	bool bIsTeamElimination; // 0x04(0x01)
	bool bUseWarRoyaleBluezone; // 0x05(0x01)
	bool bUsingTeamXRay; // 0x06(0x01)
	char pad_7[0x1]; // 0x07(0x01)
};

// ScriptStruct TslGame.*1710975c6d
// Size: 0x50 (Inherited: 0x00)
struct F*1710975c6d {
	float TimeLimitSeconds; // 0x00(0x04)
	float LastRespawnTimeSeconds; // 0x04(0x04)
	struct TArray<int32> TeamIds; // 0x08(0x10)
	struct TArray<int32> TeamIndices; // 0x18(0x10)
	struct TArray<struct FString> TeamLeaderNames; // 0x28(0x10)
	struct TArray<struct FString> TeamLeaderClanNames; // 0x38(0x10)
	int32 TeamCount; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// ScriptStruct TslGame.*09fa194686
// Size: 0x30 (Inherited: 0x00)
struct F*09fa194686 {
	float TrainingScore; // 0x00(0x04)
	float TrainingPlayTime; // 0x04(0x04)
	bool TrainingStartCountDown; // 0x08(0x01)
	bool HeadShotCount; // 0x09(0x01)
	bool KillCount; // 0x0a(0x01)
	bool AimAccuracy; // 0x0b(0x01)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString WeaponName; // 0x10(0x10)
	float *ebec15cd31; // 0x20(0x04)
	bool *41029593f2; // 0x24(0x01)
	bool *c8dfce7fb6; // 0x25(0x01)
	bool *b92039e6a1; // 0x26(0x01)
	bool *166b6ae96f; // 0x27(0x01)
	bool *2a9c068da6; // 0x28(0x01)
	bool *d34d420009; // 0x29(0x01)
	bool *107e4ff0b0; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// ScriptStruct TslGame.TslReportUserInfo
// Size: 0x70 (Inherited: 0x00)
struct FTslReportUserInfo {
	struct FString PlayerName; // 0x00(0x10)
	struct FString ClanId; // 0x10(0x10)
	struct FString ClanTag; // 0x20(0x10)
	int32 ClanLevel; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString StreamerFakeName; // 0x38(0x10)
	struct FString NetId; // 0x48(0x10)
	struct FString AccountId; // 0x58(0x10)
	int32 TeamId; // 0x68(0x04)
	enum class ESubjectToReport SubjectToReport; // 0x6c(0x01)
	enum class EOutGamePlatformProvider PlayerPlatform; // 0x6d(0x01)
	enum class ETslAIPlayerType AIType; // 0x6e(0x01)
	char pad_6F[0x1]; // 0x6f(0x01)
};

// ScriptStruct TslGame.*c8ebdf3f58
// Size: 0x48 (Inherited: 0x00)
struct F*c8ebdf3f58 {
	enum class EMarketUIEquipCategory Category; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName ID; // 0x08(0x08)
	bool Reinforced; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FText ItemName; // 0x18(0x18)
	int32 Level; // 0x30(0x04)
	int32 Durability; // 0x34(0x04)
	int32 MaxDurability; // 0x38(0x04)
	int32 Cost; // 0x3c(0x04)
	struct UTexture2D* Icon; // 0x40(0x08)
};

// ScriptStruct TslGame.TslInputKey
// Size: 0x20 (Inherited: 0x00)
struct FTslInputKey {
	struct FKey Key; // 0x00(0x18)
	char bShift : 1; // 0x18(0x01)
	char bCtrl : 1; // 0x18(0x01)
	char bAlt : 1; // 0x18(0x01)
	char pad_18_3 : 5; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct TslGame.*77e367dd3f
// Size: 0x08 (Inherited: 0x00)
struct F*77e367dd3f {
	struct ATslPlayerState* PlayerState; // 0x00(0x08)
};

// ScriptStruct TslGame.*b532828ae1
// Size: 0x48 (Inherited: 0x08)
struct F*b532828ae1 : FTableRowBase {
	struct FString SubtitleKey; // 0x08(0x10)
	struct FString BlueZoneSubtitleKey; // 0x18(0x10)
	struct FString ItemSpawnSubtitleKey; // 0x28(0x10)
	struct FString VehicleSpawnSubtitleKey; // 0x38(0x10)
};

// ScriptStruct TslGame.*db31a9dd2f
// Size: 0x10 (Inherited: 0x00)
struct F*db31a9dd2f {
	struct TArray<struct F*0fdcb53c6c> OverrideTeamMarkAlphaForModeArray; // 0x00(0x10)
};

// ScriptStruct TslGame.*0fdcb53c6c
// Size: 0x08 (Inherited: 0x00)
struct F*0fdcb53c6c {
	enum class EMarkStates MarkStates; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Alpha; // 0x04(0x04)
};

// ScriptStruct TslGame.*36aa7d38cb
// Size: 0xb0 (Inherited: 0x00)
struct F*36aa7d38cb {
	struct F*418235c678 VectorCurve; // 0x00(0xa0)
	struct TArray<struct FName> ParamNames; // 0xa0(0x10)
};

// ScriptStruct TslGame.*418235c678
// Size: 0xa0 (Inherited: 0x98)
struct F*418235c678 : F*8a839061f6 {
	struct U*e6746d9844* VectorCurve; // 0x98(0x08)
};

// ScriptStruct TslGame.*8a839061f6
// Size: 0x98 (Inherited: 0x00)
struct F*8a839061f6 {
	char pad_0[0x18]; // 0x00(0x18)
	struct UUserWidget* Widget; // 0x18(0x08)
	char pad_20[0x78]; // 0x20(0x78)
};

// ScriptStruct TslGame.*5acf3b5ce3
// Size: 0xb0 (Inherited: 0x00)
struct F*5acf3b5ce3 {
	struct F*290fb51b30 FloatCurve; // 0x00(0xa0)
	struct TArray<struct FName> ParamNames; // 0xa0(0x10)
};

// ScriptStruct TslGame.*290fb51b30
// Size: 0xa0 (Inherited: 0x98)
struct F*290fb51b30 : F*8a839061f6 {
	struct UCurveFloat* FloatCurve; // 0x98(0x08)
};

// ScriptStruct TslGame.*5dab5acde7
// Size: 0xa0 (Inherited: 0x00)
struct F*5dab5acde7 {
	struct FSlateBrush Background; // 0x00(0x90)
	struct FLinearColor BrushColor; // 0x90(0x10)
};

// ScriptStruct TslGame.TestSpot
// Size: 0x0c (Inherited: 0x00)
struct FTestSpot {
	struct FVector2D Location; // 0x00(0x08)
	bool Disabled; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct TslGame.*201e292fcc
// Size: 0x10 (Inherited: 0x00)
struct F*201e292fcc {
	struct TArray<struct F*cdfe802bcd> *e273c8aec4; // 0x00(0x10)
};

// ScriptStruct TslGame.*cdfe802bcd
// Size: 0x0c (Inherited: 0x00)
struct F*cdfe802bcd {
	float X; // 0x00(0x04)
	float Y; // 0x04(0x04)
	bool Disabled; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct TslGame.*9eeafa1e6a
// Size: 0x10 (Inherited: 0x00)
struct F*9eeafa1e6a {
	struct U*b7029b276d* Widget; // 0x00(0x08)
	struct FVector2D LastPosition; // 0x08(0x08)
};

// ScriptStruct TslGame.*10859ab837
// Size: 0x28 (Inherited: 0x00)
struct F*10859ab837 {
	struct FText DirectionText; // 0x00(0x18)
	struct FLinearColor TextColor; // 0x18(0x10)
};

// ScriptStruct TslGame.*9d02742782
// Size: 0x40 (Inherited: 0x08)
struct F*9d02742782 : FTableRowBase {
	enum class EGuideKeyType KeyType; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct F*13de65a409 Info; // 0x10(0x30)
};

// ScriptStruct TslGame.*13de65a409
// Size: 0x30 (Inherited: 0x00)
struct F*13de65a409 {
	struct TArray<struct F*3f61a59fe9> *f672c0d9f4; // 0x00(0x10)
	struct FText DescriptionText; // 0x10(0x18)
	bool *187f3445c2; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// ScriptStruct TslGame.*3f61a59fe9
// Size: 0x40 (Inherited: 0x00)
struct F*3f61a59fe9 {
	bool *3056639d9b; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FKey Key; // 0x08(0x18)
	bool *5ea4a31cea; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FName ActionName; // 0x28(0x08)
	enum class EGamepadKeyIconDisplayType DisplayType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float HoldDuration; // 0x34(0x04)
	bool *d678735f4f; // 0x38(0x01)
	enum class EKeyIconCombinationDisplayType *cd6cd0dce1; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// ScriptStruct TslGame.*54f580ef4d
// Size: 0x18 (Inherited: 0x00)
struct F*54f580ef4d {
	struct ATslCharacter* *420bd39286; // 0x00(0x08)
	float *5ac5c23d66; // 0x08(0x04)
	float *7f37d87b71; // 0x0c(0x04)
	float *52a4ff9e2a; // 0x10(0x04)
	bool bIsGroggy; // 0x14(0x01)
	bool *c1cf21fe53; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
};

// ScriptStruct TslGame.*ba667e36c6
// Size: 0x20 (Inherited: 0x00)
struct F*ba667e36c6 {
	struct FText *21152a7a19; // 0x00(0x18)
	char pad_18[0x8]; // 0x18(0x08)
};

// ScriptStruct TslGame.*8de05442ca
// Size: 0x50 (Inherited: 0x00)
struct F*8de05442ca {
	struct TMap<enum class EFiremode, struct UTexture2D*> TextureData; // 0x00(0x50)
};

// ScriptStruct TslGame.*0ef180dfbe
// Size: 0x50 (Inherited: 0x00)
struct F*0ef180dfbe {
	struct TMap<enum class ETraumaBagHealMode, struct UTexture2D*> TextureData; // 0x00(0x50)
};

// ScriptStruct TslGame.*8104398e70
// Size: 0x18 (Inherited: 0x00)
struct F*8104398e70 {
	struct FName ItemID; // 0x00(0x08)
	int32 *769984cd6f; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct U*78fa8706b8* *19a67ecc58; // 0x10(0x08)
};

// ScriptStruct TslGame.*5d0a168ca1
// Size: 0x50 (Inherited: 0x00)
struct F*5d0a168ca1 {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.*6bbbcece6a
// Size: 0x10 (Inherited: 0x00)
struct F*6bbbcece6a {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct TslGame.*83629ae584
// Size: 0x18 (Inherited: 0x00)
struct F*83629ae584 {
	int32 Index; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct U*f6a731ef02*> Cache; // 0x08(0x10)
};

// ScriptStruct TslGame.*7bc9699131
// Size: 0x18 (Inherited: 0x00)
struct F*7bc9699131 {
	enum class ECastableItemType *8e7577bcec; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName ItemID; // 0x08(0x08)
	struct UTexture2D* *962be9e042; // 0x10(0x08)
};

// ScriptStruct TslGame.*eaa1013eb6
// Size: 0x10 (Inherited: 0x00)
struct F*eaa1013eb6 {
	struct TArray<struct F*2f2de3d0b0> *f0ccdd0fcb; // 0x00(0x10)
};

// ScriptStruct TslGame.*2f2de3d0b0
// Size: 0x20 (Inherited: 0x00)
struct F*2f2de3d0b0 {
	struct FName ActionName; // 0x00(0x08)
	struct FText Description; // 0x08(0x18)
};

// ScriptStruct TslGame.*1419545823
// Size: 0x38 (Inherited: 0x00)
struct F*1419545823 {
	enum class ESystemMessageType MessageType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Duration; // 0x04(0x04)
	float *a4596396b5; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FText Message; // 0x10(0x18)
	int32 *4651faa631; // 0x28(0x04)
	int32 *92070cc260; // 0x2c(0x04)
	bool *2614c0f5d3; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*a7b2a4017a
// Size: 0x38 (Inherited: 0x08)
struct F*a7b2a4017a : FTableRowBase {
	struct FText Message; // 0x08(0x18)
	enum class ETslNotificationMessageColorType *9e16528261; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct UTexture2D* *10e10935c7; // 0x28(0x08)
	enum class ETslNotificationMessageAnimationType *91962bcdb4; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*63c820eab7
// Size: 0x08 (Inherited: 0x00)
struct F*63c820eab7 {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*4930bc9acc
// Size: 0x08 (Inherited: 0x00)
struct F*4930bc9acc {
	float Score; // 0x00(0x04)
	int32 *becd625c42; // 0x04(0x04)
};

// ScriptStruct TslGame.*d7a7408015
// Size: 0x08 (Inherited: 0x00)
struct F*d7a7408015 {
	int32 TeamNum; // 0x00(0x04)
	int32 TeamRanking; // 0x04(0x04)
};

// ScriptStruct TslGame.*402b1e2917
// Size: 0x28 (Inherited: 0x00)
struct F*402b1e2917 {
	struct FVector *a41d2d4af2; // 0x00(0x0c)
	float *007682a9fd; // 0x0c(0x04)
	float *6fa6e5a0bb; // 0x10(0x04)
	struct FVector *e4e6942404; // 0x14(0x0c)
	float *0b5394b308; // 0x20(0x04)
	float *632dd9bbb7; // 0x24(0x04)
};

// ScriptStruct TslGame.*feed846651
// Size: 0x48 (Inherited: 0x00)
struct F*feed846651 {
	struct UClass* Widget; // 0x00(0x20)
	struct UTexture2D* Texture; // 0x20(0x20)
	struct FVector2D Size; // 0x40(0x08)
};

// ScriptStruct TslGame.*0e386b8768
// Size: 0x10 (Inherited: 0x00)
struct F*0e386b8768 {
	struct TArray<struct UUserWidget*> Widgets; // 0x00(0x10)
};

// ScriptStruct TslGame.*b4c6814791
// Size: 0x60 (Inherited: 0x00)
struct F*b4c6814791 {
	char pad_0[0x60]; // 0x00(0x60)
};

// ScriptStruct TslGame.*7381c62ff7
// Size: 0x60 (Inherited: 0x00)
struct F*7381c62ff7 {
	struct UTexture2D* IconBackground; // 0x00(0x20)
	struct UTexture2D* MemberIndexBackground; // 0x20(0x20)
	struct UTexture2D* FullWidgetBackground; // 0x40(0x20)
};

// ScriptStruct TslGame.PlayerInfo
// Size: 0x50 (Inherited: 0x00)
struct FPlayerInfo {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.*fdd340ce43
// Size: 0x10 (Inherited: 0x00)
struct F*fdd340ce43 {
	struct UTexture2D* Left; // 0x00(0x08)
	struct UTexture2D* Right; // 0x08(0x08)
};

// ScriptStruct TslGame.*ae14f315de
// Size: 0x10 (Inherited: 0x00)
struct F*ae14f315de {
	struct TArray<struct U*ce4f43dc1d*> Items; // 0x00(0x10)
};

// ScriptStruct TslGame.*899896f0a1
// Size: 0x14 (Inherited: 0x00)
struct F*899896f0a1 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*6a00410af5
// Size: 0x10 (Inherited: 0x00)
struct F*6a00410af5 {
	struct TArray<struct ATslAIWaypointSegment*> *e57c3702bc; // 0x00(0x10)
};

// ScriptStruct TslGame.*1adc9333ba
// Size: 0xa0 (Inherited: 0x00)
struct F*1adc9333ba {
	struct TMap<struct F*ea82ab0195, bool> *90465ec5e9; // 0x00(0x50)
	struct TMap<struct F*ea82ab0195, struct F*89cf6a297f> *a46308be23; // 0x50(0x50)
};

// ScriptStruct TslGame.*ea82ab0195
// Size: 0x10 (Inherited: 0x00)
struct F*ea82ab0195 {
	struct ATslAIWaypointSegment* path; // 0x00(0x08)
	float InputKey; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*89cf6a297f
// Size: 0x08 (Inherited: 0x00)
struct F*89cf6a297f {
	float *93ed05fd27; // 0x00(0x04)
	float *d03d98daf7; // 0x04(0x04)
};

// ScriptStruct TslGame.*3c1a3a3089
// Size: 0x48 (Inherited: 0x00)
struct F*3c1a3a3089 {
	int32 SpawnCount; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FName VehicleTag; // 0x08(0x08)
	struct FName SpawnTag; // 0x10(0x08)
	bool *89f4e39b97; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	struct FVector SpawnLocation; // 0x1c(0x0c)
	struct FRotator *d2d944d7be; // 0x28(0x0c)
	char pad_34[0x4]; // 0x34(0x04)
	struct F*4d9a79d928 *82e253c76c; // 0x38(0x10)
};

// ScriptStruct TslGame.*4d9a79d928
// Size: 0x10 (Inherited: 0x00)
struct F*4d9a79d928 {
	struct ATslAIWaypointSegment* *0372e1451d; // 0x00(0x08)
	float *633104f6df; // 0x08(0x04)
	bool *b100850235; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*ab908f90bb
// Size: 0x28 (Inherited: 0x00)
struct F*ab908f90bb {
	struct APawn* *7dd2e01891; // 0x00(0x08)
	struct UBehaviorTree* BehaviorTree; // 0x08(0x08)
	struct UBlackboardData* BlackboardData; // 0x10(0x08)
	struct F*4d9a79d928 *82e253c76c; // 0x18(0x10)
};

// ScriptStruct TslGame.VehicleSpawn
// Size: 0xc0 (Inherited: 0x08)
struct FVehicleSpawn : FTableRowBase {
	struct FGuid ID; // 0x08(0x10)
	enum class ESpawnType SpawnType; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct FName VehicleTag; // 0x20(0x08)
	struct UClass* VehicleClass; // 0x28(0x20)
	struct UBehaviorTree* BehaviorTreeAsset; // 0x48(0x20)
	struct UBlackboardData* BlackboardDataAsset; // 0x68(0x20)
	float InitialSpawnDelay; // 0x88(0x04)
	float SubsequentSpawnDelay; // 0x8c(0x04)
	int32 MaxTriggers; // 0x90(0x04)
	bool MinToSpawn; // 0x94(0x01)
	bool MaxToSpawn; // 0x95(0x01)
	char pad_96[0x2]; // 0x96(0x02)
	struct F*dab970dff7 SpawnFilter; // 0x98(0x28)
};

// ScriptStruct TslGame.*dab970dff7
// Size: 0x28 (Inherited: 0x00)
struct F*dab970dff7 {
	bool bLimitSpawnPoints; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FName> ValidSpawnPoints; // 0x08(0x10)
	struct TArray<struct FName> InvalidSpawnPoints; // 0x18(0x10)
};

// ScriptStruct TslGame.*d729a30c8d
// Size: 0x20 (Inherited: 0x00)
struct F*d729a30c8d {
	char pad_0[0x20]; // 0x00(0x20)
};

// ScriptStruct TslGame.*3008e0359a
// Size: 0x60 (Inherited: 0x00)
struct F*3008e0359a {
	struct FGuid ID; // 0x00(0x10)
	struct FString *9721e76cdd; // 0x10(0x10)
	struct UClass* VehicleClass; // 0x20(0x08)
	struct UBehaviorTree* BehaviorTree; // 0x28(0x08)
	struct UBlackboardData* BlackboardData; // 0x30(0x08)
	struct F*dab970dff7 SpawnSettings; // 0x38(0x28)
};

// ScriptStruct TslGame.*ddf62e5dcf
// Size: 0x40 (Inherited: 0x00)
struct F*ddf62e5dcf {
	float *acdb34b035; // 0x00(0x04)
	float *ba9cc222e2; // 0x04(0x04)
	float *abb07f1d36; // 0x08(0x04)
	float Damage; // 0x0c(0x04)
	float *4f9aab8675; // 0x10(0x04)
	float *e2bf6db8ce; // 0x14(0x04)
	struct FName *cf3784a459; // 0x18(0x08)
	struct FVector *3e654f4252; // 0x20(0x0c)
	struct FVector *ad30d515f8; // 0x2c(0x0c)
	struct UClass* *0ad023d030; // 0x38(0x08)
};

// ScriptStruct TslGame.*9e06703c42
// Size: 0x30 (Inherited: 0x00)
struct F*9e06703c42 {
	struct F*10a1a5ced2 *6b273aa372; // 0x00(0x18)
	struct F*10a1a5ced2 *08ec35cc09; // 0x18(0x18)
};

// ScriptStruct TslGame.*10a1a5ced2
// Size: 0x18 (Inherited: 0x00)
struct F*10a1a5ced2 {
	float *965fa84f4a; // 0x00(0x04)
	float *5733129f36; // 0x04(0x04)
	struct UAkAudioEvent* AkEvent; // 0x08(0x08)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct TslGame.*85327c4b91
// Size: 0x18 (Inherited: 0x00)
struct F*85327c4b91 {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*ef73657da1
// Size: 0x58 (Inherited: 0x00)
struct F*ef73657da1 {
	enum class EVehiclePartType *c00acb4221; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TMap<int32, struct UMaterialInterface*> *c23e329faa; // 0x08(0x50)
};

// ScriptStruct TslGame.*01dfe8dfa0
// Size: 0x98 (Inherited: 0x00)
struct F*01dfe8dfa0 {
	bool *b5fff620af; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *9108647be0; // 0x04(0x04)
	struct FName *19ff759f91; // 0x08(0x08)
	struct FVector2D *e9221d79ea; // 0x10(0x08)
	struct FVector2D *614e6c91bb; // 0x18(0x08)
	struct FVector *e34b01e391; // 0x20(0x0c)
	struct FVector2D *3d134fae4e; // 0x2c(0x08)
	struct FVector2D *27174fe3a0; // 0x34(0x08)
	float *e4b1acf7cd; // 0x3c(0x04)
	float *e5ad477fb3; // 0x40(0x04)
	float *d6d0b5ffd6; // 0x44(0x04)
	struct FVector *89dfd1d8c6; // 0x48(0x0c)
	struct FVector *11d19c41db; // 0x54(0x0c)
	struct FVector2D *cb9ddfbd4a; // 0x60(0x08)
	float *61d438214e; // 0x68(0x04)
	bool *dee1630714; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	float *94d27b6e08; // 0x70(0x04)
	bool *b17af18b6c; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FVector2D *204d8f9423; // 0x78(0x08)
	struct U*e6746d9844* *cee9304069; // 0x80(0x08)
	bool *9b22b31f4e; // 0x88(0x01)
	char pad_89[0xf]; // 0x89(0x0f)
};

// ScriptStruct TslGame.*c9cab0cb72
// Size: 0x68 (Inherited: 0x00)
struct F*c9cab0cb72 {
	struct FName *bbdce3656a; // 0x00(0x08)
	float *978b0dc00b; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FName *257d148c5b; // 0x10(0x08)
	float *fc23d3d98e; // 0x18(0x04)
	float *a19cf4a9dd; // 0x1c(0x04)
	struct UCurveFloat* CurveEngineOn; // 0x20(0x08)
	struct UCurveFloat* CurveEngineOff; // 0x28(0x08)
	float EngineSwitchMaxTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FName HeadLightIntensityParamName; // 0x38(0x08)
	float HeadLightIntensity_Mat; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FName TailLightIntensityParamName; // 0x48(0x08)
	float TailLightIntensity_Mat; // 0x50(0x04)
	bool bTickIndicatorSpeedText; // 0x54(0x01)
	bool bTickIndicatorGearText; // 0x55(0x01)
	bool bTickIndicatorHealth; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct FName TextRenderIntensityParameterName; // 0x58(0x08)
	struct FName HealthStateParameterName; // 0x60(0x08)
};

// ScriptStruct TslGame.*446f0f9601
// Size: 0x130 (Inherited: 0x00)
struct F*446f0f9601 {
	bool *10ee726be7; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *f18e8b2ae6; // 0x04(0x04)
	float *2e18697ca5; // 0x08(0x04)
	float *656eafbdc4; // 0x0c(0x04)
	float *cb625397d6; // 0x10(0x04)
	struct FFloatRange *20b5a4127c; // 0x14(0x10)
	float *93f1108201; // 0x24(0x04)
	float *907807306c; // 0x28(0x04)
	float *74c53a0a85; // 0x2c(0x04)
	float *f3bf599b7d; // 0x30(0x04)
	int32 *e7fd6b5a43; // 0x34(0x04)
	char pad_38[0x8]; // 0x38(0x08)
	struct TMap<enum class EPhysicalSurface, struct F*5191c5df70> *75abf2d0a9; // 0x40(0x50)
	struct TMap<enum class EPhysicalSurface, struct F*5191c5df70> *c230a842c6; // 0x90(0x50)
	struct TMap<enum class EPhysicalSurface, struct F*2a7f3d122d> *b2a6e16724; // 0xe0(0x50)
};

// ScriptStruct TslGame.*2a7f3d122d
// Size: 0x28 (Inherited: 0x00)
struct F*2a7f3d122d {
	char pad_0[0x18]; // 0x00(0x18)
	struct UAkComponent* *bda342114e; // 0x18(0x08)
	struct UParticleSystemComponent* ParticleComp; // 0x20(0x08)
};

// ScriptStruct TslGame.*5191c5df70
// Size: 0x10 (Inherited: 0x00)
struct F*5191c5df70 {
	struct UParticleSystem* ParticleSystem; // 0x00(0x08)
	struct UAkAudioEvent* AkEvent; // 0x08(0x08)
};

// ScriptStruct TslGame.*c5da03c633
// Size: 0x28 (Inherited: 0x00)
struct F*c5da03c633 {
	char pad_0[0x18]; // 0x00(0x18)
	struct USceneComponent* *18ff5b3923; // 0x18(0x08)
	struct USceneComponent* *a9c8f6b42b; // 0x20(0x08)
};

// ScriptStruct TslGame.*f8252c622a
// Size: 0x28 (Inherited: 0x00)
struct F*f8252c622a {
	int32 *d43adff64c; // 0x00(0x04)
	float *287158f7b9; // 0x04(0x04)
	float *10aeeadde5; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UCurveFloat* *ca81a542cc; // 0x10(0x08)
	struct UCurveFloat* *897d94b7ee; // 0x18(0x08)
	struct UClass* *0ad023d030; // 0x20(0x08)
};

// ScriptStruct TslGame.*e7a209cfb0
// Size: 0x10 (Inherited: 0x00)
struct F*e7a209cfb0 {
	struct FName *b1461d3316; // 0x00(0x08)
	struct FName *600d1a2c84; // 0x08(0x08)
};

// ScriptStruct TslGame.*2c070072fd
// Size: 0x70 (Inherited: 0x00)
struct F*2c070072fd {
	struct FTransform PlantingTransform; // 0x00(0x30)
	struct FTransform EffectTransform; // 0x30(0x30)
	struct FLinearColor EffectColor; // 0x60(0x10)
};

// ScriptStruct TslGame.TslWeaponDisplayDataRow
// Size: 0x10 (Inherited: 0x08)
struct FTslWeaponDisplayDataRow : FTableRowBase {
	float DefaultScale; // 0x08(0x04)
	float ZoomScale; // 0x0c(0x04)
};

// ScriptStruct TslGame.*6c68ccaa2b
// Size: 0x20 (Inherited: 0x00)
struct F*6c68ccaa2b {
	struct FString ItemID; // 0x00(0x10)
	struct FString SkinId; // 0x10(0x10)
};

// ScriptStruct TslGame.*9eff2cb8a3
// Size: 0x30 (Inherited: 0x00)
struct F*9eff2cb8a3 {
	struct APostProcessVolume* PostProcessVolume; // 0x00(0x08)
	struct F*91f1bcf293 LocalWeatherSetting; // 0x08(0x28)
};

// ScriptStruct TslGame.*91f1bcf293
// Size: 0x28 (Inherited: 0x00)
struct F*91f1bcf293 {
	float FogDensity; // 0x00(0x04)
	struct FLinearColor FogColor; // 0x04(0x10)
	float FogStartDistance; // 0x14(0x04)
	float VolFogExtinctionScale; // 0x18(0x04)
	float WeatherParticleSpawnScale; // 0x1c(0x04)
	char bUseWetEffectWithSpawnScale : 1; // 0x20(0x01)
	char pad_20_1 : 7; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float SoundScale; // 0x24(0x04)
};

// ScriptStruct TslGame.*82a366d2c4
// Size: 0x10 (Inherited: 0x00)
struct F*82a366d2c4 {
	float DirectionalLightIntensity; // 0x00(0x04)
	float DirectionalLightTemperature; // 0x04(0x04)
	float DirectionalLightVolumetricScattering; // 0x08(0x04)
	float SkyLightIntensity; // 0x0c(0x04)
};

// ScriptStruct TslGame.*71436ff8b4
// Size: 0x68 (Inherited: 0x00)
struct F*71436ff8b4 {
	struct FString WeatherName; // 0x00(0x10)
	struct ATslDynamicWeather* DynamicWeather; // 0x10(0x08)
	float Weight; // 0x18(0x04)
	float DirectionalLightIntensity; // 0x1c(0x04)
	float DirectionalLightTemperature; // 0x20(0x04)
	float DirectionalLightVolumetricScattering; // 0x24(0x04)
	float SkyLightIntensity; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UTextureCube* SkyLightCubemap; // 0x30(0x08)
	float SkyLightCubemapAngle; // 0x38(0x04)
	float SkyLightCubemapResolution; // 0x3c(0x04)
	char bUseBlendSkyBox : 1; // 0x40(0x01)
	char bRefreshLightSetting : 1; // 0x40(0x01)
	char bOverrideDurationTime : 1; // 0x40(0x01)
	char pad_40_3 : 5; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float OverrideDurationTimeMin; // 0x44(0x04)
	float OverrideDurationTimeMax; // 0x48(0x04)
	char bUseDistanceDepthBlur : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	float DepthBlurIntensity; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct UCurveFloat* DepthBlurCurveAsset; // 0x58(0x08)
	char bClearFootprints : 1; // 0x60(0x01)
	char pad_60_1 : 7; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
};

// ScriptStruct TslGame.*8faafc38eb
// Size: 0x1c (Inherited: 0x00)
struct F*8faafc38eb {
	bool *f314017032; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *00f923d69d; // 0x04(0x04)
	float *dadba9e48d; // 0x08(0x04)
	float *c9541a8871; // 0x0c(0x04)
	float *6e192530a0; // 0x10(0x04)
	float *5f8581915b; // 0x14(0x04)
	bool *36eec45871; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
};

// ScriptStruct TslGame.*f2c5383189
// Size: 0x30 (Inherited: 0x00)
struct F*f2c5383189 {
	struct UAkAudioEvent* *a5bf4eb821; // 0x00(0x08)
	struct UAkAudioEvent* *7e2ad1d5cd; // 0x08(0x08)
	float *859fe51425; // 0x10(0x04)
	float *d13c0a4ba1; // 0x14(0x04)
	struct FString *1c1a8b3141; // 0x18(0x10)
	float *5bb5732de8; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*b3478b6705
// Size: 0x30 (Inherited: 0x00)
struct F*b3478b6705 {
	float *0f8eaf8349; // 0x00(0x04)
	struct FVector2D *28b0fe6800; // 0x04(0x08)
	struct FVector2D *0145701407; // 0x0c(0x08)
	float *392e8e26f3; // 0x14(0x04)
	float *ad0df88b00; // 0x18(0x04)
	float *9c42de90af; // 0x1c(0x04)
	struct FVector2D *822c444e05; // 0x20(0x08)
	struct FVector2D *adee2f35d7; // 0x28(0x08)
};

// ScriptStruct TslGame.*c3ebfde829
// Size: 0x10 (Inherited: 0x00)
struct F*c3ebfde829 {
	bool *78ff4bb578; // 0x00(0x01)
	char pad_1[0xf]; // 0x01(0x0f)
};

// ScriptStruct TslGame.*9ee5d89f6e
// Size: 0x58 (Inherited: 0x00)
struct F*9ee5d89f6e {
	float *5f79c5bbb8; // 0x00(0x04)
	float *0e71e2a657; // 0x04(0x04)
	struct FVector2D *3675828677; // 0x08(0x08)
	struct FVector2D *6245a68cc8; // 0x10(0x08)
	struct FVector2D *9076b6363f; // 0x18(0x08)
	struct FVector2D *34d1b03cee; // 0x20(0x08)
	struct FVector2D *5c38ce22cd; // 0x28(0x08)
	struct FVector2D *c434e1fb11; // 0x30(0x08)
	struct FVector2D *53cdf0e5a6; // 0x38(0x08)
	float *1b2920018d; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct UAnimMontage* *233b88fbe0; // 0x48(0x08)
	float *752c0be28b; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
};

// ScriptStruct TslGame.*6b51fca5c9
// Size: 0x14 (Inherited: 0x00)
struct F*6b51fca5c9 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*7a6f31e1ba
// Size: 0x40 (Inherited: 0x00)
struct F*7a6f31e1ba {
	float *a574c18486; // 0x00(0x04)
	float *c15c251c2a; // 0x04(0x04)
	float *421f7fca8e; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UCurveFloat* *ae9ec0eb8e; // 0x10(0x08)
	float *6ee6f85289; // 0x18(0x04)
	float *3d67894475; // 0x1c(0x04)
	float *3db7fe7e8b; // 0x20(0x04)
	float *e3d176ec09; // 0x24(0x04)
	struct FVector2D *9e49a13fee; // 0x28(0x08)
	struct FVector2D *8c51f8ef56; // 0x30(0x08)
	float *4b879c760a; // 0x38(0x04)
	float *e769f12bca; // 0x3c(0x04)
};

// ScriptStruct TslGame.*be632f01d6
// Size: 0x14 (Inherited: 0x14)
struct F*be632f01d6 : F*54e42bf866 {
};

// ScriptStruct TslGame.*54e42bf866
// Size: 0x14 (Inherited: 0x00)
struct F*54e42bf866 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*ac7edd4ef3
// Size: 0x14 (Inherited: 0x14)
struct F*ac7edd4ef3 : F*54e42bf866 {
};

// ScriptStruct TslGame.*747a5ab8d5
// Size: 0x1c (Inherited: 0x14)
struct F*747a5ab8d5 : F*54e42bf866 {
	char pad_14[0x8]; // 0x14(0x08)
};

// ScriptStruct TslGame.*c9904f8c88
// Size: 0x10 (Inherited: 0x00)
struct F*c9904f8c88 {
	struct UAnimSequence* TransitionSequence; // 0x00(0x08)
	float PlayRate; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*e19df97443
// Size: 0x30 (Inherited: 0x00)
struct F*e19df97443 {
	struct USkeletalMesh* *e0959dd09d; // 0x00(0x20)
	struct TArray<struct UMaterialInterface*> *7656fad8ad; // 0x20(0x10)
};

// ScriptStruct TslGame.*bd7057f7ac
// Size: 0x18 (Inherited: 0x00)
struct F*bd7057f7ac {
	struct USkeletalMesh* *4bf4edf88f; // 0x00(0x08)
	struct TArray<struct UMaterialInterface*> *8c30864a2d; // 0x08(0x10)
};

// ScriptStruct TslGame.*b7411ed099
// Size: 0x38 (Inherited: 0x00)
struct F*b7411ed099 {
	struct TArray<struct F*1d83a45c1f> StartParticleList; // 0x00(0x10)
	struct TArray<struct F*1d83a45c1f> FinishParticleList; // 0x10(0x10)
	struct F*47c95874b8 OverrideMaterial; // 0x20(0x18)
};

// ScriptStruct TslGame.*47c95874b8
// Size: 0x18 (Inherited: 0x00)
struct F*47c95874b8 {
	enum class *3d2bec6659 SkinApplicationType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct F*57c2b7a8c9> SkinMaterials; // 0x08(0x10)
};

// ScriptStruct TslGame.*57c2b7a8c9
// Size: 0x30 (Inherited: 0x00)
struct F*57c2b7a8c9 {
	struct FName MaterialSlotName; // 0x00(0x08)
	int32 MaterialSlotIndex; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UMaterialInstance* MaterialInstance; // 0x10(0x20)
};

// ScriptStruct TslGame.*1d83a45c1f
// Size: 0x20 (Inherited: 0x00)
struct F*1d83a45c1f {
	struct TArray<struct FName> AttachSocketCandidates; // 0x00(0x10)
	struct FStringClassReference ParticleClass; // 0x10(0x10)
};

// ScriptStruct TslGame.*fa5b8b51ee
// Size: 0x18 (Inherited: 0x08)
struct F*fa5b8b51ee : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	int32 Weight; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*3def71a7fa
// Size: 0x50 (Inherited: 0x00)
struct F*3def71a7fa {
	struct TMap<enum class EPhysicalSurface, float> *14b359c5bf; // 0x00(0x50)
};

// ScriptStruct TslGame.*b957acc115
// Size: 0x08 (Inherited: 0x00)
struct F*b957acc115 {
	float *55244a6535; // 0x00(0x04)
	float *8755477e27; // 0x04(0x04)
};

// ScriptStruct TslGame.*8bd9b05bd5
// Size: 0x28 (Inherited: 0x00)
struct F*8bd9b05bd5 {
	bool AtlasIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct UClass*> WheelTypes; // 0x08(0x10)
	struct TArray<struct UClass*> ExemptedWheelTypes; // 0x18(0x10)
};

// ScriptStruct TslGame.*b3ad944fcd
// Size: 0x60 (Inherited: 0x00)
struct F*b3ad944fcd {
	struct UStaticMesh* StaticMesh; // 0x00(0x20)
	struct UDestructibleMesh* DestructibleMesh; // 0x20(0x20)
	struct UAkAudioEvent* *e541c5ef4e; // 0x40(0x08)
	struct UPhysicalMaterial* PhysicalMaterial; // 0x48(0x08)
	float *7cc7405a66; // 0x50(0x04)
	enum class *c276e29a27 IndoorOutdoorMask; // 0x54(0x01)
	char LightingChannel1 : 1; // 0x55(0x01)
	char pad_55_1 : 7; // 0x55(0x01)
	enum class ECollisionEnabled CollisionEnabled; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct FName CollisionProfileName; // 0x58(0x08)
};

// ScriptStruct TslGame.*da5417547d
// Size: 0x48 (Inherited: 0x08)
struct F*da5417547d : FTableRowBase {
	struct UTexture* Icon; // 0x08(0x20)
	struct F*4d9124ce0b AbilityAttribute; // 0x28(0x0c)
	char pad_34[0x4]; // 0x34(0x04)
	struct FName AbilityID; // 0x38(0x08)
	struct UClass* AbilityClass; // 0x40(0x08)
};

// ScriptStruct TslGame.*4d9124ce0b
// Size: 0x0c (Inherited: 0x00)
struct F*4d9124ce0b {
	float Distance; // 0x00(0x04)
	float Angle; // 0x04(0x04)
	char UsingDir : 1; // 0x08(0x01)
	char pad_8_1 : 7; // 0x08(0x01)
	bool bStopMove; // 0x09(0x01)
	bool bTrace; // 0x0a(0x01)
	char pad_B[0x1]; // 0x0b(0x01)
};

// ScriptStruct TslGame.AnimNode_LocomotionBSPlayer
// Size: 0x140 (Inherited: 0x58)
struct FAnimNode_LocomotionBSPlayer : FAnimNode_AssetPlayerBase {
	float NodeSpeed; // 0x58(0x04)
	float Dir; // 0x5c(0x04)
	enum class EAnimStance AnimStance; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct U*24c6652716* AnimDB; // 0x68(0x08)
	bool bIsSprinting; // 0x70(0x01)
	bool bIsRelaxed; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float PlayRate; // 0x74(0x04)
	bool bLoop; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float StartPosition; // 0x7c(0x04)
	struct UBlendSpaceBase* BlendSpace; // 0x80(0x08)
	bool bResetPlayTimeWhenBlendSpaceChanges; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct FBlendFilter BlendFilter; // 0x90(0x90)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x120(0x10)
	struct UBlendSpaceBase* PreviousBlendSpace; // 0x130(0x08)
	float Speed; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
};

// ScriptStruct TslGame.TslAnimNode_AimOffsets
// Size: 0xb0 (Inherited: 0x58)
struct FTslAnimNode_AimOffsets : FAnimNode_AssetPlayerBase {
	struct U*f7e8bdf881* AnimDBMap; // 0x58(0x08)
	struct U*f7e8bdf881* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslAimOffsetsNodeBlendSpaceData> BlendSpacesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	float X; // 0x90(0x04)
	float Y; // 0x94(0x04)
	float NormalizedTime; // 0x98(0x04)
	char pad_9C[0x8]; // 0x9c(0x08)
	enum class EAnimStance Stance; // 0xa4(0x01)
	bool bRelaxed; // 0xa5(0x01)
	enum class EWeaponClass WeaponClass; // 0xa6(0x01)
	enum class EAnimWeaponSpecificClass AnimWeaponSpecificClass; // 0xa7(0x01)
	enum class EAlphaBlendOption BlendType; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// ScriptStruct TslGame.TslAimOffsetsNodeBlendSpaceData
// Size: 0xc8 (Inherited: 0x00)
struct FTslAimOffsetsNodeBlendSpaceData {
	struct UBlendSpace* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb0]; // 0x18(0xb0)
};

// ScriptStruct TslGame.TslAnimNode_BlendPerBoneBase
// Size: 0x128 (Inherited: 0x30)
struct FTslAnimNode_BlendPerBoneBase : FAnimNode_Base {
	char pad_30[0x4]; // 0x30(0x04)
	enum class EAnimAlphaInputType AlphaInputType; // 0x34(0x01)
	bool bAlphaBoolEnabled; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	float Alpha; // 0x38(0x04)
	struct FInputScaleBias AlphaScaleBias; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
	struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x48(0x50)
	struct FName AlphaCurveName; // 0x98(0x08)
	struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0xa0(0x30)
	int32 LODThreshold; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct TArray<float> PerBoneBlendWeights; // 0xd8(0x10)
	struct FGuid SkeletonGuid; // 0xe8(0x10)
	struct FGuid VirtualBoneGuid; // 0xf8(0x10)
	char pad_108[0x20]; // 0x108(0x20)
};

// ScriptStruct TslGame.BlendBoneSettings
// Size: 0x20 (Inherited: 0x00)
struct FBlendBoneSettings {
	struct FBoneReference Bone; // 0x00(0x18)
	float Weight; // 0x18(0x04)
	bool bPropagateToChildren; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditivePerBone
// Size: 0x168 (Inherited: 0x158)
struct FTslAnimNode_ApplyAdditivePerBone : FTslAnimNode_ApplyAdditivePerBoneBase {
	struct TArray<struct FBlendBoneSettings> OverrideBones; // 0x158(0x10)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditivePerBoneBase
// Size: 0x158 (Inherited: 0x128)
struct FTslAnimNode_ApplyAdditivePerBoneBase : FTslAnimNode_BlendPerBoneBase {
	struct FPoseLink Base; // 0x128(0x18)
	struct FPoseLink Additive; // 0x140(0x18)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditiveExcludeBones
// Size: 0x168 (Inherited: 0x158)
struct FTslAnimNode_ApplyAdditiveExcludeBones : FTslAnimNode_ApplyAdditivePerBoneBase {
	struct TArray<struct FExcludeBoneSettings> ExcludeBones; // 0x158(0x10)
};

// ScriptStruct TslGame.ExcludeBoneSettings
// Size: 0x20 (Inherited: 0x00)
struct FExcludeBoneSettings {
	struct FBoneReference Bone; // 0x00(0x18)
	bool bPropagateToChildren; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct TslGame.TslAnimNode_BlendListBlendSpace
// Size: 0xb8 (Inherited: 0x58)
struct FTslAnimNode_BlendListBlendSpace : FAnimNode_AssetPlayerBase {
	float X; // 0x58(0x04)
	float Y; // 0x5c(0x04)
	struct UCurveFloat* CustomBlendCurve; // 0x60(0x08)
	struct UBlendSpace* LastActiveBlendSpace; // 0x68(0x08)
	struct TArray<struct UBlendSpace*> BlendSpace; // 0x70(0x10)
	struct TArray<float> BlendTime; // 0x80(0x10)
	struct TArray<struct FTslBlendSpaceBlendData> BlendSpaceData; // 0x90(0x10)
	char pad_A0[0x10]; // 0xa0(0x10)
	float PlayRate; // 0xb0(0x04)
	bool bLoop; // 0xb4(0x01)
	enum class EAlphaBlendOption BlendType; // 0xb5(0x01)
	char pad_B6[0x2]; // 0xb6(0x02)
};

// ScriptStruct TslGame.TslBlendSpaceBlendData
// Size: 0xd0 (Inherited: 0x00)
struct FTslBlendSpaceBlendData {
	struct UBlendSpace* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb8]; // 0x18(0xb8)
};

// ScriptStruct TslGame.TslAnimNode_BlendListBlendSpaceByEnum
// Size: 0xd0 (Inherited: 0xb8)
struct FTslAnimNode_BlendListBlendSpaceByEnum : FTslAnimNode_BlendListBlendSpace {
	struct TArray<bool> EnumToPoseIndex; // 0xb8(0x10)
	char pad_C8[0x5]; // 0xc8(0x05)
	bool ActiveEnumValue; // 0xcd(0x01)
	char pad_CE[0x2]; // 0xce(0x02)
};

// ScriptStruct TslGame.TslAnimNode_BlendEvaluatorBlendSpaceByEnum
// Size: 0xd8 (Inherited: 0xd0)
struct FTslAnimNode_BlendEvaluatorBlendSpaceByEnum : FTslAnimNode_BlendListBlendSpaceByEnum {
	float NormalizedTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct TslGame.TslAnimNode_BlendListRandom
// Size: 0x120 (Inherited: 0xc8)
struct FTslAnimNode_BlendListRandom : FAnimNode_BlendListBase {
	int32 ActiveChildIndex; // 0xc8(0x04)
	enum class ERandomType RandomType; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
	struct TArray<struct FBlendPosePlayInfo> PlayChances; // 0xd0(0x10)
	struct TArray<int32> PlayList; // 0xe0(0x10)
	int32 LoopingCounter; // 0xf0(0x04)
	float RandomPlayTime; // 0xf4(0x04)
	float RandomAccumlateTime; // 0xf8(0x04)
	struct FRandomStream RandomStream; // 0xfc(0x08)
	char pad_104[0x4]; // 0x104(0x04)
	struct TArray<float> NormalizedPlayChances; // 0x108(0x10)
	float LastChildAssetTime; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
};

// ScriptStruct TslGame.BlendPosePlayInfo
// Size: 0x24 (Inherited: 0x00)
struct FBlendPosePlayInfo {
	float PlayChance; // 0x00(0x04)
	struct FInt32Range LoopingCounter; // 0x04(0x10)
	struct FFloatRange RandomPlayTime; // 0x14(0x10)
};

// ScriptStruct TslGame.TslAnimNode_BlendPerBone
// Size: 0x188 (Inherited: 0x128)
struct FTslAnimNode_BlendPerBone : FTslAnimNode_BlendPerBoneBase {
	struct TArray<struct FBlendBoneSettings> OverrideBones; // 0x128(0x10)
	struct FPoseLink BasePose; // 0x138(0x18)
	struct FPoseLink BlendPose; // 0x150(0x18)
	struct FBoneReference BlendBone; // 0x168(0x18)
	bool bMeshSpaceRotationBlend; // 0x180(0x01)
	bool bKeepBlendBonePosition; // 0x181(0x01)
	enum class *e010c2fbb2 CurveBlendOption; // 0x182(0x01)
	char pad_183[0x5]; // 0x183(0x05)
};

// ScriptStruct TslGame.TslAnimNode_BlendSequencesByBool
// Size: 0xb0 (Inherited: 0x58)
struct FTslAnimNode_BlendSequencesByBool : FAnimNode_AssetPlayerBase {
	bool ActiveValue; // 0x58(0x01)
	enum class EAlphaBlendOption BlendType; // 0x59(0x01)
	bool bLooping; // 0x5a(0x01)
	char pad_5B[0x1]; // 0x5b(0x01)
	enum class EBlendSequenceByBoolStartType StartType; // 0x5c(0x04)
	struct TArray<struct FTslBlendSequencesByBoolAnimationData> SequencesData; // 0x60(0x10)
	struct UAnimSequence* TrueSequence; // 0x70(0x08)
	struct UAnimSequence* FalseSequence; // 0x78(0x08)
	struct UAnimSequence* LastActiveSequence; // 0x80(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x88(0x08)
	char pad_90[0x10]; // 0x90(0x10)
	float TrueBlendTime; // 0xa0(0x04)
	float FalseBlendTime; // 0xa4(0x04)
	float TruePlayRate; // 0xa8(0x04)
	float FalsePlayRate; // 0xac(0x04)
};

// ScriptStruct TslGame.TslBlendSequencesByBoolAnimationData
// Size: 0x30 (Inherited: 0x00)
struct FTslBlendSequencesByBoolAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x28]; // 0x08(0x28)
};

// ScriptStruct TslGame.TslAnimNode_BonesLookAtEachOther
// Size: 0x118 (Inherited: 0xf8)
struct FTslAnimNode_BonesLookAtEachOther : FAnimNode_SkeletalControlBase {
	struct TArray<struct FTslBonesLookAtEachOtherSettings> Bones; // 0xf8(0x10)
	char pad_108[0x10]; // 0x108(0x10)
};

// ScriptStruct TslGame.TslBonesLookAtEachOtherSettings
// Size: 0x58 (Inherited: 0x00)
struct FTslBonesLookAtEachOtherSettings {
	struct FBoneReference Bone1; // 0x00(0x18)
	struct FBoneReference Bone2; // 0x18(0x18)
	struct FAxis LookAt_Axis; // 0x30(0x10)
	struct FAxis LookUp_Axis; // 0x40(0x10)
	bool bUseLookUpAxis; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// ScriptStruct TslGame.TslAnimNode_BranchByBool
// Size: 0x68 (Inherited: 0x30)
struct FTslAnimNode_BranchByBool : FAnimNode_Base {
	bool ActiveValue; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FPoseLink TruePose; // 0x38(0x18)
	struct FPoseLink FalsePose; // 0x50(0x18)
};

// ScriptStruct TslGame.TslAnimNode_CCDIK
// Size: 0x1c0 (Inherited: 0xf8)
struct FTslAnimNode_CCDIK : FAnimNode_SkeletalControlBase {
	struct FVector EffectorLocation; // 0xf8(0x0c)
	enum class *627034402d EffectorLocationSpace; // 0x104(0x01)
	char pad_105[0xb]; // 0x105(0x0b)
	struct FBoneSocketTarget EffectorTarget; // 0x110(0x60)
	struct FBoneReference TipBone; // 0x170(0x18)
	struct FBoneReference RootBone; // 0x188(0x18)
	float Precision; // 0x1a0(0x04)
	int32 MaxIterations; // 0x1a4(0x04)
	bool bStartFromTail; // 0x1a8(0x01)
	bool bEnableRotationLimit; // 0x1a9(0x01)
	char pad_1AA[0x6]; // 0x1aa(0x06)
	struct TArray<struct FCCDIKJointSettings> RotationLimitPerJoints; // 0x1b0(0x10)
};

// ScriptStruct TslGame.CCDIKJointSettings
// Size: 0x1c (Inherited: 0x00)
struct FCCDIKJointSettings {
	float MaxConeAngle; // 0x00(0x04)
	float MaxAngleX; // 0x04(0x04)
	float MinAngleX; // 0x08(0x04)
	float MaxAngleY; // 0x0c(0x04)
	float MinAngleY; // 0x10(0x04)
	float MaxAngleZ; // 0x14(0x04)
	float MinAngleZ; // 0x18(0x04)
};

// ScriptStruct TslGame.TslAnimNode_CopyBones
// Size: 0x118 (Inherited: 0xf8)
struct FTslAnimNode_CopyBones : FAnimNode_SkeletalControlBase {
	struct TArray<struct FTslCopyBoneSettings> Bones; // 0xf8(0x10)
	char pad_108[0x10]; // 0x108(0x10)
};

// ScriptStruct TslGame.TslCopyBoneSettings
// Size: 0x38 (Inherited: 0x00)
struct FTslCopyBoneSettings {
	struct FBoneReference SourceBone; // 0x00(0x18)
	struct FBoneReference TargetBone; // 0x18(0x18)
	bool bCopyTranslation; // 0x30(0x01)
	bool bCopyRotation; // 0x31(0x01)
	bool bCopyScale; // 0x32(0x01)
	enum class *627034402d ControlSpace; // 0x33(0x01)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct TslGame.TslAnimNode_CustomAnimSequence
// Size: 0x90 (Inherited: 0x70)
struct FTslAnimNode_CustomAnimSequence : FAnimNode_SequencePlayer {
	struct U*dc521904bf* AnimDataAsset; // 0x70(0x08)
	struct FName AnimName; // 0x78(0x08)
	struct FName AltAnimName; // 0x80(0x08)
	int32 AnimationIndex; // 0x88(0x04)
	enum class ECustomAnimDataType CustomAnimDataType; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
};

// ScriptStruct TslGame.TslAnimNode_FabrikElbow
// Size: 0x1b0 (Inherited: 0xf8)
struct FTslAnimNode_FabrikElbow : FAnimNode_SkeletalControlBase {
	char pad_F8[0x8]; // 0xf8(0x08)
	struct FTransform EffectorTransform; // 0x100(0x30)
	enum class *627034402d EffectorTransformSpace; // 0x130(0x01)
	char pad_131[0x7]; // 0x131(0x07)
	struct FBoneReference EffectorTransformBone; // 0x138(0x18)
	enum class *b396554497 EffectorRotationSource; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct FBoneReference TipBone; // 0x158(0x18)
	struct FBoneReference RootBone; // 0x170(0x18)
	struct FBoneReference ElbowBone; // 0x188(0x18)
	float ElbowInterpCoef; // 0x1a0(0x04)
	float Precision; // 0x1a4(0x04)
	int32 MaxIterations; // 0x1a8(0x04)
	bool bEnableDebugDraw; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
};

// ScriptStruct TslGame.TslAnimNode_Falling
// Size: 0xa0 (Inherited: 0x58)
struct FTslAnimNode_Falling : FAnimNode_AssetPlayerBase {
	struct U*f7e8bdf881* AnimDBMap; // 0x58(0x08)
	struct U*f7e8bdf881* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslFallingNodeAnimationData> BlendSpacesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	float X; // 0x90(0x04)
	float BlendTime; // 0x94(0x04)
	char pad_98[0x4]; // 0x98(0x04)
	enum class EWeaponClass WeaponClass; // 0x9c(0x01)
	enum class EAlphaBlendOption BlendType; // 0x9d(0x01)
	char pad_9E[0x2]; // 0x9e(0x02)
};

// ScriptStruct TslGame.TslFallingNodeAnimationData
// Size: 0xd0 (Inherited: 0x00)
struct FTslFallingNodeAnimationData {
	struct UBlendSpace1D* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb8]; // 0x18(0xb8)
};

// ScriptStruct TslGame.TslAnimNode_Healing
// Size: 0x80 (Inherited: 0x30)
struct FTslAnimNode_Healing : FAnimNode_Base {
	struct U*f7e8bdf881* AnimDBMap; // 0x30(0x08)
	struct U*f7e8bdf881* PrevAnimDBMap; // 0x38(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x40(0x08)
	struct TArray<struct FTslHealingSequenceData> SequencesData; // 0x48(0x10)
	char pad_58[0x18]; // 0x58(0x18)
	float PlayRate; // 0x70(0x04)
	float BlendTime; // 0x74(0x04)
	enum class EAlphaBlendOption BlendType; // 0x78(0x01)
	enum class ECastAnim CurrentItem; // 0x79(0x01)
	bool IsParentControl; // 0x7a(0x01)
	enum class EAnimStance Stance; // 0x7b(0x01)
	bool IsFPP; // 0x7c(0x01)
	bool Looping; // 0x7d(0x01)
	char pad_7E[0x2]; // 0x7e(0x02)
};

// ScriptStruct TslGame.TslHealingSequenceData
// Size: 0x28 (Inherited: 0x00)
struct FTslHealingSequenceData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x20]; // 0x08(0x20)
};

// ScriptStruct TslGame.TslAnimNode_Idles
// Size: 0xa8 (Inherited: 0x58)
struct FTslAnimNode_Idles : FAnimNode_AssetPlayerBase {
	struct U*f7e8bdf881* AnimDBMap; // 0x58(0x08)
	struct U*f7e8bdf881* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslIdlesNodeAnimationData> SequencesData; // 0x70(0x10)
	char pad_80[0x18]; // 0x80(0x18)
	float PlayRate; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	enum class EAnimStance Stance; // 0xa0(0x01)
	enum class EWeaponClass WeaponClass; // 0xa1(0x01)
	bool Relaxed; // 0xa2(0x01)
	enum class EAlphaBlendOption BlendType; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.TslIdlesNodeAnimationData
// Size: 0x38 (Inherited: 0x00)
struct FTslIdlesNodeAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x30]; // 0x08(0x30)
};

// ScriptStruct TslGame.TslAnimNode_JumpStart
// Size: 0xb8 (Inherited: 0x58)
struct FTslAnimNode_JumpStart : FAnimNode_AssetPlayerBase {
	struct U*f7e8bdf881* AnimDBMap; // 0x58(0x08)
	struct U*f7e8bdf881* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslJumpStartNodeAnimationData> SequencesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	struct FVector Velocity; // 0x90(0x0c)
	float Yaw; // 0x9c(0x04)
	float JumpHeight; // 0xa0(0x04)
	float BlendTime; // 0xa4(0x04)
	float BackwardAngleThreshold; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	enum class EWeaponClass WeaponClass; // 0xb0(0x01)
	bool bRelaxed; // 0xb1(0x01)
	bool bIsLocalPlayer; // 0xb2(0x01)
	enum class EAlphaBlendOption BlendType; // 0xb3(0x01)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.TslJumpStartNodeAnimationData
// Size: 0x40 (Inherited: 0x00)
struct FTslJumpStartNodeAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x38]; // 0x08(0x38)
};

// ScriptStruct TslGame.TslAnimNode_LobbyAnimSequence
// Size: 0x100 (Inherited: 0x70)
struct FTslAnimNode_LobbyAnimSequence : FAnimNode_SequencePlayer {
	struct FLobbyCharacterAnimationDataRow CurrentAnimData; // 0x70(0x80)
	struct UAnimSequenceBase* LobbySequence; // 0xf0(0x08)
	int32 LobbyCharacterPosition; // 0xf8(0x04)
	enum class ELobbyCharacterReadyType ReadyType; // 0xfc(0x01)
	enum class EWeaponClass LastLobbyAnimationClass; // 0xfd(0x01)
	bool bPlayingDefaultAnim; // 0xfe(0x01)
	bool bPlayNextAnim; // 0xff(0x01)
};

// ScriptStruct TslGame.LobbyCharacterAnimationDataRow
// Size: 0x80 (Inherited: 0x08)
struct FLobbyCharacterAnimationDataRow : FTableRowBase {
	enum class ELobbyCharacterPosition Poisition; // 0x08(0x01)
	enum class ELobbyCharacterReadyType State; // 0x09(0x01)
	bool bDefaultAnimation; // 0x0a(0x01)
	char pad_B[0x1]; // 0x0b(0x01)
	float CycleTimes; // 0x0c(0x04)
	struct UAnimSequenceBase* UnArmed; // 0x10(0x08)
	struct UAnimSequenceBase* Pistol; // 0x18(0x08)
	struct UAnimSequenceBase* SMG; // 0x20(0x08)
	struct UAnimSequenceBase* Rifle; // 0x28(0x08)
	struct UAnimSequenceBase* Carbine; // 0x30(0x08)
	struct UAnimSequenceBase* Shotgun; // 0x38(0x08)
	struct UAnimSequenceBase* Sniper; // 0x40(0x08)
	struct UAnimSequenceBase* DMR; // 0x48(0x08)
	struct UAnimSequenceBase* LMG; // 0x50(0x08)
	struct UAnimSequenceBase* Melee; // 0x58(0x08)
	struct UAnimSequenceBase* Throwable; // 0x60(0x08)
	struct UAnimSequenceBase* Shield; // 0x68(0x08)
	struct UAnimSequenceBase* crossbow; // 0x70(0x08)
	struct UAnimSequenceBase* Launcher; // 0x78(0x08)
};

// ScriptStruct TslGame.TslAnimNode_PlayIdleSequence
// Size: 0xd0 (Inherited: 0x58)
struct FTslAnimNode_PlayIdleSequence : FAnimNode_AssetPlayerBase {
	struct U*d99201c4c8* ParentInstance; // 0x58(0x08)
	struct U*24c6652716* AnimDB; // 0x60(0x08)
	float BlendTime; // 0x68(0x04)
	float PlayRate; // 0x6c(0x04)
	float IdleTriggerTimeMin; // 0x70(0x04)
	float IdleTriggerTimeVariation; // 0x74(0x04)
	bool bIsFPP; // 0x78(0x01)
	bool bIsCold; // 0x79(0x01)
	enum class EAnimStance Stance; // 0x7a(0x01)
	char pad_7B[0x5]; // 0x7b(0x05)
	struct FSequenceData ActiveSequence; // 0x80(0x10)
	struct FSequenceData PreviousSequence; // 0x90(0x10)
	char pad_A0[0x30]; // 0xa0(0x30)
};

// ScriptStruct TslGame.SequenceData
// Size: 0x10 (Inherited: 0x00)
struct FSequenceData {
	struct UAnimSequence* Sequence; // 0x00(0x08)
	float AccumulatedTime; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslAnimNode_RotateBones
// Size: 0xd0 (Inherited: 0x30)
struct FTslAnimNode_RotateBones : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x30(0x18)
	struct TArray<struct FName> Bone; // 0x48(0x10)
	struct TArray<enum class ERotateBoneSpace> Space; // 0x58(0x10)
	struct TArray<enum class EAxis> Axis; // 0x68(0x10)
	struct TArray<float> Angle; // 0x78(0x10)
	struct TArray<struct FRotator> Rotator; // 0x88(0x10)
	struct TArray<float> Alpha; // 0x98(0x10)
	char pad_A8[0x20]; // 0xa8(0x20)
	enum class ERotateBoneInputType InputType; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
};

// ScriptStruct TslGame.TslAnimNode_RotateRootBone
// Size: 0x68 (Inherited: 0x30)
struct FTslAnimNode_RotateRootBone : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x30(0x18)
	char pad_48[0x10]; // 0x48(0x10)
	float Yaw; // 0x58(0x04)
	float Pitch; // 0x5c(0x04)
	bool bKeepChildTransforms; // 0x60(0x01)
	bool bInvert; // 0x61(0x01)
	char pad_62[0x6]; // 0x62(0x06)
};

// ScriptStruct TslGame.TslAnimNode_SequenceEvaluatorWithBlending
// Size: 0xa0 (Inherited: 0x58)
struct FTslAnimNode_SequenceEvaluatorWithBlending : FAnimNode_AssetPlayerBase {
	struct UAnimSequence* Sequence; // 0x58(0x08)
	struct UAnimSequence* PrevSequence; // 0x60(0x08)
	struct TArray<struct FTslSequenceBlending> SequencesData; // 0x68(0x10)
	char pad_78[0x10]; // 0x78(0x10)
	float ExplicitTime; // 0x88(0x04)
	float BlendTime; // 0x8c(0x04)
	enum class EAlphaBlendOption BlendType; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct UCurveFloat* CustomBlendCurve; // 0x98(0x08)
};

// ScriptStruct TslGame.TslSequenceBlending
// Size: 0x30 (Inherited: 0x00)
struct FTslSequenceBlending {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x28]; // 0x08(0x28)
};

// ScriptStruct TslGame.TslAnimNode_Slot
// Size: 0x78 (Inherited: 0x70)
struct FTslAnimNode_Slot : FAnimNode_Slot {
	float Alpha; // 0x70(0x04)
	enum class ECustomAnimSlotType SlotType; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// ScriptStruct TslGame.TslAnimNode_SlotByEnum
// Size: 0x1a8 (Inherited: 0x30)
struct FTslAnimNode_SlotByEnum : FAnimNode_Base {
	struct FPoseLink Source; // 0x30(0x18)
	bool ActiveEnumValue; // 0x48(0x01)
	enum class EAlphaBlendOption BlendType; // 0x49(0x01)
	char pad_4A[0x26]; // 0x4a(0x26)
	struct TArray<struct FName> Slot; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	struct TArray<float> BlendTime; // 0x90(0x10)
	struct TArray<int32> EnumToSlotIndex; // 0xa0(0x10)
	struct UCurveFloat* CustomBlendCurve; // 0xb0(0x08)
	char pad_B8[0x4]; // 0xb8(0x04)
	enum class EAnimAlphaInputType AlphaInputType; // 0xbc(0x01)
	bool bAlphaBoolEnabled; // 0xbd(0x01)
	char pad_BE[0x2]; // 0xbe(0x02)
	float Alpha; // 0xc0(0x04)
	struct FInputScaleBias AlphaScaleBias; // 0xc4(0x08)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct FInputAlphaBoolBlend AlphaBoolBlend; // 0xd0(0x50)
	struct FName AlphaCurveName; // 0x120(0x08)
	struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x128(0x30)
	char pad_158[0x50]; // 0x158(0x50)
};

// ScriptStruct TslGame.TslAnimNode_SlotByWeapon
// Size: 0x118 (Inherited: 0x70)
struct FTslAnimNode_SlotByWeapon : FAnimNode_Slot {
	float Alpha; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct TMap<enum class EAnimWeaponType, struct FName> SlotNames; // 0x78(0x50)
	enum class EAnimWeaponType InWeapon; // 0xc8(0x01)
	char pad_C9[0x4f]; // 0xc9(0x4f)
};

// ScriptStruct TslGame.*24dbed25c1
// Size: 0x18 (Inherited: 0x08)
struct F*24dbed25c1 : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	struct UClass* *74fc4ca00e; // 0x10(0x08)
};

// ScriptStruct TslGame.*4833380d34
// Size: 0x18 (Inherited: 0x08)
struct F*4833380d34 : FTableRowBase {
	struct TArray<struct FName> ItemIDs; // 0x08(0x10)
};

// ScriptStruct TslGame.*9dd5c76e4f
// Size: 0x28 (Inherited: 0x08)
struct F*9dd5c76e4f : FTableRowBase {
	enum class ECoinTakeType CoinTakeType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 BannedRoundAttributes; // 0x0c(0x04)
	int32 TakeValue; // 0x10(0x04)
	bool bOverwrite; // 0x14(0x01)
	bool bUseCustomOverride; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
	struct TArray<struct F*b6a1c72588> CustomOverrideValues; // 0x18(0x10)
};

// ScriptStruct TslGame.*b6a1c72588
// Size: 0x08 (Inherited: 0x00)
struct F*b6a1c72588 {
	int32 OverrideIndex; // 0x00(0x04)
	int32 OverrideValue; // 0x04(0x04)
};

// ScriptStruct TslGame.*a40ccc8ee1
// Size: 0x50 (Inherited: 0x08)
struct F*a40ccc8ee1 : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	bool bEssential; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 CarryLimit; // 0x14(0x04)
	enum class EBombItemCategory Category; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	int32 SortID; // 0x1c(0x04)
	bool Purchasable; // 0x20(0x01)
	bool bGiveItemAfterRestart; // 0x21(0x01)
	char pad_22[0x2]; // 0x22(0x02)
	int32 Price; // 0x24(0x04)
	struct TArray<struct FName> WeaponAttachments; // 0x28(0x10)
	struct F*ce3da9a385 WeaponAmmoData; // 0x38(0x10)
	enum class EBombScopeInfo ScopeInfo; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.*ce3da9a385
// Size: 0x10 (Inherited: 0x10)
struct F*ce3da9a385 : F*c79bcba3b9 {
};

// ScriptStruct TslGame.*c79bcba3b9
// Size: 0x10 (Inherited: 0x00)
struct F*c79bcba3b9 {
	struct FName ItemID; // 0x00(0x08)
	int32 Stack; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*8f37ce409a
// Size: 0x20 (Inherited: 0x10)
struct F*8f37ce409a : F*c79bcba3b9 {
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct TslGame.*0e857deea0
// Size: 0x520 (Inherited: 0x520)
struct F*0e857deea0 : F*c3868df940 {
};

// ScriptStruct TslGame.*0929a5bc86
// Size: 0x178 (Inherited: 0x08)
struct F*0929a5bc86 : FTableRowBase {
	enum class *d6d56f23e0 CharacterInteractType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float MaxInteractableDistance; // 0x0c(0x04)
	struct FText InteractionVerb; // 0x10(0x18)
	struct FText InteractiveObjectName; // 0x28(0x18)
	bool bUseTraceCheck; // 0x40(0x01)
	bool bTraceComplexForInteraction; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct F*59709b63e2 CastConfig; // 0x48(0x130)
};

// ScriptStruct TslGame.*59709b63e2
// Size: 0x130 (Inherited: 0x00)
struct F*59709b63e2 {
	struct FText CastName; // 0x00(0x18)
	float CastTime; // 0x18(0x04)
	enum class ECastPriority CastPriority; // 0x1c(0x01)
	enum class ECastLevel CastLevel; // 0x1d(0x01)
	bool bIgnoreCastDistanceLimitation; // 0x1e(0x01)
	char pad_1F[0x1]; // 0x1f(0x01)
	float CastMaxDistance; // 0x20(0x04)
	float CastMaxDistanceMultiplierOnServer; // 0x24(0x04)
	float CasterAndCastObjectMaxDistance; // 0x28(0x04)
	float CasterAndCastObjectMaxDistanceMultiplierOnServer; // 0x2c(0x04)
	bool bCanCastInsideMovingVehicle; // 0x30(0x01)
	bool bKeepCastWhenVehicleHandling; // 0x31(0x01)
	char pad_32[0x2]; // 0x32(0x02)
	float MaxLinAcceleration; // 0x34(0x04)
	float CastMaxSpeed; // 0x38(0x04)
	float CastWalkSpeedModifier; // 0x3c(0x04)
	bool bNeedUnarm; // 0x40(0x01)
	bool bRecastsOnFinish; // 0x41(0x01)
	bool bLimitViewRotation; // 0x42(0x01)
	bool bForceStance; // 0x43(0x01)
	bool bSkipRestoreCharacterStance; // 0x44(0x01)
	bool bLockRotation; // 0x45(0x01)
	bool bCanCancelCasting; // 0x46(0x01)
	bool bCheckCastableConditionInProgress; // 0x47(0x01)
	bool bCancleWhenSprint; // 0x48(0x01)
	enum class ECastAnim CastAnim; // 0x49(0x01)
	char pad_4A[0x2]; // 0x4a(0x02)
	float CastBlendingTime; // 0x4c(0x04)
	float CancelBlockDuration; // 0x50(0x04)
	float CastAnimPlayRate; // 0x54(0x04)
	bool IsPermanentCasting; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct F*4c56244188 CustomCastAnim; // 0x60(0xc0)
	enum class EStanceMode Stance; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct FName *5f440d9924; // 0x128(0x08)
};

// ScriptStruct TslGame.*4c56244188
// Size: 0xc0 (Inherited: 0x00)
struct F*4c56244188 {
	struct F*3f9e14a8e8 StartAnim; // 0x00(0x40)
	struct F*3f9e14a8e8 LoopAnim; // 0x40(0x40)
	struct F*3f9e14a8e8 EndAnim; // 0x80(0x40)
};

// ScriptStruct TslGame.*3f9e14a8e8
// Size: 0x40 (Inherited: 0x00)
struct F*3f9e14a8e8 {
	struct F*1690d0bb94 AnimSequence; // 0x00(0x10)
	struct F*1690d0bb94 AnimSequenceFPP; // 0x10(0x10)
	struct F*1690d0bb94 AnimSequenceProne; // 0x20(0x10)
	struct F*1690d0bb94 AnimSequenceProneFPP; // 0x30(0x10)
};

// ScriptStruct TslGame.*1690d0bb94
// Size: 0x10 (Inherited: 0x00)
struct F*1690d0bb94 {
	struct UAnimSequence* Sequence; // 0x00(0x08)
	float PlayRate; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*ed7baf47dc
// Size: 0x480 (Inherited: 0x00)
struct F*ed7baf47dc {
	struct F*53d3bbec8c *53d3bbec8c; // 0x00(0x290)
	struct F*5eaebcfee5 *5eaebcfee5; // 0x290(0x1b0)
	struct F*6fd6c49a75 *6fd6c49a75; // 0x440(0x38)
	char pad_478[0x8]; // 0x478(0x08)
};

// ScriptStruct TslGame.*6fd6c49a75
// Size: 0x38 (Inherited: 0x08)
struct F*6fd6c49a75 : F*559f875cfc {
	int32 *aa9f917a85; // 0x08(0x04)
	int32 *44e64255c7; // 0x0c(0x04)
	float Timestamp; // 0x10(0x04)
	struct FVector *9f2aefad8c; // 0x14(0x0c)
	int64 *7d35903961; // 0x20(0x08)
	struct FString TextMarker; // 0x28(0x10)
};

// ScriptStruct TslGame.*559f875cfc
// Size: 0x08 (Inherited: 0x00)
struct F*559f875cfc {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*5eaebcfee5
// Size: 0x1b0 (Inherited: 0x08)
struct F*5eaebcfee5 : F*559f875cfc {
	char pad_8[0x8]; // 0x08(0x08)
	struct F*ddde035f4c *2ded3069a3; // 0x10(0xa0)
	struct F*ddde035f4c *29bc549376; // 0xb0(0xa0)
	struct FString *0c12a5a866; // 0x150(0x10)
	struct FString *3eaee5b390; // 0x160(0x10)
	struct FString *e629bc7688; // 0x170(0x10)
	struct FString *579cc09146; // 0x180(0x10)
	char pad_190[0x20]; // 0x190(0x20)
};

// ScriptStruct TslGame.*ddde035f4c
// Size: 0xa0 (Inherited: 0x00)
struct F*ddde035f4c {
	float Min; // 0x00(0x04)
	float Max; // 0x04(0x04)
	float Average; // 0x08(0x04)
	char pad_C[0x94]; // 0x0c(0x94)
};

// ScriptStruct TslGame.*53d3bbec8c
// Size: 0x290 (Inherited: 0x08)
struct F*53d3bbec8c : F*559f875cfc {
	char pad_8[0x8]; // 0x08(0x08)
	struct F*ddde035f4c Frame; // 0x10(0xa0)
	struct F*ddde035f4c *1aeacedb17; // 0xb0(0xa0)
	struct F*ddde035f4c *02f02bd6f5; // 0x150(0xa0)
	struct F*ddde035f4c *3fab8deaaa; // 0x1f0(0xa0)
};

// ScriptStruct TslGame.*29c4f0013a
// Size: 0x40 (Inherited: 0x00)
struct F*29c4f0013a {
	struct FString DeviceName; // 0x00(0x10)
	struct FString ClientVersion; // 0x10(0x10)
	struct FString MapName; // 0x20(0x10)
	struct FString ModeName; // 0x30(0x10)
};

// ScriptStruct TslGame.*8f433af44b
// Size: 0x28 (Inherited: 0x08)
struct F*8f433af44b : FTableRowBase {
	float phase; // 0x08(0x04)
	float killer_x; // 0x0c(0x04)
	float killer_y; // 0x10(0x04)
	float killer_z; // 0x14(0x04)
	float victim_x; // 0x18(0x04)
	float victim_y; // 0x1c(0x04)
	float victim_z; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.HemostasisTableRow
// Size: 0x18 (Inherited: 0x08)
struct FHemostasisTableRow : FTableRowBase {
	int32 Stack; // 0x08(0x04)
	bool bCanHemostasis; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float HemostasisPercent; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*06651205d8
// Size: 0x3e8 (Inherited: 0x3d8)
struct F*06651205d8 : FItemTableRowCastable {
	struct TArray<struct F*5a6ba1ab1e> SupplyItems; // 0x3d8(0x10)
};

// ScriptStruct TslGame.ItemTableRowCastable
// Size: 0x3d8 (Inherited: 0x288)
struct FItemTableRowCastable : F*7c826e43af {
	bool *55aff841d1; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
	struct F*59709b63e2 *59709b63e2; // 0x290(0x130)
	enum class ECastableItemType *dfd8aa801b; // 0x3c0(0x01)
	bool *7493beb86f; // 0x3c1(0x01)
	char pad_3C2[0x6]; // 0x3c2(0x06)
	struct TArray<struct UClass*> *41907fc331; // 0x3c8(0x10)
};

// ScriptStruct TslGame.*7c826e43af
// Size: 0x288 (Inherited: 0x08)
struct F*7c826e43af : FTableRowBase {
	char bStackable : 1; // 0x08(0x01)
	char bUsable : 1; // 0x08(0x01)
	char bIsConsumable : 1; // 0x08(0x01)
	char bSetStackMaterialParameter : 1; // 0x08(0x01)
	char bDisableSpawnInGame : 1; // 0x08(0x01)
	char pad_8_5 : 3; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 StackCount; // 0x0c(0x04)
	int32 DefaultStackCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FText ItemName; // 0x18(0x18)
	struct FText ItemCategory; // 0x30(0x18)
	struct FText ItemDetailedName; // 0x48(0x18)
	struct FText ItemDescription; // 0x60(0x18)
	float ItemMaxInteractableDistance; // 0x78(0x04)
	int32 StackCountMax; // 0x7c(0x04)
	float SpacePerItem; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UStaticMesh* DroppedMesh; // 0x88(0x20)
	float DroppedMeshScale; // 0xa8(0x04)
	bool bChangeableDroppedMeshByStackCount; // 0xac(0x01)
	char pad_AD[0x3]; // 0xad(0x03)
	struct TArray<struct F*cf7aaf6771> DroppedItemMeshData; // 0xb0(0x10)
	bool bDropAsProjectile; // 0xc0(0x01)
	bool bThermalScopeInteractive; // 0xc1(0x01)
	enum class EThermalItemType ThermalItemType; // 0xc2(0x01)
	char pad_C3[0x5]; // 0xc3(0x05)
	struct U*af5a42646d* ProjectileConfig; // 0xc8(0x20)
	struct UTexture* Icon; // 0xe8(0x20)
	struct UTexture* ToolTipIcon; // 0x108(0x20)
	float IconSizeRatio; // 0x128(0x04)
	float ToolTipIconSizeRatio; // 0x12c(0x04)
	struct UAkAudioEvent* DropSoundAk; // 0x130(0x20)
	struct FName DropAnimation; // 0x150(0x08)
	struct UAkAudioEvent* PickUpSoundAk; // 0x158(0x20)
	enum class EPickupAnimType PickUpAnimationOverride; // 0x178(0x01)
	char pad_179[0x7]; // 0x179(0x07)
	struct UAkAudioEvent* InventoryPutSoundAk; // 0x180(0x20)
	int32 SortPriority; // 0x1a0(0x04)
	enum class EItemCategory Category; // 0x1a4(0x01)
	char pad_1A5[0x3]; // 0x1a5(0x03)
	struct FName SubCategory; // 0x1a8(0x08)
	bool bIsToy; // 0x1b0(0x01)
	bool bNeedToCheckPopup; // 0x1b1(0x01)
	bool bCanSell; // 0x1b2(0x01)
	char pad_1B3[0x1]; // 0x1b3(0x01)
	int32 Price; // 0x1b4(0x04)
	bool bIsLobbyItem; // 0x1b8(0x01)
	char pad_1B9[0x3]; // 0x1b9(0x03)
	int32 LobbyItemID; // 0x1bc(0x04)
	struct F*3fda32cbb1 LobbyItemDesc; // 0x1c0(0x60)
	bool bIsLobbyWeapon; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	int32 LobbyWeaponID; // 0x224(0x04)
	struct UClass* LobbyWeaponInstance; // 0x228(0x20)
	bool *83e66454d5; // 0x248(0x01)
	bool *272709832b; // 0x249(0x01)
	bool *c4b4b358d3; // 0x24a(0x01)
	char pad_24B[0x5]; // 0x24b(0x05)
	struct FString Note; // 0x250(0x10)
	int32 AIFullValue; // 0x260(0x04)
	int32 ItemSubType; // 0x264(0x04)
	struct FName ItemID; // 0x268(0x08)
	struct UClass* ItemClass; // 0x270(0x08)
	struct UClass* *43171c08df; // 0x278(0x08)
	struct U*118b1a2e1e* *781d6151c7; // 0x280(0x08)
};

// ScriptStruct TslGame.*3fda32cbb1
// Size: 0x60 (Inherited: 0x00)
struct F*3fda32cbb1 {
	char *2919b6ddf8 : 1; // 0x00(0x01)
	char bPointSellable : 1; // 0x00(0x01)
	char *d1c3da71dc : 1; // 0x00(0x01)
	char bPointRefundable : 1; // 0x00(0x01)
	char pad_0_4 : 4; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString *8ede8310e8; // 0x08(0x10)
	enum class ELobbyItemTier Tier; // 0x18(0x01)
	enum class ELobbyItemCategory Category; // 0x19(0x01)
	char pad_1A[0x6]; // 0x1a(0x06)
	struct FText Description; // 0x20(0x18)
	bool *4e8fb84291; // 0x38(0x01)
	bool *ecab3d78c8; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct TArray<enum class ELobbyItemPlatform> Platforms; // 0x40(0x10)
	float *8db52a6872; // 0x50(0x04)
	enum class ELobbyItemPointSellingType *0ede5cfee8; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	int32 *e2f166ded0; // 0x58(0x04)
	int32 *5577fb39d4; // 0x5c(0x04)
};

// ScriptStruct TslGame.*cf7aaf6771
// Size: 0x28 (Inherited: 0x00)
struct F*cf7aaf6771 {
	struct UStaticMesh* DroppedItemMesh; // 0x00(0x20)
	int32 MinStackCount; // 0x20(0x04)
	int32 MaxStackCount; // 0x24(0x04)
};

// ScriptStruct TslGame.*5a6ba1ab1e
// Size: 0x10 (Inherited: 0x00)
struct F*5a6ba1ab1e {
	struct FName SupplyItemID; // 0x00(0x08)
	int32 StackCount; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*5d690c0392
// Size: 0x2a0 (Inherited: 0x288)
struct F*5d690c0392 : F*7c826e43af {
	enum class ECustomPartType CustomPart; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
	struct TArray<struct FName> PartTags; // 0x290(0x10)
};

// ScriptStruct TslGame.*f7de330351
// Size: 0x2a0 (Inherited: 0x2a0)
struct F*f7de330351 : F*20e56c02b5 {
};

// ScriptStruct TslGame.*20e56c02b5
// Size: 0x2a0 (Inherited: 0x288)
struct F*20e56c02b5 : F*7c826e43af {
	bool bAutoAction; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
	struct F*b4789e7d53 SkinParam; // 0x290(0x10)
};

// ScriptStruct TslGame.*b4789e7d53
// Size: 0x10 (Inherited: 0x00)
struct F*b4789e7d53 {
	enum class ESkinCategory SkinCategory; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName SkinName; // 0x08(0x08)
};

// ScriptStruct TslGame.ItemTableRowVehiclePart
// Size: 0x330 (Inherited: 0x2a0)
struct FItemTableRowVehiclePart : F*5d690c0392 {
	enum class EVehiclePartType VehiclePart; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct TArray<struct UMaterialInterface*> Materials; // 0x2a8(0x10)
	struct TMap<int32, struct UMaterialInterface*> OverrideDestroyedMaterial; // 0x2b8(0x50)
	struct USkeletalMesh* SkeletalMesh; // 0x308(0x20)
	int32 WheelSize; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
};

// ScriptStruct TslGame.*d1d6f26aa6
// Size: 0x38 (Inherited: 0x00)
struct F*d1d6f26aa6 {
	float *89e7166bf8; // 0x00(0x04)
	float *183898dba2; // 0x04(0x04)
	int32 *2d1eefe9a3; // 0x08(0x04)
	float *5620338366; // 0x0c(0x04)
	float *95d086ab09; // 0x10(0x04)
	float *524a4488f1; // 0x14(0x04)
	int32 *4d9dbe70bf; // 0x18(0x04)
	float *0df108d2f9; // 0x1c(0x04)
	struct TArray<struct F*dd816bfb3f> *e2037b90e6; // 0x20(0x10)
	bool *1a9c20c1f7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *dd810490dd; // 0x34(0x04)
};

// ScriptStruct TslGame.*dd816bfb3f
// Size: 0x30 (Inherited: 0x00)
struct F*dd816bfb3f {
	struct FString MapName; // 0x00(0x10)
	struct FString LocationName; // 0x10(0x10)
	struct FVector Location; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*1a874fb0ba
// Size: 0x10 (Inherited: 0x00)
struct F*1a874fb0ba {
	uint32 *905bcf2449; // 0x00(0x04)
	float *5620338366; // 0x04(0x04)
	float *7a529adc1d; // 0x08(0x04)
	bool *e6e468540e; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*f8d71d2104
// Size: 0x08 (Inherited: 0x00)
struct F*f8d71d2104 {
	float *89e7166bf8; // 0x00(0x04)
	float *bb0950731c; // 0x04(0x04)
};

// ScriptStruct TslGame.*5f93fc3e4e
// Size: 0x38 (Inherited: 0x00)
struct F*5f93fc3e4e {
	float *89e7166bf8; // 0x00(0x04)
	float *183898dba2; // 0x04(0x04)
	int32 *2d1eefe9a3; // 0x08(0x04)
	float *5620338366; // 0x0c(0x04)
	float *95d086ab09; // 0x10(0x04)
	float *524a4488f1; // 0x14(0x04)
	int32 *4d9dbe70bf; // 0x18(0x04)
	float *0df108d2f9; // 0x1c(0x04)
	struct TArray<struct F*341fbd2454> *e2037b90e6; // 0x20(0x10)
	bool *1a9c20c1f7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *dd810490dd; // 0x34(0x04)
};

// ScriptStruct TslGame.*341fbd2454
// Size: 0x30 (Inherited: 0x00)
struct F*341fbd2454 {
	struct FString MapName; // 0x00(0x10)
	struct FString LocationName; // 0x10(0x10)
	struct FVector Location; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*c4568779b5
// Size: 0x18 (Inherited: 0x08)
struct F*c4568779b5 : FTableRowBase {
	struct UStaticMesh* OldMesh; // 0x08(0x08)
	struct UStaticMesh* NewMesh; // 0x10(0x08)
};

// ScriptStruct TslGame.*4bed4bffab
// Size: 0x10 (Inherited: 0x08)
struct F*4bed4bffab : FTableRowBase {
	struct UStaticMesh* Mesh; // 0x08(0x08)
};

// ScriptStruct TslGame.*15d44afea1
// Size: 0x30 (Inherited: 0x08)
struct F*15d44afea1 : FTableRowBase {
	enum class *92a8d5bca4 DetailMode; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct TArray<struct UStaticMesh*> MeshesToOverride; // 0x10(0x10)
	struct TArray<struct UMaterialInterface*> DecalMaterialsToOverride; // 0x20(0x10)
};

// ScriptStruct TslGame.*435c423b0f
// Size: 0x10 (Inherited: 0x08)
struct F*435c423b0f : FTableRowBase {
	struct UClass* BPClass; // 0x08(0x08)
};

// ScriptStruct TslGame.*1768c34f00
// Size: 0x70 (Inherited: 0x08)
struct F*1768c34f00 : FTableRowBase {
	struct FStringAssetReference *008f9d9575; // 0x08(0x10)
	struct FStringAssetReference *d6cb2c9bea; // 0x18(0x10)
	struct FStringAssetReference *a0eb211857; // 0x28(0x10)
	struct FStringAssetReference *1e5c332be5; // 0x38(0x10)
	struct FStringAssetReference *3fdbf1cecd; // 0x48(0x10)
	struct FStringAssetReference *df74cd9a8e; // 0x58(0x10)
	float Ratio; // 0x68(0x04)
	bool *64b9cdac81; // 0x6c(0x01)
	bool *2fba7bae16; // 0x6d(0x01)
	bool *6c889527df; // 0x6e(0x01)
	bool *d6e3201447; // 0x6f(0x01)
};

// ScriptStruct TslGame.*f910a4947d
// Size: 0x18 (Inherited: 0x08)
struct F*f910a4947d : FTableRowBase {
	struct FVector BeachPointLocation; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*4cf15b8d87
// Size: 0x18 (Inherited: 0x08)
struct F*4cf15b8d87 : FTableRowBase {
	int32 LocationX; // 0x08(0x04)
	int32 LocationY; // 0x0c(0x04)
	int32 LocationZ; // 0x10(0x04)
	int32 SafeScore; // 0x14(0x04)
};

// ScriptStruct TslGame.*c9a266d962
// Size: 0x60 (Inherited: 0x08)
struct F*c9a266d962 : FTableRowBase {
	float NormalArea; // 0x08(0x04)
	char pad_C[0x54]; // 0x0c(0x54)
};

// ScriptStruct TslGame.*522c76fd0c
// Size: 0xc8 (Inherited: 0x60)
struct F*522c76fd0c : F*c9a266d962 {
	float Farm; // 0x60(0x04)
	float FerryPier; // 0x64(0x04)
	float Gatka; // 0x68(0x04)
	float Georgopol; // 0x6c(0x04)
	float Hospital; // 0x70(0x04)
	float Kameshki; // 0x74(0x04)
	float Lipovka; // 0x78(0x04)
	float Mansion; // 0x7c(0x04)
	float Mylta; // 0x80(0x04)
	float MyltaPower; // 0x84(0x04)
	float Novorepnoye; // 0x88(0x04)
	float Pochinki; // 0x8c(0x04)
	float Primorsk; // 0x90(0x04)
	float Prison; // 0x94(0x04)
	float Quarry; // 0x98(0x04)
	float Rozhok; // 0x9c(0x04)
	float Ruins; // 0xa0(0x04)
	float School; // 0xa4(0x04)
	float Severny; // 0xa8(0x04)
	float Shelter; // 0xac(0x04)
	float ShootingRange; // 0xb0(0x04)
	float SosnovkaMilitaryBase; // 0xb4(0x04)
	float Stalber; // 0xb8(0x04)
	float YasnayaPolyana; // 0xbc(0x04)
	float Zharki; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// ScriptStruct TslGame.*84d72ff3bb
// Size: 0x70 (Inherited: 0x60)
struct F*84d72ff3bb : F*c9a266d962 {
	float Level_A; // 0x60(0x04)
	float Level_B; // 0x64(0x04)
	float Level_C; // 0x68(0x04)
	float Level_D; // 0x6c(0x04)
};

// ScriptStruct TslGame.*53c1dc1876
// Size: 0xd8 (Inherited: 0x60)
struct F*53c1dc1876 : F*c9a266d962 {
	float Alcantara; // 0x60(0x04)
	float CampoMilitar; // 0x64(0x04)
	float Chumacera; // 0x68(0x04)
	float Craterfields; // 0x6c(0x04)
	float CruzdelValle; // 0x70(0x04)
	float ElAzahar; // 0x74(0x04)
	float ElPozo; // 0x78(0x04)
	float Graveyard; // 0x7c(0x04)
	float HeciendadelPatron; // 0x80(0x04)
	float Junkyard; // 0x84(0x04)
	float LaBendita; // 0x88(0x04)
	float LaCobreria; // 0x8c(0x04)
	float Ladrillera; // 0x90(0x04)
	float Lmpala; // 0x94(0x04)
	float LosHigos; // 0x98(0x04)
	float LosLeones; // 0x9c(0x04)
	float MinasdelSur; // 0xa0(0x04)
	float MinasGenerales; // 0xa4(0x04)
	float MonteNuevo; // 0xa8(0x04)
	float Pecado; // 0xac(0x04)
	float Powergrid; // 0xb0(0x04)
	float Prison; // 0xb4(0x04)
	float PuertoParaiso; // 0xb8(0x04)
	float Ruins; // 0xbc(0x04)
	float SanMartin; // 0xc0(0x04)
	float TierraBronca; // 0xc4(0x04)
	float TorreAhumada; // 0xc8(0x04)
	float TrailerPark; // 0xcc(0x04)
	float ValledelMar; // 0xd0(0x04)
	float WaterTreatment; // 0xd4(0x04)
};

// ScriptStruct TslGame.*ccd3013f31
// Size: 0xa0 (Inherited: 0x60)
struct F*ccd3013f31 : F*c9a266d962 {
	float castle; // 0x60(0x04)
	float CoalMine; // 0x64(0x04)
	float Cosmodrome; // 0x68(0x04)
	float DekaMesto; // 0x6c(0x04)
	float Dinoland; // 0x70(0x04)
	float Kranik; // 0x74(0x04)
	float Laveni; // 0x78(0x04)
	float Laznova; // 0x7c(0x04)
	float LumberYard; // 0x80(0x04)
	float Naros; // 0x84(0x04)
	float Observatory; // 0x88(0x04)
	float Pavilka; // 0x8c(0x04)
	float TrainStation; // 0x90(0x04)
	float Trika; // 0x94(0x04)
	float Villa; // 0x98(0x04)
	float Winery; // 0x9c(0x04)
};

// ScriptStruct TslGame.*1ec3c0d199
// Size: 0x78 (Inherited: 0x60)
struct F*1ec3c0d199 : F*c9a266d962 {
	float CoalYards; // 0x60(0x04)
	float Docks; // 0x64(0x04)
	float IndustrialPark; // 0x68(0x04)
	float RailYard; // 0x6c(0x04)
	float Steelmill; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.*06e046ce5c
// Size: 0xb0 (Inherited: 0x60)
struct F*06e046ce5c : F*c9a266d962 {
	float Arena; // 0x60(0x04)
	float Assembly; // 0x64(0x04)
	float Cabana_Town; // 0x68(0x04)
	float Coastal_Towns; // 0x6c(0x04)
	float Concert; // 0x70(0x04)
	float Dam_Town; // 0x74(0x04)
	float downtown; // 0x78(0x04)
	float Fulfillment_Center; // 0x7c(0x04)
	float Hill_Town; // 0x80(0x04)
	float Hydroelectric_Dam; // 0x84(0x04)
	float Little_City; // 0x88(0x04)
	float Lodge; // 0x8c(0x04)
	float Simple_Town; // 0x90(0x04)
	float Solar_Town; // 0x94(0x04)
	float Storage_Town; // 0x98(0x04)
	float Sunken_Town; // 0x9c(0x04)
	float swamp; // 0xa0(0x04)
	float Swamp_Town; // 0xa4(0x04)
	float Trailer_Town; // 0xa8(0x04)
	float Wind_Farms; // 0xac(0x04)
};

// ScriptStruct TslGame.*0ccaf00f7e
// Size: 0xb0 (Inherited: 0x60)
struct F*0ccaf00f7e : F*c9a266d962 {
	float AirField; // 0x60(0x04)
	float BanTai; // 0x64(0x04)
	float Bootcamp; // 0x68(0x04)
	float CampAlpha; // 0x6c(0x04)
	float CampBravo; // 0x70(0x04)
	float CampCharlie; // 0x74(0x04)
	float Cave; // 0x78(0x04)
	float Getaway; // 0x7c(0x04)
	float Hatinh; // 0x80(0x04)
	float Kampong; // 0x84(0x04)
	float Khao; // 0x88(0x04)
	float Lawaki; // 0x8c(0x04)
	float NaKham; // 0x90(0x04)
	float Painan; // 0x94(0x04)
	float ParadiseResort; // 0x98(0x04)
	float Quarry; // 0x9c(0x04)
	float Ruins; // 0xa0(0x04)
	float Sahmee; // 0xa4(0x04)
	float Tambang; // 0xa8(0x04)
	float Tatmok; // 0xac(0x04)
};

// ScriptStruct TslGame.*f8b9e75327
// Size: 0x78 (Inherited: 0x60)
struct F*f8b9e75327 : F*c9a266d962 {
	float AlHabar; // 0x60(0x04)
	float AlHayik; // 0x64(0x04)
	float Bahrsahir; // 0x68(0x04)
	float Bashara; // 0x6c(0x04)
	float Hadiqanemo; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.*51a49e905f
// Size: 0xa8 (Inherited: 0x60)
struct F*51a49e905f : F*c9a266d962 {
	float airport; // 0x60(0x04)
	float ArmyBase; // 0x64(0x04)
	float Buksansa; // 0x68(0x04)
	float FishingCamp; // 0x6c(0x04)
	float Godok; // 0x70(0x04)
	float Haemoosa; // 0x74(0x04)
	float Hapo; // 0x78(0x04)
	float Hosan; // 0x7c(0x04)
	float HosanPrison; // 0x80(0x04)
	float Kangneung; // 0x84(0x04)
	float Ohyang; // 0x88(0x04)
	float Palace; // 0x8c(0x04)
	float School; // 0x90(0x04)
	float ShipYard; // 0x94(0x04)
	float Songam; // 0x98(0x04)
	float Studio; // 0x9c(0x04)
	float Terminal; // 0xa0(0x04)
	float Wolsong; // 0xa4(0x04)
};

// ScriptStruct TslGame.*5561e37bc7
// Size: 0x18 (Inherited: 0x00)
struct F*5561e37bc7 {
	enum class *0ba1379a07 *9817f06681; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<enum class EGameModeType> *16680f18f2; // 0x08(0x10)
};

// ScriptStruct TslGame.*6c97232de9
// Size: 0x18 (Inherited: 0x00)
struct F*6c97232de9 {
	enum class *0ba1379a07 *9817f06681; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<enum class ETslMapName> *16680f18f2; // 0x08(0x10)
};

// ScriptStruct TslGame.*d3cd2a9f99
// Size: 0x20 (Inherited: 0x08)
struct F*d3cd2a9f99 : FTableRowBase {
	struct FText *8101c306c1; // 0x08(0x18)
};

// ScriptStruct TslGame.*03568aadc9
// Size: 0x30 (Inherited: 0x00)
struct F*03568aadc9 {
	bool bUseMateriaSlotIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<int32> MaterialSlotIndex; // 0x08(0x10)
	bool bUseMaterialSlotName; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct TArray<struct FName> MaterialSlotName; // 0x20(0x10)
};

// ScriptStruct TslGame.*41e5328d7e
// Size: 0x48 (Inherited: 0x00)
struct F*41e5328d7e {
	struct F*287e9e80c5 *287e9e80c5; // 0x00(0x40)
	struct UImage* *26104e742d; // 0x40(0x08)
};

// ScriptStruct TslGame.*287e9e80c5
// Size: 0x40 (Inherited: 0x00)
struct F*287e9e80c5 {
	struct FGuid IconGUID; // 0x00(0x10)
	struct FVector WorldLocation; // 0x10(0x0c)
	struct FRotator WorldRotation; // 0x1c(0x0c)
	enum class EAuxilaryIconType IconType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FLinearColor IconColor; // 0x2c(0x10)
	bool bIsVisible; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct TslGame.*e138804829
// Size: 0x60 (Inherited: 0x00)
struct F*e138804829 {
	struct FString *df70b5fc55; // 0x00(0x10)
	char pad_10[0x50]; // 0x10(0x50)
};

// ScriptStruct TslGame.*7f4f3c1b84
// Size: 0x20 (Inherited: 0x00)
struct F*7f4f3c1b84 {
	struct FString *a52e81a2ae; // 0x00(0x10)
	struct FString *f85ebb5f19; // 0x10(0x10)
};

// ScriptStruct TslGame.*ae691961f5
// Size: 0x28 (Inherited: 0x08)
struct F*ae691961f5 : FTableRowBase {
	enum class EAuxilaryIconType IconType; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct UTexture* IconTexture; // 0x10(0x08)
	struct UCurveFloat* IconRatioCurve; // 0x18(0x08)
	float MinimapIconRatio; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.*3a97ab595e
// Size: 0x28 (Inherited: 0x00)
struct F*3a97ab595e {
	float *5c5018d588; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FName *74add92bf5; // 0x08(0x08)
	bool bShowTrunkMesh; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct F*459008a02d> *dc9a113e86; // 0x18(0x10)
};

// ScriptStruct TslGame.*459008a02d
// Size: 0x28 (Inherited: 0x00)
struct F*459008a02d {
	struct UStaticMesh* TrunkMesh; // 0x00(0x20)
	float MinCapacityPercent; // 0x20(0x04)
	float MaxCapacityPercent; // 0x24(0x04)
};

// ScriptStruct TslGame.*dfc11fda10
// Size: 0x30 (Inherited: 0x00)
struct F*dfc11fda10 {
	struct F*de80d41fc7 Stand; // 0x00(0x10)
	struct F*de80d41fc7 Crouch; // 0x10(0x10)
	struct F*de80d41fc7 Prone; // 0x20(0x10)
};

// ScriptStruct TslGame.*de80d41fc7
// Size: 0x10 (Inherited: 0x00)
struct F*de80d41fc7 {
	float *a359f9c016; // 0x00(0x04)
	float *a7c947be63; // 0x04(0x04)
	float *3099fa8de8; // 0x08(0x04)
	float *f11825912d; // 0x0c(0x04)
};

// ScriptStruct TslGame.*efe293a553
// Size: 0x0c (Inherited: 0x00)
struct F*efe293a553 {
	struct FVector Acceleration; // 0x00(0x0c)
};

// ScriptStruct TslGame.*a23d8b2880
// Size: 0x20 (Inherited: 0x00)
struct F*a23d8b2880 {
	struct UBlendSpace1D* BlendSpaceFPP; // 0x00(0x08)
	struct UBlendSpace1D* BlendSpaceTPP; // 0x08(0x08)
	struct FInputBlendPose BlendSettings; // 0x10(0x10)
};

// ScriptStruct TslGame.*95c902bd31
// Size: 0x10 (Inherited: 0x00)
struct F*95c902bd31 {
	struct TArray<struct F*60fcea4427> IdleAnimations; // 0x00(0x10)
};

// ScriptStruct TslGame.*60fcea4427
// Size: 0x20 (Inherited: 0x00)
struct F*60fcea4427 {
	struct UAnimSequence* AnimAsset; // 0x00(0x08)
	struct FInt32Range LoopingCounter; // 0x08(0x10)
	float ChanceToPlay; // 0x18(0x04)
	float BlendTime; // 0x1c(0x04)
};

// ScriptStruct TslGame.*e699a1f799
// Size: 0x10 (Inherited: 0x00)
struct F*e699a1f799 {
	struct FName Name; // 0x00(0x08)
	bool bIsAxis; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float Scale; // 0x0c(0x04)
};

// ScriptStruct TslGame.*ffdf6ba277
// Size: 0x10 (Inherited: 0x00)
struct F*ffdf6ba277 {
	struct FName Name; // 0x00(0x08)
	float Scale; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*96d1bd944b
// Size: 0x10 (Inherited: 0x00)
struct F*96d1bd944b {
	bool bEnabled; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Health; // 0x04(0x04)
	int32 Count; // 0x08(0x04)
	bool bUseRandomizedWeaponKits; // 0x0c(0x01)
	bool bUseUniqueWeaponKits; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
};

// ScriptStruct TslGame.*fad260182f
// Size: 0x10 (Inherited: 0x00)
struct F*fad260182f {
	struct FName *8b1cb0eec8; // 0x00(0x08)
	int32 Count; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*936e33f99d
// Size: 0x20 (Inherited: 0x00)
struct F*936e33f99d {
	enum class EAutoSpectatePriority *fd93c5b3d6; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 TeamId; // 0x04(0x04)
	struct FString *8b0ba80f82; // 0x08(0x10)
	float *48be589c28; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*fa68a9816b
// Size: 0x50 (Inherited: 0x00)
struct F*fa68a9816b {
	enum class EObserverHudAnimType AnimType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 EliminatorTeamNum; // 0x04(0x04)
	int32 EliminatedTeamNum; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString KillingSpreePlayerName; // 0x10(0x10)
	struct FString KillingSpreeClanName; // 0x20(0x10)
	struct FString KillingSpreeTeamName; // 0x30(0x10)
	int32 KillingSpreeTeamNum; // 0x40(0x04)
	int32 KillingSpreeKillCount; // 0x44(0x04)
	enum class EOutGamePlatformProvider KillingSpreePlayerPlatform; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.*d7b5c1a08d
// Size: 0x18 (Inherited: 0x00)
struct F*d7b5c1a08d {
	struct FString UniqueId; // 0x00(0x10)
	bool *aaa01a7aa8; // 0x10(0x01)
	bool *f541fadab4; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
};

// ScriptStruct TslGame.CommunicateTargetInfo
// Size: 0x30 (Inherited: 0x00)
struct FCommunicateTargetInfo {
	struct FString UniqueId; // 0x00(0x10)
	struct FString Nickname; // 0x10(0x10)
	enum class EOutGamePlatformProvider PlatformData; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	struct FCommunicationPrivilege CommunicationPrivileges; // 0x24(0x08)
	bool bMyFollower; // 0x2c(0x01)
	bool bIAmFollowing; // 0x2d(0x01)
	char pad_2E[0x2]; // 0x2e(0x02)
};

// ScriptStruct TslGame.CommunicationPrivilege
// Size: 0x08 (Inherited: 0x00)
struct FCommunicationPrivilege {
	int32 CommunicationPrivilege_Multiplay; // 0x00(0x04)
	int32 CommunicationPrivilege_CrossPlay; // 0x04(0x04)
};

// ScriptStruct TslGame.*253125876b
// Size: 0x20 (Inherited: 0x00)
struct F*253125876b {
	struct FString Key; // 0x00(0x10)
	struct TArray<struct F*2ed6be00e5> Logs; // 0x10(0x10)
};

// ScriptStruct TslGame.*2ed6be00e5
// Size: 0x20 (Inherited: 0x00)
struct F*2ed6be00e5 {
	struct FString Key; // 0x00(0x10)
	struct FString Value; // 0x10(0x10)
};

// ScriptStruct TslGame.BodyTypeDef
// Size: 0x08 (Inherited: 0x00)
struct FBodyTypeDef {
	int32 *cf64ac5bf9; // 0x00(0x04)
	int32 *57ef3529c4; // 0x04(0x04)
};

// ScriptStruct TslGame.*6c277117e7
// Size: 0x98 (Inherited: 0x00)
struct F*6c277117e7 {
	struct FString PlayerName; // 0x00(0x10)
	uint32 *c256626027; // 0x10(0x04)
	int32 TeamId; // 0x14(0x04)
	bool *dbf4362644; // 0x18(0x01)
	bool Gender; // 0x19(0x01)
	bool *9041cc4a7e; // 0x1a(0x01)
	char pad_1B[0x5]; // 0x1b(0x05)
	struct TArray<int32> *3374be467a; // 0x20(0x10)
	struct TArray<int32> *e13ef45a5d; // 0x30(0x10)
	struct TArray<int32> *8d805fa25c; // 0x40(0x10)
	struct FString Emotes; // 0x50(0x10)
	struct FName *dffdc17db4; // 0x60(0x08)
	struct FName *eca5d808d1; // 0x68(0x08)
	float *f2deef4238; // 0x70(0x04)
	float *571d911630; // 0x74(0x04)
	float *86b6d3eedc; // 0x78(0x04)
	float *5f7b37fc1f; // 0x7c(0x04)
	bool *edca7ead11; // 0x80(0x01)
	bool *06282eed69; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
	struct FString *0c2460b991; // 0x88(0x10)
};

// ScriptStruct TslGame.*64bd5b8e3c
// Size: 0x10 (Inherited: 0x00)
struct F*64bd5b8e3c {
	struct FVector Location; // 0x00(0x0c)
	bool *2e65f3e4c7; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*be38327e5a
// Size: 0x10 (Inherited: 0x00)
struct F*be38327e5a {
	enum class EMatchStartType Type; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UClass* Class; // 0x08(0x08)
};

// ScriptStruct TslGame.*99af37cfd2
// Size: 0x08 (Inherited: 0x00)
struct F*99af37cfd2 {
	float *5e6f1d855d; // 0x00(0x04)
	float *7d414ffb3a; // 0x04(0x04)
};

// ScriptStruct TslGame.*39bc41466b
// Size: 0x24 (Inherited: 0x00)
struct F*39bc41466b {
	enum class EInventoryRadioMessageType *3b3a200ca2; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 *f2b252fb59; // 0x04(0x04)
	int32 *4d3980e4cd; // 0x08(0x04)
	bool *5ab98e8e1d; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	int32 *d1253d96b5; // 0x10(0x04)
	int32 *dfaaa56af1; // 0x14(0x04)
	struct FVector_NetQuantize *f03e2af66e; // 0x18(0x0c)
};

// ScriptStruct TslGame.*a435428157
// Size: 0x30 (Inherited: 0x00)
struct F*a435428157 {
	enum class ERadioMessageCategory Category; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FString> *9f0e4475c2; // 0x08(0x10)
	struct TArray<struct FText> *73be5e5b28; // 0x18(0x10)
	int32 *894f9d8abd; // 0x28(0x04)
	enum class ERadioMessageDecorateType *d7805e7d45; // 0x2c(0x01)
	enum class *5e8ae09c18 *f5ae3ab00e; // 0x2d(0x01)
	char pad_2E[0x2]; // 0x2e(0x02)
};

// ScriptStruct TslGame.*10dd376bf4
// Size: 0x38 (Inherited: 0x28)
struct F*10dd376bf4 : F*cea97541c6 {
	struct TArray<struct FName> SkinnableTagList; // 0x28(0x10)
};

// ScriptStruct TslGame.*cea97541c6
// Size: 0x28 (Inherited: 0x00)
struct F*cea97541c6 {
	struct FText ItemName; // 0x00(0x18)
	struct FString BlueprintId; // 0x18(0x10)
};

// ScriptStruct TslGame.*026a2f00be
// Size: 0x38 (Inherited: 0x28)
struct F*026a2f00be : F*cea97541c6 {
	enum class EWeaponClass WeaponClassEnum; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FName SkinTag; // 0x30(0x08)
};

// ScriptStruct TslGame.*dcf7a4b6c5
// Size: 0x10 (Inherited: 0x00)
struct F*dcf7a4b6c5 {
	struct FName ItemID; // 0x00(0x08)
	int32 Count; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.RankingInfo
// Size: 0x18 (Inherited: 0x00)
struct FRankingInfo {
	int32 TeamId; // 0x00(0x04)
	int32 *becd625c42; // 0x04(0x04)
	int32 *77aac6f8bc; // 0x08(0x04)
	int32 Score; // 0x0c(0x04)
	int32 Order; // 0x10(0x04)
	bool *86374961ef; // 0x14(0x01)
	bool *a56180b372; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
};

// ScriptStruct TslGame.*ab0db8ae6e
// Size: 0x08 (Inherited: 0x00)
struct F*ab0db8ae6e {
	struct FName ItemID; // 0x00(0x08)
};

// ScriptStruct TslGame.*618af039d3
// Size: 0x10 (Inherited: 0x00)
struct F*618af039d3 {
	struct FStringClassReference ObjectClass; // 0x00(0x10)
};

// ScriptStruct TslGame.*4d71bf335c
// Size: 0x10 (Inherited: 0x00)
struct F*4d71bf335c {
	struct UTexture* Texture; // 0x00(0x08)
	float Ratio; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*e1670ec576
// Size: 0x30 (Inherited: 0x00)
struct F*e1670ec576 {
	struct FKey Key; // 0x00(0x18)
	struct UTexture* KeyIcon; // 0x18(0x08)
	struct UTexture* KeyIcon_PS; // 0x20(0x08)
	float IconRatio; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*deb104646e
// Size: 0x08 (Inherited: 0x00)
struct F*deb104646e {
	int32 Width; // 0x00(0x04)
	int32 Height; // 0x04(0x04)
};

// ScriptStruct TslGame.*590643ec7b
// Size: 0x20 (Inherited: 0x00)
struct F*590643ec7b {
	struct FString ActorName; // 0x00(0x10)
	struct FVector *ad7c7b0865; // 0x10(0x0c)
	bool *de976ad248; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct TslGame.*1e7ccdbfad
// Size: 0x20 (Inherited: 0x00)
struct F*1e7ccdbfad {
	struct FString MapName; // 0x00(0x10)
	struct TArray<struct FSavedObPos> SavedObPos; // 0x10(0x10)
};

// ScriptStruct TslGame.SavedObPos
// Size: 0x18 (Inherited: 0x00)
struct FSavedObPos {
	struct FVector Loc; // 0x00(0x0c)
	struct FRotator Rot; // 0x0c(0x0c)
};

// ScriptStruct TslGame.*59ab729907
// Size: 0x58 (Inherited: 0x00)
struct F*59ab729907 {
	struct TArray<enum class EGameModeType> GameModeTypeList; // 0x00(0x10)
	struct FString WidgetName; // 0x10(0x10)
	bool bRemoveWidget; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct F*82ee1dd20b NewWidgetConfig; // 0x28(0x30)
};

// ScriptStruct TslGame.*82ee1dd20b
// Size: 0x30 (Inherited: 0x00)
struct F*82ee1dd20b {
	struct FStringAssetReference WidgetClassReference; // 0x00(0x10)
	bool bDefaultShow; // 0x10(0x01)
	bool bUseMouse; // 0x11(0x01)
	bool bCloseByEscape; // 0x12(0x01)
	bool bRemovedByHiding; // 0x13(0x01)
	int32 ZOrder; // 0x14(0x04)
	bool bUsePcOnly; // 0x18(0x01)
	bool bUseConsoleOnly; // 0x19(0x01)
	bool bCharacterHudUi; // 0x1a(0x01)
	bool bSpectatorHudUi; // 0x1b(0x01)
	bool bObserverHudUi; // 0x1c(0x01)
	bool bReplayHudUi; // 0x1d(0x01)
	bool bLeagueReplayHudUi; // 0x1e(0x01)
	enum class ETslWidgetCreationMethod WidgetCreationMethod; // 0x1f(0x01)
	struct TArray<struct FString> HideWidgetList; // 0x20(0x10)
};

// ScriptStruct TslGame.*178620b8f7
// Size: 0x20 (Inherited: 0x00)
struct F*178620b8f7 {
	struct FString WidgetName; // 0x00(0x10)
	struct TArray<struct F*b9cb30ddf7> AlternativeWidgets; // 0x10(0x10)
};

// ScriptStruct TslGame.*b9cb30ddf7
// Size: 0x30 (Inherited: 0x00)
struct F*b9cb30ddf7 {
	struct FName GameModeAlias; // 0x00(0x08)
	struct FStringAssetReference Reference; // 0x08(0x10)
	struct TArray<struct FString> HideWidgetList; // 0x18(0x10)
	int32 ZOrderOverride; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*bd9a0fa6db
// Size: 0x40 (Inherited: 0x00)
struct F*bd9a0fa6db {
	struct FString WidgetName; // 0x00(0x10)
	struct F*82ee1dd20b WidgetConfig; // 0x10(0x30)
};

// ScriptStruct TslGame.*8d49267a6c
// Size: 0x18 (Inherited: 0x00)
struct F*8d49267a6c {
	struct FString *3f3e09a301; // 0x00(0x10)
	int32 *67d0e8d2f0; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.TslUserProfile
// Size: 0x18 (Inherited: 0x00)
struct FTslUserProfile {
	struct FString PlayerNetId; // 0x00(0x10)
	float TotalPlayTime_Sec; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*aa67277a54
// Size: 0x0c (Inherited: 0x00)
struct F*aa67277a54 {
	char pad_0[0x8]; // 0x00(0x08)
	int32 Counter; // 0x08(0x04)
};

// ScriptStruct TslGame.*d18bc34a13
// Size: 0x08 (Inherited: 0x00)
struct F*d18bc34a13 {
	enum class EWeatherChange newWeather; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Weight; // 0x04(0x04)
};

// ScriptStruct TslGame.*3edd039128
// Size: 0x20 (Inherited: 0x00)
struct F*3edd039128 {
	enum class EMarketCategoryType *ea33bc6d80; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName ItemID; // 0x08(0x08)
	int32 *4d3980e4cd; // 0x10(0x04)
	int32 *fcb5ae03fb; // 0x14(0x04)
	int32 *cb74f90e8a; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.ChineseLicensingDefaultCustomizeData
// Size: 0x18 (Inherited: 0x00)
struct FChineseLicensingDefaultCustomizeData {
	struct FString CustomizableObjectGroupName; // 0x00(0x10)
	struct FName EquipableItemID; // 0x10(0x08)
};

// ScriptStruct TslGame.*3bfdd5777e
// Size: 0x14 (Inherited: 0x00)
struct F*3bfdd5777e {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 AircraftCount; // 0x04(0x04)
	float AircraftCooldown; // 0x08(0x04)
	int32 InvalidBeforePhase; // 0x0c(0x04)
	int32 InvalidAfterPhase; // 0x10(0x04)
};

// ScriptStruct TslGame.*8802a94b19
// Size: 0x24 (Inherited: 0x00)
struct F*8802a94b19 {
	int32 BlueZonePhase; // 0x00(0x04)
	float StartDelay; // 0x04(0x04)
	float WarningDuration; // 0x08(0x04)
	float ReleaseDuration; // 0x0c(0x04)
	float BlueZoneDamagePerSecond; // 0x10(0x04)
	float RadiusRate; // 0x14(0x04)
	float SpreadRatio; // 0x18(0x04)
	float LandRatio; // 0x1c(0x04)
	int32 CircleAlgorithm; // 0x20(0x04)
};

// ScriptStruct TslGame.*2dfc075850
// Size: 0x40 (Inherited: 0x00)
struct F*2dfc075850 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float PlayerNearBuildingMaxDamage; // 0x04(0x04)
	float PlayerNearBuildingMaxDistance; // 0x08(0x04)
	float StrikeInnerRadius; // 0x0c(0x04)
	float StrikeMidRadius; // 0x10(0x04)
	float StrikeOuterRadius; // 0x14(0x04)
	float StartDelay; // 0x18(0x04)
	float StandbyDelay; // 0x1c(0x04)
	float RequestedStandbyDelay; // 0x20(0x04)
	float BombingDelay; // 0x24(0x04)
	int32 MaxMidCount; // 0x28(0x04)
	int32 MaxFarCount; // 0x2c(0x04)
	int32 MinimumBuildingsToDestroy; // 0x30(0x04)
	struct FVector2D BombingInterval; // 0x34(0x08)
	bool bUseBlackZoneCurves; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct TslGame.*727f5bf857
// Size: 0x1c (Inherited: 0x00)
struct F*727f5bf857 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float MultiplierRedZoneExplosionDensity; // 0x04(0x04)
	float MultiplierRedZoneStartTime; // 0x08(0x04)
	float MultiplierRedZoneEndTime; // 0x0c(0x04)
	float MultiplierRedZoneExplosionDelay; // 0x10(0x04)
	float MultiplierRedZoneDuration; // 0x14(0x04)
	float MultiplierRedZoneArea; // 0x18(0x04)
};

// ScriptStruct TslGame.MatchLog
// Size: 0x60 (Inherited: 0x00)
struct FMatchLog {
	char pad_0[0x60]; // 0x00(0x60)
};

// ScriptStruct TslGame.*0bbc073461
// Size: 0x08 (Inherited: 0x00)
struct F*0bbc073461 {
	float *ba371edebf; // 0x00(0x04)
	float *fae58e17e6; // 0x04(0x04)
};

// ScriptStruct TslGame.*929c092d3c
// Size: 0x18 (Inherited: 0x00)
struct F*929c092d3c {
	float *79d963c9bd; // 0x00(0x04)
	float *680b093f1c; // 0x04(0x04)
	float *f78191ab0e; // 0x08(0x04)
	float *c41a96c91c; // 0x0c(0x04)
	float *1b4e295784; // 0x10(0x04)
	float *c0fa7d1c7f; // 0x14(0x04)
};

// ScriptStruct TslGame.*3b6d81ed12
// Size: 0x0c (Inherited: 0x00)
struct F*3b6d81ed12 {
	float *b5fc628d79; // 0x00(0x04)
	float BpBoost; // 0x04(0x04)
	float *327e8114ce; // 0x08(0x04)
};

// ScriptStruct TslGame.*262771960f
// Size: 0x10 (Inherited: 0x00)
struct F*262771960f {
	float SurvivalTimeStart; // 0x00(0x04)
	float TeamSpectatingTimeStart; // 0x04(0x04)
	float SurvivalTimeAccumulated; // 0x08(0x04)
	float TeamSpectatingTimeAccumulated; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslLobbyCustomizingData
// Size: 0x58 (Inherited: 0x00)
struct FTslLobbyCustomizingData {
	enum class ELobbyCustomizingSlotType LobbyCustomizingSlotType; // 0x00(0x01)
	bool SlotIndex; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct FTslLobbyItemViewData LobbyItemViewData; // 0x08(0x50)
};

// ScriptStruct TslGame.TslLobbyItemViewData
// Size: 0x50 (Inherited: 0x00)
struct FTslLobbyItemViewData {
	struct FString TargetItemId; // 0x00(0x10)
	struct FString SkinItemId; // 0x10(0x10)
	struct TArray<struct FString> PartIds; // 0x20(0x10)
	struct FString SequenceTag; // 0x30(0x10)
	float InitialScale; // 0x40(0x04)
	float ZoomMultiplier; // 0x44(0x04)
	float ViewModeScaleMin; // 0x48(0x04)
	float ViewModeScaleMax; // 0x4c(0x04)
};

// ScriptStruct TslGame.TslLobbyCharacterCreateType
// Size: 0x50 (Inherited: 0x00)
struct FTslLobbyCharacterCreateType {
	uint32 SlotIndex; // 0x00(0x04)
	bool IsGenderMale; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	struct FString NetId; // 0x08(0x10)
	struct FString Nickname; // 0x18(0x10)
	struct FString ClanTag; // 0x28(0x10)
	struct FString ClanplateId; // 0x38(0x10)
	enum class EOutGamePlatformProvider PlatformProvider; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.TslLobbyEmotePlaySetData
// Size: 0x38 (Inherited: 0x00)
struct FTslLobbyEmotePlaySetData {
	struct FName EmoteName; // 0x00(0x08)
	struct FName SectionName; // 0x08(0x08)
	struct FString PlayType; // 0x10(0x10)
	struct FString EmoteLeaderNetId; // 0x20(0x10)
	bool bIsEmoteFollower; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*82f1eb6e01
// Size: 0x58 (Inherited: 0x08)
struct F*82f1eb6e01 : FTableRowBase {
	struct TMap<struct FName, struct F*d251301b03> TargetStateData; // 0x08(0x50)
};

// ScriptStruct TslGame.*d251301b03
// Size: 0x20 (Inherited: 0x00)
struct F*d251301b03 {
	struct UAnimationAsset* StateAnimation; // 0x00(0x20)
};

// ScriptStruct TslGame.*c34bdb3f66
// Size: 0xa8 (Inherited: 0x00)
struct F*c34bdb3f66 {
	enum class ETslOutGameCloudRequestType *ca2e4557bc; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText *a22d303c6b; // 0x08(0x18)
	float *4ef1d3e807; // 0x20(0x04)
	float *e5a31d9b4d; // 0x24(0x04)
	struct FText *05fb36f243; // 0x28(0x18)
	struct FText *17dea2c423; // 0x40(0x18)
	struct TMap<enum class ETslOutGameCloudRequestErrorType, struct FText> *c2bbffee8e; // 0x58(0x50)
};

// ScriptStruct TslGame.*bb88c135c9
// Size: 0x10 (Inherited: 0x00)
struct F*bb88c135c9 {
	struct FName *a52ca85b02; // 0x00(0x08)
	bool bEnable; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct TslGame.*5c2f96c82d
// Size: 0x20 (Inherited: 0x00)
struct F*5c2f96c82d {
	struct FString AccountId; // 0x00(0x10)
	struct FString LoadingState; // 0x10(0x10)
};

// ScriptStruct TslGame.*a3af215e60
// Size: 0x18 (Inherited: 0x00)
struct F*a3af215e60 {
	struct FString AccountId; // 0x00(0x10)
	float *f53c56ad68; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.TslReportedInfo
// Size: 0x108 (Inherited: 0x00)
struct FTslReportedInfo {
	struct FString MatchId; // 0x00(0x10)
	struct FTslReportUserInfo UserInfo; // 0x10(0x70)
	struct FTslReporterInfo ReporterInfo; // 0x80(0x48)
	struct FString Cause; // 0xc8(0x10)
	struct TArray<struct FString> DetailCauseList; // 0xd8(0x10)
	struct FString ReportedSessionType; // 0xe8(0x10)
	float MatchElapsedTimeSec; // 0xf8(0x04)
	bool bIsKilledByReportedUser; // 0xfc(0x01)
	bool bIsDBNOedByReportedUser; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	float DamagedAmountByReportedUser; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.TslReporterInfo
// Size: 0x48 (Inherited: 0x00)
struct FTslReporterInfo {
	struct FString AccountId; // 0x00(0x10)
	struct FString PlayerName; // 0x10(0x10)
	int32 TeamId; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FString ClanId; // 0x28(0x10)
	struct FString ClanTag; // 0x38(0x10)
};

// ScriptStruct TslGame.*d29c86dd1e
// Size: 0x50 (Inherited: 0x00)
struct F*d29c86dd1e {
	struct FString PlayerName; // 0x00(0x10)
	struct FString FullPlayerName; // 0x10(0x10)
	struct FString ClanName; // 0x20(0x10)
	int32 NumKills; // 0x30(0x04)
	int32 NumAssists; // 0x34(0x04)
	int32 Ranking; // 0x38(0x04)
	int32 TeamId; // 0x3c(0x04)
	int32 NumStartTeamMember; // 0x40(0x04)
	float DamageDealtOnEnemy; // 0x44(0x04)
	bool bIsZombie; // 0x48(0x01)
	enum class EOutGamePlatformProvider PlayerPlatform; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct TslGame.*9860a0bfa9
// Size: 0x18 (Inherited: 0x00)
struct F*9860a0bfa9 {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*f6dbd938d9
// Size: 0x20 (Inherited: 0x00)
struct F*f6dbd938d9 {
	enum class EReportDetailCauseType ReportDetailCauseType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText Description; // 0x08(0x18)
};

// ScriptStruct TslGame.*a5f5a2f967
// Size: 0x10 (Inherited: 0x00)
struct F*a5f5a2f967 {
	int32 PlayerCount; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct ATslPlayerStart* PlayerStart; // 0x08(0x08)
};

// ScriptStruct TslGame.*09cc48dbc9
// Size: 0x0c (Inherited: 0x00)
struct F*09cc48dbc9 {
	int32 TeamId; // 0x00(0x04)
	int32 SquadIndex; // 0x04(0x04)
	int32 *1fb1ac278d; // 0x08(0x04)
};

// ScriptStruct TslGame.*3a97823070
// Size: 0x30 (Inherited: 0x00)
struct F*3a97823070 {
	struct ATslPlayerState* Commander; // 0x00(0x08)
	struct FMapMarker MapMarker; // 0x08(0x10)
	struct ATslPlatoonFireSupportController* *40056f9291; // 0x18(0x08)
	struct U*57f6883b89* *fbdc84a0f4; // 0x20(0x08)
	struct U*57f6883b89* *296d2c379f; // 0x28(0x08)
};

// ScriptStruct TslGame.*daedfb5a9f
// Size: 0x18 (Inherited: 0x00)
struct F*daedfb5a9f {
	int32 TeamNum; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct ATeam*> Members; // 0x08(0x10)
};

// ScriptStruct TslGame.*2f9a2ea036
// Size: 0x18 (Inherited: 0x00)
struct F*2f9a2ea036 {
	struct AActor* SpottedActor; // 0x00(0x08)
	float SpottedStartTime; // 0x08(0x04)
	float SpottedEndTime; // 0x0c(0x04)
	bool SpottedDuringThisCycle; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct TslGame.*29a6f55a4a
// Size: 0x14 (Inherited: 0x00)
struct F*29a6f55a4a {
	bool *1522c6fd41; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector *fc72485ffd; // 0x04(0x0c)
	bool *5efc445bf9; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.WorldMarker
// Size: 0x68 (Inherited: 0x00)
struct FWorldMarker {
	bool Show; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector_NetQuantize100 MarkerPosition; // 0x04(0x0c)
	struct FVector_NetQuantize100 MarkerOffset; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct AActor* TrackedActor; // 0x20(0x08)
	enum class EMarkerType MarkerType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float MarkerCreationTime; // 0x2c(0x04)
	float MarkerLifetime; // 0x30(0x04)
	struct FGuid MarkerID; // 0x34(0x10)
	struct FLinearColor MarkerColor; // 0x44(0x10)
	bool bUseSquadColor; // 0x54(0x01)
	bool bIsPassiveMarker; // 0x55(0x01)
	int8 *f4d8a13009; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct TArray<int8> *ad18af7c2c; // 0x58(0x10)
};

// ScriptStruct TslGame.*3becc4ec9b
// Size: 0x20 (Inherited: 0x00)
struct F*3becc4ec9b {
	struct AActor* SpottedActor; // 0x00(0x08)
	float SpottingTime; // 0x08(0x04)
	struct FGuid MarkerID; // 0x0c(0x10)
	int8 *f4d8a13009; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct TslGame.*439094fc13
// Size: 0x08 (Inherited: 0x00)
struct F*439094fc13 {
	float Z; // 0x00(0x04)
	enum class ENearClippingLevel Level; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct TslGame.*6ebb74f736
// Size: 0x08 (Inherited: 0x00)
struct F*6ebb74f736 {
	enum class ENearClippingLevel Level; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Value; // 0x04(0x04)
};

// ScriptStruct TslGame.LevelLoadingBoostParameters
// Size: 0x10 (Inherited: 0x00)
struct FLevelLoadingBoostParameters {
	float AsyncLoadingTimeLimit; // 0x00(0x04)
	float PriorityAsyncLoadingExtraTime; // 0x04(0x04)
	float LevelStreamingActorsUpdateTimeLimit; // 0x08(0x04)
	int32 LevelStreamingComponentsRegistrationGranularity; // 0x0c(0x04)
};

// ScriptStruct TslGame.*7a1322e5ac
// Size: 0xa8 (Inherited: 0x00)
struct F*7a1322e5ac {
	float BlurLevel; // 0x00(0x04)
	float ScopeRadiusNear; // 0x04(0x04)
	float ScopeRadiusFar; // 0x08(0x04)
	struct FVector2D ReticleRect; // 0x0c(0x08)
	float ReticleAngularSize; // 0x14(0x04)
	struct FLinearColor ReticleTint; // 0x18(0x10)
	float ReticleGamma; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UTexture* ReticleTexture; // 0x30(0x08)
	bool bReticleExtendTextureBorder; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct U*a49e4e15f4* ReticleSettings; // 0x40(0x08)
	float ScopeLensDistortion; // 0x48(0x04)
	float ScopeLensCA; // 0x4c(0x04)
	struct FLinearColor ScopeLensTint; // 0x50(0x10)
	float ScopeOuterBrightness; // 0x60(0x04)
	float DepthBlurPower; // 0x64(0x04)
	float DepthBlurWhitePoint; // 0x68(0x04)
	float DepthBlurBlackPoint; // 0x6c(0x04)
	struct FVector2D RelativeOffsetMap; // 0x70(0x08)
	float ParallaxMovementScale; // 0x78(0x04)
	float ParallaxRadiusScale; // 0x7c(0x04)
	float BloomIntensity; // 0x80(0x04)
	float NearClipStaticOffset; // 0x84(0x04)
	float NearClipMinClamp; // 0x88(0x04)
	struct FVector WeaponCycleCameraOffset; // 0x8c(0x0c)
	struct FReticleBrightSceneVisibility BrightSceneVisibility; // 0x98(0x0c)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.ReticleBrightSceneVisibility
// Size: 0x0c (Inherited: 0x00)
struct FReticleBrightSceneVisibility {
	float LuminanceMultiplier; // 0x00(0x04)
	float OpacityMultiplier; // 0x04(0x04)
	float OpacityMultiplierLowResolution; // 0x08(0x04)
};

// ScriptStruct TslGame.*0b626baaa9
// Size: 0x280 (Inherited: 0x00)
struct F*0b626baaa9 {
	struct FName WeaponTag; // 0x00(0x08)
	struct UStaticMesh* AttachmentMeshAsset; // 0x08(0x20)
	struct FWeaponAttachmentData AttachmentData; // 0x28(0x250)
	struct UClass* AttachmentTemplate; // 0x278(0x08)
};

// ScriptStruct TslGame.WeaponAttachmentData
// Size: 0x250 (Inherited: 0x00)
struct FWeaponAttachmentData {
	enum class EWeaponAttachmentSlotID AttachmentSlotID; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName AttachmentTag; // 0x08(0x08)
	struct FName Name; // 0x10(0x08)
	struct FName MouseSensitiveName; // 0x18(0x08)
	float MagnificationFOVMaxIncrement; // 0x20(0x04)
	int32 MagnificationFOVSteps; // 0x24(0x04)
	float MagnificationFOV; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct F*c6ee9e4aff ReticleBrightnessConfig; // 0x30(0x20)
	struct TArray<float> *fd25717a01; // 0x50(0x10)
	struct TMap<struct FName, struct UMaterialInstance*> *e93e294255; // 0x60(0x50)
	struct TMap<struct FName, struct U*a49e4e15f4*> *28b4e8634d; // 0xb0(0x50)
	struct U*7a7b9ffde9* *8f75106b1b; // 0x100(0x08)
	int32 AmmoPerClip; // 0x108(0x04)
	float ReloadAnimationPlayRate; // 0x10c(0x04)
	float MultipleFiringBulletsSpread; // 0x110(0x04)
	float RecoilMultiplierHorizontal; // 0x114(0x04)
	float RecoilMultiplierVertical; // 0x118(0x04)
	float RecoilRecoveryMultiplier; // 0x11c(0x04)
	float SwayMultiplier; // 0x120(0x04)
	float AnimationKickMultiplier; // 0x124(0x04)
	float DeviationMultiplier; // 0x128(0x04)
	float ADSSpeedMultiplier; // 0x12c(0x04)
	struct FVector FPPSocketOffset; // 0x130(0x0c)
	int32 GripType_MN; // 0x13c(0x04)
	float BarrelLengthAdditive; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct UParticleSystem* MuzzleFx; // 0x148(0x08)
	struct FName MuzzleAttachPoint; // 0x150(0x08)
	enum class *7db39c4871 WeaponGripLeft; // 0x158(0x01)
	bool bIsSuppressor; // 0x159(0x01)
	char pad_15A[0x6]; // 0x15a(0x06)
	struct FStringAssetReference MuzzleSound; // 0x160(0x10)
	struct UAnimMontage* CharacterReloadTactical; // 0x170(0x08)
	struct UAnimMontage* WeaponReloadTactical; // 0x178(0x08)
	struct UAnimMontage* CharacterReloadCharge; // 0x180(0x08)
	struct UAnimMontage* WeaponReloadCharge; // 0x188(0x08)
	bool bUsePelletGridOverride; // 0x190(0x01)
	char pad_191[0x7]; // 0x191(0x07)
	struct TMap<int32, struct FVector2D> *63c3a5c7ab; // 0x198(0x50)
	float StabilitySpeedScalar; // 0x1e8(0x04)
	float StabilityMinForceAdditive; // 0x1ec(0x04)
	float RecoilEarlyExitScale; // 0x1f0(0x04)
	float CantedWeaponRotation; // 0x1f4(0x04)
	bool bUseReticleTypeOverride; // 0x1f8(0x01)
	bool bUseDefaultReticleCaching; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)
	struct TArray<struct F*4f3805c4e2> ReticleTextureDataArray; // 0x200(0x10)
	struct F*bf58d15687 ScopeGlintConfig; // 0x210(0x3c)
	bool bThermalTemperatureInteractive; // 0x24c(0x01)
	bool bBlocksGameplayTracers; // 0x24d(0x01)
	char pad_24E[0x2]; // 0x24e(0x02)
};

// ScriptStruct TslGame.*bf58d15687
// Size: 0x3c (Inherited: 0x00)
struct F*bf58d15687 {
	bool GlintEnabled; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D GlintStartFade; // 0x04(0x08)
	struct FVector ScopeEndPositionLS; // 0x0c(0x0c)
	float ScopeRadiusLS; // 0x18(0x04)
	float GlintRadiusScreen; // 0x1c(0x04)
	float ScopeRadiusScreen; // 0x20(0x04)
	struct FLinearColor GlintColor; // 0x24(0x10)
	struct FVector2D GlintVisibilityArcLength; // 0x34(0x08)
};

// ScriptStruct TslGame.*4f3805c4e2
// Size: 0x48 (Inherited: 0x00)
struct F*4f3805c4e2 {
	float ReticleAngularSize; // 0x00(0x04)
	struct FVector2D ReticleCenter; // 0x04(0x08)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UTexture2D* ReticleTexture; // 0x10(0x08)
	struct UTexture2D* ReticleDeactivatedTexture; // 0x18(0x08)
	bool bUseHaloTexture; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float HaloTextureScale; // 0x24(0x04)
	struct FVector ReticleColor; // 0x28(0x0c)
	float ReticleScale; // 0x34(0x04)
	float BrightSceneLuminanceMultiplier; // 0x38(0x04)
	float BrightSceneOpacityMultiplier; // 0x3c(0x04)
	float BrightSceneOpacityMultiplierLowResolution; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// ScriptStruct TslGame.*c6ee9e4aff
// Size: 0x20 (Inherited: 0x00)
struct F*c6ee9e4aff {
	struct U*e6746d9844* ReticleBrightnessSettingsCurve; // 0x00(0x08)
	struct FName ReticleBrightnessParamX; // 0x08(0x08)
	struct FName ReticleBrightnessParamY; // 0x10(0x08)
	struct FName ReticleBrightnessParamZ; // 0x18(0x08)
};

// ScriptStruct TslGame.*3626b7c685
// Size: 0x28 (Inherited: 0x00)
struct F*3626b7c685 {
	enum class EWeaponAttachmentSlotID Slot; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FName> *29dbb48b7d; // 0x08(0x10)
	struct TArray<struct FName> *0b54a601d5; // 0x18(0x10)
};

// ScriptStruct TslGame.*d161af1057
// Size: 0x20 (Inherited: 0x00)
struct F*d161af1057 {
	enum class EWeaponAttachmentSlotID *bc7294b32c; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName *836e77781a; // 0x08(0x08)
	struct TArray<struct F*04e7f404a0> *7661024acf; // 0x10(0x10)
};

// ScriptStruct TslGame.*04e7f404a0
// Size: 0x10 (Inherited: 0x00)
struct F*04e7f404a0 {
	struct FName *38bfab5fce; // 0x00(0x08)
	struct FName *836e77781a; // 0x08(0x08)
};

// ScriptStruct TslGame.*59be4d852f
// Size: 0x18 (Inherited: 0x00)
struct F*59be4d852f {
	enum class EWeaponAttachmentSlotID *bc7294b32c; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FName> *12171502ae; // 0x08(0x10)
};

// ScriptStruct TslGame.*d7adaba609
// Size: 0x03 (Inherited: 0x00)
struct F*d7adaba609 {
	char pad_0[0x3]; // 0x00(0x03)
};

// ScriptStruct TslGame.*40ead7aa89
// Size: 0x0c (Inherited: 0x00)
struct F*40ead7aa89 {
	bool bRandomSpawn; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float RandomSpawnRadius; // 0x04(0x04)
	float *60b0fea150; // 0x08(0x04)
};

// ScriptStruct TslGame.*60e463d75c
// Size: 0x18 (Inherited: 0x00)
struct F*60e463d75c {
	int32 *19bd6d0ffb; // 0x00(0x04)
	int32 *6fe7752542; // 0x04(0x04)
	struct ADroppedItem* *5a78818b4b; // 0x08(0x08)
	enum class EEquipSlotID *e06c1a9445; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct TslGame.*3ddaf8ca9d
// Size: 0x10 (Inherited: 0x00)
struct F*3ddaf8ca9d {
	struct FName *9ae2be76d9; // 0x00(0x08)
	int32 *0a9d62a165; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*7267be4da7
// Size: 0x10 (Inherited: 0x00)
struct F*7267be4da7 {
	enum class EConstraintSlotType ConstraintSlotType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct F*24bac48d17 EquipPosition; // 0x04(0x08)
	enum class EEquipableItemSoundType OverrideSoundType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*24bac48d17
// Size: 0x08 (Inherited: 0x00)
struct F*24bac48d17 {
	enum class EEquipSlotID SlotID; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 Index; // 0x04(0x04)
};

// ScriptStruct TslGame.*820862ae7b
// Size: 0x48 (Inherited: 0x00)
struct F*820862ae7b {
	struct FRotator *ca286a93c3; // 0x00(0x0c)
	struct FVector Location; // 0x0c(0x0c)
	struct FVector Direction; // 0x18(0x0c)
	char pad_24[0x4]; // 0x24(0x04)
	struct U*af5a42646d* ThrowableConfig; // 0x28(0x08)
	int32 *775b07bc03; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct ATslCharacter* *8adb367d60; // 0x38(0x08)
	struct UPrimitiveComponent* *6fe1f23690; // 0x40(0x08)
};

// ScriptStruct TslGame.*6dd1517f1e
// Size: 0x190 (Inherited: 0x00)
struct F*6dd1517f1e {
	struct TMap<struct UClass*, struct F*77717018cc> SlotOffset_Primary_PerWeapon; // 0x00(0x50)
	struct TMap<struct UClass*, struct F*77717018cc> SlotOffset_Secondary_PerWeapon; // 0x50(0x50)
	struct TMap<struct UClass*, struct F*77717018cc> SlotOffset_SideArm_PerWeapon; // 0xa0(0x50)
	struct TMap<struct UClass*, struct F*77717018cc> SlotOffset_Melee_PerWeapon; // 0xf0(0x50)
	struct TMap<struct UClass*, struct F*77717018cc> SlotOffset_Thrown_PerWeapon; // 0x140(0x50)
};

// ScriptStruct TslGame.*77717018cc
// Size: 0x18 (Inherited: 0x00)
struct F*77717018cc {
	struct FVector Location; // 0x00(0x0c)
	struct FRotator Rotation; // 0x0c(0x0c)
};

// ScriptStruct TslGame.*89db77e830
// Size: 0x78 (Inherited: 0x00)
struct F*89db77e830 {
	struct FVector SlotOffset_Primary_Location; // 0x00(0x0c)
	struct FVector SlotOffset_Secondary_Location; // 0x0c(0x0c)
	struct FVector SlotOffset_SideArm_Location; // 0x18(0x0c)
	struct FVector SlotOffset_Melee_Location; // 0x24(0x0c)
	struct FVector SlotOffset_Thrown_Location; // 0x30(0x0c)
	struct FRotator SlotOffset_Primary_Rotation; // 0x3c(0x0c)
	struct FRotator SlotOffset_Secondary_Rotation; // 0x48(0x0c)
	struct FRotator SlotOffset_SideArm_Rotation; // 0x54(0x0c)
	struct FRotator SlotOffset_Melee_Rotation; // 0x60(0x0c)
	struct FRotator SlotOffset_Thrown_Rotation; // 0x6c(0x0c)
};

// ScriptStruct TslGame.*2fcd9646f5
// Size: 0x08 (Inherited: 0x08)
struct F*2fcd9646f5 : FTableRowBase {
};

// ScriptStruct TslGame.*a0fce5c1ed
// Size: 0xd8 (Inherited: 0x00)
struct F*a0fce5c1ed {
	enum class ECastAnim CastAnim; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float CastAnimPlayRate; // 0x04(0x04)
	struct F*4c56244188 CustomCastAnim; // 0x08(0xc0)
	float CustomCastTimeRemaining; // 0xc8(0x04)
	bool IsPermanentCasting; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
	float CastBlendingTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct TslGame.*4ff04ed0c9
// Size: 0xb8 (Inherited: 0xb0)
struct F*4ff04ed0c9 : F*4d95d8c4cd {
	bool *ffc6ef9760; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
};

// ScriptStruct TslGame.*4ea696bc3f
// Size: 0x08 (Inherited: 0x00)
struct F*4ea696bc3f {
	float *b0263c125e; // 0x00(0x04)
	enum class EDamageVictimActorType *decdf3dbed; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct TslGame.*59c601d8c3
// Size: 0x140 (Inherited: 0x00)
struct F*59c601d8c3 {
	struct UClass* Explosion; // 0x00(0x08)
	float DamagedPercentMax; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UClass* Damaged; // 0x10(0x08)
	struct UClass* Destroyed; // 0x18(0x08)
	struct UAkAudioEvent* EngineSound; // 0x20(0x08)
	struct UAkAudioEvent* EngineSound_Remote; // 0x28(0x08)
	struct UAkAudioEvent* EngineSound_Stop; // 0x30(0x08)
	struct UAkAudioEvent* DelayedExplosion; // 0x38(0x08)
	struct UClass* Muffler; // 0x40(0x08)
	struct UClass* Muffler2; // 0x48(0x08)
	struct UClass* Muffler3; // 0x50(0x08)
	struct UClass* Muffler4; // 0x58(0x08)
	struct UClass* Boost; // 0x60(0x08)
	struct UClass* Boost2; // 0x68(0x08)
	struct UClass* Boost3; // 0x70(0x08)
	struct UClass* Boost4; // 0x78(0x08)
	struct UClass* FrontTrail; // 0x80(0x08)
	struct UClass* RearTrail; // 0x88(0x08)
	struct UClass* Thruster; // 0x90(0x08)
	struct UClass* Thruster2; // 0x98(0x08)
	struct UClass* FrontFoamLeft; // 0xa0(0x08)
	struct UClass* FrontFoamRight; // 0xa8(0x08)
	struct UClass* SpashEffectOverride; // 0xb0(0x08)
	struct UStaticMesh* Rotor; // 0xb8(0x08)
	struct UStaticMesh* RotorDamaged; // 0xc0(0x08)
	struct UClass* ExhaustPopEffect; // 0xc8(0x08)
	struct FFloatRange ImpactNormalForceRange; // 0xd0(0x10)
	struct UClass* ImpactDefault; // 0xe0(0x08)
	int32 MaxImpactCount; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct TMap<enum class EPhysicalSurface, struct UClass*> ImpactEffectMap; // 0xf0(0x50)
};

// ScriptStruct TslGame.*3bf522d80d
// Size: 0x10 (Inherited: 0x00)
struct F*3bf522d80d {
	struct UAkAudioEvent* *8c521074ff; // 0x00(0x08)
	struct UAkAudioEvent* *bcadfdeed4; // 0x08(0x08)
};

// ScriptStruct TslGame.*4b9f5f68c7
// Size: 0x10 (Inherited: 0x08)
struct F*4b9f5f68c7 : FTableRowBase {
	struct FName *9ae2be76d9; // 0x08(0x08)
};

// ScriptStruct TslGame.*80dbc56bd3
// Size: 0x70 (Inherited: 0x00)
struct F*80dbc56bd3 {
	struct ATslPlayerState* *876e70f1b9; // 0x00(0x08)
	struct UClass* *3c8f29dc55; // 0x08(0x08)
	struct F*5df1f08743 *5df1f08743; // 0x10(0x20)
	struct FDateTime *c99b79808a; // 0x30(0x08)
	enum class EDamageReason *82e8a1cde7; // 0x38(0x01)
	enum class EDamageTypeCategory *584bfa83db; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct FName *f8a79d16d1; // 0x40(0x08)
	struct TArray<struct FString> *0e43faf481; // 0x48(0x10)
	float Distance; // 0x58(0x04)
	bool *2fbe1be488; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct TArray<struct ATslPlayerState*> *9befb95a24; // 0x60(0x10)
};

// ScriptStruct TslGame.*5df1f08743
// Size: 0x20 (Inherited: 0x00)
struct F*5df1f08743 {
	struct FName *9ae2be76d9; // 0x00(0x08)
	struct F*b4789e7d53 SkinParam; // 0x08(0x10)
	int32 *0a9d62a165; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*a5618266bf
// Size: 0x120 (Inherited: 0xf8)
struct F*a5618266bf : F*f3d100eb4d {
	struct FStringClassReference ReplaceVehicle; // 0xf8(0x10)
	enum class EVehicleSkinCategory VehicleSkinCategory; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct TArray<struct F*2f2ff84eaf> DefaultPartSkinList; // 0x110(0x10)
};

// ScriptStruct TslGame.*f3d100eb4d
// Size: 0xf8 (Inherited: 0x08)
struct F*f3d100eb4d : FTableRowBase {
	struct TMap<struct FName, struct F*1db19e2d61> SkinnedMeshSet; // 0x08(0x50)
	struct TMap<struct FName, struct F*47c95874b8> SkinnedMaterialSet; // 0x58(0x50)
	struct TArray<struct FName> SkinnableTagList; // 0xa8(0x10)
	struct FRotator DefaultViewModeRotation; // 0xb8(0x0c)
	struct FRotator PivotModifierRotation; // 0xc4(0x0c)
	struct FVector PCViewModeLocation; // 0xd0(0x0c)
	struct FVector ConsoleViewModeLocation; // 0xdc(0x0c)
	struct FVector RecommendArrowOffset; // 0xe8(0x0c)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.*1db19e2d61
// Size: 0x28 (Inherited: 0x00)
struct F*1db19e2d61 {
	enum class ESkinMeshType MeshType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UObject* MeshAsset; // 0x08(0x20)
};

// ScriptStruct TslGame.*2f2ff84eaf
// Size: 0x10 (Inherited: 0x00)
struct F*2f2ff84eaf {
	enum class EVehiclePartType *61f213e32c; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName *ee9615257c; // 0x08(0x08)
};

// ScriptStruct TslGame.*3e192d2a32
// Size: 0x178 (Inherited: 0x178)
struct F*3e192d2a32 : F*18a9a230b1 {
};

// ScriptStruct TslGame.*18a9a230b1
// Size: 0x178 (Inherited: 0xf8)
struct F*18a9a230b1 : F*f3d100eb4d {
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForMale; // 0xf8(0x30)
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForFemale; // 0x128(0x30)
	struct F*b808435aa2 CustomizableObjectSkin; // 0x158(0x20)
};

// ScriptStruct TslGame.*338f096123
// Size: 0x178 (Inherited: 0x178)
struct F*338f096123 : F*18a9a230b1 {
};

// ScriptStruct TslGame.*0dd1dadafe
// Size: 0x178 (Inherited: 0x178)
struct F*0dd1dadafe : F*18a9a230b1 {
};

// ScriptStruct TslGame.*8830ec5d91
// Size: 0x178 (Inherited: 0x178)
struct F*8830ec5d91 : F*18a9a230b1 {
};

// ScriptStruct TslGame.*54d0a4b187
// Size: 0x170 (Inherited: 0x170)
struct F*54d0a4b187 : F*502151249e {
};

// ScriptStruct TslGame.*502151249e
// Size: 0x170 (Inherited: 0xf8)
struct F*502151249e : F*f3d100eb4d {
	char bStatTrak : 1; // 0xf8(0x01)
	char pad_F8_1 : 7; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
	struct FStringAssetReference StatTrakActorClass; // 0x100(0x10)
	struct UAnimMontage* *e3fecd90fc; // 0x110(0x08)
	struct FName *18a5195fa1; // 0x118(0x08)
	struct TMap<struct FName, struct FLinearColor> SkinnedColorSet; // 0x120(0x50)
};

// ScriptStruct TslGame.*10f674495a
// Size: 0x148 (Inherited: 0x08)
struct F*10f674495a : FTableRowBase {
	struct UTexture2D* *5f416ae87e; // 0x08(0x20)
	struct UTexture2D* *7f6fb2acef; // 0x28(0x20)
	struct UTexture2D* *7a8af35217; // 0x48(0x20)
	struct UTexture2D* *2524281117; // 0x68(0x20)
	struct FName *3b1d5e14db; // 0x88(0x08)
	struct FSlateColor *d5b3e888c4; // 0x90(0x28)
	struct FSlateColor *477a60c760; // 0xb8(0x28)
	struct UMaterial* *1a2e08ed6a; // 0xe0(0x20)
	struct UTexture2D* *5f8518f21e; // 0x100(0x20)
	struct UTexture2D* *b9007bd91b; // 0x120(0x20)
	int32 *15c2cc4342; // 0x140(0x04)
	int32 *c160025bf5; // 0x144(0x04)
};

// ScriptStruct TslGame.*4bf2d1acef
// Size: 0x170 (Inherited: 0x170)
struct F*4bf2d1acef : F*502151249e {
};

// ScriptStruct TslGame.*07b65d379d
// Size: 0x08 (Inherited: 0x00)
struct F*07b65d379d {
	struct USkeletalMesh* SkeletalMesh; // 0x00(0x08)
};

// ScriptStruct TslGame.*18ba838f8a
// Size: 0x10 (Inherited: 0x00)
struct F*18ba838f8a {
	struct FName TargetName; // 0x00(0x08)
	struct UMeshComponent* TargetMesh; // 0x08(0x08)
};

// ScriptStruct TslGame.WuLogDestructLandscape
// Size: 0x128 (Inherited: 0x60)
struct FWuLogDestructLandscape : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FString CauserName; // 0x100(0x10)
	struct FVector Location; // 0x110(0x0c)
	float Radius; // 0x11c(0x04)
	float Depth; // 0x120(0x04)
	float Damage; // 0x124(0x04)
};

// ScriptStruct TslGame.WuLogCharacter
// Size: 0xa0 (Inherited: 0x00)
struct FWuLogCharacter {
	struct FString Name; // 0x00(0x10)
	struct FString NetId; // 0x10(0x10)
	int32 TeamId; // 0x20(0x04)
	float Health; // 0x24(0x04)
	struct FVector Location; // 0x28(0x0c)
	int32 Ranking; // 0x34(0x04)
	int32 IndividualRanking; // 0x38(0x04)
	int32 Platform; // 0x3c(0x04)
	struct FString AccountId; // 0x40(0x10)
	bool IsInBlueZone; // 0x50(0x01)
	bool IsInRedZone; // 0x51(0x01)
	char pad_52[0x6]; // 0x52(0x06)
	struct TArray<struct FString> Zone; // 0x58(0x10)
	struct FString MovementBase; // 0x68(0x10)
	bool IsAI; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FString ParticipatedState; // 0x80(0x10)
	struct FString Type; // 0x90(0x10)
};

// ScriptStruct TslGame.WuLogUseMarketCategory
// Size: 0x138 (Inherited: 0x60)
struct FWuLogUseMarketCategory : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FString MarketLevel; // 0x100(0x10)
	struct FString MarketCategory; // 0x110(0x10)
	struct FString ItemID; // 0x120(0x10)
	int32 ItemCount; // 0x130(0x04)
	int32 BRCoinCount; // 0x134(0x04)
};

// ScriptStruct TslGame.WuLogUseMarket
// Size: 0x110 (Inherited: 0x60)
struct FWuLogUseMarket : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FString MarketLevel; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogSubAircraftAppearance
// Size: 0x68 (Inherited: 0x60)
struct FWuLogSubAircraftAppearance : FLogBase {
	bool SubAircraftCreated; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float SubAircraftProbability; // 0x64(0x04)
};

// ScriptStruct TslGame.WuLogDropStructPositions
// Size: 0x90 (Inherited: 0x60)
struct FWuLogDropStructPositions : FLogBase {
	struct TArray<struct FString> DropStructNames; // 0x60(0x10)
	struct TArray<float> DropStructCreationTime; // 0x70(0x10)
	struct TArray<struct FVector> DropStructPositions; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogStructFlarePos
// Size: 0x80 (Inherited: 0x60)
struct FWuLogStructFlarePos : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FVector Location; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogIngameMissionReplacementInfo
// Size: 0x120 (Inherited: 0x60)
struct FWuLogIngameMissionReplacementInfo : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FString PreviousMissionId; // 0x100(0x10)
	struct FString ReplacedMissionId; // 0x110(0x10)
};

// ScriptStruct TslGame.WuLogIngameMissionStatistic
// Size: 0xa0 (Inherited: 0x60)
struct FWuLogIngameMissionStatistic : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString MapName; // 0x70(0x10)
	struct FString ModeName; // 0x80(0x10)
	struct TArray<struct FWuLogIngameMissionProgress> MissionStatistics; // 0x90(0x10)
};

// ScriptStruct TslGame.WuLogIngameMissionProgress
// Size: 0xb0 (Inherited: 0x00)
struct FWuLogIngameMissionProgress {
	struct FWuLogCharacter Character; // 0x00(0xa0)
	struct TArray<struct FWuLogIngameMissionInfo> Missions; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuLogIngameMissionInfo
// Size: 0x30 (Inherited: 0x00)
struct FWuLogIngameMissionInfo {
	struct FString MissionId; // 0x00(0x10)
	struct FString RewardId; // 0x10(0x10)
	int32 Progress; // 0x20(0x04)
	int32 Goal; // 0x24(0x04)
	bool Result; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// ScriptStruct TslGame.WuLogAliveCharacterNum
// Size: 0x90 (Inherited: 0x60)
struct FWuLogAliveCharacterNum : FLogBase {
	int32 AliveAINum; // 0x60(0x04)
	int32 AliveAITeamNum; // 0x64(0x04)
	int32 AlivePlayerNum; // 0x68(0x04)
	int32 AlivePlayerTeamNum; // 0x6c(0x04)
	struct TArray<struct FString> VictimCharacterAccountId; // 0x70(0x10)
	struct TArray<struct FString> ReviveOrRespawnCharacterAccountId; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogPlayerCureDebuff
// Size: 0x1b0 (Inherited: 0x60)
struct FWuLogPlayerCureDebuff : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FWuLogCharacter TargetCharacter; // 0x100(0xa0)
	struct FString DebuffName; // 0x1a0(0x10)
};

// ScriptStruct TslGame.WuLogPlayerHungryStage
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerHungryStage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	int32 PreviousStage; // 0x100(0x04)
	int32 CurrentStage; // 0x104(0x04)
	struct FString DebuffName; // 0x108(0x10)
};

// ScriptStruct TslGame.WuLogSLBItemTransmit
// Size: 0x110 (Inherited: 0x60)
struct FWuLogSLBItemTransmit : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct TArray<struct FWuLogItem> TransmitedItem; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogItem
// Size: 0x50 (Inherited: 0x00)
struct FWuLogItem {
	struct FString ItemID; // 0x00(0x10)
	int32 StackCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString Category; // 0x18(0x10)
	struct FString SubCategory; // 0x28(0x10)
	struct TArray<struct FString> AttachedItems; // 0x38(0x10)
	bool HasRandomAttachments; // 0x48(0x01)
	bool IsUnique; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct TslGame.WuLogSLBItemReward
// Size: 0x110 (Inherited: 0x60)
struct FWuLogSLBItemReward : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct TArray<struct FWuLogItem> Item; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogSLBClearResult
// Size: 0x90 (Inherited: 0x60)
struct FWuLogSLBClearResult : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 Stage; // 0x70(0x04)
	bool Clear; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FString Reason; // 0x78(0x10)
	int32 PlayTime; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// ScriptStruct TslGame.WuLogSLBStartStage
// Size: 0x68 (Inherited: 0x60)
struct FWuLogSLBStartStage : FLogBase {
	int32 Stage; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerDefuse
// Size: 0x118 (Inherited: 0x60)
struct FWuLogBombPlayerDefuse : FLogBase {
	struct FWuLogBombMissionInfo Info; // 0x60(0xb8)
};

// ScriptStruct TslGame.WuLogBombMissionInfo
// Size: 0xb8 (Inherited: 0x00)
struct FWuLogBombMissionInfo {
	struct FWuLogCharacter Character; // 0x00(0xa0)
	struct FString Action; // 0xa0(0x10)
	int32 CurrentRound; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerPlant
// Size: 0x118 (Inherited: 0x60)
struct FWuLogBombPlayerPlant : FLogBase {
	struct FWuLogBombMissionInfo Info; // 0x60(0xb8)
};

// ScriptStruct TslGame.WuLogBombMoneyDonation
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogBombMoneyDonation : FLogBase {
	struct FWuLogBombPlayerCoinInfo Giver; // 0x60(0x28)
	struct FWuLogBombPlayerCoinInfo Taker; // 0x88(0x28)
	int32 Amount; // 0xb0(0x04)
	int32 CurrentRound; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerCoinInfo
// Size: 0x28 (Inherited: 0x00)
struct FWuLogBombPlayerCoinInfo {
	struct FString CharacterName; // 0x00(0x10)
	struct FString AccountId; // 0x10(0x10)
	int32 PresentCurrency; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.WuLogBombItemBuy
// Size: 0x160 (Inherited: 0x60)
struct FWuLogBombItemBuy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	int32 PresentCurrency; // 0x100(0x04)
	int32 Cost; // 0x104(0x04)
	int32 CurrentRound; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct FWuLogItem Item; // 0x110(0x50)
};

// ScriptStruct TslGame.WuLogBombMatchResult
// Size: 0x98 (Inherited: 0x60)
struct FWuLogBombMatchResult : FLogBase {
	struct FWuLogBombMatchResultTeamInfo VictoryTeam; // 0x60(0x14)
	struct FWuLogBombMatchResultTeamInfo DefeatTeam; // 0x74(0x14)
	struct FString FinishCause; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogBombMatchResultTeamInfo
// Size: 0x14 (Inherited: 0x00)
struct FWuLogBombMatchResultTeamInfo {
	int32 TeamId; // 0x00(0x04)
	int32 TotalKills; // 0x04(0x04)
	int32 TotalAssists; // 0x08(0x04)
	int32 TotalPlantCount; // 0x0c(0x04)
	int32 TotalDefuseCount; // 0x10(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerIncome
// Size: 0x120 (Inherited: 0x60)
struct FWuLogBombPlayerIncome : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	int32 Amount; // 0x100(0x04)
	int32 CurrentRound; // 0x104(0x04)
	struct FWuBombRoundSummary RoundSummary; // 0x108(0x14)
	char pad_11C[0x4]; // 0x11c(0x04)
};

// ScriptStruct TslGame.WuBombRoundSummary
// Size: 0x14 (Inherited: 0x00)
struct FWuBombRoundSummary {
	int32 KillCount; // 0x00(0x04)
	int32 AssistCount; // 0x04(0x04)
	bool PlantOrDefuse; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 DefeatStreak; // 0x0c(0x04)
	bool DeciveRound; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.WuLogBombRoundFinished
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogBombRoundFinished : FLogBase {
	struct FWuLogBombRoundFinishTeamInfo VictoryTeam; // 0x60(0x20)
	struct FWuLogBombRoundFinishTeamInfo DefeatTeam; // 0x80(0x20)
	struct FString FinishCause; // 0xa0(0x10)
	int32 CurrentRound; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogBombRoundFinishTeamInfo
// Size: 0x20 (Inherited: 0x00)
struct FWuLogBombRoundFinishTeamInfo {
	int32 TeamId; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString TeamType; // 0x08(0x10)
	int32 AlivePlayerCount; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.WuLogTireReplaced
// Size: 0x1b0 (Inherited: 0x60)
struct FWuLogTireReplaced : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FWuLogVehicle ParentVehicle; // 0x100(0x58)
	struct FWuLogItem Item; // 0x158(0x50)
	float Durability; // 0x1a8(0x04)
	char pad_1AC[0x4]; // 0x1ac(0x04)
};

// ScriptStruct TslGame.WuLogVehicle
// Size: 0x58 (Inherited: 0x00)
struct FWuLogVehicle {
	struct FString VehicleType; // 0x00(0x10)
	struct FString SpawnId; // 0x10(0x10)
	struct FString VehicleId; // 0x20(0x10)
	int32 VehicleUniqueId; // 0x30(0x04)
	int32 SeatIndex; // 0x34(0x04)
	float HealthPercent; // 0x38(0x04)
	float FeulPercent; // 0x3c(0x04)
	float RotationPitch; // 0x40(0x04)
	float AltitudeAbs; // 0x44(0x04)
	float AltitudeRel; // 0x48(0x04)
	float Velocity; // 0x4c(0x04)
	bool IsWheelsInAir; // 0x50(0x01)
	bool IsInWaterVolume; // 0x51(0x01)
	bool IsEngineOn; // 0x52(0x01)
	char pad_53[0x5]; // 0x53(0x05)
};

// ScriptStruct TslGame.WuLogTirePulledOut
// Size: 0x1b0 (Inherited: 0x60)
struct FWuLogTirePulledOut : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FWuLogVehicle ParentVehicle; // 0x100(0x58)
	struct FWuLogItem Item; // 0x158(0x50)
	float Durability; // 0x1a8(0x04)
	char pad_1AC[0x4]; // 0x1ac(0x04)
};

// ScriptStruct TslGame.WuLogSoftRoleRepairkitUse
// Size: 0x2a8 (Inherited: 0x60)
struct FWuLogSoftRoleRepairkitUse : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FWuLogItem Item; // 0x100(0x50)
	struct FWuLogItem RepairedItem; // 0x150(0x50)
	struct FWuLogVehicle RepairedVehicle; // 0x1a0(0x58)
	struct FWuLogCharacter TargetCharacter; // 0x1f8(0xa0)
	float PreviousRepairedStatus; // 0x298(0x04)
	float RepairedStatus; // 0x29c(0x04)
	int32 Remainedcount; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
};

// ScriptStruct TslGame.WuLogRevivalAircraft
// Size: 0x78 (Inherited: 0x60)
struct FWuLogRevivalAircraft : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FString> ReviveAccounts; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogSuccessRegisterBluechip
// Size: 0x90 (Inherited: 0x60)
struct FWuLogSuccessRegisterBluechip : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString RegisteredByAccountId; // 0x70(0x10)
	struct FString RegisteringMethod; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogTryRegisterBluechip
// Size: 0x90 (Inherited: 0x60)
struct FWuLogTryRegisterBluechip : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString RegisteredByAccountId; // 0x70(0x10)
	struct FString RegisteringMethod; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogBluechipLooted
// Size: 0x80 (Inherited: 0x60)
struct FWuLogBluechipLooted : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString LootingUserAccountId; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogBluechipRemove
// Size: 0x70 (Inherited: 0x60)
struct FWuLogBluechipRemove : FLogBase {
	struct FString AccountId; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogBluechipCreate
// Size: 0x78 (Inherited: 0x60)
struct FWuLogBluechipCreate : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 phase; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRejectReconnect
// Size: 0x70 (Inherited: 0x60)
struct FWuLogPlayerRejectReconnect : FLogBase {
	struct FString AccountId; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogPlayerDisconnected
// Size: 0x128 (Inherited: 0x60)
struct FWuLogPlayerDisconnected : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	struct FString Reason; // 0x110(0x10)
	bool IsRewardConfirmed; // 0x120(0x01)
	bool IsPenaltyWaived; // 0x121(0x01)
	bool ExitToDesktop; // 0x122(0x01)
	bool WasKicked; // 0x123(0x01)
	char pad_124[0x4]; // 0x124(0x04)
};

// ScriptStruct TslGame.WuGameResultPerPlayer
// Size: 0xb0 (Inherited: 0x00)
struct FWuGameResultPerPlayer {
	struct FString PlayerNetId; // 0x00(0x10)
	int32 Rank; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString GameResult; // 0x18(0x10)
	int32 TeamId; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FWuGameResultStatsPerPlayer Stats; // 0x30(0x68)
	bool IsBpGrinder; // 0x98(0x01)
	bool IsXpGrinder; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
	struct FString AccountId; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuGameResultStatsPerPlayer
// Size: 0x68 (Inherited: 0x00)
struct FWuGameResultStatsPerPlayer {
	int32 KillCount; // 0x00(0x04)
	float Score; // 0x04(0x04)
	float Xp; // 0x08(0x04)
	float DistanceOnFoot; // 0x0c(0x04)
	float DistanceOnSwim; // 0x10(0x04)
	float DistanceOnVehicle; // 0x14(0x04)
	float DistanceOnParachute; // 0x18(0x04)
	float DistanceOnFreefall; // 0x1c(0x04)
	struct FWuLogPlayTimeRecord PlayTime; // 0x20(0x08)
	struct FWuBpRewardDetail BpRewardDetail; // 0x28(0x18)
	struct FWuArcadeRewardDetail ArcadeRewardDetail; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct FWuStatTrakData> StatTrakDataPairs; // 0x48(0x10)
	struct TArray<struct FWuStatTrakData> HeadshotStatTrakDataPairs; // 0x58(0x10)
};

// ScriptStruct TslGame.WuStatTrakData
// Size: 0x18 (Inherited: 0x00)
struct FWuStatTrakData {
	struct FString GameItemId; // 0x00(0x10)
	int32 Value; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuArcadeRewardDetail
// Size: 0x04 (Inherited: 0x00)
struct FWuArcadeRewardDetail {
	int32 ByPlayTime; // 0x00(0x04)
};

// ScriptStruct TslGame.WuBpRewardDetail
// Size: 0x18 (Inherited: 0x00)
struct FWuBpRewardDetail {
	float ByPlayTime; // 0x00(0x04)
	float ByRanking; // 0x04(0x04)
	float ByKills; // 0x08(0x04)
	float ByDamageDealt; // 0x0c(0x04)
	float BoostAmount; // 0x10(0x04)
	float ByModeScore; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogPlayTimeRecord
// Size: 0x08 (Inherited: 0x00)
struct FWuLogPlayTimeRecord {
	int32 SurvivalTime; // 0x00(0x04)
	int32 TeamSpectatingTime; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogPlayerDisconnectedByQuit
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerDisconnectedByQuit : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	bool IsPenaltyWaived; // 0x110(0x01)
	bool ExitToDesktop; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)
};

// ScriptStruct TslGame.WuLogPlayerDisconnectedByTimeout
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerDisconnectedByTimeout : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	bool IsPenaltyWaived; // 0x110(0x01)
	bool ExitToDesktop; // 0x111(0x01)
	bool WasKicked; // 0x112(0x01)
	char pad_113[0x5]; // 0x113(0x05)
};

// ScriptStruct TslGame.WuLogPlayerConnected
// Size: 0x88 (Inherited: 0x60)
struct FWuLogPlayerConnected : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	bool IsReconnect; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FString Reason; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogCrowbarInteraction
// Size: 0x110 (Inherited: 0x60)
struct FWuLogCrowbarInteraction : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FString TargetName; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogUsePresetSlotIngame
// Size: 0x108 (Inherited: 0x60)
struct FWuLogUsePresetSlotIngame : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	int32 SlotIndex; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLog1vs1ArenaMatching
// Size: 0xd8 (Inherited: 0x60)
struct FWuLog1vs1ArenaMatching : FLogBase {
	struct FString SearchStartTime; // 0x60(0x10)
	struct FWuLog1vs1ArenaTimeRecord MatchingTimeRecord; // 0x70(0x20)
	struct TArray<struct FString> SavedItems; // 0x90(0x10)
	struct TArray<int32> Results; // 0xa0(0x10)
	int32 RoundCount; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct FString AccountId; // 0xb8(0x10)
	struct FString NetId; // 0xc8(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaTimeRecord
// Size: 0x20 (Inherited: 0x00)
struct FWuLog1vs1ArenaTimeRecord {
	struct FString StartTime; // 0x00(0x10)
	struct FString EndTime; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaMatchingSearch
// Size: 0xa0 (Inherited: 0x60)
struct FWuLog1vs1ArenaMatchingSearch : FLogBase {
	struct FWuLog1vs1ArenaTimeRecord TimeRecord; // 0x60(0x20)
	struct FString AccountId; // 0x80(0x10)
	struct FString NetId; // 0x90(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaOberserver
// Size: 0x90 (Inherited: 0x60)
struct FWuLog1vs1ArenaOberserver : FLogBase {
	struct TArray<struct FWuLog1vs1ArenaTimeRecord> TimeRecords; // 0x60(0x10)
	struct FString AccountId; // 0x70(0x10)
	struct FString NetId; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogMinimapTeleport
// Size: 0x80 (Inherited: 0x60)
struct FWuLogMinimapTeleport : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct TArray<struct FWuLogMinimapTeleportData> TeleportDatas; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogMinimapTeleportData
// Size: 0x18 (Inherited: 0x00)
struct FWuLogMinimapTeleportData {
	int32 TeleportType; // 0x00(0x04)
	int32 PracticeType; // 0x04(0x04)
	struct FString DestinationActorName; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLogAbilitySummer
// Size: 0x110 (Inherited: 0x60)
struct FWuLogAbilitySummer : FLogBase {
	struct FWuLogCharacter Owner; // 0x60(0xa0)
	struct TArray<struct FWuLogAbilityData> AbilityDataArr; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogAbilityData
// Size: 0x20 (Inherited: 0x00)
struct FWuLogAbilityData {
	struct FString AbilityID; // 0x00(0x10)
	int32 TotalActivate; // 0x10(0x04)
	int32 TotalSuccess; // 0x14(0x04)
	int32 TotalCancel; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.WuLogAbilityActivate
// Size: 0x130 (Inherited: 0x60)
struct FWuLogAbilityActivate : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Owner; // 0x68(0xa0)
	struct FWuLogAbility Ability; // 0x108(0x20)
	int32 Index; // 0x128(0x04)
	bool IsSuccess; // 0x12c(0x01)
	char pad_12D[0x3]; // 0x12d(0x03)
};

// ScriptStruct TslGame.WuLogAbility
// Size: 0x20 (Inherited: 0x00)
struct FWuLogAbility {
	struct FString AbilityID; // 0x00(0x10)
	struct TArray<struct FString> Attributes; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLogLivingthingAlertTime
// Size: 0x78 (Inherited: 0x60)
struct FWuLogLivingthingAlertTime : FLogBase {
	struct FString LivingthingName; // 0x60(0x10)
	int32 TotalAlertTime; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogItemPickupFromChickenBox
// Size: 0x158 (Inherited: 0x60)
struct FWuLogItemPickupFromChickenBox : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FWuLogItem Item; // 0x100(0x50)
	int32 ChickenBoxId; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
};

// ScriptStruct TslGame.WuLogZDF2StageData
// Size: 0x98 (Inherited: 0x60)
struct FWuLogZDF2StageData : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString Timestamp; // 0x70(0x10)
	int32 StageNumber; // 0x80(0x04)
	bool IsCraftingTime; // 0x84(0x01)
	bool IsStart; // 0x85(0x01)
	bool IsLastStage; // 0x86(0x01)
	char pad_87[0x1]; // 0x87(0x01)
	struct TArray<struct FWuLogZDF2PlayerData> PlayersData; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogZDF2PlayerData
// Size: 0x108 (Inherited: 0x60)
struct FWuLogZDF2PlayerData : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	int32 HoldingCoinNum; // 0x100(0x04)
	int32 EarnedCoinNum; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogRacingModeCoursePlayData
// Size: 0x98 (Inherited: 0x60)
struct FWuLogRacingModeCoursePlayData : FLogBase {
	int32 CourseNum; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString AccountId; // 0x68(0x10)
	int32 FinalRanking; // 0x78(0x04)
	int32 DeathCount; // 0x7c(0x04)
	int32 KillCount; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct TArray<struct FWuLogRacingModeCheckPointPlayData> CheckPoinPlayDatas; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogRacingModeCheckPointPlayData
// Size: 0x80 (Inherited: 0x60)
struct FWuLogRacingModeCheckPointPlayData : FLogBase {
	int32 PassedCheckPointNum; // 0x60(0x04)
	float CheckPointPassedTime; // 0x64(0x04)
	int32 IndividualRanking; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FString Passed_Vehicle; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogSandboxItemUsageCount
// Size: 0x110 (Inherited: 0x60)
struct FWuLogSandboxItemUsageCount : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct TArray<struct FWuLogSandboxItemDataUsage> ItemsPerCategory; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogSandboxItemDataUsage
// Size: 0x20 (Inherited: 0x00)
struct FWuLogSandboxItemDataUsage {
	struct FString ItemCategory; // 0x00(0x10)
	struct TArray<struct FWuStringIntPair> Items; // 0x10(0x10)
};

// ScriptStruct TslGame.WuStringIntPair
// Size: 0x18 (Inherited: 0x00)
struct FWuStringIntPair {
	struct FString First; // 0x00(0x10)
	int32 second; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogRadioMessage
// Size: 0x110 (Inherited: 0x60)
struct FWuLogRadioMessage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FString MessageCategory; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogAtoZTutorialAllMissionClear
// Size: 0x100 (Inherited: 0x60)
struct FWuLogAtoZTutorialAllMissionClear : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
};

// ScriptStruct TslGame.WuLogItemTypeOverrideZone
// Size: 0x78 (Inherited: 0x60)
struct FWuLogItemTypeOverrideZone : FLogBase {
	int32 ItemTypeOverrideZone; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FWuLogItemTypeOverrideZoneData> ItemTypeOverrideZoneDatas; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogItemTypeOverrideZoneData
// Size: 0x80 (Inherited: 0x60)
struct FWuLogItemTypeOverrideZoneData : FLogBase {
	struct FString OverrideType; // 0x60(0x10)
	struct FVector ItemTypeOverrideZonePosition; // 0x70(0x0c)
	float ItemTypeOverrideZoneRadius; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRedeploy
// Size: 0x108 (Inherited: 0x60)
struct FWuLogPlayerRedeploy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	int32 phase; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRedeployBRStart
// Size: 0x78 (Inherited: 0x60)
struct FWuLogPlayerRedeployBRStart : FLogBase {
	struct TArray<struct FWuLogCharacter> Characters; // 0x60(0x10)
	int32 phase; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogUsedBlueBlockerAndReturnedToSafeZone
// Size: 0x108 (Inherited: 0x60)
struct FWuLogUsedBlueBlockerAndReturnedToSafeZone : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	int32 NumTimesUsedBlueBlockerAndReturnedToSafeZone; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogBlueBlockerAbsorbBlueZoneDamage
// Size: 0x108 (Inherited: 0x60)
struct FWuLogBlueBlockerAbsorbBlueZoneDamage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	float DamageAbsorbed; // 0x100(0x04)
	int32 NumTimesBlueZoneAbsorbed; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogVoiceChatUseage
// Size: 0x90 (Inherited: 0x60)
struct FWuLogVoiceChatUseage : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct TArray<struct FWuStringFloatPair> Option; // 0x70(0x10)
	float PushTime; // 0x80(0x04)
	float TimeSpent; // 0x84(0x04)
	int32 PlatformProvider; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// ScriptStruct TslGame.WuStringFloatPair
// Size: 0x18 (Inherited: 0x00)
struct FWuStringFloatPair {
	struct FString First; // 0x00(0x10)
	float second; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuEventDamage
// Size: 0x68 (Inherited: 0x10)
struct FWuEventDamage : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	bool IsVictimMe; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	float Damage; // 0x14(0x04)
	struct FString DamageTypeCategory; // 0x18(0x10)
	struct FString AttackerName; // 0x28(0x10)
	struct FVector AttackerLocation; // 0x38(0x0c)
	int32 AttackerTeamId; // 0x44(0x04)
	struct FString VictimName; // 0x48(0x10)
	struct FVector VictimLocation; // 0x58(0x0c)
	int32 VictimTeamId; // 0x64(0x04)
};

// ScriptStruct TslGame.WuEventKill
// Size: 0x88 (Inherited: 0x10)
struct FWuEventKill : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	bool IsKillerMe; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	struct FString KillerName; // 0x18(0x10)
	struct FVector KillerLocation; // 0x28(0x0c)
	int32 KillerTeamId; // 0x34(0x04)
	bool IsVictimMe; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString VictimName; // 0x40(0x10)
	struct FVector VictimLocation; // 0x50(0x0c)
	int32 VictimTeamId; // 0x5c(0x04)
	struct FString DamageCauser; // 0x60(0x10)
	struct FString DamageReason; // 0x70(0x10)
	bool IsGroggy; // 0x80(0x01)
	bool IsStealKilled; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
};

// ScriptStruct TslGame.WuEventMatchResult
// Size: 0x38 (Inherited: 0x10)
struct FWuEventMatchResult : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	int32 StartPlayerCount; // 0x20(0x04)
	int32 StartTeamCount; // 0x24(0x04)
	struct TArray<struct FWuEventDataTeamResult> Teams; // 0x28(0x10)
};

// ScriptStruct TslGame.WuEventDataTeamResult
// Size: 0x18 (Inherited: 0x00)
struct FWuEventDataTeamResult {
	int32 TeamId; // 0x00(0x04)
	int32 Ranking; // 0x04(0x04)
	struct TArray<struct FWuEventDataPlayerResult> Members; // 0x08(0x10)
};

// ScriptStruct TslGame.WuEventDataPlayerResult
// Size: 0x18 (Inherited: 0x00)
struct FWuEventDataPlayerResult {
	struct FString PlayerName; // 0x00(0x10)
	int32 KillCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuEventPlayerMatchResult
// Size: 0x48 (Inherited: 0x10)
struct FWuEventPlayerMatchResult : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	int32 StartPlayerCount; // 0x20(0x04)
	int32 StartTeamCount; // 0x24(0x04)
	struct FString PlayerName; // 0x28(0x10)
	int32 Ranking; // 0x38(0x04)
	int32 KillCount; // 0x3c(0x04)
	int32 HeadShotCount; // 0x40(0x04)
	float GivenDamages; // 0x44(0x04)
};

// ScriptStruct TslGame.WuEventMatchStatus
// Size: 0xc8 (Inherited: 0x10)
struct FWuEventMatchStatus : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString MatchId; // 0x18(0x10)
	struct FString TeamMode; // 0x28(0x10)
	struct FString CameraMode; // 0x38(0x10)
	struct FString MatchState; // 0x48(0x10)
	int32 ElapsedTime; // 0x58(0x04)
	int32 BlueZonePhase; // 0x5c(0x04)
	bool IsBlueZoneMoving; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float BluezoneRadius; // 0x64(0x04)
	struct FVector BlueZoneLocation; // 0x68(0x0c)
	float WhiteZoneRadius; // 0x74(0x04)
	struct FVector WhiteZoneLocation; // 0x78(0x0c)
	float RedZoneRadius; // 0x84(0x04)
	struct FVector RedZoneLocation; // 0x88(0x0c)
	float BlackZoneRadius; // 0x94(0x04)
	struct FVector BlackZoneLocation; // 0x98(0x0c)
	int32 StartPlayerCount; // 0xa4(0x04)
	int32 AlivePlayerCount; // 0xa8(0x04)
	int32 StartTeamCount; // 0xac(0x04)
	int32 AliveTeamCount; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct TArray<struct FWuEventDataPlayerInfo> PlayerInfos; // 0xb8(0x10)
};

// ScriptStruct TslGame.WuEventDataPlayerInfo
// Size: 0x50 (Inherited: 0x00)
struct FWuEventDataPlayerInfo {
	struct FString PlayerName; // 0x00(0x10)
	int32 TeamId; // 0x10(0x04)
	struct FVector Location; // 0x14(0x0c)
	float Health; // 0x20(0x04)
	float BoostGauge; // 0x24(0x04)
	struct FString State; // 0x28(0x10)
	struct FString ArmedWeapon; // 0x38(0x10)
	int32 ArmedAmmoCount; // 0x48(0x04)
	int32 InventoryAmmoCount; // 0x4c(0x04)
};

// ScriptStruct TslGame.WuEventPlayerStatus
// Size: 0xa0 (Inherited: 0x10)
struct FWuEventPlayerStatus : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	struct FString MyPlayerName; // 0x20(0x10)
	bool IsSpetating; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FVector SpectatingCameraLocation; // 0x34(0x0c)
	struct FWuEventDataPlayerInfo CurrentPlayerInfo; // 0x40(0x50)
	struct TArray<struct FWuEventDataPlayerInfo> TeamMatesInfo; // 0x90(0x10)
};

// ScriptStruct TslGame.WuEventMatchLeave
// Size: 0x20 (Inherited: 0x10)
struct FWuEventMatchLeave : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
};

// ScriptStruct TslGame.WuEventMatchJoin
// Size: 0x48 (Inherited: 0x10)
struct FWuEventMatchJoin : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	struct FString TeamMode; // 0x20(0x10)
	struct FString CameraMode; // 0x30(0x10)
	bool IsDetailObserver; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// ScriptStruct TslGame.WuLogUseBrokenElectronics
// Size: 0x110 (Inherited: 0x60)
struct FWuLogUseBrokenElectronics : FLogBase {
	struct FString ElectronicsType; // 0x60(0x10)
	struct FWuLogCharacter Character; // 0x70(0xa0)
};

// ScriptStruct TslGame.WuLogSpecialZoneSpawn
// Size: 0x80 (Inherited: 0x60)
struct FWuLogSpecialZoneSpawn : FLogBase {
	struct FString ZoneType; // 0x60(0x10)
	struct FVector SpawnedPosition; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogIndoorRangeScore
// Size: 0x90 (Inherited: 0x60)
struct FWuLogIndoorRangeScore : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	struct TArray<struct FWuIntIntPair> Score; // 0x80(0x10)
};

// ScriptStruct TslGame.WuIntIntPair
// Size: 0x08 (Inherited: 0x00)
struct FWuIntIntPair {
	int32 First; // 0x00(0x04)
	int32 second; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogChangeTargetDistance
// Size: 0x88 (Inherited: 0x60)
struct FWuLogChangeTargetDistance : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	int32 Distance; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct TslGame.WuLogEnterIndoorRange
// Size: 0x88 (Inherited: 0x60)
struct FWuLogEnterIndoorRange : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	bool bIsExit; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
};

// ScriptStruct TslGame.WuLogSpray
// Size: 0x110 (Inherited: 0x60)
struct FWuLogSpray : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0xa0)
	struct FString SprayName; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogHelmetHide
// Size: 0x68 (Inherited: 0x60)
struct FWuLogHelmetHide : FLogBase {
	bool IsHat; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
};

// ScriptStruct TslGame.WuLogLobbyMusic
// Size: 0x70 (Inherited: 0x60)
struct FWuLogLobbyMusic : FLogBase {
	struct FString MusicEventName; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogArenaRoundEnd
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaRoundEnd : FLogBase {
	int32 Round; // 0x60(0x04)
	bool IsLastRound; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct FWuLogArenaEndData> Arenas; // 0x68(0x10)
	struct TArray<struct FWuLogTeamInfoData> Teams; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogTeamInfoData
// Size: 0x30 (Inherited: 0x00)
struct FWuLogTeamInfoData {
	int32 TeamId; // 0x00(0x04)
	int32 Chances; // 0x04(0x04)
	int32 TotalKills; // 0x08(0x04)
	int32 TotalMoney; // 0x0c(0x04)
	struct FString KeyPlayer; // 0x10(0x10)
	struct TArray<struct FWuLogCharacterWeapons> Characters; // 0x20(0x10)
};

// ScriptStruct TslGame.WuLogCharacterWeapons
// Size: 0xd8 (Inherited: 0x00)
struct FWuLogCharacterWeapons {
	struct FWuLogCharacter Character; // 0x00(0xa0)
	struct FString PrimaryWeaponFirst; // 0xa0(0x10)
	struct FString PrimaryWeaponSecond; // 0xb0(0x10)
	struct FString SecondaryWeapon; // 0xc0(0x10)
	int32 SpawnKitIndex; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct TslGame.WuLogArenaEndData
// Size: 0x08 (Inherited: 0x00)
struct FWuLogArenaEndData {
	int32 ArenaID; // 0x00(0x04)
	int32 WinnerTeamId; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogArenaRoundStart
// Size: 0x78 (Inherited: 0x60)
struct FWuLogArenaRoundStart : FLogBase {
	int32 Round; // 0x60(0x04)
	bool IsLastRound; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct FWuLogArenaStartData> Arenas; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogArenaStartData
// Size: 0x18 (Inherited: 0x00)
struct FWuLogArenaStartData {
	int32 ArenaID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FWuLogTeamInfoData> Teams; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLogArenaLoadoutBuy
// Size: 0x98 (Inherited: 0x60)
struct FWuLogArenaLoadoutBuy : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	int32 Sum; // 0x70(0x04)
	int32 ItemsNum; // 0x74(0x04)
	struct FString ItemID; // 0x78(0x10)
	struct FString ReplacedItemId; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogArenaCurrencyChange
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaCurrencyChange : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	int32 CurrencyDif; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FString Source; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogArenaScreenOpen
// Size: 0x80 (Inherited: 0x60)
struct FWuLogArenaScreenOpen : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	struct FString ScreenName; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogArenaGameStatePeriodic
// Size: 0xe8 (Inherited: 0x60)
struct FWuLogArenaGameStatePeriodic : FLogBase {
	struct FWuLogArenaGameState ArenaGameState; // 0x60(0x88)
};

// ScriptStruct TslGame.WuLogArenaGameState
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaGameState : FLogBase {
	int32 ElapsedTime; // 0x60(0x04)
	int32 NumAliveTeams; // 0x64(0x04)
	int32 NumJoinPlayers; // 0x68(0x04)
	int32 NumStartPlayers; // 0x6c(0x04)
	int32 NumAlivePlayers; // 0x70(0x04)
	int32 Round; // 0x74(0x04)
	struct TArray<struct FWuLogArena> Arenas; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogArena
// Size: 0x24 (Inherited: 0x00)
struct FWuLogArena {
	struct FVector SafetyZonePosition; // 0x00(0x0c)
	float SafetyZoneRadius; // 0x0c(0x04)
	struct FVector PoisonGasWarningPosition; // 0x10(0x0c)
	float PoisonGasWarningRadius; // 0x1c(0x04)
	int32 ArenaID; // 0x20(0x04)
};

// ScriptStruct TslGame.WuLogInPacketStat
// Size: 0xa8 (Inherited: 0x60)
struct FWuLogInPacketStat : FLogBase {
	struct FString LeagueType; // 0x60(0x10)
	struct FString ModeName; // 0x70(0x10)
