// UserDefinedStruct VFX_Surface.VFX_Surface
// Size: 0x50 (Inherited: 0x00)
struct FVFX_Surface {
	struct UParticleSystem* Dirt_9_22C0D96E44DF482867F6B5A758D93194; // 0x00(0x08)
	struct UParticleSystem* Water_11_C8AEBF3B4FA685F844D1C89F64774DC2; // 0x08(0x08)
	struct UParticleSystem* Grass_17_A084AF664A15FC8AB2937795EA3E749F; // 0x10(0x08)
	struct UParticleSystem* Sand_18_B1EC5DC24262C9ADED3CE79E713A17C8; // 0x18(0x08)
	struct UParticleSystem* Mud_19_88910E8F4D224894AC9F57883C103F0A; // 0x20(0x08)
	struct UParticleSystem* Snow_20_74BEFD734212A31EB8E55BA8E284270B; // 0x28(0x08)
	struct UParticleSystem* Ice_21_CE62A9674193FD0BCA47C78CCCE61D24; // 0x30(0x08)
	struct UParticleSystem* Default_24_F06A36C84B96E7216125AB80C34DC272; // 0x38(0x08)
	struct UParticleSystem* Reed_28_736057AF4686F8F2013CAF97E6BDC34F; // 0x40(0x08)
	struct UParticleSystem* Maple_30_03C797FA4E620D5CBA738C9F3CBBF19C; // 0x48(0x08)
};

