// BlueprintGeneratedClass BP_WeaponDisplay.BP_WeaponDisplay_C
// Size: 0x7c0 (Inherited: 0x648)
struct ABP_WeaponDisplay_C : ATslWeaponDisplay {
	struct F*abc8f374e0 UberGraphFrame; // 0x648(0x08)
	struct USkeletalMeshComponent* Weapon Textured Mesh; // 0x650(0x08)
	struct USkeletalMeshComponent* Weapon Cutout Mesh; // 0x658(0x08)
	struct USkeletalMeshComponent* Weapon Hidden Mesh; // 0x660(0x08)
	struct USceneComponent* Weapon Meshes; // 0x668(0x08)
	struct UPostProcessComponent* PostProcess; // 0x670(0x08)
	struct USceneComponent* WeaponHolder; // 0x678(0x08)
	struct UStaticMeshComponent* Sphere; // 0x680(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x688(0x08)
	struct FString Crowbar; // 0x690(0x10)
	bool HasSpawnedWeapon; // 0x6a0(0x01)
	bool LocalTesting; // 0x6a1(0x01)
	bool IsMouseButtonDown; // 0x6a2(0x01)
	bool WasMouseButtonJustReleased; // 0x6a3(0x01)
	bool LastMouseSet; // 0x6a4(0x01)
	char pad_6A5[0x3]; // 0x6a5(0x03)
	float LastMouseX; // 0x6a8(0x04)
	float LastMouseY; // 0x6ac(0x04)
	float MouseDeltaX; // 0x6b0(0x04)
	float MouseDeltaY; // 0x6b4(0x04)
	bool BPUserModified; // 0x6b8(0x01)
	char pad_6B9[0x7]; // 0x6b9(0x07)
	struct UCurveFloat* BPDecayCurveDefault; // 0x6c0(0x08)
	struct UCurveFloat* BPDecayCurveContinousSpin; // 0x6c8(0x08)
	float BPMomentumAccumulationMultiplier; // 0x6d0(0x04)
	float BPDecayTimer; // 0x6d4(0x04)
	float BPDecayTimeInSeconds; // 0x6d8(0x04)
	float BPRotationDirection; // 0x6dc(0x04)
	float BPRotationSpeed; // 0x6e0(0x04)
	float BPRotationDeltaMin; // 0x6e4(0x04)
	float BPRotationDeltaMax; // 0x6e8(0x04)
	bool BPReturningToFace; // 0x6ec(0x01)
	char pad_6ED[0x3]; // 0x6ed(0x03)
	float BPFaceRotationTimer; // 0x6f0(0x04)
	float BPFaceRotationSpeed; // 0x6f4(0x04)
	struct FRotator BPFaceRotationFrom; // 0x6f8(0x0c)
	struct FRotator BPFaceRotationTo; // 0x704(0x0c)
	struct FRotator BPFaceRotationRight; // 0x710(0x0c)
	bool BPAutoSpinEnabled; // 0x71c(0x01)
	bool BPReturnToFaceEnabled; // 0x71d(0x01)
	char pad_71E[0x2]; // 0x71e(0x02)
	struct FRotator BPFaceRotationLeft; // 0x720(0x0c)
	bool BPOverrideTargetFacing; // 0x72c(0x01)
	char pad_72D[0x3]; // 0x72d(0x03)
	struct FRotator BPFaceRotationDefault; // 0x730(0x0c)
	float BPFaceRotationStep; // 0x73c(0x04)
	struct FString Kar98k; // 0x740(0x10)
	float Transition Speed; // 0x750(0x04)
	char pad_754[0x4]; // 0x754(0x04)
	struct TArray<struct UCurveFloat*> Transition Curve; // 0x758(0x10)
	struct FString crossbow; // 0x768(0x10)
	struct FString aug; // 0x778(0x10)
	struct FString Mini14; // 0x788(0x10)
	struct FString AWM; // 0x798(0x10)
	struct FString AKM; // 0x7a8(0x10)
	bool UserSetMomentum; // 0x7b8(0x01)
	bool AttachmentsLoaded; // 0x7b9(0x01)
	char pad_7BA[0x2]; // 0x7ba(0x02)
	int32 AttachmentIndex; // 0x7bc(0x04)

	void UserConstructionScript(); // Function BP_WeaponDisplay.BP_WeaponDisplay_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x273e04
	bool AddStaticMeshAsyncEvent(); // Function BP_WeaponDisplay.BP_WeaponDisplay_C.AddStaticMeshAsyncEvent // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x273e04
	struct TArray<struct UAsyncStaticMeshComponent*> ExecuteUbergraph_BP_WeaponDisplay(); // Function BP_WeaponDisplay.BP_WeaponDisplay_C.ExecuteUbergraph_BP_WeaponDisplay // HasDefaults // @ game+0x273e04
};

