// Class TslGame.AbstractRespawnProcessor
// Size: 0x480 (Inherited: 0x3f8)
struct AAbstractRespawnProcessor : AActor {
	float *af1e34aab2; // 0x3f8(0x04)
	float *c94eeccead; // 0x3fc(0x04)
	bool *d4d903dfd3; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct TArray<struct UClass*> *97e61c3a1c; // 0x408(0x10)
	struct FMulticastDelegate OnRespawnStarted; // 0x418(0x10)
	struct FMulticastDelegate OnRespawnEnded; // 0x428(0x10)
	struct FMulticastDelegate OnRespawned; // 0x438(0x10)
	struct FMulticastDelegate OnCharacterDead; // 0x448(0x10)
	struct FMulticastDelegate OnRespawnedByRound; // 0x458(0x10)
	struct TArray<struct F*9f4e2ae220> *5fac409a71; // 0x468(0x10)
	char pad_478[0x8]; // 0x478(0x08)

	struct ATslPlayerController* *11e921e673(); // Function TslGame.AbstractRespawnProcessor.*11e921e673 // None // @ game+0x55aac74
	void OnRoundUpdatedImpl(); // Function TslGame.AbstractRespawnProcessor.OnRoundUpdatedImpl // None // @ game+0x55aad6c
	void OnCharacterDeadImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharacterDeadImpl // None // @ game+0x55aabe0
	void OnCharactersRespawnedImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharactersRespawnedImpl // None // @ game+0x55aad54
};

// Class TslGame.*004af35bc0
// Size: 0x5f0 (Inherited: 0x398)
struct U*004af35bc0 : UAnimInstance {
	struct ATslCharacter* *426d13dabe; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct FRotator ParachuteRotation_CP; // 0x3a8(0x0c)
	float ParaTurn_CP; // 0x3b4(0x04)
	float ParaPitch_CP; // 0x3b8(0x04)
	bool bIsReleased_CP; // 0x3bc(0x01)
	bool bIsReplayJumping_CP; // 0x3bd(0x01)
	char pad_3BE[0x2]; // 0x3be(0x02)
	struct FTransform IK_L_CP; // 0x3c0(0x30)
	struct FTransform IK_R_CP; // 0x3f0(0x30)
	struct FVector IK_L_Location_CP; // 0x420(0x0c)
	struct FRotator IK_L_Rotation_CP; // 0x42c(0x0c)
	struct FVector IK_R_Location_CP; // 0x438(0x0c)
	struct FRotator IK_R_Rotation_CP; // 0x444(0x0c)
	float EnableIKAlpha_CP; // 0x450(0x04)
	float RigidbodyAlpha; // 0x454(0x04)
	float PhysicsBlendAlpha; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct FTransform IK_L_Handle_CP; // 0x460(0x30)
	struct FTransform IK_R_Handle_CP; // 0x490(0x30)
	struct FTransform IK_L_Strap_CP; // 0x4c0(0x30)
	struct FTransform IK_R_Strap_CP; // 0x4f0(0x30)
	float IK_L_Handle_Alpha_CP; // 0x520(0x04)
	float IK_R_Handle_Alpha_CP; // 0x524(0x04)
	float RollTendency; // 0x528(0x04)
	float PitchTendency; // 0x52c(0x04)
	float TendencyFrame; // 0x530(0x04)
	bool bIsLanding_CP; // 0x534(0x01)
	char pad_535[0x3]; // 0x535(0x03)
	float LandingAlpha_CP; // 0x538(0x04)
	bool bIsMoving_CP; // 0x53c(0x01)
	bool bIsCollapsed_CP; // 0x53d(0x01)
	bool bIsManualCutoff_CP; // 0x53e(0x01)
	bool bIsAutoCutoff_CP; // 0x53f(0x01)
	float ParaAnimTimeFromStart_CP; // 0x540(0x04)
	float ClientRotYawScale; // 0x544(0x04)
	bool bUseNewParachuteAnims; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct FName LeftItemBoneName; // 0x550(0x08)
	struct FName RightItemBoneName; // 0x558(0x08)
	struct FName LeftHandleBoneName; // 0x560(0x08)
	struct FName RightHandleBoneName; // 0x568(0x08)
	struct FName LeftStrapBoneName; // 0x570(0x08)
	struct FName RightStrapBoneName; // 0x578(0x08)
	float LandingCheckVelocityScalar; // 0x580(0x04)
	float LandingCheckStartAltitude; // 0x584(0x04)
	float LandingCheckTickTime; // 0x588(0x04)
	struct FVector TerminalVelocity_CP; // 0x58c(0x0c)
	float *9540a8ca08; // 0x598(0x04)
	float *d4d71455a0; // 0x59c(0x04)
	struct FVector *e59d5eafbc; // 0x5a0(0x0c)
	float *a50da47fb0; // 0x5ac(0x04)
	struct TArray<struct FName> *03562175e0; // 0x5b0(0x10)
	bool *7f88d5b1cd; // 0x5c0(0x01)
	char pad_5C1[0x3]; // 0x5c1(0x03)
	struct FVector *3100c9a32c; // 0x5c4(0x0c)
	int32 *7cd6e29d5c; // 0x5d0(0x04)
	char pad_5D4[0x1c]; // 0x5d4(0x1c)

	void *3e43da2b86(); // Function TslGame.*004af35bc0.*3e43da2b86 // None // @ game+0x55aabb8
	void DetachPara_BP(); // Function TslGame.*004af35bc0.DetachPara_BP // None // @ game+0x26a108
	void *fdbb4d5977(); // Function TslGame.*004af35bc0.*fdbb4d5977 // None // @ game+0x55aaba0
	void *805e6ee791(); // Function TslGame.*004af35bc0.*805e6ee791 // None // @ game+0x55aabcc
};

// Class TslGame.*bc4fd88fb0
// Size: 0x310 (Inherited: 0x250)
struct U*bc4fd88fb0 : UUserWidget {
	struct U*63b14265fa* *83cf39dd24; // 0x250(0x08)
	char pad_258[0x48]; // 0x258(0x48)
	struct FMulticastDelegate WidgetDestroyEventDelegate; // 0x2a0(0x10)
	char pad_2B0[0x60]; // 0x2b0(0x60)

	void GetTslGameUserSettings(); // Function TslGame.*bc4fd88fb0.GetTslGameUserSettings // None // @ game+0x55ef754
	void GetDemoPlayerState(); // Function TslGame.*bc4fd88fb0.GetDemoPlayerState // None // @ game+0x55eccfc
	float ListenForInputAxis(bool bConsume); // Function TslGame.*bc4fd88fb0.ListenForInputAxis // None // @ game+0x55f3068
	void StopListeningForAllInputAxises(); // Function TslGame.*bc4fd88fb0.StopListeningForAllInputAxises // None // @ game+0x55f9c68
	void SetupInputForBlueprint(); // Function TslGame.*bc4fd88fb0.SetupInputForBlueprint // None // @ game+0x26a108
	void GetAxisMultiplier(); // Function TslGame.*bc4fd88fb0.GetAxisMultiplier // None // @ game+0x55ec08c
	void IsInLobby(); // Function TslGame.*bc4fd88fb0.IsInLobby // None // @ game+0x55f133c
	void ContainOwnerUserFocus(); // Function TslGame.*bc4fd88fb0.ContainOwnerUserFocus // None // @ game+0x55ea188
	void TransferUserFocusThroughReply(struct FFocusEvent AcceptedFocusEvent, struct UWidget* FocusWidget); // Function TslGame.*bc4fd88fb0.TransferUserFocusThroughReply // None // @ game+0x55fa4a4
	void GetCachedGameState(); // Function TslGame.*bc4fd88fb0.GetCachedGameState // None // @ game+0x55ec33c
	struct ULocalPlayer* ContainUserFocus(struct UWidget* Widget); // Function TslGame.*bc4fd88fb0.ContainUserFocus // None // @ game+0x55ea1c4
	void NavigateUserFocus(struct ULocalPlayer* Player); // Function TslGame.*bc4fd88fb0.NavigateUserFocus // None // @ game+0x55f38d8
	void IsParticipatedInRedeploy(); // Function TslGame.*bc4fd88fb0.IsParticipatedInRedeploy // None // @ game+0x55f1dcc
	void *81bace3d37(); // Function TslGame.*bc4fd88fb0.*81bace3d37 // None // @ game+0x55f491c
	void IsReplaying(); // Function TslGame.*bc4fd88fb0.IsReplaying // None // @ game+0x55f1fb8
	void IsObserving(); // Function TslGame.*bc4fd88fb0.IsObserving // None // @ game+0x55f1d20
	void ClearUserFocus(); // Function TslGame.*bc4fd88fb0.ClearUserFocus // None // @ game+0x55e9170
	void *50f9009c25(); // Function TslGame.*bc4fd88fb0.*50f9009c25 // None // @ game+0x55f9c7c
	void GetCachedCharacter(); // Function TslGame.*bc4fd88fb0.GetCachedCharacter // None // @ game+0x55ec318
	void IsSpectating(); // Function TslGame.*bc4fd88fb0.IsSpectating // None // @ game+0x55f249c
	void GetCachedViewTargetTslCharacter(); // Function TslGame.*bc4fd88fb0.GetCachedViewTargetTslCharacter // None // @ game+0x55ec360
	struct FKey GetRawKeyValue(); // Function TslGame.*bc4fd88fb0.GetRawKeyValue // None // @ game+0x55ee7f8
	void TslUserWidgetDestroyEvent__DelegateSignature(); // DelegateFunction TslGame.*bc4fd88fb0.TslUserWidgetDestroyEvent__DelegateSignature // None // @ game+0x26a108
};

// Class TslGame.*17234a7c9b
// Size: 0x410 (Inherited: 0x310)
struct U*17234a7c9b : U*bc4fd88fb0 {
	char pad_310[0x10]; // 0x310(0x10)
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	char pad_320_2 : 6; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x328(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x348(0x20)
	struct U*6b11b3bf02* Emerging; // 0x368(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x370(0x08)
	char pad_378[0x18]; // 0x378(0x18)
	enum class ESlateVisibility *0d5cd6f4af; // 0x390(0x01)
	char pad_391[0x3]; // 0x391(0x03)
	float *c0604b00ca; // 0x394(0x04)
	char pad_398[0x4]; // 0x398(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *89f3008bea; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	char pad_3A5[0x3]; // 0x3a5(0x03)
	struct F*f23e4e6c9e *883997f6a4; // 0x3a8(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d0(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f0(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x400(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // None // @ game+0x55f3bfc
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // None // @ game+0x55f3c2c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // None // @ game+0x55ba24c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // None // @ game+0x19e880
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // None // @ game+0x55f1c54
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // None // @ game+0x55e8a18
	struct FVector2D SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // None // @ game+0x55f82c0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // None // @ game+0x55fa6d8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // None // @ game+0x26a108
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // None // @ game+0x55f8218
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // None // @ game+0x55f3cc8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // None // @ game+0x55f3c14
};

// Class TslGame.*f04b1d14fe
// Size: 0xaa8 (Inherited: 0x410)
struct U*f04b1d14fe : U*17234a7c9b {
	char pad_410[0x30]; // 0x410(0x30)
	TScriptInterface<struct U*b015a9bf79> *dcd820f738; // 0x440(0x10)
	TScriptInterface<struct U*f1d1da18cf> SlotContainer; // 0x450(0x10)
	char pad_460[0x98]; // 0x460(0x98)
	struct FLinearColor DefaultSlotNameColor; // 0x4f8(0x10)
	struct FLinearColor DisabledSlotNameColor; // 0x508(0x10)
	char pad_518[0x50]; // 0x518(0x50)
	struct F*7f3debddd2 *54966ee236; // 0x568(0x20)
	struct F*7f3debddd2 *034a1310af; // 0x588(0x20)
	struct F*d3069d51ff *81e2095010; // 0x5a8(0x28)
	struct F*959656208f *f7985010c8; // 0x5d0(0x30)
	struct F*d3069d51ff *aa62a4afb8; // 0x600(0x28)
	struct F*f4f57b85a2 *b72934a3da; // 0x628(0x20)
	struct F*7f3debddd2 *24e6012fab; // 0x648(0x20)
	struct F*d3069d51ff *dfb6b0f7b4; // 0x668(0x28)
	struct F*d3069d51ff *9e4bb7440e; // 0x690(0x28)
	struct F*7f3debddd2 *e5df2606cc; // 0x6b8(0x20)
	struct F*d3069d51ff *27ba0a2765; // 0x6d8(0x28)
	struct F*d3069d51ff *6d1f81300e; // 0x700(0x28)
	struct F*b9afef7a3a *f90aba9df4; // 0x728(0x28)
	struct F*7f3debddd2 *0581d7d58a; // 0x750(0x20)
	struct F*f4f57b85a2 *2313768b08; // 0x770(0x20)
	struct F*f4f57b85a2 *60f6e78b17; // 0x790(0x20)
	struct F*f4f57b85a2 *85755c2b31; // 0x7b0(0x20)
	struct F*c69f8ed24a *0bcc0e53fe; // 0x7d0(0x28)
	struct F*f4f57b85a2 *e8b40173b4; // 0x7f8(0x20)
	struct F*959656208f *34f707acab; // 0x818(0x30)
	struct F*d3069d51ff *dcdf84700b; // 0x848(0x28)
	struct F*f4f57b85a2 *dc3e86a87b; // 0x870(0x20)
	struct F*f0cac2bec7 *3d28748427; // 0x890(0x28)
	struct F*f0cac2bec7 *9794e27f71; // 0x8b8(0x28)
	struct F*c69f8ed24a *5e37025815; // 0x8e0(0x28)
	struct F*7f3debddd2 *98c866faba; // 0x908(0x20)
	struct F*d3069d51ff *5970c9cc94; // 0x928(0x28)
	struct F*f4f57b85a2 *03f441c745; // 0x950(0x20)
	struct UClass* *cee67f1608; // 0x970(0x08)
	struct UTexture2D* SelectTexture; // 0x978(0x08)
	struct UTexture2D* FocusTexture; // 0x980(0x08)
	struct UTexture2D* LinkTexture; // 0x988(0x08)
	struct UTexture2D* NormalTexture; // 0x990(0x08)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x998(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x9a8(0x10)
	bool *e470b4a9a4; // 0x9b8(0x01)
	bool *85fe333e3e; // 0x9b9(0x01)
	char pad_9BA[0x6]; // 0x9ba(0x06)
	struct UEquipableItem* EquipableItem; // 0x9c0(0x08)
	struct UMaterialInstanceDynamic* *40e4d72841; // 0x9c8(0x08)
	struct UItem* *f1bd59f337; // 0x9d0(0x08)
	struct UMaterialInstanceDynamic* *053798b803; // 0x9d8(0x08)
	struct UProgressBar* CastingProgressBar; // 0x9e0(0x08)
	struct AInventory* *4d0a8351ae; // 0x9e8(0x08)
	struct UCastComponent* *1c6df080ba; // 0x9f0(0x08)
	struct UMaterialInstanceDynamic* *3b66295beb; // 0x9f8(0x08)
	struct UMaterialInstanceDynamic* *c4f2663e76; // 0xa00(0x08)
	struct ATslCharacter* TslCharacter; // 0xa08(0x08)
	struct UTexture* Tex; // 0xa10(0x08)
	struct UImage* *e4cb9275e0; // 0xa18(0x08)
	struct U*023cfd3bca* *4d0b7e394f; // 0xa20(0x08)
	struct UItemToolTipWidget* *95442cb857; // 0xa28(0x08)
	struct F*387a87ac65 *01a8a34569; // 0xa30(0x78)

	void DispatchRefreshInnerList(); // Function TslGame.*f04b1d14fe.DispatchRefreshInnerList // None // @ game+0x55bc8e0
	void BroadCastSlotEnter(TScriptInterface<struct U*f1d1da18cf> Param1); // Function TslGame.*f04b1d14fe.BroadCastSlotEnter // None // @ game+0x55b9cbc
	void OnChangedStackCount(); // Function TslGame.*f04b1d14fe.OnChangedStackCount // None // @ game+0x55c1660
	TScriptInterface<struct U*f1d1da18cf> BroadCastSlotFocus(); // Function TslGame.*f04b1d14fe.BroadCastSlotFocus // None // @ game+0x55b9e14
	void BroadCastSlotLeave(TScriptInterface<struct U*b015a9bf79> Param0); // Function TslGame.*f04b1d14fe.BroadCastSlotLeave // None // @ game+0x55b9f88
};

// Class TslGame.*1a5524e277
// Size: 0xab0 (Inherited: 0xaa8)
struct U*1a5524e277 : U*f04b1d14fe {
	struct U*0607ea6463* RadioMessage; // 0xaa8(0x08)
};

// Class TslGame.*3ceeab2126
// Size: 0xb18 (Inherited: 0xaa8)
struct U*3ceeab2126 : U*f04b1d14fe {
	struct U*7f757909f6* UserNickNamePlatformImageWidget; // 0xaa8(0x08)
	struct F*8e32972a91 *7a895a250c; // 0xab0(0x28)
	float *af9144ad82; // 0xad8(0x04)
	float *9869b68a1f; // 0xadc(0x04)
	float *f9b2e1f191; // 0xae0(0x04)
	char pad_AE4[0x2c]; // 0xae4(0x2c)
	struct UProgressBar* Pgb_Durability; // 0xb10(0x08)

	void OnInputAReleased(); // Function TslGame.*3ceeab2126.OnInputAReleased // None // @ game+0x55c2bc0
	void OnInputLThumbPressed(); // Function TslGame.*3ceeab2126.OnInputLThumbPressed // None // @ game+0x55c2be8
	void OnInputXReleased(); // Function TslGame.*3ceeab2126.OnInputXReleased // None // @ game+0x55c2c48
	void OnInputLThumbReleased(); // Function TslGame.*3ceeab2126.OnInputLThumbReleased // None // @ game+0x55c2bfc
	void FocusState(); // Function TslGame.*3ceeab2126.FocusState // None // @ game+0x26a108
	void OnInputYPressed(); // Function TslGame.*3ceeab2126.OnInputYPressed // None // @ game+0x55c2c5c
	void OnInputYReleased(); // Function TslGame.*3ceeab2126.OnInputYReleased // None // @ game+0x55c2c70
	void NormalState(); // Function TslGame.*3ceeab2126.NormalState // None // @ game+0x26a108
	void SelfputState(); // Function TslGame.*3ceeab2126.SelfputState // None // @ game+0x26a108
	void *081acfbf64(); // Function TslGame.*3ceeab2126.*081acfbf64 // None // @ game+0x55c2c14
	void OnInputXPressed(); // Function TslGame.*3ceeab2126.OnInputXPressed // None // @ game+0x55c2c34
	void OnInputAPressed(); // Function TslGame.*3ceeab2126.OnInputAPressed // None // @ game+0x55c2bac
	void LinkState(); // Function TslGame.*3ceeab2126.LinkState // None // @ game+0x26a108
	void OnInputBPressed(); // Function TslGame.*3ceeab2126.OnInputBPressed // None // @ game+0x55c2bd4
};

// Class TslGame.*60cae070bc
// Size: 0xb10 (Inherited: 0xab0)
struct U*60cae070bc : U*1a5524e277 {
	struct UBorder* HoverBorder; // 0xab0(0x08)
	struct UWidget* CapacityLayer; // 0xab8(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xac0(0x08)
	struct UTextBlock* MaxCapacityText; // 0xac8(0x08)
	struct FLinearColor TrunkDragEnterColor; // 0xad0(0x10)
	struct FLinearColor TrunkDragLeaveColor; // 0xae0(0x10)
	struct FLinearColor TrunkEmptyTextColor; // 0xaf0(0x10)
	struct UTexture2D* emptytexture; // 0xb00(0x08)
	char pad_B08[0x8]; // 0xb08(0x08)
};

// Class TslGame.*7960d7ce69
// Size: 0xb58 (Inherited: 0xb18)
struct U*7960d7ce69 : U*3ceeab2126 {
	struct UVerticalBox* CategoryAndCapacityBox; // 0xb18(0x08)
	struct UImage* Img_IconBg; // 0xb20(0x08)
	struct UGridPanel* IconGrp; // 0xb28(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xb30(0x08)
	struct UTextBlock* MaxCapacityText; // 0xb38(0x08)
	struct FLinearColor TrunkEmptyTextColor; // 0xb40(0x10)
	char pad_B50[0x8]; // 0xb50(0x08)
};

// Class TslGame.*02ed43dafb
// Size: 0x488 (Inherited: 0x410)
struct U*02ed43dafb : U*17234a7c9b {
	struct F*eaae7901d4 KeysPanel_Binder; // 0x410(0x20)
	struct FKey CtrlUnrealKey; // 0x430(0x18)
	struct FKey AltUnrealKey; // 0x448(0x18)
	struct FKey ShiftUnrealKey; // 0x460(0x18)
	struct TArray<struct U*699e83eed1*> *f44a30b4b2; // 0x478(0x10)
};

// Class TslGame.*067391b601
// Size: 0x478 (Inherited: 0x410)
struct U*067391b601 : U*17234a7c9b {
	struct F*f4f57b85a2 DescriptionTextBlock_Binder; // 0x410(0x20)
	struct F*8e32972a91 KeyImageHorizontalBox; // 0x430(0x28)
	struct F*f4f57b85a2 DebugTextBlock_Binder; // 0x458(0x20)
};

// Class TslGame.TslKeyHintContentWidget
// Size: 0x520 (Inherited: 0x410)
struct UTslKeyHintContentWidget : U*17234a7c9b {
	struct UClass* KeyImageWidgetClass; // 0x410(0x08)
	struct FMargin KeyIconPadding; // 0x418(0x10)
	float KeyIconDesiredHeight; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UHorizontalBox* KeyImagePanel; // 0x430(0x08)
	struct UTextBlock* InputModeText; // 0x438(0x08)
	struct U*0399764a34* DisplayNameFlowText; // 0x440(0x08)
	struct TArray<struct U*57d9afb849*> *6a65529fe8; // 0x448(0x10)
	struct F*785b71047d *6aaa469bf1; // 0x458(0xb0)
	char pad_508[0x18]; // 0x508(0x18)
};

// Class TslGame.*55cc1827d6
// Size: 0x558 (Inherited: 0x520)
struct U*55cc1827d6 : UTslKeyHintContentWidget {
	struct UTexture2D* *57473cfd76; // 0x520(0x08)
	struct FText *e3f53d4a78; // 0x528(0x18)
	struct FText *0f61a473be; // 0x540(0x18)
};

// Class TslGame.*099f45a76a
// Size: 0x558 (Inherited: 0x520)
struct U*099f45a76a : UTslKeyHintContentWidget {
	struct FName DummyActionName_Aim; // 0x520(0x08)
	struct FName DummyActionName_ADS; // 0x528(0x08)
	struct FName ActionName_Targeting; // 0x530(0x08)
	struct FName ActionName_Aim; // 0x538(0x08)
	struct FText HoldText; // 0x540(0x18)
};

// Class TslGame.*d6871feba4
// Size: 0x520 (Inherited: 0x520)
struct U*d6871feba4 : UTslKeyHintContentWidget {
	struct UClass* KeyImageWidgetClass; // 0x410(0x08)
	struct FMargin KeyIconPadding; // 0x418(0x10)
	float KeyIconDesiredHeight; // 0x428(0x04)
	struct UHorizontalBox* KeyImagePanel; // 0x430(0x08)
	struct UTextBlock* InputModeText; // 0x438(0x08)
	struct U*0399764a34* DisplayNameFlowText; // 0x440(0x08)
	struct TArray<struct U*57d9afb849*> *6a65529fe8; // 0x448(0x10)
	struct F*785b71047d *6aaa469bf1; // 0x458(0xb0)
};

// Class TslGame.*84ef0ad364
// Size: 0x460 (Inherited: 0x410)
struct U*84ef0ad364 : U*17234a7c9b {
	enum class EKeyHintType KeyHintType; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct UClass* *e9152af020; // 0x418(0x08)
	struct F*7f3debddd2 *d86c940fe7; // 0x420(0x20)
	struct F*e9e2558d2e *efefe09fac; // 0x440(0x20)
};

// Class TslGame.*da4c2d1769
// Size: 0x4b8 (Inherited: 0x410)
struct U*da4c2d1769 : U*17234a7c9b {
	struct UDataTable* KeyHintDataTable; // 0x410(0x08)
	struct UDataTable* KeyHintInfoDataTable; // 0x418(0x08)
	struct UDataTable* KeyHintTableCheckerSetDataTable; // 0x420(0x08)
	struct UClass* ContentWidgetClass; // 0x428(0x08)
	struct FMargin KeyHintContentPadding; // 0x430(0x10)
	struct TArray<struct FName> DisabledGameModes; // 0x440(0x10)
	struct UVerticalBox* PanelA; // 0x450(0x08)
	struct UVerticalBox* PanelB; // 0x458(0x08)
	struct UInvalidationBox* InvalidationBox; // 0x460(0x08)
	struct U*6b11b3bf02* AnimationOnChangeHint; // 0x468(0x08)
	struct TArray<struct F*2e5b6fb73f> *2c215b6a79; // 0x470(0x10)
	char pad_480[0x10]; // 0x480(0x10)
	struct TArray<struct UTslKeyHintContentWidget*> *aba4460063; // 0x490(0x10)
	char pad_4A0[0x18]; // 0x4a0(0x18)

	void UpdateSelfPosition(); // Function TslGame.*da4c2d1769.UpdateSelfPosition // None // @ game+0xc7bf68
	void OnNotifyUpdateKeyHint(); // Function TslGame.*da4c2d1769.OnNotifyUpdateKeyHint // None // @ game+0xb002bc
	void OnGameUserSettingApplied(); // Function TslGame.*da4c2d1769.OnGameUserSettingApplied // None // @ game+0x55c17c8
};

// Class TslGame.*7325c051a5
// Size: 0x4b8 (Inherited: 0x4b8)
struct U*7325c051a5 : U*da4c2d1769 {
	struct UDataTable* KeyHintDataTable; // 0x410(0x08)
	struct UDataTable* KeyHintInfoDataTable; // 0x418(0x08)
	struct UDataTable* KeyHintTableCheckerSetDataTable; // 0x420(0x08)
	struct UClass* ContentWidgetClass; // 0x428(0x08)
	struct FMargin KeyHintContentPadding; // 0x430(0x10)
	struct TArray<struct FName> DisabledGameModes; // 0x440(0x10)
	struct UVerticalBox* PanelA; // 0x450(0x08)
	struct UVerticalBox* PanelB; // 0x458(0x08)
	struct UInvalidationBox* InvalidationBox; // 0x460(0x08)
	struct U*6b11b3bf02* AnimationOnChangeHint; // 0x468(0x08)
	struct TArray<struct F*2e5b6fb73f> *2c215b6a79; // 0x470(0x10)
	struct TArray<struct UTslKeyHintContentWidget*> *aba4460063; // 0x490(0x10)

	void UpdateSelfPosition(); // Function TslGame.*da4c2d1769.UpdateSelfPosition // None // @ game+0xc7bf68
	void OnNotifyUpdateKeyHint(); // Function TslGame.*da4c2d1769.OnNotifyUpdateKeyHint // None // @ game+0xb002bc
	void OnGameUserSettingApplied(); // Function TslGame.*da4c2d1769.OnGameUserSettingApplied // None // @ game+0x55c17c8
};

// Class TslGame.*088ff0e3e3
// Size: 0x4b8 (Inherited: 0x4b8)
struct U*088ff0e3e3 : U*da4c2d1769 {
	struct UDataTable* KeyHintDataTable; // 0x410(0x08)
	struct UDataTable* KeyHintInfoDataTable; // 0x418(0x08)
	struct UDataTable* KeyHintTableCheckerSetDataTable; // 0x420(0x08)
	struct UClass* ContentWidgetClass; // 0x428(0x08)
	struct FMargin KeyHintContentPadding; // 0x430(0x10)
	struct TArray<struct FName> DisabledGameModes; // 0x440(0x10)
	struct UVerticalBox* PanelA; // 0x450(0x08)
	struct UVerticalBox* PanelB; // 0x458(0x08)
	struct UInvalidationBox* InvalidationBox; // 0x460(0x08)
	struct U*6b11b3bf02* AnimationOnChangeHint; // 0x468(0x08)
	struct TArray<struct F*2e5b6fb73f> *2c215b6a79; // 0x470(0x10)
	struct TArray<struct UTslKeyHintContentWidget*> *aba4460063; // 0x490(0x10)

	void UpdateSelfPosition(); // Function TslGame.*da4c2d1769.UpdateSelfPosition // None // @ game+0xc7bf68
	void OnNotifyUpdateKeyHint(); // Function TslGame.*da4c2d1769.OnNotifyUpdateKeyHint // None // @ game+0xb002bc
	void OnGameUserSettingApplied(); // Function TslGame.*da4c2d1769.OnGameUserSettingApplied // None // @ game+0x55c17c8
};

// Class TslGame.*658d907c9b
// Size: 0x438 (Inherited: 0x410)
struct U*658d907c9b : U*17234a7c9b {
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x410(0x08)
	struct USizeBox* KeyHint_SizeBox; // 0x418(0x08)
	float *8a605fe6c0; // 0x420(0x04)
	float *60f40d652e; // 0x424(0x04)
	float *cbc4c97a32; // 0x428(0x04)
	char pad_42C[0xc]; // 0x42c(0x0c)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*658d907c9b.UpdatePositionOnMinimapExtended // None // @ game+0x55d1480
};

// Class TslGame.*94942e2434
// Size: 0x448 (Inherited: 0x438)
struct U*94942e2434 : U*658d907c9b {
	struct FName ActionName; // 0x438(0x08)
	struct U*1d68794586* KeyImage; // 0x440(0x08)

	void UpdateKeyImage(); // Function TslGame.*94942e2434.UpdateKeyImage // None // @ game+0x55d11dc
};

// Class TslGame.*86f8751b28
// Size: 0x490 (Inherited: 0x438)
struct U*86f8751b28 : U*658d907c9b {
	struct UVerticalBox* KeyHint_VerticalBox_Console; // 0x438(0x08)
	struct UVerticalBox* KeyHint_VerticalBox_Pc; // 0x440(0x08)
	struct TArray<struct F*a8a1f174f7> *4f94260d45; // 0x448(0x10)
	struct TArray<struct F*a8a1f174f7> *c7e191d455; // 0x458(0x10)
	char pad_468[0x28]; // 0x468(0x28)
};

// Class TslGame.*c9978a9b7d
// Size: 0x4a0 (Inherited: 0x490)
struct U*c9978a9b7d : U*86f8751b28 {
	struct UVerticalBox* KeyHint_VerticalBox_Console; // 0x438(0x08)
	struct UVerticalBox* KeyHint_VerticalBox_Pc; // 0x440(0x08)
	struct TArray<struct F*a8a1f174f7> *4f94260d45; // 0x448(0x10)
	struct TArray<struct F*a8a1f174f7> *c7e191d455; // 0x458(0x10)
};

// Class TslGame.*abd6301c0e
// Size: 0x448 (Inherited: 0x448)
struct U*abd6301c0e : U*94942e2434 {
	struct FName ActionName; // 0x438(0x08)
	struct U*1d68794586* KeyImage; // 0x440(0x08)

	void UpdateKeyImage(); // Function TslGame.*94942e2434.UpdateKeyImage // None // @ game+0x55d11dc
};

// Class TslGame.*4a6fbcfe92
// Size: 0x4b0 (Inherited: 0x410)
struct U*4a6fbcfe92 : U*17234a7c9b {
	struct FMulticastDelegate OnKeyReceived; // 0x410(0x10)
	struct FTslInputKey OriginKey; // 0x420(0x20)
	struct FKey FirstDownKey; // 0x440(0x18)
	struct FTslInputKey CurrentDownKey; // 0x458(0x20)
	struct FTslInputKey LastDownedKey; // 0x478(0x20)
	bool bFocused; // 0x498(0x01)
	bool bEnableInput; // 0x499(0x01)
	bool bIsKeyUp; // 0x49a(0x01)
	bool bAxisInput; // 0x49b(0x01)
	float AxisScale; // 0x49c(0x04)
	struct TArray<struct FKey> MouseButtons; // 0x4a0(0x10)

	void KeyUp(); // Function TslGame.*4a6fbcfe92.KeyUp // None // @ game+0x55beef8
	void GetLastDownedKeyName(); // Function TslGame.*4a6fbcfe92.GetLastDownedKeyName // None // @ game+0x55bd758
	void UpdateKeyDown(); // Function TslGame.*4a6fbcfe92.UpdateKeyDown // None // @ game+0x55d10f8
	void UpdateKeyUp(); // Function TslGame.*4a6fbcfe92.UpdateKeyUp // None // @ game+0x55d11f0
	void IsInputKeyDown(); // Function TslGame.*4a6fbcfe92.IsInputKeyDown // None // @ game+0x55bed50
	void KeyDown(); // Function TslGame.*4a6fbcfe92.KeyDown // None // @ game+0x55bee14
};

// Class TslGame.*699e83eed1
// Size: 0x548 (Inherited: 0x410)
struct U*699e83eed1 : U*17234a7c9b {
	struct FString KeyName; // 0x410(0x10)
	struct FKey MatchingUnrealKey; // 0x420(0x18)
	struct FSlateFontInfo KeyNameFont; // 0x438(0x68)
	enum class EVerticalAlignment KeyNameVerticalAlignment; // 0x4a0(0x01)
	enum class EHorizontalAlignment KeyNameHorizontalAlignment; // 0x4a1(0x01)
	enum class ETextJustify KeyNameJustification; // 0x4a2(0x01)
	char pad_4A3[0x1]; // 0x4a3(0x01)
	float KeyNameWrapTextAt; // 0x4a4(0x04)
	struct FLinearColor NonSelectedBorderColor; // 0x4a8(0x10)
	struct FLinearColor SelectedBorderColor; // 0x4b8(0x10)
	struct FLinearColor NonSelectedTextColor; // 0x4c8(0x10)
	struct FLinearColor SelectedTextColor; // 0x4d8(0x10)
	struct UTexture2D* SelectedKeyBorderImage; // 0x4e8(0x08)
	struct UTexture2D* NonSelectedKeyBorderImage; // 0x4f0(0x08)
	bool bSelected; // 0x4f8(0x01)
	char pad_4F9[0x7]; // 0x4f9(0x07)
	struct F*f4f57b85a2 KeyNameTextBlock_Binder; // 0x500(0x20)
	struct F*d3069d51ff BorderImage_Binder; // 0x520(0x28)

	void SetSelected(); // Function TslGame.*699e83eed1.SetSelected // None // @ game+0x55cee98
	void IsSelected(); // Function TslGame.*699e83eed1.IsSelected // None // @ game+0x55beda4
};

// Class TslGame.*16c81ca009
// Size: 0x480 (Inherited: 0x410)
struct U*16c81ca009 : U*17234a7c9b {
	struct F*7f3debddd2 *fd4be86453; // 0x410(0x20)
	struct F*7f3debddd2 *e57ddaee5c; // 0x430(0x20)
	struct F*f4f57b85a2 *0065785d88; // 0x450(0x20)
	DelegateProperty PopupButtonEvent; // 0x470(0x10)

	void OnClickedNoButtion(); // Function TslGame.*16c81ca009.OnClickedNoButtion // None // @ game+0x55c17f4
	struct FText SetPopupWidget(); // Function TslGame.*16c81ca009.SetPopupWidget // None // @ game+0x55ce938
	void OnClickedYesButton(); // Function TslGame.*16c81ca009.OnClickedYesButton // None // @ game+0x55c185c
};

// Class TslGame.*95503bb60a
// Size: 0x430 (Inherited: 0x410)
struct U*95503bb60a : U*17234a7c9b {
	struct F*e9e2558d2e *992607f2df; // 0x410(0x20)
};

// Class TslGame.*161ca53f4e
// Size: 0x428 (Inherited: 0x410)
struct U*161ca53f4e : U*17234a7c9b {
	float *f7bf85e77d; // 0x410(0x04)
	float *2f7fe07cad; // 0x414(0x04)
	struct U*e866d9cf11* UI_KillMessageTextBorderWidget; // 0x418(0x08)
	struct U*2287bfd708* UI_KillMessageCounterWidget; // 0x420(0x08)
};

// Class TslGame.*2287bfd708
// Size: 0x4e8 (Inherited: 0x410)
struct U*2287bfd708 : U*17234a7c9b {
	struct UBorder* TeamKillBorder; // 0x410(0x08)
	struct UBorder* KillCounterBorder; // 0x418(0x08)
	struct UBorder* AssistCounterBorder; // 0x420(0x08)
	struct UScaleBox* AssistCounterScaleBox; // 0x428(0x08)
	struct UTextBlock* KillCurrentCount; // 0x430(0x08)
	struct UTextBlock* KillNextCount; // 0x438(0x08)
	struct UTextBlock* AssistCurrentCount; // 0x440(0x08)
	struct UTextBlock* AssistNextCount; // 0x448(0x08)
	struct UWidgetSwitcher* KillTextSwitcher; // 0x450(0x08)
	struct UWidgetSwitcher* AssistTextSwitcher; // 0x458(0x08)
	struct U*6b11b3bf02* KillCountUpEffect; // 0x460(0x08)
	struct U*6b11b3bf02* KillCountUpNoEffect; // 0x468(0x08)
	struct U*6b11b3bf02* AssistCountUp; // 0x470(0x08)
	struct U*6b11b3bf02* KillFadeInEffect; // 0x478(0x08)
	struct U*6b11b3bf02* KillFadeInNoEffect; // 0x480(0x08)
	struct U*6b11b3bf02* KillFadeInEffectWithoutAssistAnim; // 0x488(0x08)
	struct U*6b11b3bf02* KillFadeInNoEffectWithoutAssistAnim; // 0x490(0x08)
	struct U*6b11b3bf02* AssistFadeIn; // 0x498(0x08)
	struct U*6b11b3bf02* FadeInit; // 0x4a0(0x08)
	struct U*6b11b3bf02* CountInit; // 0x4a8(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x4b0(0x08)
	float *4a7ae50665; // 0x4b8(0x04)
	struct FVector2D *e7150608ba; // 0x4bc(0x08)
	float *8dc51d1e33; // 0x4c4(0x04)
	struct FVector2D *a66b3eeb91; // 0x4c8(0x08)
	char pad_4D0[0x18]; // 0x4d0(0x18)
};

// Class TslGame.*e882053470
// Size: 0x490 (Inherited: 0x410)
struct U*e882053470 : U*17234a7c9b {
	struct UClass* *27398035fd; // 0x410(0x08)
	struct UClass* *cdab23bdcf; // 0x418(0x08)
	struct F*c233adf9bd *94df7af7e0; // 0x420(0x20)
	struct U*b2c0d49a67* IconOtherKillMessage; // 0x440(0x08)
	struct F*c233adf9bd *cc9f4bb08d; // 0x448(0x20)
	struct U*161ca53f4e* *04a286a806; // 0x468(0x08)
	float *151d5602e1; // 0x470(0x04)
	float *9c1a8b02a9; // 0x474(0x04)
	struct TArray<struct FDeathMessage> *f481c6f2ff; // 0x478(0x10)
	char pad_488[0x8]; // 0x488(0x08)

	void OnDisplayKilledMessage(); // Function TslGame.*e882053470.OnDisplayKilledMessage // None // @ game+0x419c20
	void PushAssistMessage(); // Function TslGame.*e882053470.PushAssistMessage // None // @ game+0x55c86e4
};

// Class TslGame.*b2c0d49a67
// Size: 0x460 (Inherited: 0x410)
struct U*b2c0d49a67 : U*17234a7c9b {
	struct UClass* *43fdb5feba; // 0x410(0x08)
	struct F*f0cac2bec7 *50d4516f31; // 0x418(0x28)
	struct TArray<struct U*f57d00387b*> FreeMessageWidgets; // 0x440(0x10)
	float *35f18330eb; // 0x450(0x04)
	bool *b0ab1e550d; // 0x454(0x01)
	bool *b27181ddd5; // 0x455(0x01)
	char pad_456[0x2]; // 0x456(0x02)
	float *b4a0280363; // 0x458(0x04)
	int32 *d98c93b142; // 0x45c(0x04)

	void SetKillMessageWidgetClass(); // Function TslGame.*b2c0d49a67.SetKillMessageWidgetClass // None // @ game+0x55ce098
	void OnListSizeLimitChange(); // Function TslGame.*b2c0d49a67.OnListSizeLimitChange // None // @ game+0x55c2e98
	void TrimKillMessageWidgetArrayByNumLimit(); // Function TslGame.*b2c0d49a67.TrimKillMessageWidgetArrayByNumLimit // None // @ game+0x55d0748
	void ReserveMessageWidgetPool(); // Function TslGame.*b2c0d49a67.ReserveMessageWidgetPool // None // @ game+0x55c8afc
	void EnqueueDeathMessage(); // Function TslGame.*b2c0d49a67.EnqueueDeathMessage // None // @ game+0x55bcfbc
	void OnVanishFinished(); // Function TslGame.*b2c0d49a67.OnVanishFinished // None // @ game+0xaa9164
};

// Class TslGame.*e866d9cf11
// Size: 0x430 (Inherited: 0x410)
struct U*e866d9cf11 : U*17234a7c9b {
	struct UGridPanel* KillMessageGrid; // 0x410(0x08)
	char pad_418[0x18]; // 0x418(0x18)
};

// Class TslGame.*bfc64df4bb
// Size: 0x4e8 (Inherited: 0x410)
struct U*bfc64df4bb : U*17234a7c9b {
	struct U*6b11b3bf02* FadeInAnim; // 0x410(0x08)
	struct U*6b11b3bf02* Transition1to2; // 0x418(0x08)
	struct U*6b11b3bf02* Transition2to3; // 0x420(0x08)
	struct U*6b11b3bf02* Transition3to4; // 0x428(0x08)
	struct U*6b11b3bf02* Transition4to5; // 0x430(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x438(0x08)
	struct U*6b11b3bf02* InitAnim; // 0x440(0x08)
	struct U*7f757909f6* Player1Platform; // 0x448(0x08)
	struct UTslRichTextBlock* KillMsgBlock; // 0x450(0x08)
	struct U*7f757909f6* Player2Platform; // 0x458(0x08)
	struct UTslRichTextBlock* KillMsgBlock2; // 0x460(0x08)
	struct TMap<struct FName, struct FLinearColor> *9ae4db0c1e; // 0x468(0x50)
	char pad_4B8[0x30]; // 0x4b8(0x30)
};

// Class TslGame.*f57d00387b
// Size: 0x508 (Inherited: 0x410)
struct U*f57d00387b : U*17234a7c9b {
	struct FMulticastDelegate OnVanishFinished; // 0x410(0x10)
	struct TArray<struct F*1e851ff36a> *bad8f23d4d; // 0x420(0x10)
	struct TArray<struct F*170e1e642f> *78def6b55a; // 0x430(0x10)
	struct TArray<struct UTexture*> WeaponMasteryLevelIcons; // 0x440(0x10)
	struct F*c233adf9bd *9c51b14096; // 0x450(0x20)
	struct F*c233adf9bd *2f64c350e7; // 0x470(0x20)
	struct USizeBox* KillMessageSizebox; // 0x490(0x08)
	struct FText PlayZoneText; // 0x498(0x18)
	struct FText RedZoneText; // 0x4b0(0x18)
	struct FText *c37e91c149; // 0x4c8(0x18)
	struct FText *d90021170c; // 0x4e0(0x18)
	char pad_4F8[0x10]; // 0x4f8(0x10)

	void *2036515fcf(); // Function TslGame.*f57d00387b.*2036515fcf // None // @ game+0x55c3b64
	struct UTexture* GetTextureFromConditionOfDeathCategory(); // Function TslGame.*f57d00387b.GetTextureFromConditionOfDeathCategory // None // @ game+0x56c16e8
	void SetFontStyleAndSize(struct FName Param1); // Function TslGame.*f57d00387b.SetFontStyleAndSize // None // @ game+0x56cd4bc
	float GetTextureFromDamageTypeCategory(); // Function TslGame.*f57d00387b.GetTextureFromDamageTypeCategory // None // @ game+0x56c19c8
	void SetVanishTimer(); // Function TslGame.*f57d00387b.SetVanishTimer // None // @ game+0x56ce6f4
	void *e178e6ac76(); // Function TslGame.*f57d00387b.*e178e6ac76 // None // @ game+0x56cfc40
};

// Class TslGame.*87890c32a2
// Size: 0x628 (Inherited: 0x508)
struct U*87890c32a2 : U*f57d00387b {
	struct FLinearColor NormalColor; // 0x508(0x10)
	struct FLinearColor *cdce2918c8; // 0x518(0x10)
	struct FLinearColor *0dd0ad744e; // 0x528(0x10)
	struct FLinearColor *484e917162; // 0x538(0x10)
	struct FLinearColor *8b5d985e37; // 0x548(0x10)
	struct FLinearColor *4005a71970; // 0x558(0x10)
	float *fd2b792e6a; // 0x568(0x04)
	char pad_56C[0x4]; // 0x56c(0x04)
	struct F*1e851ff36a *1da571a641; // 0x570(0x20)
	struct UWidgetSwitcher* BgSwitcher; // 0x590(0x08)
	struct UImage* SkinBgLeft; // 0x598(0x08)
	struct UImage* SkinBgRight; // 0x5a0(0x08)
	struct UTextBlock* KillerNameText; // 0x5a8(0x08)
	struct UTextBlock* VictimNameText; // 0x5b0(0x08)
	struct UImage* CauserImage; // 0x5b8(0x08)
	struct USizeBox* CauserSizeBox; // 0x5c0(0x08)
	struct UImage* WeaponMasteryImage; // 0x5c8(0x08)
	struct USizeBox* WeaponMasterySizeBox; // 0x5d0(0x08)
	struct UImage* HeadShotImage; // 0x5d8(0x08)
	struct USizeBox* HeadShotSizeBox; // 0x5e0(0x08)
	struct UImage* ConditionImage; // 0x5e8(0x08)
	struct USizeBox* ConditionSizeBox; // 0x5f0(0x08)
	struct UImage* SkinBgTint; // 0x5f8(0x08)
	struct TArray<struct UImage*> EffectImages; // 0x600(0x10)
	struct UImage* AdditionalEffect; // 0x610(0x08)
	struct U*f729112f02* KillerIcon; // 0x618(0x08)
	struct U*f729112f02* VictimIcon; // 0x620(0x08)

	void SetMessageColorAndOpacity(); // Function TslGame.*87890c32a2.SetMessageColorAndOpacity // None // @ game+0x55ce504
	void *da7ea4b2db(int32 Param0); // Function TslGame.*87890c32a2.*da7ea4b2db // None // @ game+0x55be368
	void SetLayoutTo(); // Function TslGame.*87890c32a2.SetLayoutTo // None // @ game+0x55ce344
};

// Class TslGame.*8afb294a12
// Size: 0x888 (Inherited: 0x508)
struct U*8afb294a12 : U*f57d00387b {
	struct UTexture* *d48213a5b0; // 0x508(0x08)
	struct UTexture* *0cd2f8496f; // 0x510(0x08)
	struct UTexture* *43b9bf3c44; // 0x518(0x08)
	struct UTexture* *12a8044854; // 0x520(0x08)
	struct FLinearColor *c0bb4a1a53; // 0x528(0x10)
	struct FLinearColor *efdec8e772; // 0x538(0x10)
	struct F*f4f57b85a2 *8aae7e4db6; // 0x548(0x20)
	struct F*f4f57b85a2 *692faf50fc; // 0x568(0x20)
	struct F*f4f57b85a2 *4c609f7329; // 0x588(0x20)
	struct F*f4f57b85a2 *b3d02cc541; // 0x5a8(0x20)
	struct F*f4f57b85a2 *c28c5e268f; // 0x5c8(0x20)
	struct F*f4f57b85a2 *a0a3aa04f3; // 0x5e8(0x20)
	struct F*b9afef7a3a *0608bef893; // 0x608(0x28)
	struct F*d3069d51ff *d8db1a1e8f; // 0x630(0x28)
	struct F*d3069d51ff *b43eac62e1; // 0x658(0x28)
	struct F*d3069d51ff *0f1c591728; // 0x680(0x28)
	struct F*b9afef7a3a *db671e018e; // 0x6a8(0x28)
	struct F*d3069d51ff *653a69a6e1; // 0x6d0(0x28)
	struct F*d3069d51ff *6cd42188a7; // 0x6f8(0x28)
	struct F*d3069d51ff *2b38da6c8b; // 0x720(0x28)
	struct F*d3069d51ff *cf1e068612; // 0x748(0x28)
	struct F*c69f8ed24a *eb81d0366a; // 0x770(0x28)
	struct F*c69f8ed24a *673c1a1adb; // 0x798(0x28)
	struct F*c69f8ed24a *c48df79bf4; // 0x7c0(0x28)
	struct F*d3069d51ff *9bd291eea1; // 0x7e8(0x28)
	struct F*959656208f *8b890b652c; // 0x810(0x30)
	struct F*8e32972a91 *3ef4bd5361; // 0x840(0x28)
	struct F*e9e2558d2e *30d5b8059f; // 0x868(0x20)

	void SetVictimMessageColorAndOpacity(); // Function TslGame.*8afb294a12.SetVictimMessageColorAndOpacity // None // @ game+0x55cf550
	int32 *fc1ffdf68a(); // Function TslGame.*8afb294a12.*fc1ffdf68a // None // @ game+0x55bdf48
	void SetLayoutTo(); // Function TslGame.*8afb294a12.SetLayoutTo // None // @ game+0x55ce3d8
};

// Class TslGame.*6c98a404e3
// Size: 0x488 (Inherited: 0x410)
struct U*6c98a404e3 : U*17234a7c9b {
	struct TMap<enum class ELoadingScreenType, struct UTexture2D*> DefaultBackgroundsByType; // 0x410(0x50)
	struct UDataTable* LoadingScreenImageDataTable; // 0x460(0x08)
	struct UTexture2D* *355e051280; // 0x468(0x20)

	void OnUpdate(struct FText Description); // Function TslGame.*6c98a404e3.OnUpdate // None // @ game+0x26a108
};

// Class TslGame.*fae9ecea58
// Size: 0x420 (Inherited: 0x410)
struct U*fae9ecea58 : U*17234a7c9b {
	struct USizeBox* LoadingSpinnerSizeBox; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)

	void ShowSpinner(); // Function TslGame.*fae9ecea58.ShowSpinner // None // @ game+0x55cfc58
};

// Class TslGame.*0c3942b94c
// Size: 0x458 (Inherited: 0x410)
struct U*0c3942b94c : U*17234a7c9b {
	struct UClass* LobbyNameNameTagWidgetClass; // 0x410(0x08)
	struct F*f23e4e6c9e *0ea70e2b09; // 0x418(0x28)
	bool bUseNameTagOffsetTranslations; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct TArray<struct FVector> NameTagOffsetTranslations; // 0x448(0x10)

	void UpdateNameTagWidget_Internal(); // Function TslGame.*0c3942b94c.UpdateNameTagWidget_Internal // None // @ game+0x55d12fc
	void GetNameTagWidget_Internal(int32 SlotIndex); // Function TslGame.*0c3942b94c.GetNameTagWidget_Internal // None // @ game+0x55bd964
	void SetNameTagWidget_Internal(); // Function TslGame.*0c3942b94c.SetNameTagWidget_Internal // None // @ game+0x55ce5b0
	void ResetNameTagWidget_Internal(); // Function TslGame.*0c3942b94c.ResetNameTagWidget_Internal // None // @ game+0x55c8d3c
};

// Class TslGame.*535e5949ee
// Size: 0x4c0 (Inherited: 0x410)
struct U*535e5949ee : U*17234a7c9b {
	struct UTextBlock* NickNameText; // 0x410(0x08)
	struct U*7f757909f6* UserPlatformImageWidget; // 0x418(0x08)
	struct U*d6fbd75522* RankEmblemWidget; // 0x420(0x08)
	struct UWidgetSwitcher* VoiceSwitcher; // 0x428(0x08)
	struct USizeBox* VoiceSizeBox; // 0x430(0x08)
	struct USizeBox* HostSizeBox; // 0x438(0x08)
	struct USizeBox* SizeBoxForStatus; // 0x440(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x448(0x08)
	struct USizeBox* SizeBoxForMiddle; // 0x450(0x08)
	struct U*aa6e1909ad* Clanplate; // 0x458(0x08)
	bool *89aa0ac919; // 0x460(0x01)
	bool bHideIfAlone; // 0x461(0x01)
	bool bHideStateIconIfAlone; // 0x462(0x01)
	bool bHideIdleStateIcon; // 0x463(0x01)
	struct FVector RankNameTagOffsetTranslations; // 0x464(0x0c)
	char pad_470[0x4]; // 0x470(0x04)
	int32 SlotIndex; // 0x474(0x04)
	struct FName NameTagSocketName; // 0x478(0x08)
	struct FVector NameTagOffsetTranslation; // 0x480(0x0c)
	bool bIsHost; // 0x48c(0x01)
	bool bIsReady; // 0x48d(0x01)
	bool bIsSpeaking; // 0x48e(0x01)
	bool bIsLogout; // 0x48f(0x01)
	struct FString Nickname; // 0x490(0x10)
	struct FString ClanTag; // 0x4a0(0x10)
	struct FString ClanplateId; // 0x4b0(0x10)

	void SetNickNameAndClanTag(struct FString InNickName); // Function TslGame.*535e5949ee.SetNickNameAndClanTag // None // @ game+0x55ce640
	void SetSpeaking(); // Function TslGame.*535e5949ee.SetSpeaking // None // @ game+0x55cf1d0
	bool OnVoiceChatUpdated(); // Function TslGame.*535e5949ee.OnVoiceChatUpdated // None // @ game+0x55c761c
	void *6ce341e425(); // Function TslGame.*535e5949ee.*6ce341e425 // None // @ game+0x55bec24
	void UpdateWidgetSwitchers(); // Function TslGame.*535e5949ee.UpdateWidgetSwitchers // None // @ game+0x55d1dbc
	void SetRankEmblem(); // Function TslGame.*535e5949ee.SetRankEmblem // None // @ game+0x55cec50
	void SetReady(); // Function TslGame.*535e5949ee.SetReady // None // @ game+0xbecf1c
	void SetOffsetTranslation(); // Function TslGame.*535e5949ee.SetOffsetTranslation // None // @ game+0x55ce800
	void UpdateNickNameAndClanName(); // Function TslGame.*535e5949ee.UpdateNickNameAndClanName // None // @ game+0x55d138c
	void OnParticipantMuteChanged(struct FString Param1); // Function TslGame.*535e5949ee.OnParticipantMuteChanged // None // @ game+0x55c465c
	void UpdateWidgetsVisibilities(); // Function TslGame.*535e5949ee.UpdateWidgetsVisibilities // None // @ game+0x55d1dd0
	void SetBinding(); // Function TslGame.*535e5949ee.SetBinding // None // @ game+0x55cda64
	void OnTeamVoiceChannelLeave(); // Function TslGame.*535e5949ee.OnTeamVoiceChannelLeave // None // @ game+0x55c6290
	void SetNameTagProps(); // Function TslGame.*535e5949ee.SetNameTagProps // None // @ game+0x55ce59c
	struct FString InitWidget(enum class ERankType InRankType); // Function TslGame.*535e5949ee.InitWidget // None // @ game+0x55be8c4
	void SetPlatformIcon(); // Function TslGame.*535e5949ee.SetPlatformIcon // None // @ game+0x55ce8a8
	void SetHost(); // Function TslGame.*535e5949ee.SetHost // None // @ game+0xcaf4f4
};

// Class TslGame.*c28537c7d6
// Size: 0x420 (Inherited: 0x410)
struct U*c28537c7d6 : U*17234a7c9b {
	struct UImage* ImageTowerBind; // 0x410(0x08)
	enum class ETslMapMarkerTowerState *4ea4e1e26c; // 0x418(0x01)
	bool *5d3dadfdc7; // 0x419(0x01)
	char pad_41A[0x6]; // 0x41a(0x06)
};

// Class TslGame.*7ef495f1a9
// Size: 0x608 (Inherited: 0x410)
struct U*7ef495f1a9 : U*17234a7c9b {
	struct FSlateColor *1d8f1592be; // 0x410(0x28)
	struct FSlateFontInfo *1eeece612e; // 0x438(0x68)
	struct FSlateColor *9e85eaaefd; // 0x4a0(0x28)
	struct FSlateColor *c7650a4c1c; // 0x4c8(0x28)
	struct FSlateFontInfo *9bad433d4e; // 0x4f0(0x68)
	struct FSlateColor *4ee483cdf2; // 0x558(0x28)
	struct FSlateColor *ae71d3adf2; // 0x580(0x28)
	struct FSlateColor *c352b3140b; // 0x5a8(0x28)
	struct UTextBlock* TimestampTextBlock; // 0x5d0(0x08)
	struct U*7f757909f6* PlatformImageWidget; // 0x5d8(0x08)
	struct UTslRichTextBlock* MessageTextBlock; // 0x5e0(0x08)
	struct U*7f757909f6* PlatformImageWidget2; // 0x5e8(0x08)
	struct UTslRichTextBlock* MessageTextBlock2; // 0x5f0(0x08)
	struct UImage* HighlightImage; // 0x5f8(0x08)
	struct USizeBox* MatchLogContentSizeBox; // 0x600(0x08)

	struct FMatchLog Update(); // Function TslGame.*7ef495f1a9.Update // None // @ game+0x55d09f4
};

// Class TslGame.*80a87b9639
// Size: 0x4a0 (Inherited: 0x410)
struct U*80a87b9639 : U*17234a7c9b {
	struct UClass* *4fa7de7070; // 0x410(0x08)
	float *71d3d71b5c; // 0x418(0x04)
	int32 *fd0fea3b99; // 0x41c(0x04)
	struct U*f94da2b1a6* TabSelectorWidget; // 0x420(0x08)
	struct UScrollBox* ContentsScrollBox; // 0x428(0x08)
	struct U*f50ba61dee* GamepadScrollGuideKeyIcon; // 0x430(0x08)
	struct UButton* BackButton; // 0x438(0x08)
	struct USpacer* TopSpacer; // 0x440(0x08)
	struct USpacer* BottomSpacer; // 0x448(0x08)
	struct UVerticalBox* LogVerticalBox; // 0x450(0x08)
	struct UTextBlock* NoMatchLogTextBlock; // 0x458(0x08)
	struct TArray<struct FMatchLog> *7f8e8a2497; // 0x460(0x10)
	enum class EMatchLogTab CurrentTab; // 0x470(0x01)
	bool *0db29c7677; // 0x471(0x01)
	bool *6c896b87ae; // 0x472(0x01)
	char pad_473[0x5]; // 0x473(0x05)
	struct TArray<struct U*7ef495f1a9*> *30b44981f1; // 0x478(0x10)
	struct TArray<bool> *ce54efd2e8; // 0x488(0x10)
	float *db37179e5f; // 0x498(0x04)
	float *e7859dac0c; // 0x49c(0x04)

	void HandleScroll(); // Function TslGame.*80a87b9639.HandleScroll // None // @ game+0x55be6ac
	void HandleQuickScrollingDown(); // Function TslGame.*80a87b9639.HandleQuickScrollingDown // None // @ game+0x55be65c
	void HandleRotateTabRight(); // Function TslGame.*80a87b9639.HandleRotateTabRight // None // @ game+0x55be698
	void HandleQuickScrollingUp(); // Function TslGame.*80a87b9639.HandleQuickScrollingUp // None // @ game+0x55be670
	void HandleRotateTabLeft(); // Function TslGame.*80a87b9639.HandleRotateTabLeft // None // @ game+0x55be684
	void HandleTabRotated(); // Function TslGame.*80a87b9639.HandleTabRotated // None // @ game+0x55be744
	void HandleNewMatchLogAdded(); // Function TslGame.*80a87b9639.HandleNewMatchLogAdded // None // @ game+0x55be4d4
	void HandleBackButtonClicked(); // Function TslGame.*80a87b9639.HandleBackButtonClicked // None // @ game+0x55be42c
};

// Class TslGame.*48e392ad61
// Size: 0x468 (Inherited: 0x410)
struct U*48e392ad61 : U*17234a7c9b {
	char pad_410[0x18]; // 0x410(0x18)
	struct F*f4f57b85a2 *36019e73ed; // 0x428(0x20)
	struct F*f4f57b85a2 *7393179105; // 0x448(0x20)
};

// Class TslGame.*5f1937f5a5
// Size: 0x540 (Inherited: 0x410)
struct U*5f1937f5a5 : U*17234a7c9b {
	struct UClass* PlayerInfoWidgetTemplate; // 0x410(0x08)
	struct F*f0cac2bec7 *6fe73dfffd; // 0x418(0x28)
	struct F*f4f57b85a2 *448bfde1b4; // 0x440(0x20)
	struct F*f4f57b85a2 *da19dd6d29; // 0x460(0x20)
	struct F*f4f57b85a2 *d1ca933e0a; // 0x480(0x20)
	struct F*f4f57b85a2 *31fc0b47d5; // 0x4a0(0x20)
	struct F*c233adf9bd *92952c6f44; // 0x4c0(0x20)
	struct F*e9e2558d2e *61c7751f6e; // 0x4e0(0x20)
	struct F*e9e2558d2e *d232fdb0e1; // 0x500(0x20)
	char pad_520[0x8]; // 0x520(0x08)
	struct TArray<struct U*48e392ad61*> *5023ba779c; // 0x528(0x10)
	char pad_538[0x8]; // 0x538(0x08)

	void *5d0cf72b73(); // Function TslGame.*5f1937f5a5.*5d0cf72b73 // None // @ game+0x55c6114
};

// Class TslGame.TslMediaPlayerWidget
// Size: 0x458 (Inherited: 0x410)
struct UTslMediaPlayerWidget : U*17234a7c9b {
	char pad_410[0x8]; // 0x410(0x08)
	struct UMediaPlayer* MediaPlayer; // 0x418(0x08)
	struct UPlatformMediaSource* *1b7950d6f1; // 0x420(0x08)
	struct UAkAudioEvent* *b29c99b8c4; // 0x428(0x08)
	struct UAkAudioEvent* *bc48a0fdc4; // 0x430(0x08)
	bool *d066ac3489; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct USizeBox* VideoSizeBox; // 0x440(0x08)
	struct UAkComponent* *292d220d36; // 0x448(0x08)
	char pad_450[0x8]; // 0x450(0x08)

	void OnVideoEnded(); // Function TslGame.TslMediaPlayerWidget.OnVideoEnded // None // @ game+0x55c7370
	void OnSkipVideoPressed(); // Function TslGame.TslMediaPlayerWidget.OnSkipVideoPressed // None // @ game+0x55c5d1c
};

// Class TslGame.*50335ff38b
// Size: 0x560 (Inherited: 0x410)
struct U*50335ff38b : U*17234a7c9b {
	struct TArray<struct F*917ae4cb1d> *8a8ed22b9b; // 0x410(0x10)
	struct F*7f3debddd2 *ed1bdbd972; // 0x420(0x20)
	struct F*7f3debddd2 *b69ee6fe99; // 0x440(0x20)
	struct F*7f3debddd2 *19e2d5869f; // 0x460(0x20)
	struct F*7f3debddd2 *47e2f58ca2; // 0x480(0x20)
	struct F*7f3debddd2 *aaf7483055; // 0x4a0(0x20)
	struct F*7f3debddd2 *7acb17765b; // 0x4c0(0x20)
	struct F*7f3debddd2 *dd3baa2582; // 0x4e0(0x20)
	struct F*7f3debddd2 *aae085c021; // 0x500(0x20)
	struct F*7f3debddd2 *fe43ec2c9a; // 0x520(0x20)
	struct U*bde5e52cf2* PubgIdWidget; // 0x540(0x08)
	float PubgIdLifeTime; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UStringTable* UIStringTable; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)

	void *be8ce40810(); // Function TslGame.*50335ff38b.*be8ce40810 // None // @ game+0x55bc8fc
	void UpdatePubgIdWidgetWithKiller(); // Function TslGame.*50335ff38b.UpdatePubgIdWidgetWithKiller // None // @ game+0x55d14bc
	struct U*066fd6c9ca* *de806cb6de(); // Function TslGame.*50335ff38b.*de806cb6de // None // @ game+0x55c860c
	void OnDisplayVoiceChannelStateMessage(); // Function TslGame.*50335ff38b.OnDisplayVoiceChannelStateMessage // None // @ game+0x55c2040
	void CreateVoiceChannelStateMessage(); // Function TslGame.*50335ff38b.CreateVoiceChannelStateMessage // None // @ game+0x26a108
	float OnDisplayMessage(enum class ESystemMessageType Param0); // Function TslGame.*50335ff38b.OnDisplayMessage // None // @ game+0xa19560
	void *9312fbddf8(); // Function TslGame.*50335ff38b.*9312fbddf8 // None // @ game+0x55c2f80
	int32 *bab7fb96d8(int32 Param1); // Function TslGame.*50335ff38b.*bab7fb96d8 // None // @ game+0x55c1ecc
	void *94627bcb5a(); // Function TslGame.*50335ff38b.*94627bcb5a // None // @ game+0x55beb68
	int32 *f1ef2124f0(); // Function TslGame.*50335ff38b.*f1ef2124f0 // None // @ game+0x55bdfe8
	struct UImage* *3e159737e2(); // Function TslGame.*50335ff38b.*3e159737e2 // None // @ game+0x55bc7f0
	void CreateSystemMessage(float Duration); // Function TslGame.*50335ff38b.CreateSystemMessage // None // @ game+0x26a108
	void HidePubgIdWidget(); // Function TslGame.*50335ff38b.HidePubgIdWidget // None // @ game+0x55be89c
	struct TArray<struct F*917ae4cb1d> *957f30d941(); // Function TslGame.*50335ff38b.*957f30d941 // None // @ game+0x55c8998
	void CreateGamePlayMessage(struct FText Message, struct UAkAudioEvent* Sound); // Function TslGame.*50335ff38b.CreateGamePlayMessage // None // @ game+0x26a108
};

// Class TslGame.*9d796cb601
// Size: 0x450 (Inherited: 0x410)
struct U*9d796cb601 : U*17234a7c9b {
	struct FString Name; // 0x410(0x10)
	int32 Level; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct FString EmblemId; // 0x428(0x10)
	struct FString NameplateId; // 0x438(0x10)
	enum class EOutGamePlatformProvider Platform; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
};

// Class TslGame.*6e13359b6c
// Size: 0x5a8 (Inherited: 0x410)
struct U*6e13359b6c : U*17234a7c9b {
	char pad_410[0x8]; // 0x410(0x08)
	struct F*f0cac2bec7 MissionItemVerticalBox_Binder; // 0x418(0x28)
	struct F*f4f57b85a2 MissionGroupText_Binder; // 0x440(0x20)
	struct F*d3069d51ff ProgressImage_Binder; // 0x460(0x28)
	struct F*f4f57b85a2 ProgressText_Binder; // 0x488(0x20)
	struct F*e9e2558d2e LockWidgetAnimation_Binder; // 0x4a8(0x20)
	struct F*959656208f LockBorder_Binder; // 0x4c8(0x30)
	struct F*959656208f ButtonBorder_Binder; // 0x4f8(0x30)
	struct F*d3069d51ff ExpandImage_Binder; // 0x528(0x28)
	struct F*0d3e7cd17a WidgetBody_Binder; // 0x550(0x28)
	struct UTexture2D* ExpandTexture; // 0x578(0x08)
	struct UTexture2D* CollapsTexture; // 0x580(0x08)
	char pad_588[0x8]; // 0x588(0x08)
	struct U*8f410eb7f2* *431fc9005b; // 0x590(0x08)
	struct FMulticastDelegate OnExpanded; // 0x598(0x10)

	void *d85ee6ef8e(); // Function TslGame.*6e13359b6c.*d85ee6ef8e // None // @ game+0x55bd89c
	void NotifyWidgetInputA(); // Function TslGame.*6e13359b6c.NotifyWidgetInputA // None // @ game+0x55c06a0
	void UpdateDesign_Normal(); // Function TslGame.*6e13359b6c.UpdateDesign_Normal // None // @ game+0x26a108
	void UpdateDesign_Focused(); // Function TslGame.*6e13359b6c.UpdateDesign_Focused // None // @ game+0x26a108
	void OnButtonDown(struct FGeometry Param0); // Function TslGame.*6e13359b6c.OnButtonDown // None // @ game+0x55c1148
	void *94cb81208c(); // Function TslGame.*6e13359b6c.*94cb81208c // None // @ game+0x55bd8c8
};

// Class TslGame.*f7e6e1d954
// Size: 0x560 (Inherited: 0x410)
struct U*f7e6e1d954 : U*17234a7c9b {
	char pad_410[0x10]; // 0x410(0x10)
	struct UTextBlock* DescriptionText; // 0x420(0x08)
	struct UTextBlock* ProgressText; // 0x428(0x08)
	struct UImage* IconImage; // 0x430(0x08)
	struct UImage* StateImage; // 0x438(0x08)
	struct UImage* ProgressBarImage; // 0x440(0x08)
	struct UBorder* InfoBorder; // 0x448(0x08)
	struct UBorder* ProgressBarBorder; // 0x450(0x08)
	struct UBorder* MissionListBorder; // 0x458(0x08)
	struct TMap<struct FString, struct UTexture2D*> MissionIcons; // 0x460(0x50)
	struct UTexture2D* DefaultMissionIcon; // 0x4b0(0x08)
	struct UTexture2D* LockTexture; // 0x4b8(0x08)
	struct UTexture2D* CompleteTexture; // 0x4c0(0x08)
	float InactiveIconAlpha; // 0x4c8(0x04)
	float ActiveIconAlpha; // 0x4cc(0x04)
	float InactiveTextAlpha; // 0x4d0(0x04)
	float InactiveProgressBarBorderAlpha; // 0x4d4(0x04)
	int32 FontSizeForPC; // 0x4d8(0x04)
	int32 FontSizeForConsole; // 0x4dc(0x04)
	struct FLinearColor ActiveInfoBorderColor; // 0x4e0(0x10)
	struct FLinearColor AchievedInfoBorderColor; // 0x4f0(0x10)
	struct FLinearColor ActiveMissionBorderColor; // 0x500(0x10)
	struct FLinearColor AchievedMissionBorderColor; // 0x510(0x10)
	struct FName ScalarParamNameFirstEnd; // 0x520(0x08)
	struct FName ScalarParamNameSecondEnd; // 0x528(0x08)
	struct FString MissionId; // 0x530(0x10)
	struct FString MissionType; // 0x540(0x10)
	char pad_550[0x8]; // 0x550(0x08)
	struct U*8f410eb7f2* *431fc9005b; // 0x558(0x08)

	void UpdateDesign_Normal(); // Function TslGame.*f7e6e1d954.UpdateDesign_Normal // None // @ game+0x26a108
	void UpdateDesign_Focused(); // Function TslGame.*f7e6e1d954.UpdateDesign_Focused // None // @ game+0x26a108
};

// Class TslGame.*dd77d9bfc8
// Size: 0x468 (Inherited: 0x410)
struct U*dd77d9bfc8 : U*17234a7c9b {
	struct F*eaae7901d4 KeysPanel_Binder; // 0x410(0x20)
	struct F*d3069d51ff MiddleMouseButton_Binder; // 0x430(0x28)
	struct TArray<struct FString> MiddleMouseButtonActionsOrAxies; // 0x458(0x10)
};

// Class TslGame.*e3367663b9
// Size: 0x4a8 (Inherited: 0x410)
struct U*e3367663b9 : U*17234a7c9b {
	struct F*d3069d51ff *ba1084862b; // 0x410(0x28)
	struct F*f4f57b85a2 *e7b5e06f52; // 0x438(0x20)
	struct F*f23e4e6c9e *4a660d1b71; // 0x458(0x28)
	struct FVector2D *9a8b0ac41d; // 0x480(0x08)
	struct UMaterialInstanceDynamic* *9dde375ff2; // 0x488(0x08)
	struct U*2679a92f7f* CastingBarInfoText; // 0x490(0x08)
	char pad_498[0x10]; // 0x498(0x10)
};

// Class TslGame.*066fd6c9ca
// Size: 0x4f0 (Inherited: 0x410)
struct U*066fd6c9ca : U*17234a7c9b {
	enum class EVerticalAlignment *52f9deefe3; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	int32 *7a7ab2e01e; // 0x414(0x04)
	bool *be97afb0d5; // 0x418(0x01)
	bool *2604610b3b; // 0x419(0x01)
	char pad_41A[0x6]; // 0x41a(0x06)
	struct UCurveFloat* *3bf762738d; // 0x420(0x08)
	struct FVector2D BorderSize; // 0x428(0x08)
	bool *ea416c6b93; // 0x430(0x01)
	bool *63b7e64bed; // 0x431(0x01)
	char pad_432[0x6]; // 0x432(0x06)
	struct TArray<struct U*609efafa5b*> *53d744ab50; // 0x438(0x10)
	struct U*609efafa5b* *9e57c42ec4; // 0x448(0x08)
	struct F*7f3debddd2 *877a198a9a; // 0x450(0x20)
	struct F*7f3debddd2 *560b3cbf6a; // 0x470(0x20)
	struct F*7f3debddd2 *7ba24e74fc; // 0x490(0x20)
	struct FVector2D *4b1db01621; // 0x4b0(0x08)
	struct TArray<struct FVector2D> *d338affaae; // 0x4b8(0x10)
	float *f640ff97a1; // 0x4c8(0x04)
	struct FVector2D *74a0907f98; // 0x4cc(0x08)
	struct FVector2D *3660264e49; // 0x4d4(0x08)
	struct FVector2D *e51a94d790; // 0x4dc(0x08)
	float *0056c49f92; // 0x4e4(0x04)
	int32 Count; // 0x4e8(0x04)
	bool *8b7b50f892; // 0x4ec(0x01)
	char pad_4ED[0x3]; // 0x4ed(0x03)

	void *750a90d339(); // Function TslGame.*066fd6c9ca.*750a90d339 // None // @ game+0x55d146c
	void OnRemoveMessage(); // Function TslGame.*066fd6c9ca.OnRemoveMessage // None // @ game+0xac763c
	void *2915afc34d(); // Function TslGame.*066fd6c9ca.*2915afc34d // None // @ game+0x55be7d4
	void *52f7dd647d(); // Function TslGame.*066fd6c9ca.*52f7dd647d // None // @ game+0x55d15f8
	void *7d28ee47d2(); // Function TslGame.*066fd6c9ca.*7d28ee47d2 // None // @ game+0x55ba24c
	void *d42c21ec5e(); // Function TslGame.*066fd6c9ca.*d42c21ec5e // None // @ game+0x55bf290
	void SetSizeRule(enum class ESlateSizeRule Param0); // Function TslGame.*066fd6c9ca.SetSizeRule // None // @ game+0x55cef2c
	void *32a9ba497f(); // Function TslGame.*066fd6c9ca.*32a9ba497f // None // @ game+0x55bd878
	void *e2d0e9d7a4(); // Function TslGame.*066fd6c9ca.*e2d0e9d7a4 // None // @ game+0x55bed30
};

// Class TslGame.*878bd5f6c4
// Size: 0x4f0 (Inherited: 0x4f0)
struct U*878bd5f6c4 : U*066fd6c9ca {
	enum class EVerticalAlignment *52f9deefe3; // 0x410(0x01)
	int32 *7a7ab2e01e; // 0x414(0x04)
	bool *be97afb0d5; // 0x418(0x01)
	bool *2604610b3b; // 0x419(0x01)
	struct UCurveFloat* *3bf762738d; // 0x420(0x08)
	struct FVector2D BorderSize; // 0x428(0x08)
	bool *ea416c6b93; // 0x430(0x01)
	bool *63b7e64bed; // 0x431(0x01)
	struct TArray<struct U*609efafa5b*> *53d744ab50; // 0x438(0x10)
	struct U*609efafa5b* *9e57c42ec4; // 0x448(0x08)
	struct F*7f3debddd2 *877a198a9a; // 0x450(0x20)
	struct F*7f3debddd2 *560b3cbf6a; // 0x470(0x20)
	struct F*7f3debddd2 *7ba24e74fc; // 0x490(0x20)
	struct FVector2D *4b1db01621; // 0x4b0(0x08)
	struct TArray<struct FVector2D> *d338affaae; // 0x4b8(0x10)
	float *f640ff97a1; // 0x4c8(0x04)
	struct FVector2D *74a0907f98; // 0x4cc(0x08)
	struct FVector2D *3660264e49; // 0x4d4(0x08)
	struct FVector2D *e51a94d790; // 0x4dc(0x08)
	float *0056c49f92; // 0x4e4(0x04)
	int32 Count; // 0x4e8(0x04)
	bool *8b7b50f892; // 0x4ec(0x01)

	void *750a90d339(); // Function TslGame.*066fd6c9ca.*750a90d339 // None // @ game+0x55d146c
	void OnRemoveMessage(); // Function TslGame.*066fd6c9ca.OnRemoveMessage // None // @ game+0xac763c
	void *2915afc34d(); // Function TslGame.*066fd6c9ca.*2915afc34d // None // @ game+0x55be7d4
	void *52f7dd647d(); // Function TslGame.*066fd6c9ca.*52f7dd647d // None // @ game+0x55d15f8
	void *7d28ee47d2(); // Function TslGame.*066fd6c9ca.*7d28ee47d2 // None // @ game+0x55ba24c
	void *d42c21ec5e(); // Function TslGame.*066fd6c9ca.*d42c21ec5e // None // @ game+0x55bf290
	void SetSizeRule(enum class ESlateSizeRule Param0); // Function TslGame.*066fd6c9ca.SetSizeRule // None // @ game+0x55cef2c
	void *32a9ba497f(); // Function TslGame.*066fd6c9ca.*32a9ba497f // None // @ game+0x55bd878
	void *e2d0e9d7a4(); // Function TslGame.*066fd6c9ca.*e2d0e9d7a4 // None // @ game+0x55bed30
};

// Class TslGame.*609efafa5b
// Size: 0x470 (Inherited: 0x410)
struct U*609efafa5b : U*17234a7c9b {
	struct FText Message; // 0x410(0x18)
	float Duration; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UAkAudioEvent* Sound; // 0x430(0x08)
	struct FMulticastDelegate EndMessage; // 0x438(0x10)
	bool bUsed; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
	struct F*9c84e0ea54 *04a317aca0; // 0x450(0x08)
	struct UTextBlock* MessageTextBlock; // 0x458(0x08)
	struct U*6b11b3bf02* Anim_FadeIn; // 0x460(0x08)
	struct U*6b11b3bf02* Anim_FadeOut; // 0x468(0x08)

	void OnFadeInFinished(); // Function TslGame.*609efafa5b.OnFadeInFinished // None // @ game+0x93f2d4
	void OnFadeOutFinished(); // Function TslGame.*609efafa5b.OnFadeOutFinished // None // @ game+0xa1a29c
	void StartFadeOut(); // Function TslGame.*609efafa5b.StartFadeOut // None // @ game+0x244a00
};

// Class TslGame.*55ba2832c8
// Size: 0x468 (Inherited: 0x410)
struct U*55ba2832c8 : U*17234a7c9b {
	struct U*ba1bff039c* TeamManagement; // 0x410(0x08)
	struct U*cc69409b78* TeamManagementPopup; // 0x418(0x08)
	struct U*f653452603* SystemMenu; // 0x420(0x08)
	struct U*3ac124ec5e* ReportPlayerWidget; // 0x428(0x08)
	struct TArray<struct ATeam*> *d137432a43; // 0x430(0x10)
	char pad_440[0x18]; // 0x440(0x18)
	struct U*fe8f9c39c2* MissionList; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)

	void OnSuccessfullyReportPlayer(); // Function TslGame.*55ba2832c8.OnSuccessfullyReportPlayer // None // @ game+0x55c5f04
	void OnNotifyReportTeamMember(); // Function TslGame.*55ba2832c8.OnNotifyReportTeamMember // None // @ game+0x26a108
	void InitBinding(); // Function TslGame.*55ba2832c8.InitBinding // None // @ game+0x55be8b0
	void OnReport(); // Function TslGame.*55ba2832c8.OnReport // None // @ game+0x55c55c4
	void *b97811affe(int32 Param0); // Function TslGame.*55ba2832c8.*b97811affe // None // @ game+0x55bd694
};

// Class TslGame.*61763b9809
// Size: 0x4e8 (Inherited: 0x410)
struct U*61763b9809 : U*17234a7c9b {
	struct UBorder* BorderNotificationMessage; // 0x410(0x08)
	struct UImage* ImageIcon; // 0x418(0x08)
	struct UWidgetSwitcher* SwitcherMessage; // 0x420(0x08)
	struct UTextBlock* TextMessage; // 0x428(0x08)
	struct UTslRichTextBlock* RichTextMessage; // 0x430(0x08)
	struct U*6b11b3bf02* AnimAppear; // 0x438(0x08)
	struct U*6b11b3bf02* AnimAppearLoop; // 0x440(0x08)
	struct U*6b11b3bf02* AnimDisappear; // 0x448(0x08)
	struct UDataTable* NotificationMessageTable; // 0x450(0x08)
	struct TMap<enum class ETslNotificationMessageColorType, struct FSlateColor> *4d421db150; // 0x458(0x50)
	struct F*3c352e82dd *8eabf3c7f1; // 0x4a8(0x38)
	char pad_4E0[0x8]; // 0x4e0(0x08)
};

// Class TslGame.*f8514d3992
// Size: 0x4f8 (Inherited: 0x410)
struct U*f8514d3992 : U*17234a7c9b {
	struct F*e9e2558d2e LastTeamsAnimBinder; // 0x410(0x20)
	struct F*e9e2558d2e LastTeamsSkipAnimBinder; // 0x430(0x20)
	struct F*e9e2558d2e LastTeamsInitAnimBinder; // 0x450(0x20)
	struct TArray<struct F*c233adf9bd> PlayerIconWidgetBinders; // 0x470(0x10)
	struct TArray<struct F*c233adf9bd> LastTeamInfoWidgetBinders; // 0x480(0x10)
	struct TMap<int32, struct U*8e60b74b55*> *cb0e5bfd83; // 0x490(0x50)
	struct U*b2d1f47a84* *4f5ec8b1bb; // 0x4e0(0x08)
	char pad_4E8[0x10]; // 0x4e8(0x10)

	void UpdateCurrentAliveCount(); // Function TslGame.*f8514d3992.UpdateCurrentAliveCount // None // @ game+0x55d0e70
	void OnInitLastTeams(); // Function TslGame.*f8514d3992.OnInitLastTeams // None // @ game+0x55c2b98
};

// Class TslGame.*8e60b74b55
// Size: 0x5a0 (Inherited: 0x410)
struct U*8e60b74b55 : U*17234a7c9b {
	struct TArray<struct F*d3069d51ff> PlayerImageWidgetBinders; // 0x410(0x10)
	struct F*d3069d51ff BGImageWidgetBinder; // 0x420(0x28)
	struct F*d3069d51ff PatternImageWidgetBinder; // 0x448(0x28)
	struct F*f4f57b85a2 NameTextWidgetBinder; // 0x470(0x20)
	struct F*959656208f LogoBorderWidgetBinder; // 0x490(0x30)
	struct F*b9afef7a3a LogoSwitcherWidgetBinder; // 0x4c0(0x28)
	struct F*d3069d51ff TeamIconImageWidgetBinder; // 0x4e8(0x28)
	struct F*e9e2558d2e EndAnimBinder; // 0x510(0x20)
	struct FLinearColor BGImageDimColor; // 0x530(0x10)
	struct FLinearColor NameTextNormalColor; // 0x540(0x10)
	struct FLinearColor NameTextDimColor; // 0x550(0x10)
	struct FLinearColor PlayerNormalColor; // 0x560(0x10)
	struct FLinearColor PlayerGroggyColor; // 0x570(0x10)
	struct FLinearColor PlayerDieColor; // 0x580(0x10)
	char pad_590[0x10]; // 0x590(0x10)
};

// Class TslGame.*aee10333db
// Size: 0x438 (Inherited: 0x410)
struct U*aee10333db : U*17234a7c9b {
	struct F*b9afef7a3a PlayerStateIconsSwitcherBinder; // 0x410(0x28)
};

// Class TslGame.*e7ff12396f
// Size: 0x4a8 (Inherited: 0x410)
struct U*e7ff12396f : U*17234a7c9b {
	struct F*959656208f LogoBorderWidgetBinder; // 0x410(0x30)
	struct F*eaae7901d4 LogoPanelWidgetBinder; // 0x440(0x20)
	struct F*d3069d51ff LastTeamPatternWidgetBinder; // 0x460(0x28)
	struct F*f4f57b85a2 LastTeamTextWidgetBinder; // 0x488(0x20)
};

// Class TslGame.*b7853ab010
// Size: 0x420 (Inherited: 0x410)
struct U*b7853ab010 : U*17234a7c9b {
	struct U*b2d1f47a84* Manager; // 0x410(0x08)
	struct U*7f757909f6* PlatformImage; // 0x418(0x08)
};

// Class TslGame.*7d0388ca2f
// Size: 0x628 (Inherited: 0x420)
struct U*7d0388ca2f : U*b7853ab010 {
	struct F*b9afef7a3a *645569ffd8; // 0x420(0x28)
	struct F*b9afef7a3a *a750dc88f9; // 0x448(0x28)
	struct F*e9e2558d2e *0c2508f220; // 0x470(0x20)
	struct F*c233adf9bd *7e8edef333; // 0x490(0x20)
	struct F*c233adf9bd *5dc24d6ef5; // 0x4b0(0x20)
	struct F*f4f57b85a2 *0dae719340; // 0x4d0(0x20)
	struct F*f4f57b85a2 *2d9489194e; // 0x4f0(0x20)
	struct F*e9e2558d2e *080f42f1ba; // 0x510(0x20)
	struct F*c233adf9bd *d74beb4c87; // 0x530(0x20)
	struct F*c233adf9bd *16257fec37; // 0x550(0x20)
	struct F*c233adf9bd *92ffc95d99; // 0x570(0x20)
	struct F*c233adf9bd *2b12949877; // 0x590(0x20)
	struct F*f4f57b85a2 *895202d8b6; // 0x5b0(0x20)
	struct F*f4f57b85a2 *4dd2bb6ec1; // 0x5d0(0x20)
	struct F*f4f57b85a2 *a97386cd13; // 0x5f0(0x20)
	struct UAkAudioEvent* *114be7f07d; // 0x610(0x08)
	char pad_618[0x10]; // 0x618(0x10)

	void *8d53c799db(); // Function TslGame.*7d0388ca2f.*8d53c799db // None // @ game+0x55bf228
};

// Class TslGame.*b2d1f47a84
// Size: 0x470 (Inherited: 0x410)
struct U*b2d1f47a84 : U*17234a7c9b {
	char pad_410[0x10]; // 0x410(0x10)
	struct F*959656208f *320254f760; // 0x420(0x30)
	struct UClass* *6896716d9c; // 0x450(0x08)
	struct UClass* *5f044544a8; // 0x458(0x08)
	struct U*b7853ab010* CurrAnimWidget; // 0x460(0x08)
	struct U*f8514d3992* *f8514d3992; // 0x468(0x08)

	void IsEmpty(); // Function TslGame.*b2d1f47a84.IsEmpty // None // @ game+0x55becbc
	void ProcData(); // Function TslGame.*b2d1f47a84.ProcData // None // @ game+0x55c8588
	void Dequeue(); // Function TslGame.*b2d1f47a84.Dequeue // None // @ game+0x55bc740
	void Clear(); // Function TslGame.*b2d1f47a84.Clear // None // @ game+0x55ba274
	struct FString Enqueue(int32 KillingSpreeTeamNum, int32 KillingSpreeKillCount); // Function TslGame.*b2d1f47a84.Enqueue // None // @ game+0x55bcb6c
	void OnCurrAnimFinish(); // Function TslGame.*b2d1f47a84.OnCurrAnimFinish // None // @ game+0x55c1b00
	int32 OnTeamKillingSpree(); // Function TslGame.*b2d1f47a84.OnTeamKillingSpree // None // @ game+0x55c6128
	int32 OnTeamWipeOut(int32 Param1); // Function TslGame.*b2d1f47a84.OnTeamWipeOut // None // @ game+0x55c62a8
	void NumElems(); // Function TslGame.*b2d1f47a84.NumElems // None // @ game+0x55c06ec
	int32 OnPersonalKillingSpree(); // Function TslGame.*b2d1f47a84.OnPersonalKillingSpree // None // @ game+0x55c47f4
	void IsBusy(); // Function TslGame.*b2d1f47a84.IsBusy // None // @ game+0x55bec84
	void Peek(); // Function TslGame.*b2d1f47a84.Peek // None // @ game+0x55c80f8
};

// Class TslGame.*9a635cc5c2
// Size: 0x510 (Inherited: 0x420)
struct U*9a635cc5c2 : U*b7853ab010 {
	struct F*c233adf9bd *051fa22064; // 0x420(0x20)
	struct F*c233adf9bd *a43f334615; // 0x440(0x20)
	struct F*c233adf9bd *acc6f25d11; // 0x460(0x20)
	struct F*c233adf9bd *89181af492; // 0x480(0x20)
	struct F*f4f57b85a2 *cf06884dae; // 0x4a0(0x20)
	struct F*f4f57b85a2 *d5cc5c4d81; // 0x4c0(0x20)
	struct F*e9e2558d2e *56e9530487; // 0x4e0(0x20)
	struct UAkAudioEvent* *e5534cd2e4; // 0x500(0x08)
	char pad_508[0x8]; // 0x508(0x08)

	void *3c87c909a1(); // Function TslGame.*9a635cc5c2.*3c87c909a1 // None // @ game+0x55bf228
};

// Class TslGame.*28cea59f92
// Size: 0x618 (Inherited: 0x420)
struct U*28cea59f92 : U*b7853ab010 {
	struct F*f4f57b85a2 *2d9489194e; // 0x420(0x20)
	struct F*f4f57b85a2 *4dd2bb6ec1; // 0x440(0x20)
	struct F*b9afef7a3a *dfbdadf92b; // 0x460(0x28)
	struct F*c233adf9bd *8ae71cae91; // 0x488(0x20)
	struct F*d3069d51ff *0d32cd716f; // 0x4a8(0x28)
	struct F*f4f57b85a2 *9a2526a090; // 0x4d0(0x20)
	struct F*d3069d51ff *13d185e249; // 0x4f0(0x28)
	struct F*f4f57b85a2 *911e4d5d06; // 0x518(0x20)
	struct F*d3069d51ff *8260ae4b8e; // 0x538(0x28)
	struct UTexture2D* KillingSpreeTexture; // 0x560(0x08)
	struct UTexture2D* DominatingTexture; // 0x568(0x08)
	struct F*e9e2558d2e AssistAnimBinder; // 0x570(0x20)
	struct F*e9e2558d2e FirstKillAnimBinder; // 0x590(0x20)
	struct F*e9e2558d2e ThirdKillAnimBinder; // 0x5b0(0x20)
	struct F*e9e2558d2e FifthKillAnimBinder; // 0x5d0(0x20)
	struct F*e9e2558d2e OverKillAnimBinder; // 0x5f0(0x20)
	struct UAkAudioEvent* ObserverTotalKillSound; // 0x610(0x08)
};

// Class TslGame.*47dd8e4d13
// Size: 0x458 (Inherited: 0x410)
struct U*47dd8e4d13 : U*17234a7c9b {
	struct UClass* TeamInfoWidgetTemplate; // 0x410(0x08)
	struct TArray<struct U*5f1937f5a5*> *69675e56a5; // 0x418(0x10)
	float *3fd4ccb5e3; // 0x428(0x04)
	float *143aa28b70; // 0x42c(0x04)
	struct F*5f0ea4fd04 *8ddd17b830; // 0x430(0x28)
};

// Class TslGame.*b598a0851f
// Size: 0x490 (Inherited: 0x410)
struct U*b598a0851f : U*17234a7c9b {
	struct F*c233adf9bd *399cfd4f47; // 0x410(0x20)
	struct F*c233adf9bd *48e8ec853a; // 0x430(0x20)
	struct F*c233adf9bd *977519b103; // 0x450(0x20)
	struct F*e9e2558d2e *ac8339b7e7; // 0x470(0x20)
};

// Class TslGame.*8f6b05f877
// Size: 0x4e8 (Inherited: 0x410)
struct U*8f6b05f877 : U*17234a7c9b {
	struct F*f4f57b85a2 *43c321a40a; // 0x410(0x20)
	struct F*f4f57b85a2 *6bb33fb6f9; // 0x430(0x20)
	struct F*f4f57b85a2 *4af0d7aac1; // 0x450(0x20)
	struct F*d3069d51ff *c4e5c9fa86; // 0x470(0x28)
	struct F*c233adf9bd *2b12949877; // 0x498(0x20)
	struct F*e9e2558d2e *562207a6c3; // 0x4b8(0x20)
	enum class ELeagueMatchStatistic *7c71a10b47; // 0x4d8(0x01)
	char pad_4D9[0x3]; // 0x4d9(0x03)
	float *eaf27a9930; // 0x4dc(0x04)
	char pad_4E0[0x8]; // 0x4e0(0x08)

	void *d4bee6a2d3(); // Function TslGame.*8f6b05f877.*d4bee6a2d3 // None // @ game+0x55c5e90
};

// Class TslGame.*f729112f02
// Size: 0x458 (Inherited: 0x410)
struct U*f729112f02 : U*17234a7c9b {
	struct FVector2D *877b268e45; // 0x410(0x08)
	struct FVector2D *4a57cb3333; // 0x418(0x08)
	struct UWidgetSwitcher* SwitcherPlayerIcon; // 0x420(0x08)
	struct USizeBox* SizeboxPlayerIcon; // 0x428(0x08)
	struct UImage* ImagePlayerIcon; // 0x430(0x08)
	struct USizeBox* SizeboxPlayerNumber; // 0x438(0x08)
	struct UBorder* BorderPlayerNumber; // 0x440(0x08)
	struct UImage* ImagePattern; // 0x448(0x08)
	struct UTextBlock* TextNumber; // 0x450(0x08)

	void UpdatePlayerIcon(); // Function TslGame.*f729112f02.UpdatePlayerIcon // None // @ game+0x55d13b4
};

// Class TslGame.*5bf84e35e0
// Size: 0x9d0 (Inherited: 0x410)
struct U*5bf84e35e0 : U*17234a7c9b {
	struct UTexture* UnArmedIcon; // 0x410(0x08)
	float UnArmedIconRatio; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct ATslCharacter* *2f2016c46b; // 0x420(0x08)
	int32 *997b5149db; // 0x428(0x04)
	int32 *33c9273227; // 0x42c(0x04)
	int32 *590697892a; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct F*e9e2558d2e AmmoIncreasingAnimBinder; // 0x438(0x20)
	struct F*e9e2558d2e AmmoDecreasingAnimBinder; // 0x458(0x20)
	struct F*f4f57b85a2 *04d6956259; // 0x478(0x20)
	struct F*f4f57b85a2 *f89b4fa151; // 0x498(0x20)
	struct F*959656208f *70d4c4c139; // 0x4b8(0x30)
	struct F*f4f57b85a2 *da19dd6d29; // 0x4e8(0x20)
	struct F*959656208f *94735229c9; // 0x508(0x30)
	struct F*b9afef7a3a PatternSwitcherBinder; // 0x538(0x28)
	struct F*d3069d51ff *82741b3241; // 0x560(0x28)
	struct F*8e32972a91 *1e88c093f5; // 0x588(0x28)
	struct F*f4f57b85a2 *d64537dc36; // 0x5b0(0x20)
	struct F*f4f57b85a2 *33158c7e70; // 0x5d0(0x20)
	struct F*f4f57b85a2 *c25fbecbf5; // 0x5f0(0x20)
	struct F*f4f57b85a2 *d1ca933e0a; // 0x610(0x20)
	struct F*c233adf9bd *31c5bc43a6; // 0x630(0x20)
	struct F*c233adf9bd *4cb6148dc9; // 0x650(0x20)
	struct F*c233adf9bd *02b16500ae; // 0x670(0x20)
	struct F*c233adf9bd *5ae98e59ac; // 0x690(0x20)
	struct F*c233adf9bd *6ab5602afa; // 0x6b0(0x20)
	struct F*c233adf9bd *6c3a99b01f; // 0x6d0(0x20)
	struct F*c233adf9bd *6b5b75ac7e; // 0x6f0(0x20)
	struct F*c233adf9bd *f445394411; // 0x710(0x20)
	struct F*c233adf9bd *bc4312cdfb; // 0x730(0x20)
	struct F*d3069d51ff *3275f0a2bd; // 0x750(0x28)
	struct UTexture2D* DriverTexture; // 0x778(0x08)
	struct F*d3069d51ff WeaponIconImageBinder; // 0x780(0x28)
	struct F*c69f8ed24a WeaponIconImageSizeBoxBinder; // 0x7a8(0x28)
	struct F*d3069d51ff SecondWeaponIconImageBinder; // 0x7d0(0x28)
	struct F*c69f8ed24a SecondWeaponIconImageSizeBoxBinder; // 0x7f8(0x28)
	struct F*f4f57b85a2 MainWeaponName_Binder; // 0x820(0x20)
	struct F*f4f57b85a2 MainWeaponEmpty_Binder; // 0x840(0x20)
	struct F*f4f57b85a2 SecondWeaponEmpty_Binder; // 0x860(0x20)
	struct FName WeaponIconTextureParmName; // 0x880(0x08)
	struct FName WeaponIconColorParmName; // 0x888(0x08)
	struct FLinearColor WeaponColor_Armed; // 0x890(0x10)
	struct FLinearColor WeaponColor_Normal; // 0x8a0(0x10)
	struct FLinearColor SecondWeaponColor_Normal; // 0x8b0(0x10)
	struct F*fd985b6c41 WeaponColorSet_NoReload; // 0x8c0(0x10)
	struct F*fd985b6c41 SecondWeaponColorSet_NoReload; // 0x8d0(0x10)
	struct TMap<struct FName, struct UTexture2D*> WeaponAttachableTextureMap; // 0x8e0(0x50)
	struct TMap<enum class ECastAnim, struct UTexture2D*> CastableItemTextureMap; // 0x930(0x50)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x980(0x10)
	struct U*7f757909f6* UserPlatformImageWidget; // 0x990(0x08)
	struct FLinearColor *3c7e338480; // 0x998(0x10)
	struct FLinearColor *de61af4f50; // 0x9a8(0x10)
	struct UTexture2D* *eb7ad49f32; // 0x9b8(0x08)
	struct UTexture2D* *6e162af026; // 0x9c0(0x08)
	struct UTexture2D* *f40f9d67ba; // 0x9c8(0x08)
};

// Class TslGame.TslObserverPlayerListTileInfoWidget
// Size: 0x650 (Inherited: 0x410)
struct UTslObserverPlayerListTileInfoWidget : U*17234a7c9b {
	char pad_410[0x40]; // 0x410(0x40)
	struct ATslCharacter* Character; // 0x450(0x08)
	struct ATslPlayerState* *b3a6a36d0d; // 0x458(0x08)
	struct FLinearColor HighlightedColor; // 0x460(0x10)
	struct FLinearColor ActivatedColor; // 0x470(0x10)
	struct FLinearColor DeactivatedColor; // 0x480(0x10)
	struct U*0399764a34* PlayerNameFlowText; // 0x490(0x08)
	struct F*f4f57b85a2 TeamName; // 0x498(0x20)
	struct F*f4f57b85a2 PlayerKillCount; // 0x4b8(0x20)
	struct F*c233adf9bd LifeGaugeWidgetBinder; // 0x4d8(0x20)
	struct F*7f3debddd2 BtnPlayer; // 0x4f8(0x20)
	struct F*7f3debddd2 KickButton_Binder; // 0x518(0x20)
	struct F*7f3debddd2 ReportButton_Binder; // 0x538(0x20)
	struct F*c69f8ed24a TeamTagSizeBox_Binder; // 0x558(0x28)
	struct F*d3069d51ff TeamTagBG_Binder; // 0x580(0x28)
	struct F*d3069d51ff TeamTagColor_Binder; // 0x5a8(0x28)
	struct U*669c3b6ff9* *4551107787; // 0x5d0(0x08)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x5d8(0x10)
	struct U*7f757909f6* UserPlatformImageWidget; // 0x5e8(0x08)
	struct FString *77320b0e0b; // 0x5f0(0x10)
	struct FString PlayerName; // 0x600(0x10)
	struct FString *e80419cad3; // 0x610(0x10)
	struct FText *cf17a88333; // 0x620(0x18)
	char pad_638[0x18]; // 0x638(0x18)

	void OnMouseClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnMouseClicked // None // @ game+0x55c3b64
	void KickPlayer(); // Function TslGame.TslObserverPlayerListTileInfoWidget.KickPlayer // None // @ game+0x55befdc
	void OnReportButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnReportButtonClicked // None // @ game+0x55c56d4
	void OnKickButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnKickButtonClicked // None // @ game+0x55c2c84
};

// Class TslGame.TslObserverPlayerListTileWidget
// Size: 0x580 (Inherited: 0x410)
struct UTslObserverPlayerListTileWidget : U*17234a7c9b {
	char pad_410[0x8]; // 0x410(0x08)
	struct F*eaae7901d4 InforPanel; // 0x418(0x20)
	struct F*7f3debddd2 TeamRank; // 0x438(0x20)
	struct F*f4f57b85a2 TeamRankText; // 0x458(0x20)
	struct F*b9afef7a3a SwitcherTeamLogo; // 0x478(0x28)
	struct F*d3069d51ff TeamImage; // 0x4a0(0x28)
	struct F*d3069d51ff TeamColor; // 0x4c8(0x28)
	struct F*d3069d51ff TeamListColor; // 0x4f0(0x28)
	struct F*f4f57b85a2 TeamNum; // 0x518(0x20)
	struct F*f4f57b85a2 TeamInfoKill; // 0x538(0x20)
	struct UTexture2D* *bda1591727; // 0x558(0x08)
	char pad_560[0x20]; // 0x560(0x20)

	void UpdateStripeTexture(); // Function TslGame.TslObserverPlayerListTileWidget.UpdateStripeTexture // None // @ game+0x26a108
};

// Class TslGame.*3181dcd77d
// Size: 0x420 (Inherited: 0x410)
struct U*3181dcd77d : U*17234a7c9b {
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x328(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x348(0x20)
	struct U*6b11b3bf02* Emerging; // 0x368(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x370(0x08)
	enum class ESlateVisibility *0d5cd6f4af; // 0x390(0x01)
	float *c0604b00ca; // 0x394(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *89f3008bea; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	struct F*f23e4e6c9e *883997f6a4; // 0x3a8(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d0(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f0(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x400(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // None // @ game+0x55f3bfc
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // None // @ game+0x55f3c2c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // None // @ game+0x55ba24c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // None // @ game+0x19e880
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // None // @ game+0x55f1c54
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // None // @ game+0x55e8a18
	struct FVector2D SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // None // @ game+0x55f82c0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // None // @ game+0x55fa6d8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // None // @ game+0x26a108
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // None // @ game+0x55f8218
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // None // @ game+0x55f3cc8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // None // @ game+0x55f3c14
};

// Class TslGame.*45528684b4
// Size: 0x438 (Inherited: 0x410)
struct U*45528684b4 : U*17234a7c9b {
	char pad_410[0x10]; // 0x410(0x10)
	struct UCurveFloat* *529136b668; // 0x420(0x08)
	struct UCurveFloat* *01168b4278; // 0x428(0x08)
	float *19f94b0b95; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
};

// Class TslGame.*08a5f2cace
// Size: 0x4f8 (Inherited: 0x438)
struct U*08a5f2cace : U*45528684b4 {
	char pad_438[0x8]; // 0x438(0x08)
	struct TArray<struct U*a9bd80b6db*> Icons; // 0x440(0x10)
	struct TMap<int32, struct UTexture2D*> *2442e3704b; // 0x450(0x50)
	struct UHorizontalBox* IconHorizontalBox; // 0x4a0(0x08)
	struct TMap<int32, struct ATslOPBuff*> *09ab4eb973; // 0x4a8(0x50)
};

// Class TslGame.*dfb13d7deb
// Size: 0x470 (Inherited: 0x438)
struct U*dfb13d7deb : U*45528684b4 {
	struct TArray<struct FLinearColor> *ee9805aa81; // 0x438(0x10)
	char pad_448[0x10]; // 0x448(0x10)
	struct UImage* Icon1; // 0x458(0x08)
	struct UImage* Icon2; // 0x460(0x08)
	struct UImage* Icon3; // 0x468(0x08)
};

// Class TslGame.*9d266de3c4
// Size: 0x4e8 (Inherited: 0x410)
struct U*9d266de3c4 : U*17234a7c9b {
	struct F*9c84e0ea54 *e9a95578ac; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct U*08a5f2cace* MyBuffWidget; // 0x420(0x08)
	struct UCanvasPanel* BuffHeadManagerCanvasPanel; // 0x428(0x08)
	struct UScaleBox* TPP_Box; // 0x430(0x08)
	struct UScaleBox* FPP_Box; // 0x438(0x08)
	struct UScaleBox* FPPWithMonsterHp_Box; // 0x440(0x08)
	struct UScaleBox* IconBox; // 0x448(0x08)
	struct UClass* *5567f62fd0; // 0x450(0x08)
	struct UClass* *007757202a; // 0x458(0x08)
	struct TMap<struct ATslCharacter*, struct U*45528684b4*> *4c5035eb35; // 0x460(0x50)
	struct TArray<struct U*08a5f2cace*> *d2c2813985; // 0x4b0(0x10)
	struct TArray<struct U*dfb13d7deb*> *63a33a5b21; // 0x4c0(0x10)
	float *3172e2b812; // 0x4d0(0x04)
	float *8050fe9c4c; // 0x4d4(0x04)
	char pad_4D8[0x10]; // 0x4d8(0x10)

	void OnUpdateViewTarget(); // Function TslGame.*9d266de3c4.OnUpdateViewTarget // None // @ game+0x55c6d30
	void *a2b4158e18(); // Function TslGame.*9d266de3c4.*a2b4158e18 // None // @ game+0x55d13a0
};

// Class TslGame.*5f8865c441
// Size: 0x4c8 (Inherited: 0x410)
struct U*5f8865c441 : U*17234a7c9b {
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x410(0x08)
	struct U*3cb5b0e933* PointWidget; // 0x418(0x08)
	struct U*3cb5b0e933* KillWidget; // 0x420(0x08)
	struct U*3cb5b0e933* AliveWidget; // 0x428(0x08)
	struct U*75df6275b9* MonsterHpWidget; // 0x430(0x08)
	struct UClass* *4014caf1e8; // 0x438(0x08)
	struct FName *36cb91ce3d; // 0x440(0x08)
	float *621e2abd5e; // 0x448(0x04)
	float *e5fca4b847; // 0x44c(0x04)
	char pad_450[0x8]; // 0x450(0x08)
	struct TMap<struct ATslCharacterBase*, struct U*9e7a2f2990*> *308b6878af; // 0x458(0x50)
	struct TArray<struct U*9e7a2f2990*> *92cbd17831; // 0x4a8(0x10)
	char pad_4B8[0x10]; // 0x4b8(0x10)

	struct FName UpdateCoinStackCount(); // Function TslGame.*5f8865c441.UpdateCoinStackCount // None // @ game+0x55d0c54
	void OnMatchStarted(); // Function TslGame.*5f8865c441.OnMatchStarted // None // @ game+0x55c3240
	void OnKillCountChanged(); // Function TslGame.*5f8865c441.OnKillCountChanged // None // @ game+0x55c2c98
	float OnOPModeMonsterAttacked(); // Function TslGame.*5f8865c441.OnOPModeMonsterAttacked // None // @ game+0x55c448c
	void *043bc86332(); // Function TslGame.*5f8865c441.*043bc86332 // None // @ game+0x55c0988
	void OnViewTargetUpdate(); // Function TslGame.*5f8865c441.OnViewTargetUpdate // None // @ game+0x55c7414
	void UpdateCoin(); // Function TslGame.*5f8865c441.UpdateCoin // None // @ game+0x55d0c2c
};

// Class TslGame.*9e7a2f2990
// Size: 0x440 (Inherited: 0x410)
struct U*9e7a2f2990 : U*17234a7c9b {
	char pad_410[0x20]; // 0x410(0x20)
	struct UMaterialInstanceDynamic* *b378149ef3; // 0x430(0x08)
	struct UImage* HpImage; // 0x438(0x08)
};

// Class TslGame.*03b17e6ea9
// Size: 0x410 (Inherited: 0x410)
struct U*03b17e6ea9 : U*17234a7c9b {
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x328(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x348(0x20)
	struct U*6b11b3bf02* Emerging; // 0x368(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x370(0x08)
	enum class ESlateVisibility *0d5cd6f4af; // 0x390(0x01)
	float *c0604b00ca; // 0x394(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *89f3008bea; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	struct F*f23e4e6c9e *883997f6a4; // 0x3a8(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d0(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f0(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x400(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // None // @ game+0x55f3bfc
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // None // @ game+0x55f3c2c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // None // @ game+0x55ba24c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // None // @ game+0x19e880
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // None // @ game+0x55f1c54
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // None // @ game+0x55e8a18
	struct FVector2D SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // None // @ game+0x55f82c0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // None // @ game+0x55fa6d8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // None // @ game+0x26a108
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // None // @ game+0x55f8218
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // None // @ game+0x55f3cc8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // None // @ game+0x55f3c14
};

// Class TslGame.*28728b885d
// Size: 0x420 (Inherited: 0x410)
struct U*28728b885d : U*17234a7c9b {
	struct U*5c719e1ded* ParachuteGaugeWidget; // 0x410(0x08)
	struct U*ff67c1c6e6* ParachuteAirSpeedWidget; // 0x418(0x08)
};

// Class TslGame.*01c84dbc27
// Size: 0x428 (Inherited: 0x410)
struct U*01c84dbc27 : U*17234a7c9b {
	struct USizeBox* FollowGuideSizeBox; // 0x410(0x08)
	struct UWidgetSwitcher* FollowGuideSwitcher; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
};

// Class TslGame.*5c719e1ded
// Size: 0x460 (Inherited: 0x410)
struct U*5c719e1ded : U*17234a7c9b {
	struct USizeBox* FreeFallBar; // 0x410(0x08)
	struct USizeBox* ParachuteFallBar; // 0x418(0x08)
	struct USizeBox* GroundHeightBar; // 0x420(0x08)
	struct UTextBlock* AltitudeText; // 0x428(0x08)
	struct U*6b11b3bf02* PositionByPlayerAltitude; // 0x430(0x08)
	float *7ba8560192; // 0x438(0x04)
	struct ATslCharacter* ViewTargetCharacter; // 0x43c(0x08)
	char pad_444[0x1c]; // 0x444(0x1c)

	void UpdateViewTarget(); // Function TslGame.*5c719e1ded.UpdateViewTarget // None // @ game+0xa11cc8
	void SetSkydiveState(); // Function TslGame.*5c719e1ded.SetSkydiveState // None // @ game+0x55cf0b0
};

// Class TslGame.TslPlaneStanceWidget
// Size: 0x450 (Inherited: 0x410)
struct UTslPlaneStanceWidget : U*17234a7c9b {
	struct ATslCharacter* ViewTargetCharacter; // 0x410(0x08)
	struct UImage* PlaneImage; // 0x418(0x08)
	struct UGridPanel* SeatPanel; // 0x420(0x08)
	struct FName StateParamName; // 0x428(0x08)
	struct UTextBlock* RiderCountText; // 0x430(0x08)
	struct TArray<struct UImage*> *4a6a8f4013; // 0x438(0x10)
	char pad_448[0x8]; // 0x448(0x08)

	void UpdateViewTarget(); // Function TslGame.TslPlaneStanceWidget.UpdateViewTarget // None // @ game+0x55d192c
};

// Class TslGame.TslPlatoonCarePackageDropIndicatorWidget
// Size: 0x418 (Inherited: 0x410)
struct UTslPlatoonCarePackageDropIndicatorWidget : U*17234a7c9b {
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x328(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x348(0x20)
	struct U*6b11b3bf02* Emerging; // 0x368(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x370(0x08)
	enum class ESlateVisibility *0d5cd6f4af; // 0x390(0x01)
	float *c0604b00ca; // 0x394(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *89f3008bea; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	struct F*f23e4e6c9e *883997f6a4; // 0x3a8(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d0(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f0(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x400(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // None // @ game+0x55f3bfc
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // None // @ game+0x55f3c2c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // None // @ game+0x55ba24c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // None // @ game+0x19e880
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // None // @ game+0x55f1c54
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // None // @ game+0x55e8a18
	struct FVector2D SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // None // @ game+0x55f82c0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // None // @ game+0x55fa6d8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // None // @ game+0x26a108
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // None // @ game+0x55f8218
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // None // @ game+0x55f3cc8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // None // @ game+0x55f3c14
};

// Class TslGame.*bbc498abf3
// Size: 0x468 (Inherited: 0x410)
struct U*bbc498abf3 : U*17234a7c9b {
	struct UButton* CommandButton; // 0x410(0x08)
	struct UTslPlatoonCommandWidget* *5abbd4df7f; // 0x418(0x08)
	struct ATslGameState* *ba94c6f703; // 0x420(0x08)
	struct U*4175584972* MultipleKeyIconWidget; // 0x428(0x08)
	struct F*8e32972a91 *e59b1c2f74; // 0x430(0x28)
	enum class *43fe99eba5 *767422e5bf; // 0x458(0x01)
	char pad_459[0x3]; // 0x459(0x03)
	float *675c29da44; // 0x45c(0x04)
	float *babdc07e50; // 0x460(0x04)
	bool *14c825d63e; // 0x464(0x01)
	bool *b7af1ca573; // 0x465(0x01)
	bool *2a868307fb; // 0x466(0x01)
	char pad_467[0x1]; // 0x467(0x01)

	void OnUpdatePlatoonCarePackageState(); // Function TslGame.*bbc498abf3.OnUpdatePlatoonCarePackageState // None // @ game+0x55c6b78
	void OnUpdatePlatoonFireSupportState(); // Function TslGame.*bbc498abf3.OnUpdatePlatoonFireSupportState // None // @ game+0x55c6c2c
	void OnButtonClicked(); // Function TslGame.*bbc498abf3.OnButtonClicked // None // @ game+0x55c1134
	enum class *43fe99eba5 BP_UpdateCommandType(); // Function TslGame.*bbc498abf3.BP_UpdateCommandType // None // @ game+0x26a108
	void OnMatchStateChanged(); // Function TslGame.*bbc498abf3.OnMatchStateChanged // None // @ game+0x55c33f8
	void BP_UpdateEnablity(); // Function TslGame.*bbc498abf3.BP_UpdateEnablity // None // @ game+0x26a108
	float BP_UpdateProgress(); // Function TslGame.*bbc498abf3.BP_UpdateProgress // None // @ game+0x26a108
	void BP_UpdateHighlight(); // Function TslGame.*bbc498abf3.BP_UpdateHighlight // None // @ game+0x26a108
	void BP_UpdateClickability(); // Function TslGame.*bbc498abf3.BP_UpdateClickability // None // @ game+0x26a108
};

// Class TslGame.TslPlatoonCommandWidget
// Size: 0x488 (Inherited: 0x410)
struct UTslPlatoonCommandWidget : U*17234a7c9b {
	struct UClass* *ecc873eebe; // 0x410(0x08)
	struct U*0922458349* *3464d1e496; // 0x418(0x08)
	struct U*c1ef4cc603* ButtonPanel; // 0x420(0x08)
	bool *135fa2ac62; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct TMap<enum class *43fe99eba5, struct U*bbc498abf3*> *b92412910d; // 0x430(0x50)
	struct U*bbc498abf3* *758ae1a752; // 0x480(0x08)

	void UpdateButtonsByManifest(); // Function TslGame.TslPlatoonCommandWidget.UpdateButtonsByManifest // None // @ game+0x55d0b78
};

// Class TslGame.*34e5d20d5a
// Size: 0x418 (Inherited: 0x410)
struct U*34e5d20d5a : U*17234a7c9b {
	struct UTextBlock* BindTextDescription; // 0x410(0x08)
};

// Class TslGame.*ec819bcf04
// Size: 0x500 (Inherited: 0x410)
struct U*ec819bcf04 : U*17234a7c9b {
	struct UBorder* BindBorderNumberBg; // 0x410(0x08)
	struct UTextBlock* BindTextNumber; // 0x418(0x08)
	struct U*bde5e52cf2* BindWidgetPubgId; // 0x420(0x08)
	struct UWidget* BindWidgetDisable; // 0x428(0x08)
	struct UTextBlock* BindTextDisableText; // 0x430(0x08)
	struct UWidget* BindWidgetSelected; // 0x438(0x08)
	char pad_440[0xc0]; // 0x440(0xc0)
};

// Class TslGame.*32ba64381d
// Size: 0x500 (Inherited: 0x500)
struct U*32ba64381d : U*ec819bcf04 {
	struct UBorder* BindBorderNumberBg; // 0x410(0x08)
	struct UTextBlock* BindTextNumber; // 0x418(0x08)
	struct U*bde5e52cf2* BindWidgetPubgId; // 0x420(0x08)
	struct UWidget* BindWidgetDisable; // 0x428(0x08)
	struct UTextBlock* BindTextDisableText; // 0x430(0x08)
	struct UWidget* BindWidgetSelected; // 0x438(0x08)
};

// Class TslGame.*6f3e8c8bdf
// Size: 0x500 (Inherited: 0x500)
struct U*6f3e8c8bdf : U*ec819bcf04 {
	struct UBorder* BindBorderNumberBg; // 0x410(0x08)
	struct UTextBlock* BindTextNumber; // 0x418(0x08)
	struct U*bde5e52cf2* BindWidgetPubgId; // 0x420(0x08)
	struct UWidget* BindWidgetDisable; // 0x428(0x08)
	struct UTextBlock* BindTextDisableText; // 0x430(0x08)
	struct UWidget* BindWidgetSelected; // 0x438(0x08)
};

// Class TslGame.*c4bf206c76
// Size: 0x460 (Inherited: 0x410)
struct U*c4bf206c76 : U*17234a7c9b {
	float *de6e50ee5a; // 0x410(0x04)
	char pad_414[0xc]; // 0x414(0x0c)
	struct F*e9e2558d2e FadeInAnimation_Binder; // 0x420(0x20)
	struct F*e9e2558d2e FadeOutAnimation_Binder; // 0x440(0x20)
};

// Class TslGame.*c50c9c82ea
// Size: 0x4c8 (Inherited: 0x410)
struct U*c50c9c82ea : U*17234a7c9b {
	struct F*e9e2558d2e CountDownAnim_Ready; // 0x410(0x20)
	struct F*e9e2558d2e CountDownAnim_4; // 0x430(0x20)
	struct F*e9e2558d2e CountDownAnim_3; // 0x450(0x20)
	struct F*e9e2558d2e CountDownAnim_2; // 0x470(0x20)
	struct F*e9e2558d2e CountDownAnim_Go; // 0x490(0x20)
	struct UAkAudioEvent* *31895d3fa5; // 0x4b0(0x08)
	struct UAkAudioEvent* *7cf0ed86a8; // 0x4b8(0x08)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	void CountAnimPlay(); // Function TslGame.*c50c9c82ea.CountAnimPlay // None // @ game+0x55bc2c0
};

// Class TslGame.*2ea2d011d2
// Size: 0x458 (Inherited: 0x410)
struct U*2ea2d011d2 : U*17234a7c9b {
	struct F*f4f57b85a2 *c25a64039b; // 0x410(0x20)
	struct F*d3069d51ff *8178bdfe20; // 0x430(0x28)
};

// Class TslGame.*bb7bfcca66
// Size: 0x4c8 (Inherited: 0x458)
struct U*bb7bfcca66 : U*2ea2d011d2 {
	struct F*c233adf9bd UserPlatformImageWidget; // 0x458(0x20)
	struct F*f4f57b85a2 *fdb9ee0daa; // 0x478(0x20)
	struct F*f4f57b85a2 *a6ebdb8930; // 0x498(0x20)
	struct FString *ee17183a2b; // 0x4b8(0x10)

	void SetUserRankingInformation(); // Function TslGame.*bb7bfcca66.SetUserRankingInformation // None // @ game+0x55cf4ac
};

// Class TslGame.*237b569505
// Size: 0x4d0 (Inherited: 0x410)
struct U*237b569505 : U*17234a7c9b {
	struct TArray<struct U*bb7bfcca66*> *a4af89efdd; // 0x410(0x10)
	struct UClass* *e2036c1232; // 0x420(0x08)
	struct F*8e32972a91 *290c81e22c; // 0x428(0x28)
	struct F*8e32972a91 *0cdc8f98f4; // 0x450(0x28)
	struct F*f4f57b85a2 *4ad7162f5c; // 0x478(0x20)
	struct F*f4f57b85a2 *761d82e309; // 0x498(0x20)
	int32 *e951b8a9da; // 0x4b8(0x04)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct ATslRacingPlayerState* *cc98a4089b; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*237b569505.OnUpdateViewTarget // None // @ game+0x55c6dc0
	void UpdateRankingList(); // Function TslGame.*237b569505.UpdateRankingList // None // @ game+0x55d15e4
};

// Class TslGame.*5a79bab822
// Size: 0x4f0 (Inherited: 0x410)
struct U*5a79bab822 : U*17234a7c9b {
	struct F*f4f57b85a2 *c31e45ab0e; // 0x410(0x20)
	struct F*f4f57b85a2 *bdc0b7c11f; // 0x430(0x20)
	struct F*f4f57b85a2 *90eae8d67f; // 0x450(0x20)
	char pad_470[0x8]; // 0x470(0x08)
	struct F*d3069d51ff *0cf99a5296; // 0x478(0x28)
	int32 *9d32d18982; // 0x4a0(0x04)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct F*e9e2558d2e CheckPointReachAnim; // 0x4a8(0x20)
	struct F*f0cac2bec7 *e1adf65414; // 0x4c8(0x28)
};

// Class TslGame.*eefe68e6b3
// Size: 0x558 (Inherited: 0x410)
struct U*eefe68e6b3 : U*17234a7c9b {
	char pad_410[0x8]; // 0x410(0x08)
	struct FName *a0bf511087; // 0x418(0x08)
	struct UMaterialInstance* *72f48cee4c; // 0x420(0x08)
	float *52457b1462; // 0x428(0x04)
	float *f52da06002; // 0x42c(0x04)
	struct F*959656208f *50674f70e9; // 0x430(0x30)
	struct UHorizontalBox* HighlightBgHorizontalBox; // 0x460(0x08)
	struct UBorder* HighlightBGBorder; // 0x468(0x08)
	struct UImage* HighlightBgImage; // 0x470(0x08)
	struct UTslRichTextBlock* RichTextBlock; // 0x478(0x08)
	struct UImage* Img_MsgFromOutgameIcon; // 0x480(0x08)
	struct UImage* Img_FocusBg; // 0x488(0x08)
	struct UImage* Img_FocusLine; // 0x490(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x498(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x4a0(0x08)
	struct U*6b11b3bf02* HighlightAnim; // 0x4a8(0x08)
	struct U*6b11b3bf02* Anim_MsgFromOutgameIconAppear; // 0x4b0(0x08)
	struct FLinearColor *082e550850; // 0x4b8(0x10)
	struct FSlateFontInfo *76ee35d15c; // 0x4c8(0x68)
	struct U*bfbc16799c* *8c46e66bbf; // 0x530(0x08)
	char pad_538[0x20]; // 0x538(0x20)

	void *904d26a7d2(); // Function TslGame.*eefe68e6b3.*904d26a7d2 // None // @ game+0x55c2068
	void *c5804c96f5(); // Function TslGame.*eefe68e6b3.*c5804c96f5 // None // @ game+0x55c2054
};

// Class TslGame.*d6fbd75522
// Size: 0x4e0 (Inherited: 0x410)
struct U*d6fbd75522 : U*17234a7c9b {
	struct F*d3069d51ff *524b8a9502; // 0x410(0x28)
	struct F*c69f8ed24a *b6a8025912; // 0x438(0x28)
	struct F*c69f8ed24a *2de9a8e607; // 0x460(0x28)
	struct TMap<enum class ERankType, struct F*b57bfafecc> *8b56ec83ce; // 0x488(0x50)
	char pad_4D8[0x8]; // 0x4d8(0x08)

	enum class ERankType SetRankEmblemFromRankType(); // Function TslGame.*d6fbd75522.SetRankEmblemFromRankType // None // @ game+0x55ced2c
};

// Class TslGame.*0f3a9185b8
// Size: 0x410 (Inherited: 0x410)
struct U*0f3a9185b8 : U*17234a7c9b {
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x328(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x348(0x20)
	struct U*6b11b3bf02* Emerging; // 0x368(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x370(0x08)
	enum class ESlateVisibility *0d5cd6f4af; // 0x390(0x01)
	float *c0604b00ca; // 0x394(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *89f3008bea; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	struct F*f23e4e6c9e *883997f6a4; // 0x3a8(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d0(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f0(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x400(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // None // @ game+0x55f3bfc
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // None // @ game+0x55f3c2c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // None // @ game+0x55ba24c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // None // @ game+0x19e880
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // None // @ game+0x55f1c54
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // None // @ game+0x55e8a18
	struct FVector2D SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // None // @ game+0x55f82c0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // None // @ game+0x55fa6d8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // None // @ game+0x26a108
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // None // @ game+0x55f8218
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // None // @ game+0x55f3cc8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // None // @ game+0x55f3c14
};

// Class TslGame.TslRedeployDebugWidget
// Size: 0x4b0 (Inherited: 0x410)
struct UTslRedeployDebugWidget : U*17234a7c9b {
	struct UTextBlock* MatchState_ElapsedTimeText; // 0x410(0x08)
	struct UTextBlock* GameState_GatherPhaseText; // 0x418(0x08)
	struct UTextBlock* GameState_FightPhaseText; // 0x420(0x08)
	struct UTextBlock* GameState_MaxPhaseText; // 0x428(0x08)
	struct UTextBlock* GameState_EnableText; // 0x430(0x08)
	struct UTextBlock* GameState_FightingText; // 0x438(0x08)
	struct UTextBlock* GameState_GatherStartText; // 0x440(0x08)
	struct UTextBlock* GameState_GatherEndText; // 0x448(0x08)
	struct UTextBlock* GameState_ReviveText; // 0x450(0x08)
	struct UTextBlock* GameState_FightStartText; // 0x458(0x08)
	struct UTextBlock* GameState_FightEndText; // 0x460(0x08)
	struct UTextBlock* GameState_RedeployText; // 0x468(0x08)
	struct UTextBlock* PlayerState_TargetFightPhaseText; // 0x470(0x08)
	struct UTextBlock* PlayerState_TargetReviveText; // 0x478(0x08)
	struct UTextBlock* PlayerState_CurrentStateText; // 0x480(0x08)
	struct UTextBlock* PlayerState_PreviousStateText; // 0x488(0x08)
	struct UTextBlock* RedeployComp_HideLoadingScreenTimerText; // 0x490(0x08)
	struct UTextBlock* RedeployComp_RedeployAlarmTimerText; // 0x498(0x08)
	struct UTextBlock* RedeployComp_RedeployTimerText; // 0x4a0(0x08)
	enum class ETslRedeployPlayerState CurrentState; // 0x4a8(0x01)
	enum class ETslRedeployPlayerState *16cfb80f58; // 0x4a9(0x01)
	char pad_4AA[0x6]; // 0x4aa(0x06)
};

// Class TslGame.*5bb182cfda
// Size: 0x460 (Inherited: 0x410)
struct U*5bb182cfda : U*17234a7c9b {
	struct TArray<struct U*815d2345a4*> *51cc2ba959; // 0x410(0x10)
	float *9ff4063150; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct UImage* ArrowImage; // 0x428(0x08)
	struct UImage* RunningManImage; // 0x430(0x08)
	struct UImage* BarImage; // 0x438(0x08)
	struct UHorizontalBox* DotsHorizontalBox; // 0x440(0x08)
	struct UTextBlock* DescriptionText; // 0x448(0x08)
	struct UMaterialInstanceDynamic* *adadaab278; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
};

// Class TslGame.*54455f6bf3
// Size: 0x4a8 (Inherited: 0x410)
struct U*54455f6bf3 : U*17234a7c9b {
	struct F*f123c875f4 *00072dff44; // 0x410(0x40)
	struct F*f123c875f4 *29cc77e14f; // 0x450(0x40)
	struct UVerticalBox* VerticalBox; // 0x490(0x08)
	struct U*6b97f3293f* *674edb3615; // 0x498(0x08)
	struct U*5bb182cfda* *1c88a76f42; // 0x4a0(0x08)
};

// Class TslGame.*6b97f3293f
// Size: 0x430 (Inherited: 0x410)
struct U*6b97f3293f : U*17234a7c9b {
	struct UHorizontalBox* TimerHorBox; // 0x410(0x08)
	struct UImage* Icon; // 0x418(0x08)
	struct UTextBlock* TimeText; // 0x420(0x08)
	struct ATslGameState* GameState; // 0x428(0x08)
};

// Class TslGame.TslReloadingGuideWidget
// Size: 0x508 (Inherited: 0x410)
struct UTslReloadingGuideWidget : U*17234a7c9b {
	struct F*9c84e0ea54 *84e0671228; // 0x410(0x08)
	struct F*959656208f *7cf12e1e90; // 0x418(0x30)
	struct U*4175584972* MultipleKeyIconWidget; // 0x448(0x08)
	struct F*e9e2558d2e *a98920866d; // 0x450(0x20)
	struct FName *137e139446; // 0x470(0x08)
	struct FText *e3f53d4a78; // 0x478(0x18)
	struct FText *0f61a473be; // 0x490(0x18)
	struct FText *8243eb5614; // 0x4a8(0x18)
	char pad_4C0[0x48]; // 0x4c0(0x48)

	void OnNotifyGroggy(); // Function TslGame.TslReloadingGuideWidget.OnNotifyGroggy // None // @ game+0x55c4210
	void UpdatePropertiesFromKeyBinding(); // Function TslGame.TslReloadingGuideWidget.UpdatePropertiesFromKeyBinding // None // @ game+0x55d14a8
	void OnInteractionWidgetEnabled(); // Function TslGame.TslReloadingGuideWidget.OnInteractionWidgetEnabled // None // @ game+0x63c6a0
	void OnCharacterVault(); // Function TslGame.TslReloadingGuideWidget.OnCharacterVault // None // @ game+0x55c17b4
	void OnCharacterDeath(); // Function TslGame.TslReloadingGuideWidget.OnCharacterDeath // None // @ game+0x55c1728
	void *bc4bd06424(); // Function TslGame.TslReloadingGuideWidget.*bc4bd06424 // None // @ game+0x55ba214
	void OnReloadPadInput(); // Function TslGame.TslReloadingGuideWidget.OnReloadPadInput // None // @ game+0xb51a2c
};

// Class TslGame.*84dbe7e5b9
// Size: 0x420 (Inherited: 0x410)
struct U*84dbe7e5b9 : U*17234a7c9b {
	struct U*bde5e52cf2* PubgIdWidget; // 0x410(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x418(0x08)

	void RefreshPubgIdBySpectator(); // Function TslGame.*84dbe7e5b9.RefreshPubgIdBySpectator // None // @ game+0x55c87e0
};

// Class TslGame.TslRichTextBlock
// Size: 0x640 (Inherited: 0x410)
struct UTslRichTextBlock : U*17234a7c9b {
	struct FText *01a6ca3f58; // 0x410(0x18)
	struct TMap<struct FString, struct F*c9e2b1ab63> *8e50c50ae0; // 0x428(0x50)
	struct FSlateFontInfo FontInfo; // 0x478(0x68)
	struct FSlateColor *157cdf2db7; // 0x4e0(0x28)
	struct FVector2D *ade98149bb; // 0x508(0x08)
	struct FLinearColor *e478c399e9; // 0x510(0x10)
	float *ea7bf7ca07; // 0x520(0x04)
	bool *2fd67b022c; // 0x524(0x01)
	char pad_525[0x3]; // 0x525(0x03)
	float *4455cdaf73; // 0x528(0x04)
	enum class *00a79681fd *046e69ae98; // 0x52c(0x01)
	bool *f8a3653053; // 0x52d(0x01)
	char pad_52E[0x1]; // 0x52e(0x01)
	enum class EVerticalAlignment *0fc375487e; // 0x52f(0x01)
	struct FSlateChildSize *d982d6a72d; // 0x530(0x08)
	float *88161e7aa0; // 0x538(0x04)
	struct FSlateChildSize *7dba0f7357; // 0x53c(0x08)
	struct FVector2D *789452384a; // 0x544(0x08)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UVerticalBox* MainVerticalBox; // 0x550(0x08)
	struct TArray<struct USpacer*> *80ea26efc5; // 0x558(0x10)
	struct TArray<struct UHorizontalBox*> *3af6a8f73d; // 0x568(0x10)
	struct TArray<struct UTextBlock*> *c46cc41cc4; // 0x578(0x10)
	struct TArray<struct UImage*> *118aacda04; // 0x588(0x10)
	struct TArray<struct USizeBox*> *84d3db8af9; // 0x598(0x10)
	struct TArray<struct UOverlay*> *39ca65b51b; // 0x5a8(0x10)
	struct UHorizontalBox* *6d2a215226; // 0x5b8(0x08)
	char pad_5C0[0x10]; // 0x5c0(0x10)
	struct UClass* KeyIconWidgetClass; // 0x5d0(0x08)
	char pad_5D8[0x18]; // 0x5d8(0x18)
	struct TMap<struct FName, struct F*68031af743> *8413ec12cf; // 0x5f0(0x50)

	void UpdateText(); // Function TslGame.TslRichTextBlock.UpdateText // None // @ game+0x55d183c
};

// Class TslGame.*00685a4b01
// Size: 0x428 (Inherited: 0x410)
struct U*00685a4b01 : U*17234a7c9b {
	struct UWidgetSwitcher* SlotWidgetSwitcher; // 0x410(0x08)
	struct U*6b11b3bf02* Anim_Start; // 0x418(0x08)
	enum class ERoundEndPointType *0697609f76; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
};

// Class TslGame.*b41f3999ef
// Size: 0x4b0 (Inherited: 0x410)
struct U*b41f3999ef : U*17234a7c9b {
	struct UClass* RoundEndPointClass; // 0x410(0x08)
	float PointWidgetAnimDelayTime; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct FString *f112d8bd00; // 0x420(0x10)
	struct FString *e3ec5833e6; // 0x430(0x10)
	struct FString *741fd66f0b; // 0x440(0x10)
	struct FString *e89ed26fb6; // 0x450(0x10)
	struct FString *1a27da00e1; // 0x460(0x10)
	struct FString *3aeee55464; // 0x470(0x10)
	struct FString *a956b8c815; // 0x480(0x10)
	struct UStringTable* ST_RoundSystem; // 0x490(0x08)
	char pad_498[0x18]; // 0x498(0x18)

	struct ATslBaseHUD* *8e0a56a149(); // Function TslGame.*b41f3999ef.*8e0a56a149 // None // @ game+0x55c78d0
	void *3bc25a0c52(); // Function TslGame.*b41f3999ef.*3bc25a0c52 // None // @ game+0x55c836c
};

// Class TslGame.*6a9aba36d4
// Size: 0x4e8 (Inherited: 0x4b0)
struct U*6a9aba36d4 : U*b41f3999ef {
	struct UTextBlock* MatchEndText; // 0x4b0(0x08)
	struct UTextBlock* MatchResultText; // 0x4b8(0x08)
	struct UTextBlock* ObserverTeamName; // 0x4c0(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4c8(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4d0(0x08)
	struct U*6b11b3bf02* Victory_Anim; // 0x4d8(0x08)
	struct U*6b11b3bf02* Defeat_Anim; // 0x4e0(0x08)
};

// Class TslGame.*9eeafe83c9
// Size: 0x5b0 (Inherited: 0x4b0)
struct U*9eeafe83c9 : U*b41f3999ef {
	struct UTextBlock* CurrentRoundText; // 0x4b0(0x08)
	struct UTextBlock* CurrentRoundResultText; // 0x4b8(0x08)
	struct UTextBlock* CurrentRoundScoreText; // 0x4c0(0x08)
	struct UTextBlock* YourTeamText; // 0x4c8(0x08)
	struct UTextBlock* EnemyTeamText; // 0x4d0(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4d8(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4e0(0x08)
	struct U*7f757909f6* YourTeamPlatformIcon; // 0x4e8(0x08)
	struct U*7f757909f6* EnemyTeamPlatformIcon; // 0x4f0(0x08)
	struct UHorizontalBox* RoundPointHorizontalBox; // 0x4f8(0x08)
	struct TArray<struct U*00685a4b01*> *8d53587d0e; // 0x500(0x10)
	struct U*6b11b3bf02* WinEffectAnim; // 0x510(0x08)
	struct U*6b11b3bf02* LossEffectAnim; // 0x518(0x08)
	struct U*6b11b3bf02* DrawEffectAnim; // 0x520(0x08)
	struct F*eaae7901d4 NormalRoundPanel; // 0x528(0x20)
	struct F*eaae7901d4 ZombieDefensePanel; // 0x548(0x20)
	struct F*f4f57b85a2 RoundText; // 0x568(0x20)
	struct UStringTable* ZombieDefenseTable; // 0x588(0x08)
	struct UAkAudioEvent* *2fbb784618; // 0x590(0x08)
	struct UAkAudioEvent* *612b1a3159; // 0x598(0x08)
	struct U*1ff393c1cd* PlayerWinningStreak; // 0x5a0(0x08)
	struct U*1ff393c1cd* EnemyWinningStreak; // 0x5a8(0x08)
};

// Class TslGame.*4dec0d5f61
// Size: 0x470 (Inherited: 0x410)
struct U*4dec0d5f61 : U*17234a7c9b {
	struct UTextBlock* RoundNumberText; // 0x410(0x08)
	struct U*6b11b3bf02* RoundStart_Anim; // 0x418(0x08)
	struct UTextBlock* RoundText; // 0x420(0x08)
	struct UStringTable* ZombieDefenseTable; // 0x428(0x08)
	char pad_430[0x40]; // 0x430(0x40)

	struct ATslBaseHUD* *8e0a56a149(); // Function TslGame.*4dec0d5f61.*8e0a56a149 // None // @ game+0x55c7ad8
};

// Class TslGame.*a00958ae09
// Size: 0x450 (Inherited: 0x410)
struct U*a00958ae09 : U*17234a7c9b {
	struct UHorizontalBox* YourTeamPointBox; // 0x410(0x08)
	struct UHorizontalBox* EnemyTeamPointBox; // 0x418(0x08)
	struct UClass* RoundEndPointClass; // 0x420(0x08)
	struct TArray<struct U*00685a4b01*> *32b124f272; // 0x428(0x10)
	struct TArray<struct U*00685a4b01*> *c27716e21d; // 0x438(0x10)
	char pad_448[0x8]; // 0x448(0x08)

	void OnMatchStateChanged(); // Function TslGame.*a00958ae09.OnMatchStateChanged // None // @ game+0xc7bf7c
	void UpdatePointList(); // Function TslGame.*a00958ae09.UpdatePointList // None // @ game+0x55d1458
	struct ATslBaseHUD* *8e0a56a149(); // Function TslGame.*a00958ae09.*8e0a56a149 // None // @ game+0x55c7cdc
};

// Class TslGame.*9046b6fd8d
// Size: 0x418 (Inherited: 0x410)
struct U*9046b6fd8d : U*17234a7c9b {
	struct UWidgetSwitcher* KeyGuideSwitcher; // 0x410(0x08)
};

// Class TslGame.*2ee0f1ff92
// Size: 0x460 (Inherited: 0x410)
struct U*2ee0f1ff92 : U*17234a7c9b {
	char pad_410[0x10]; // 0x410(0x10)
	struct UTextBlock* TitleTextBlock; // 0x420(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x428(0x08)
	struct UClass* *4e948bf043; // 0x430(0x08)
	enum class ESandboxGroypType *81bbdcf16d; // 0x438(0x01)
	char pad_439[0x27]; // 0x439(0x27)
};

// Class TslGame.*946737677d
// Size: 0x468 (Inherited: 0x460)
struct U*946737677d : U*2ee0f1ff92 {
	bool *15ccf1f414; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
};

// Class TslGame.*546fa32acb
// Size: 0x468 (Inherited: 0x460)
struct U*546fa32acb : U*2ee0f1ff92 {
	struct UVerticalBox* RootVerticalBox; // 0x460(0x08)
};

// Class TslGame.*67726edb33
// Size: 0x468 (Inherited: 0x410)
struct U*67726edb33 : U*17234a7c9b {
	char pad_410[0x8]; // 0x410(0x08)
	bool *29f0d3ad02; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UTextBlock* ItemTextBlock; // 0x420(0x08)
	struct U*0399764a34* ItemTextBlock_Flow; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
	struct FLinearColor *12fd9c3bc7; // 0x438(0x10)
	struct FLinearColor *7969c861ac; // 0x448(0x10)
	char pad_458[0x10]; // 0x458(0x10)
};

// Class TslGame.*f3292ffd90
// Size: 0x488 (Inherited: 0x468)
struct U*f3292ffd90 : U*67726edb33 {
	char pad_468[0x8]; // 0x468(0x08)
	struct UButton* ItemButton; // 0x470(0x08)
	struct UImage* Img_SelectOutLine; // 0x478(0x08)
	struct UImage* Img_SelectGradientBg; // 0x480(0x08)

	void OnHover_Button(); // Function TslGame.*f3292ffd90.OnHover_Button // None // @ game+0x55c2b38
	void OnUnhover_Button(); // Function TslGame.*f3292ffd90.OnUnhover_Button // None // @ game+0x55c69ec
	void OnClick_Button(); // Function TslGame.*f3292ffd90.OnClick_Button // None // @ game+0x55c17c8
};

// Class TslGame.*168bb6e318
// Size: 0x498 (Inherited: 0x488)
struct U*168bb6e318 : U*f3292ffd90 {
	enum class ESandboxSpecialButtonType *fb89bc0044; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)
	struct UImage* ItemIcon_Image; // 0x490(0x08)
};

// Class TslGame.*7c08049d05
// Size: 0x4d0 (Inherited: 0x488)
struct U*7c08049d05 : U*f3292ffd90 {
	struct UClass* *4e948bf043; // 0x488(0x08)
	struct UBorder* ItemBorder; // 0x490(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x498(0x08)
	struct UWidgetSwitcher* ExpandSwitcher; // 0x4a0(0x08)
	char pad_4A8[0x28]; // 0x4a8(0x28)
};

// Class TslGame.*8da27f3b93
// Size: 0x498 (Inherited: 0x488)
struct U*8da27f3b93 : U*f3292ffd90 {
	struct UWidgetSwitcher* ItemWidgetSwitcher; // 0x488(0x08)
	enum class ESandboxPowerType *fa7b840ce4; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)

	void *18f710189d(); // Function TslGame.*8da27f3b93.*18f710189d // None // @ game+0x55c27b4
};

// Class TslGame.*4d40ea157d
// Size: 0x4b0 (Inherited: 0x468)
struct U*4d40ea157d : U*67726edb33 {
	char pad_468[0x8]; // 0x468(0x08)
	struct UImage* Img_SelectOutLine; // 0x470(0x08)
	struct UImage* Img_SelectGradientBg; // 0x478(0x08)
	struct FName ItemID; // 0x480(0x08)
	struct FText *0a7298ed37; // 0x488(0x18)
	char pad_4A0[0x8]; // 0x4a0(0x08)
	float *177b325cf5; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)
};

// Class TslGame.*3ad9ebe0b9
// Size: 0x4e0 (Inherited: 0x4b0)
struct U*3ad9ebe0b9 : U*4d40ea157d {
	struct UButton* ItemButton; // 0x4b0(0x08)
	struct UClass* *eb935de0c2; // 0x4b8(0x08)
	struct UItem* *0c03cda5ee; // 0x4c0(0x08)
	struct U*c766af2c23* *11e1405162; // 0x4c8(0x08)
	char pad_4D0[0x10]; // 0x4d0(0x10)

	void OnClicked_ItemButton(); // Function TslGame.*3ad9ebe0b9.OnClicked_ItemButton // None // @ game+0x55c1870
};

// Class TslGame.*8d0df6c5dc
// Size: 0x4d0 (Inherited: 0x4b0)
struct U*8d0df6c5dc : U*4d40ea157d {
	struct UBorder* ItemBorder; // 0x4b0(0x08)
	struct U*c6addfa12b* *c5d623a65e; // 0x4b8(0x08)
	char pad_4C0[0x10]; // 0x4c0(0x10)
};

// Class TslGame.*6d5c51ae3f
// Size: 0x4f0 (Inherited: 0x4d0)
struct U*6d5c51ae3f : U*8d0df6c5dc {
	char pad_4D0[0x8]; // 0x4d0(0x08)
	struct U*a276958e5c* SliderWidget; // 0x4d8(0x08)
	char pad_4E0[0x10]; // 0x4e0(0x10)
};

// Class TslGame.*5b34c8d236
// Size: 0x560 (Inherited: 0x4d0)
struct U*5b34c8d236 : U*8d0df6c5dc {
	char pad_4D0[0x80]; // 0x4d0(0x80)
	struct U*8f5d236427* StepperWidget; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)
};

// Class TslGame.*778ef3e4cb
// Size: 0x490 (Inherited: 0x468)
struct U*778ef3e4cb : U*67726edb33 {
	struct UTextBlock* CurNumberTextBlock; // 0x468(0x08)
	struct UTextBlock* MaxNumberTextBlock; // 0x470(0x08)
	struct UImage* SliderImage; // 0x478(0x08)
	enum class ESandboxQuantityType *f14a831a84; // 0x480(0x04)
	char pad_484[0xc]; // 0x484(0x0c)

	void *66d9166473(); // Function TslGame.*778ef3e4cb.*66d9166473 // None // @ game+0x55c5c8c
};

// Class TslGame.*a4ae2a7d70
// Size: 0x410 (Inherited: 0x410)
struct U*a4ae2a7d70 : U*17234a7c9b {
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x328(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x348(0x20)
	struct U*6b11b3bf02* Emerging; // 0x368(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x370(0x08)
	enum class ESlateVisibility *0d5cd6f4af; // 0x390(0x01)
	float *c0604b00ca; // 0x394(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *89f3008bea; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	struct F*f23e4e6c9e *883997f6a4; // 0x3a8(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d0(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f0(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x400(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // None // @ game+0x55f3bfc
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // None // @ game+0x55f3c2c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // None // @ game+0x55ba24c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // None // @ game+0x19e880
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // None // @ game+0x55f1c54
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // None // @ game+0x55e8a18
	struct FVector2D SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // None // @ game+0x55f82c0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // None // @ game+0x55fa6d8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // None // @ game+0x26a108
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // None // @ game+0x55f8218
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // None // @ game+0x55f3cc8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // None // @ game+0x55f3c14
};

// Class TslGame.*83aac0bdaf
// Size: 0x460 (Inherited: 0x410)
struct U*83aac0bdaf : U*17234a7c9b {
	struct TArray<struct UScreenIndicatorBaseWidget*> *eb6538eddb; // 0x410(0x10)
	struct UClass* *374bb7375a; // 0x420(0x08)
	struct F*f23e4e6c9e *333c4c00c5; // 0x428(0x28)
	char pad_450[0x10]; // 0x450(0x10)
};

// Class TslGame.*4f060e8de2
// Size: 0x4c0 (Inherited: 0x460)
struct U*4f060e8de2 : U*83aac0bdaf {
	struct TMap<struct FString, struct UCaptureObjectIndicatorWidget*> *205877f01d; // 0x460(0x50)
	struct TArray<struct ACaptureAreaActor*> *731f610630; // 0x4b0(0x10)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.*4f060e8de2.OnActivatedCaptureAreaUpdated // None // @ game+0x55c0704
};

// Class TslGame.*f51e379ce5
// Size: 0x470 (Inherited: 0x460)
struct U*f51e379ce5 : U*83aac0bdaf {
	struct TArray<struct U*ad41f2b83f*> *facf419e63; // 0x460(0x10)

	void SetSmokeIndicatorWidget(); // Function TslGame.*f51e379ce5.SetSmokeIndicatorWidget // None // @ game+0x55cf140
};

// Class TslGame.*e60b88f076
// Size: 0x468 (Inherited: 0x460)
struct U*e60b88f076 : U*83aac0bdaf {
	struct U*12e7062807* *a17825294c; // 0x460(0x08)
};

// Class TslGame.*107d56143b
// Size: 0x480 (Inherited: 0x460)
struct U*107d56143b : U*83aac0bdaf {
	struct TArray<struct U*09a973f12f*> *3a54243f0a; // 0x460(0x10)
	struct TArray<struct ATslCharacter*> *044ad6bc75; // 0x470(0x10)

	void AddDetectionHumans(); // Function TslGame.*107d56143b.AddDetectionHumans // None // @ game+0x55b8be4
};

// Class TslGame.*7d44972923
// Size: 0x478 (Inherited: 0x460)
struct U*7d44972923 : U*83aac0bdaf {
	struct TArray<struct UScreenIndicatorBaseWidget*> *eb6538eddb; // 0x410(0x10)
	struct UClass* *374bb7375a; // 0x420(0x08)
	struct F*f23e4e6c9e *333c4c00c5; // 0x428(0x28)
};

// Class TslGame.*2e81ca5fca
// Size: 0x470 (Inherited: 0x460)
struct U*2e81ca5fca : U*83aac0bdaf {
	struct TArray<struct U*7e62be7364*> *9d512c833f; // 0x460(0x10)

	void *4cd8fd9118(); // Function TslGame.*2e81ca5fca.*4cd8fd9118 // None // @ game+0x55b8cac
	void *ddf9eca1e4(); // Function TslGame.*2e81ca5fca.*ddf9eca1e4 // None // @ game+0x55bc350
};

// Class TslGame.*45675a1147
// Size: 0x488 (Inherited: 0x460)
struct U*45675a1147 : U*83aac0bdaf {
	struct UClass* *0e67549a89; // 0x460(0x08)
	struct TArray<struct UTeamMarkWidget*> *d0df02fd6a; // 0x468(0x10)
	struct U*c1ec15d465* *c1ec15d465; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)
};

// Class TslGame.*de1a9a2a1e
// Size: 0x450 (Inherited: 0x410)
struct U*de1a9a2a1e : U*17234a7c9b {
	struct UButton* ApplyButton; // 0x410(0x08)
	struct UWidgetSwitcher* MouseHoverSwitcher; // 0x418(0x08)
	struct UImage* ConsoleFocusImage; // 0x420(0x08)
	struct UImage* IconImage; // 0x428(0x08)
	struct UTextBlock* NameText; // 0x430(0x08)
	int32 *993e920d76; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct U*588043edf8* *7c278bc048; // 0x440(0x08)
	bool *028d517a1d; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
};

// Class TslGame.*a7fec450db
// Size: 0x468 (Inherited: 0x450)
struct U*a7fec450db : U*de1a9a2a1e {
	struct U*6b11b3bf02* PressedPcAni; // 0x450(0x08)
	struct U*6b11b3bf02* PressedConsoleAni; // 0x458(0x08)
	struct FName *1bb52f298e; // 0x460(0x08)
};

// Class TslGame.*a276958e5c
// Size: 0x4c0 (Inherited: 0x410)
struct U*a276958e5c : U*17234a7c9b {
	char pad_410[0x70]; // 0x410(0x70)
	struct USlider* MainSlider; // 0x480(0x08)
	struct UEditableText* EditableValueText; // 0x488(0x08)
	struct UBorder* EditableTextBorder; // 0x490(0x08)
	char pad_498[0x28]; // 0x498(0x28)

	void HandleOnSliderValueChanged(); // Function TslGame.*a276958e5c.HandleOnSliderValueChanged // None // @ game+0x55be4e8
	void HandleOnTextValueChanged(); // Function TslGame.*a276958e5c.HandleOnTextValueChanged // None // @ game+0x55be580
};

// Class TslGame.*55013c6405
// Size: 0x438 (Inherited: 0x410)
struct U*55013c6405 : U*17234a7c9b {
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x328(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x348(0x20)
	struct U*6b11b3bf02* Emerging; // 0x368(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x370(0x08)
	enum class ESlateVisibility *0d5cd6f4af; // 0x390(0x01)
	float *c0604b00ca; // 0x394(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *89f3008bea; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	struct F*f23e4e6c9e *883997f6a4; // 0x3a8(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d0(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f0(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x400(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // None // @ game+0x55f3bfc
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // None // @ game+0x55f3c2c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // None // @ game+0x55ba24c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // None // @ game+0x19e880
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // None // @ game+0x55f1c54
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // None // @ game+0x55e8a18
	struct FVector2D SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // None // @ game+0x55f82c0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // None // @ game+0x55fa6d8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // None // @ game+0x26a108
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // None // @ game+0x55f8218
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // None // @ game+0x55f3cc8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // None // @ game+0x55f3c14
};

// Class TslGame.TDMSpawnKitItemWidget
// Size: 0x4a0 (Inherited: 0x438)
struct UTDMSpawnKitItemWidget : U*55013c6405 {
	struct UWidgetSwitcher* SpawnKitButtonSwitcher; // 0x438(0x08)
	struct UButton* SpawnKitButtonDefaultButton; // 0x440(0x08)
	struct UButton* SpawnKitButtonSelectButton; // 0x448(0x08)
	struct UImage* DefaultSpawnKitWeaponIcon; // 0x450(0x08)
	struct UImage* SelectSpawnKitWeaponIcon; // 0x458(0x08)
	struct UTextBlock* DefaultSpawnKitName; // 0x460(0x08)
	struct UTextBlock* SelectSpawnKitName; // 0x468(0x08)
	struct UBorder* DefaultBorder; // 0x470(0x08)
	struct FLinearColor *97b7459e20; // 0x478(0x10)
	struct FLinearColor *0d54f39843; // 0x488(0x10)
	char pad_498[0x8]; // 0x498(0x08)

	void OnSelected(); // Function TslGame.TDMSpawnKitItemWidget.OnSelected // None // @ game+0x55c2b38
	void OnAsyncLoadIconFinished(); // Function TslGame.TDMSpawnKitItemWidget.OnAsyncLoadIconFinished // None // @ game+0x55c0abc
};

// Class TslGame.TslSpawnKitItemWidget
// Size: 0x4b0 (Inherited: 0x438)
struct UTslSpawnKitItemWidget : U*55013c6405 {
	char pad_438[0x20]; // 0x438(0x20)
	struct UButton* ButtonForSelector; // 0x458(0x08)
	struct UTextBlock* TextBlockForTitle; // 0x460(0x08)
	struct UBorder* ButtonBorder; // 0x468(0x08)
	struct UWidget* CheckMarkSizeBox; // 0x470(0x08)
	struct UWidget* ButtonForSelectorFocus; // 0x478(0x08)
	struct FLinearColor *e0dca5cef1; // 0x480(0x10)
	struct FLinearColor *12c561f86a; // 0x490(0x10)
	struct FLinearColor *89025cadec; // 0x4a0(0x10)

	void OnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnHovered // None // @ game+0x55c2b50
	void OnUnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnUnHovered // None // @ game+0x55c69a4
	void OnSelected(); // Function TslGame.TslSpawnKitItemWidget.OnSelected // None // @ game+0x55c2b38
};

// Class TslGame.*b731e2cfce
// Size: 0x420 (Inherited: 0x410)
struct U*b731e2cfce : U*17234a7c9b {
	struct U*bde5e52cf2* PubgIdWidget; // 0x410(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x418(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*b731e2cfce.OnUpdateViewTarget // None // @ game+0x55c6e4c
};

// Class TslGame.*37bcacb837
// Size: 0x438 (Inherited: 0x410)
struct U*37bcacb837 : U*17234a7c9b {
	struct F*b9afef7a3a *7616498344; // 0x410(0x28)

	void UpdateDesign_Normal(); // Function TslGame.*37bcacb837.UpdateDesign_Normal // None // @ game+0x26a108
	void UpdateDesign_Selected(); // Function TslGame.*37bcacb837.UpdateDesign_Selected // None // @ game+0x26a108
};

// Class TslGame.*405ca825a1
// Size: 0x458 (Inherited: 0x410)
struct U*405ca825a1 : U*17234a7c9b {
	float *8be79bb7b9; // 0x410(0x04)
	int32 *ba235b2674; // 0x414(0x04)
	int32 *d57e4d2bc3; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct TArray<struct U*37bcacb837*> *a5f91f2b70; // 0x420(0x10)
	struct UClass* *834a9d4391; // 0x430(0x08)
	struct F*7f3debddd2 *0238dd1706; // 0x438(0x20)
};

// Class TslGame.*7c63a9789e
// Size: 0x478 (Inherited: 0x410)
struct U*7c63a9789e : U*17234a7c9b {
	struct FMulticastDelegate OnClickedTabButtonWidget; // 0x410(0x10)
	struct FString TitleKeyString; // 0x420(0x10)
	struct FText TitleText; // 0x430(0x18)
	struct UTextBlock* TitleNormal; // 0x448(0x08)
	struct UTextBlock* TitleSelected; // 0x450(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x458(0x08)
	struct UButton* OutsideButton; // 0x460(0x08)
	struct UImage* NotificationImage; // 0x468(0x08)
	bool bTurnOffNotificationIfClicked; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)

	void OnClicked(); // Function TslGame.*7c63a9789e.OnClicked // None // @ game+0x55c17c8
};

// Class TslGame.*cd61048c73
// Size: 0x488 (Inherited: 0x478)
struct U*cd61048c73 : U*7c63a9789e {
	struct FMulticastDelegate OnClickedTabButtonWidget; // 0x410(0x10)
	struct FString TitleKeyString; // 0x420(0x10)
	struct FText TitleText; // 0x430(0x18)
	struct UTextBlock* TitleNormal; // 0x448(0x08)
	struct UTextBlock* TitleSelected; // 0x450(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x458(0x08)
	struct UButton* OutsideButton; // 0x460(0x08)
	struct UImage* NotificationImage; // 0x468(0x08)
	bool bTurnOffNotificationIfClicked; // 0x470(0x01)

	void OnClicked(); // Function TslGame.*7c63a9789e.OnClicked // None // @ game+0x55c17c8
};

// Class TslGame.*f40a5ea5a7
// Size: 0x440 (Inherited: 0x410)
struct U*f40a5ea5a7 : U*17234a7c9b {
	struct FMulticastDelegate OnTabGroupUpdated; // 0x410(0x10)
	struct TArray<struct U*7c63a9789e*> *acddc294df; // 0x420(0x10)
	struct UWidget* TabHorizontalBox; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)

	void UpdateIndexToBP(); // Function TslGame.*f40a5ea5a7.UpdateIndexToBP // None // @ game+0x55d1068
	void UpdateCurrentIndex(); // Function TslGame.*f40a5ea5a7.UpdateCurrentIndex // None // @ game+0x55d0e84
	void ResetTabGroup(); // Function TslGame.*f40a5ea5a7.ResetTabGroup // None // @ game+0x55c8dcc
	void UpdateIndexTo(); // Function TslGame.*f40a5ea5a7.UpdateIndexTo // None // @ game+0x55d1068
};

// Class TslGame.*8ad6576fd3
// Size: 0x500 (Inherited: 0x410)
struct U*8ad6576fd3 : U*17234a7c9b {
	DelegateProperty *63501e5574; // 0x410(0x10)
	struct FText TitleText; // 0x420(0x18)
	struct FString TitleKeyString; // 0x438(0x10)
	struct F*f4f57b85a2 *304d6a466d; // 0x448(0x20)
	struct F*f4f57b85a2 *bbc6108f92; // 0x468(0x20)
	struct F*b9afef7a3a *7616498344; // 0x488(0x28)
	struct F*7f3debddd2 *a1564ac60a; // 0x4b0(0x20)
	struct F*d3069d51ff *b1a5557fc5; // 0x4d0(0x28)
	char pad_4F8[0x8]; // 0x4f8(0x08)

	void OnClicked(); // Function TslGame.*8ad6576fd3.OnClicked // None // @ game+0x55c17e0
	void UpdateTitleText(); // Function TslGame.*8ad6576fd3.UpdateTitleText // None // @ game+0x55d1850
	void UpdateDesign_Selected(); // Function TslGame.*8ad6576fd3.UpdateDesign_Selected // None // @ game+0x26a108
};

// Class TslGame.*8e3e737c04
// Size: 0x808 (Inherited: 0x410)
struct U*8e3e737c04 : U*17234a7c9b {
	char pad_410[0x8]; // 0x410(0x08)
	struct F*8e32972a91 *2c113badb0; // 0x418(0x28)
	struct F*959656208f *1ed0bd479d; // 0x440(0x30)
	struct F*b9afef7a3a *0294d0bb97; // 0x470(0x28)
	struct F*c69f8ed24a *9051b1fc28; // 0x498(0x28)
	struct F*e9e2558d2e *855a1a79f1; // 0x4c0(0x20)
	struct F*e9e2558d2e *d70b087c0f; // 0x4e0(0x20)
	struct F*c233adf9bd *b0d6bb393d; // 0x500(0x20)
	struct F*fd985b6c41 *fd985b6c41; // 0x520(0x10)
	struct UWidgetSwitcher* PlayerStateIconsSwitcher; // 0x530(0x08)
	struct UTextBlock* PlayerNameText; // 0x538(0x08)
	struct UWidgetSwitcher* PlayerColorSwitcher; // 0x540(0x08)
	struct UWidgetSwitcher* PlayerIconNumberSwitcher; // 0x548(0x08)
	struct UImage* MarkerImage; // 0x550(0x08)
	struct UImage* PlayerBoostGaugeImage; // 0x558(0x08)
	struct UTextBlock* FollowNumTxt; // 0x560(0x08)
	struct UImage* FollowArrowImg; // 0x568(0x08)
	struct UImage* IconItemRequest; // 0x570(0x08)
	struct UImage* IconSpecificModeImage; // 0x578(0x08)
	char pad_580[0x8]; // 0x580(0x08)
	struct F*b9afef7a3a *ffc0a347b3; // 0x588(0x28)
	float *ae3ecefa56; // 0x5b0(0x04)
	float *bf5a1eab71; // 0x5b4(0x04)
	struct F*959656208f *efbe13be1c; // 0x5b8(0x30)
	struct F*f4f57b85a2 *238d5c553f; // 0x5e8(0x20)
	struct F*c233adf9bd *8ae71cae91; // 0x608(0x20)
	struct F*c69f8ed24a *29dfb3a2b9; // 0x628(0x28)
	struct F*b9afef7a3a *7e44993ad9; // 0x650(0x28)
	struct F*7f3debddd2 *0634a85240; // 0x678(0x20)
	struct F*b9afef7a3a *1b9726d94d; // 0x698(0x28)
	struct F*b9afef7a3a *f07e579b17; // 0x6c0(0x28)
	struct F*7f3debddd2 *57baa3765c; // 0x6e8(0x20)
	struct ATeam* Team; // 0x708(0x08)
	struct FLinearColor *acda625090; // 0x710(0x10)
	struct TArray<struct UTexture2D*> *b043984d4a; // 0x720(0x10)
	struct UTexture2D* *a7bb75ab40; // 0x730(0x08)
	struct F*d3069d51ff *0aa81400f6; // 0x738(0x28)
	struct UTextBlock* ComeBackWarRemainText; // 0x760(0x08)
	struct UTextBlock* BindTextComebackTime; // 0x768(0x08)
	struct UBorder* PlayerStateIconsBorder; // 0x770(0x08)
	struct UBorder* PlayerInfoBorder; // 0x778(0x08)
	struct UBorder* PlayerGaugeBorder; // 0x780(0x08)
	struct UBorder* TeamFollowBorder; // 0x788(0x08)
	struct UBorder* TeamVoiceBorder; // 0x790(0x08)
	struct UTexture2D* *4a2a27528a; // 0x798(0x08)
	struct UTexture2D* *dfcefd74c4; // 0x7a0(0x08)
	struct ATslCharacter* *855403ca25; // 0x7a8(0x08)
	char pad_7B0[0x10]; // 0x7b0(0x10)
	float *87c33c9323; // 0x7c0(0x04)
	bool *5f72e045aa; // 0x7c4(0x01)
	char pad_7C5[0x1]; // 0x7c5(0x01)
	bool *ba1113418e; // 0x7c6(0x01)
	char pad_7C7[0x41]; // 0x7c7(0x41)

	void *36a4cb28ae(); // Function TslGame.*8e3e737c04.*36a4cb28ae // None // @ game+0x55b9ca8
	void *452f883e28(); // Function TslGame.*8e3e737c04.*452f883e28 // None // @ game+0x55c8cbc
	void OnParticipantMuteChanged(struct FString ParticipantId); // Function TslGame.*8e3e737c04.OnParticipantMuteChanged // None // @ game+0x26a108
	void *6d74ea3716(); // Function TslGame.*8e3e737c04.*6d74ea3716 // None // @ game+0x55d1828
	struct FString OnNativeParticipantMuteChanged(); // Function TslGame.*8e3e737c04.OnNativeParticipantMuteChanged // None // @ game+0x55c3f44
	void *09ad38e707(); // Function TslGame.*8e3e737c04.*09ad38e707 // None // @ game+0x55d1444
	void OnLeaveTeamVoiceChannel(); // Function TslGame.*8e3e737c04.OnLeaveTeamVoiceChannel // None // @ game+0x55c2e80
	struct FString OnNativeParticipantRestrictionChanged(); // Function TslGame.*8e3e737c04.OnNativeParticipantRestrictionChanged // None // @ game+0x55c40dc
	void *56bf189255(); // Function TslGame.*8e3e737c04.*56bf189255 // None // @ game+0x55d1814
	struct FString *d2c9371cd5(); // Function TslGame.*8e3e737c04.*d2c9371cd5 // None // @ game+0x55bd5b0
	void UpdateVoiceStatusOnly(bool Param0); // Function TslGame.*8e3e737c04.UpdateVoiceStatusOnly // None // @ game+0x49c8d0
	void NotifyEngageAttacked(); // Function TslGame.*8e3e737c04.NotifyEngageAttacked // None // @ game+0xa4e30c
	void *8963910f85(); // Function TslGame.*8e3e737c04.*8963910f85 // None // @ game+0x55d1054
	struct FString UpdateVoiceChat(bool Param1); // Function TslGame.*8e3e737c04.UpdateVoiceChat // None // @ game+0x55d1a2c
	void *192534a0fd(); // Function TslGame.*8e3e737c04.*192534a0fd // None // @ game+0x55c8d0c
	void *095cfc1337(); // Function TslGame.*8e3e737c04.*095cfc1337 // None // @ game+0x55d17a0
	void *589ece967a(); // Function TslGame.*8e3e737c04.*589ece967a // None // @ game+0x55d0b64
	bool *138616108d(); // Function TslGame.*8e3e737c04.*138616108d // None // @ game+0x55c7534
	void *bd2a2a597f(); // Function TslGame.*8e3e737c04.*bd2a2a597f // None // @ game+0x55d1764
	void *d9754e3ed1(struct ATeam* Param0); // Function TslGame.*8e3e737c04.*d9754e3ed1 // None // @ game+0x55d1620
	void OnBlockUserUpdated(); // Function TslGame.*8e3e737c04.OnBlockUserUpdated // None // @ game+0x55c0c9c
	void SetTeam(); // Function TslGame.*8e3e737c04.SetTeam // None // @ game+0x55cf260
	void OnParticipantRestrictionChanged(struct ATeam* Team); // Function TslGame.*8e3e737c04.OnParticipantRestrictionChanged // None // @ game+0x26a108
	void *227ffc55c4(); // Function TslGame.*8e3e737c04.*227ffc55c4 // None // @ game+0x55d1c3c
	void *6947ec1b6d(); // Function TslGame.*8e3e737c04.*6947ec1b6d // None // @ game+0x55d0f34
	void *41b98ecd8f(); // Function TslGame.*8e3e737c04.*41b98ecd8f // None // @ game+0x55d17b4
	void FollowParachuteAction(); // Function TslGame.*8e3e737c04.FollowParachuteAction // None // @ game+0x55bd318
	void *2cc1f28e49(); // Function TslGame.*8e3e737c04.*2cc1f28e49 // None // @ game+0x55d1778
	void *714ab814f1(struct UButton* Param0); // Function TslGame.*8e3e737c04.*714ab814f1 // None // @ game+0x55c8b8c
	void *a901140f58(); // Function TslGame.*8e3e737c04.*a901140f58 // None // @ game+0x55c8344
};

// Class TslGame.*55011c9936
// Size: 0x8d0 (Inherited: 0x808)
struct U*55011c9936 : U*8e3e737c04 {
	struct UImage* ClassIconImageWidget; // 0x808(0x08)
	struct U*c1ef4cc603* TeamInfoGroup; // 0x810(0x08)
	struct UImage* IconBackgroundImageWidget; // 0x818(0x08)
	struct UImage* MemberIndexBackgroundImageWidget; // 0x820(0x08)
	struct UImage* FullBackgroundImageWidget; // 0x828(0x08)
	struct U*c1ef4cc603* LevelPanelWidget; // 0x830(0x08)
	struct UTextBlock* PlayeLevelText; // 0x838(0x08)
	struct TMap<enum class EFBRClass, struct UTexture2D*> ClassTextureData; // 0x840(0x50)
	struct TArray<struct F*f883c0c9f4> ImageByMemberIndex; // 0x890(0x10)
	struct FMargin SlotPaddingOverride; // 0x8a0(0x10)
	struct FName MaterialParam_Texture; // 0x8b0(0x08)
	struct FName MaterialParam_IsGray; // 0x8b8(0x08)
	struct FName MaterialParam_IsBlink; // 0x8c0(0x08)
	char pad_8C8[0x8]; // 0x8c8(0x08)

	void OnTeamSpawnKitUpdated(); // Function TslGame.*55011c9936.OnTeamSpawnKitUpdated // None // @ game+0x55c6200
	void OnToggleClassSelectWidget(); // Function TslGame.*55011c9936.OnToggleClassSelectWidget // None // @ game+0x55c6868
};

// Class TslGame.*d4d7c56372
// Size: 0x508 (Inherited: 0x410)
struct U*d4d7c56372 : U*17234a7c9b {
	struct FMulticastDelegate OnReportButtonClicked; // 0x410(0x10)
	char pad_420[0x40]; // 0x420(0x40)
	struct FTslReportUserInfo *96b24db47d; // 0x460(0x70)
	struct F*d3069d51ff *fa79a2870f; // 0x4d0(0x28)
	float VisualVolumeModifier; // 0x4f8(0x04)
	float ActualVolumeMin; // 0x4fc(0x04)
	float ActualVolumeMax; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
};

// Class TslGame.*5fdcf92b78
// Size: 0x830 (Inherited: 0x508)
struct U*5fdcf92b78 : U*d4d7c56372 {
	char pad_508[0x48]; // 0x508(0x48)
	struct UWidgetSwitcher* RadioButtonSwitcher; // 0x550(0x08)
	struct UButton* RadioOnButton; // 0x558(0x08)
	struct UButton* RadioOffButton; // 0x560(0x08)
	struct UWidgetSwitcher* WaypointButtonSwitcher; // 0x568(0x08)
	struct UButton* WaypointOnButton; // 0x570(0x08)
	struct UButton* WaypointOffButton; // 0x578(0x08)
	struct F*b9afef7a3a *b823951027; // 0x580(0x28)
	struct F*c69f8ed24a *93305100ea; // 0x5a8(0x28)
	struct F*7f3debddd2 *351f9f7f31; // 0x5d0(0x20)
	struct F*7f3debddd2 *3fe3902408; // 0x5f0(0x20)
	struct F*c69f8ed24a *9370f63214; // 0x610(0x28)
	struct F*f4f57b85a2 *cb70a89746; // 0x638(0x20)
	struct F*959656208f *067b69c5dd; // 0x658(0x30)
	struct F*7f3debddd2 *fd0cdc88d3; // 0x688(0x20)
	struct F*b9afef7a3a *e4ebad8d7f; // 0x6a8(0x28)
	int32 *374a8359e1; // 0x6d0(0x04)
	int32 *6324d83efc; // 0x6d4(0x04)
	struct F*7f3debddd2 *c3094f9abf; // 0x6d8(0x20)
	struct F*7f3debddd2 *2e1f2971e3; // 0x6f8(0x20)
	struct F*7f3debddd2 *8954ff2ba3; // 0x718(0x20)
	struct F*f4f57b85a2 *ce2a48b8b4; // 0x738(0x20)
	struct F*c69f8ed24a *cddab7c310; // 0x758(0x28)
	struct F*c69f8ed24a *ced4666e47; // 0x780(0x28)
	struct F*959656208f *c97f77066b; // 0x7a8(0x30)
	struct FLinearColor *73135bfc90; // 0x7d8(0x10)
	struct FLinearColor *86d33f7966; // 0x7e8(0x10)
	struct FLinearColor *a3b5718144; // 0x7f8(0x10)
	struct FText *623e610a07; // 0x808(0x18)
	char pad_820[0x10]; // 0x820(0x10)

	void OnClickedWaypointOffButton(); // Function TslGame.*5fdcf92b78.OnClickedWaypointOffButton // None // @ game+0x55c1824
	void NotifyToggleAvoidButtonClicked(); // Function TslGame.*5fdcf92b78.NotifyToggleAvoidButtonClicked // None // @ game+0x55c05e0
	void OnClickedWaypointOnButton(); // Function TslGame.*5fdcf92b78.OnClickedWaypointOnButton // None // @ game+0x55c1840
	void NotifyVolumeSliderUpdated(); // Function TslGame.*5fdcf92b78.NotifyVolumeSliderUpdated // None // @ game+0x55c0608
	void OnClickedRadioOffButton(); // Function TslGame.*5fdcf92b78.OnClickedRadioOffButton // None // @ game+0x55c1810
	void OnClickedRadioOnButton(); // Function TslGame.*5fdcf92b78.OnClickedRadioOnButton // None // @ game+0x55c1810
	void NotifyToggleVoiceMuteButtonClicked(); // Function TslGame.*5fdcf92b78.NotifyToggleVoiceMuteButtonClicked // None // @ game+0x55c05f4
	void NotifyReportButtonClicked(); // Function TslGame.*5fdcf92b78.NotifyReportButtonClicked // None // @ game+0x55c05cc
};

// Class TslGame.*610c79ea49
// Size: 0x6b8 (Inherited: 0x508)
struct U*610c79ea49 : U*d4d7c56372 {
	struct FMulticastDelegate OnNavigate; // 0x508(0x10)
	struct FMulticastDelegate OnShowGamerCard; // 0x518(0x10)
	struct FMulticastDelegate OnToggleVoiceMute; // 0x528(0x10)
	struct FMulticastDelegate OnToggleAvoid; // 0x538(0x10)
	struct FMulticastDelegate OnRequestClose; // 0x548(0x10)
	char pad_558[0x8]; // 0x558(0x08)
	struct F*959656208f *0828a49b21; // 0x560(0x30)
	struct F*f4f57b85a2 *cb70a89746; // 0x590(0x20)
	struct F*b9afef7a3a *7a26c4058c; // 0x5b0(0x28)
	struct F*c233adf9bd *8ae71cae91; // 0x5d8(0x20)
	int32 *52edaeae2e; // 0x5f8(0x04)
	int32 *5a64403080; // 0x5fc(0x04)
	float *59d486f654; // 0x600(0x04)
	char pad_604[0x4]; // 0x604(0x04)
	struct F*c69f8ed24a *2bbce55d1d; // 0x608(0x28)
	struct F*d3069d51ff *832c768a97; // 0x630(0x28)
	struct F*f4f57b85a2 *758bbc1fcd; // 0x658(0x20)
	struct FLinearColor FocusedContentColor; // 0x678(0x10)
	struct FLinearColor DefaultContentColor; // 0x688(0x10)
	struct FLinearColor FocusedBrushColor; // 0x698(0x10)
	struct FLinearColor DefaultBrushColor; // 0x6a8(0x10)
};

// Class TslGame.*63367fa20e
// Size: 0x4d0 (Inherited: 0x410)
struct U*63367fa20e : U*17234a7c9b {
	struct UImage* CookingTimerImage; // 0x410(0x08)
	struct UMaterialInstanceDynamic* *5e864c64a1; // 0x418(0x08)
	struct ATslWeapon_Throwable* *f8f0d42dbc; // 0x420(0x08)
	struct TMap<enum class EColorBlindType, struct FLinearColor> NormalColorMap; // 0x428(0x50)
	struct TMap<enum class EColorBlindType, struct FLinearColor> WarningColorMap; // 0x478(0x50)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void UpdateProgressColor(); // Function TslGame.*63367fa20e.UpdateProgressColor // None // @ game+0x55d1494
	void OnUpdateViewTarget(); // Function TslGame.*63367fa20e.OnUpdateViewTarget // None // @ game+0xc0b1e4
};

// Class TslGame.*d44067549f
// Size: 0x490 (Inherited: 0x410)
struct U*d44067549f : U*17234a7c9b {
	char pad_410[0x18]; // 0x410(0x18)
	int32 *b0050c12ec; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UClass* WeaponType; // 0x430(0x08)
	struct UTexture* *e4cb9275e0; // 0x438(0x08)
	float *8a42cf2da7; // 0x440(0x04)
	struct FLinearColor NormalColor; // 0x444(0x10)
	struct FLinearColor *77f04a6370; // 0x454(0x10)
	char pad_464[0x4]; // 0x464(0x04)
	struct UImage* Icon; // 0x468(0x08)
	struct UTextBlock* ItemCountText; // 0x470(0x08)
	struct USizeBox* IconSize; // 0x478(0x08)
	struct U*6b11b3bf02* Anim_Use; // 0x480(0x08)
	struct U*6b11b3bf02* Anim_Add; // 0x488(0x08)

	void GetThrowableItemCount(); // Function TslGame.*d44067549f.GetThrowableItemCount // None // @ game+0x55be0cc
	void OnThrowableItemsUpdated(); // Function TslGame.*d44067549f.OnThrowableItemsUpdated // None // @ game+0x55c64e8
};

// Class TslGame.*01798c2b05
// Size: 0x440 (Inherited: 0x410)
struct U*01798c2b05 : U*17234a7c9b {
	struct UTextBlock* ToolTipTitleText; // 0x410(0x08)
	struct UTextBlock* ToolTipContentText; // 0x418(0x08)
	struct UWidget* *259ccb060f; // 0x420(0x08)
	char pad_428[0x18]; // 0x428(0x18)
};

// Class TslGame.*e8f24c89d8
// Size: 0x4a8 (Inherited: 0x410)
struct U*e8f24c89d8 : U*17234a7c9b {
	struct FText TrainingTitleText; // 0x410(0x18)
	struct FText TrainingDetailText; // 0x428(0x18)
	struct UTexture2D* ButtonImageTexture; // 0x440(0x08)
	enum class ETrainingPracticeType PracticeType; // 0x448(0x01)
	char pad_449[0x17]; // 0x449(0x17)
	struct FVector2D *6cf22b1d79; // 0x460(0x08)
	struct FVector2D *b906876cf6; // 0x468(0x08)
	struct UTextBlock* TitleText; // 0x470(0x08)
	struct UTextBlock* DetailText; // 0x478(0x08)
	struct UImage* ButtonImage; // 0x480(0x08)
	struct UImage* ConsoleHighlight; // 0x488(0x08)
	struct UButton* TrainingMenuButton; // 0x490(0x08)
	struct USizeBox* TrainingMenuButtonSizeBox; // 0x498(0x08)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void OnUnHoveredButton(); // Function TslGame.*e8f24c89d8.OnUnHoveredButton // None // @ game+0x55c69d8
	void OnTrainingMenuSelect(); // Function TslGame.*e8f24c89d8.OnTrainingMenuSelect // None // @ game+0x55c6990
	void OnHoveredButton(); // Function TslGame.*e8f24c89d8.OnHoveredButton // None // @ game+0x55c2b84
};

// Class TslGame.*d2e7bedcd2
// Size: 0x450 (Inherited: 0x410)
struct U*d2e7bedcd2 : U*17234a7c9b {
	char pad_410[0x10]; // 0x410(0x10)
	struct U*95e9d8b07a* RoundCount; // 0x420(0x08)
	struct U*3212bb78c2* RoundTime; // 0x428(0x08)
	char pad_430[0x20]; // 0x430(0x20)
};

// Class TslGame.*c61de1fc76
// Size: 0x468 (Inherited: 0x450)
struct U*c61de1fc76 : U*d2e7bedcd2 {
	struct U*79daa5cc8d* ScorePoints; // 0x450(0x08)
	struct U*1ff393c1cd* WinningStreak; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)
};

// Class TslGame.*3573ccd810
// Size: 0x570 (Inherited: 0x450)
struct U*3573ccd810 : U*d2e7bedcd2 {
	struct U*78e1bd82d3* PlayerHeadManager; // 0x450(0x08)
	struct UBorder* HP_Border; // 0x458(0x08)
	struct U*79daa5cc8d* Player_Score; // 0x460(0x08)
	struct U*79daa5cc8d* Enemy_Score; // 0x468(0x08)
	struct UImage* Player_Gauge_Image; // 0x470(0x08)
	struct UImage* Enemy_Gauge_Image; // 0x478(0x08)
	struct U*7f757909f6* Player_PlatformIcon; // 0x480(0x08)
	struct U*7f757909f6* Enemy_PlatformIcon; // 0x488(0x08)
	struct UTextBlock* PlayerName_Text; // 0x490(0x08)
	struct UTextBlock* EnemyName_Text; // 0x498(0x08)
	struct U*6b11b3bf02* Hit0_Anim; // 0x4a0(0x08)
	struct U*6b11b3bf02* Hit1_Anim; // 0x4a8(0x08)
	struct U*6b11b3bf02* Open_Anim; // 0x4b0(0x08)
	char pad_4B8[0xa0]; // 0x4b8(0xa0)
	struct U*1ff393c1cd* PlayerWinningStreak; // 0x558(0x08)
	struct U*1ff393c1cd* EnemyWinningStreak; // 0x560(0x08)
	char pad_568[0x8]; // 0x568(0x08)
};

// Class TslGame.*829bb3405d
// Size: 0x430 (Inherited: 0x410)
struct U*829bb3405d : U*17234a7c9b {
	struct UWidgetSwitcher* ResultMark_Switcher; // 0x410(0x08)
	struct UWidgetSwitcher* ResultText_Switcher; // 0x418(0x08)
	struct U*6b11b3bf02* Anim_Start; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*7d2db8c7b6
// Size: 0x438 (Inherited: 0x410)
struct U*7d2db8c7b6 : U*17234a7c9b {
	struct U*829bb3405d* Round_Player; // 0x410(0x08)
	struct U*3212bb78c2* Round_Time; // 0x418(0x08)
	struct U*829bb3405d* Round_Enemy; // 0x420(0x08)
	struct U*6b11b3bf02* Anim_Start; // 0x428(0x08)
	struct UAkAudioEvent* *ac56f27efc; // 0x430(0x08)
};

// Class TslGame.*2d4b9d1d82
// Size: 0x498 (Inherited: 0x410)
struct U*2d4b9d1d82 : U*17234a7c9b {
	struct U*6b11b3bf02* Open_Anim; // 0x410(0x08)
	struct U*6b11b3bf02* Close_Anim; // 0x418(0x08)
	struct U*6b11b3bf02* Found_Anim; // 0x420(0x08)
	struct U*6b11b3bf02* MatchStart_Anim; // 0x428(0x08)
	struct U*6b11b3bf02* MatchEnd_Anim; // 0x430(0x08)
	struct UCanvasPanel* Search_CanvasPanel; // 0x438(0x08)
	struct UTextBlock* Search_Sub_TextBlock; // 0x440(0x08)
	struct UGridPanel* Search_GridPanel; // 0x448(0x08)
	struct UBorder* Search_Border; // 0x450(0x08)
	struct FText TimeTextFormat; // 0x458(0x18)
	struct FString *c74d964f2f; // 0x470(0x10)
	struct FString *181ec111e4; // 0x480(0x10)
	char pad_490[0x8]; // 0x490(0x08)

	void OnMatchFound(); // Function TslGame.*2d4b9d1d82.OnMatchFound // None // @ game+0x55c3194
	void OnSearchCanceled(); // Function TslGame.*2d4b9d1d82.OnSearchCanceled // None // @ game+0x55c5b44
	void OnUpdateMatchWaitingElapsedTime(); // Function TslGame.*2d4b9d1d82.OnUpdateMatchWaitingElapsedTime // None // @ game+0x55c6ae0
	void OnSearchStarted(); // Function TslGame.*2d4b9d1d82.OnSearchStarted // None // @ game+0x55c5b58
};

// Class TslGame.*1ff393c1cd
// Size: 0x4f8 (Inherited: 0x410)
struct U*1ff393c1cd : U*17234a7c9b {
	struct FSlateBrush *ce39d3c02c; // 0x410(0x90)
	int32 *d0a95fa526; // 0x4a0(0x04)
	int32 *300188aef8; // 0x4a4(0x04)
	struct FMargin *f6555d1a8b; // 0x4a8(0x10)
	enum class EHorizontalAlignment *462c76461e; // 0x4b8(0x01)
	char pad_4B9[0x3]; // 0x4b9(0x03)
	struct FLinearColor *7fd22b62ca; // 0x4bc(0x10)
	char pad_4CC[0x4]; // 0x4cc(0x04)
	struct UTextBlock* WinningStreakTitleText; // 0x4d0(0x08)
	struct UTextBlock* WinningStreakWinsText; // 0x4d8(0x08)
	struct USizeBox* WinningStreak_SizeBox; // 0x4e0(0x08)
	struct UHorizontalBox* WinningStreak_HorizontalBox; // 0x4e8(0x08)
	struct UBorder* WinningStreak_Border; // 0x4f0(0x08)
};

// Class TslGame.*9ca8a6b11f
// Size: 0x498 (Inherited: 0x410)
struct U*9ca8a6b11f : U*17234a7c9b {
	char pad_410[0x10]; // 0x410(0x10)
	float ScoreTextStartTime; // 0x420(0x04)
	float ScoreTextUpdateTime; // 0x424(0x04)
	float ScoreTextMaxTime; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UAkAudioEvent* ScoreRiseSoundEvent; // 0x430(0x08)
	struct UAkAudioEvent* ScoreRiseSoundEndEvent; // 0x438(0x08)
	struct UImage* TrainingScoreIconImage; // 0x440(0x08)
	struct UTextBlock* TrainingScoreTitleText; // 0x448(0x08)
	struct UTextBlock* TrainingScoreNumberText; // 0x450(0x08)
	struct U*6b11b3bf02* Emerge; // 0x458(0x08)
	char pad_460[0x38]; // 0x460(0x38)

	void *e4c1439322(); // Function TslGame.*9ca8a6b11f.*e4c1439322 // None // @ game+0x55d0b28
	void *eba77398d5(); // Function TslGame.*9ca8a6b11f.*eba77398d5 // None // @ game+0x55c8358
	void *59b969b124(); // Function TslGame.*9ca8a6b11f.*59b969b124 // None // @ game+0x55cffa0
};

// Class TslGame.*f2d85db64b
// Size: 0x428 (Inherited: 0x410)
struct U*f2d85db64b : U*17234a7c9b {
	struct UTextBlock* TurnNumber_Text; // 0x410(0x08)
	struct UTextBlock* WeaponName_Text; // 0x418(0x08)
	struct UImage* Weapon_Image; // 0x420(0x08)
};

// Class TslGame.*ecbc5062f1
// Size: 0x5a0 (Inherited: 0x410)
struct U*ecbc5062f1 : U*17234a7c9b {
	enum class ETslTrainingType *e56ca36683; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct FText TitleText; // 0x418(0x18)
	struct UTexture2D* BackGroundTexture; // 0x430(0x08)
	struct UTexture2D* *bdc46ad5d1; // 0x438(0x08)
	struct UImage* TrainingIconImage; // 0x440(0x08)
	struct UImage* BackgroundImage; // 0x448(0x08)
	struct UButton* TeleportButton; // 0x450(0x08)
	struct U*0399764a34* Title_Text; // 0x458(0x08)
	char pad_460[0x128]; // 0x460(0x128)
	struct U*f51c4d215d* *27fbc0e025; // 0x588(0x08)
	struct U*6b11b3bf02* OnBtnHovered_Anim; // 0x590(0x08)
	float *e4d10c2e3f; // 0x598(0x04)
	float *13a8769718; // 0x59c(0x04)

	void OnBtnHovered(); // Function TslGame.*ecbc5062f1.OnBtnHovered // None // @ game+0x55c1090
	void OnBtnHoverEnded(); // Function TslGame.*ecbc5062f1.OnBtnHoverEnded // None // @ game+0x55c0fec
	void OnBtnClicked(); // Function TslGame.*ecbc5062f1.OnBtnClicked // None // @ game+0x55c0f48
};

// Class TslGame.*7767a34479
// Size: 0x458 (Inherited: 0x410)
struct U*7767a34479 : U*17234a7c9b {
	char pad_410[0x30]; // 0x410(0x30)
	struct U*0399764a34* ToolTipTitleText; // 0x440(0x08)
	struct UImage* ToolTipImage; // 0x448(0x08)
	struct UImage* BackgroundImage; // 0x450(0x08)
};

// Class TslGame.*89173652b2
// Size: 0x428 (Inherited: 0x410)
struct U*89173652b2 : U*17234a7c9b {
	struct UImage* CapacityImage; // 0x410(0x08)
	struct UImage* FeedbackImage; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void OnFocusItemSlot(TScriptInterface<struct U*b015a9bf79> Param0); // Function TslGame.*89173652b2.OnFocusItemSlot // None // @ game+0x55c23e4
	TScriptInterface<struct U*f1d1da18cf> OnAttachmentFocuseSlotID(); // Function TslGame.*89173652b2.OnAttachmentFocuseSlotID // None // @ game+0x55c0ad0
	void OnFocusItemSlotIDEquipment(); // Function TslGame.*89173652b2.OnFocusItemSlotIDEquipment // None // @ game+0x55c2558
	TScriptInterface<struct U*f1d1da18cf> OnFocusWeaponItemSlotIDEquipment(); // Function TslGame.*89173652b2.OnFocusWeaponItemSlotIDEquipment // None // @ game+0x55c25e8
	TScriptInterface<struct U*f1d1da18cf> OnEnterItemSlot(); // Function TslGame.*89173652b2.OnEnterItemSlot // None // @ game+0x55c2090
	void OnLeaveItemSlot(TScriptInterface<struct U*f1d1da18cf> Param1); // Function TslGame.*89173652b2.OnLeaveItemSlot // None // @ game+0x55c2d28
};

// Class TslGame.*351b7047f7
// Size: 0x420 (Inherited: 0x410)
struct U*351b7047f7 : U*17234a7c9b {
	struct U*fc313b34f1* TutorialMissionListWidget; // 0x410(0x08)
	struct U*dcb110abe9* TutorialBannerWidget; // 0x418(0x08)
};

// Class TslGame.*6538a02a5c
// Size: 0x438 (Inherited: 0x410)
struct U*6538a02a5c : U*17234a7c9b {
	struct UTextBlock* TitleText; // 0x410(0x08)
	struct UTslRichTextBlock* MainText; // 0x418(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x420(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*1321961a27
// Size: 0x470 (Inherited: 0x410)
struct U*1321961a27 : U*17234a7c9b {
	struct U*bfbc16799c* RadioMessageLogWidget; // 0x410(0x08)
	struct U*70c76f5bfa* VehicleStanceWidget; // 0x418(0x08)
	struct U*c9c849fd88* MortarCanvasWidget; // 0x420(0x08)
	struct U*f0e82267ba* TeamInfoListWidget; // 0x428(0x08)
	struct UWidgetSwitcher* TeamListSwitcher; // 0x430(0x08)
	struct USpacer* TeamListMatchResultSpacer; // 0x438(0x08)
	struct U*415ef1fc57* ObserverTeamInfoList; // 0x440(0x08)
	struct FVector2D *196e94ed94; // 0x448(0x08)
	struct FVector2D *18710e3d7c; // 0x450(0x08)
	struct FVector2D *38e383cd8a; // 0x458(0x08)
	struct FVector2D *6495c984e9; // 0x460(0x08)
	bool *89a2092dfa; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
};

// Class TslGame.*d5ee607c6a
// Size: 0x478 (Inherited: 0x470)
struct U*d5ee607c6a : U*1321961a27 {
	struct U*c1ef4cc603* FBRClassSelectGuideOuterBox; // 0x470(0x08)

	void OnMatchStateChanged(); // Function TslGame.*d5ee607c6a.OnMatchStateChanged // None // @ game+0x55c3368
	void OnToggleClassSelectWidgetVisibility(); // Function TslGame.*d5ee607c6a.OnToggleClassSelectWidgetVisibility // None // @ game+0x55c68fc
};

// Class TslGame.*b595b186e4
// Size: 0x498 (Inherited: 0x410)
struct U*b595b186e4 : U*17234a7c9b {
	char pad_410[0xc]; // 0x410(0x0c)
	enum class ELeaningState CurrentLeanState; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	float *0fd88707c0; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct FText DistanceTextFormat; // 0x428(0x18)
	struct UTextBlock* RangeFinderText; // 0x440(0x08)
	struct FText ScanningTimerText; // 0x448(0x18)
	struct UClass* *16e5aaf4f6; // 0x460(0x08)
	struct UVerticalBox* SpottingInfoVerticalBox; // 0x468(0x08)
	struct UHorizontalBox* StandardCrosshair; // 0x470(0x08)
	struct UImage* CrosshairActive; // 0x478(0x08)
	struct UOverlay* DistanceToTarget; // 0x480(0x08)
	struct UOverlay* Overlay_ScanningAll; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)

	void GetScanningPercent(); // Function TslGame.*b595b186e4.GetScanningPercent // None // @ game+0x55bdc4c
	void GetScanningInProgressVisibility(); // Function TslGame.*b595b186e4.GetScanningInProgressVisibility // None // @ game+0x55bdc1c
	void GetScanningVisibility(); // Function TslGame.*b595b186e4.GetScanningVisibility // None // @ game+0x55bdc64
	void GetScanningInterruptedVisibility(); // Function TslGame.*b595b186e4.GetScanningInterruptedVisibility // None // @ game+0x55bdc34
	void *16e1a99549(); // Function TslGame.*b595b186e4.*16e1a99549 // None // @ game+0x55d154c
	void SetRangeFinderTextVisibility(); // Function TslGame.*b595b186e4.SetRangeFinderTextVisibility // None // @ game+0x55cebbc
};

// Class TslGame.*7cffec35ec
// Size: 0x550 (Inherited: 0x410)
struct U*7cffec35ec : U*17234a7c9b {
	char pad_410[0xc0]; // 0x410(0xc0)
	float *fd09578373; // 0x4d0(0x04)
	char pad_4D4[0x64]; // 0x4d4(0x64)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x538(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x540(0x08)
	char pad_548[0x8]; // 0x548(0x08)

	TScriptInterface<struct U*f1d1da18cf> CallOnAttachmentFocused(); // Function TslGame.*7cffec35ec.CallOnAttachmentFocused // None // @ game+0x56b89a4
	void *4dae901933(enum class EWeaponAttachmentSlotID Param1, TScriptInterface<struct U*f1d1da18cf> Param3); // Function TslGame.*7cffec35ec.*4dae901933 // None // @ game+0x56b879c
	void OnChildSlotRefreshFocus(); // Function TslGame.*7cffec35ec.OnChildSlotRefreshFocus // None // @ game+0x55c17c8
	TScriptInterface<struct U*f1d1da18cf> CallOnWeaponEquipmentFocused(); // Function TslGame.*7cffec35ec.CallOnWeaponEquipmentFocused // None // @ game+0x95f6e4
};

// Class TslGame.*d24d56ec6e
// Size: 0x550 (Inherited: 0x550)
struct U*d24d56ec6e : U*7cffec35ec {
	float *fd09578373; // 0x4d0(0x04)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x538(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x540(0x08)

	TScriptInterface<struct U*f1d1da18cf> CallOnAttachmentFocused(); // Function TslGame.*7cffec35ec.CallOnAttachmentFocused // None // @ game+0x56b89a4
	void *4dae901933(enum class EWeaponAttachmentSlotID Param1, TScriptInterface<struct U*f1d1da18cf> Param3); // Function TslGame.*7cffec35ec.*4dae901933 // None // @ game+0x56b879c
	void OnChildSlotRefreshFocus(); // Function TslGame.*7cffec35ec.OnChildSlotRefreshFocus // None // @ game+0x55c17c8
	TScriptInterface<struct U*f1d1da18cf> CallOnWeaponEquipmentFocused(); // Function TslGame.*7cffec35ec.CallOnWeaponEquipmentFocused // None // @ game+0x95f6e4
};

// Class TslGame.*c9cd84ddc9
// Size: 0x550 (Inherited: 0x550)
struct U*c9cd84ddc9 : U*d24d56ec6e {
	float *fd09578373; // 0x4d0(0x04)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x538(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x540(0x08)

	TScriptInterface<struct U*f1d1da18cf> CallOnAttachmentFocused(); // Function TslGame.*7cffec35ec.CallOnAttachmentFocused // None // @ game+0x56b89a4
	void *4dae901933(enum class EWeaponAttachmentSlotID Param1, TScriptInterface<struct U*f1d1da18cf> Param3); // Function TslGame.*7cffec35ec.*4dae901933 // None // @ game+0x56b879c
	void OnChildSlotRefreshFocus(); // Function TslGame.*7cffec35ec.OnChildSlotRefreshFocus // None // @ game+0x55c17c8
	TScriptInterface<struct U*f1d1da18cf> CallOnWeaponEquipmentFocused(); // Function TslGame.*7cffec35ec.CallOnWeaponEquipmentFocused // None // @ game+0x95f6e4
};

// Class TslGame.*7b5990329a
// Size: 0x490 (Inherited: 0x410)
struct U*7b5990329a : U*17234a7c9b {
	struct TMap<int32, struct F*ac7e95618e> *b2cb6af05d; // 0x410(0x50)
	struct UTextBlock* NameText; // 0x460(0x08)
	struct UImage* BackgroundL; // 0x468(0x08)
	struct UImage* BackgroundR; // 0x470(0x08)
	struct UImage* AdditiveL; // 0x478(0x08)
	struct UImage* AdditiveR; // 0x480(0x08)
	struct U*6b11b3bf02* ShowAnim; // 0x488(0x08)
};

// Class TslGame.*ac31e6eef2
// Size: 0x478 (Inherited: 0x410)
struct U*ac31e6eef2 : U*17234a7c9b {
	struct F*8e32972a91 *739194340b; // 0x410(0x28)
	struct F*8e32972a91 *ef6218d1d2; // 0x438(0x28)
	char pad_460[0x18]; // 0x460(0x18)

	void FadeIn(); // Function TslGame.*ac31e6eef2.FadeIn // None // @ game+0x26a108
};

// Class TslGame.TslWebBrowserWidget
// Size: 0x4b0 (Inherited: 0x410)
struct UTslWebBrowserWidget : U*17234a7c9b {
	struct UButton* FullModeButton; // 0x410(0x08)
	struct UButton* WindowModeButton; // 0x418(0x08)
	struct F*dbaf7780f1 WebBrowserWidgetBinder; // 0x420(0x20)
	struct F*b9afef7a3a ScreenModeSwitcherBinder; // 0x440(0x28)
	struct F*959656208f WebBrowserBorderBinder; // 0x468(0x30)
	struct FVector2D WindowModePosition; // 0x498(0x08)
	struct FVector2D WindowModeScale; // 0x4a0(0x08)
	char pad_4A8[0x8]; // 0x4a8(0x08)

	void OnLoadURL(); // Function TslGame.TslWebBrowserWidget.OnLoadURL // None // @ game+0x55c2eac
	void *40dea6b630(); // Function TslGame.TslWebBrowserWidget.*40dea6b630 // None // @ game+0x55c8870
	void OnFullMode(); // Function TslGame.TslWebBrowserWidget.OnFullMode // None // @ game+0x55c27a0
	void OnWindowMode(); // Function TslGame.TslWebBrowserWidget.OnWindowMode // None // @ game+0x55c80e4
	void OnPopup(); // Function TslGame.TslWebBrowserWidget.OnPopup // None // @ game+0x55c4b5c
	void *9b32d590e4(); // Function TslGame.TslWebBrowserWidget.*9b32d590e4 // None // @ game+0x55c4a3c
};

// Class TslGame.*ba28387cae
// Size: 0x468 (Inherited: 0x410)
struct U*ba28387cae : U*17234a7c9b {
	char pad_410[0x50]; // 0x410(0x50)
	struct U*4b1a1c10ac* WebView; // 0x460(0x08)

	void CloseWebPopup(); // Function TslGame.*ba28387cae.CloseWebPopup // None // @ game+0x55bbef4
	void SetReuse(); // Function TslGame.*ba28387cae.SetReuse // None // @ game+0x55cee08
	void UpdateURLAndWidget(); // Function TslGame.*ba28387cae.UpdateURLAndWidget // None // @ game+0x26a108
	void SetWebPopupVisibility(); // Function TslGame.*ba28387cae.SetWebPopupVisibility // None // @ game+0x55cf5e8
	void IsWebPopupShow(); // Function TslGame.*ba28387cae.IsWebPopupShow // None // @ game+0x55bedfc
	float SetLayout(); // Function TslGame.*ba28387cae.SetLayout // None // @ game+0x55ce1c0
	void GetSaveWebPopupParam(); // Function TslGame.*ba28387cae.GetSaveWebPopupParam // None // @ game+0x55bdba8
	void OnUpdateWebPopup(); // Function TslGame.*ba28387cae.OnUpdateWebPopup // None // @ game+0x26a108
	void UpdateWebPopup(); // Function TslGame.*ba28387cae.UpdateWebPopup // None // @ game+0x55d1c68
	void IsReuse(); // Function TslGame.*ba28387cae.IsReuse // None // @ game+0x55bed8c
};

// Class TslGame.*b45887366a
// Size: 0x468 (Inherited: 0x410)
struct U*b45887366a : U*17234a7c9b {
	struct UCanvasPanel* OutsidePanel; // 0x410(0x08)
	struct UWidgetSwitcher* FocusSwitcher; // 0x418(0x08)
	struct UOverlay* TargetImageOverlay; // 0x420(0x08)
	struct UImage* TargetImage; // 0x428(0x08)
	struct U*6b11b3bf02* InitAnim; // 0x430(0x08)
	struct U*6b11b3bf02* FadeOutForSelected; // 0x438(0x08)
	struct U*6b11b3bf02* FadeOutForNonSelected; // 0x440(0x08)
	int32 NonFocusedWidgetIndex; // 0x448(0x04)
	int32 FocusedWidgetIndex; // 0x44c(0x04)
	int32 EmptyWidgetIndex; // 0x450(0x04)
	float *7e5bc026a3; // 0x454(0x04)
	float *eb729dd3df; // 0x458(0x04)
	float *62fc4429e7; // 0x45c(0x04)
	char pad_460[0x8]; // 0x460(0x08)

	void PlaySelectAnimation(); // Function TslGame.*b45887366a.PlaySelectAnimation // None // @ game+0x55c8380
	void DoActionInLobby(); // Function TslGame.*b45887366a.DoActionInLobby // None // @ game+0x55bcac4
	void SetFocus(); // Function TslGame.*b45887366a.SetFocus // None // @ game+0x55cdf20
	void SetEmpty(); // Function TslGame.*b45887366a.SetEmpty // None // @ game+0x55cdca8
	void DoAction(); // Function TslGame.*b45887366a.DoAction // None // @ game+0x55bca1c
	void GetNameText(); // Function TslGame.*b45887366a.GetNameText // None // @ game+0x55bda04
	void IsEmpty(); // Function TslGame.*b45887366a.IsEmpty // None // @ game+0x55becd8
	void IsShowDescriptionText(); // Function TslGame.*b45887366a.IsShowDescriptionText // None // @ game+0x55bedbc
	void GetDescriptionText(); // Function TslGame.*b45887366a.GetDescriptionText // None // @ game+0x55bd4b0
};

// Class TslGame.*850baea3c8
// Size: 0x4e8 (Inherited: 0x468)
struct U*850baea3c8 : U*b45887366a {
	struct FString ActionNamePrefix; // 0x468(0x10)
	struct FLinearColor EnbleImageColor; // 0x478(0x10)
	struct FLinearColor DisableImageColor; // 0x488(0x10)
	char pad_498[0x50]; // 0x498(0x50)

	void DoActionInLobby(); // Function TslGame.*850baea3c8.DoActionInLobby // None // @ game+0x55bcac4
	void GetDescriptionText(); // Function TslGame.*850baea3c8.GetDescriptionText // None // @ game+0x55bd4b0
	struct U*233315c5fa* DoAction(); // Function TslGame.*850baea3c8.DoAction // None // @ game+0x55bca1c
	void GetNameText(); // Function TslGame.*850baea3c8.GetNameText // None // @ game+0x55bda04
	void IsShowDescriptionText(); // Function TslGame.*850baea3c8.IsShowDescriptionText // None // @ game+0x55bedbc
};

// Class TslGame.*67ac0eb5d3
// Size: 0x4c8 (Inherited: 0x468)
struct U*67ac0eb5d3 : U*b45887366a {
	struct UTextBlock* StackCountText; // 0x468(0x08)
	struct U*6b11b3bf02* FadeOutForNonSelected_NoItem; // 0x470(0x08)
	struct FLinearColor UnusableItemImageColor; // 0x478(0x10)
	struct FLinearColor UsableItemImageColor; // 0x488(0x10)
	struct FLinearColor UnusableItemNameColor; // 0x498(0x10)
	struct FLinearColor UsableItemNameColor; // 0x4a8(0x10)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct FName ItemID; // 0x4c0(0x08)

	void GetDescriptionText(); // Function TslGame.*67ac0eb5d3.GetDescriptionText // None // @ game+0x55bd4b0
	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*67ac0eb5d3.OnDefaultITem_AsyncLoadIconFinished // None // @ game+0x55c1ea4
	void GetNameText(); // Function TslGame.*67ac0eb5d3.GetNameText // None // @ game+0x55bda04
	void *ecccadfb4f(); // Function TslGame.*67ac0eb5d3.*ecccadfb4f // None // @ game+0x55bf250
	void PlaySelectAnimation(); // Function TslGame.*67ac0eb5d3.PlaySelectAnimation // None // @ game+0x55c8380
	void DoAction(struct U*233315c5fa* Context); // Function TslGame.*67ac0eb5d3.DoAction // None // @ game+0x55bca1c
	void UpdateItemImage(); // Function TslGame.*67ac0eb5d3.UpdateItemImage // None // @ game+0x55c1ea4
	void GetStackCount(); // Function TslGame.*67ac0eb5d3.GetStackCount // None // @ game+0x55bdea4
};

// Class TslGame.*b091bf68c0
// Size: 0x4e0 (Inherited: 0x4c8)
struct U*b091bf68c0 : U*67ac0eb5d3 {
	struct FText CannotUseItemText; // 0x4c8(0x18)

	void DoAction(); // Function TslGame.*b091bf68c0.DoAction // None // @ game+0x55bca1c
	void GetStackCount(); // Function TslGame.*b091bf68c0.GetStackCount // None // @ game+0x55bdea4
};

// Class TslGame.*b1379e739a
// Size: 0x4e0 (Inherited: 0x4c8)
struct U*b1379e739a : U*67ac0eb5d3 {
	struct FText CannotUseItemText; // 0x4c8(0x18)

	void DoAction(struct U*233315c5fa* Context); // Function TslGame.*b1379e739a.DoAction // None // @ game+0x55bca1c
};

// Class TslGame.*602dc75c7b
// Size: 0x4e0 (Inherited: 0x4c8)
struct U*602dc75c7b : U*67ac0eb5d3 {
	struct FText CannotEquipItemText; // 0x4c8(0x18)

	struct U*233315c5fa* DoAction(); // Function TslGame.*602dc75c7b.DoAction // None // @ game+0x55bca1c
	void GetStackCount(); // Function TslGame.*602dc75c7b.GetStackCount // None // @ game+0x55bdea4
};

// Class TslGame.*aeb2b32afa
// Size: 0x4c8 (Inherited: 0x468)
struct U*aeb2b32afa : U*b45887366a {
	float Radius; // 0x468(0x04)
	float RadiusOffsetWhenSelected; // 0x46c(0x04)
	struct FName RotationMaterialParameter; // 0x470(0x08)
	struct UImage* FocusedImage; // 0x478(0x08)
	struct UImage* NonFocusedImage; // 0x480(0x08)
	struct USizeBox* FocusedSizeBox; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
	struct F*f7b0180537 *0c37f8df74; // 0x498(0x28)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	void DoAction(struct U*233315c5fa* WheelContext); // Function TslGame.*aeb2b32afa.DoAction // None // @ game+0x55bca1c
	void GetNameText(); // Function TslGame.*aeb2b32afa.GetNameText // None // @ game+0x55bda04
};

// Class TslGame.*5aaee3ed1a
// Size: 0x498 (Inherited: 0x410)
struct U*5aaee3ed1a : U*17234a7c9b {
	struct UOverlay* ImageOverlay; // 0x410(0x08)
	struct UImage* Img_Icon; // 0x418(0x08)
	struct U*6b11b3bf02* Anim_FocusOn; // 0x420(0x08)
	struct U*6b11b3bf02* Anim_FocusOff; // 0x428(0x08)
	struct U*6b11b3bf02* Anim_FocusOnTextColor; // 0x430(0x08)
	struct U*6b11b3bf02* Anim_FocusOffTextColor; // 0x438(0x08)
	struct U*6b11b3bf02* Anim_AlphaStrong_1; // 0x440(0x08)
	struct U*6b11b3bf02* Anim_AlphaStrong_2; // 0x448(0x08)
	struct U*6b11b3bf02* Anim_AlphaWeak_1; // 0x450(0x08)
	struct U*6b11b3bf02* Anim_AlphaWeak_2; // 0x458(0x08)
	char pad_460[0x20]; // 0x460(0x20)
	struct UImage* Img_CheckIcon; // 0x480(0x08)
	struct UTextBlock* Text_ItemName; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
};

// Class TslGame.*d414dd6020
// Size: 0x518 (Inherited: 0x498)
struct U*d414dd6020 : U*5aaee3ed1a {
	struct UBorder* Bdr_Volume; // 0x498(0x08)
	struct UTextBlock* Txt_Volume; // 0x4a0(0x08)
	struct USizeBox* Szb_SlotNum; // 0x4a8(0x08)
	struct USizeBox* Szb_SlotNum_2; // 0x4b0(0x08)
	struct UTextBlock* TxtSlotNum; // 0x4b8(0x08)
	struct UTextBlock* Txt_SlotNum_2; // 0x4c0(0x08)
	char pad_4C8[0x20]; // 0x4c8(0x20)
	float EquippedSlotAlpha; // 0x4e8(0x04)
	struct FLinearColor UnUsableItemColor; // 0x4ec(0x10)
	char pad_4FC[0xc]; // 0x4fc(0x0c)
	struct FName ItemID; // 0x508(0x08)
	bool *24e90dcf9c; // 0x510(0x01)
	bool *db3b76268b; // 0x511(0x01)
	char pad_512[0x6]; // 0x512(0x06)

	void UpdateItemImage(); // Function TslGame.*d414dd6020.UpdateItemImage // None // @ game+0x55c1eb8
	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*d414dd6020.OnDefaultITem_AsyncLoadIconFinished // None // @ game+0x55c1eb8
	void GetStackCount(); // Function TslGame.*d414dd6020.GetStackCount // None // @ game+0x55bdecc
	void *ecccadfb4f(); // Function TslGame.*d414dd6020.*ecccadfb4f // None // @ game+0x55bf264
};

// Class TslGame.*f51c4d215d
// Size: 0x478 (Inherited: 0x410)
struct U*f51c4d215d : U*17234a7c9b {
	struct UVerticalBox* info_VerticalBox; // 0x410(0x08)
	struct TArray<struct U*ecbc5062f1*> *ef9039893f; // 0x418(0x10)
	struct U*ecbc5062f1* *dc3ed8b730; // 0x428(0x08)
	struct TArray<struct U*2c69565f2e*> *e541715acd; // 0x430(0x10)
	struct FMulticastDelegate OnClickTeleportButton; // 0x440(0x10)
	struct FMulticastDelegate OnHoverTeleportButton; // 0x450(0x10)
	struct FMulticastDelegate OnUnHoverTeleportButton; // 0x460(0x10)
	struct U*8f13c061a8* *e345ac143d; // 0x470(0x08)

	void OnBtnClicked(); // Function TslGame.*f51c4d215d.OnBtnClicked // None // @ game+0x55c0f5c
	void OnBtnHoverEnded(); // Function TslGame.*f51c4d215d.OnBtnHoverEnded // None // @ game+0x55c1000
	void *aad259341e(); // Function TslGame.*f51c4d215d.*aad259341e // None // @ game+0x55beb7c
	void OnBtnHovered(); // Function TslGame.*f51c4d215d.OnBtnHovered // None // @ game+0x55c10a4
};

// Class TslGame.*b50bf4a466
// Size: 0x570 (Inherited: 0x410)
struct U*b50bf4a466 : U*17234a7c9b {
	struct U*830fa4a500* RespawnTimerUpdater; // 0x410(0x08)
	struct U*830fa4a500* TimeLimitTimerUpdater; // 0x418(0x08)
	struct F*f4f57b85a2 RespawnTimeTextBinder; // 0x420(0x20)
	struct F*f4f57b85a2 TimeLimitTextBinder; // 0x440(0x20)
	struct TArray<struct F*d3069d51ff> TeamValueImageBinders; // 0x460(0x10)
	struct TArray<struct F*f4f57b85a2> TeamValueTextBinders; // 0x470(0x10)
	struct TArray<struct F*f4f57b85a2> TeamMemberCountTextBinders; // 0x480(0x10)
	struct F*959656208f GameStatusMessageBorder_Binder; // 0x490(0x30)
	struct F*e9e2558d2e VSFadeInAnimation_Binder; // 0x4c0(0x20)
	struct F*e9e2558d2e VSFadeOutAnimation_Binder; // 0x4e0(0x20)
	struct F*f4f57b85a2 UpperTargetScoreText_Binder; // 0x500(0x20)
	struct FName ColorParamName; // 0x520(0x08)
	struct FName GaugeParamName; // 0x528(0x08)
	bool bUseRespawnTimer; // 0x530(0x01)
	bool bUseTimeLimitTimer; // 0x531(0x01)
	bool bUseAnimOnMatchStart; // 0x532(0x01)
	bool bPlayGaugeAnim; // 0x533(0x01)
	float GaugeAnimSpeed; // 0x534(0x04)
	float GaugeAnimTime; // 0x538(0x04)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct TArray<struct FLinearColor> TeamColors; // 0x540(0x10)
	char pad_550[0x20]; // 0x550(0x20)

	void OnRespawnTimeUpdated(); // Function TslGame.*b50bf4a466.OnRespawnTimeUpdated // None // @ game+0x55c5700
	void OnModeInitialized(); // Function TslGame.*b50bf4a466.OnModeInitialized // None // @ game+0x55c3698
	void OnMyTeamRankChanged(); // Function TslGame.*b50bf4a466.OnMyTeamRankChanged // None // @ game+0x55c3cec
	void OnMyTeamScoreChanged(); // Function TslGame.*b50bf4a466.OnMyTeamScoreChanged // None // @ game+0x55c3e10
	void OnTimeLimitUpdated(struct FString Param0); // Function TslGame.*b50bf4a466.OnTimeLimitUpdated // None // @ game+0x55c64fc
	void OnHighEnemyScoreChanged(); // Function TslGame.*b50bf4a466.OnHighEnemyScoreChanged // None // @ game+0x55c2848
	void OnMyGainScoreChanged(); // Function TslGame.*b50bf4a466.OnMyGainScoreChanged // None // @ game+0x55c3bb8
	void OnResetLevel(); // Function TslGame.*b50bf4a466.OnResetLevel // None // @ game+0x55c56e8
	void OnMatchStarted(); // Function TslGame.*b50bf4a466.OnMatchStarted // None // @ game+0x55c31a8
	void OnModeStarted(); // Function TslGame.*b50bf4a466.OnModeStarted // None // @ game+0x55c37d4
};

// Class TslGame.BRTwoTeamScoreboardWidget
// Size: 0x588 (Inherited: 0x570)
struct UBRTwoTeamScoreboardWidget : U*b50bf4a466 {
	struct U*830fa4a500* RespawnTimerUpdater; // 0x410(0x08)
	struct U*830fa4a500* TimeLimitTimerUpdater; // 0x418(0x08)
	struct F*f4f57b85a2 RespawnTimeTextBinder; // 0x420(0x20)
	struct F*f4f57b85a2 TimeLimitTextBinder; // 0x440(0x20)
	struct TArray<struct F*d3069d51ff> TeamValueImageBinders; // 0x460(0x10)
	struct TArray<struct F*f4f57b85a2> TeamValueTextBinders; // 0x470(0x10)
	struct TArray<struct F*f4f57b85a2> TeamMemberCountTextBinders; // 0x480(0x10)
	struct F*959656208f GameStatusMessageBorder_Binder; // 0x490(0x30)
	struct F*e9e2558d2e VSFadeInAnimation_Binder; // 0x4c0(0x20)
	struct F*e9e2558d2e VSFadeOutAnimation_Binder; // 0x4e0(0x20)
	struct F*f4f57b85a2 UpperTargetScoreText_Binder; // 0x500(0x20)
	struct FName ColorParamName; // 0x520(0x08)
	struct FName GaugeParamName; // 0x528(0x08)
	bool bUseRespawnTimer; // 0x530(0x01)
	bool bUseTimeLimitTimer; // 0x531(0x01)
	bool bUseAnimOnMatchStart; // 0x532(0x01)
	bool bPlayGaugeAnim; // 0x533(0x01)
	float GaugeAnimSpeed; // 0x534(0x04)
	float GaugeAnimTime; // 0x538(0x04)
	struct TArray<struct FLinearColor> TeamColors; // 0x540(0x10)

	void OnRespawnTimeUpdated(); // Function TslGame.*b50bf4a466.OnRespawnTimeUpdated // None // @ game+0x55c5700
	void OnModeInitialized(); // Function TslGame.*b50bf4a466.OnModeInitialized // None // @ game+0x55c3698
	void OnMyTeamRankChanged(); // Function TslGame.*b50bf4a466.OnMyTeamRankChanged // None // @ game+0x55c3cec
	void OnMyTeamScoreChanged(); // Function TslGame.*b50bf4a466.OnMyTeamScoreChanged // None // @ game+0x55c3e10
	void OnTimeLimitUpdated(struct FString Param0); // Function TslGame.*b50bf4a466.OnTimeLimitUpdated // None // @ game+0x55c64fc
	void OnHighEnemyScoreChanged(); // Function TslGame.*b50bf4a466.OnHighEnemyScoreChanged // None // @ game+0x55c2848
	void OnMyGainScoreChanged(); // Function TslGame.*b50bf4a466.OnMyGainScoreChanged // None // @ game+0x55c3bb8
	void OnResetLevel(); // Function TslGame.*b50bf4a466.OnResetLevel // None // @ game+0x55c56e8
	void OnMatchStarted(); // Function TslGame.*b50bf4a466.OnMatchStarted // None // @ game+0x55c31a8
	void OnModeStarted(); // Function TslGame.*b50bf4a466.OnModeStarted // None // @ game+0x55c37d4
};

// Class TslGame.CustomTwoTeamScoreboardWidget
// Size: 0x5b0 (Inherited: 0x570)
struct UCustomTwoTeamScoreboardWidget : U*b50bf4a466 {
	struct F*f4f57b85a2 TargetScoreTextBinder; // 0x570(0x20)
	struct FText TargetScoreText; // 0x590(0x18)
	char pad_5A8[0x8]; // 0x5a8(0x08)

	void OnMyTeamScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamScoreChanged // None // @ game+0x55c3e10
	struct FString OnRespawnTimeUpdated(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnRespawnTimeUpdated // None // @ game+0x55c5700
	void OnModeStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeStarted // None // @ game+0x55c37d4
	void ShowInstantRespawnMessage(struct FString Param0); // Function TslGame.CustomTwoTeamScoreboardWidget.ShowInstantRespawnMessage // None // @ game+0x55cfa20
	void OnMatchStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMatchStarted // None // @ game+0x55c31a8
	void OnMyGainScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyGainScoreChanged // None // @ game+0x55c3bb8
	void OnMyTeamRankChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamRankChanged // None // @ game+0x55c3cec
	void OnModeInitialized(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeInitialized // None // @ game+0x55c3698
	void OnTimeLimitUpdated(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnTimeLimitUpdated // None // @ game+0x55c64fc
	void OnResetLevel(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnResetLevel // None // @ game+0x55c56e8
	void OnHighEnemyScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnHighEnemyScoreChanged // None // @ game+0x55c2848
};

// Class TslGame.ConquestModeWidget
// Size: 0x640 (Inherited: 0x5b0)
struct UConquestModeWidget : UCustomTwoTeamScoreboardWidget {
	struct UClass* *abcb79ee60; // 0x5b0(0x08)
	struct UClass* *6702471f1a; // 0x5b8(0x08)
	struct F*8e32972a91 *50fe2b8cf4; // 0x5c0(0x28)
	struct F*8e32972a91 *05159280d8; // 0x5e8(0x28)
	bool *d0bc1531c9; // 0x610(0x01)
	char pad_611[0x7]; // 0x611(0x07)
	struct FString *ccac28ff91; // 0x618(0x10)
	struct TArray<struct U*2266736abb*> *77c5218a22; // 0x628(0x10)
	struct U*2266736abb* *503cbe8be0; // 0x638(0x08)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.ConquestModeWidget.OnActivatedCaptureAreaUpdated // None // @ game+0x55c07c4
};

// Class TslGame.*e05bee1fa8
// Size: 0x5e0 (Inherited: 0x5b0)
struct U*e05bee1fa8 : UCustomTwoTeamScoreboardWidget {
	struct F*c69f8ed24a *778cbf4fc4; // 0x5b0(0x28)
	char pad_5D8[0x8]; // 0x5d8(0x08)

	void OnMyTeamScoreChanged(); // Function TslGame.*e05bee1fa8.OnMyTeamScoreChanged // None // @ game+0x55c3e10
	void OnMatchStarted(); // Function TslGame.*e05bee1fa8.OnMatchStarted // None // @ game+0x55c31a8
	void OnModeInitialized(); // Function TslGame.*e05bee1fa8.OnModeInitialized // None // @ game+0x55c3698
	void OnHighEnemyScoreChanged(); // Function TslGame.*e05bee1fa8.OnHighEnemyScoreChanged // None // @ game+0x55c2848
};

// Class TslGame.*ce9a3c8a0c
// Size: 0x630 (Inherited: 0x5b0)
struct U*ce9a3c8a0c : UCustomTwoTeamScoreboardWidget {
	struct F*f4f57b85a2 *835b6217c8; // 0x5b0(0x20)
	struct F*f4f57b85a2 *3b0478344e; // 0x5d0(0x20)
	struct F*e9e2558d2e *dfc8a8df4f; // 0x5f0(0x20)
	struct F*e9e2558d2e *2a5a084875; // 0x610(0x20)

	void OnMyTeamScoreChanged(); // Function TslGame.*ce9a3c8a0c.OnMyTeamScoreChanged // None // @ game+0x55c3e10
	void *c29d14e6d6(); // Function TslGame.*ce9a3c8a0c.*c29d14e6d6 // None // @ game+0x55c306c
	void OnHighEnemyScoreChanged(); // Function TslGame.*ce9a3c8a0c.OnHighEnemyScoreChanged // None // @ game+0x55c2848
	void OnMatchStarted(); // Function TslGame.*ce9a3c8a0c.OnMatchStarted // None // @ game+0x55c31a8
	void OnModeInitialized(); // Function TslGame.*ce9a3c8a0c.OnModeInitialized // None // @ game+0x55c3698
	void OnMyGainScoreChanged(); // Function TslGame.*ce9a3c8a0c.OnMyGainScoreChanged // None // @ game+0x55c3bb8
};

// Class TslGame.*10859b414d
// Size: 0x5c0 (Inherited: 0x570)
struct U*10859b414d : U*b50bf4a466 {
	char pad_570[0x28]; // 0x570(0x28)
	struct F*7f3debddd2 TimeLimitTimerSizeBoxBinder; // 0x598(0x20)
	struct UMaterialInterface* *4a34792481; // 0x5b8(0x08)

	struct FString OnTimeLimitUpdated(); // Function TslGame.*10859b414d.OnTimeLimitUpdated // None // @ game+0x55c64fc
};

// Class TslGame.*b4d5441dd6
// Size: 0x500 (Inherited: 0x410)
struct U*b4d5441dd6 : U*17234a7c9b {
	struct F*f4f57b85a2 Label; // 0x410(0x20)
	struct F*959656208f Border; // 0x430(0x30)
	char pad_460[0xa0]; // 0x460(0xa0)
};

// Class TslGame.*953faae2c4
// Size: 0x478 (Inherited: 0x410)
struct U*953faae2c4 : U*17234a7c9b {
	struct F*24ef768fdd EditText; // 0x410(0x20)
	struct F*f4f57b85a2 TextBlock; // 0x430(0x20)
	char pad_450[0x28]; // 0x450(0x28)

	void OnCloseButtonClicked(); // Function TslGame.*953faae2c4.OnCloseButtonClicked // None // @ game+0xaf438c
	void OnOkayButtonClicked(); // Function TslGame.*953faae2c4.OnOkayButtonClicked // None // @ game+0xaf438c
};

// Class TslGame.*c03b1ac3a3
// Size: 0x4c0 (Inherited: 0x478)
struct U*c03b1ac3a3 : U*953faae2c4 {
	struct F*f0cac2bec7 VerticalBox; // 0x478(0x28)
	struct UClass* *8c9098e50a; // 0x4a0(0x08)
	char pad_4A8[0x18]; // 0x4a8(0x18)
};

// Class TslGame.*3c1c3f404e
// Size: 0x4d8 (Inherited: 0x410)
struct U*3c1c3f404e : U*17234a7c9b {
	struct F*d3069d51ff OilGaugeImageBinder; // 0x410(0x28)
	struct F*d3069d51ff OilGaugeBgImageBinder; // 0x438(0x28)
	struct F*d3069d51ff OilArrowImageBinder; // 0x460(0x28)
	struct F*0d3e7cd17a GaugeBodyBinder; // 0x488(0x28)
	struct FLinearColor NormalColor; // 0x4b0(0x10)
	struct FLinearColor FuelEmptyColor; // 0x4c0(0x10)
	struct FName GaugePramName; // 0x4d0(0x08)
};

// Class TslGame.*229763a82b
// Size: 0x540 (Inherited: 0x4d8)
struct U*229763a82b : U*3c1c3f404e {
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct F*e9e2558d2e BoostGauge_Using; // 0x4e0(0x20)
	struct F*e9e2558d2e BoostGauge_Normal; // 0x500(0x20)
	struct F*e9e2558d2e BoostGauge_CantUse; // 0x520(0x20)
};

// Class TslGame.*a4c013a5c3
// Size: 0x440 (Inherited: 0x410)
struct U*a4c013a5c3 : U*17234a7c9b {
	struct UCheckBox* DriverCheckBox; // 0x410(0x08)
	struct UTextBlock* ChannelTextBlock; // 0x418(0x08)
	struct UProgressBar* VolumeProgressBar; // 0x420(0x08)
	struct USlider* PlayTimeBar; // 0x428(0x08)
	float *566c56b4b7; // 0x430(0x04)
	float *8407c9dca0; // 0x434(0x04)
	bool *feb1f27e0e; // 0x438(0x01)
	bool *9ac7554482; // 0x439(0x01)
	bool *c972009a62; // 0x43a(0x01)
	char pad_43B[0x5]; // 0x43b(0x05)
};

// Class TslGame.*2460094d76
// Size: 0x458 (Inherited: 0x410)
struct U*2460094d76 : U*17234a7c9b {
	int32 SeatIndex; // 0x410(0x04)
	char pad_414[0x4]; // 0x414(0x04)
	struct FName StateParamName; // 0x418(0x08)
	struct F*d3069d51ff SeatImageBinder; // 0x420(0x28)
	struct APawn* *5a49690b64; // 0x448(0x08)
	struct U*5a1c6e8353* *473534eb52; // 0x450(0x08)

	void GetSeatState(); // Function TslGame.*2460094d76.GetSeatState // None // @ game+0x61d320
};

// Class TslGame.*70c76f5bfa
// Size: 0x588 (Inherited: 0x410)
struct U*70c76f5bfa : U*17234a7c9b {
	struct F*f0cac2bec7 *03ac4360ab; // 0x410(0x28)
	struct F*7f3debddd2 *ffbf377a61; // 0x438(0x20)
	struct F*f4f57b85a2 *49032d98bf; // 0x458(0x20)
	struct F*f4f57b85a2 *c49271e9b0; // 0x478(0x20)
	struct F*c233adf9bd *c762dd0eda; // 0x498(0x20)
	struct F*c233adf9bd *2daf39f189; // 0x4b8(0x20)
	struct F*c233adf9bd *72985d767e; // 0x4d8(0x20)
	struct F*e9e2558d2e *20f8117693; // 0x4f8(0x20)
	struct F*e9e2558d2e *fa5855502f; // 0x518(0x20)
	struct F*e9e2558d2e *10a286b330; // 0x538(0x20)
	struct F*e9e2558d2e *97e54170fe; // 0x558(0x20)
	struct APawn* *5a49690b64; // 0x578(0x08)
	struct UUserWidget* *4c1a98e993; // 0x580(0x08)
};

// Class TslGame.*42297812cd
// Size: 0x4e8 (Inherited: 0x410)
struct U*42297812cd : U*17234a7c9b {
	struct F*f0cac2bec7 MainSizeBoxBinder; // 0x410(0x28)
	struct F*f23e4e6c9e MainCanvasBinder; // 0x438(0x28)
	struct F*607bfdb0fb VehicleIconInvalidationBoxBinder; // 0x460(0x28)
	struct F*f0cac2bec7 VehicleIconBoxBinder; // 0x488(0x28)
	struct F*d3069d51ff VehicleIconImageBinder; // 0x4b0(0x28)
	struct APawn* *5a49690b64; // 0x4d8(0x08)
	char pad_4E0[0x8]; // 0x4e0(0x08)
};

// Class TslGame.*aa8ac8a36c
// Size: 0x420 (Inherited: 0x410)
struct U*aa8ac8a36c : U*17234a7c9b {
	struct UProgressBar* ThrottleUp; // 0x410(0x08)
	struct UProgressBar* ThrottleDown; // 0x418(0x08)
};

// Class TslGame.*94877bdf65
// Size: 0x498 (Inherited: 0x410)
struct U*94877bdf65 : U*17234a7c9b {
	struct F*fd985b6c41 WheelColorSet; // 0x410(0x10)
	int32 WheelIndex; // 0x420(0x04)
	float HeavyDamagedThreshold; // 0x424(0x04)
	struct F*d3069d51ff WheelImageBinder; // 0x428(0x28)
	struct F*d3069d51ff PunctureImageBinder; // 0x450(0x28)
	struct ATslWheeledVehicle* *5a49690b64; // 0x478(0x08)
	struct UTslWheeledVehicleMovement* *97ef1efd01; // 0x480(0x08)
	struct FName *3ad2a75205; // 0x488(0x08)
	struct FName *3a13bd1baa; // 0x490(0x08)
};

// Class TslGame.*ae27e747ae
// Size: 0x440 (Inherited: 0x410)
struct U*ae27e747ae : U*17234a7c9b {
	bool bReturnEmptyVersionTextIfNickNameInvalid; // 0x410(0x01)
	bool bHideRegionIfInvalid; // 0x411(0x01)
	char pad_412[0x6]; // 0x412(0x06)
	struct F*f4f57b85a2 VersionInfoTextBinder; // 0x418(0x20)
	bool bHideInfraCodeIfInvalid; // 0x438(0x01)
	bool *dd3683235e; // 0x439(0x01)
	char pad_43A[0x6]; // 0x43a(0x06)

	void ForceUpdate(); // Function TslGame.*ae27e747ae.ForceUpdate // None // @ game+0x55bd32c
};

// Class TslGame.*33fef58208
// Size: 0x458 (Inherited: 0x410)
struct U*33fef58208 : U*17234a7c9b {
	struct F*c233adf9bd *e44486e28b; // 0x410(0x20)
	struct F*91cf62c1f2 *812bd49e2e; // 0x430(0x28)
};

// Class TslGame.*173d3bfecd
// Size: 0x498 (Inherited: 0x410)
struct U*173d3bfecd : U*17234a7c9b {
	struct F*f4f57b85a2 *369e178bed; // 0x410(0x20)
	struct U*0399764a34* TeamLeaderNameFlowText; // 0x430(0x08)
	struct F*f4f57b85a2 *0fb733d583; // 0x438(0x20)
	struct FLinearColor *352d4a1bd5; // 0x458(0x10)
	struct FLinearColor *cc7a0582c5; // 0x468(0x10)
	struct F*7f3debddd2 *e0b3947bd9; // 0x478(0x20)
};

// Class TslGame.*127c5d0f80
// Size: 0x6a8 (Inherited: 0x410)
struct U*127c5d0f80 : U*17234a7c9b {
	struct TMap<int32, struct F*dcd05136fe> *4cfe108b5e; // 0x410(0x50)
	struct TArray<struct F*f0cac2bec7> *584a9ab14d; // 0x460(0x10)
	struct TArray<struct F*c69f8ed24a> *0eb8debf84; // 0x470(0x10)
	struct TArray<struct F*f4f57b85a2> *553328e89e; // 0x480(0x10)
	struct TArray<struct F*d3069d51ff> *fa59003db9; // 0x490(0x10)
	struct TArray<struct F*f4f57b85a2> *dd1fd7f2e0; // 0x4a0(0x10)
	struct TArray<struct F*f4f57b85a2> *73ad8f332b; // 0x4b0(0x10)
	struct TArray<struct F*f0cac2bec7> *ba81cf1caf; // 0x4c0(0x10)
	struct F*c233adf9bd *0e3d55a32a; // 0x4d0(0x20)
	struct UClass* *1a732852aa; // 0x4f0(0x08)
	int32 *d67f5492f8; // 0x4f8(0x04)
	char pad_4FC[0x4]; // 0x4fc(0x04)
	struct FName *ac8ec2905d; // 0x500(0x08)
	char pad_508[0x1a0]; // 0x508(0x1a0)

	void OnRep_StartModeProperties(); // Function TslGame.*127c5d0f80.OnRep_StartModeProperties // None // @ game+0x55c53c0
	void OnScoreChanged(); // Function TslGame.*127c5d0f80.OnScoreChanged // None // @ game+0x55c5b30
	struct ATslBaseHUD* *c29d14e6d6(); // Function TslGame.*127c5d0f80.*c29d14e6d6 // None // @ game+0x55c2f94
	void *b17ee2b1af(); // Function TslGame.*127c5d0f80.*b17ee2b1af // None // @ game+0x55c4ad0
};

// Class TslGame.*0fc647e9fa
// Size: 0x540 (Inherited: 0x410)
struct U*0fc647e9fa : U*17234a7c9b {
	struct F*b9afef7a3a *32a208b606; // 0x410(0x28)
	struct F*e9e2558d2e *0fb4033b8c; // 0x438(0x20)
	struct F*e9e2558d2e *9c89684a10; // 0x458(0x20)
	struct F*e9e2558d2e *45175a0200; // 0x478(0x20)
	struct F*e9e2558d2e *d28397d13a; // 0x498(0x20)
	struct F*8e32972a91 *001895b498; // 0x4b8(0x28)
	struct F*d3069d51ff *6b210e4303; // 0x4e0(0x28)
	struct F*d3069d51ff *d5c744c2f3; // 0x508(0x28)
	int32 *5882b8ff4c; // 0x530(0x04)
	float *bcef8cc9c6; // 0x534(0x04)
	int32 *ca2dcdc85b; // 0x538(0x04)
	bool *8010804542; // 0x53c(0x01)
	char pad_53D[0x3]; // 0x53d(0x03)
};

// Class TslGame.WarModeWidget
// Size: 0x790 (Inherited: 0x410)
struct UWarModeWidget : U*17234a7c9b {
	struct U*830fa4a500* RespawnTimerUpdater; // 0x410(0x08)
	struct U*830fa4a500* TimeLimitTimerUpdater; // 0x418(0x08)
	struct F*c69f8ed24a *9a3c94b320; // 0x420(0x28)
	struct F*f4f57b85a2 *dc4c229d47; // 0x448(0x20)
	struct F*f4f57b85a2 *c2e034e497; // 0x468(0x20)
	struct F*b9afef7a3a *dc7f90ddf2; // 0x488(0x28)
	struct F*f4f57b85a2 *319daf83b9; // 0x4b0(0x20)
	struct F*f4f57b85a2 *4290d66ec5; // 0x4d0(0x20)
	struct F*f4f57b85a2 *73e5ecc101; // 0x4f0(0x20)
	struct F*f4f57b85a2 *cb2fedd8ba; // 0x510(0x20)
	struct F*f4f57b85a2 *d4a99bcbfd; // 0x530(0x20)
	struct F*f4f57b85a2 *f4bd4f0f6a; // 0x550(0x20)
	struct F*f4f57b85a2 *075603d70a; // 0x570(0x20)
	struct F*f4f57b85a2 *f101f00e6f; // 0x590(0x20)
	struct F*f4f57b85a2 *244a219887; // 0x5b0(0x20)
	struct F*f4f57b85a2 *3b0478344e; // 0x5d0(0x20)
	struct F*e9e2558d2e *dfc8a8df4f; // 0x5f0(0x20)
	struct F*e9e2558d2e *2a5a084875; // 0x610(0x20)
	struct F*b9afef7a3a *32a208b606; // 0x630(0x28)
	struct F*e9e2558d2e *0fb4033b8c; // 0x658(0x20)
	struct F*e9e2558d2e *9c89684a10; // 0x678(0x20)
	struct F*e9e2558d2e *45175a0200; // 0x698(0x20)
	struct F*e9e2558d2e *d28397d13a; // 0x6b8(0x20)
	struct F*8e32972a91 *001895b498; // 0x6d8(0x28)
	struct F*d3069d51ff *6b210e4303; // 0x700(0x28)
	struct F*d3069d51ff *d5c744c2f3; // 0x728(0x28)
	struct F*f23e4e6c9e *b1352339af; // 0x750(0x28)
	char pad_778[0x18]; // 0x778(0x18)

	struct FString OnTimeLimitUpdated(); // Function TslGame.WarModeWidget.OnTimeLimitUpdated // None // @ game+0x55c661c
	void OnModeStrated(); // Function TslGame.WarModeWidget.OnModeStrated // None // @ game+0x55c38c0
	void ShowInstantRespawnMessage(struct FString Param0); // Function TslGame.WarModeWidget.ShowInstantRespawnMessage // None // @ game+0x55cfb3c
	void *c29d14e6d6(); // Function TslGame.WarModeWidget.*c29d14e6d6 // None // @ game+0x55c306c
	void OnHighEnemyScoreChanged(); // Function TslGame.WarModeWidget.OnHighEnemyScoreChanged // None // @ game+0x55c28e4
	void OnMyTeamRankChanged(); // Function TslGame.WarModeWidget.OnMyTeamRankChanged // None // @ game+0x55c3d80
	void OnRespawnTimeUpdated(); // Function TslGame.WarModeWidget.OnRespawnTimeUpdated // None // @ game+0x55c5820
	void CollapseKillcamButtonUI(); // Function TslGame.WarModeWidget.CollapseKillcamButtonUI // None // @ game+0x55bbf88
	void OnModeInitialized(); // Function TslGame.WarModeWidget.OnModeInitialized // None // @ game+0x55c3738
	void OnMyGainScoreChanged(); // Function TslGame.WarModeWidget.OnMyGainScoreChanged // None // @ game+0x55c3c54
	void OnMyTeamScoreChanged(); // Function TslGame.WarModeWidget.OnMyTeamScoreChanged // None // @ game+0x55c3eac
};

// Class TslGame.*3cb5fbdf1d
// Size: 0x7a8 (Inherited: 0x790)
struct U*3cb5fbdf1d : UWarModeWidget {
	struct UWidgetSwitcher* GameTimerBackgroundSwitcher; // 0x790(0x08)
	struct UOverlay* GameTimerOverlay; // 0x798(0x08)
	char pad_7A0[0x8]; // 0x7a0(0x08)

	enum class ETslBombPlantedState *9818b2de98(); // Function TslGame.*3cb5fbdf1d.*9818b2de98 // None // @ game+0x55c0e6c
};

// Class TslGame.*a6a2dcf842
// Size: 0x5a0 (Inherited: 0x410)
struct U*a6a2dcf842 : U*17234a7c9b {
	struct F*c233adf9bd CurrentWeaponSlotWidgetBinder; // 0x410(0x20)
	struct TArray<struct F*c233adf9bd> WeaponSlotWidgetBinderList; // 0x430(0x10)
	struct F*959656208f WeaponSlotListBorderBinder; // 0x440(0x30)
	struct F*e9e2558d2e FadeInSlotListAminBinder; // 0x470(0x20)
	struct F*e9e2558d2e FadeOutSlotListAminBinder; // 0x490(0x20)
	float SlotOffsetMultiply; // 0x4b0(0x04)
	float SlotPadding; // 0x4b4(0x04)
	struct F*51f63f4b27 MovingSequence; // 0x4b8(0xa0)
	char pad_558[0x38]; // 0x558(0x38)
	struct F*9c84e0ea54 *dfae79d7c1; // 0x590(0x08)
	struct UWeaponProcessorComponent* *8d1e55cf58; // 0x598(0x08)

	void OnNotifyWeaponArmed(); // Function TslGame.*a6a2dcf842.OnNotifyWeaponArmed // None // @ game+0x55c4224
	void OnMovingStarted(); // Function TslGame.*a6a2dcf842.OnMovingStarted // None // @ game+0x55c3ba4
	int32 OnNotifyWeaponChange(); // Function TslGame.*a6a2dcf842.OnNotifyWeaponChange // None // @ game+0x55c4238
	void OnNotifyWeaponUnarm(); // Function TslGame.*a6a2dcf842.OnNotifyWeaponUnarm // None // @ game+0x55c43f8
	void *e5b3630c17(); // Function TslGame.*a6a2dcf842.*e5b3630c17 // None // @ game+0x55c3b90
};

// Class TslGame.*0e8d4a8c4c
// Size: 0x430 (Inherited: 0x410)
struct U*0e8d4a8c4c : U*17234a7c9b {
	struct UTextBlock* Purchase_Text; // 0x410(0x08)
	struct UTextBlock* Price_Text; // 0x418(0x08)
	struct UWidgetSwitcher* Key_Switcher; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)

	void OnNotifyWeaponChange(); // Function TslGame.*0e8d4a8c4c.OnNotifyWeaponChange // None // @ game+0x55c4318
};

// Class TslGame.*dff1a3725f
// Size: 0x430 (Inherited: 0x410)
struct U*dff1a3725f : U*17234a7c9b {
	struct U*0399764a34* PlayerName; // 0x410(0x08)
	struct UTextBlock* Score_Text; // 0x418(0x08)
	struct UTextBlock* Rank_Text; // 0x420(0x08)
	struct U*7f757909f6* PlatformIcon; // 0x428(0x08)
};

// Class TslGame.*5bb029d6ef
// Size: 0x428 (Inherited: 0x410)
struct U*5bb029d6ef : U*17234a7c9b {
	struct UWrapBox* RankingList_WrapBox; // 0x410(0x08)
	char pad_418[0x10]; // 0x418(0x10)

	void RefreshInfo(); // Function TslGame.*5bb029d6ef.RefreshInfo // None // @ game+0x55c87cc
};

// Class TslGame.*c50a04078d
// Size: 0x438 (Inherited: 0x410)
struct U*c50a04078d : U*17234a7c9b {
	struct UTextBlock* PlayerName_Text; // 0x410(0x08)
	struct UTextBlock* Kill_Text; // 0x418(0x08)
	struct UTextBlock* Death_Text; // 0x420(0x08)
	struct UTextBlock* Score_Text; // 0x428(0x08)
	struct U*7f757909f6* PlatformIcon; // 0x430(0x08)
};

// Class TslGame.*dc31d4d60d
// Size: 0x470 (Inherited: 0x410)
struct U*dc31d4d60d : U*17234a7c9b {
	struct F*f4f57b85a2 ZeroingdistanceTextBinder; // 0x410(0x20)
	struct F*e9e2558d2e ZeroDistChangeAnimBinder; // 0x430(0x20)
	struct FText ZeroingTextFormat; // 0x450(0x18)
	int32 *d132e85de9; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
};

// Class TslGame.*7721787bb5
// Size: 0x4c0 (Inherited: 0x410)
struct U*7721787bb5 : U*17234a7c9b {
	struct U*830fa4a500* TimeLimitTimerUpdater; // 0x410(0x08)
	struct F*f4f57b85a2 TimeLimitTextBinder; // 0x418(0x20)
	struct UTextBlock* Coin_Text; // 0x438(0x08)
	struct UTextBlock* SpendCoin_Text; // 0x440(0x08)
	struct UTextBlock* CurrentStage_Text; // 0x448(0x08)
	struct UTextBlock* TotalStage_Text; // 0x450(0x08)
	struct UVerticalBox* StageInfo; // 0x458(0x08)
	struct UImage* Player_2; // 0x460(0x08)
	struct UImage* Player_3; // 0x468(0x08)
	struct UImage* Player_4; // 0x470(0x08)
	struct UImage* Player_5; // 0x478(0x08)
	struct UHorizontalBox* CoinInfo_HorizontalBox; // 0x480(0x08)
	struct U*6b11b3bf02* Anim_ConsumeBullets; // 0x488(0x08)
	struct FName *36cb91ce3d; // 0x490(0x08)
	bool *b7693cf52f; // 0x498(0x01)
	char pad_499[0x3]; // 0x499(0x03)
	float *9f5a968128; // 0x49c(0x04)
	bool *19e13f2625; // 0x4a0(0x01)
	bool *2c77d2b992; // 0x4a1(0x01)
	char pad_4A2[0x1e]; // 0x4a2(0x1e)

	void OnTimeLimitUpdated(struct FString Param0); // Function TslGame.*7721787bb5.OnTimeLimitUpdated // None // @ game+0x55c6738
	void *201efe36b9(); // Function TslGame.*7721787bb5.*201efe36b9 // None // @ game+0x55c7840
	void *904d26a7d2(); // Function TslGame.*7721787bb5.*904d26a7d2 // None // @ game+0x55c207c
	void OnMatchStarted(); // Function TslGame.*7721787bb5.OnMatchStarted // None // @ game+0x55c32d4
	void *40dea6b630(); // Function TslGame.*7721787bb5.*40dea6b630 // None // @ game+0x55c8904
	void *c29d14e6d6(); // Function TslGame.*7721787bb5.*c29d14e6d6 // None // @ game+0x55c3100
	void OnCraftFinished(); // Function TslGame.*7721787bb5.OnCraftFinished // None // @ game+0x55c19dc
	struct UObject* *8e0a56a149(struct ATslBaseHUD* Param3); // Function TslGame.*7721787bb5.*8e0a56a149 // None // @ game+0x55c7ee0
	void UpdateCoin(); // Function TslGame.*7721787bb5.UpdateCoin // None // @ game+0x55d0c40
	void *4cb6657db6(); // Function TslGame.*7721787bb5.*4cb6657db6 // None // @ game+0x55d16c0
	void UpdateTeamMark(); // Function TslGame.*7721787bb5.UpdateTeamMark // None // @ game+0x55d178c
	void *bd6573aeb6(); // Function TslGame.*7721787bb5.*bd6573aeb6 // None // @ game+0x55c5dc4
	void OnViewTargetChanged(); // Function TslGame.*7721787bb5.OnViewTargetChanged // None // @ game+0x55c7384
};

// Class TslGame.ZombieDefenseShopWidget
// Size: 0x4a0 (Inherited: 0x410)
struct UZombieDefenseShopWidget : U*17234a7c9b {
	char pad_410[0x28]; // 0x410(0x28)
	float *fd09578373; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct UTextBlock* Coin_Text; // 0x440(0x08)
	struct UTextBlock* Decrease_Text; // 0x448(0x08)
	struct UWrapBox* ItemList_WrapBox; // 0x450(0x08)
	struct U*6b11b3bf02* Anim_Decrease; // 0x458(0x08)
	struct FName *36cb91ce3d; // 0x460(0x08)
	struct UClass* ItemClass; // 0x468(0x08)
	struct TArray<struct F*dc7416fd19> *0d03f93b1c; // 0x470(0x10)
	struct TArray<struct U*cd8084a8e1*> *11001c7e3e; // 0x480(0x10)
	struct U*e2c62067d8* *9021b92759; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)

	void UpdateGoldCoin(); // Function TslGame.ZombieDefenseShopWidget.UpdateGoldCoin // None // @ game+0x55d0f48
	struct FName UpdateGoldCoinStackCount(); // Function TslGame.ZombieDefenseShopWidget.UpdateGoldCoinStackCount // None // @ game+0x55d0f5c
	void OnCraftableItemCountChanged(); // Function TslGame.ZombieDefenseShopWidget.OnCraftableItemCountChanged // None // @ game+0x55c1ad8
};

// Class TslGame.*3cc1ef1fc1
// Size: 0x510 (Inherited: 0x4a0)
struct U*3cc1ef1fc1 : UZombieDefenseShopWidget {
	struct F*c233adf9bd *11b31e1df5; // 0x4a0(0x20)
	struct F*c233adf9bd *58f4ad784a; // 0x4c0(0x20)
	struct F*d3069d51ff *8c9539bf8c; // 0x4e0(0x28)
	int32 SlotIndex; // 0x508(0x04)
	bool *f201fc3b66; // 0x50c(0x01)
	char pad_50D[0x3]; // 0x50d(0x03)
};

// Class TslGame.*afe89d7675
// Size: 0x260 (Inherited: 0x1f0)
struct U*afe89d7675 : UActorComponent {
	char pad_1F0[0x8]; // 0x1f0(0x08)
	bool *a233a29eba; // 0x1f8(0x01)
	char pad_1F9[0x7]; // 0x1f9(0x07)
	struct ATslRope* *2cfc205a48; // 0x200(0x08)
	struct AAscenderItemBase* *1942d09171; // 0x208(0x08)
	struct FRotator *0ce5d3e4af; // 0x210(0x0c)
	bool *7b0928ae3f; // 0x21c(0x01)
	char pad_21D[0x3]; // 0x21d(0x03)
	struct UAkComponent* AkSoundComp; // 0x220(0x08)
	float *beb5faacc3; // 0x228(0x04)
	char pad_22C[0x34]; // 0x22c(0x34)

	void OnRep_CurrentAscenderRope(); // Function TslGame.*afe89d7675.OnRep_CurrentAscenderRope // None // @ game+0x55c4e7c
	struct FVector_NetQuantizeNormal *b18527c263(bool Param5); // Function TslGame.*afe89d7675.*b18527c263 // None // @ game+0x55bb8d0
	void OnRep_IsAttachedToAscender(); // Function TslGame.*afe89d7675.OnRep_IsAttachedToAscender // None // @ game+0x55c5218
	void OnRep_HeldItem(); // Function TslGame.*afe89d7675.OnRep_HeldItem // None // @ game+0x55c51dc
	void *e28f2b5e03(); // Function TslGame.*afe89d7675.*e28f2b5e03 // None // @ game+0x55beb54
	void *992f4babda(); // Function TslGame.*afe89d7675.*992f4babda // None // @ game+0x55c935c
	void *225f8658ad(); // Function TslGame.*afe89d7675.*225f8658ad // None // @ game+0x55bc6a8
	void *5499a1c62b(); // Function TslGame.*afe89d7675.*5499a1c62b // None // @ game+0x55ccfe8
};

// Class TslGame.TslVaultingHelper
// Size: 0x408 (Inherited: 0x3f8)
struct ATslVaultingHelper : AActor {
	struct USceneComponent* RootSceneComponent; // 0x3f8(0x08)
	struct USceneComponent* ActorAttachScene; // 0x400(0x08)

	void *8099579fee(); // Function TslGame.TslVaultingHelper.*8099579fee // None // @ game+0x55bd3e4
};

// Class TslGame.TslVehicleAIManager
// Size: 0x850 (Inherited: 0x3f8)
struct ATslVehicleAIManager : AActor {
	char pad_3F8[0x10]; // 0x3f8(0x10)
	bool bDrawDebugInEditor; // 0x408(0x01)
	bool bDebugTargetLocation; // 0x409(0x01)
	char pad_40A[0x2]; // 0x40a(0x02)
	struct FVector DebugTargetLocation; // 0x40c(0x0c)
	struct TMap<struct F*f84ceae64b, struct F*de61ae727e> DebugTargetPointDistances; // 0x418(0x50)
	bool bOnlySpawnInSafetyZone; // 0x468(0x01)
	bool bQueueSpawns; // 0x469(0x01)
	char pad_46A[0x6]; // 0x46a(0x06)
	struct UDataTable* VehicleSpawnDataTable; // 0x470(0x20)
	struct FName AIPawnTag; // 0x490(0x08)
	int32 MaxConcurrentVehicles; // 0x498(0x04)
	int32 MaxVehiclesPerGame; // 0x49c(0x04)
	char pad_4A0[0x4]; // 0x4a0(0x04)
	float SpawnPointCooldown; // 0x4a4(0x04)
	struct FName CurrentPathKeyName; // 0x4a8(0x08)
	struct FName CurrentPathInputKeyKeyName; // 0x4b0(0x08)
	struct FName PreviousPathInputKeyKeyName; // 0x4b8(0x08)
	struct FName IsPathingInReverseKeyName; // 0x4c0(0x08)
	struct FName IsStoppedKeyName; // 0x4c8(0x08)
	struct FName IsDebugForceStoppedKeyName; // 0x4d0(0x08)
	struct FName TargetPathKeyName; // 0x4d8(0x08)
	struct FName TargetPathInputKeyKeyName; // 0x4e0(0x08)
	struct FName UseSidePathsKeyName; // 0x4e8(0x08)
	enum class EVehicleAIAvoidanceMode AvoidanceMode; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	float InitRetryDelay; // 0x4f4(0x04)
	int32 MaxInitRetries; // 0x4f8(0x04)
	char pad_4FC[0x1c]; // 0x4fc(0x1c)
	struct TArray<struct ATslVehicleAISpawner*> *231a48f5e9; // 0x518(0x10)
	struct TArray<struct ATslAIWaypointSegment*> *a85775c3aa; // 0x528(0x10)
	struct TArray<struct ATslVehicleAIPathZone*> *5da57c8695; // 0x538(0x10)
	struct TArray<enum class EGameZoneType> *6f79c83aa6; // 0x548(0x10)
	struct TMap<enum class EGameZoneType, struct F*5d58ecab67> *e6af6fcaab; // 0x558(0x50)
	struct TMap<struct F*f84ceae64b, struct F*1e7dc12f94> *2f1e68056a; // 0x5a8(0x50)
	struct TMap<enum class EGameZoneType, struct F*d7cf67187b> *213c158017; // 0x5f8(0x50)
	struct TMap<enum class EGameZoneType, struct F*d7cf67187b> *20dbdba838; // 0x648(0x50)
	int32 *3c6036f0c9; // 0x698(0x04)
	char pad_69C[0x4]; // 0x69c(0x04)
	int32 *8c3cdff035; // 0x6a0(0x04)
	char pad_6A4[0x4]; // 0x6a4(0x04)
	struct TMap<struct ATslVehicleAISpawner*, float> *a8cf752eb4; // 0x6a8(0x50)
	char pad_6F8[0x58]; // 0x6f8(0x58)
	struct ATslGameMode* GameMode; // 0x750(0x08)
	char pad_758[0xf8]; // 0x758(0xf8)

	void StartPathZoneCalculations(); // Function TslGame.TslVehicleAIManager.StartPathZoneCalculations // None // @ game+0x55d03ac
	void *ff9103bdbd(); // Function TslGame.TslVehicleAIManager.*ff9103bdbd // None // @ game+0x55c85ac
};

// Class TslGame.TslVehicleAIPathZone
// Size: 0x408 (Inherited: 0x3f8)
struct ATslVehicleAIPathZone : AActor {
	struct UBoxComponent* ZoneVolume; // 0x3f8(0x08)
	struct FName *fffc508c4e; // 0x400(0x08)
};

// Class TslGame.TslVehicleAISpawner
// Size: 0x448 (Inherited: 0x3f8)
struct ATslVehicleAISpawner : AActor {
	struct FGuid ID; // 0x3f8(0x10)
	struct FString SpawnTag; // 0x408(0x10)
	bool bIsSingleUse; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct USceneComponent* SpawnPoint; // 0x420(0x08)
	struct F*8d353075d0 StartingPath; // 0x428(0x10)
	float InitializeVehicleBehaviorDelay; // 0x438(0x04)
	bool bUsed; // 0x43c(0x01)
	char pad_43D[0x3]; // 0x43d(0x03)
	struct ATslVehicleAIManager* *8f3e634279; // 0x440(0x08)

	void *0560a1a9cf(); // Function TslGame.TslVehicleAISpawner.*0560a1a9cf // None // @ game+0x55c84f4
	void *7b12953e2b(); // Function TslGame.TslVehicleAISpawner.*7b12953e2b // None // @ game+0x55bc018
	void *0973d27aa9(); // Function TslGame.TslVehicleAISpawner.*0973d27aa9 // None // @ game+0x55c5d30
};

// Class TslGame.TslLootTruckAISpawner
// Size: 0x480 (Inherited: 0x448)
struct ATslLootTruckAISpawner : ATslVehicleAISpawner {
	struct USkeletalMeshComponent* DoorSkeletalMesh; // 0x448(0x08)
	struct UStaticMeshComponent* DoorStaticMesh; // 0x450(0x08)
	struct UStaticMeshComponent* DoorFrameStaticMesh; // 0x458(0x08)
	struct UStaticMeshComponent* GarageStaticMesh; // 0x460(0x08)
	struct UAkComponent* DoorSlideAudio; // 0x468(0x08)
	struct UAkAudioEvent* DoorSlideAudioEvent; // 0x470(0x08)
	float DoorOpeningTime; // 0x478(0x04)
	bool *b707dc1e43; // 0x47c(0x01)
	bool *fcdb256d84; // 0x47d(0x01)
	char pad_47E[0x2]; // 0x47e(0x02)

	void FinishGarageOpening(); // Function TslGame.TslLootTruckAISpawner.FinishGarageOpening // None // @ game+0x55bd274
	void OnRep_GarageOpening(); // Function TslGame.TslLootTruckAISpawner.OnRep_GarageOpening // None // @ game+0x55c51c8
	void SetSkeletalMeshShouldUpdate(); // Function TslGame.TslLootTruckAISpawner.SetSkeletalMeshShouldUpdate // None // @ game+0x55cf01c
	void OnRep_Opened(); // Function TslGame.TslLootTruckAISpawner.OnRep_Opened // None // @ game+0x55c52a0
	void *aba97f226c(); // Function TslGame.TslLootTruckAISpawner.*aba97f226c // None // @ game+0x55be440
	void *0973d27aa9(); // Function TslGame.TslLootTruckAISpawner.*0973d27aa9 // None // @ game+0x55c5d30
	void *0560a1a9cf(); // Function TslGame.TslLootTruckAISpawner.*0560a1a9cf // None // @ game+0x55c84f4
};

// Class TslGame.*40d06648ff
// Size: 0xd30 (Inherited: 0x910)
struct U*40d06648ff : UVehicleAnimInstance {
	struct FRotator Rot_Steering_Left; // 0x908(0x0c)
	struct FRotator Rot_Steering_Right; // 0x914(0x0c)
	struct FRotator Rot_Steering_Final; // 0x920(0x0c)
	struct FRotator Rot_Speed_Left; // 0x92c(0x0c)
	struct FRotator Rot_Speed_Right; // 0x938(0x0c)
	float SpeedMax; // 0x944(0x04)
	struct FRotator Rot_Speed_Final; // 0x948(0x0c)
	struct FRotator Rot_RPM_Left; // 0x954(0x0c)
	struct FRotator Rot_RPM_Right; // 0x960(0x0c)
	float RPMMax; // 0x96c(0x04)
	struct FRotator Rot_Fuel_Empty; // 0x970(0x0c)
	struct FRotator Rot_Fuel_Full; // 0x97c(0x0c)
	struct FRotator Rot_Fuel_Final; // 0x988(0x0c)
	bool bTickSpeedIndicator; // 0x994(0x01)
	bool bTickRPMIndicator; // 0x995(0x01)
	bool bTickFuelIndicator; // 0x996(0x01)
	bool bUseAbsoluteSteeringRotation; // 0x997(0x01)
	bool bTickMotorbikeBody; // 0x998(0x01)
	struct FVector4 SpeedInMap; // 0x9a0(0x10)
	struct FVector4 SpeedOutMap; // 0x9b0(0x10)
	struct FVector4 DotVelocityMap; // 0x9c0(0x10)
	float DotVelocityPower; // 0x9d0(0x04)
	struct FVector2D LateralVelocityCompClamp; // 0x9d4(0x08)
	float LateralVelocityScalar; // 0x9dc(0x04)
	struct FVector4 SteerLowSpeedMap; // 0x9e0(0x10)
	float SteerLowSpeedStaticOffset; // 0x9f0(0x04)
	char pad_9F5[0xb]; // 0x9f5(0x0b)
	struct FVector4 SteerHighSpeedMap; // 0xa00(0x10)
	float SteerHighSpeedStaticOffset; // 0xa10(0x04)
	char pad_A14[0xc]; // 0xa14(0x0c)
	struct FVector4 SteerLERPSpeedMap; // 0xa20(0x10)
	struct FRotator *c075ea7492; // 0xa30(0x0c)
	struct FVector2D *cf15ea1a7d; // 0xa3c(0x08)
	char pad_A44[0xc]; // 0xa44(0x0c)
	struct FVector4 SteerRollMap; // 0xa50(0x10)
	bool bTickMotorbikeKickstand; // 0xa60(0x01)
	bool bUseInvertedKickstandAlpha; // 0xa61(0x01)
	char pad_A62[0x2]; // 0xa62(0x02)
	struct FRotator KickstandOffRotation; // 0xa64(0x0c)
	float KicstandInterpSpeed; // 0xa70(0x04)
	bool bUseSpeedRollMap; // 0xa74(0x01)
	char pad_A75[0x3]; // 0xa75(0x03)
	struct FVector2D LowSpeedRollMapIn; // 0xa78(0x08)
	struct FVector2D HighSpeedRollMapIn; // 0xa80(0x08)
	struct FRotator Rot_RPM_Final; // 0xa88(0x0c)
	char pad_A94[0x4]; // 0xa94(0x04)
	struct ATslWheeledVehicle* VehicleRef; // 0xa98(0x08)
	struct UTslWheeledVehicleMovement* VehicleMovementRef; // 0xaa0(0x08)
	struct FRotator SteerRollFinal; // 0xaa8(0x0c)
	struct FRotator SteerFL; // 0xab4(0x0c)
	struct FRotator SteerFR; // 0xac0(0x0c)
	struct FRotator BodyLean; // 0xacc(0x0c)
	bool *32c7e6c81f; // 0xad8(0x01)
	char pad_AD9[0x3]; // 0xad9(0x03)
	int32 *6c67822a91; // 0xadc(0x04)
	int32 *b030435a08; // 0xae0(0x04)
	int32 *e9be51ca2a; // 0xae4(0x04)
	int32 *9318ad4e1e; // 0xae8(0x04)
	int32 *b67cc6cb0a; // 0xaec(0x04)
	struct FVector *bbf647a519; // 0xaf0(0x0c)
	struct FVector *e3ebeb8906; // 0xafc(0x0c)
	bool *c359886ff6; // 0xb08(0x01)
	char pad_B09[0x3]; // 0xb09(0x03)
	struct FVector *f106a6666a; // 0xb0c(0x0c)
	struct FRotator DriveshaftR_Rot; // 0xb18(0x0c)
	struct FRotator DriveshaftR_Rot_Reversed; // 0xb24(0x0c)
	float KickstandAlpha; // 0xb30(0x04)
	bool *7fe96b25b8; // 0xb34(0x01)
	char pad_B35[0x3]; // 0xb35(0x03)
	struct TArray<int32> *9049b65ae1; // 0xb38(0x10)
	float *f08b24e8c8; // 0xb48(0x04)
	struct FVector AveragedWheelNormal; // 0xb4c(0x0c)
	struct FRotator AveragedWheelNormalRot; // 0xb58(0x0c)
	float SteerRollByWheelNormalScalar; // 0xb64(0x04)
	bool *45cbc953cf; // 0xb68(0x01)
	bool *9cf25d7676; // 0xb69(0x01)
	char pad_B6A[0x2]; // 0xb6a(0x02)
	struct FVector *3e0be11b29; // 0xb6c(0x0c)
	struct FVector *e396364abf; // 0xb78(0x0c)
	float *f0635190c3; // 0xb84(0x04)
	float *7df8cbf404; // 0xb88(0x04)
	float *693d73e799; // 0xb8c(0x04)
	char pad_B90[0xc]; // 0xb90(0x0c)
	float WaterAlpha; // 0xb9c(0x04)
	float FrontSplitterAlpha; // 0xba0(0x04)
	bool *b097a17035; // 0xba4(0x01)
	bool *55c321efea; // 0xba5(0x01)
	bool *4c3961bb4a; // 0xba6(0x01)
	bool *69a11bd7b0; // 0xba7(0x01)
	bool *6630c8ac19; // 0xba8(0x01)
	char pad_BA9[0x3]; // 0xba9(0x03)
	float *1fb9e50f62; // 0xbac(0x04)
	float DragScale; // 0xbb0(0x04)
	float *3c2b2fb130; // 0xbb4(0x04)
	float GravityScale; // 0xbb8(0x04)
	struct FVector ExternalForceAD; // 0xbbc(0x0c)
	struct FVector ExternalForceAD_World; // 0xbc8(0x0c)
	struct FVector ExternalForceAD_NoDrag; // 0xbd4(0x0c)
	struct FVector2D *448c07496f; // 0xbe0(0x08)
	struct FRotator HighShake; // 0xbe8(0x0c)
	struct FRotator MidShake; // 0xbf4(0x0c)
	struct FRotator LowShake; // 0xc00(0x0c)
	struct FRotator LowShakeReversed; // 0xc0c(0x0c)
	float EngineRPM_Alpha; // 0xc18(0x04)
	bool *022b3bd8c5; // 0xc1c(0x01)
	char pad_C1D[0x3]; // 0xc1d(0x03)
	struct FBox *e9e8fbbdea; // 0xc20(0x1c)
	struct FBox *796c14b8da; // 0xc3c(0x1c)
	struct FBox *9b3a74b879; // 0xc58(0x1c)
	float *730445050b; // 0xc74(0x04)
	float *47f9549e18; // 0xc78(0x04)
	bool *81d0651225; // 0xc7c(0x01)
	char pad_C7D[0x3]; // 0xc7d(0x03)
	struct FRotator *ee0c95a796; // 0xc80(0x0c)
	struct FRotator *c71c7c3e6c; // 0xc8c(0x0c)
	float *0fd819ab59; // 0xc98(0x04)
	float *a62ed06a41; // 0xc9c(0x04)
	struct FRotator AdditiveBoneRot; // 0xca0(0x0c)
	struct FRotator AdditiveBoneRot2; // 0xcac(0x0c)
	float WheelContactAlpha; // 0xcb8(0x04)
	bool *87f2e8789f; // 0xcbc(0x01)
	char pad_CBD[0x3]; // 0xcbd(0x03)
	float AimBackAlpha; // 0xcc0(0x04)
	bool *8fbf66fe27; // 0xcc4(0x01)
	char pad_CC5[0x3]; // 0xcc5(0x03)
	struct FVector2D ThrottleBasedSprintMap; // 0xcc8(0x08)
	struct FVector PedalLocationOffset_Sprint; // 0xcd0(0x0c)
	float PedalRotAlphaScale; // 0xcdc(0x04)
	struct FVector CurrentPedalLocationOffset; // 0xce0(0x0c)
	float PedalRotAlpha; // 0xcec(0x04)
	float ScaledPedalRotAlpha; // 0xcf0(0x04)
	struct FRotator CrankShaftRot; // 0xcf4(0x0c)
	float SprintAlpha; // 0xd00(0x04)
	float SpecialActionAlpha; // 0xd04(0x04)
	char pad_D08[0x28]; // 0xd08(0x28)
};

// Class TslGame.TslWheeledVehicle
// Size: 0xf60 (Inherited: 0x468)
struct ATslWheeledVehicle : AWheeledVehicle {
	char pad_468[0x80]; // 0x468(0x80)
	struct FMulticastDelegate *a07d2e7f8f; // 0x4e8(0x10)
	struct UInteractionComponent* *33a62c60ec; // 0x4f8(0x08)
	char pad_500[0x168]; // 0x500(0x168)
	struct TArray<struct UMeshComponent*> *505aa77fe7; // 0x668(0x10)
	char pad_678[0x18]; // 0x678(0x18)
	struct U*f478030d5d* *f478030d5d; // 0x690(0x08)
	struct UGamePadInputAixsComponent* GamePadInputAixsComponent; // 0x698(0x08)
	struct F*7e6fa106d6 *5c9e00781f; // 0x6a0(0x58)
	char pad_6F8[0x8]; // 0x6f8(0x08)
	bool *1830d185b2; // 0x700(0x01)
	char pad_701[0x3]; // 0x701(0x03)
	float *53a86c3cea; // 0x704(0x04)
	char pad_708[0x10]; // 0x708(0x10)
	struct TArray<struct UStaticMeshComponent*> *b543d6b705; // 0x718(0x10)
	struct TArray<struct UStaticMeshComponent*> *5b16c95f03; // 0x728(0x10)
	bool *4d230cd112; // 0x738(0x01)
	char pad_739[0x3]; // 0x739(0x03)
	float *21e920dcd6; // 0x73c(0x04)
	float *6fc5eb6cac; // 0x740(0x04)
	float *7c9225e7bc; // 0x744(0x04)
	char bCanTiresBePunctured : 1; // 0x748(0x01)
	char *e8a8d757af : 1; // 0x748(0x01)
	char pad_748_2 : 6; // 0x748(0x01)
	char pad_749[0x7]; // 0x749(0x07)
	struct TMap<enum class EDamageTypeCategory, float> *5975cd04e7; // 0x750(0x50)
	struct FName HeadLampBrightnessParameterName; // 0x7a0(0x08)
	struct FName TailLampBrightnessParameterName; // 0x7a8(0x08)
	struct FVector2D *1a6f4cb2d3; // 0x7b0(0x08)
	struct FVector2D *e4b1aff9a1; // 0x7b8(0x08)
	struct FVector2D *e4ad0fa143; // 0x7c0(0x08)
	struct FVector2D *d928a9f218; // 0x7c8(0x08)
	struct FVector2D *7cedd6415e; // 0x7d0(0x08)
	struct FVector2D *b5c417e303; // 0x7d8(0x08)
	float *daf7bfc330; // 0x7e0(0x04)
	float *428cf08766; // 0x7e4(0x04)
	float *70c825a68a; // 0x7e8(0x04)
	char pad_7EC[0x4]; // 0x7ec(0x04)
	struct F*47f4f83559 *1b6e51bd83; // 0x7f0(0x60)
	struct F*47f4f83559 *1cca14fb6b; // 0x850(0x60)
	struct UAkAudioEvent* StopSound; // 0x8b0(0x08)
	struct UAkAudioEvent* *5a514ebb0d; // 0x8b8(0x08)
	float MaxClampThrottleInClutch; // 0x8c0(0x04)
	char pad_8C4[0x4]; // 0x8c4(0x04)
	struct TMap<enum class *d77db828b2, struct F*d4f4966afc> ExhaustPopSettingsMap; // 0x8c8(0x50)
	bool bProcessThrottleReleaseEvent; // 0x918(0x01)
	bool bProcessRevLimiterHitEvent; // 0x919(0x01)
	bool *c37f191756; // 0x91a(0x01)
	char pad_91B[0x5]; // 0x91b(0x05)
	struct F*124ee50766 *124ee50766; // 0x920(0x78)
	struct FName *7f102fd34e; // 0x998(0x08)
	struct FName *e9dc28578b; // 0x9a0(0x08)
	bool bApplyTurnOverThirdPersonSpringArm; // 0x9a8(0x01)
	char pad_9A9[0x3]; // 0x9a9(0x03)
	float *0c3e700217; // 0x9ac(0x04)
	struct FVector *bbd232db79; // 0x9b0(0x0c)
	char pad_9BC[0xc]; // 0x9bc(0x0c)
	bool *cd8c872db0; // 0x9c8(0x01)
	char pad_9C9[0x3]; // 0x9c9(0x03)
	float *5473d5d929; // 0x9cc(0x04)
	struct F*6e09a38a03 *bcb030872f; // 0x9d0(0x10)
	struct F*6e09a38a03 *7a1cf68bb8; // 0x9e0(0x10)
	char pad_9F0[0x1]; // 0x9f0(0x01)
	bool *7d72a7dee0; // 0x9f1(0x01)
	char pad_9F2[0x6]; // 0x9f2(0x06)
	struct UPhysicsConstraintComponent* *5a00bfe93f; // 0x9f8(0x08)
	struct UPhysicsConstraintComponent* *0014778c36; // 0xa00(0x08)
	bool *8b4d4252fc; // 0xa08(0x01)
	bool *463df8e1ee; // 0xa09(0x01)
	bool *938b70ceb1; // 0xa0a(0x01)
	bool *795b786bb8; // 0xa0b(0x01)
	struct F*7264b47ffe *7264b47ffe; // 0xa0c(0x94)
	bool *eb2d9207f8; // 0xaa0(0x01)
	char pad_AA1[0x3]; // 0xaa1(0x03)
	struct F*342e89ddd9 *474322f236; // 0xaa4(0x40)
	float *8fed25d438; // 0xae4(0x04)
	struct FName *657ff00957; // 0xae8(0x08)
	struct FName *d2072f856d; // 0xaf0(0x08)
	float *fad5c49f40; // 0xaf8(0x04)
	float *8ae3b3bd84; // 0xafc(0x04)
	struct FVector2D *728af760d1; // 0xb00(0x08)
	struct FVector2D *ff7c390501; // 0xb08(0x08)
	float *b5f1532ef3; // 0xb10(0x04)
	float *197b229c9a; // 0xb14(0x04)
	float *541225c82d; // 0xb18(0x04)
	struct FVector2D *04e191f60e; // 0xb1c(0x08)
	struct FVector2D *d2883ed869; // 0xb24(0x08)
	float *bfb9a057ab; // 0xb2c(0x04)
	bool *ba6845dfca; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	float *9069cd1ff7; // 0xb34(0x04)
	float *4bd8dbffa0; // 0xb38(0x04)
	bool *1601f676ec; // 0xb3c(0x01)
	char pad_B3D[0x3]; // 0xb3d(0x03)
	struct UCurveFloat* *9180934cac; // 0xb40(0x08)
	struct UCurveFloat* *9969097474; // 0xb48(0x08)
	struct UCurveFloat* *a4ae4e2b54; // 0xb50(0x08)
	struct UCurveFloat* *9b41f3c1fe; // 0xb58(0x08)
	struct UCurveFloat* *44220f6dbd; // 0xb60(0x08)
	struct FName *66ae049796; // 0xb68(0x08)
	float *76cc622462; // 0xb70(0x04)
	struct FVector2D *43edcedc35; // 0xb74(0x08)
	float PingDuration; // 0xb7c(0x04)
	struct FName WorldMarkerAttachSocketName; // 0xb80(0x08)
	struct FVector PingOffset; // 0xb88(0x0c)
	char *270486a716 : 1; // 0xb94(0x01)
	char *6f42d3cbff : 1; // 0xb94(0x01)
	char pad_B94_2 : 6; // 0xb94(0x01)
	char pad_B95[0x3]; // 0xb95(0x03)
	struct F*0b356b0090 *a99691a5fa; // 0xb98(0x28)
	float *e0be23304d; // 0xbc0(0x04)
	bool *a53f5a23b5; // 0xbc4(0x01)
	char pad_BC5[0x3]; // 0xbc5(0x03)
	float *6adc0c803e; // 0xbc8(0x04)
	char pad_BCC[0x8]; // 0xbcc(0x08)
	bool bReplaceRadioWithTopLights; // 0xbd4(0x01)
	char pad_BD5[0x3]; // 0xbd5(0x03)
	struct U*3e97c5a753* VehicleHitComponent; // 0xbd8(0x08)
	struct U*d090adf675* CustomDamageEventComponent; // 0xbe0(0x08)
	struct U*456eb1620c* VehicleCommonComponent; // 0xbe8(0x08)
	struct U*5a1c6e8353* VehicleSeatComponent; // 0xbf0(0x08)
	struct U*42c3c7f9b7* VehicleEffectComponent; // 0xbf8(0x08)
	struct U*7804a94d4d* VehicleSyncComponent; // 0xc00(0x08)
	struct U*5a915b1d2c* *eb51722101; // 0xc08(0x08)
	struct U*0d6077029c* VehicleXRayComponent; // 0xc10(0x08)
	struct UTslPawnInputBindingComponent* TslPawnInputBindingComponent; // 0xc18(0x08)
	struct U*236f014c05* TslGamepadInputComponent; // 0xc20(0x08)
	struct U*b726b9268e* *b726b9268e; // 0xc28(0x08)
	struct UAkComponent* *bad6fc6cd4; // 0xc30(0x08)
	struct U*56790ff05e* RadioAudioComponent; // 0xc38(0x08)
	struct U*0ddd380bc9* TopLightsComponent; // 0xc40(0x08)
	struct U*6c9b903bd2* *0218ebd803; // 0xc48(0x08)
	struct USpringArmComponent* *1fa179cb8e; // 0xc50(0x08)
	struct UCameraComponent* *3b975296dc; // 0xc58(0x08)
	struct U*83f5889ba2* *7ed71cebbb; // 0xc60(0x08)
	struct UBuoyancyForceComponent* BuoyancyForceComponent; // 0xc68(0x08)
	bool *6f9dc6e7e2; // 0xc70(0x01)
	char pad_C71[0x7]; // 0xc71(0x07)
	struct FName *2669384747; // 0xc78(0x08)
	struct UClass* *06ea444d6a; // 0xc80(0x08)
	char pad_C88[0x8]; // 0xc88(0x08)
	struct U*0134b9e50d* BuffComponent; // 0xc90(0x08)
	struct UVehiclePawnInteractionComponent* VehiclePawnInteractionComponent; // 0xc98(0x08)
	struct TArray<struct UClass*> *9990b03fe1; // 0xca0(0x10)
	char pad_CB0[0x8]; // 0xcb0(0x08)
	bool bProcessAutoEject; // 0xcb8(0x01)
	char pad_CB9[0x3]; // 0xcb9(0x03)
	float AutoEjectGroundDistance; // 0xcbc(0x04)
	float AutoEjectRoll; // 0xcc0(0x04)
	float AutoEjectPitch; // 0xcc4(0x04)
	float AutoEject_RiseRate; // 0xcc8(0x04)
	float AutoEject_FallRate; // 0xccc(0x04)
	char pad_CD0[0x4]; // 0xcd0(0x04)
	bool bRunStabilizeOnEntry; // 0xcd4(0x01)
	char pad_CD5[0x3]; // 0xcd5(0x03)
	float StabilizeInitialTimer; // 0xcd8(0x04)
	float *53be4651e6; // 0xcdc(0x04)
	float SteeringYawBias; // 0xce0(0x04)
	float ReloadSteerScalar; // 0xce4(0x04)
	bool *1919e14899; // 0xce8(0x01)
	char pad_CE9[0xf]; // 0xce9(0x0f)
	bool bShouldProcessContact; // 0xcf8(0x01)
	char pad_CF9[0x1b]; // 0xcf9(0x1b)
	bool *05223cfbab; // 0xd14(0x01)
	bool bShouldProcessAirControl; // 0xd15(0x01)
	bool bShouldProcessWheelie; // 0xd16(0x01)
	bool bShouldProcessGroundControl; // 0xd17(0x01)
	float *7350a74791; // 0xd18(0x04)
	char pad_D1C[0x4]; // 0xd1c(0x04)
	float *6a527710aa; // 0xd20(0x04)
	char pad_D24[0x4c]; // 0xd24(0x4c)
	struct F*7e6fa106d6 *4e7021b89f; // 0xd70(0x58)
	char pad_DC8[0x48]; // 0xdc8(0x48)
	struct TArray<struct ATslCharacter*> *20e5b83398; // 0xe10(0x10)
	char pad_E20[0x18]; // 0xe20(0x18)
	struct FVector *bf0de37154; // 0xe38(0x0c)
	char pad_E44[0x4]; // 0xe44(0x04)
	struct UPrimitiveComponent* *0bbc8e06ca; // 0xe48(0x08)
	char pad_E50[0x14]; // 0xe50(0x14)
	bool bIsAlwaysNetRelevantForObservers; // 0xe64(0x01)
	bool bIsLootTruck; // 0xe65(0x01)
	bool bIsKillTruck; // 0xe66(0x01)
	bool bTakeIdleDamage; // 0xe67(0x01)
	float IdleSpeed; // 0xe68(0x04)
	float IdleDamageTime; // 0xe6c(0x04)
	float IdleBleedingDamage; // 0xe70(0x04)
	char pad_E74[0x4]; // 0xe74(0x04)
	struct TArray<enum class ETirePunctureReason> ValidTirePunctureReasonsToStop; // 0xe78(0x10)
	struct FName IsStoppedBlackboardKeyName; // 0xe88(0x08)
	struct FName TargetLocationBlackboardKeyName; // 0xe90(0x08)
	struct FName PathingLocationBlackboardKeyName; // 0xe98(0x08)
	struct FName PathInputLocationBlackboardKeyName; // 0xea0(0x08)
	float *74c270afda; // 0xea8(0x04)
	char pad_EAC[0x4]; // 0xeac(0x04)
	struct UClass* *d38d0f1468; // 0xeb0(0x08)
	float *9377f54409; // 0xeb8(0x04)
	bool bOverrideTrunkProperty; // 0xebc(0x01)
	char pad_EBD[0x3]; // 0xebd(0x03)
	struct F*e43b2eeb30 *94823789dd; // 0xec0(0x28)
	struct ATslVehicleTrunk* Trunk; // 0xee8(0x08)
	struct U*6d8953a17d* AbilitySystemComponent; // 0xef0(0x08)
	struct U*f6c1abdcf9* AttributeSet; // 0xef8(0x08)
	struct U*f2c6c032e1* AnimSequenceManagerComponent; // 0xf00(0x08)
	char pad_F08[0x8]; // 0xf08(0x08)
	float *9a1d05b1dd; // 0xf10(0x04)
	char pad_F14[0xc]; // 0xf14(0x0c)
	struct FVector *4d80ef90ff; // 0xf20(0x0c)
	char pad_F2C[0x4]; // 0xf2c(0x04)
	struct FQuat *f05da0d3f2; // 0xf30(0x10)
	struct FVector *cc721158b4; // 0xf40(0x0c)
	char pad_F4C[0x4]; // 0xf4c(0x04)
	struct UClass* *92315a97d5; // 0xf50(0x08)
	bool *9824069112; // 0xf58(0x01)
	bool *dd2d58d70f; // 0xf59(0x01)
	char pad_F5A[0x6]; // 0xf5a(0x06)

	void *61b37f3103(); // Function TslGame.TslWheeledVehicle.*61b37f3103 // None // @ game+0x56297bc
	void *63c562b6c8(); // Function TslGame.TslWheeledVehicle.*63c562b6c8 // None // @ game+0x566cf50
	void *1976acdfef(); // Function TslGame.TslWheeledVehicle.*1976acdfef // None // @ game+0x566752c
	void *7bfb7ae66e(); // Function TslGame.TslWheeledVehicle.*7bfb7ae66e // None // @ game+0x5667bb0
	void OnBlockingWidgetOpened(); // Function TslGame.TslWheeledVehicle.OnBlockingWidgetOpened // None // @ game+0x56659d8
	void UnBindCallbackToHUD(); // Function TslGame.TslWheeledVehicle.UnBindCallbackToHUD // None // @ game+0xb5b628
	struct ATslCharacter* OnRide(); // Function TslGame.TslWheeledVehicle.OnRide // None // @ game+0x64bd9c
	void *161d13e08e(); // Function TslGame.TslWheeledVehicle.*161d13e08e // None // @ game+0x5667364
	void *6b9fe2fbb9(); // Function TslGame.TslWheeledVehicle.*6b9fe2fbb9 // None // @ game+0x566644c
	void OnLeave(); // Function TslGame.TslWheeledVehicle.OnLeave // None // @ game+0x64d43c
	void *825473a18b(); // Function TslGame.TslWheeledVehicle.*825473a18b // None // @ game+0x566d604
	void *d1d91eb13b(); // Function TslGame.TslWheeledVehicle.*d1d91eb13b // None // @ game+0x56633c8
	void OnBreak(); // Function TslGame.TslWheeledVehicle.OnBreak // None // @ game+0x5665afc
	void *2439e2734a(); // Function TslGame.TslWheeledVehicle.*2439e2734a // None // @ game+0x5667508
	void *823cc05b1d(); // Function TslGame.TslWheeledVehicle.*823cc05b1d // None // @ game+0x56584b8
	void *fe2fd81e3a(); // Function TslGame.TslWheeledVehicle.*fe2fd81e3a // None // @ game+0x5662618
	void BindCallbackToHUD(); // Function TslGame.TslWheeledVehicle.BindCallbackToHUD // None // @ game+0xb51ac8
	void *498ebc287f(struct FVector DestLocation, bool bIsATest); // Function TslGame.TslWheeledVehicle.*498ebc287f // None // @ game+0x5672290
	void *97a7c61f47(); // Function TslGame.TslWheeledVehicle.*97a7c61f47 // None // @ game+0x566db9c
	void *681e99c680(); // Function TslGame.TslWheeledVehicle.*681e99c680 // None // @ game+0x56633b0
	void *f88dfba706(); // Function TslGame.TslWheeledVehicle.*f88dfba706 // None // @ game+0x5663060
	void *4000f2aceb(struct FVector Param1, struct FVector Param2); // Function TslGame.TslWheeledVehicle.*4000f2aceb // None // @ game+0x5664dbc
	struct ATslCharacter* *1cd9fdc1c2(); // Function TslGame.TslWheeledVehicle.*1cd9fdc1c2 // None // @ game+0x56645d8
	void *ea775f95b6(); // Function TslGame.TslWheeledVehicle.*ea775f95b6 // None // @ game+0x5667314
	void *c558333383(); // Function TslGame.TslWheeledVehicle.*c558333383 // None // @ game+0x565f7a0
	void *48fbee1aa5(); // Function TslGame.TslWheeledVehicle.*48fbee1aa5 // None // @ game+0x566e24c
	void *7072daf50a(); // Function TslGame.TslWheeledVehicle.*7072daf50a // None // @ game+0x56681dc
	void *a6419144c5(); // Function TslGame.TslWheeledVehicle.*a6419144c5 // None // @ game+0x566640c
	void *2fbff7d476(); // Function TslGame.TslWheeledVehicle.*2fbff7d476 // None // @ game+0x5671f8c
	void NotifyHandbrake(); // Function TslGame.TslWheeledVehicle.NotifyHandbrake // None // @ game+0x26a108
	void *cb5527fc78(); // Function TslGame.TslWheeledVehicle.*cb5527fc78 // None // @ game+0x565e8fc
	void *d6a1702385(); // Function TslGame.TslWheeledVehicle.*d6a1702385 // None // @ game+0x5667540
	void OnRep_VehicleEngine(); // Function TslGame.TslWheeledVehicle.OnRep_VehicleEngine // None // @ game+0xb88fd4
	void *0fb4c3d785(); // Function TslGame.TslWheeledVehicle.*0fb4c3d785 // None // @ game+0x5671500
	void *f8b555135f(struct FQuat Param1, struct FVector Param3); // Function TslGame.TslWheeledVehicle.*f8b555135f // None // @ game+0x566514c
	void *c57c88df74(); // Function TslGame.TslWheeledVehicle.*c57c88df74 // None // @ game+0x5666424
	void *43e4e76756(); // Function TslGame.TslWheeledVehicle.*43e4e76756 // None // @ game+0x5659b1c
	void *329d42ccab(); // Function TslGame.TslWheeledVehicle.*329d42ccab // None // @ game+0x56633e0
	void *a38dbd8da5(); // Function TslGame.TslWheeledVehicle.*a38dbd8da5 // None // @ game+0x94c3f0
	void *eaa4bf2e96(); // Function TslGame.TslWheeledVehicle.*eaa4bf2e96 // None // @ game+0x5661538
	void *d20dbe3714(); // Function TslGame.TslWheeledVehicle.*d20dbe3714 // None // @ game+0x566d500
	float *7431bf42e6(struct FVector Param1, struct FVector Param2); // Function TslGame.TslWheeledVehicle.*7431bf42e6 // None // @ game+0x5664be4
	void *72d6d0a9b8(); // Function TslGame.TslWheeledVehicle.*72d6d0a9b8 // None // @ game+0x5667c14
	void *6b0bc5fe31(); // Function TslGame.TslWheeledVehicle.*6b0bc5fe31 // None // @ game+0x5671e3c
	void MoveForwardPad(); // Function TslGame.TslWheeledVehicle.MoveForwardPad // None // @ game+0x5663cf4
	void *6219b5903c(); // Function TslGame.TslWheeledVehicle.*6219b5903c // None // @ game+0x5666464
	void *e8a07bfa73(); // Function TslGame.TslWheeledVehicle.*e8a07bfa73 // None // @ game+0x56674f4
	void MoveForward(); // Function TslGame.TslWheeledVehicle.MoveForward // None // @ game+0x5663c5c
	void *b0c0caa5be(); // Function TslGame.TslWheeledVehicle.*b0c0caa5be // None // @ game+0x55bbedc
	void OnDriverRide(); // Function TslGame.TslWheeledVehicle.OnDriverRide // None // @ game+0xc099ac
	void *34d8ffb29b(); // Function TslGame.TslWheeledVehicle.*34d8ffb29b // None // @ game+0x565e914
	void OverrideVehicleHealth(); // Function TslGame.TslWheeledVehicle.OverrideVehicleHealth // None // @ game+0x5643b10
	void MoveRight(); // Function TslGame.TslWheeledVehicle.MoveRight // None // @ game+0x5663da0
	void *5d32892cfa(); // Function TslGame.TslWheeledVehicle.*5d32892cfa // None // @ game+0x5667bc4
	struct FVector *599e47f4b5(); // Function TslGame.TslWheeledVehicle.*599e47f4b5 // None // @ game+0x5664950
	bool OnHealthChange(float Param0); // Function TslGame.TslWheeledVehicle.OnHealthChange // None // @ game+0xacda5c
	struct ATslCharacter* OnCharacterHit(); // Function TslGame.TslWheeledVehicle.OnCharacterHit // None // @ game+0x5665bd0
	void *c3de08d478(); // Function TslGame.TslWheeledVehicle.*c3de08d478 // None // @ game+0x5667300
	void *26aa78af1e(); // Function TslGame.TslWheeledVehicle.*26aa78af1e // None // @ game+0x5667bf0
	int32 OnTirePunctured(); // Function TslGame.TslWheeledVehicle.OnTirePunctured // None // @ game+0x566795c
	void *8355368ed0(); // Function TslGame.TslWheeledVehicle.*8355368ed0 // None // @ game+0x5662e10
	void OnRep_WheeledVehicleBaseMovement(); // Function TslGame.TslWheeledVehicle.OnRep_WheeledVehicleBaseMovement // None // @ game+0x5658e08
	void OnPostDriverLeave(); // Function TslGame.TslWheeledVehicle.OnPostDriverLeave // None // @ game+0xac15d0
	void SetLightMaterialParameters(); // Function TslGame.TslWheeledVehicle.SetLightMaterialParameters // None // @ game+0x566f0d4
	void OnPostDriverRide(); // Function TslGame.TslWheeledVehicle.OnPostDriverRide // None // @ game+0xbcac8c
	void *ef755d1d8b(); // Function TslGame.TslWheeledVehicle.*ef755d1d8b // None // @ game+0x565f4f8
	void *7f16a337be(); // Function TslGame.TslWheeledVehicle.*7f16a337be // None // @ game+0x566ea68
	void *e990cbb95d(); // Function TslGame.TslWheeledVehicle.*e990cbb95d // None // @ game+0x566d404
	void *3d53407610(); // Function TslGame.TslWheeledVehicle.*3d53407610 // None // @ game+0x566f1a4
	void *146c4d7ab5(); // Function TslGame.TslWheeledVehicle.*146c4d7ab5 // None // @ game+0x566d5b8
	float OverrideVehicleFuel(); // Function TslGame.TslWheeledVehicle.OverrideVehicleFuel // None // @ game+0x56681f4
	void *dd65ac9b57(); // Function TslGame.TslWheeledVehicle.*dd65ac9b57 // None // @ game+0x55c6edc
	void *c02f1f6c1f(); // Function TslGame.TslWheeledVehicle.*c02f1f6c1f // None // @ game+0x566451c
	void *fba42666c6(); // Function TslGame.TslWheeledVehicle.*fba42666c6 // None // @ game+0x5667350
	struct FRotator *4364e0132d(float Param0); // Function TslGame.TslWheeledVehicle.*4364e0132d // None // @ game+0x56646bc
	void *b8fc1eaa37(); // Function TslGame.TslWheeledVehicle.*b8fc1eaa37 // None // @ game+0x565f658
	void *3b7341502d(); // Function TslGame.TslWheeledVehicle.*3b7341502d // None // @ game+0x566dbe8
	void *c76cfa6947(); // Function TslGame.TslWheeledVehicle.*c76cfa6947 // None // @ game+0x566d3b8
	struct FVector *91b21d32de(); // Function TslGame.TslWheeledVehicle.*91b21d32de // None // @ game+0x5664f94
	void *7da69eb275(); // Function TslGame.TslWheeledVehicle.*7da69eb275 // None // @ game+0x566176c
	void HasDriver(); // Function TslGame.TslWheeledVehicle.HasDriver // None // @ game+0x5662630
};

// Class TslGame.TslFlyingVehicle
// Size: 0x1030 (Inherited: 0xf60)
struct ATslFlyingVehicle : ATslWheeledVehicle {
	char pad_F60[0x20]; // 0xf60(0x20)
	struct U*38e1ff6626* FlightComponent; // 0xf80(0x08)
	struct UClass* *aa151cf57e; // 0xf88(0x08)
	struct U*880e73319f* *8252ec4ae4; // 0xf90(0x08)
	struct F*40c4e5f28e *40c4e5f28e; // 0xf98(0x30)
	struct F*eb5898b578 *eb5898b578; // 0xfc8(0x40)
	struct FVector2D *6cdb6293ed; // 0x1008(0x08)
	float *b7eb8eced5; // 0x1010(0x04)
	struct F*d8777bfcee *03ad4c1c99; // 0x1014(0x10)
	char pad_1024[0xc]; // 0x1024(0x0c)

	void OnPostDriverRide(); // Function TslGame.TslFlyingVehicle.OnPostDriverRide // None // @ game+0xbcac8c
	void *b0c0caa5be(); // Function TslGame.TslFlyingVehicle.*b0c0caa5be // None // @ game+0x55bbedc
	void OnPostDriverLeave(); // Function TslGame.TslFlyingVehicle.OnPostDriverLeave // None // @ game+0xac15d0
};

// Class TslGame.*7f87a81afd
// Size: 0xe70 (Inherited: 0xd30)
struct U*7f87a81afd : U*40d06648ff {
	bool bTickFlightInstruments; // 0xd28(0x01)
	struct FRotator PropellerRotation; // 0xd2c(0x0c)
	struct FVector PropellerRotationMask; // 0xd38(0x0c)
	float MaxFlightSpeedInKm; // 0xd44(0x04)
	float MaxRPM; // 0xd48(0x04)
	float MaxFlightAltitudeInMeters; // 0xd4c(0x04)
	struct FRotator *de606981a6; // 0xd50(0x0c)
	struct FRotator *86d86dcd86; // 0xd5c(0x0c)
	struct FRotator *ff8596e510; // 0xd68(0x0c)
	struct FRotator *763cf8f938; // 0xd74(0x0c)
	struct FRotator *9b687bc02a; // 0xd80(0x0c)
	struct FRotator *8034a8a78c; // 0xd8c(0x0c)
	struct FRotator *39917230b9; // 0xd98(0x0c)
	struct FRotator *86bb703eea; // 0xda4(0x0c)
	struct FRotator Instrument_SpeedRot; // 0xdb0(0x0c)
	struct FRotator Instrument_RPMRot; // 0xdbc(0x0c)
	struct FRotator Instrument_AltRot; // 0xdc8(0x0c)
	struct FRotator Instrument_FuelRot; // 0xdd4(0x0c)
	float FastRotorAlpha; // 0xde0(0x04)
	struct FRotator WingRollRot; // 0xde4(0x0c)
	struct FVector WingRollRotMask; // 0xdf0(0x0c)
	struct FRotator WingPitchRot; // 0xdfc(0x0c)
	struct FVector WingPitchRotMask; // 0xe08(0x0c)
	struct FRotator WheelYawRot; // 0xe14(0x0c)
	struct FVector WheelYawRotMask; // 0xe20(0x0c)
	struct U*1ba2d2b086* *2597d6f73f; // 0xe30(0x08)
	float *e4b72d05de; // 0xe38(0x04)
	float PedalBrakeAlpha; // 0xe3c(0x04)
	float PedalThrottleAlpha; // 0xe40(0x04)
	float *972fdabd71; // 0xe44(0x04)
	char pad_E49[0xf]; // 0xe49(0x0f)
	struct U*38e1ff6626* *8e3671006e; // 0xe58(0x08)
	struct ATslFlyingVehicle* FlyingVehicle; // 0xe60(0x08)
	char pad_E68[0x8]; // 0xe68(0x08)
};

// Class TslGame.*2bb14fe2b0
// Size: 0xd40 (Inherited: 0xd30)
struct U*2bb14fe2b0 : U*40d06648ff {
	float BarrelPitchAcc; // 0xd28(0x04)
	bool bIsMortarLoadingCP; // 0xd2c(0x01)
	struct FMulticastDelegate MortarLoad; // 0xd30(0x10)
};

// Class TslGame.*f2c6c032e1
// Size: 0x230 (Inherited: 0x1f0)
struct U*f2c6c032e1 : UActorComponent {
	char pad_1F0[0x4]; // 0x1f0(0x04)
	float MaxRpmRatio; // 0x1f4(0x04)
	float LampStrength; // 0x1f8(0x04)
	bool bEngineOn; // 0x1fc(0x01)
	char pad_1FD[0x3]; // 0x1fd(0x03)
	float Throttle; // 0x200(0x04)
	bool bBoostOn; // 0x204(0x01)
	char pad_205[0x3]; // 0x205(0x03)
	struct FString *9791d68c18; // 0x208(0x10)
	struct UAnimationAsset* *6d554d2d8a; // 0x218(0x08)
	char pad_220[0x10]; // 0x220(0x10)

	void SetLampStrength(); // Function TslGame.*f2c6c032e1.SetLampStrength // None // @ game+0x55ce128
	void SetThrottle(); // Function TslGame.*f2c6c032e1.SetThrottle // None // @ game+0x55cf2f4
	void SetMaxRpmRatio(); // Function TslGame.*f2c6c032e1.SetMaxRpmRatio // None // @ game+0x55ce46c
	void SetEngineOn(); // Function TslGame.*f2c6c032e1.SetEngineOn // None // @ game+0x55cdd40
	void SetBoostOn(); // Function TslGame.*f2c6c032e1.SetBoostOn // None // @ game+0x55cda78
};

// Class TslGame.TslVehicleConverter
// Size: 0x540 (Inherited: 0x3f8)
struct ATslVehicleConverter : AActor {
	char pad_3F8[0x8]; // 0x3f8(0x08)
	float *7c1e418048; // 0x400(0x04)
	char pad_404[0x4]; // 0x404(0x04)
	struct UClass* *b1b2756946; // 0x408(0x08)
	struct APawn* *4d61495e69; // 0x410(0x08)
	struct FStringClassReference *d2f9f5b7d3; // 0x418(0x10)
	struct ATslCharacter* *7943747ca9; // 0x428(0x08)
	struct U*588043edf8* *588043edf8; // 0x430(0x08)
	struct U*92b0622df8* *1f3d5db022; // 0x438(0x08)
	struct U*92b0622df8* *d3be80df9c; // 0x440(0x08)
	struct TArray<int32> *f8ed5f344a; // 0x448(0x10)
	char pad_458[0xe0]; // 0x458(0xe0)
	enum class EVehicleConvertState State; // 0x538(0x01)
	char pad_539[0x7]; // 0x539(0x07)

	void OnUpdateState(); // Function TslGame.TslVehicleConverter.OnUpdateState // None // @ game+0x55c6cf4
	void OnRide(); // Function TslGame.TslVehicleConverter.OnRide // None // @ game+0x55c5a48
	bool OnVehicleHealthChange(float Param1); // Function TslGame.TslVehicleConverter.OnVehicleHealthChange // None // @ game+0x55c6ef4
	struct FVector OnVehicleHit(); // Function TslGame.TslVehicleConverter.OnVehicleHit // None // @ game+0x55c70b0
	void OnRep_BaseVehicle(); // Function TslGame.TslVehicleConverter.OnRep_BaseVehicle // None // @ game+0x55c4e68
	void OnRep_ReplaceVehicle(); // Function TslGame.TslVehicleConverter.OnRep_ReplaceVehicle // None // @ game+0x55c5314
};

// Class TslGame.*731b4310e5
// Size: 0x40 (Inherited: 0x30)
struct U*731b4310e5 : UDataAsset {
	struct UAkAudioEvent* EventIn; // 0x30(0x08)
	int32 FadeOutTime; // 0x38(0x04)
	enum class *a6a176d0c8 InterpolationCurve; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// Class TslGame.*42c3c7f9b7
// Size: 0xac0 (Inherited: 0x1f0)
struct U*42c3c7f9b7 : UActorComponent {
	struct ATslWheeledVehicle* *27040869f8; // 0x1f0(0x08)
	char pad_1F8[0x8]; // 0x1f8(0x08)
	struct UMeshComponent* MeshComponent; // 0x200(0x08)
	struct UAkComponent* EngineSoundComponent; // 0x208(0x08)
	struct F*c0c8686f61 *c0c8686f61; // 0x210(0x130)
	struct F*b21adc33b9 *b21adc33b9; // 0x340(0x140)
	struct ATslParticle* *2a7f994258; // 0x480(0x08)
	struct ATslParticle* *80379c0c34; // 0x488(0x08)
	struct ATslParticle* *d0bd5105c6; // 0x490(0x08)
	struct ATslParticle* *4c2171236e; // 0x498(0x08)
	struct ATslParticle* *49eb3f65e6; // 0x4a0(0x08)
	struct ATslParticle* *13b7bf3b7f; // 0x4a8(0x08)
	struct ATslParticle* *68417d8a57; // 0x4b0(0x08)
	struct ATslParticle* *c11a118543; // 0x4b8(0x08)
	struct ATslParticle* *92eb904f7c; // 0x4c0(0x08)
	struct ATslParticle* *3701dc9a5a; // 0x4c8(0x08)
	struct ATslParticle* *2d63472fb7; // 0x4d0(0x08)
	struct ATslParticle* *bad7e82c1f; // 0x4d8(0x08)
	struct ATslParticle* *b159bc3655; // 0x4e0(0x08)
	struct ATslParticle* *3baa6d9eac; // 0x4e8(0x08)
	struct ATslParticle* *d815cd1a4a; // 0x4f0(0x08)
	struct ATslParticle* *2508b66be5; // 0x4f8(0x08)
	struct UStaticMeshComponent* *046f8995a2; // 0x500(0x08)
	char pad_508[0x44]; // 0x508(0x44)
	float *bb8630c751; // 0x54c(0x04)
	float *c312236418; // 0x550(0x04)
	bool *9b2a38866a; // 0x554(0x01)
	bool *5bbf5098f9; // 0x555(0x01)
	char pad_556[0xa]; // 0x556(0x0a)
	struct UMaterialInstanceDynamic* *26d4d88ef3; // 0x560(0x08)
	struct UMaterialInstanceDynamic* *472448fa11; // 0x568(0x08)
	struct UTextRenderComponent* *7c71451b8c; // 0x570(0x08)
	struct UTextRenderComponent* *90642bbdf3; // 0x578(0x08)
	struct ATslFloatingVehicle* *7f0435d25d; // 0x580(0x08)
	bool *6d8d7c78a7; // 0x588(0x01)
	bool *35790fe4ce; // 0x589(0x01)
	char pad_58A[0x6]; // 0x58a(0x06)
	struct UCurveFloat* *ed06c94147; // 0x590(0x08)
	bool *864ab1c204; // 0x598(0x01)
	char pad_599[0x7]; // 0x599(0x07)
	struct TMap<enum class ESurfaceEffect, struct U*731b4310e5*> SurfaceAudioMap; // 0x5a0(0x50)
	bool bUseNewSurfaceAudio; // 0x5f0(0x01)
	bool bAlwaysSendSurfaceParameters; // 0x5f1(0x01)
	bool bIgnoreHandbrake; // 0x5f2(0x01)
	char pad_5F3[0x5]; // 0x5f3(0x05)
	struct TArray<int32> MeasuredWheelIndices; // 0x5f8(0x10)
	struct TArray<int32> MeasuredWheelIndicesSlip; // 0x608(0x10)
	struct TArray<int32> MeasuredWheelIndicesSpin; // 0x618(0x10)
	struct TArray<int32> MeasuredWheelIndicesBrake; // 0x628(0x10)
	float SurfaceActivationValue; // 0x638(0x04)
	float SurfaceDeactivationValue; // 0x63c(0x04)
	float SurfaceValueRiseRate; // 0x640(0x04)
	float SurfaceValueFallRate; // 0x644(0x04)
	float DT_Multiplier; // 0x648(0x04)
	float MinVelocityForSurfaceCheck; // 0x64c(0x04)
	float MinRotationSpeedForSurfaceCheck; // 0x650(0x04)
	float MinSlip; // 0x654(0x04)
	float MinSpin; // 0x658(0x04)
	float MinVelocityForBreak; // 0x65c(0x04)
	float BrakeNoDriverMultiplier; // 0x660(0x04)
	int32 VelocityInterpSpeed; // 0x664(0x04)
	int32 SlipInterpSpeed; // 0x668(0x04)
	int32 SpinInterpSpeed; // 0x66c(0x04)
	int32 BrakeInterpSpeed; // 0x670(0x04)
	bool bDebugVisualizedMeasuredWheels; // 0x674(0x01)
	char pad_675[0x3]; // 0x675(0x03)
	float AngularVelocityCoefficient; // 0x678(0x04)
	float LateralVelocityCoeffictient; // 0x67c(0x04)
	float LateralVelocityClamp; // 0x680(0x04)
	bool bUseLatSlipMap; // 0x684(0x01)
	char pad_685[0x3]; // 0x685(0x03)
	struct FVector2D LatSlipInMap; // 0x688(0x08)
	bool bUseLongSlipMap; // 0x690(0x01)
	char pad_691[0x3]; // 0x691(0x03)
	struct FVector2D LongSlipInMap; // 0x694(0x08)
	bool bUseMaxSkid; // 0x69c(0x01)
	bool bUseMaxSpin; // 0x69d(0x01)
	char pad_69E[0x2]; // 0x69e(0x02)
	float SurfaceRestartTimeout; // 0x6a0(0x04)
	bool bProcessShiftStart; // 0x6a4(0x01)
	bool bProcessShiftEnd; // 0x6a5(0x01)
	bool bProcessReverse; // 0x6a6(0x01)
	bool bUseTargetGearForAudio; // 0x6a7(0x01)
	float ReverseThrottleScalar; // 0x6a8(0x04)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	struct UAkAudioEvent* GearUpSound_Start; // 0x6b0(0x08)
	struct UAkAudioEvent* GearDownSound_Start; // 0x6b8(0x08)
	struct UAkAudioEvent* GearUpSound_End; // 0x6c0(0x08)
	struct UAkAudioEvent* GearDownSound_End; // 0x6c8(0x08)
	struct UAkAudioEvent* GearReverseSound; // 0x6d0(0x08)
	float NonBoostedThrottleScalar; // 0x6d8(0x04)
	float NonBoostedRPMScalar; // 0x6dc(0x04)
	float BoostRPMStaticOffset; // 0x6e0(0x04)
	float BoostAlphaInterpSpeed; // 0x6e4(0x04)
	float WaterRPMScalar; // 0x6e8(0x04)
	float WaterThrottleScalar; // 0x6ec(0x04)
	bool bUseRevLimiter; // 0x6f0(0x01)
	char pad_6F1[0x3]; // 0x6f1(0x03)
	float RevLimiterMinAlpha; // 0x6f4(0x04)
	float RevLimitMod; // 0x6f8(0x04)
	float RevLimitScale; // 0x6fc(0x04)
	float RevLimitPower; // 0x700(0x04)
	bool bRevLimReverse; // 0x704(0x01)
	char pad_705[0x123]; // 0x705(0x123)
	struct TMap<int32, struct UMaterialInterface*> DestroyedMaterialMap; // 0x828(0x50)
	float ApplyDestroyedMaterialDelay; // 0x878(0x04)
	char pad_87C[0x4]; // 0x87c(0x04)
	struct TArray<struct F*5bcbe172cf> MeshPartDestroyedMaterialList; // 0x880(0x10)
	bool bUseDynamicDestroyedParam; // 0x890(0x01)
	char pad_891[0x7]; // 0x891(0x07)
	struct FName DynamicDestroyedParamName; // 0x898(0x08)
	bool bUseDynamicDashboardParam; // 0x8a0(0x01)
	bool bDashboardNGearWhenZeroRPM; // 0x8a1(0x01)
	char pad_8A2[0x6]; // 0x8a2(0x06)
	struct F*cda1b988ad DashboardSetting; // 0x8a8(0x30)
	struct FName DashboardRPMParameter; // 0x8d8(0x08)
	struct FName DashboardGearParameter; // 0x8e0(0x08)
	struct FName DashboardSpeedParameter; // 0x8e8(0x08)
	struct FName DashboardFuelParameter; // 0x8f0(0x08)
	struct UMaterialInstanceDynamic* *1c43d7f72a; // 0x8f8(0x08)
	char pad_900[0x10]; // 0x900(0x10)
	bool bUsesBoosting; // 0x910(0x01)
	char pad_911[0x7]; // 0x911(0x07)
	struct UAkAudioEvent* BoostStartAk; // 0x918(0x08)
	struct UAkAudioEvent* BoostEndAk; // 0x920(0x08)
	bool bShouldTickLights; // 0x928(0x01)
	char pad_929[0x3]; // 0x929(0x03)
	float BrakeLightThreshold; // 0x92c(0x04)
	struct F*a774748af6 LightSettings; // 0x930(0x68)
	bool bUseDynamicCamera; // 0x998(0x01)
	char pad_999[0x7]; // 0x999(0x07)
	struct F*c5660d51d8 CameraEffectSettings; // 0x9a0(0x98)
	char pad_A38[0x88]; // 0xa38(0x88)

	void *340d2f1b9f(); // Function TslGame.*42c3c7f9b7.*340d2f1b9f // None // @ game+0x55b9af0
	void *b07c78c729(); // Function TslGame.*42c3c7f9b7.*b07c78c729 // None // @ game+0x55bdf30
	void *46f41f0413(); // Function TslGame.*42c3c7f9b7.*46f41f0413 // None // @ game+0x55bd550
	void *bc8bd0f82c(struct FString RTPC); // Function TslGame.*42c3c7f9b7.*bc8bd0f82c // None // @ game+0x55cddd4
	void *26bb9c0688(); // Function TslGame.*42c3c7f9b7.*26bb9c0688 // None // @ game+0x55bd574
	struct FVector OnHit(); // Function TslGame.*42c3c7f9b7.OnHit // None // @ game+0x89f3b0
	void OnDestroyedImpactEffect(); // Function TslGame.*42c3c7f9b7.OnDestroyedImpactEffect // None // @ game+0xb5f194
	void OnHealthChange(float CurrentHealth, float HealthMax); // Function TslGame.*42c3c7f9b7.OnHealthChange // None // @ game+0x89ed88
	void *c2374736b5(); // Function TslGame.*42c3c7f9b7.*c2374736b5 // None // @ game+0x55cf53c
	struct F*2177a5ac2f OnDeath(struct ATslPlayerState* PlayerInstigator); // Function TslGame.*42c3c7f9b7.OnDeath // None // @ game+0x55c1cd0
	void *637e821321(); // Function TslGame.*42c3c7f9b7.*637e821321 // None // @ game+0x55cdfb4
	void *5aa69b903d(); // Function TslGame.*42c3c7f9b7.*5aa69b903d // None // @ game+0x55bd67c
};

// Class TslGame.*c075bf3b42
// Size: 0xaf0 (Inherited: 0xac0)
struct U*c075bf3b42 : U*42c3c7f9b7 {
	bool *a154f7e7ab; // 0xab8(0x01)
	float *6ec01acf49; // 0xabc(0x04)
	struct F*d8777bfcee *4cc9232da2; // 0xac0(0x10)
	struct ATslParticle* *dd2dd6c219; // 0xad0(0x08)
	struct ATslParticle* *8be9236fe0; // 0xad8(0x08)
	struct UClass* WingEffectParticle; // 0xae0(0x08)
	struct UClass* GroundEffectParticle; // 0xae8(0x08)
};

// Class TslGame.*cd313b379c
// Size: 0xbf0 (Inherited: 0xb90)
struct U*cd313b379c : UStaticMeshComponent {
	struct TMap<int32, struct UMaterialInterface*> *0ae0aecc95; // 0xb90(0x50)
	char pad_BE0[0x10]; // 0xbe0(0x10)
};

// Class TslGame.*d2cb5cce6d
// Size: 0x11d0 (Inherited: 0x1180)
struct U*d2cb5cce6d : USkeletalMeshComponent {
	struct TMap<int32, struct UMaterialInterface*> *0ae0aecc95; // 0x1178(0x50)
};

// Class TslGame.*8604bb4d0c
// Size: 0x28 (Inherited: 0x28)
struct U*8604bb4d0c : UInterface {
};

// Class TslGame.*5a1c6e8353
// Size: 0x2f0 (Inherited: 0x1f0)
struct U*5a1c6e8353 : UActorComponent {
	struct FMulticastDelegate OnRide; // 0x1f0(0x10)
	struct FMulticastDelegate OnLeave; // 0x200(0x10)
	struct FMulticastDelegate OnDriverRide; // 0x210(0x10)
	struct FMulticastDelegate OnDriverLeave; // 0x220(0x10)
	struct FMulticastDelegate OnPostDriverRide; // 0x230(0x10)
	struct FMulticastDelegate OnPostDriverLeave; // 0x240(0x10)
	struct TArray<struct U*614c6d2b0f*> *44c1b2de32; // 0x250(0x10)
	bool bUseSeatCamera; // 0x260(0x01)
	bool bKillRidersOnDestroy; // 0x261(0x01)
	bool bEjectRidersOnDestroy; // 0x262(0x01)
	bool bDoFlipCheck; // 0x263(0x01)
	float FlipForce; // 0x264(0x04)
	bool bDoEntryAngleCheck; // 0x268(0x01)
	char pad_269[0x3]; // 0x269(0x03)
	float MinEntryAngle; // 0x26c(0x04)
	bool bDampenPlayerVelocityOnLeave; // 0x270(0x01)
	char pad_271[0x3]; // 0x271(0x03)
	float OnLeaveVelocityMultiplier; // 0x274(0x04)
	bool bUseActiveStabilize; // 0x278(0x01)
	bool bRiderChangeSeat; // 0x279(0x01)
	bool bLockEntryForEnemies; // 0x27a(0x01)
	char pad_27B[0x1]; // 0x27b(0x01)
	struct ATslCharacter* *92df4d5066; // 0x27c(0x08)
	char pad_284[0x6c]; // 0x284(0x6c)

	void *9cafc93842(); // Function TslGame.*5a1c6e8353.*9cafc93842 // None // @ game+0x55bd58c
	void *e98dbd9530(struct ATslCharacter* Rider); // Function TslGame.*5a1c6e8353.*e98dbd9530 // None // @ game+0x55d0804
	struct U*614c6d2b0f* Leave(); // Function TslGame.*5a1c6e8353.Leave // None // @ game+0xaeca54
	void OnFuelChange(float Param0); // Function TslGame.*5a1c6e8353.OnFuelChange // None // @ game+0xa885d8
	void *44040b2669(); // Function TslGame.*5a1c6e8353.*44040b2669 // None // @ game+0x55bd7cc
	void *38db026121(); // Function TslGame.*5a1c6e8353.*38db026121 // None // @ game+0x55d09dc
	void *7149c4f323(); // Function TslGame.*5a1c6e8353.*7149c4f323 // None // @ game+0xbd506c
	void *f971f5e26c(); // Function TslGame.*5a1c6e8353.*f971f5e26c // None // @ game+0x55bda7c
	void *e12889ded4(); // Function TslGame.*5a1c6e8353.*e12889ded4 // None // @ game+0x55bdb1c
	void *b91ad58427(); // Function TslGame.*5a1c6e8353.*b91ad58427 // None // @ game+0x55d07ec
	void GetDriver(); // Function TslGame.*5a1c6e8353.GetDriver // None // @ game+0x55bd528
	struct F*2177a5ac2f KillAllRiders(struct ATslPlayerState* Param2); // Function TslGame.*5a1c6e8353.KillAllRiders // None // @ game+0x55bf06c
	void *02021fe971(int32 SeatIndex); // Function TslGame.*5a1c6e8353.*02021fe971 // None // @ game+0x55bdc7c
	struct UClass* Ride(); // Function TslGame.*5a1c6e8353.Ride // None // @ game+0x8ab770
	struct U*614c6d2b0f* *110ddd9355(); // Function TslGame.*5a1c6e8353.*110ddd9355 // None // @ game+0x55be1a0
	void *b66a5485f1(); // Function TslGame.*5a1c6e8353.*b66a5485f1 // None // @ game+0xc099d4
	void *b672e5407d(struct ATslCharacter* Rider); // Function TslGame.*5a1c6e8353.*b672e5407d // None // @ game+0x55d08e8
};

// Class TslGame.TslVehicleSinkComponent
// Size: 0x2a0 (Inherited: 0x1f0)
struct UTslVehicleSinkComponent : UActorComponent {
	struct UClass* *fd012ad346; // 0x1f0(0x08)
	struct FName *f1a34dadad; // 0x1f8(0x08)
	struct TArray<struct FName> *a4ffa942a0; // 0x200(0x10)
	struct UCurveFloat* *64891f18f6; // 0x210(0x08)
	struct TArray<float> *0384ec56cd; // 0x218(0x10)
	struct UClass* *8be8d0c3ae; // 0x228(0x08)
	struct UCurveFloat* *3653750049; // 0x230(0x08)
	float *4720320f9f; // 0x238(0x04)
	float *2816a3520a; // 0x23c(0x04)
	struct UBuoyancyForceComponent* BuoyancyForceComponent; // 0x240(0x08)
	char pad_248[0x18]; // 0x248(0x18)
	struct USkeletalMeshComponent* MeshComponent; // 0x260(0x08)
	struct U*42c3c7f9b7* VehicleEffectComponent; // 0x268(0x08)
	struct UMovementComponent* MovementComponent; // 0x270(0x08)
	struct TArray<struct ATslParticle*> *b16ad52aaf; // 0x278(0x10)
	char pad_288[0x18]; // 0x288(0x18)
};

// Class TslGame.*92b0622df8
// Size: 0xc8 (Inherited: 0x28)
struct U*92b0622df8 : UObject {
	TScriptInterface<struct UTslVehicleInterface> *2b981a17cf; // 0x28(0x10)
	struct UVehicleSkinFXDataAsset* *18e2945313; // 0x38(0x08)
	struct TArray<struct USkeletalMeshComponent*> *91d2b3f6ba; // 0x40(0x10)
	struct TArray<struct U*555c720717*> *7b2ce5193a; // 0x50(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> *8ea46a9461; // 0x60(0x10)
	struct TArray<struct UMaterialInterface*> *eb8aa39a66; // 0x70(0x10)
	struct TArray<struct ATslParticle*> *b5b14c8e06; // 0x80(0x10)
	char pad_90[0x38]; // 0x90(0x38)
};

// Class TslGame.*6c9b903bd2
// Size: 0x250 (Inherited: 0x1f0)
struct U*6c9b903bd2 : UActorComponent {
	struct U*b79942152e* *b79942152e; // 0x1f0(0x08)
	int32 *ff157178a2; // 0x1f8(0x04)
	float *f7b514d342; // 0x1fc(0x04)
	int8 CurrentIndex; // 0x200(0x01)
	char pad_201[0x4f]; // 0x201(0x4f)

	void *bfadcfc984(); // Function TslGame.*6c9b903bd2.*bfadcfc984 // None // @ game+0x55cc03c
	void OnMontageFinished(struct UAnimMontage* Param0); // Function TslGame.*6c9b903bd2.OnMontageFinished // None // @ game+0x55c3a8c
	void *a2255af642(); // Function TslGame.*6c9b903bd2.*a2255af642 // None // @ game+0x55cbf8c
	void OnRep_StuntEmote(); // Function TslGame.*6c9b903bd2.OnRep_StuntEmote // None // @ game+0x55c54a8
};

// Class TslGame.*7804a94d4d
// Size: 0x270 (Inherited: 0x1f0)
struct U*7804a94d4d : UActorComponent {
	struct FMulticastDelegate OnSyncHit; // 0x1f0(0x10)
	char pad_200[0xc]; // 0x200(0x0c)
	float *cbe86824bb; // 0x20c(0x04)
	char pad_210[0x4]; // 0x210(0x04)
	float *40306dbce4; // 0x214(0x04)
	char pad_218[0x4]; // 0x218(0x04)
	float *6a81788239; // 0x21c(0x04)
	char pad_220[0x8]; // 0x220(0x08)
	float *029e0e9066; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	float *dcc07cb989; // 0x230(0x04)
	float *5ca06c3991; // 0x234(0x04)
	char pad_238[0x4]; // 0x238(0x04)
	float *aba5c81070; // 0x23c(0x04)
	float *d35a49d46a; // 0x240(0x04)
	char pad_244[0x1c]; // 0x244(0x1c)
	float *b10ac5140e; // 0x260(0x04)
	bool *762b686d31; // 0x264(0x01)
	char pad_265[0x1]; // 0x265(0x01)
	bool *a8d656364d; // 0x266(0x01)
	char pad_267[0x1]; // 0x267(0x01)
	struct UPrimitiveComponent* *fb993e8d79; // 0x268(0x08)

	struct FHitResult *bdfa8ac4ab(struct FVector_NetQuantize100 Param1, struct FVector_NetQuantizeNormal Param3); // Function TslGame.*7804a94d4d.*bdfa8ac4ab // None // @ game+0x55c93a8
	void OnDriverLeave(); // Function TslGame.*7804a94d4d.OnDriverLeave // None // @ game+0xaf438c
	void *c4a35f8f1a(); // Function TslGame.*7804a94d4d.*c4a35f8f1a // None // @ game+0x55c6854
	struct FVector_NetQuantize100 *cf0e09f42a(struct U*7804a94d4d* Param0, struct FVector_NetQuantize100 Param2); // Function TslGame.*7804a94d4d.*cf0e09f42a // None // @ game+0x55bafbc
	void *91953413c2(); // Function TslGame.*7804a94d4d.*91953413c2 // None // @ game+0x55c929c
	void *9c519eb933(int32 Param0, struct FVector_NetQuantize100 Param2, struct FVector_NetQuantize100 Param4); // Function TslGame.*7804a94d4d.*9c519eb933 // None // @ game+0x55caaec
	struct FVector_NetQuantize100 *0a7ca3553d(bool Param5, struct FHitResult Param7); // Function TslGame.*7804a94d4d.*0a7ca3553d // None // @ game+0x55c9dd4
	struct UPrimitiveComponent* *e9b5a38954(struct FVector_NetQuantize100 Param9); // Function TslGame.*7804a94d4d.*e9b5a38954 // None // @ game+0x55c9820
	bool *f6ae62cc1a(struct FVector_NetQuantize100 Param1); // Function TslGame.*7804a94d4d.*f6ae62cc1a // None // @ game+0x55cb5d4
	void OnHitAtServer(struct AActor* Param0, struct FVector Param2); // Function TslGame.*7804a94d4d.OnHitAtServer // None // @ game+0x55c297c
	bool *66cd921d93(); // Function TslGame.*7804a94d4d.*66cd921d93 // None // @ game+0x55cb2a4
	void OnHitAtClient(struct AActor* Param0, struct FVector Param2); // Function TslGame.*7804a94d4d.OnHitAtClient // None // @ game+0xa366b4
	struct FVector_NetQuantizeNormal *63ad50b4b6(); // Function TslGame.*7804a94d4d.*63ad50b4b6 // None // @ game+0x55badac
	void *309f97da8c(int32 Param0, struct FVector_NetQuantize100 Param2); // Function TslGame.*7804a94d4d.*309f97da8c // None // @ game+0x55ba3e8
	bool *b2bd59b286(); // Function TslGame.*7804a94d4d.*b2bd59b286 // None // @ game+0x55cae1c
	void *039ca2550d(); // Function TslGame.*7804a94d4d.*039ca2550d // None // @ game+0x55bf6dc
	struct FVector_NetQuantize100 *4aaa55fd59(struct U*7804a94d4d* Param0); // Function TslGame.*7804a94d4d.*4aaa55fd59 // None // @ game+0x55bb4f4
	struct FVector_NetQuantizeNormal *64527418eb(struct FVector_NetQuantize100 Param1, struct FVector_NetQuantizeNormal Param3, bool Param5); // Function TslGame.*7804a94d4d.*64527418eb // None // @ game+0x55ca24c
	void OnDriverRide(); // Function TslGame.*7804a94d4d.OnDriverRide // None // @ game+0xbc3ab4
	void *105403f36f(struct FVector_NetQuantize100 Param0, struct FVector_NetQuantizeNormal Param2, struct UPrimitiveComponent* Param4); // Function TslGame.*7804a94d4d.*105403f36f // None // @ game+0x55baae0
	struct FVector_NetQuantizeNormal *4dc84fc95e(); // Function TslGame.*7804a94d4d.*4dc84fc95e // None // @ game+0x55ba918
	void *9671044afb(struct FVector Param0); // Function TslGame.*7804a94d4d.*9671044afb // None // @ game+0x55ba2ac
	struct FVector_NetQuantizeNormal *4eaa4f3144(); // Function TslGame.*7804a94d4d.*4eaa4f3144 // None // @ game+0x55bb2e4
	int32 *34569197e3(struct FVector_NetQuantize100 Param1, struct FVector_NetQuantizeNormal Param3, struct UPrimitiveComponent* Param5); // Function TslGame.*7804a94d4d.*34569197e3 // None // @ game+0x55ba5f4
	void OnRep_ServerCorrection(); // Function TslGame.*7804a94d4d.OnRep_ServerCorrection // None // @ game+0x55c5328
};

// Class TslGame.*5a915b1d2c
// Size: 0x200 (Inherited: 0x1f0)
struct U*5a915b1d2c : UActorComponent {
	float TickInterval; // 0x1f0(0x04)
	char pad_1F4[0xc]; // 0x1f4(0x0c)
};

// Class TslGame.TslVehicleValidationManager
// Size: 0x78 (Inherited: 0x28)
struct UTslVehicleValidationManager : UObject {
	struct TMap<enum class ECheatType, struct U*4622cffc5c*> *a3e1f74af7; // 0x28(0x50)
};

// Class TslGame.*4622cffc5c
// Size: 0x38 (Inherited: 0x28)
struct U*4622cffc5c : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class TslGame.*cf433ab8c3
// Size: 0x40 (Inherited: 0x38)
struct U*cf433ab8c3 : U*4622cffc5c {
	char pad_38[0x8]; // 0x38(0x08)
};

// Class TslGame.*0d6077029c
// Size: 0x200 (Inherited: 0x1f0)
struct U*0d6077029c : UActorComponent {
	struct F*64c6f9629b PrimaryComponentTick; // 0x110(0x58)
	struct TArray<struct FName> ComponentTags; // 0x168(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x178(0x10)
	char pad_268_0 : 3; // 0x268(0x01)
	char bReplicates : 1; // 0x188(0x01)
	char bNetAddressable : 1; // 0x188(0x01)
	char *d9de2ce983 : 1; // 0x188(0x01)
	char bCreatedByConstructionScript : 1; // 0x18a(0x01)
	char bInstanceComponent : 1; // 0x18a(0x01)
	char bAutoActivate : 1; // 0x18a(0x01)
	char *eedbc91ee9 : 1; // 0x18a(0x01)
	char *8016acb0c2 : 1; // 0x18a(0x01)
	struct FGuid DestructibleId; // 0x18c(0x10)
	bool bIsDestroyedVersion; // 0x19c(0x01)
	char *cb59e077f1 : 1; // 0x1a0(0x01)
	char bIsEditorOnly : 1; // 0x1a0(0x01)
	enum class EComponentCreationMethod CreationMethod; // 0x1a5(0x01)
	enum class EPendingCreationType *a029c1f885; // 0x1a6(0x01)
	struct TArray<struct FSimpleMemberReference> *1c5b1ecf7e; // 0x1b0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1d0(0x10)
	char *6583edce58 : 1; // 0x1e9(0x01)

	void *b3ab644ab0(); // Function Engine.ActorComponent.*b3ab644ab0 // None // @ game+0x6377894
	void *7fc2785714(); // Function Engine.ActorComponent.*7fc2785714 // None // @ game+0x6373da8
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // None // @ game+0x637266c
	void AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // None // @ game+0x635dcc0
	void Activate(); // Function Engine.ActorComponent.Activate // None // @ game+0xbe8680
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // None // @ game+0x646f3c
	void *7e6bf7eb55(); // Function Engine.ActorComponent.*7e6bf7eb55 // None // @ game+0x637aa80
	void *eda0f1fdef(); // Function Engine.ActorComponent.*eda0f1fdef // None // @ game+0x637cce8
	void IsActive(); // Function Engine.ActorComponent.IsActive // None // @ game+0x636ba20
	void *7af955f165(); // Function Engine.ActorComponent.*7af955f165 // None // @ game+0x6373ed0
	void *b6de83bb83(); // Function Engine.ActorComponent.*b6de83bb83 // None // @ game+0x5e2dd20
	void ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // None // @ game+0x26a108
	void *d30428cd54(); // Function Engine.ActorComponent.*d30428cd54 // None // @ game+0x637cbc4
	void *ef1420b078(); // Function Engine.ActorComponent.*ef1420b078 // None // @ game+0x6366a94
	bool *cc59ee805b(); // Function Engine.ActorComponent.*cc59ee805b // None // @ game+0x6376c9c
	void *7664b363a1(); // Function Engine.ActorComponent.*7664b363a1 // None // @ game+0xae4624
	void *70313663c3(); // Function Engine.ActorComponent.*70313663c3 // None // @ game+0x63794e0
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // None // @ game+0x26a108
	void *9ffc398f85(); // Function Engine.ActorComponent.*9ffc398f85 // None // @ game+0x635dde8
	void *65f31f10a3(); // Function Engine.ActorComponent.*65f31f10a3 // None // @ game+0x6379448
	void ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // None // @ game+0x26a108
	void *db9ec7e456(); // Function Engine.ActorComponent.*db9ec7e456 // None // @ game+0x636bae0
	void *baf5caeb25(); // Function Engine.ActorComponent.*baf5caeb25 // None // @ game+0x636bc00
	void *298b7db98d(); // Function Engine.ActorComponent.*298b7db98d // None // @ game+0x636ee28
	struct FName *d920280472(); // Function Engine.ActorComponent.*d920280472 // None // @ game+0x6361a14
};

// Class TslGame.TslVendingMachineSpot
// Size: 0x400 (Inherited: 0x3f8)
struct ATslVendingMachineSpot : AActor {
	struct U*b00d9f92e9* SpotComponent; // 0x3f8(0x08)
};

// Class TslGame.*b00d9f92e9
// Size: 0x4d0 (Inherited: 0x4c0)
struct U*b00d9f92e9 : USceneComponent {
	enum class EVendingMachineType VendingMachineType; // 0x4c0(0x01)
	char pad_4C1[0xf]; // 0x4c1(0x0f)
};

// Class TslGame.*2895f931c5
// Size: 0x210 (Inherited: 0x1f0)
struct U*2895f931c5 : UActorComponent {
	struct TArray<struct F*a8910ecf86> *b9233b73d5; // 0x1f0(0x10)
	char pad_200[0x10]; // 0x200(0x10)

	void *ef5cb3b570(); // Function TslGame.*2895f931c5.*ef5cb3b570 // None // @ game+0x55b99dc
	void *66c4960319(); // Function TslGame.*2895f931c5.*66c4960319 // None // @ game+0x55b993c
};

// Class TslGame.TslGameMode
// Size: 0x15e0 (Inherited: 0x4d8)
struct ATslGameMode : AGameMode {
	char pad_4D8[0x78]; // 0x4d8(0x78)
	struct UClass* MalePawnClass; // 0x550(0x08)
	struct FStringClassReference PerfBotPlayerControllerClass; // 0x558(0x10)
	struct FStringClassReference ModeControllerClass; // 0x568(0x10)
	struct TArray<struct FStringClassReference> AdditionalModeControllerClasses; // 0x578(0x10)
	struct UClass* testActor; // 0x588(0x08)
	struct FStringClassReference InitialItemDonatorClass; // 0x590(0x10)
	struct TArray<struct F*23be8024ca> MatchPreparerClasses; // 0x5a0(0x10)
	enum class EMatchStartType MatchStartType; // 0x5b0(0x01)
	char pad_5B1[0x7]; // 0x5b1(0x07)
	struct FStringClassReference SpawnKitClass; // 0x5b8(0x10)
	enum class ECameraViewBehaviour CameraViewBehaviour; // 0x5c8(0x01)
	bool bAllowObserverVoiceChatOutput; // 0x5c9(0x01)
	char pad_5CA[0x6]; // 0x5ca(0x06)
	struct U*26253f21c4* *b6a90a9b58; // 0x5d0(0x08)
	struct U*bec9f5dc96* *e9a8a6bf90; // 0x5d8(0x08)
	char pad_5E0[0x2]; // 0x5e0(0x02)
	bool bFindPresetNameWithWeatherName; // 0x5e2(0x01)
	char pad_5E3[0x5]; // 0x5e3(0x05)
	struct FName PresetName; // 0x5e8(0x08)
	bool PlayerRespawn; // 0x5f0(0x01)
	bool PlayerRandomRespawnLocation; // 0x5f1(0x01)
	char pad_5F2[0x6]; // 0x5f2(0x06)
	struct TArray<struct F*ff324b46d9> LocalStringParameters; // 0x5f8(0x10)
	char pad_608[0x11]; // 0x608(0x11)
	bool bOverrideUseDestructableProp; // 0x619(0x01)
	bool bAllowGlobalVoiceChatbyMode; // 0x61a(0x01)
	bool bAllowTeamVoiceChatbyMode; // 0x61b(0x01)
	bool bAllowGlobalVoiceChatAtInit; // 0x61c(0x01)
	char pad_61D[0x3]; // 0x61d(0x03)
	float GlobalVoiceChannelMuteTimeInSeconds; // 0x620(0x04)
	int32 PostMatchWaitingTime; // 0x624(0x04)
	int32 NextRoundWaitingTime; // 0x628(0x04)
	int32 EndRoundWaitingTime; // 0x62c(0x04)
	int32 ServerQuitAfterLeavingMapTime; // 0x630(0x04)
	int32 MinPlayers; // 0x634(0x04)
	int32 MaxFPS; // 0x638(0x04)
	int32 PlayerSpawnTryMaxCount; // 0x63c(0x04)
	bool bEnablePerfBotInPIE; // 0x640(0x01)
	bool bEnablePerfBotLogin; // 0x641(0x01)
	bool bIsPerfBotSpawnToRandomPosition; // 0x642(0x01)
	bool bUseXboxUnauthorizedDevice; // 0x643(0x01)
	bool bCanRestartPerfBot; // 0x644(0x01)
	bool bEnableObserverInPIE; // 0x645(0x01)
	bool bPreventFinishMatchInPIE; // 0x646(0x01)
	char pad_647[0x1]; // 0x647(0x01)
	struct FString SelectedSpawnKit; // 0x648(0x10)
	struct FString PlatoonSpawnKit; // 0x658(0x10)
	struct FString EssentialSpawnKitName; // 0x668(0x10)
	struct FString AdditionalSpawnKit; // 0x678(0x10)
	bool bTakeoffAllItemAtEquipSpawnKit; // 0x688(0x01)
	bool *d37667f982; // 0x689(0x01)
	bool bForceEquipSpawnKit; // 0x68a(0x01)
	char pad_68B[0xd]; // 0x68b(0x0d)
	bool bUseTimerForResetLevelToNextMatch; // 0x698(0x01)
	char pad_699[0x3]; // 0x699(0x03)
	float TimeResetLevelToNextMatch; // 0x69c(0x04)
	char pad_6A0[0x14]; // 0x6a0(0x14)
	bool bStartPlayerAtMatchStart; // 0x6b4(0x01)
	bool bShouldSpawnAtStartSpot; // 0x6b5(0x01)
	bool bEnableDBNO; // 0x6b6(0x01)
	bool bEnableAntiLean; // 0x6b7(0x01)
	char pad_6B8[0x2]; // 0x6b8(0x02)
	bool bUseCeremonyState; // 0x6ba(0x01)
	char pad_6BB[0x1]; // 0x6bb(0x01)
	int32 TeamSize; // 0x6bc(0x04)
	int32 LobbyBallsToSpawnPerStartLocation; // 0x6c0(0x04)
	char pad_6C4[0x4]; // 0x6c4(0x04)
	struct UClass* LobbyBallManagerClass; // 0x6c8(0x08)
	bool bEnableSquadInTeam; // 0x6d0(0x01)
	bool bEnablePlatoonCommander; // 0x6d1(0x01)
	char pad_6D2[0x2]; // 0x6d2(0x02)
	struct F*404b69bd7b PlatoonSupportRequestManifest; // 0x6d4(0x18)
	int32 SquadSize; // 0x6ec(0x04)
	bool bEnableBleedOut; // 0x6f0(0x01)
	bool bUsingSelectableSpawnKit; // 0x6f1(0x01)
	bool bUsingPlatoonSpawnKit; // 0x6f2(0x01)
	bool bOverrideEssentialSpawnKit; // 0x6f3(0x01)
	bool bUsingAdditionalSpawnKit; // 0x6f4(0x01)
	bool bEquipSpawnKitToAI; // 0x6f5(0x01)
	char pad_6F6[0x2]; // 0x6f6(0x02)
	struct FInt32Range AISpawnKitInex; // 0x6f8(0x10)
	bool bPreventAutoSpawnKitMessage; // 0x708(0x01)
	char bEnableClientPacketLossReport : 1; // 0x709(0x01)
	char bUseThermalScope : 1; // 0x709(0x01)
	char pad_709_2 : 6; // 0x709(0x01)
	char pad_70A[0x2]; // 0x70a(0x02)
	float CeremonyDuration; // 0x70c(0x04)
	float EndRoundCeremonyDuration; // 0x710(0x04)
	float RoundMatchCeremonyDuration; // 0x714(0x04)
	bool bShowCelebrateResult; // 0x718(0x01)
	bool bIsEditorTestZombieMode; // 0x719(0x01)
	bool bIsCustomGame; // 0x71a(0x01)
	bool bIsEventMode; // 0x71b(0x01)
	bool bCanAllSpectate; // 0x71c(0x01)
	bool bKillerSpectateMode; // 0x71d(0x01)
	bool bShowLastCircleMark; // 0x71e(0x01)
	char pad_71F[0x1]; // 0x71f(0x01)
	float LastCircleAlgorithmPercent; // 0x720(0x04)
	bool bChangeStartingPoint; // 0x724(0x01)
	bool bKeepLastCirclePosition; // 0x725(0x01)
	bool bCustomEmoteMode; // 0x726(0x01)
	bool bUsingInnerBlueZone; // 0x727(0x01)
	enum class EBlueZoneShape BlueZoneShape; // 0x728(0x01)
	char pad_729[0x3]; // 0x729(0x03)
	float BlueZoneRectangleAspectRatio; // 0x72c(0x04)
	struct FVector2D BlueZoneLeftTop; // 0x730(0x08)
	struct FVector2D BlueZoneRightBottom; // 0x738(0x08)
	bool bFixedStartBlueZoneLocation; // 0x740(0x01)
	char pad_741[0x3]; // 0x741(0x03)
	struct FVector2D FixedStartBlueZoneCenterLocationRatio; // 0x744(0x08)
	bool bUsingOuterBlueZone; // 0x74c(0x01)
	char pad_74D[0x3]; // 0x74d(0x03)
	float OuterBlueZoneSizeRatio; // 0x750(0x04)
	float OuterBlueZoneDamage; // 0x754(0x04)
	float OuterBlueZoneMargin; // 0x758(0x04)
	enum class EBlueZoneShape OuterBlueZoneShape; // 0x75c(0x01)
	bool bEnableDamageWhileRidingParachute; // 0x75d(0x01)
	bool bIsSurvivalIngameRewardActive; // 0x75e(0x01)
	bool bDisableAutoLooting; // 0x75f(0x01)
	bool bActiveLogPlayerHealed; // 0x760(0x01)
	bool bUsingStreamingLevelBound; // 0x761(0x01)
	char pad_762[0x2]; // 0x762(0x02)
	float OuterBlueZoneDistanceFromStreamingLevelBound; // 0x764(0x04)
	float StreamingLevelBoundEjectionAreaRatio; // 0x768(0x04)
	bool bAircraftFlightPathInStreamingLevelBounds; // 0x76c(0x01)
	bool bFinishNoConnections; // 0x76d(0x01)
	bool bDeleteSprayDecalWhenRestart; // 0x76e(0x01)
	char pad_76F[0x1]; // 0x76f(0x01)
	struct TArray<enum class ERadioMessageCategory> *13de9b02e0; // 0x770(0x10)
	bool bEnableVehicleTrunk; // 0x780(0x01)
	char pad_781[0x7]; // 0x781(0x07)
	SetProperty *9b9d589f73; // 0x788(0x50)
	bool bIsVehicleAiEnabled; // 0x7d8(0x01)
	bool bMakeVehicleModeComponent; // 0x7d9(0x01)
	char pad_7DA[0x2]; // 0x7da(0x02)
	float EventBoosterTorqueOverrider; // 0x7dc(0x04)
	bool bRemoveVehicleAfterDeath; // 0x7e0(0x01)
	char pad_7E1[0x3]; // 0x7e1(0x03)
	float VehicleRemoveTimer; // 0x7e4(0x04)
	bool bUseOtherPlayerIcon; // 0x7e8(0x01)
	bool bUseTeamColorOnly; // 0x7e9(0x01)
	bool bUseTeamColorWidget; // 0x7ea(0x01)
	char pad_7EB[0x1]; // 0x7eb(0x01)
	struct F*b89eaf3c24 CustomGameUpdateCharacterInfo; // 0x7ec(0x0c)
	struct TArray<struct F*ec0b51269b> LimitCustomStringParameters; // 0x7f8(0x10)
	struct FString CustomWeaponDamage; // 0x808(0x10)
	struct TArray<struct FName> *19f69ef4cf; // 0x818(0x10)
	float MultiplierBlueZone; // 0x828(0x04)
	float MultiplierCarePackageNormal; // 0x82c(0x04)
	bool bFlareGun; // 0x830(0x01)
	char pad_831[0x3]; // 0x831(0x03)
	struct F*2910b8c0b8 RedZoneCustomOption; // 0x834(0x1c)
	struct F*81055234d7 BlackZoneCustomOption; // 0x850(0x40)
	struct F*7ded01e128 BlizzardZoneCustomOption; // 0x890(0x14)
	struct F*7ded01e128 SandStormZoneCustomOption; // 0x8a4(0x14)
	struct F*9758578d2c EmPickupCustomOption; // 0x8b8(0x14)
	char pad_8CC[0x4]; // 0x8cc(0x04)
	struct TArray<struct F*516301bedc> BlueZoneCustomOptions; // 0x8d0(0x10)
	struct F*18e5f91a4c LootTruckCustomOption; // 0x8e0(0x10)
	int32 TownWeight; // 0x8f0(0x04)
	int32 FieldWeight; // 0x8f4(0x04)
	int32 MountainWeight; // 0x8f8(0x04)
	bool bIsFixedLastCircle; // 0x8fc(0x01)
	char pad_8FD[0x3]; // 0x8fd(0x03)
	struct FVector2D LastCircleCenterAsRatio; // 0x900(0x08)
	bool bHideNicknameOnKillfeed; // 0x908(0x01)
	bool bUseParachuteAutoDeploy; // 0x909(0x01)
	char pad_90A[0x2]; // 0x90a(0x02)
	float ParachuteAutoDeployAltitudeMultiplier; // 0x90c(0x04)
	float ParachuteStartDeployAltitudeMultiplier; // 0x910(0x04)
	float MultiplierParachuteLandingDamage; // 0x914(0x04)
	struct UMaterialInterface* OverrideParachuteMaterial; // 0x918(0x08)
	bool bHideVisualizeTslDebugInformation; // 0x920(0x01)
	bool bDisableClientGameEventObserverLog; // 0x921(0x01)
	char pad_922[0x2]; // 0x922(0x02)
	int32 ServerMaxTickRate; // 0x924(0x04)
	int32 *dda8cf3add; // 0x928(0x04)
	char pad_92C[0x4]; // 0x92c(0x04)
	struct FStringClassReference *06c5b6d519; // 0x930(0x10)
	struct FStringClassReference *a5c38c4b60; // 0x940(0x10)
	struct FStringClassReference ItemSpawnProcessorClass; // 0x950(0x10)
	struct FStringClassReference EventItemSpawnProcessorClass; // 0x960(0x10)
	struct FStringClassReference ThingSpawnProcessorClass; // 0x970(0x10)
	struct FStringClassReference TslSupplyBoxSpawnProcessorClass; // 0x980(0x10)
	struct FStringClassReference JukeBoxSpawnProcessorClass; // 0x990(0x10)
	struct FStringClassReference BlueChipTowerSpawnProcessorClass; // 0x9a0(0x10)
	struct FStringClassReference CabinetSpawnProcessorClass; // 0x9b0(0x10)
	struct FStringClassReference InteractionSupplySpawnProcessorClass; // 0x9c0(0x10)
	struct FStringClassReference GroupDeployedItemSpawnProcessorClass; // 0x9d0(0x10)
	struct FName BasicBeltItemIDForNoBelt; // 0x9e0(0x08)
	struct FStringClassReference *b68acc7f43; // 0x9e8(0x10)
	struct FStringClassReference *cf570399a5; // 0x9f8(0x10)
	struct U*d78f350038* *7fc81979fc; // 0xa08(0x08)
	struct U*c0ddfbdeaa* *6a05065f64; // 0xa10(0x08)
	struct TMap<int32, struct ATslPlayerStart*> *24afc1aced; // 0xa18(0x50)
	struct TArray<struct APlayerStart*> PlayerStarts; // 0xa68(0x10)
	struct TArray<struct F*5c60d5a48b> *5c60d5a48b; // 0xa78(0x10)
	struct TMap<struct FString, struct ATslPlayerStart*> *6b1b2ff135; // 0xa88(0x50)
	int32 PlayerStartCount; // 0xad8(0x04)
	char pad_ADC[0x4]; // 0xadc(0x04)
	struct TArray<struct FRankingInfo> *366cbaf32c; // 0xae0(0x10)
	struct TArray<struct FRankingInfo> *a58e5e7fde; // 0xaf0(0x10)
	struct TArray<struct FPointInfo> *49cb8253e2; // 0xb00(0x10)
	char pad_B10[0x10]; // 0xb10(0x10)
	int32 *a2c923017d; // 0xb20(0x04)
	char pad_B24[0x4]; // 0xb24(0x04)
	struct TArray<int32> *08daf1349f; // 0xb28(0x10)
	struct FStringClassReference ModePresetClass; // 0xb38(0x10)
	float TeamKillDamageModifier; // 0xb48(0x04)
	float VehicleWheelDamageModifier; // 0xb4c(0x04)
	uint16 *a972a637ad; // 0xb50(0x02)
	bool *0be5c37e76; // 0xb52(0x01)
	char pad_B53[0x5]; // 0xb53(0x05)
	struct FMulticastDelegate OnMatchStarted; // 0xb58(0x10)
	char pad_B68[0x10]; // 0xb68(0x10)
	struct UGeneralItemSpawner* *80110285f4; // 0xb78(0x08)
	char pad_B80[0x8]; // 0xb80(0x08)
	struct UItemSpawnProcessor* ItemSpawnProcessor; // 0xb88(0x08)
	struct UThingSpawnProcessor* ThingSpawnProcessor; // 0xb90(0x08)
	struct UTslSupplyBoxSpawnProcessor* TslSupplyBoxSpawnProcessor; // 0xb98(0x08)
	struct UJukeBoxSpawnProcessor* JukeBoxSpawnProcessor; // 0xba0(0x08)
	struct UTslBlueChipTowerSpawnProcessor* *450f76c4b6; // 0xba8(0x08)
	struct UCabinetSpawnProcessor* CabinetSpawnProcessor; // 0xbb0(0x08)
	char pad_BB8[0x8]; // 0xbb8(0x08)
	struct UInteractionSupplySpawnProcessor* InteractionSupplySpawnProcessor; // 0xbc0(0x08)
	struct UEventItemSpawnProcessor* EventItemSpawnProcessor; // 0xbc8(0x08)
	struct UGroupDeployedItemSpawnProcessor* GroupDeployedItemSpawnProcessor; // 0xbd0(0x08)
	struct USpawnKit* SpawnKit; // 0xbd8(0x08)
	struct AModeController* ModeController; // 0xbe0(0x08)
	struct ADroppedItemGridManager* DroppedItemGridManager; // 0xbe8(0x08)
	struct AGameplayTracerManager* *b9e0c4c4b5; // 0xbf0(0x08)
	struct AMissionManager* *c76954d359; // 0xbf8(0x08)
	struct UModePreset* ModePreset; // 0xc00(0x08)
	struct UMatchPreparer* MatchPreparer; // 0xc08(0x08)
	struct UItemPackageProcessor* ItemPackageProcessor; // 0xc10(0x08)
	char pad_C18[0x8]; // 0xc18(0x08)
	struct TArray<struct AModeController*> *1e04314666; // 0xc20(0x10)
	char pad_C30[0x150]; // 0xc30(0x150)
	struct TMap<struct FString, struct ATslPlayerState*> *ea78f9ca27; // 0xd80(0x50)
	char pad_DD0[0xa0]; // 0xdd0(0xa0)
	struct TArray<struct F*747577732c> *747577732c; // 0xe70(0x10)
	char pad_E80[0xa8]; // 0xe80(0xa8)
	int32 TeamId; // 0xf28(0x04)
	float FlareGunMsgDist; // 0xf2c(0x04)
	char pad_F30[0x18]; // 0xf30(0x18)
	struct U*63690e88de* *63690e88de; // 0xf48(0x08)
	char pad_F50[0x10]; // 0xf50(0x10)
	bool bCanUseRespawnedItem; // 0xf60(0x01)
	bool bRemoveDroppedItemPeriodically; // 0xf61(0x01)
	char pad_F62[0x2]; // 0xf62(0x02)
	float DroppedItemLifeTime; // 0xf64(0x04)
	float DroppedItemCheckInterval; // 0xf68(0x04)
	char pad_F6C[0x84]; // 0xf6c(0x84)
	bool *1b5541e0f1; // 0xff0(0x01)
	bool *401cd34b6f; // 0xff1(0x01)
	bool *f5c274c956; // 0xff2(0x01)
	char pad_FF3[0x1]; // 0xff3(0x01)
	float *8c73ece91a; // 0xff4(0x04)
	float *b1d08b3017; // 0xff8(0x04)
	char pad_FFC[0x5c]; // 0xffc(0x5c)
	struct U*71c71bb915* NpcManager; // 0x1058(0x08)
	struct ATslGameState* TslGameState; // 0x1060(0x08)
	char pad_1068[0x4]; // 0x1068(0x04)
	bool bIsStartGround; // 0x106c(0x01)
	char pad_106D[0x3]; // 0x106d(0x03)
	struct TMap<struct FName, int32> ItemLimits; // 0x1070(0x50)
	struct FWuLogMatchRating LogMatchRating; // 0x10c0(0x70)
	char pad_1130[0x50]; // 0x1130(0x50)
	struct UTslPlatoonCommanderSystem* *49f82aa84e; // 0x1180(0x08)
	struct TArray<struct F*634879c493> *b4b2aea412; // 0x1188(0x10)
	struct FString MatchingPoolType; // 0x1198(0x10)
	bool bUseCountDownPlayerFence; // 0x11a8(0x01)
	bool *eb7fcd61d4; // 0x11a9(0x01)
	bool *6e4f9440bd; // 0x11aa(0x01)
	char pad_11AB[0x5]; // 0x11ab(0x05)
	struct FStringClassReference AIModePresetClass; // 0x11b0(0x10)
	struct UClass* UltronSystemManager; // 0x11c0(0x08)
	bool *d5abb6ffbd; // 0x11c8(0x01)
	char pad_11C9[0x3]; // 0x11c9(0x03)
	float *601ed927fe; // 0x11cc(0x04)
	struct U*fe9acc3351* *fcead8761a; // 0x11d0(0x08)
	struct AAIModeSupporter* *244ffe7fb3; // 0x11d8(0x08)
	struct ATslAIWorldVolume* *0c4519528b; // 0x11e0(0x08)
	struct U*a10c40ef1e* *b212f55b81; // 0x11e8(0x08)
	bool *97681444c5; // 0x11f0(0x01)
	char TestAI : 1; // 0x11f1(0x01)
	char pad_11F1_1 : 7; // 0x11f1(0x01)
	bool *13934f04a8; // 0x11f2(0x01)
	bool bAutoFillBotPlayer; // 0x11f3(0x01)
	char pad_11F4[0x4]; // 0x11f4(0x04)
	struct UAIModePreset* AIModePreset; // 0x11f8(0x08)
	char pad_1200[0x40]; // 0x1200(0x40)
	struct U*78d60425ff* *ca8d1bbca5; // 0x1240(0x08)
	char pad_1248[0x8]; // 0x1248(0x08)
	struct ATslPhysicsVolume* *f6ddee4bed; // 0x1250(0x08)
	struct TArray<struct F*5c60d5a48b> *6ee94bf711; // 0x1258(0x10)
	char pad_1268[0x20]; // 0x1268(0x20)
	struct U*b8fd48b11a* *905658a0d0; // 0x1288(0x08)
	char pad_1290[0x4]; // 0x1290(0x04)
	bool bCanParachuteFollow; // 0x1294(0x01)
	bool bCanCarry; // 0x1295(0x01)
	bool bAscendersEnabled; // 0x1296(0x01)
	bool bGasPumpsEnabled; // 0x1297(0x01)
	bool bZiplinesEnabled; // 0x1298(0x01)
	char pad_1299[0x7]; // 0x1299(0x07)
	struct TMap<enum class ETslBpRewardLogicType, struct FStringClassReference> *51e5af5a01; // 0x12a0(0x50)
	struct TMap<enum class ETslXpRewardLogicType, struct FStringClassReference> *e9230b5380; // 0x12f0(0x50)
	struct TMap<enum class ETslApRewardLogicType, struct FStringClassReference> *7dfa2891d9; // 0x1340(0x50)
	struct UTslBpRewardCalculator* *bb24b4a2fa; // 0x1390(0x08)
	struct UTslXpRewardCalculator* *0298e20b23; // 0x1398(0x08)
	struct UTslApRewardCalculator* *18c2edf76f; // 0x13a0(0x08)
	char pad_13A8[0x38]; // 0x13a8(0x38)
	struct U*15ff740741* *15ff740741; // 0x13e0(0x08)
	char pad_13E8[0x68]; // 0x13e8(0x68)
	struct AAbstractRespawnProcessor* *112fbbb0bd; // 0x1450(0x08)
	struct ATslWhiteZoneController* *a7738402dc; // 0x1458(0x08)
	struct UClass* RespawnProcessorClass; // 0x1460(0x08)
	char pad_1468[0x40]; // 0x1468(0x40)
	struct F*8708410b7d *8708410b7d; // 0x14a8(0x60)
	char pad_1508[0xc8]; // 0x1508(0xc8)
	struct UClass* *c131374292; // 0x15d0(0x08)
	struct U*e62eca3016* *223a367bad; // 0x15d8(0x08)

	struct APlayerState* *822ca4ff87(); // Function TslGame.TslGameMode.*822ca4ff87 // None // @ game+0x563af20
	void *364950b143(); // Function TslGame.TslGameMode.*364950b143 // None // @ game+0xaf438c
	void *ad059848ff(); // Function TslGame.TslGameMode.*ad059848ff // None // @ game+0x560b07c
	void *1dfcc393d9(); // Function TslGame.TslGameMode.*1dfcc393d9 // None // @ game+0x56441cc
	void *ae4c55ae58(); // Function TslGame.TslGameMode.*ae4c55ae58 // None // @ game+0x563b480
	void *c3e1752bc3(); // Function TslGame.TslGameMode.*c3e1752bc3 // None // @ game+0x5641120
	void *37fc60aa04(); // Function TslGame.TslGameMode.*37fc60aa04 // None // @ game+0x563f12c
	void FinishMatch(); // Function TslGame.TslGameMode.FinishMatch // None // @ game+0x563afc0
	void *6a423767b6(); // Function TslGame.TslGameMode.*6a423767b6 // None // @ game+0x563bddc
	void *6ecb736576(); // Function TslGame.TslGameMode.*6ecb736576 // None // @ game+0x563f5e8
	void *f15dbe6db5(struct FName EventName); // Function TslGame.TslGameMode.*f15dbe6db5 // None // @ game+0x563917c
	void *6d63ecf79e(); // Function TslGame.TslGameMode.*6d63ecf79e // None // @ game+0x5644cb0
	void *4c6a22edc5(); // Function TslGame.TslGameMode.*4c6a22edc5 // None // @ game+0x5639968
	struct FText *80e53d594b(float MessageDuration); // Function TslGame.TslGameMode.*80e53d594b // None // @ game+0x5644db4
	void *378fd52118(); // Function TslGame.TslGameMode.*378fd52118 // None // @ game+0x563be8c
	void *0838b3ee32(); // Function TslGame.TslGameMode.*0838b3ee32 // None // @ game+0x563bdb8
	void *b12c0c0f5f(); // Function TslGame.TslGameMode.*b12c0c0f5f // None // @ game+0x5641138
	void *efcd250f27(); // Function TslGame.TslGameMode.*efcd250f27 // None // @ game+0x563d76c
	void *9aed0c3fce(); // Function TslGame.TslGameMode.*9aed0c3fce // None // @ game+0x564edac
	void *e286e3da4e(); // Function TslGame.TslGameMode.*e286e3da4e // None // @ game+0x563ccbc
	void *3b96dfa179(); // Function TslGame.TslGameMode.*3b96dfa179 // None // @ game+0x563f6ac
	void *82c1f6bc6f(); // Function TslGame.TslGameMode.*82c1f6bc6f // None // @ game+0x564ed7c
	void *ce8a9afc10(); // Function TslGame.TslGameMode.*ce8a9afc10 // None // @ game+0x563f5ac
	void OnNetDriverError(struct FString Param0); // Function TslGame.TslGameMode.OnNetDriverError // None // @ game+0x5642edc
	void *faf0d98619(); // Function TslGame.TslGameMode.*faf0d98619 // None // @ game+0x563d3b8
	void BenchmarkFinished(); // Function TslGame.TslGameMode.BenchmarkFinished // None // @ game+0x5638c64
	void *15acf96b7b(); // Function TslGame.TslGameMode.*15acf96b7b // None // @ game+0x563f434
	void *06941ed69a(); // Function TslGame.TslGameMode.*06941ed69a // None // @ game+0x563d544
	struct FString OnConnectionClosedDueToSecurityViolation(); // Function TslGame.TslGameMode.OnConnectionClosedDueToSecurityViolation // None // @ game+0x56421cc
	void *586f02c6f1(); // Function TslGame.TslGameMode.*586f02c6f1 // None // @ game+0x563b548
	void *35e18c41a5(); // Function TslGame.TslGameMode.*35e18c41a5 // None // @ game+0x563d52c
	void *769b799801(); // Function TslGame.TslGameMode.*769b799801 // None // @ game+0x563be5c
	void *75ca6f99dc(); // Function TslGame.TslGameMode.*75ca6f99dc // None // @ game+0x564ed64
	struct APlayerController* *2121e18691(); // Function TslGame.TslGameMode.*2121e18691 // None // @ game+0x5642d8c
	void *20a89d68a1(); // Function TslGame.TslGameMode.*20a89d68a1 // None // @ game+0x563f54c
	void *a7117afae7(); // Function TslGame.TslGameMode.*a7117afae7 // None // @ game+0x56399f8
	void *456d298367(); // Function TslGame.TslGameMode.*456d298367 // None // @ game+0x563be74
	void *bb5eccc0d3(); // Function TslGame.TslGameMode.*bb5eccc0d3 // None // @ game+0x563f2bc
	void *dc53ea31cf(); // Function TslGame.TslGameMode.*dc53ea31cf // None // @ game+0x563d37c
	void *7ef090a415(); // Function TslGame.TslGameMode.*7ef090a415 // None // @ game+0xaf438c
	void *8e3261e273(struct ATslPlayerState* DamageInstigator); // Function TslGame.TslGameMode.*8e3261e273 // None // @ game+0x5639474
	void *9989003212(); // Function TslGame.TslGameMode.*9989003212 // None // @ game+0x564115c
	void LogNetDriverError(); // Function TslGame.TslGameMode.LogNetDriverError // None // @ game+0x5641440
	void *35abade6d4(); // Function TslGame.TslGameMode.*35abade6d4 // None // @ game+0x563d2d0
	void OnConnectionTimeOutError(float Param1, bool Param3); // Function TslGame.TslGameMode.OnConnectionTimeOutError // None // @ game+0x5642428
	void *11f06568ff(); // Function TslGame.TslGameMode.*11f06568ff // None // @ game+0x563cae4
	void *61505a8309(); // Function TslGame.TslGameMode.*61505a8309 // None // @ game+0x563fbc8
};

// Class TslGame.*71c71bb915
// Size: 0x68 (Inherited: 0x28)
struct U*71c71bb915 : UObject {
	float *b10de450d0; // 0x28(0x04)
	float *63300d37a9; // 0x2c(0x04)
	struct U*90af1ec441* SpawnSystem; // 0x30(0x08)
	struct U*248852d24f* *6edb9d2414; // 0x38(0x08)
	struct U*4cbaf935ec* *0c90b44cd6; // 0x40(0x08)
	struct TArray<struct ATslPlayerController*> *22d8ee3b15; // 0x48(0x10)
	struct TArray<struct ATslPlayerController*> *0535311753; // 0x58(0x10)

	struct UClass* *5036d86dd2(); // Function TslGame.*71c71bb915.*5036d86dd2 // None // @ game+0x56ba6ec
};

// Class TslGame.*248852d24f
// Size: 0xc0 (Inherited: 0x28)
struct U*248852d24f : UObject {
	struct TArray<struct F*f3ef9f53b9> *d431d007a4; // 0x28(0x10)
	int32 *38496726a5; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct F*f3ef9f53b9 *950f4939bd; // 0x40(0x18)
	int32 *b4cffe439d; // 0x58(0x04)
	int32 *1eaabb56c3; // 0x5c(0x04)
	int32 *2b4b542246; // 0x60(0x04)
	int32 *6ed9636c30; // 0x64(0x04)
	SetProperty *a2ee7194c5; // 0x68(0x50)
	char pad_B8[0x8]; // 0xb8(0x08)
};

// Class TslGame.TslWeapon
// Size: 0xa70 (Inherited: 0x3f8)
struct ATslWeapon : AActor {
	char pad_3F8[0x38]; // 0x3f8(0x38)
	struct UTexture* WeaponIcon; // 0x430(0x08)
	float WeaponIconRatio; // 0x438(0x04)
	int32 LogWeaponFirePerFireCount; // 0x43c(0x04)
	struct TArray<struct FName> *c155fef74a; // 0x440(0x10)
	struct TArray<struct F*ecb5dc86e0> *56cd1c3333; // 0x450(0x10)
	bool *3341b9d93a; // 0x460(0x01)
	char pad_461[0x27]; // 0x461(0x27)
	struct FMulticastDelegate OnUpdatedAttachment; // 0x488(0x10)
	struct FMulticastDelegate OnUpdatedSkinData; // 0x498(0x10)
	struct FMulticastDelegate OnUpdatedMasteryItem; // 0x4a8(0x10)
	struct FMulticastDelegate OnUpdatedAttachmentOnServer; // 0x4b8(0x10)
	struct FMulticastDelegate OnUpdatedCharacterEvent; // 0x4c8(0x10)
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct F*5f311a1843 WeaponConfig; // 0x4e0(0x2b0)
	enum class EWeaponHand *f18c90b2ae; // 0x790(0x01)
	char pad_791[0x7]; // 0x791(0x07)
	struct TArray<enum class EWeaponClass> *7cb75cac39; // 0x798(0x10)
	bool *86f1c6387c; // 0x7a8(0x01)
	bool *7e9d78a885; // 0x7a9(0x01)
	char pad_7AA[0x6]; // 0x7aa(0x06)
	struct U*3af93f9c2e* *2d194f4cc4; // 0x7b0(0x08)
	struct USceneComponent* RootScene; // 0x7b8(0x08)
	int8 *27e4906d44; // 0x7c0(0x01)
	char pad_7C1[0x1]; // 0x7c1(0x01)
	enum class EAttachmentCalculateType *3ea9da9a0e; // 0x7c2(0x01)
	char pad_7C3[0x5]; // 0x7c3(0x05)
	struct TArray<struct F*9a7d2121a8> *9a4c8c08cf; // 0x7c8(0x10)
	struct TArray<struct F*14b35072c4> *940ebc12ee; // 0x7d8(0x10)
	struct TArray<int32> *833175daed; // 0x7e8(0x10)
	struct TArray<struct U*b86f0faf8a*> *f5312e20ec; // 0x7f8(0x10)
	struct FName *1f656f1871; // 0x808(0x08)
	int32 *f9256717b9; // 0x810(0x04)
	char pad_814[0x4]; // 0x814(0x04)
	struct FText ItemName; // 0x818(0x18)
	enum class EAccessorySlot *3ec5c97e34; // 0x830(0x01)
	enum class EAllowedThrowMode *50f53b4cde; // 0x831(0x01)
	char pad_832[0x6]; // 0x832(0x06)
	struct UAkComponent* AkComponent; // 0x838(0x08)
	char pad_840[0x8]; // 0x840(0x08)
	struct FName *97d49f0835; // 0x848(0x08)
	struct FName *ec1581f603; // 0x850(0x08)
	struct UParticleSystem* *725e22d51d; // 0x858(0x08)
	struct FName *330e24db7a; // 0x860(0x08)
	struct UClass* *e5d5cea52e; // 0x868(0x08)
	struct UParticleSystemComponent* *6544dadae4; // 0x870(0x08)
	struct UParticleSystemComponent* *098c1c747f; // 0x878(0x08)
	struct UForceFeedbackEffect* *75d00854b4; // 0x880(0x08)
	enum class EAnimWeaponType *bb82accf81; // 0x888(0x01)
	char pad_889[0x7]; // 0x889(0x07)
	struct F*fac7c5caf9 *86a6db2ad3; // 0x890(0x18)
	struct F*becb5c24a7 *49cd660b29; // 0x8a8(0x10)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *6370a8cd3c; // 0x8b8(0x50)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *adec0791a6; // 0x908(0x50)
	float *752bff0868; // 0x958(0x04)
	bool *74659a8463; // 0x95c(0x01)
	char pad_95D[0x3]; // 0x95d(0x03)
	char *1c7d9775b0 : 1; // 0x960(0x01)
	char pad_960_1 : 7; // 0x960(0x01)
	char pad_961[0x2f]; // 0x961(0x2f)
	bool *5a9282e985; // 0x990(0x01)
	bool *6d2b45d1da; // 0x991(0x01)
	bool *8dab78c1b1; // 0x992(0x01)
	char pad_993[0x1d]; // 0x993(0x1d)
	struct F*1b7d567481 *1b7d567481; // 0x9b0(0x20)
	struct F*e48280cd1f *e48280cd1f; // 0x9d0(0x04)
	struct F*e48280cd1f *80962ea54b; // 0x9d4(0x04)
	struct FName WeaponMeshName; // 0x9d8(0x08)
	struct U*175e1c70da* *175e1c70da; // 0x9e0(0x08)
	char pad_9E8[0x18]; // 0x9e8(0x18)
	struct UMeshComponent* *885c68132c; // 0xa00(0x08)
	bool *a8852a54b0; // 0xa08(0x01)
	char pad_A09[0x67]; // 0xa09(0x67)

	void GetWeaponMesh(); // Function TslGame.TslWeapon.GetWeaponMesh // None // @ game+0x55f0690
	void *92c6714274(); // Function TslGame.TslWeapon.*92c6714274 // None // @ game+0x55bd460
	void *df3a28f51b(struct FHitResult Param0); // Function TslGame.TslWeapon.*df3a28f51b // None // @ game+0x55f928c
	void *9e6f52576e(); // Function TslGame.TslWeapon.*9e6f52576e // None // @ game+0x55faa50
	void *b3915a5951(); // Function TslGame.TslWeapon.*b3915a5951 // None // @ game+0x55eb924
	void *fd8888e99b(); // Function TslGame.TslWeapon.*fd8888e99b // None // @ game+0x55fac7c
	void *c59a1a39a7(); // Function TslGame.TslWeapon.*c59a1a39a7 // None // @ game+0xa2c16c
	void *9e629e353f(); // Function TslGame.TslWeapon.*9e629e353f // None // @ game+0x55ef334
	void *0a5b74ded0(); // Function TslGame.TslWeapon.*0a5b74ded0 // None // @ game+0x55ed4f4
	enum class EWeaponAttachmentSlotID *d464ccf37e(); // Function TslGame.TslWeapon.*d464ccf37e // None // @ game+0x55f0370
	void *bf2ccd9e4c(); // Function TslGame.TslWeapon.*bf2ccd9e4c // None // @ game+0x55ef264
	void *9eb0fb792e(enum class EWeaponAttachmentSlotID SlotID); // Function TslGame.TslWeapon.*9eb0fb792e // None // @ game+0x55f0418
	void *993510ee2d(); // Function TslGame.TslWeapon.*993510ee2d // None // @ game+0x55ee9bc
	void Weapon_AttachShoulder(); // Function TslGame.TslWeapon.Weapon_AttachShoulder // None // @ game+0x55fac90
	void *409979cf20(); // Function TslGame.TslWeapon.*409979cf20 // None // @ game+0x55ebef0
	void OnRep_ReplicatedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedMasteryItem // None // @ game+0x55f454c
	void OnRep_AttachedItemIndexes(); // Function TslGame.TslWeapon.OnRep_AttachedItemIndexes // None // @ game+0x55f3e78
	void *3f63db3390(); // Function TslGame.TslWeapon.*3f63db3390 // None // @ game+0x55f28c8
	void *37e6f06e9f(); // Function TslGame.TslWeapon.*37e6f06e9f // None // @ game+0x55f063c
	void *ed960dd846(); // Function TslGame.TslWeapon.*ed960dd846 // None // @ game+0x55eda8c
	void *bd52f37902(); // Function TslGame.TslWeapon.*bd52f37902 // None // @ game+0x55ef410
	void *de1b1da8db(); // Function TslGame.TslWeapon.*de1b1da8db // None // @ game+0x55e861c
	void *80ccc1a430(); // Function TslGame.TslWeapon.*80ccc1a430 // None // @ game+0x55be270
	void *9069af2968(bool Hidden); // Function TslGame.TslWeapon.*9069af2968 // None // @ game+0x55f8b40
	void OnAttachmentChanged(); // Function TslGame.TslWeapon.OnAttachmentChanged // None // @ game+0x55f3b74
	void *ee655344c1(); // Function TslGame.TslWeapon.*ee655344c1 // None // @ game+0x55edd9c
	void *3541dc50d3(); // Function TslGame.TslWeapon.*3541dc50d3 // None // @ game+0x55ecd3c
	void *f06a897eae(); // Function TslGame.TslWeapon.*f06a897eae // None // @ game+0x55f057c
	void *8149f05cc5(); // Function TslGame.TslWeapon.*8149f05cc5 // None // @ game+0x55f6c70
	void *b1a672045b(); // Function TslGame.TslWeapon.*b1a672045b // None // @ game+0x55ebed8
	void *43b3984ab0(); // Function TslGame.TslWeapon.*43b3984ab0 // None // @ game+0x55f0244
	void *a0e978c938(); // Function TslGame.TslWeapon.*a0e978c938 // None // @ game+0x55e86c0
	void *0f8d1c9da1(); // Function TslGame.TslWeapon.*0f8d1c9da1 // None // @ game+0x55f0318
	void OnRep_ReplicatedAssignedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedAssignedMasteryItem // None // @ game+0xaf438c
	void *82c7e1475c(); // Function TslGame.TslWeapon.*82c7e1475c // None // @ game+0x55eb8d0
	void *c818d8b4a8(); // Function TslGame.TslWeapon.*c818d8b4a8 // None // @ game+0x55fa920
	void *b8ff67e657(); // Function TslGame.TslWeapon.*b8ff67e657 // None // @ game+0x55f0204
	void *449559473e(); // Function TslGame.TslWeapon.*449559473e // None // @ game+0xa6da90
	void *62149faccf(); // Function TslGame.TslWeapon.*62149faccf // None // @ game+0x55eddb4
	void *fcfbaa8fba(); // Function TslGame.TslWeapon.*fcfbaa8fba // None // @ game+0x55f022c
	void *13d2f0af87(); // Function TslGame.TslWeapon.*13d2f0af87 // None // @ game+0x55f0654
	void *ed72fe7d51(); // Function TslGame.TslWeapon.*ed72fe7d51 // None // @ game+0x55f0598
	void OnLoadedAttachmentAssetDatas(); // Function TslGame.TslWeapon.OnLoadedAttachmentAssetDatas // None // @ game+0x4e648c
	void *cd1b7ea700(); // Function TslGame.TslWeapon.*cd1b7ea700 // None // @ game+0x55f0704
	void *96ae496225(); // Function TslGame.TslWeapon.*96ae496225 // None // @ game+0x55ebaf8
	void *8923970e6a(); // Function TslGame.TslWeapon.*8923970e6a // None // @ game+0x55f0564
	void OnRep_ItemIndex(); // Function TslGame.TslWeapon.OnRep_ItemIndex // None // @ game+0xb7df74
	void *84decf0242(); // Function TslGame.TslWeapon.*84decf0242 // None // @ game+0x55eddcc
	void *11aac3845f(); // Function TslGame.TslWeapon.*11aac3845f // None // @ game+0x55f05b0
	struct USkeletalMeshComponent* *393e1d26d7(); // Function TslGame.TslWeapon.*393e1d26d7 // None // @ game+0x55f3a88
	void OnRep_ReplicatedSkinParam(); // Function TslGame.TslWeapon.OnRep_ReplicatedSkinParam // None // @ game+0x55f45cc
	void *97abf1dde7(); // Function TslGame.TslWeapon.*97abf1dde7 // None // @ game+0x63dfe8
	void *21d53206aa(); // Function TslGame.TslWeapon.*21d53206aa // None // @ game+0x55f0678
};

// Class TslGame.TslWeapon_Gun
// Size: 0x1000 (Inherited: 0xa70)
struct ATslWeapon_Gun : ATslWeapon {
	bool bSpawnBulletFromBarrel; // 0xa68(0x01)
	bool *2b7a712987; // 0xa69(0x01)
	enum class EWeaponState CurrentState; // 0xa6a(0x01)
	int32 *f6c1f1f79e; // 0xa6c(0x04)
	int32 *33d57d6922; // 0xa70(0x04)
	int32 *acb0ec39b8; // 0xa74(0x04)
	int32 *68abd40105; // 0xa78(0x04)
	char *5f0123dd56 : 1; // 0xa7c(0x01)
	char *1d3b2a4774 : 1; // 0xa7c(0x01)
	char *a565bd132e : 1; // 0xa7c(0x01)
	char pad_A83_3 : 5; // 0xa83(0x01)
	char pad_A84[0x2c]; // 0xa84(0x2c)
	int32 *fa1d80b941; // 0xab0(0x04)
	bool *151c600d42; // 0xab4(0x01)
	char pad_AB5[0x7b]; // 0xab5(0x7b)
	struct F*9c84e0ea54 *210e3c2d6b; // 0xb30(0x08)
	char pad_B38[0x58]; // 0xb38(0x58)
	struct F*c0c1470287 *c2acb84dc9; // 0xb90(0xa8)
	struct U*b77f654b52* *b77f654b52; // 0xc38(0x08)
	struct F*5d1a10b2e2 *8a6321f206; // 0xc40(0x20)
	struct FName ScopingAttachPoint; // 0xc60(0x08)
	struct FName *425762ecff; // 0xc68(0x08)
	struct FName *9b36050d56; // 0xc70(0x08)
	char pad_C78[0x288]; // 0xc78(0x288)
	int32 GripTypeIndexOverride; // 0xf00(0x04)
	bool *6ef5792022; // 0xf04(0x01)
	char pad_F05[0x3]; // 0xf05(0x03)
	float *6e83d3b242; // 0xf08(0x04)
	char pad_F0C[0xc]; // 0xf0c(0x0c)
	struct U*d8975ea1b4* WeaponGunData; // 0xf18(0x08)
	char pad_F20[0x20]; // 0xf20(0x20)
	struct UAkAudioEvent* *08518cce0d; // 0xf40(0x08)
	struct F*33858a901d *33858a901d; // 0xf48(0x20)
	struct UStaticMeshComponent* *33914398f4; // 0xf68(0x08)
	struct U*45324caa2d* *428417a959; // 0xf70(0x08)
	char pad_F78[0x4]; // 0xf78(0x04)
	struct FVector ShootTargetLoc; // 0xf7c(0x0c)
	char pad_F88[0x78]; // 0xf88(0x78)

	void *31a5a8fd05(); // Function TslGame.TslWeapon_Gun.*31a5a8fd05 // None // @ game+0x7ac608
	void *7d242ae9ea(); // Function TslGame.TslWeapon_Gun.*7d242ae9ea // None // @ game+0x562d7b4
	void *ad46cc8961(); // Function TslGame.TslWeapon_Gun.*ad46cc8961 // None // @ game+0x7ab98c
	void *248de7d776(); // Function TslGame.TslWeapon_Gun.*248de7d776 // None // @ game+0xbf5c20
	void *d8d6fcafa2(); // Function TslGame.TslWeapon_Gun.*d8d6fcafa2 // None // @ game+0x560c2cc
	void *d841e1ce81(); // Function TslGame.TslWeapon_Gun.*d841e1ce81 // None // @ game+0x562315c
	void *979d42dd86(); // Function TslGame.TslWeapon_Gun.*979d42dd86 // None // @ game+0x5629eb0
	void *642b61ab64(); // Function TslGame.TslWeapon_Gun.*642b61ab64 // None // @ game+0x562aa14
	void *7dfbc4507a(); // Function TslGame.TslWeapon_Gun.*7dfbc4507a // None // @ game+0x56006a4
	void *058d3c8a98(); // Function TslGame.TslWeapon_Gun.*058d3c8a98 // None // @ game+0x560bb9c
	void *afaa6e52f4(); // Function TslGame.TslWeapon_Gun.*afaa6e52f4 // None // @ game+0x560b4f8
	void *2300d5a3f9(); // Function TslGame.TslWeapon_Gun.*2300d5a3f9 // None // @ game+0x56024ec
	void *1407df09a9(); // Function TslGame.TslWeapon_Gun.*1407df09a9 // None // @ game+0x560ff20
	void *4bc831ce42(); // Function TslGame.TslWeapon_Gun.*4bc831ce42 // None // @ game+0x56190bc
	void *9bd94faf4b(); // Function TslGame.TslWeapon_Gun.*9bd94faf4b // None // @ game+0xb4fec8
	void *d2085cbee4(); // Function TslGame.TslWeapon_Gun.*d2085cbee4 // None // @ game+0x560c104
	void *aa24209ff8(); // Function TslGame.TslWeapon_Gun.*aa24209ff8 // None // @ game+0x561909c
	void *a5589df59c(); // Function TslGame.TslWeapon_Gun.*a5589df59c // None // @ game+0x560e288
	void *ad59dc5059(); // Function TslGame.TslWeapon_Gun.*ad59dc5059 // None // @ game+0x5613000
	void *bdd6ec6f74(); // Function TslGame.TslWeapon_Gun.*bdd6ec6f74 // None // @ game+0x561b588
	void *cad8a68f27(); // Function TslGame.TslWeapon_Gun.*cad8a68f27 // None // @ game+0x560bb7c
	void *b92e9dd84d(); // Function TslGame.TslWeapon_Gun.*b92e9dd84d // None // @ game+0x562dc04
	void *3c5f715473(); // Function TslGame.TslWeapon_Gun.*3c5f715473 // None // @ game+0xb563e4
	void *2b49eec055(); // Function TslGame.TslWeapon_Gun.*2b49eec055 // None // @ game+0x5610ed0
	void *09b4d793b3(); // Function TslGame.TslWeapon_Gun.*09b4d793b3 // None // @ game+0x560d888
	void *06b64efd0c(); // Function TslGame.TslWeapon_Gun.*06b64efd0c // None // @ game+0x560f94c
	void *e29bc6bca6(); // Function TslGame.TslWeapon_Gun.*e29bc6bca6 // None // @ game+0x560baa0
	void *71e2a0d4c8(); // Function TslGame.TslWeapon_Gun.*71e2a0d4c8 // None // @ game+0x560d74c
	void *a412d4c137(); // Function TslGame.TslWeapon_Gun.*a412d4c137 // None // @ game+0x5621ccc
	void *6911194f85(); // Function TslGame.TslWeapon_Gun.*6911194f85 // None // @ game+0x560ba40
	void *17b45558a1(); // Function TslGame.TslWeapon_Gun.*17b45558a1 // None // @ game+0xafe650
	void *ef222655fb(); // Function TslGame.TslWeapon_Gun.*ef222655fb // None // @ game+0x7ac1b4
	void *edc8ab42c4(); // Function TslGame.TslWeapon_Gun.*edc8ab42c4 // None // @ game+0x7ab7e0
	void *584e366a85(); // Function TslGame.TslWeapon_Gun.*584e366a85 // None // @ game+0x5600e60
	void *f84543f3b8(); // Function TslGame.TslWeapon_Gun.*f84543f3b8 // None // @ game+0xb98ebc
	void *a2c5e23427(); // Function TslGame.TslWeapon_Gun.*a2c5e23427 // None // @ game+0x560f6fc
	void *d419db682b(); // Function TslGame.TslWeapon_Gun.*d419db682b // None // @ game+0x55d0394
	void *2339731b60(); // Function TslGame.TslWeapon_Gun.*2339731b60 // None // @ game+0x560fa4c
	void *0cc1972262(); // Function TslGame.TslWeapon_Gun.*0cc1972262 // None // @ game+0x5600690
	void *4f288ed422(); // Function TslGame.TslWeapon_Gun.*4f288ed422 // None // @ game+0x560133c
	void *a103ef2847(int32 Param0); // Function TslGame.TslWeapon_Gun.*a103ef2847 // None // @ game+0x5604054
	void *ea5c3ed034(); // Function TslGame.TslWeapon_Gun.*ea5c3ed034 // None // @ game+0x562b1a4
	void IsReloading(); // Function TslGame.TslWeapon_Gun.IsReloading // None // @ game+0x56126f4
	void *35b690c7e0(enum class EScopeType ScopeType); // Function TslGame.TslWeapon_Gun.*35b690c7e0 // None // @ game+0x560fe10
	void *2e244869ed(); // Function TslGame.TslWeapon_Gun.*2e244869ed // None // @ game+0xa3bd94
	void *5eb735ec1e(); // Function TslGame.TslWeapon_Gun.*5eb735ec1e // None // @ game+0xbcac8c
	void *4081d80647(); // Function TslGame.TslWeapon_Gun.*4081d80647 // None // @ game+0x560c0a0
	void *5ffe6c4211(); // Function TslGame.TslWeapon_Gun.*5ffe6c4211 // None // @ game+0x560fa20
	void *f67b8314a5(); // Function TslGame.TslWeapon_Gun.*f67b8314a5 // None // @ game+0x5601da0
	void OnAttachmentAngledScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentAngledScopeLoaded // None // @ game+0x5614c7c
	void *0bd17782e3(); // Function TslGame.TslWeapon_Gun.*0bd17782e3 // None // @ game+0x5601c78
	void *b4940e5522(); // Function TslGame.TslWeapon_Gun.*b4940e5522 // None // @ game+0x562817c
	void OnRep_AmmoCount(); // Function TslGame.TslWeapon_Gun.OnRep_AmmoCount // None // @ game+0xa2a2cc
	void *8d491aa10e(); // Function TslGame.TslWeapon_Gun.*8d491aa10e // None // @ game+0x560ce90
	void *c5cba59887(); // Function TslGame.TslWeapon_Gun.*c5cba59887 // None // @ game+0x560ba60
	void *25602c2058(); // Function TslGame.TslWeapon_Gun.*25602c2058 // None // @ game+0x560f90c
	void *e6d0f3205e(); // Function TslGame.TslWeapon_Gun.*e6d0f3205e // None // @ game+0x5621b48
	void *e1e715b080(enum class EScopeType ScopeType); // Function TslGame.TslWeapon_Gun.*e1e715b080 // None // @ game+0x560f730
	void *431255a2c0(); // Function TslGame.TslWeapon_Gun.*431255a2c0 // None // @ game+0x56006e0
	void *147dcb989d(); // Function TslGame.TslWeapon_Gun.*147dcb989d // None // @ game+0x560d68c
	enum class EScopeType *7919c207fd(); // Function TslGame.TslWeapon_Gun.*7919c207fd // None // @ game+0x560e680
	void *b9c362567d(); // Function TslGame.TslWeapon_Gun.*b9c362567d // None // @ game+0x560d778
	void OnInventoryUpdated(); // Function TslGame.TslWeapon_Gun.OnInventoryUpdated // None // @ game+0x5615f5c
	void OnAttachmentMainScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentMainScopeLoaded // None // @ game+0x5614c90
	void *dfb18e05e6(); // Function TslGame.TslWeapon_Gun.*dfb18e05e6 // None // @ game+0x56006cc
	void *e3078ac333(); // Function TslGame.TslWeapon_Gun.*e3078ac333 // None // @ game+0x5610198
	void *dbcf469757(); // Function TslGame.TslWeapon_Gun.*dbcf469757 // None // @ game+0x5604780
	void *7b810e1014(); // Function TslGame.TslWeapon_Gun.*7b810e1014 // None // @ game+0x6fb180
	void *13909e8741(); // Function TslGame.TslWeapon_Gun.*13909e8741 // None // @ game+0x55bbedc
	void *fca772fdb3(); // Function TslGame.TslWeapon_Gun.*fca772fdb3 // None // @ game+0x56006f4
	void *e0d752cc0f(); // Function TslGame.TslWeapon_Gun.*e0d752cc0f // None // @ game+0xac15d0
	void *6c302122d1(); // Function TslGame.TslWeapon_Gun.*6c302122d1 // None // @ game+0x560bbbc
	uint32 *8816c72958(struct F*5ff16d229c Param1); // Function TslGame.TslWeapon_Gun.*8816c72958 // None // @ game+0x561c7dc
	void *df3b281adc(); // Function TslGame.TslWeapon_Gun.*df3b281adc // None // @ game+0x5623670
	void *2b04054063(); // Function TslGame.TslWeapon_Gun.*2b04054063 // None // @ game+0x5607224
	void *62a2805823(); // Function TslGame.TslWeapon_Gun.*62a2805823 // None // @ game+0x560d7e4
	void *14907961bd(); // Function TslGame.TslWeapon_Gun.*14907961bd // None // @ game+0x56006b8
	void OnRep_FiringModeIndex(); // Function TslGame.TslWeapon_Gun.OnRep_FiringModeIndex // None // @ game+0x7ab564
	void OnRep_CurrentZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentZeroLevel // None // @ game+0x5616e08
	void *c330b37b02(); // Function TslGame.TslWeapon_Gun.*c330b37b02 // None // @ game+0x560b61c
	void OnGameUserSettingApplied(); // Function TslGame.TslWeapon_Gun.OnGameUserSettingApplied // None // @ game+0x5615788
	void *5f414c349a(); // Function TslGame.TslWeapon_Gun.*5f414c349a // None // @ game+0x56001cc
	void OnRep_CurrentCantedZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentCantedZeroLevel // None // @ game+0x5616d78
	void *0b55220f54(); // Function TslGame.TslWeapon_Gun.*0b55220f54 // None // @ game+0x560ba80
	struct TArray<bool> *4eec5e67c0(); // Function TslGame.TslWeapon_Gun.*4eec5e67c0 // None // @ game+0x5626a1c
	void *129bd82b0f(); // Function TslGame.TslWeapon_Gun.*129bd82b0f // None // @ game+0xbfa698
	void *35ed504bf5(); // Function TslGame.TslWeapon_Gun.*35ed504bf5 // None // @ game+0x560d8a8
	void *25f18f4409(); // Function TslGame.TslWeapon_Gun.*25f18f4409 // None // @ game+0x560bbdc
	struct USkeletalMeshComponent* *393e1d26d7(); // Function TslGame.TslWeapon_Gun.*393e1d26d7 // None // @ game+0x55f3a88
	void *e67c19557c(); // Function TslGame.TslWeapon_Gun.*e67c19557c // None // @ game+0x560f924
	void *f624637ea6(); // Function TslGame.TslWeapon_Gun.*f624637ea6 // None // @ game+0x560b0f0
	void *598c9973c6(); // Function TslGame.TslWeapon_Gun.*598c9973c6 // None // @ game+0x560ba1c
	void *5e6fcef5e4(); // Function TslGame.TslWeapon_Gun.*5e6fcef5e4 // None // @ game+0x56001cc
	void *40a96b2766(); // Function TslGame.TslWeapon_Gun.*40a96b2766 // None // @ game+0x560f8f4
	void *7484e185ed(); // Function TslGame.TslWeapon_Gun.*7484e185ed // None // @ game+0x560e2a8
	void *8bd011ab27(); // Function TslGame.TslWeapon_Gun.*8bd011ab27 // None // @ game+0x560c0c4
	void *8320442aa8(); // Function TslGame.TslWeapon_Gun.*8320442aa8 // None // @ game+0x560c490
	void *35451f816e(); // Function TslGame.TslWeapon_Gun.*35451f816e // None // @ game+0x6fd8b8
	void *6c14d99f00(); // Function TslGame.TslWeapon_Gun.*6c14d99f00 // None // @ game+0x560ccbc
	void *09ace472f0(); // Function TslGame.TslWeapon_Gun.*09ace472f0 // None // @ game+0x55bf278
	void *ce01855a38(); // Function TslGame.TslWeapon_Gun.*ce01855a38 // None // @ game+0x56273cc
	void *f721879a8b(); // Function TslGame.TslWeapon_Gun.*f721879a8b // None // @ game+0x5612fe0
	void *44b1af90ce(); // Function TslGame.TslWeapon_Gun.*44b1af90ce // None // @ game+0x560f8d0
	void *f7c44a6a47(); // Function TslGame.TslWeapon_Gun.*f7c44a6a47 // None // @ game+0x5613020
	void *23b49fdaf1(); // Function TslGame.TslWeapon_Gun.*23b49fdaf1 // None // @ game+0x560079c
	void *9571e10fa6(); // Function TslGame.TslWeapon_Gun.*9571e10fa6 // None // @ game+0x56219e8
	void *e33b09c09d(); // Function TslGame.TslWeapon_Gun.*e33b09c09d // None // @ game+0x560b514
