// BlueprintGeneratedClass BP_MasteryPose_Mannequins.BP_MasteryPose_Mannequins_C
// Size: 0x488 (Inherited: 0x440)
struct ABP_MasteryPose_Mannequins_C : ABP_MasteryPose_C {
	struct UAsyncStaticMeshComponent* PlayerCardMannequin2; // 0x440(0x08)
	struct UAsyncStaticMeshComponent* PlayerCardMannequin1; // 0x448(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Back2; // 0x450(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Back1; // 0x458(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Front2; // 0x460(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Front1; // 0x468(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x470(0x08)
	struct USpotLightComponent* LobbySpotLight; // 0x478(0x08)
	struct USpotLightComponent* spotlight; // 0x480(0x08)
};

