// WidgetBlueprintGeneratedClass KeyboardWidgetBP.KeyboardWidgetBP_C
// Size: 0x7d8 (Inherited: 0x488)
struct UKeyboardWidgetBP_C : U*02ed43dafb {
	struct F*73a77c28fa UberGraphFrame; // 0x488(0x08)
	struct UImage* EmptyKey01; // 0x490(0x08)
	struct UImage* EmptyKey02; // 0x498(0x08)
	struct UImage* EmptyKey03; // 0x4a0(0x08)
	struct UKeyWidgetBP_C* Key_Char_1; // 0x4a8(0x08)
	struct UKeyWidgetBP_C* Key_Char_2; // 0x4b0(0x08)
	struct UKeyWidgetBP_C* Key_Char_3; // 0x4b8(0x08)
	struct UKeyWidgetBP_C* Key_Char_4; // 0x4c0(0x08)
	struct UKeyWidgetBP_C* Key_Char_5; // 0x4c8(0x08)
	struct UKeyWidgetBP_C* Key_Char_6; // 0x4d0(0x08)
	struct UKeyWidgetBP_C* Key_Char_7; // 0x4d8(0x08)
	struct UKeyWidgetBP_C* Key_Char_8; // 0x4e0(0x08)
	struct UKeyWidgetBP_C* Key_Char_9; // 0x4e8(0x08)
	struct UKeyWidgetBP_C* Key_Char_10; // 0x4f0(0x08)
	struct UKeyWidgetBP_C* Key_Char_A; // 0x4f8(0x08)
	struct UKeyWidgetBP_C* Key_Char_Apostrophe; // 0x500(0x08)
	struct UKeyWidgetBP_C* Key_Char_B; // 0x508(0x08)
	struct UKeyWidgetBP_C* Key_Char_Backslash; // 0x510(0x08)
	struct UKeyWidgetBP_C* Key_Char_C; // 0x518(0x08)
	struct UKeyWidgetBP_C* Key_Char_Comma; // 0x520(0x08)
	struct UKeyWidgetBP_C* Key_Char_D; // 0x528(0x08)
	struct UKeyWidgetBP_C* Key_Char_E; // 0x530(0x08)
	struct UKeyWidgetBP_C* Key_Char_Equal; // 0x538(0x08)
	struct UKeyWidgetBP_C* Key_Char_F; // 0x540(0x08)
	struct UKeyWidgetBP_C* Key_Char_FullStop; // 0x548(0x08)
	struct UKeyWidgetBP_C* Key_Char_G; // 0x550(0x08)
	struct UKeyWidgetBP_C* Key_Char_H; // 0x558(0x08)
	struct UKeyWidgetBP_C* Key_Char_Hyphen; // 0x560(0x08)
	struct UKeyWidgetBP_C* Key_Char_I; // 0x568(0x08)
	struct UKeyWidgetBP_C* Key_Char_J; // 0x570(0x08)
	struct UKeyWidgetBP_C* Key_Char_K; // 0x578(0x08)
	struct UKeyWidgetBP_C* Key_Char_L; // 0x580(0x08)
	struct UKeyWidgetBP_C* Key_Char_M; // 0x588(0x08)
	struct UKeyWidgetBP_C* Key_Char_N; // 0x590(0x08)
	struct UKeyWidgetBP_C* Key_Char_O; // 0x598(0x08)
	struct UKeyWidgetBP_C* Key_Char_P; // 0x5a0(0x08)
	struct UKeyWidgetBP_C* Key_Char_Q; // 0x5a8(0x08)
	struct UKeyWidgetBP_C* Key_Char_R; // 0x5b0(0x08)
	struct UKeyWidgetBP_C* Key_Char_S; // 0x5b8(0x08)
	struct UKeyWidgetBP_C* Key_Char_Semicolon; // 0x5c0(0x08)
	struct UKeyWidgetBP_C* Key_Char_Slash; // 0x5c8(0x08)
	struct UKeyWidgetBP_C* Key_Char_Spacebar; // 0x5d0(0x08)
	struct UKeyWidgetBP_C* Key_Char_SquareBracketInside; // 0x5d8(0x08)
	struct UKeyWidgetBP_C* Key_Char_SquareBracketOutside; // 0x5e0(0x08)
	struct UKeyWidgetBP_C* Key_Char_T; // 0x5e8(0x08)
	struct UKeyWidgetBP_C* Key_Char_Tilde; // 0x5f0(0x08)
	struct UKeyWidgetBP_C* Key_Char_U; // 0x5f8(0x08)
	struct UKeyWidgetBP_C* Key_Char_V; // 0x600(0x08)
	struct UKeyWidgetBP_C* Key_Char_W; // 0x608(0x08)
	struct UKeyWidgetBP_C* Key_Char_X; // 0x610(0x08)
	struct UKeyWidgetBP_C* Key_Char_Y; // 0x618(0x08)
	struct UKeyWidgetBP_C* Key_Char_Z; // 0x620(0x08)
	struct UKeyWidgetBP_C* Key_Edit_BackSpace; // 0x628(0x08)
	struct UKeyWidgetBP_C* Key_Edit_Del; // 0x630(0x08)
	struct UKeyWidgetBP_C* Key_Edit_Enter; // 0x638(0x08)
	struct UKeyWidgetBP_C* Key_Edit_Ins; // 0x640(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F1; // 0x648(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F10; // 0x650(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F11; // 0x658(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F12; // 0x660(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F2; // 0x668(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F3; // 0x670(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F4; // 0x678(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F5; // 0x680(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F6; // 0x688(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F7; // 0x690(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F8; // 0x698(0x08)
	struct UKeyWidgetBP_C* Key_Fun_F9; // 0x6a0(0x08)
	struct UKeyWidgetBP_C* Key_Lock_CapsLk; // 0x6a8(0x08)
	struct UKeyWidgetBP_C* Key_Lock_NumLk; // 0x6b0(0x08)
	struct UKeyWidgetBP_C* Key_Lock_ScrLk; // 0x6b8(0x08)
	struct UKeyWidgetBP_C* Key_Mod_LAlt; // 0x6c0(0x08)
	struct UKeyWidgetBP_C* Key_Mod_LCtrl; // 0x6c8(0x08)
	struct UKeyWidgetBP_C* Key_Mod_LShift; // 0x6d0(0x08)
	struct UKeyWidgetBP_C* Key_Mod_RAlt; // 0x6d8(0x08)
	struct UKeyWidgetBP_C* Key_Mod_RCtrl; // 0x6e0(0x08)
	struct UKeyWidgetBP_C* Key_Mod_RShift; // 0x6e8(0x08)
	struct UKeyWidgetBP_C* Key_Nav_Down; // 0x6f0(0x08)
	struct UKeyWidgetBP_C* Key_Nav_End; // 0x6f8(0x08)
	struct UKeyWidgetBP_C* Key_Nav_Home; // 0x700(0x08)
	struct UKeyWidgetBP_C* Key_Nav_Left; // 0x708(0x08)
	struct UKeyWidgetBP_C* Key_Nav_PageDown; // 0x710(0x08)
	struct UKeyWidgetBP_C* Key_Nav_PageUp; // 0x718(0x08)
	struct UKeyWidgetBP_C* Key_Nav_Right; // 0x720(0x08)
	struct UKeyWidgetBP_C* Key_Nav_Tab; // 0x728(0x08)
	struct UKeyWidgetBP_C* Key_Nav_Up; // 0x730(0x08)
	struct UKeyWidgetBP_C* Key_Num_1; // 0x738(0x08)
	struct UKeyWidgetBP_C* Key_Num_2; // 0x740(0x08)
	struct UKeyWidgetBP_C* Key_Num_3; // 0x748(0x08)
	struct UKeyWidgetBP_C* Key_Num_4; // 0x750(0x08)
	struct UKeyWidgetBP_C* Key_Num_5; // 0x758(0x08)
	struct UKeyWidgetBP_C* Key_Num_6; // 0x760(0x08)
	struct UKeyWidgetBP_C* Key_Num_7; // 0x768(0x08)
	struct UKeyWidgetBP_C* Key_Num_8; // 0x770(0x08)
	struct UKeyWidgetBP_C* Key_Num_9; // 0x778(0x08)
	struct UKeyWidgetBP_C* Key_Num_10; // 0x780(0x08)
	struct UKeyWidgetBP_C* Key_Num_Asterisk; // 0x788(0x08)
	struct UKeyWidgetBP_C* Key_Num_Enter; // 0x790(0x08)
	struct UKeyWidgetBP_C* Key_Num_Hyphen; // 0x798(0x08)
	struct UKeyWidgetBP_C* Key_Num_Plus; // 0x7a0(0x08)
	struct UKeyWidgetBP_C* Key_Num_Point; // 0x7a8(0x08)
	struct UKeyWidgetBP_C* Key_Num_Slash; // 0x7b0(0x08)
	struct UKeyWidgetBP_C* Key_Sys_Esc; // 0x7b8(0x08)
	struct UKeyWidgetBP_C* Key_Sys_Pause; // 0x7c0(0x08)
	struct UKeyWidgetBP_C* Key_Sys_PrtScr; // 0x7c8(0x08)
	struct UImage* KeyBoardBG; // 0x7d0(0x08)

	void ExecuteUbergraph_KeyboardWidgetBP(); // Function KeyboardWidgetBP.KeyboardWidgetBP_C.ExecuteUbergraph_KeyboardWidgetBP //  // @ game+0x1e037c
};

