// ScriptStruct RoadRuntime.*f06a718bf9
// Size: 0x20 (Inherited: 0x00)
struct F*f06a718bf9 {
	struct UStaticMesh* Prototype; // 0x00(0x08)
	struct AActor* Owner; // 0x08(0x08)
	struct UStaticMeshComponent* SideMesh; // 0x10(0x08)
	int32 *cc9579a5ff; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*5308e57ec9
// Size: 0x18 (Inherited: 0x00)
struct F*5308e57ec9 {
	struct UClass* Prototype; // 0x00(0x08)
	struct AActor* *f06e406e2b; // 0x08(0x08)
	int32 *cc9579a5ff; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct RoadRuntime.*b576a86630
// Size: 0x20 (Inherited: 0x00)
struct F*b576a86630 {
	struct UStaticMesh* Prototype; // 0x00(0x08)
	struct AActor* Owner; // 0x08(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* *030df6ead4; // 0x10(0x08)
	int32 *cc9579a5ff; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*4f488eada4
// Size: 0x88 (Inherited: 0x00)
struct F*4f488eada4 {
	struct AActor* Owner; // 0x00(0x08)
	struct UStaticMesh* Prototype; // 0x08(0x08)
	struct UStaticMesh* *11bf10e6e5; // 0x10(0x08)
	struct UStaticMesh* *cbaf9eaff4; // 0x18(0x08)
	struct TArray<struct USplineMeshComponent*> *3917dedecc; // 0x20(0x10)
	struct USplineComponent* Spline; // 0x30(0x08)
	int32 *489d7d8dd0; // 0x38(0x04)
	int32 *cc9579a5ff; // 0x3c(0x04)
	int32 *e03060c706; // 0x40(0x04)
	int32 *d4bcfd5cbf; // 0x44(0x04)
	struct FVector Offset; // 0x48(0x0c)
	struct FVector Scale; // 0x54(0x0c)
	bool *ffeb5f9def; // 0x60(0x01)
	bool StartEnable; // 0x61(0x01)
	bool EndEnable; // 0x62(0x01)
	char pad_63[0x5]; // 0x63(0x05)
	struct FInterpCurveVector *f9cf80380d; // 0x68(0x18)
	float *3ddec08ed9; // 0x80(0x04)
	float *a21fcde602; // 0x84(0x04)
};

// ScriptStruct RoadRuntime.*5ae9ae3aeb
// Size: 0x20 (Inherited: 0x00)
struct F*5ae9ae3aeb {
	struct UClass* Prototype; // 0x00(0x08)
	struct TArray<struct AActor*> *e1a7f3eb7b; // 0x08(0x10)
	int32 *cc9579a5ff; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*8ac9825dc6
// Size: 0x20 (Inherited: 0x00)
struct F*8ac9825dc6 {
	struct FVector Position; // 0x00(0x0c)
	struct FVector Tangent; // 0x0c(0x0c)
	float Scale; // 0x18(0x04)
	float Roll; // 0x1c(0x04)
};

