// BlueprintGeneratedClass TslCaptureLobby.TslCaptureLobby_C
// Size: 0x476 (Inherited: 0x3f8)
struct ATslCaptureLobby_C : ALevelScriptActor {
	struct F*73a77c28fa UberGraphFrame; // 0x3f8(0x08)
	struct ALobbyViewMode_C* ViewModeStudio; // 0x400(0x08)
	struct ATslWeapon* TslWeapon; // 0x408(0x08)
	struct FTransform UiCameraTM; // 0x410(0x30)
	struct FTransform ViewModeTM; // 0x440(0x30)
	bool bLeft; // 0x470(0x01)
	bool bright; // 0x471(0x01)
	bool bUp; // 0x472(0x01)
	bool bDown; // 0x473(0x01)
	bool AddView; // 0x474(0x01)
	bool MinusView; // 0x475(0x01)

	void InpActEvt_Backslash_*081c3f41d2_26(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Backslash_*081c3f41d2_26 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Left_*081c3f41d2_25(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*081c3f41d2_25 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Left_*081c3f41d2_24(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*081c3f41d2_24 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Right_*081c3f41d2_23(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*081c3f41d2_23 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Right_*081c3f41d2_22(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*081c3f41d2_22 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Up_*081c3f41d2_21(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*081c3f41d2_21 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Up_*081c3f41d2_20(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*081c3f41d2_20 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Down_*081c3f41d2_19(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*081c3f41d2_19 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_Down_*081c3f41d2_18(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*081c3f41d2_18 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_LeftBracket_*081c3f41d2_17(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*081c3f41d2_17 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_LeftBracket_*081c3f41d2_16(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*081c3f41d2_16 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_RightBracket_*081c3f41d2_15(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*081c3f41d2_15 // BlueprintEvent // @ game+0x1e037c
	void InpActEvt_RightBracket_*081c3f41d2_14(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*081c3f41d2_14 // BlueprintEvent // @ game+0x1e037c
	void ReceiveTick(); // Function TslCaptureLobby.TslCaptureLobby_C.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool ExecuteUbergraph_TslCaptureLobby(int32 EntryPoint, struct FKey ___struct_Variable, struct FKey _081c3f41d2_Key9, struct FKey _081c3f41d2_Key8, struct FKey _081c3f41d2_Key, struct FKey _081c3f41d2_Key12, struct U*3af93f9c2e* CallFunc_GetWeaponMesh_ReturnValue, struct FTransform CallFunc__b1a1a6f5cd_ReturnValue, struct FRotator CallFunc_BreakTransform_Rotation, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Yaw, struct FHitResult CallFunc_K2_SetRelativeTransform_SweepHitResult, struct UViewModeWidget_C* CallFunc_Create_ReturnValue, struct AActor* CallFunc__f0ce07f5a2_ReturnValue, struct AWeapKar98k_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_BooleanAND_ReturnValue2, bool CallFunc_BooleanAND_ReturnValue4, float CallFunc__abc2022f64_ReturnValue2, float CallFunc__ae60dcbe74_ReturnValue, float CallFunc__abc2022f64_ReturnValue5, float CallFunc__ae60dcbe74_ReturnValue5); // Function TslCaptureLobby.TslCaptureLobby_C.ExecuteUbergraph_TslCaptureLobby // HasDefaults // @ game+0x1e037c
};

