// BlueprintGeneratedClass TslWorldMarkerManager_BP.TslWorldMarkerManager_BP_C
// Size: 0x4f0 (Inherited: 0x4f0)
struct ATslWorldMarkerManager_BP_C : ATslWorldMarkerManager {
	int32 ReservedQueueSize; // 0x458(0x04)
	struct UClass* WidgetClass; // 0x460(0x08)
	struct UClass* WidgetComponent; // 0x468(0x08)
	struct UCurveFloat* WidgetScalingCurve; // 0x470(0x08)
	struct UCurveFloat* WidgetOpacityCurve; // 0x478(0x08)
	struct UAkAudioEvent* *be94cb853e; // 0x480(0x08)
	struct UAkComponent* AkComponent; // 0x488(0x08)
	float *84c0436201; // 0x490(0x04)
	int32 *756750a02e; // 0x494(0x04)

	void *8d72205894(struct FWorldMarker Param0); // Function TslGame.TslWorldMarkerManager.*8d72205894 // Final|Native|Public|HasOutParms // @ game+0x5636020
	void *46e72b734e(); // Function TslGame.TslWorldMarkerManager.*46e72b734e // Final|Native|Public|HasOutParms|HasDefaults // @ game+0x5621abc
	void *6d64c1d5fe(); // Function TslGame.TslWorldMarkerManager.*6d64c1d5fe // Final|Native|Public|HasOutParms // @ game+0x5621b60
	void *5059ff9581(); // Function TslGame.TslWorldMarkerManager.*5059ff9581 // Final|Native|Public|HasOutParms // @ game+0x56219f4
	void *63056c29b2(); // Function TslGame.TslWorldMarkerManager.*63056c29b2 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x561ce00
	void *2a1e83ff0c(); // Function TslGame.TslWorldMarkerManager.*2a1e83ff0c // Final|Native|Public|HasOutParms // @ game+0x5608260
};

