// BlueprintGeneratedClass Vantage_Wheel_Punctured.Vantage_Wheel_Punctured_C
// Size: 0x3a0 (Inherited: 0x3a0)
struct UVantage_Wheel_Punctured_C : UVantage_Wheel_C {
	float Health; // 0x188(0x04)
	float HealthMax; // 0x18c(0x04)
	struct FName *87cbc973ec; // 0x190(0x08)
	bool *6eb8d805ee; // 0x198(0x01)
	int32 *fc275bb023; // 0x19c(0x04)
	float *e7becef431; // 0x1a0(0x04)
	struct F*f9bd3294cf *c319d935ed; // 0x1a8(0x50)
	float *0e78ef172e; // 0x1f8(0x04)
	float *753f49cb01; // 0x1fc(0x04)
	float *8ce0c2d011; // 0x200(0x04)
	bool *83ad5fa4a4; // 0x204(0x01)
	struct U*d55dde9e42* *f603689588; // 0x208(0x08)
	struct FVector *1327d5d1bf; // 0x210(0x0c)
	struct U*850273cd44* *5b921683e6; // 0x220(0x08)
	struct UClass* *fa84278130; // 0x228(0x08)
	struct UClass* *4744467910; // 0x230(0x08)
	float *487f903bcb; // 0x238(0x04)
	struct UAkAudioEvent* *1cca14fb6b; // 0x240(0x08)
	struct FVector *d122c6cdf4; // 0x248(0x0c)
	int32 *5fe5902c57; // 0x254(0x04)
	enum class EPhysicalSurface *0767c8721d; // 0x258(0x01)
	bool *e7def1514b; // 0x259(0x01)
	float *b5b820c6f5; // 0x25c(0x04)
	bool *ff2da1dae7; // 0x260(0x01)
	struct U*edaa8277d4* *c64838f599; // 0x268(0x08)
	bool bApplyForceOnPuncture; // 0x27c(0x01)
	bool *9e6d46f039; // 0x27d(0x01)
	float *527ca91a4f; // 0x280(0x04)
	float *43c6ec2b8a; // 0x284(0x04)
	struct ATslParticle* *930e66eb7e; // 0x290(0x08)
	struct ATslParticle* *4f95ca3862; // 0x298(0x08)
	struct ATslParticle* *596431f2ba; // 0x2a0(0x08)
	struct ATslParticle* *bd2a615c61; // 0x2a8(0x08)
	struct UAkComponent* *130b1c531b; // 0x2b8(0x08)
	float *b2fcea1a65; // 0x2c0(0x04)
	float *b3e55bf24f; // 0x300(0x04)
	float Slip; // 0x304(0x04)
	bool *68551cdae0; // 0x308(0x01)
	bool *160e255665; // 0x309(0x01)
	bool *3bd3265669; // 0x30a(0x01)
	bool *fb601151d0; // 0x30b(0x01)
	struct F*265a4748f6 *265a4748f6; // 0x30c(0x10)
};

