// WidgetBlueprintGeneratedClass W_RecoilInfoRow.W_RecoilInfoRow_C
// Size: 0x2cc (Inherited: 0x250)
struct UW_RecoilInfoRow_C : UUserWidget {
	struct F*73a77c28fa UberGraphFrame; // 0x250(0x08)
	struct UImage* Image_1; // 0x258(0x08)
	struct UTextBlock* TextBlock_ID; // 0x260(0x08)
	struct UTextBlock* TextBlock_RDH; // 0x268(0x08)
	struct UTextBlock* TextBlock_RDV; // 0x270(0x08)
	struct UTextBlock* TextBlock_RH; // 0x278(0x08)
	struct UTextBlock* TextBlock_RRV; // 0x280(0x08)
	struct UTextBlock* TextBlock_RTH; // 0x288(0x08)
	struct UTextBlock* TextBlock_RTV; // 0x290(0x08)
	struct UTextBlock* TextBlock_RV; // 0x298(0x08)
	struct UTextBlock* TextBlock_RVal; // 0x2a0(0x08)
	int32 ID; // 0x2a8(0x04)
	float RVal; // 0x2ac(0x04)
	float RV; // 0x2b0(0x04)
	float RH; // 0x2b4(0x04)
	float RTV; // 0x2b8(0x04)
	float RTH; // 0x2bc(0x04)
	float RRV; // 0x2c0(0x04)
	float RDV; // 0x2c4(0x04)
	float RDH; // 0x2c8(0x04)

	void Construct(); // Function W_RecoilInfoRow.W_RecoilInfoRow_C.Construct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1e037c
	int32 ExecuteUbergraph_W_RecoilInfoRow(struct FText CallFunc__ace63d1958_ReturnValue, struct FText CallFunc__ace63d1958_ReturnValue2, struct FText CallFunc__ace63d1958_ReturnValue4, struct FText CallFunc__ace63d1958_ReturnValue6); // Function W_RecoilInfoRow.W_RecoilInfoRow_C.ExecuteUbergraph_W_RecoilInfoRow // HasDefaults // @ game+0x1e037c
};

