// Enum ChromaSDKPlugin.EChromaSDKStreamStatusEnum
enum class EChromaSDKStreamStatusEnum : uint8 {
	READY,
	AUTHORIZING,
	BROADCASTING,
	WATCHING,
	NOT_AUTHORIZED,
	BROADCAST_DUPLICATE,
	SERVICE_OFFLINE,
	EChromaSDKStreamStatusEnum_MAX,
};

// Enum ChromaSDKPlugin.*be745e03d6
enum class *be745e03d6 : uint8 {
	*3fd155cb36,
	*2d2ecf0657,
	*18f0b7741e,
	*0a3a524680,
	*6ce590cc98,
	*b3c8eb7d41,
	*1dcf1f07d9,
	*be745e03d6_MAX,
};

// Enum ChromaSDKPlugin.*3c855455ba
enum class *3c855455ba : uint8 {
	*ba55acd11a,
	*ef70a8cc20,
	*6f2449eee2,
	*a846ccc31f,
	*95103730e4,
	*3c855455ba_MAX,
};

// Enum ChromaSDKPlugin.*dc8f94a22e
enum class *dc8f94a22e : uint8 {
	*94d9c5c965,
	*6d17210c5d,
	*e4873e49b1,
	*52f950989b,
	*f4f97047c4,
	*f0d2df4bc3,
	*66c12c0050,
	*99addc0e27,
	*dd39fc27b4,
	*2ede31c84c,
	*d9c845fa02,
	*6906a7de2d,
	*cbcefbbb7f,
	*4039c37ec0,
	*e0c766efee,
	*fd95ce2c09,
	*7ae9a54f55,
	*4c5300d117,
	*9242e18f02,
	*76c50fc7bb,
	*c51942d574,
	*4b000beec2,
	*47bac5cc75,
	*dc8f94a22e_MAX,
};

// Enum ChromaSDKPlugin.*666c1c77d1
enum class *666c1c77d1 : uint8 {
	*0a37410b76,
	*fceca3c901,
	*499a21bcee,
	*c9c4fa363f,
	*4b75271084,
	*87280722e8,
	*cc71c8cf1f,
	*205f019714,
	*41eab215cf,
	*e86ba1608e,
	*72d0ac717f,
	*c543c9306b,
	*758ec9feeb,
	*2b2bbaf944,
	*b6f97fab48,
	*0d46d4d621,
	*00a2a41a94,
	*6fa1fe568d,
	*c4cdba27c8,
	*7b8c1aa64a,
	*153a9f9e6f,
	*84935ea6a7,
	*52587be62c,
	*53e7157f57,
	*298e1b2220,
	*d51ba2f4f2,
	*a365112f9a,
	*679af3e530,
	*d7a1cc65f9,
	*a94d33fe26,
	*9011ce8c15,
	*f0b4696e5a,
	*a1e0577572,
	*903c90c5ee,
	*65e3b93ebc,
	*4af6a25de9,
	*0b3310caf1,
	*d03c4910df,
	*d34ce24da3,
	*76a7774fe9,
	*7241a3fa3a,
	*31713042bb,
	*f1778e1843,
	*7c2c58a199,
	*4a5c2a42cc,
	*bb93d58642,
	*f3db3aa73b,
	*0b09efd9c1,
	*9309029add,
	*6247080d82,
	*d084d6b61c,
	*dc4f7b7368,
	*5b322385b3,
	*bba2abaec1,
	*8f9455c104,
	*6f9d0743c0,
	*8a2634f3b2,
	*08f299ba02,
	*70752131af,
	*947c18b2c6,
	*29c009d67d,
	*2a2ee9cfaa,
	*0fe2435f9b,
	*6199a93f7c,
	*823ff7dacb,
	*47df626de5,
	*1d7e6a7d00,
	*55b0d08e51,
	*5b7a7aebd7,
	*75cd0436a3,
	*6d1037085b,
	*24301f0041,
	*1121a77e20,
	*614b9bb934,
	*561a0efa37,
	*ab32c66ee0,
	*922fd634e3,
	*65f9fc270a,
	*729e703de9,
	*1960ad5e78,
	*36fe659e65,
	*19d1db29d1,
	*715f1bf5a1,
	*d26942a299,
	*e602d35b42,
	*6d5d3c90bc,
	*5fac31a4a8,
	*f4bac04143,
	*cb7020c3cf,
	*44aa9e5be2,
	*786d7ccb68,
	*60c06c8f0d,
	*d7453f6318,
	*ddc5646273,
	*457fac5f7e,
	*7f6e1a7f0d,
	*873e599c9c,
	*06fc403065,
	*5bcb05ec3d,
	*b3b3efeeb2,
	*002a0b746a,
	*29ed612ce7,
	*227a3a3bf3,
	*f449b11907,
	*74ca67dd74,
	*339ecbeb44,
	*ab5aea0eae,
	*1c5c1ff88c,
	*0e0062b6b3,
	*3b9c9c10f1,
	*fcf464e4f6,
	*1fb16b6308,
	*262188a207,
	*379f7ded0e,
	*66448299d4,
	*e6e0c67d14,
	*d8123f44b6,
	*7ce369605e,
	*efc60ccc52,
	*cd10adecec,
	*659eac2ba5,
	*400d40fd56,
	*ef7b403c61,
	*5b4d9f3455,
	*0180654b0d,
	*b377dfc32c,
	*666c1c77d1_MAX,
};

// Enum ChromaSDKPlugin.*ba00110806
enum class *ba00110806 : uint8 {
	*c5b072f409,
	*b51abae16a,
	*ccd75abb2a,
	*24cf5a7315,
	*a302815516,
	*17e5282d42,
	*714738fc7d,
	*ba00110806_MAX,
};

// Enum ChromaSDKPlugin.*0f11d3548a
enum class *0f11d3548a : uint8 {
	*ccd75abb2a,
	*24cf5a7315,
	*a302815516,
	*714738fc7d,
	*0f11d3548a_MAX,
};

// Enum ChromaSDKPlugin.*97e6ca5dd3
enum class *97e6ca5dd3 : uint8 {
	*c5b072f409,
	*b51abae16a,
	*17e5282d42,
	*714738fc7d,
	*97e6ca5dd3_MAX,
};

// Enum ChromaSDKPlugin.*af41552025
enum class *af41552025 : uint8 {
	*c9b97653cc,
	*240317d9b0,
	*714738fc7d,
	*af41552025_MAX,
};

// ScriptStruct ChromaSDKPlugin.*9c68426cba
// Size: 0x10 (Inherited: 0x00)
struct F*9c68426cba {
	struct TArray<struct F*5e2c25115f> Effects; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*5e2c25115f
// Size: 0x38 (Inherited: 0x00)
struct F*5e2c25115f {
	struct FString Animation; // 0x00(0x10)
	bool State; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 PrimaryColor; // 0x14(0x04)
	int32 SecondaryColor; // 0x18(0x04)
	int32 Speed; // 0x1c(0x04)
	enum class *3c855455ba Blend; // 0x20(0x01)
	enum class *be745e03d6 Mode; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct F*2bd7e21715 FrameIndex; // 0x28(0x10)
};

// ScriptStruct ChromaSDKPlugin.*2bd7e21715
// Size: 0x10 (Inherited: 0x00)
struct F*2bd7e21715 {
	struct TArray<int32> *35709d6aeb; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*92624a97c3
// Size: 0x48 (Inherited: 0x00)
struct F*92624a97c3 {
	struct FString Title; // 0x00(0x10)
	struct FString Description; // 0x10(0x10)
	struct FString *e42ece0741; // 0x20(0x10)
	struct FString *75860760c0; // 0x30(0x10)
	int32 *37e46a5c02; // 0x40(0x04)
	int32 Category; // 0x44(0x04)
};

// ScriptStruct ChromaSDKPlugin.*441baf12ca
// Size: 0x18 (Inherited: 0x00)
struct F*441baf12ca {
	struct TArray<struct F*3a538f84e2> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*3a538f84e2
// Size: 0x10 (Inherited: 0x00)
struct F*3a538f84e2 {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*190dc3b563
// Size: 0x18 (Inherited: 0x00)
struct F*190dc3b563 {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*8bd6676f6b
// Size: 0x14 (Inherited: 0x00)
struct F*8bd6676f6b {
	int32 Result; // 0x00(0x04)
	struct F*63cb229e15 EffectId; // 0x04(0x10)
};

// ScriptStruct ChromaSDKPlugin.*63cb229e15
// Size: 0x10 (Inherited: 0x00)
struct F*63cb229e15 {
	char pad_0[0x10]; // 0x00(0x10)
};

