// Enum Slate.ETextFlowDirection
enum class ETextFlowDirection : uint8 {
	None,
	None,
};

// Enum Slate.*091373b171
enum class *091373b171 : uint8 {
	None,
	None,
};

// Enum Slate.ETextJustify
enum class ETextJustify : uint8 {
	None,
};

// Enum Slate.ETableViewMode
enum class ETableViewMode : uint8 {
	None,
};

// Enum Slate.ESelectionMode
enum class ESelectionMode : uint8 {
	None,
};

// Enum Slate.EStretch
enum class EStretch : uint8 {
	None,
};

// Enum Slate.EStretchDirection
enum class EStretchDirection : uint8 {
	None,
};

// Enum Slate.EProgressBarFillType
enum class EProgressBarFillType : uint8 {
	None,
};

// ScriptStruct Slate.*4396e9090b
// Size: 0x20 (Inherited: 0x00)
struct F*4396e9090b {
	struct FKey Key; // 0x00(0x18)
	char bShift : 1; // 0x18(0x01)
	char bCtrl : 1; // 0x18(0x01)
	char bAlt : 1; // 0x18(0x01)
	char bCmd : 1; // 0x18(0x01)
	char pad_18_4 : 4; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct Slate.Anchors
// Size: 0x10 (Inherited: 0x00)
struct FAnchors {
	struct FVector2D Minimum; // 0x00(0x08)
	struct FVector2D Maximum; // 0x08(0x08)
};

