// BlueprintGeneratedClass BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C
// Size: 0x498 (Inherited: 0x458)
struct ABP_MasteryPose_FlareArmBend_C : ABP_MasteryPose_C {
	struct F*73a77c28fa UberGraphFrame; // 0x458(0x08)
	struct UPointLightComponent* PointLight1; // 0x460(0x08)
	struct USpotLightComponent* LobbySpotLight; // 0x468(0x08)
	struct USpotLightComponent* spotlight; // 0x470(0x08)
	struct UPointLightComponent* PointLight; // 0x478(0x08)
	struct UParticleSystemComponent* ParticleSystemPlayerCard; // 0x480(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x488(0x08)
	struct USkeletalMeshComponent* FlareMesh; // 0x490(0x08)

	void UserConstructionScript(); // Function BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x22ddc4
	struct ACharacter* AttachObjects(); // Function BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C.AttachObjects // Public|BlueprintCallable|BlueprintEvent // @ game+0x22ddc4
	int32 ExecuteUbergraph_BP_MasteryPose_FlareArmBend(); // Function BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C.ExecuteUbergraph_BP_MasteryPose_FlareArmBend // HasDefaults // @ game+0x22ddc4
};

