// Class ClothingSystemRuntime.*5ed7fe2be7
// Size: 0x30 (Inherited: 0x30)
struct U*5ed7fe2be7 : UObject {
};

// Class ClothingSystemRuntime.ClothingAsset
// Size: 0x160 (Inherited: 0x50)
struct UClothingAsset : U*9695c7a28c {
	struct F*edc1a71729 *edc1a71729; // 0x50(0xbc)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct TArray<struct F*c79c15f315> *6f651a8a78; // 0x110(0x10)
	struct TArray<int32> *d0f8878831; // 0x120(0x10)
	struct TArray<struct FName> *ba34fee0dc; // 0x130(0x10)
	struct TArray<int32> *7994b28604; // 0x140(0x10)
	int32 *98892b785e; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct U*5ed7fe2be7* CustomData; // 0x158(0x08)
};

// Class ClothingSystemRuntime.*07d5681c88
// Size: 0x30 (Inherited: 0x30)
struct U*07d5681c88 : U*b14b3c8b7b {
};

