// Class Slate.*f4f189a61b
// Size: 0x2e0 (Inherited: 0x38)
struct U*f4f189a61b : USlateWidgetStyleContainerBase {
	struct F*d5cdd95f37 ButtonStyle; // 0x38(0x2a8)
};

// Class Slate.*2eacb0ec55
// Size: 0x618 (Inherited: 0x38)
struct U*2eacb0ec55 : USlateWidgetStyleContainerBase {
	struct F*ea1c6f5c2e *ea1c6f5c2e; // 0x38(0x5e0)
};

// Class Slate.*806eb9bb65
// Size: 0x460 (Inherited: 0x38)
struct U*806eb9bb65 : USlateWidgetStyleContainerBase {
	struct F*8032c74862 *8032c74862; // 0x38(0x428)
};

// Class Slate.*e775e31bcf
// Size: 0x418 (Inherited: 0x38)
struct U*e775e31bcf : USlateWidgetStyleContainerBase {
	struct F*735b523b98 *735b523b98; // 0x38(0x3e0)
};

// Class Slate.*8a189fcc96
// Size: 0x8a8 (Inherited: 0x38)
struct U*8a189fcc96 : USlateWidgetStyleContainerBase {
	struct F*66dc9af89d *66dc9af89d; // 0x38(0x870)
};

// Class Slate.*3c9d9c1110
// Size: 0x280 (Inherited: 0x38)
struct U*3c9d9c1110 : USlateWidgetStyleContainerBase {
	struct F*1655c7f388 *1655c7f388; // 0x38(0x248)
};

// Class Slate.*804794639b
// Size: 0x1f0 (Inherited: 0x38)
struct U*804794639b : USlateWidgetStyleContainerBase {
	struct F*4153f21470 ProgressBarStyle; // 0x38(0x1b8)
};

// Class Slate.*ad0f5e3e39
// Size: 0x550 (Inherited: 0x38)
struct U*ad0f5e3e39 : USlateWidgetStyleContainerBase {
	struct F*136abc3336 *136abc3336; // 0x38(0x518)
};

// Class Slate.*d86c2575d0
// Size: 0x280 (Inherited: 0x38)
struct U*d86c2575d0 : USlateWidgetStyleContainerBase {
	struct F*22ad09d4a5 *22ad09d4a5; // 0x38(0x248)
};

// Class Slate.SlateSettings
// Size: 0x38 (Inherited: 0x30)
struct USlateSettings : UObject {
	bool bVirtualKeyboardSendsTextChanged; // 0x30(0x01)
	bool bVirtualKeyboardDisplayOnFocus; // 0x31(0x01)
	bool bExplicitCanvasChildZOrder; // 0x32(0x01)
	char pad_33[0x5]; // 0x33(0x05)
};

// Class Slate.*203c966a4d
// Size: 0x348 (Inherited: 0x38)
struct U*203c966a4d : USlateWidgetStyleContainerBase {
	struct F*b5d3bae02e *b5d3bae02e; // 0x38(0x310)
};

// Class Slate.*d72e22fc8f
// Size: 0x240 (Inherited: 0x38)
struct U*d72e22fc8f : USlateWidgetStyleContainerBase {
	struct F*37ba76b02f *37ba76b02f; // 0x38(0x208)
};

