// WidgetBlueprintGeneratedClass UI_OutGameKillFeedSkinPreviewWidget.UI_OutGameKillFeedSkinPreviewWidget_C
// Size: 0x330 (Inherited: 0x2a0)
struct UUI_OutGameKillFeedSkinPreviewWidget_C : U*3cdbfa656d {
	struct F*73a77c28fa UberGraphFrame; // 0x2a0(0x08)
	struct U*6b11b3bf02* EffectEmerge02_70; // 0x2a8(0x08)
	struct U*6b11b3bf02* EffectEmerge01_69; // 0x2b0(0x08)
	struct U*6b11b3bf02* EffectEmerge00; // 0x2b8(0x08)
	struct U*6b11b3bf02* Vanish; // 0x2c0(0x08)
	struct U*6b11b3bf02* Emerge; // 0x2c8(0x08)
	struct UImage* ConditionImage; // 0x2d0(0x08)
	struct USizeBox* ConditionSizeBox; // 0x2d8(0x08)
	struct UImage* EffectEmerge01_Effect01; // 0x2e0(0x08)
	struct UImage* EffectEmerge01_Effect02; // 0x2e8(0x08)
	struct UImage* EffectEmerge01_Effect03; // 0x2f0(0x08)
	struct UImage* HeadShotImage; // 0x2f8(0x08)
	struct USizeBox* HeadShotSizeBox; // 0x300(0x08)
	struct UUserPlatformImageWidget_C* KillerPlatformImage; // 0x308(0x08)
	struct UUserPlatformImageWidget_C* VictimPlatformImage; // 0x310(0x08)
	struct USizeBox* VictimPlatformSizeBox; // 0x318(0x08)
	struct UImage* WeaponMasteryImage; // 0x320(0x08)
	struct USizeBox* WeaponMasterySizeBox; // 0x328(0x08)

	void Construct(); // Function UI_OutGameKillFeedSkinPreviewWidget.UI_OutGameKillFeedSkinPreviewWidget_C.Construct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x22ddc4
	struct TArray<struct UImage*> ExecuteUbergraph_UI_OutGameKillFeedSkinPreviewWidget(); // Function UI_OutGameKillFeedSkinPreviewWidget.UI_OutGameKillFeedSkinPreviewWidget_C.ExecuteUbergraph_UI_OutGameKillFeedSkinPreviewWidget //  // @ game+0x22ddc4
};

