// WidgetBlueprintGeneratedClass UI_TeamManagementInfo.UI_TeamManagementInfo_C
// Size: 0xbc8 (Inherited: 0xb10)
struct UUI_TeamManagementInfo_C : U*4adb4fcce5 {
	struct U*6b11b3bf02* OnSpeak; // 0xb10(0x08)
	struct U*6b11b3bf02* GuideDimmed; // 0xb18(0x08)
	struct U*6b11b3bf02* GuideRankedMode; // 0xb20(0x08)
	struct U*6b11b3bf02* GuideConsoleFocus; // 0xb28(0x08)
	struct U*6b11b3bf02* GuideConsoleNormal; // 0xb30(0x08)
	struct U*6b11b3bf02* GuidePCHover; // 0xb38(0x08)
	struct U*6b11b3bf02* GuidePCNormalMySelf; // 0xb40(0x08)
	struct U*6b11b3bf02* GuidePCNormalOthers; // 0xb48(0x08)
	struct UWidgetSwitcher* AudioSwitcher; // 0xb50(0x08)
	struct UImage* CoverFocusImage; // 0xb58(0x08)
	struct UImage* CoverHoverImage; // 0xb60(0x08)
	struct UImage* FocusImage; // 0xb68(0x08)
	struct UWidgetSwitcher* MicButtonSwitcher; // 0xb70(0x08)
	struct UButton* MicOffButton; // 0xb78(0x08)
	struct UButton* MicOnButton; // 0xb80(0x08)
	struct UHorizontalBox* RankedMode_HorizontalBox; // 0xb88(0x08)
	struct UButton* ReportButton; // 0xb90(0x08)
	struct UWidgetSwitcher* SpeakerButtonSwitcher; // 0xb98(0x08)
	struct UButton* SpeakerOffButton; // 0xba0(0x08)
	struct UButton* SpeakerOnButton; // 0xba8(0x08)
	struct UTextBlock* ValueText; // 0xbb0(0x08)
	struct UImage* VolumeGauge; // 0xbb8(0x08)
	struct USlider* VolumeSlider; // 0xbc0(0x08)
};

