// WidgetBlueprintGeneratedClass UI_TeamManagementPopUp.UI_TeamManagementPopUp_C
// Size: 0x480 (Inherited: 0x430)
struct UUI_TeamManagementPopUp_C : U*cc69409b78 {
	struct UImage* BlockIconImage; // 0x430(0x08)
	struct UBP_GamepadKeyIconWidget_C* BP_GamepadKeyIconWidget; // 0x438(0x08)
	struct UBP_GamepadKeyIconWidget_C* BP_GamepadKeyIconWidget_1; // 0x440(0x08)
	struct UBP_GamepadKeyIconWidget_C* BP_GamepadKeyIconWidget_2; // 0x448(0x08)
	struct UBP_GamepadKeyIconWidget_C* BP_GamepadKeyIconWidget_3; // 0x450(0x08)
	struct UImage* GamercardIconImage; // 0x458(0x08)
	struct UImage* MuteIcon_Off; // 0x460(0x08)
	struct UImage* MuteIcon_On; // 0x468(0x08)
	struct UWidgetSwitcher* MuteIconSwitcher; // 0x470(0x08)
	struct UImage* ReportIconImage; // 0x478(0x08)
};

