// BlueprintGeneratedClass BP_DirectMessageManager.BP_DirectMessageManager_C
// Size: 0x240 (Inherited: 0x240)
struct UBP_DirectMessageManager_C : U*3daed239b9 {
	struct UStringTable* *08f3ea783d; // 0x30(0x08)
	float *991e8b284f; // 0x38(0x04)
	int32 *934ee6c685; // 0x3c(0x04)
	int32 *3ba670375f; // 0x40(0x04)
	float *d82d8d609f; // 0x44(0x04)
	int32 *ff49ff312e; // 0x48(0x04)
	float *e99b25a3ab; // 0x4c(0x04)
	int32 *dafa6a9b98; // 0x50(0x04)
	bool *f91c10f1ed; // 0x54(0x01)

	void *4f82559a36(); // Function TslGame.*3daed239b9.*4f82559a36 // Final|Native|Public // @ game+0x5e1fe60
	int32 *5960ad255e(); // Function TslGame.*3daed239b9.*5960ad255e // Final|Native|Public // @ game+0x5e245cc
	struct FString *14e88a8178(); // Function TslGame.*3daed239b9.*14e88a8178 // Final|Native|Public|HasOutParms // @ game+0x5e1fa68
	bool *f65fa42a8a(); // Function TslGame.*3daed239b9.*f65fa42a8a // Final|Native|Public // @ game+0x5e2a25c
	bool *82a6fc859e(); // Function TslGame.*3daed239b9.*82a6fc859e // Final|Native|Public // @ game+0x5e1f1e4
};

