// BlueprintGeneratedClass BP_TracerManager.BP_TracerManager_C
// Size: 0x538 (Inherited: 0x538)
struct ABP_TracerManager_C : ATslTracerManager {
	struct UArrowComponent* ArrowComponent; // 0x3f8(0x08)
	struct TArray<struct UParticleSystemComponent*> *22293885c7; // 0x410(0x10)
	float SimulationSubstepTime; // 0x430(0x04)
	float AmmoTimeout; // 0x434(0x04)
	struct TArray<struct UParticleSystem*> TracerParticleArray; // 0x438(0x10)
	struct UParticleSystem* ShotGunParticleTemplate; // 0x448(0x08)
	struct TArray<struct UParticleSystem*> ProjectileParticleArray; // 0x450(0x10)
	struct TArray<struct UParticleSystem*> MeleeParticleArray; // 0x460(0x10)
	struct FVector ProjectileParticleColorRGB; // 0x470(0x0c)
	struct TMap<enum class *10a5c7c537, struct FVector> ProjectileClassColorMap; // 0x480(0x50)
	struct FName ColorParameterName; // 0x4d0(0x08)
	struct UStaticMesh* DefaultTracerMesh; // 0x4d8(0x08)
	struct UMaterialInterface* DefaultTracerMeshMaterial; // 0x4e0(0x08)
	struct FVector DefaultTracerMeshScale; // 0x4e8(0x0c)
	enum class *3644527f08 DefaultBulletDisplayMode; // 0x4f4(0x01)
	int32 DefaultBulletDisplayType; // 0x4f8(0x04)
	enum class *3644527f08 DefaultProjectileDisplayMode; // 0x4fc(0x01)
	int32 DefaultProjectileDisplayType; // 0x500(0x04)
	int32 CurrentModeTypeIndex; // 0x504(0x04)
	struct TArray<struct F*8c7b8743fa> ModeTypeArray; // 0x508(0x10)
	float Color1Multiplier; // 0x518(0x04)
	float Color2Multiplier; // 0x51c(0x04)
	struct FName TeamColor1ParameterName; // 0x520(0x08)
	struct FName TeamColor2ParameterName; // 0x528(0x08)
	float GrenadeColorScalar; // 0x530(0x04)
};

