// Class ClothingSystemRuntime.*7a8a45d2f4
// Size: 0x30 (Inherited: 0x30)
struct U*7a8a45d2f4 : UObject {
};

// Class ClothingSystemRuntime.ClothingAsset
// Size: 0x160 (Inherited: 0x50)
struct UClothingAsset : U*13f31c470b {
	struct F*dce1c49942 *dce1c49942; // 0x50(0xbc)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct TArray<struct F*9c016b1ea5> *5ff7bc7629; // 0x110(0x10)
	struct TArray<int32> *7175fb0ceb; // 0x120(0x10)
	struct TArray<struct FName> *62b17f3dfa; // 0x130(0x10)
	struct TArray<int32> *cac71fa82b; // 0x140(0x10)
	int32 *cd66efb199; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct U*7a8a45d2f4* CustomData; // 0x158(0x08)
};

// Class ClothingSystemRuntime.*f9a4ea409e
// Size: 0x30 (Inherited: 0x30)
struct U*f9a4ea409e : U*cf624e37bc {
};

