// BlueprintGeneratedClass DBX_ForgedWheel_BL.DBX_ForgedWheel_BL_C
// Size: 0x3b8 (Inherited: 0x3b8)
struct UDBX_ForgedWheel_BL_C : UDBX_ForgedWheel_C {
	float Health; // 0x198(0x04)
	float HealthMax; // 0x19c(0x04)
	struct FName *b1ad398919; // 0x1a0(0x08)
	bool *fbe4e13621; // 0x1a8(0x01)
	int32 *53ea9c7865; // 0x1ac(0x04)
	float *ded9f30843; // 0x1b0(0x04)
	struct F*cb5ca756db *e1399a1b50; // 0x1b8(0x50)
	float *3c270adec9; // 0x208(0x04)
	float *488969fe16; // 0x20c(0x04)
	float *27df0530ee; // 0x210(0x04)
	bool *8a1aebaa56; // 0x214(0x01)
	struct U*bbc1a2eb11* *3dd6dfbc90; // 0x218(0x08)
	struct FVector *ff904efa7d; // 0x220(0x0c)
	struct U*6734619dc3* *8dce3730e7; // 0x230(0x08)
	struct UClass* *7eb672ee18; // 0x238(0x08)
	struct UClass* *f1d4f04acb; // 0x240(0x08)
	float *66746d79a5; // 0x248(0x04)
	struct UAkAudioEvent* *a7bc342a7b; // 0x250(0x08)
	struct FVector *c28dd67e79; // 0x258(0x0c)
	int32 *ac2a6c03dd; // 0x264(0x04)
	enum class EPhysicalSurface *3f6c0692ab; // 0x268(0x01)
	bool *636408a8ef; // 0x269(0x01)
	float *321f76ef9b; // 0x26c(0x04)
	bool *7e0bb23bb2; // 0x270(0x01)
	struct U*f506c2fdab* *5b59d58131; // 0x278(0x08)
	bool bApplyForceOnPuncture; // 0x28d(0x01)
	bool *494ccbb46e; // 0x28e(0x01)
	float *573ca1b1c7; // 0x294(0x04)
	float *c1749d3188; // 0x298(0x04)
	struct ATslParticle* *e109155337; // 0x2a8(0x08)
	struct ATslParticle* *e9cae004c8; // 0x2b0(0x08)
	struct ATslParticle* *c6002ad76d; // 0x2b8(0x08)
	struct ATslParticle* *a208e54d2a; // 0x2c0(0x08)
	struct UAkComponent* *749060aa87; // 0x2d0(0x08)
	float *cbb3933baf; // 0x2d8(0x04)
	float *dd12a820ce; // 0x318(0x04)
	float Slip; // 0x31c(0x04)
	bool *835eae4a84; // 0x320(0x01)
	bool *dd128cb1c0; // 0x321(0x01)
	bool *6b06dbf1b7; // 0x322(0x01)
	bool *b63af232bc; // 0x323(0x01)
	struct F*d91b34201d *d91b34201d; // 0x324(0x10)
};

