// Class Engine.Actor
// Size: 0x3f8 (Inherited: 0x30)
struct AActor : UObject {
	float NetUpdateFrequency; // 0x30(0x04)
	char pad_34[0xc]; // 0x34(0x0c)
	char pad_40_0 : 3; // 0x40(0x01)
	char *afc0b607c1 : 1; // 0x40(0x01)
	char pad_40_4 : 4; // 0x40(0x01)
	char pad_41_0 : 1; // 0x41(0x01)
	char *195141a832 : 1; // 0x41(0x01)
	char bReplicates : 1; // 0x41(0x01)
	char pad_41_3 : 5; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct FName *dc8dad45d2; // 0x48(0x08)
	enum class ENetRole RemoteRole; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct AActor* Owner; // 0x58(0x08)
	struct FRepMovement ReplicatedMovement; // 0x60(0x34)
	char pad_94[0x4]; // 0x94(0x04)
	struct F*163cdb3029 *4998573317; // 0x98(0x40)
	float *f4ec68df5a; // 0xd8(0x04)
	char pad_DC[0x1c]; // 0xdc(0x1c)
	char bHidden : 1; // 0xf8(0x01)
	char *ccd23c4d11 : 1; // 0xf8(0x01)
	char *00c044e8f3 : 1; // 0xf8(0x01)
	char bOnlyRelevantToOwner : 1; // 0xf8(0x01)
	char bAlwaysRelevant : 1; // 0xf8(0x01)
	char *0b52d4980d : 1; // 0xf8(0x01)
	char *581c4aea8e : 1; // 0xf8(0x01)
	char *00a5818f10 : 1; // 0xf8(0x01)
	char *578ce01c9c : 1; // 0xf9(0x01)
	char pad_F9_1 : 1; // 0xf9(0x01)
	char *dc908ea105 : 1; // 0xf9(0x01)
	char bNetUseOwnerRelevancy : 1; // 0xf9(0x01)
	char *e59ae21b72 : 1; // 0xf9(0x01)
	char pad_F9_5 : 1; // 0xf9(0x01)
	char *42194894c7 : 1; // 0xf9(0x01)
	char pad_F9_7 : 1; // 0xf9(0x01)
	char pad_FA[0x6]; // 0xfa(0x06)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x100(0x10)
	char pad_110[0x50]; // 0x110(0x50)
	struct APawn* Instigator; // 0x160(0x08)
	char bAutoDestroyWhenFinished : 1; // 0x168(0x01)
	char bCanBeDamaged : 1; // 0x168(0x01)
	char *48c13dc856 : 1; // 0x168(0x01)
	char *b6f52fdcb3 : 1; // 0x168(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x168(0x01)
	char *ff1816ff9e : 1; // 0x168(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x168(0x01)
	char *a9f513e55a : 1; // 0x168(0x01)
	char *07bc7fef21 : 1; // 0x169(0x01)
	char pad_169_1 : 7; // 0x169(0x01)
	char pad_16A[0x6]; // 0x16a(0x06)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x170(0x10)
	float NetPriority; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
	struct FMulticastDelegate OnBeginCursorOver; // 0x188(0x10)
	struct FMulticastDelegate OnReleased; // 0x198(0x10)
	struct TArray<struct FName> Tags; // 0x1a8(0x10)
	char *72b47ba3cd : 1; // 0x1b8(0x01)
	char pad_1B8_1 : 4; // 0x1b8(0x01)
	char *8b1bf7449f : 1; // 0x1b8(0x01)
	char *d253d94f65 : 1; // 0x1b8(0x01)
	char *3b999d2d7a : 1; // 0x1b8(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x1b9(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x1ba(0x01)
	char pad_1BB[0x1]; // 0x1bb(0x01)
	float MinNetUpdateFrequency; // 0x1bc(0x04)
	struct AActor* ParentComponentActor; // 0x1c0(0x08)
	struct FMulticastDelegate OnEndCursorOver; // 0x1c8(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x1d8(0x10)
	struct TArray<struct AActor*> Children; // 0x1e8(0x10)
	enum class *d729d3c5a5 InputConsumeOption; // 0x1f8(0x01)
	char pad_1F9[0x7]; // 0x1f9(0x07)
	uint64 *59b4fa8b00; // 0x200(0x08)
	enum class ENetRole Role; // 0x208(0x01)
	char pad_209[0x7]; // 0x209(0x07)
	int32 *403c4f6ec5; // 0x210(0x04)
	float InitialLifeSpan; // 0x214(0x04)
	struct FMulticastDelegate OnTakePointDamage; // 0x218(0x10)
	int32 *c2b5fafb50; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct FMulticastDelegate OnInputTouchEnd; // 0x230(0x10)
	float CustomTimeDilation; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x248(0x10)
	struct TArray<struct AMatineeActor*> *24dd036ec9; // 0x258(0x10)
	struct USceneComponent* RootComponent; // 0x268(0x08)
	struct FMulticastDelegate OnActorHit; // 0x270(0x10)
	struct UChildActorComponent* *18ff5b3923; // 0x280(0x08)
	struct FMulticastDelegate OnInputTouchBegin; // 0x288(0x10)
	struct FGuid DestructibleId; // 0x298(0x10)
	bool bIsDestroyedVersion; // 0x2a8(0x01)
	bool RemoveFromLevelLOD; // 0x2a9(0x01)
	char pad_2AA[0x6]; // 0x2aa(0x06)
	struct F*b3a779a928 PrimaryActorTick; // 0x2b0(0x58)
	char pad_308[0x8]; // 0x308(0x08)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x310(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x320(0x01)
	char pad_321[0x3]; // 0x321(0x03)
	float NetCullDistanceSquared; // 0x324(0x04)
	struct FMulticastDelegate OnClicked; // 0x328(0x10)
	struct U*89f9a84286* *89f9a84286; // 0x338(0x08)
	enum class EAutoReceiveInput *aaa4c6b0aa; // 0x340(0x01)
	char pad_341[0x57]; // 0x341(0x57)
	struct FMulticastDelegate OnDestroyed; // 0x398(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3a8(0x10)
	char pad_3B8[0x8]; // 0x3b8(0x08)
	struct FMulticastDelegate OnActorEndOverlap; // 0x3c0(0x10)
	struct TArray<struct FName> Layers; // 0x3d0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x3e0(0x10)
	char pad_3F0[0x8]; // 0x3f0(0x08)

	bool K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8374
	bool K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x6bb9ffc
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbbe48
	struct FHitResult K2_AddActorLocalRotation(bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb854c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xb50d98
	void GetActorBounds(bool bOnlyCollidingComponents); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb079c
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x6bb9e7c
	void *cdc7b91d6d(); // Function Engine.Actor.*cdc7b91d6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb68c4
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbda74
	void *75f3114c08(); // Function Engine.Actor.*75f3114c08 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb76e4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xbed704
	void *b999b3d1c3(struct UMaterialInterface* Parent, struct UMaterialInstanceDynamic* ReturnValue); // Function Engine.Actor.*b999b3d1c3 // Final|Native|Public|BlueprintCallable // @ game+0x6bbd9f8
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *bad918d000(); // Function Engine.Actor.*bad918d000 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bcaac4
	float *7311615d4b(); // Function Engine.Actor.*7311615d4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d50
	float *685e3b5cc9(); // Function Engine.Actor.*685e3b5cc9 // Native|Public|BlueprintCallable // @ game+0x6bc6498
	struct FVector *1206b0a740(); // Function Engine.Actor.*1206b0a740 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0bd8
	float *5c41a9b3d8(); // Function Engine.Actor.*5c41a9b3d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb40a0
	struct FVector *806c296001(); // Function Engine.Actor.*806c296001 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae14
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x370fbc
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct USceneComponent* *6c12a1a971(); // Function Engine.Actor.*6c12a1a971 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb350
	bool *0533b13c90(); // Function Engine.Actor.*0533b13c90 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb112c
	bool *91da404789(); // Function Engine.Actor.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0xdbd9a8
	void *72d1ab0701(struct FVector NewScale3D); // Function Engine.Actor.*72d1ab0701 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc2b94
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x370fbc
	void K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8950
	void K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbba2c
	void *bda82fb76a(); // Function Engine.Actor.*bda82fb76a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1364
	void *de9d01b3f6(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.*de9d01b3f6 // Final|Native|Public|BlueprintCallable // @ game+0x6bba2fc
	void *8ee0b9e990(); // Function Engine.Actor.*8ee0b9e990 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb49d0
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaee4
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5964
	bool *d57fbe8fc6(); // Function Engine.Actor.*d57fbe8fc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7630
	float *511ef00739(); // Function Engine.Actor.*511ef00739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2e28
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct UChildActorComponent* *ef270d1a10(); // Function Engine.Actor.*ef270d1a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5bb8
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xf1a3fc
	struct TArray<struct UActorComponent*> *d93dde83f1(); // Function Engine.Actor.*d93dde83f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2600
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbbc10
	struct AActor* *e22a09fc3d(); // Function Engine.Actor.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5af4
	struct APawn* *dd10056177(); // Function Engine.Actor.*dd10056177 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb49b8
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5d95e60
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *118a22ba37(struct FName InputAxisName, float ReturnValue); // Function Engine.Actor.*118a22ba37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4194
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x6bae4ac
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x40a36c
	void *b7511d0ed8(enum class *ecdd115207 RotationRule); // Function Engine.Actor.*b7511d0ed8 // Final|Native|Public|BlueprintCallable // @ game+0x6bbaaa4
	void K2_AddActorWorldTransform(struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8d00
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x370fbc
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xd9fc70
	void *f3429ceb97(struct UClass* ComponentClass, struct UActorComponent* ReturnValue); // Function Engine.Actor.*f3429ceb97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2508
	void *eb66fec44e(struct FVector ReturnValue); // Function Engine.Actor.*eb66fec44e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d04
	void GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5704
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x6bc2c34
	bool *461623950c(); // Function Engine.Actor.*461623950c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb764c
	struct AActor* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x370fbc
	bool K2_AddActorLocalTransform(); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8724
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct AActor* *c4fee2a50d(); // Function Engine.Actor.*c4fee2a50d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1340
	struct AActor* *5d41351842(float ReturnValue); // Function Engine.Actor.*5d41351842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3b64
	void AddComponent(struct FName TemplateName, bool bManualAttachment); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xcade1c
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *e45fc9ffc9(struct FVector OutLocation, struct FRotator OutRotation); // Function Engine.Actor.*e45fc9ffc9 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb096c
	void *383cbfbf66(); // Function Engine.Actor.*383cbfbf66 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb13a8
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *d4b72b197e(enum class ENetRole ReturnValue); // Function Engine.Actor.*d4b72b197e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6404
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6fd8
	void *0f7b3f99fd(); // Function Engine.Actor.*0f7b3f99fd // Native|Public|BlueprintCallable // @ game+0x6bb0000
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x6a12d0
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x6bae540
	void K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8b28
	struct UActorComponent* *f221ff8513(); // Function Engine.Actor.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6ba9f60
	float *14c0f68ea4(); // Function Engine.Actor.*14c0f68ea4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bb3070
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe76424
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb059c
	enum class ETickingGroup *814a121c39(); // Function Engine.Actor.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x6bc8598
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x370fbc
	float *52068fadb9(); // Function Engine.Actor.*52068fadb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3ac4
	void *5f8251239e(); // Function Engine.Actor.*5f8251239e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb0588
	struct FVector *a0012f52a9(); // Function Engine.Actor.*a0012f52a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0ba4
	bool SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x6bc2890
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6ba9e38
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *d85c70de6e(); // Function Engine.Actor.*d85c70de6e // Final|Native|Public|BlueprintCallable // @ game+0x6bb6b90
	void *65fa332f56(); // Function Engine.Actor.*65fa332f56 // Native|Public|BlueprintCallable // @ game+0x6bca400
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x370fbc
	struct FVector *058a798681(); // Function Engine.Actor.*058a798681 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc2af4
	struct UActorComponent* *581f8985e1(); // Function Engine.Actor.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x6bba954
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *0d0c513b2c(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x6bbf5c8
	void *83d2d5c58f(); // Function Engine.Actor.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7e88
	void *efaba219b2(struct FName Tag, struct TArray<struct UActorComponent*> ReturnValue); // Function Engine.Actor.*efaba219b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb26f0
	void *541a06a744(); // Function Engine.Actor.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x6bbf4a0
	void *ce1958648c(); // Function Engine.Actor.*ce1958648c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2ec8
	void *891a15da22(struct FVector DestLocation, struct FRotator DestRotation, bool ReturnValue); // Function Engine.Actor.*891a15da22 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbd3c0
	void ReceiveHit(bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	void *76f4a54e31(); // Function Engine.Actor.*76f4a54e31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d38
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd1263c
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6bba93c
	float *7cff7fa404(); // Function Engine.Actor.*7cff7fa404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7010
	struct FVector *d5ff08bf52(); // Function Engine.Actor.*d5ff08bf52 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0a78
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	struct FVector *bbf004721b(); // Function Engine.Actor.*bbf004721b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb47b0
	bool *221e5b49fe(); // Function Engine.Actor.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x6bc8030
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc020
	bool *4bc88286ff(); // Function Engine.Actor.*4bc88286ff // Final|Native|Public|BlueprintCallable // @ game+0x6bc27f8
	struct AActor* *057be55286(); // Function Engine.Actor.*057be55286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5b94
	float *48b2b80fa1(); // Function Engine.Actor.*48b2b80fa1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4a80
	struct FRotator K2_SetActorRotation(bool bTeleportPhysics, bool ReturnValue); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbc424
	void K2_SetActorTransform(struct FTransform NewTransform); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc524
	void *209c054b22(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.*209c054b22 // Final|Native|Public|BlueprintCallable // @ game+0x6bc96f8
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbe9b28
	void *87d1cdd662(); // Function Engine.Actor.*87d1cdd662 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bc80c8
	void K2_SetActorRelativeTransform(struct FTransform NewRelativeTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc1f8
	void *32ee7138ab(); // Function Engine.Actor.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x6bc86b0
	void *45e9b736d8(); // Function Engine.Actor.*45e9b736d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0944
	void *f4f472a4df(struct FVector ReturnValue); // Function Engine.Actor.*f4f472a4df // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d78
	void *1357a6903c(float TickInterval); // Function Engine.Actor.*1357a6903c // Final|Native|Public|BlueprintCallable // @ game+0x6bc2cc8
};

// Class Engine.AnimInstance
// Size: 0x3a8 (Inherited: 0x30)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct USkeleton* *a7e4906ff1; // 0x38(0x08)
	enum class *0accfd5352 *8ba26f4fbf; // 0x40(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x41(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x42(0x01)
	bool *c74b442f59; // 0x43(0x01)
	bool bWarnAboutBlueprintUsage; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x48(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x58(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x68(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x78(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x88(0x10)
	char pad_98[0x60]; // 0x98(0x60)
	bool *206a771f46; // 0xf8(0x01)
	char pad_F9[0x9f]; // 0xf9(0x9f)
	struct TArray<struct FAnimNotifyEvent> *6fc5b1d0be; // 0x198(0x10)
	char pad_1A8[0x200]; // 0x1a8(0x200)

	float *92ce4ee977(); // Function Engine.AnimInstance.*92ce4ee977 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bebe14
	bool *324fdf8f8a(); // Function Engine.AnimInstance.*324fdf8f8a // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bfc9c0
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct F*c74ca801af *0e59f382aa(); // Function Engine.AnimInstance.*0e59f382aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf1004
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *d213c50b7f(); // Function Engine.AnimInstance.*d213c50b7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf6ae8
	float *8e3bfbd48a(); // Function Engine.AnimInstance.*8e3bfbd48a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bec218
	struct FName *cebaa7cd2c(); // Function Engine.AnimInstance.*cebaa7cd2c // Native|Public|BlueprintCallable // @ game+0x6c0a004
	struct UAnimationAsset* GetAnimAssetPlayerTimeFromEnd(float CurrentTime, float ReturnValue); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6be78c0
	void Montage_Play(struct UAnimMontage* MontageToPlay, float ReturnValue); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x84d288
	void *3d7951dd37(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.*3d7951dd37 // Final|Native|Public|BlueprintCallable // @ game+0x6c01674
	void BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *5e07a11f21(struct FName MarkerName, bool ReturnValue); // Function Engine.AnimInstance.*5e07a11f21 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf4914
	void *7daaaa5771(int32 AssetPlayerIndex); // Function Engine.AnimInstance.*7daaaa5771 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6beb2bc
	void *46b80b3a59(); // Function Engine.AnimInstance.*46b80b3a59 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c01258
	void *2fdfd7cfe3(struct AActor* ReturnValue); // Function Engine.AnimInstance.*2fdfd7cfe3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd44138
	void GetStateWeight(int32 MachineIndex); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf0a48
	void *003dacf78a(); // Function Engine.AnimInstance.*003dacf78a // Final|Native|Public|BlueprintCallable // @ game+0x6bdc2e0
	struct UAnimMontage* *6bd52ed5b9(); // Function Engine.AnimInstance.*6bd52ed5b9 // Native|Public|BlueprintCallable // @ game+0x78a5ec
	struct FName *7aeb896e6e(); // Function Engine.AnimInstance.*7aeb896e6e // Final|Native|Public|BlueprintCallable // @ game+0x6c21be8
	float *8c261f57d4(); // Function Engine.AnimInstance.*8c261f57d4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bef064
	struct UAnimMontage* *be4d7059c2(); // Function Engine.AnimInstance.*be4d7059c2 // Final|Native|Public|BlueprintCallable // @ game+0x6c01504
	float *28886e519b(); // Function Engine.AnimInstance.*28886e519b // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x84e9a0
	struct FName *bcdca57f0a(); // Function Engine.AnimInstance.*bcdca57f0a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6be9410
	bool *a38a5ce007(); // Function Engine.AnimInstance.*a38a5ce007 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c01118
	struct APawn* *f56ecdaa87(); // Function Engine.AnimInstance.*f56ecdaa87 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c23860
	bool *0a8f8d6319(); // Function Engine.AnimInstance.*0a8f8d6319 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bfc9c0
	struct UAnimMontage* *917921a2e3(); // Function Engine.AnimInstance.*917921a2e3 // Final|Native|Public|BlueprintCallable // @ game+0x6c01398
	float GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6be774c
	void *8681bde224(struct FPoseSnapshot Snapshot); // Function Engine.AnimInstance.*8681bde224 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c1cc1c
	void PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendOutTriggerTime, float InTimeToStartMontageAt, struct UAnimMontage* ReturnValue); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x6c05180
	void *97a3af276c(); // Function Engine.AnimInstance.*97a3af276c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6beb938
	void *40e1f5f43a(float ReturnValue); // Function Engine.AnimInstance.*40e1f5f43a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6beb654
	void *e064ffea5e(struct UAnimMontage* Montage); // Function Engine.AnimInstance.*e064ffea5e // Final|Native|Public|BlueprintCallable // @ game+0x6c01474
	void *757538402e(); // Function Engine.AnimInstance.*757538402e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x547880
	void *39919f124d(struct UAnimMontage* Montage, float ReturnValue); // Function Engine.AnimInstance.*39919f124d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c011b8
	void *7eeea6c74e(int32 MachineIndex); // Function Engine.AnimInstance.*7eeea6c74e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xc9238c
	void *a977510087(); // Function Engine.AnimInstance.*a977510087 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf63a4
	struct FName *add693e1df(); // Function Engine.AnimInstance.*add693e1df // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c0107c
	bool *dcbdf49e66(); // Function Engine.AnimInstance.*dcbdf49e66 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c012f8
	float *af34a038d7(); // Function Engine.AnimInstance.*af34a038d7 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6beee60
	float *9c44837415(); // Function Engine.AnimInstance.*9c44837415 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c00fdc
	bool *ce83b031d9(); // Function Engine.AnimInstance.*ce83b031d9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf7044
	float GetAnimAssetPlayerTimeFromEndFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6be79c4
	float *8844726dd1(); // Function Engine.AnimInstance.*8844726dd1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6beb470
	float *b38c1f41c3(); // Function Engine.AnimInstance.*b38c1f41c3 // Final|Native|Public|BlueprintCallable // @ game+0x6c14e14
	float GetAnimAssetPlayerTimeFraction(float ReturnValue); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6be77e0
	void *a908599b82(int32 AssetPlayerIndex, float ReturnValue); // Function Engine.AnimInstance.*a908599b82 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6beaf24
	void *04dc1a777c(); // Function Engine.AnimInstance.*04dc1a777c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd905c
	void PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x6c04f5c
	void *f30cd63cdb(struct UAnimMontage* ReturnValue); // Function Engine.AnimInstance.*f30cd63cdb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6be8f88
	void *8859b811a6(enum class *0accfd5352 Value); // Function Engine.AnimInstance.*8859b811a6 // Final|Native|Public|BlueprintCallable // @ game+0x6c16cc8
	void *d3925db7cd(); // Function Engine.AnimInstance.*d3925db7cd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bef280
	void *6abb6cfc88(int32 AssetPlayerIndex, float ReturnValue); // Function Engine.AnimInstance.*6abb6cfc88 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xc921cc
	void *ae69dc5c64(); // Function Engine.AnimInstance.*ae69dc5c64 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf16b4
	struct USkeletalMeshComponent* *5940d5128c(); // Function Engine.AnimInstance.*5940d5128c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee154
	float GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6be9370
	bool *2ed9c97cc9(); // Function Engine.AnimInstance.*2ed9c97cc9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe55fec
	float *c2413b9bde(); // Function Engine.AnimInstance.*c2413b9bde // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bec018
	float *c19b394f7e(); // Function Engine.AnimInstance.*c19b394f7e // Final|Native|Public|BlueprintCallable // @ game+0x6c01594
	float *0e6503e701(); // Function Engine.AnimInstance.*0e6503e701 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6beb0f0
	struct UAnimMontage* *4e9f00b274(); // Function Engine.AnimInstance.*4e9f00b274 // Native|Public|BlueprintCallable // @ game+0x4ae8c4
	struct UAnimMontage* *cce7bb269a(); // Function Engine.AnimInstance.*cce7bb269a // Native|Public|BlueprintCallable // @ game+0x84f08c
	float *c96507ca7c(); // Function Engine.AnimInstance.*c96507ca7c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x549024
};

// Class Engine.ActorComponent
// Size: 0x200 (Inherited: 0x30)
struct UActorComponent : UObject {
	char pad_30[0xf0]; // 0x30(0xf0)
	struct F*8d4039fc59 PrimaryComponentTick; // 0x120(0x58)
	struct TArray<struct FName> ComponentTags; // 0x178(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x188(0x10)
	char pad_198_0 : 3; // 0x198(0x01)
	char bReplicates : 1; // 0x198(0x01)
	char bNetAddressable : 1; // 0x198(0x01)
	char *42cccbce92 : 1; // 0x198(0x01)
	char pad_198_6 : 2; // 0x198(0x01)
	char pad_199[0x1]; // 0x199(0x01)
	char pad_19A_0 : 2; // 0x19a(0x01)
	char bCreatedByConstructionScript : 1; // 0x19a(0x01)
	char bInstanceComponent : 1; // 0x19a(0x01)
	char bAutoActivate : 1; // 0x19a(0x01)
	char *37789dceb0 : 1; // 0x19a(0x01)
	char *d6b476b16b : 1; // 0x19a(0x01)
	char pad_19A_7 : 1; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	struct FGuid DestructibleId; // 0x19c(0x10)
	bool bIsDestroyedVersion; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	char *5a62c75e8c : 1; // 0x1b0(0x01)
	char pad_1B0_1 : 2; // 0x1b0(0x01)
	char bIsEditorOnly : 1; // 0x1b0(0x01)
	char pad_1B0_4 : 4; // 0x1b0(0x01)
	char pad_1B1[0x4]; // 0x1b1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1b5(0x01)
	enum class EPendingCreationType *4795e00ee8; // 0x1b6(0x01)
	char pad_1B7[0x9]; // 0x1b7(0x09)
	struct TArray<struct FSimpleMemberReference> *98e040a793; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1d0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1e0(0x10)
	char pad_1F0[0x9]; // 0x1f0(0x09)
	char *195141a832 : 1; // 0x1f9(0x01)
	char pad_1F9_1 : 7; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)

	void *61bb7392aa(bool bNewActive, bool bReset); // Function Engine.ActorComponent.*61bb7392aa // Native|Public|BlueprintCallable // @ game+0x6bc2704
	void *05866bcfcb(); // Function Engine.ActorComponent.*05866bcfcb // Final|Native|Public|BlueprintCallable // @ game+0x6bc6404
	void Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xb07324
	void *c4952b0099(float ReturnValue); // Function Engine.ActorComponent.*c4952b0099 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb25b0
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0x6629f08
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x6bbdfd4
	void *f52554acee(); // Function Engine.ActorComponent.*f52554acee // Final|Native|Public|BlueprintCallable // @ game+0x6bc4f48
	void *541a06a744(); // Function Engine.ActorComponent.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x6bbf534
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *814a121c39(enum class ETickingGroup NewTickGroup); // Function Engine.ActorComponent.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x6bc8624
	void *0d0c513b2c(); // Function Engine.ActorComponent.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x6bbf65c
	void *9eb2ac36d0(); // Function Engine.ActorComponent.*9eb2ac36d0 // Native|Public|BlueprintCallable // @ game+0x5e4d48c
	void *6f8bd4c74b(bool bNewAutoActivate); // Function Engine.ActorComponent.*6f8bd4c74b // Native|Public|BlueprintCallable // @ game+0x6bc32fc
	void *e22a09fc3d(struct AActor* ReturnValue); // Function Engine.ActorComponent.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd68c34
	void IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e4d4a4
	void *d4c659a949(); // Function Engine.ActorComponent.*d4c659a949 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bad540
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6ba9ecc
	struct UActorComponent* *f221ff8513(); // Function Engine.ActorComponent.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6ba9ff4
	bool *2e369dcd8d(); // Function Engine.ActorComponent.*2e369dcd8d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb76c8
	bool *32ee7138ab(); // Function Engine.ActorComponent.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x6bc8748
	struct UObject* *581f8985e1(); // Function Engine.ActorComponent.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x6bba9ec
	bool *77f9b41839(); // Function Engine.ActorComponent.*77f9b41839 // Native|Public|BlueprintCallable // @ game+0x6bc4eb0
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *3ae845f2b7(); // Function Engine.ActorComponent.*3ae845f2b7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7844
	float ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x370fbc
};

// Class Engine.Pawn
// Size: 0x458 (Inherited: 0x3f8)
struct APawn : AActor {
	char pad_3F8[0x8]; // 0x3f8(0x08)
	char bUseControllerRotationPitch : 1; // 0x400(0x01)
	char bUseControllerRotationYaw : 1; // 0x400(0x01)
	char bUseControllerRotationRoll : 1; // 0x400(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x400(0x01)
	char pad_400_4 : 4; // 0x400(0x01)
	char pad_401[0x3]; // 0x401(0x03)
	float BaseEyeHeight; // 0x404(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x408(0x01)
	enum class EAutoPossessAI *e0e3a12db9; // 0x409(0x01)
	char pad_40A[0x6]; // 0x40a(0x06)
	struct UClass* AIControllerClass; // 0x410(0x08)
	char pad_418[0x4]; // 0x418(0x04)
	uint16 *021ce32c67; // 0x41c(0x02)
	char pad_41E[0x2]; // 0x41e(0x02)
	struct AController* Controller; // 0x420(0x08)
	struct AController* *2f9c3272b2; // 0x428(0x08)
	struct APlayerState* PlayerState; // 0x430(0x08)
	char pad_438[0x4]; // 0x438(0x04)
	struct FVector *c0934ea168; // 0x43c(0x0c)
	struct FVector *d20d64241b; // 0x448(0x0c)
	char pad_454[0x4]; // 0x454(0x04)

	void *c30d7bf87e(); // Function Engine.Pawn.*c30d7bf87e // Native|Public|BlueprintCallable // @ game+0x6bc98dc
	struct AController* ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct AController* GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb289c
	void K2_GetMovementInputVector(struct FVector ReturnValue); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5f48
	void *7d02763a00(bool bNewValue); // Function Engine.Pawn.*7d02763a00 // Final|Native|Public|BlueprintCallable // @ game+0x6bc438c
	void *9559952bce(bool bUseNoiseMakerLocation, struct AActor* NoiseMaker); // Function Engine.Pawn.*9559952bce // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbe21c
	void *116ac9743d(struct FVector WorldDirection); // Function Engine.Pawn.*116ac9743d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba9654
	void AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x6ba8560
	void *c87325b52a(struct FVector ReturnValue); // Function Engine.Pawn.*c87325b52a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5314
	void *8dcd001cb7(bool ReturnValue); // Function Engine.Pawn.*8dcd001cb7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e1b8d4
	void *09ea1f63ee(); // Function Engine.Pawn.*09ea1f63ee // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5de97e0
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0x6c86f8
	void *5a76ea52e7(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Pawn.*5a76ea52e7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbd618
	void *ec5c491810(); // Function Engine.Pawn.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7e10
	void *f92d1c6c4c(); // Function Engine.Pawn.*f92d1c6c4c // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6bb51dc
	bool *c9d088b372(); // Function Engine.Pawn.*c9d088b372 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7870
	struct FVector *d2bc061ca3(); // Function Engine.Pawn.*d2bc061ca3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4a58
	struct FVector *a7b2c687f7(); // Function Engine.Pawn.*a7b2c687f7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5f48
	struct FVector *b4938e18ab(); // Function Engine.Pawn.*b4938e18ab // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bad958
	struct FRotator *cb88bbbff9(); // Function Engine.Pawn.*cb88bbbff9 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1490
	float AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x6ba84c4
	void *5f4189de1b(); // Function Engine.Pawn.*5f4189de1b // Native|Public|BlueprintCallable // @ game+0x5de512c
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0xa917d0
	bool *3c5cc3769a(); // Function Engine.Pawn.*3c5cc3769a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdb5a84
	float AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x6ba8428
	struct AController* ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2868
};

// Class Engine.DataAsset
// Size: 0x38 (Inherited: 0x30)
struct UDataAsset : UObject {
	struct UClass* *cdb62082ca; // 0x30(0x08)
};

// Class Engine.SceneComponent
// Size: 0x470 (Inherited: 0x200)
struct USceneComponent : UActorComponent {
	char pad_200[0x8]; // 0x200(0x08)
	struct FVector *bf3a460e85; // 0x208(0x0c)
	char pad_214[0x4]; // 0x214(0x04)
	struct USceneComponent* AttachParent; // 0x218(0x08)
	char pad_220[0x30]; // 0x220(0x30)
	char pad_250_0 : 1; // 0x250(0x01)
	char bReplicatesAttachmentReference : 1; // 0x250(0x01)
	char bReplicatesAttachment : 1; // 0x250(0x01)
	char *70c5e7a9b6 : 1; // 0x250(0x01)
	char pad_250_4 : 1; // 0x250(0x01)
	char bAbsoluteLocation : 1; // 0x250(0x01)
	char bAbsoluteRotation : 1; // 0x250(0x01)
	char bAbsoluteScale : 1; // 0x250(0x01)
	char bVisible : 1; // 0x251(0x01)
	char bHiddenInGame : 1; // 0x251(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x251(0x01)
	char *1dac92158a : 1; // 0x251(0x01)
	char bUseAttachParentBound : 1; // 0x251(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x251(0x01)
	char pad_251_6 : 2; // 0x251(0x01)
	char pad_252_0 : 3; // 0x252(0x01)
	char bAbsoluteTranslation : 1; // 0x252(0x01)
	char pad_252_4 : 4; // 0x252(0x01)
	char pad_253[0x1]; // 0x253(0x01)
	struct APhysicsVolume* PhysicsVolume; // 0x254(0x08)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct FName *cb3fc8827c; // 0x260(0x08)
	char pad_268[0x30]; // 0x268(0x30)
	struct FVector RelativeTranslation; // 0x298(0x0c)
	char pad_2A4[0x4d]; // 0x2a4(0x4d)
	enum class *92a8d5bca4 DetailMode; // 0x2f1(0x01)
	char pad_2F2[0x2]; // 0x2f2(0x02)
	struct FRotator RelativeRotation; // 0x2f4(0x0c)
	SetProperty *912139fe50; // 0x300(0x50)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x350(0x10)
	enum class EComponentMobility Mobility; // 0x360(0x01)
	char pad_361[0x3]; // 0x361(0x03)
	struct FVector RelativeScale3D; // 0x364(0x0c)
	struct FVector RelativeLocation; // 0x370(0x0c)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x380(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x390(0x10)
	char pad_3A0[0xd0]; // 0x3a0(0xd0)

	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbcbb4
	void *30399f17ac(); // Function Engine.SceneComponent.*30399f17ac // Final|Native|Public|BlueprintCallable // @ game+0x6bc5f5c
	void K2_SetRelativeTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc988
	void *a82e4c11f1(bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.*a82e4c11f1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbcd8c
	void K2_SetRelativeLocation(); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xd16544
	bool K2_AddRelativeLocation(); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb9508
	bool *0281884c9e(); // Function Engine.SceneComponent.*0281884c9e // Final|Native|Public|BlueprintCallable // @ game+0x6bc62cc
	struct FVector *9269d42730(); // Function Engine.SceneComponent.*9269d42730 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6418
	struct FVector *8f25590c73(); // Function Engine.SceneComponent.*8f25590c73 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb25c8
	struct FRotator *431ade8cc7(); // Function Engine.SceneComponent.*431ade8cc7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaff4
	struct FVector *e1a45b5fe3(); // Function Engine.SceneComponent.*e1a45b5fe3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd55b68
	bool K2_SetRelativeRotation(); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xd33f04
	bool K2_AddWorldOffset(); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb98a0
	struct TArray<struct FName> *0f8df46b26(); // Function Engine.SceneComponent.*0f8df46b26 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb125c
	bool *cc0c29c29b(); // Function Engine.SceneComponent.*cc0c29c29b // Final|Native|Public|BlueprintCallable // @ game+0x6bc97d4
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb96d4
	void DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x6bae3b8
	void K2_AddWorldTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb9c50
	void *b4af2a3e8b(enum class *ecdd115207 RotationRule, enum class *ecdd115207 ScaleRule); // Function Engine.SceneComponent.*b4af2a3e8b // Final|Native|Public|BlueprintCallable // @ game+0xddbcc4
	void *63635bbd26(); // Function Engine.SceneComponent.*63635bbd26 // Final|Native|Public|BlueprintCallable // @ game+0x6bc6368
	void OnRep_Visibility(bool Param0); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x6bbe0b4
	void K2_AddLocalTransform(struct FTransform DeltaTransform, bool bSweep); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb92dc
	void IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb825c
	bool *d843f2564c(); // Function Engine.SceneComponent.*d843f2564c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bae5ec
	struct FVector *3e34911a72(); // Function Engine.SceneComponent.*3e34911a72 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc93e0
	bool K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb9104
	struct FVector *dd99459d4b(); // Function Engine.SceneComponent.*dd99459d4b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6574
	struct FName *b499c4ea3e(); // Function Engine.SceneComponent.*b499c4ea3e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1390
	struct FTransform *5828b2e365(); // Function Engine.SceneComponent.*5828b2e365 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6794
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xe01e9c
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xbc0364
	struct FVector *f756a0f59d(); // Function Engine.SceneComponent.*f756a0f59d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2fcc
	struct USceneComponent* *f54ed8c40b(); // Function Engine.SceneComponent.*f54ed8c40b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb20a8
	int32 *47a7ed7776(); // Function Engine.SceneComponent.*47a7ed7776 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5520
	struct TArray<struct USceneComponent*> *2203da3c3b(); // Function Engine.SceneComponent.*2203da3c3b // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5e38
	void *af76098df3(struct USceneComponent* ReturnValue); // Function Engine.SceneComponent.*af76098df3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xf3509c
	void K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x6bba17c
	void *cae9ec1747(struct FVector ReturnValue); // Function Engine.SceneComponent.*cae9ec1747 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6e08
	void *860e529060(); // Function Engine.SceneComponent.*860e529060 // Final|Native|Public|BlueprintCallable // @ game+0x6bbf738
	void *6899b690c6(bool bNewAbsoluteLocation); // Function Engine.SceneComponent.*6899b690c6 // Final|Native|Public|BlueprintCallable // @ game+0x6bc25c0
	void *91da404789(struct FName SocketName, enum class EAttachmentRule LocationRule, bool ReturnValue); // Function Engine.SceneComponent.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0x6bba51c
	void *a16ae93b8c(struct FTransform ReturnValue); // Function Engine.SceneComponent.*a16ae93b8c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb63ac
	void *007b399f94(); // Function Engine.SceneComponent.*007b399f94 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb76a0
	void *b9705d1983(); // Function Engine.SceneComponent.*b9705d1983 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb662c
	bool K2_SetWorldRotation(); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbcfbc
	bool *76907d1282(); // Function Engine.SceneComponent.*76907d1282 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc758
	struct TArray<struct USceneComponent*> *8c7d8b49f7(); // Function Engine.SceneComponent.*8c7d8b49f7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2148
	struct FVector *05a07db4bd(); // Function Engine.SceneComponent.*05a07db4bd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb078
	bool ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x6bca564
	struct FRotator *bac6a64c08(); // Function Engine.SceneComponent.*bac6a64c08 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb66dc
	bool *51f025391d(); // Function Engine.SceneComponent.*51f025391d // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e91a3c
	bool K2_SetWorldTransform(); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbd194
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xe01e9c
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xd8e65c
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb9a78
	void *1f50dc4b23(); // Function Engine.SceneComponent.*1f50dc4b23 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb61a4
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xddd758
	void K2_GetComponentToWorld(struct FTransform ReturnValue); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb0bc
	void *d6ea9645a8(); // Function Engine.SceneComponent.*d6ea9645a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0xdff330
	void K2_AddLocalOffset(bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8f2c
};

// Class Engine.PrimitiveComponent
// Size: 0x9b0 (Inherited: 0x470)
struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x470(0x04)
	float LDMaxDrawDistance; // 0x474(0x04)
	float CachedMaxDrawDistance; // 0x478(0x04)
	enum class *4c2c3fa7ba *eb729ee19c; // 0x47c(0x01)
	enum class *4c2c3fa7ba *4abdb2d2ee; // 0x47d(0x01)
	char pad_47E[0x2]; // 0x47e(0x02)
	char pad_480_0 : 3; // 0x480(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x480(0x01)
	char bGenerateOverlapEvents : 1; // 0x480(0x01)
	char bMultiBodyOverlap : 1; // 0x480(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x480(0x01)
	char bTraceComplexOnMove : 1; // 0x480(0x01)
	char bDisableForceFromCharacter : 1; // 0x481(0x01)
	char bReturnMaterialOnMove : 1; // 0x481(0x01)
	char *09f6c4c3d1 : 1; // 0x481(0x01)
	char bAllowCullDistanceVolume : 1; // 0x481(0x01)
	char bImportantMesh : 1; // 0x481(0x01)
	char bOverrideCullingDistances : 1; // 0x481(0x01)
	char pad_481_6 : 2; // 0x481(0x01)
	char pad_482[0x2]; // 0x482(0x02)
	float HLODScreenSize; // 0x484(0x04)
	char *6d95e74c7f : 1; // 0x488(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x488(0x01)
	char bRenderInMainPass : 1; // 0x488(0x01)
	char bRenderInMono : 1; // 0x488(0x01)
	char bOwnerNoSee : 1; // 0x488(0x01)
	char bOnlyOwnerSee : 1; // 0x488(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x488(0x01)
	char bUseAsOccluder : 1; // 0x488(0x01)
	char bForceAsOccluder : 1; // 0x489(0x01)
	char bForceOcclusionQuerying : 1; // 0x489(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x489(0x01)
	char *2ec0cf6207 : 1; // 0x489(0x01)
	char bForceMipStreaming : 1; // 0x489(0x01)
	char *105359d223 : 1; // 0x489(0x01)
	char pad_489_6 : 1; // 0x489(0x01)
	char CastShadow : 1; // 0x489(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x48a(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x48a(0x01)
	char bCastDynamicShadow : 1; // 0x48a(0x01)
	char bCastStaticShadow : 1; // 0x48a(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x48a(0x01)
	char bSelfShadowOnly : 1; // 0x48a(0x01)
	char bCastFarShadow : 1; // 0x48a(0x01)
	char bCastInsetShadow : 1; // 0x48a(0x01)
	char bCastCinematicShadow : 1; // 0x48b(0x01)
	char bCastHiddenShadow : 1; // 0x48b(0x01)
	char bCastShadowAsTwoSided : 1; // 0x48b(0x01)
	char bLightAsIfStatic : 1; // 0x48b(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x48b(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x48b(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x48b(0x01)
	char bIgnoreRadialImpulse : 1; // 0x48b(0x01)
	char bIgnoreRadialForce : 1; // 0x48c(0x01)
	char bApplyImpulseOnDamage : 1; // 0x48c(0x01)
	char bSyncBodySleep : 1; // 0x48c(0x01)
	char *1e5038da00 : 1; // 0x48c(0x01)
	char *0f77398d5f : 1; // 0x48c(0x01)
	char *c1c03669ea : 1; // 0x48c(0x01)
	char bRenderCustomDepth : 1; // 0x48c(0x01)
	char pad_48C_7 : 1; // 0x48c(0x01)
	char pad_48D_0 : 7; // 0x48d(0x01)
	char *7ea77ae49c : 1; // 0x48d(0x01)
	char *d5b1d4efdd : 1; // 0x48e(0x01)
	char *634898d6e3 : 1; // 0x48e(0x01)
	char pad_48E_2 : 6; // 0x48e(0x01)
	char pad_48F[0x1]; // 0x48f(0x01)
	enum class EDecalChannel DecalChannel; // 0x490(0x01)
	enum class *c276e29a27 IndoorOutdoorMask; // 0x491(0x01)
	struct FLightingChannels LightingChannels; // 0x492(0x03)
	enum class *5e872d5d99 IndirectLightingCacheQuality; // 0x495(0x01)
	bool CustomDepthStencilValue; // 0x496(0x01)
	enum class *e33f967072 CustomDepthStencilWriteMask; // 0x497(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x498(0x10)
	int32 TranslucencySortPriority; // 0x4a8(0x04)
	int32 *bc309c15af; // 0x4ac(0x04)
	char pad_4B0[0x4]; // 0x4b0(0x04)
	float LpvBiasMultiplier; // 0x4b4(0x04)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct FBodyInstance BodyInstance; // 0x4c0(0x240)
	char pad_700[0x8]; // 0x700(0x08)
	enum class EHasCustomNavigableGeometry *36f10e7fa8; // 0x708(0x01)
	char pad_709[0x3b]; // 0x709(0x3b)
	float BoundsScale; // 0x744(0x04)
	float *990edc28ca; // 0x748(0x04)
	float *680d1c60d0; // 0x74c(0x04)
	float *ba01ced785; // 0x750(0x04)
	enum class *7235c251e5 CanBeCharacterBase; // 0x754(0x01)
	char pad_755[0x1]; // 0x755(0x01)
	enum class *7235c251e5 CanCharacterStepUpOn; // 0x756(0x01)
	char pad_757[0x1]; // 0x757(0x01)
	struct TArray<struct AActor*> *23831abfcf; // 0x758(0x10)
	struct TArray<struct UPrimitiveComponent*> *0c87b28730; // 0x768(0x10)
	char pad_778[0xb8]; // 0x778(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x830(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x840(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x850(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x860(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x870(0x10)
	char pad_880[0x10]; // 0x880(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x890(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x8a0(0x10)
	struct FMulticastDelegate OnClicked; // 0x8b0(0x10)
	struct FMulticastDelegate OnReleased; // 0x8c0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x8d0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x8e0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x8f0(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x900(0x10)
	char pad_910[0x28]; // 0x910(0x28)
	struct UPrimitiveComponent* *aef56929f8; // 0x938(0x08)
	struct UPrimitiveComponent* *0cf5ac713e; // 0x940(0x08)
	struct F*254b7d2b0f *162fbfca55; // 0x948(0x58)
	char pad_9A0[0x10]; // 0x9a0(0x10)

	bool *e9db8211c2(); // Function Engine.PrimitiveComponent.*e9db8211c2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb3e4
	bool *5ba0e047ef(); // Function Engine.PrimitiveComponent.*5ba0e047ef // Native|Public|BlueprintCallable // @ game+0x6bc308c
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x6bada30
	bool *83d2d5c58f(); // Function Engine.PrimitiveComponent.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7f28
	int32 *2355b14434(); // Function Engine.PrimitiveComponent.*2355b14434 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5558
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x6badbe4
	float *64501b49de(); // Function Engine.PrimitiveComponent.*64501b49de // Final|Native|Public|BlueprintCallable // @ game+0x6bc4250
	float *52312be303(); // Function Engine.PrimitiveComponent.*52312be303 // Final|Native|Public|BlueprintCallable // @ game+0x6bc5178
	void *28aecd6f59(); // Function Engine.PrimitiveComponent.*28aecd6f59 // Final|Native|Public|BlueprintCallable // @ game+0x6baae80
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x6bc6c74
	void *523a890fe3(); // Function Engine.PrimitiveComponent.*523a890fe3 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb606c
	void AddForceAtLocation(struct FVector force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba8c54
	void *4696406aa4(); // Function Engine.PrimitiveComponent.*4696406aa4 // Final|Native|Public|BlueprintCallable // @ game+0x6bb2428
	void *d97262aee0(); // Function Engine.PrimitiveComponent.*d97262aee0 // Native|Public|BlueprintCallable // @ game+0x6bc7318
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba91b4
	void *d81824b167(); // Function Engine.PrimitiveComponent.*d81824b167 // Final|Native|Public|BlueprintCallable // @ game+0x6bb73a0
	void *53ce351ab3(enum class ECollisionChannel Channel, enum class ECollisionResponse ReturnValue); // Function Engine.PrimitiveComponent.*53ce351ab3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2460
	void SetAllPhysicsLinearVelocity(struct FVector NewVel); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc2f8c
	struct FName SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x6bc76ec
	struct TArray<struct F*0f151f07b7> *2457fa2026(); // Function Engine.PrimitiveComponent.*2457fa2026 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb568c
	struct FVector *c547ccf43f(); // Function Engine.PrimitiveComponent.*c547ccf43f // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb1f7c
	int32 *2a28a4ceb1(); // Function Engine.PrimitiveComponent.*2a28a4ceb1 // Final|Native|Public|BlueprintCallable // @ game+0x6bc5210
	struct UMaterialInterface* *b8614f6ee8(); // Function Engine.PrimitiveComponent.*b8614f6ee8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4ccc
	struct FVector GetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xe2640c
	float *c0fc59eca2(); // Function Engine.PrimitiveComponent.*c0fc59eca2 // Native|Public|BlueprintCallable // @ game+0x6bc2df8
	bool *48b0674a6b(); // Function Engine.PrimitiveComponent.*48b0674a6b // Final|Native|Public|BlueprintCallable // @ game+0x6bb72c0
	struct FName *2726371f61(); // Function Engine.PrimitiveComponent.*2726371f61 // Native|Public|BlueprintCallable // @ game+0x6bc8c0c
	enum class ECollisionEnabled *8e06d61cd2(); // Function Engine.PrimitiveComponent.*8e06d61cd2 // Native|Public|BlueprintCallable // @ game+0xdab868
	bool *7d15f33df8(); // Function Engine.PrimitiveComponent.*7d15f33df8 // Native|Public|BlueprintCallable // @ game+0xe2de98
	bool *2fcd5dc4f1(); // Function Engine.PrimitiveComponent.*2fcd5dc4f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7fc8
	struct APawn* *af2cc12a58(bool ReturnValue); // Function Engine.PrimitiveComponent.*af2cc12a58 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6baa800
	void *6147859fcb(int32 FaceIndex, struct UMaterialInterface* ReturnValue); // Function Engine.PrimitiveComponent.*6147859fcb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4d70
	void *b8cf4b4c35(); // Function Engine.PrimitiveComponent.*b8cf4b4c35 // Final|Native|Public|BlueprintCallable // @ game+0x6bc7e50
	void *e13e475844(); // Function Engine.PrimitiveComponent.*e13e475844 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb71dc
	void SetCollisionObjectType(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x6bc4944
	void *c32c2b30ad(struct FVector Origin); // Function Engine.PrimitiveComponent.*c32c2b30ad // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba9bc8
	void *3a3aa0f9aa(enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.*3a3aa0f9aa // Native|Public|BlueprintCallable // @ game+0x6bc4a70
	void *7f0b02410b(enum class EDOFMode ConstraintMode); // Function Engine.PrimitiveComponent.*7f0b02410b // Native|Public|BlueprintCallable // @ game+0x6bc4fe0
	void *714e0a606e(); // Function Engine.PrimitiveComponent.*714e0a606e // Final|Native|Public|BlueprintCallable // @ game+0x6bc52a0
	void *90432a4b88(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.*90432a4b88 // Native|Public|BlueprintCallable // @ game+0x6bc7658
	void *b735fad47e(int32 NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.*b735fad47e // Final|Native|Public|BlueprintCallable // @ game+0x6bc8968
	void *4fedb1a6a3(); // Function Engine.PrimitiveComponent.*4fedb1a6a3 // Native|Public|BlueprintCallable // @ game+0x6bc68d8
	void *e87bee575d(); // Function Engine.PrimitiveComponent.*e87bee575d // Final|Native|Public|BlueprintCallable // @ game+0x6bc73b0
	float *aaacbbdb6c(); // Function Engine.PrimitiveComponent.*aaacbbdb6c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5da4b2c
	struct F*705bbdf923 *78d8a0af1f(); // Function Engine.PrimitiveComponent.*78d8a0af1f // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bc930c
	struct FName SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc45d4
	float *19a69f011f(); // Function Engine.PrimitiveComponent.*19a69f011f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb227c
	struct FName *0de970a16f(); // Function Engine.PrimitiveComponent.*0de970a16f // Final|Native|Public|BlueprintCallable // @ game+0x6bbf17c
	struct FName SetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xdf5f78
	bool AddAngularImpulse(); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba8240
	struct FName AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba92f4
	struct UMaterialInterface* SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0xe4e7cc
	float *74fc74b263(); // Function Engine.PrimitiveComponent.*74fc74b263 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4c0c
	void *bd0ec46553(struct FVector NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.*bd0ec46553 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc2e94
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x6bbdc54
	void *48305203f7(); // Function Engine.PrimitiveComponent.*48305203f7 // Native|Public|BlueprintCallable // @ game+0x6bc6d58
	void *d260a6c731(enum class ECollisionChannel ReturnValue); // Function Engine.PrimitiveComponent.*d260a6c731 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2400
	void *47ec021dd1(); // Function Engine.PrimitiveComponent.*47ec021dd1 // Native|Public|BlueprintCallable // @ game+0x6bbf6f0
	void *40b80e1f86(float ReturnValue); // Function Engine.PrimitiveComponent.*40b80e1f86 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb12fc
	void *04a08b51bb(); // Function Engine.PrimitiveComponent.*04a08b51bb // Native|Public|BlueprintCallable // @ game+0x5e1c720
	void CreateAndSetMaterialInstanceDynamic(struct UMaterialInstanceDynamic* ReturnValue); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x6badb40
	void *7614d2f54e(bool ReturnValue); // Function Engine.PrimitiveComponent.*7614d2f54e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7b68
	void *603b323c81(); // Function Engine.PrimitiveComponent.*603b323c81 // Final|Native|Public|BlueprintCallable // @ game+0x6baae9c
	void *448cf7e0f2(); // Function Engine.PrimitiveComponent.*448cf7e0f2 // Native|Public|BlueprintCallable // @ game+0x6bca848
	void *0f1b74141b(); // Function Engine.PrimitiveComponent.*0f1b74141b // Final|Native|Public|BlueprintCallable // @ game+0x6bc7500
	void AddTorque(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6baa088
	bool K2_LineTraceComponent(); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbb474
	struct FName *2e26aaaf30(); // Function Engine.PrimitiveComponent.*2e26aaaf30 // Native|Public|BlueprintCallable // @ game+0x6bc49dc
	struct FVector GetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb5fbc
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5a2c
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4be0
	bool *09ce12ba0b(); // Function Engine.PrimitiveComponent.*09ce12ba0b // Native|Public|BlueprintCallable // @ game+0x6bc6b48
	bool *85d8176587(); // Function Engine.PrimitiveComponent.*85d8176587 // Native|Public|BlueprintCallable // @ game+0x6bb7678
	bool *6cbdd1633c(); // Function Engine.PrimitiveComponent.*6cbdd1633c // Final|Native|Public|BlueprintCallable // @ game+0x6bc7ee4
	bool *90cc3021c0(); // Function Engine.PrimitiveComponent.*90cc3021c0 // Final|Native|Public|BlueprintCallable // @ game+0x6bc7f78
	struct UClass* GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5834
	void *083545280a(struct TArray<struct UPrimitiveComponent*> ReturnValue); // Function Engine.PrimitiveComponent.*083545280a // Final|Native|Public|BlueprintCallable // @ game+0x6badab8
	void SetPhysicsAngularVelocity(struct FVector NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xde91c4
	void *8022a6e53e(float Strength, enum class *cb41f937c0 Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.*8022a6e53e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba99f4
	void *67e552295b(); // Function Engine.PrimitiveComponent.*67e552295b // Native|Public|BlueprintCallable // @ game+0x6bc4b08
	void *f1e65a30d8(struct FName BoneName, struct FVector ReturnValue); // Function Engine.PrimitiveComponent.*f1e65a30d8 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfbfc
	void AddForceAtLocationLocal(struct FVector force); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba8da0
	void *6e71cecd23(struct FVector ReturnValue); // Function Engine.PrimitiveComponent.*6e71cecd23 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3c64
	void CreateDynamicMaterialInstance(int32 ElementIndex, struct UMaterialInterface* SourceMaterial); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x6badcd4
	void *95fc0388db(); // Function Engine.PrimitiveComponent.*95fc0388db // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb440
	bool AddForce(); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba8b14
	enum class ECollisionEnabled *99eb55293a(); // Function Engine.PrimitiveComponent.*99eb55293a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb23d8
	bool *419ebb4754(); // Function Engine.PrimitiveComponent.*419ebb4754 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb410
	bool *638da52b6d(); // Function Engine.PrimitiveComponent.*638da52b6d // Final|Native|Public|BlueprintCallable // @ game+0x6bc44a8
	float SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x6bc683c
};

// Class Engine.MeshComponent
// Size: 0xab0 (Inherited: 0x9b0)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x9a8(0x10)
	char pad_9C0[0xf0]; // 0x9c0(0xf0)

	struct TArray<struct UMaterialInterface*> *9bc7eb317f(); // Function Engine.MeshComponent.*9bc7eb317f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4f48
	bool *7c084373ce(); // Function Engine.MeshComponent.*7c084373ce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7d40
	int32 *372cae974e(); // Function Engine.MeshComponent.*372cae974e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4e14
	void *e12aafe669(struct TArray<struct FName> ReturnValue); // Function Engine.MeshComponent.*e12aafe669 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4ebc
	void *dd190eacfc(); // Function Engine.MeshComponent.*dd190eacfc // Final|Native|Public|BlueprintCallable // @ game+0x9a8fbc
	void *00ffa1d77b(struct FVector ParameterValue); // Function Engine.MeshComponent.*00ffa1d77b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xd354b0
};

// Class Engine.StaticMeshComponent
// Size: 0xb50 (Inherited: 0xab0)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xab0(0x04)
	int32 *9f0fda2ed8; // 0xab4(0x04)
	bool bOverrideMinLOD; // 0xab8(0x01)
	char pad_AB9[0x3]; // 0xab9(0x03)
	int32 MinLOD; // 0xabc(0x04)
	struct UStaticMesh* StaticMesh; // 0xac0(0x08)
	bool bOverrideWireframeColor; // 0xac8(0x01)
	char pad_AC9[0x3]; // 0xac9(0x03)
	struct FColor WireframeColorOverride; // 0xacc(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xad0(0x10)
	char *138a858590 : 1; // 0xae0(0x01)
	char *c1a735b803 : 1; // 0xae0(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xae0(0x01)
	char *b431fce4a2 : 1; // 0xae0(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xae0(0x01)
	char bOverrideLightMapRes : 1; // 0xae0(0x01)
	char pad_AE0_6 : 2; // 0xae0(0x01)
	char pad_AE1[0x3]; // 0xae1(0x03)
	int32 OverriddenLightMapRes; // 0xae4(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xae8(0x01)
	char pad_AE8_1 : 7; // 0xae8(0x01)
	char pad_AE9[0x3]; // 0xae9(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xaec(0x04)
	float StreamingDistanceMultiplier; // 0xaf0(0x04)
	int32 *12d8adf087; // 0xaf4(0x04)
	char *402c8627cc : 1; // 0xaf8(0x01)
	char pad_AF8_1 : 7; // 0xaf8(0x01)
	char pad_AF9[0x7]; // 0xaf9(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xb00(0x10)
	struct TArray<struct F*87fceb50c7> *5ff7bc7629; // 0xb10(0x10)
	struct TArray<struct F*8760f7f7d5> *ad72999b02; // 0xb20(0x10)
	bool *24446b5829; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	struct F*2ca2c467d8 LightmassSettings; // 0xb34(0x18)
	char pad_B4C[0x4]; // 0xb4c(0x04)

	int32 *11ee32cc52(); // Function Engine.StaticMeshComponent.*11ee32cc52 // Final|Native|Public|BlueprintCallable // @ game+0x6bc5794
	struct FVector *8243903fcf(); // Function Engine.StaticMeshComponent.*8243903fcf // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4ad8
	bool SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x663ac24
	struct UStaticMesh* OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x6bbe00c
};

// Class Engine.SkinnedMeshComponent
// Size: 0xc50 (Inherited: 0xab0)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xab0(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xab8(0x08)
	char pad_AC0[0x60]; // 0xac0(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb20(0x01)
	char pad_B20_1 : 7; // 0xb20(0x01)
	char pad_B21[0x7]; // 0xb21(0x07)
	struct TArray<struct FBoxSphereBounds> *7e707d842a; // 0xb28(0x10)
	char pad_B38[0x20]; // 0xb38(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xb58(0x08)
	int32 ForcedLodModel; // 0xb60(0x04)
	int32 MinLodModel; // 0xb64(0x04)
	char pad_B68[0x10]; // 0xb68(0x10)
	struct TArray<struct F*716b1d68f9> LODInfo; // 0xb78(0x10)
	float StreamingDistanceMultiplier; // 0xb88(0x04)
	struct FColor WireframeColor; // 0xb8c(0x04)
	char *3f2cd63a77 : 1; // 0xb90(0x01)
	char *f9ca417f7f : 1; // 0xb90(0x01)
	char bDisableMorphTarget : 1; // 0xb90(0x01)
	char *490444df87 : 1; // 0xb90(0x01)
	char pad_B90_4 : 4; // 0xb90(0x01)
	char pad_B91[0x17]; // 0xb91(0x17)
	char bPerBoneMotionBlur : 1; // 0xba8(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xba8(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xba8(0x01)
	char bSyncAttachParentLOD : 1; // 0xba8(0x01)
	char pad_BA8_4 : 4; // 0xba8(0x01)
	char pad_BA9[0x3]; // 0xba9(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xbac(0x01)
	char pad_BAD[0x3]; // 0xbad(0x03)
	char *6f302faed4 : 1; // 0xbb0(0x01)
	char *71246305c4 : 1; // 0xbb0(0x01)
	char *8f160de05a : 1; // 0xbb0(0x01)
	char pad_BB0_3 : 5; // 0xbb0(0x01)
	char pad_BB1[0x3]; // 0xbb1(0x03)
	bool *f69c993587; // 0xbb4(0x01)
	char pad_BB5[0x3]; // 0xbb5(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xbb8(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xbb8(0x01)
	char pad_BB8_2 : 6; // 0xbb8(0x01)
	char pad_BB9[0x3]; // 0xbb9(0x03)
	char bRenderStatic : 1; // 0xbbc(0x01)
	char pad_BBC_1 : 7; // 0xbbc(0x01)
	char pad_BBD[0x3]; // 0xbbd(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xbc0(0x04)
	char *b1a1d2d22b : 1; // 0xbc4(0x01)
	char pad_BC4_1 : 7; // 0xbc4(0x01)
	char pad_BC5[0xf]; // 0xbc5(0x0f)
	struct FBoxSphereBounds *e8d742ebf8; // 0xbd4(0x1c)
	bool *4378cc44ba; // 0xbf0(0x01)
	bool bEnableUpdateRateOptimizations; // 0xbf1(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xbf2(0x01)
	char pad_BF3[0x4e]; // 0xbf3(0x4e)
	bool *55af0130d7; // 0xc41(0x01)
	bool *78147857b9; // 0xc42(0x01)
	char pad_C43[0xd]; // 0xc43(0x0d)

	void *4394f2b79a(int32 ReturnValue); // Function Engine.SkinnedMeshComponent.*4394f2b79a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bed9b8
	void *838df13444(struct FName BoneName); // Function Engine.SkinnedMeshComponent.*838df13444 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee1a8
	void *026700c446(); // Function Engine.SkinnedMeshComponent.*026700c446 // Final|Native|Public|BlueprintCallable // @ game+0x6c0e6bc
	void *68bb8d275b(struct FName BoneName, struct FName ParentBoneName, bool ReturnValue); // Function Engine.SkinnedMeshComponent.*68bb8d275b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bd51bc
	void *ba1220499b(); // Function Engine.SkinnedMeshComponent.*ba1220499b // Final|Native|Public|BlueprintCallable // @ game+0x6c0e168
	void *e158c5febe(); // Function Engine.SkinnedMeshComponent.*e158c5febe // Final|Native|Public|BlueprintCallable // @ game+0x6c14c28
	void *8f2840426b(struct USkinnedMeshComponent* NewMasterBoneComponent); // Function Engine.SkinnedMeshComponent.*8f2840426b // Final|Native|Public|BlueprintCallable // @ game+0x6c14af8
	void *c3e2b97429(struct FName BoneName); // Function Engine.SkinnedMeshComponent.*c3e2b97429 // Final|Native|Public|BlueprintCallable // @ game+0x6c23888
	void *4314e5075f(); // Function Engine.SkinnedMeshComponent.*4314e5075f // Final|Native|Public|BlueprintCallable // @ game+0x6bdc708
	void *cd65a7e2a2(struct FRotator InRotation, struct FVector OutPosition, struct FRotator OutRotation); // Function Engine.SkinnedMeshComponent.*cd65a7e2a2 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c2327c
	void *10e2fc0989(); // Function Engine.SkinnedMeshComponent.*10e2fc0989 // Final|Native|Public|BlueprintCallable // @ game+0x6bf6470
	int32 GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6be8200
	struct FName *eac8bd7d31(); // Function Engine.SkinnedMeshComponent.*eac8bd7d31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0710
	int32 *d05921b40e(); // Function Engine.SkinnedMeshComponent.*d05921b40e // Final|Native|Public|BlueprintCallable // @ game+0x6c11e68
	struct FName *fbe2178ccc(); // Function Engine.SkinnedMeshComponent.*fbe2178ccc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6be84bc
	bool *1f742918c4(); // Function Engine.SkinnedMeshComponent.*1f742918c4 // Final|Native|Public|BlueprintCallable // @ game+0x6c0e60c
	struct FName *8612ed82dd(); // Function Engine.SkinnedMeshComponent.*8612ed82dd // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6be4ef8
	enum class *b8ba79008c *a26716e360(); // Function Engine.SkinnedMeshComponent.*a26716e360 // Final|Native|Public|BlueprintCallable // @ game+0x6bf4dcc
	bool *dafdadd3ee(); // Function Engine.SkinnedMeshComponent.*dafdadd3ee // Native|Public|BlueprintCallable // @ game+0x6c15b58
	bool SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x6c16f1c
	struct FRotator *ebb6e42b77(); // Function Engine.SkinnedMeshComponent.*ebb6e42b77 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c23650
	void SetSkinWeightOverride(int32 LODIndex, struct TArray<struct F*f86f4b653b> SkinWeights); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c170c8
	void *f9a2b14326(); // Function Engine.SkinnedMeshComponent.*f9a2b14326 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c1a248
	void *fa9a237ed2(int32 LODIndex); // Function Engine.SkinnedMeshComponent.*fa9a237ed2 // Final|Native|Public|BlueprintCallable // @ game+0x6bdc3a4
	void *b1f7e668fd(bool bNewValue); // Function Engine.SkinnedMeshComponent.*b1f7e668fd // Final|Native|Public|BlueprintCallable // @ game+0x6c16a88
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1150 (Inherited: 0xc50)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xc50(0x08)
	struct UClass* AnimClass; // 0xc58(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xc60(0x08)
	struct TArray<struct UAnimInstance*> *03c8c15a34; // 0xc68(0x10)
	struct UAnimInstance* *20e7dd5deb; // 0xc78(0x08)
	struct F*26e8fbfd7d AnimationData; // 0xc80(0x18)
	char pad_C98[0x30]; // 0xc98(0x30)
	struct TArray<struct FTransform> *9848550080; // 0xcc8(0x10)
	struct TArray<struct FTransform> *394e69fb9f; // 0xcd8(0x10)
	char pad_CE8[0x20]; // 0xce8(0x20)
	float GlobalAnimRateScale; // 0xd08(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd0c(0x01)
	enum class *05c097b6a7 PhysicsTransformUpdateMode; // 0xd0d(0x01)
	char pad_D0E[0x1]; // 0xd0e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd0f(0x01)
	char pad_D10[0x4]; // 0xd10(0x04)
	char pad_D14_0 : 1; // 0xd14(0x01)
	char *c4bdbb1cf4 : 1; // 0xd14(0x01)
	char pad_D14_2 : 1; // 0xd14(0x01)
	char *6421e28158 : 1; // 0xd14(0x01)
	char pad_D14_4 : 2; // 0xd14(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd14(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd14(0x01)
	char bDisableClothSimulation : 1; // 0xd15(0x01)
	char pad_D15_1 : 2; // 0xd15(0x01)
	char bCollideWithEnvironment : 1; // 0xd15(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd15(0x01)
	char bLocalSpaceSimulation : 1; // 0xd15(0x01)
	char *9d44ba5ec9 : 1; // 0xd15(0x01)
	char bResetAfterTeleport : 1; // 0xd15(0x01)
	char pad_D16_0 : 1; // 0xd16(0x01)
	char bNoSkeletonUpdate : 1; // 0xd16(0x01)
	char bPauseAnims : 1; // 0xd16(0x01)
	char *ed86ed2e15 : 1; // 0xd16(0x01)
	char bEnablePerPolyCollision : 1; // 0xd16(0x01)
	char *c01750e849 : 1; // 0xd16(0x01)
	char *83c65effe5 : 1; // 0xd16(0x01)
	char *240877b930 : 1; // 0xd16(0x01)
	char *c9d93e6eb3 : 1; // 0xd17(0x01)
	char *0aa5f65cc4 : 1; // 0xd17(0x01)
	char *764f80ac00 : 1; // 0xd17(0x01)
	char *f76af3c9c8 : 1; // 0xd17(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd17(0x01)
	char *ff27a462a4 : 1; // 0xd17(0x01)
	char pad_D17_6 : 2; // 0xd17(0x01)
	char *67eb3862bf : 1; // 0xd18(0x01)
	char pad_D18_1 : 7; // 0xd18(0x01)
	char pad_D19_0 : 2; // 0xd19(0x01)
	char bDefaultLooping : 1; // 0xd19(0x01)
	char bDefaultPlaying : 1; // 0xd19(0x01)
	char pad_D19_4 : 4; // 0xd19(0x01)
	uint16 *fb5365b7ee; // 0xd1a(0x02)
	float ClothBlendWeight; // 0xd1c(0x04)
	struct FVector *0e1553491d; // 0xd20(0x0c)
	char pad_D2C[0x4]; // 0xd2c(0x04)
	struct UBodySetup* BodySetup; // 0xd30(0x08)
	float TeleportDistanceThreshold; // 0xd38(0x04)
	float TeleportRotationThreshold; // 0xd3c(0x04)
	struct FVector *bf2f3285e7; // 0xd40(0x0c)
	char pad_D4C[0x4]; // 0xd4c(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xd50(0x10)
	char pad_D60[0xe0]; // 0xd60(0xe0)
	struct UClass* *cf624e37bc; // 0xe40(0x08)
	char pad_E48[0x1e8]; // 0xe48(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1030(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1038(0x08)
	float DefaultPosition; // 0x1040(0x04)
	float DefaultPlayRate; // 0x1044(0x04)
	uint32 *f2bafb289a; // 0x1048(0x04)
	float *9553518a1b; // 0x104c(0x04)
	char pad_1050[0x100]; // 0x1050(0x100)

	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee95c
	struct FName *0419cb3ccb(); // Function Engine.SkeletalMeshComponent.*0419cb3ccb // Final|Native|Public|BlueprintCallable // @ game+0x6be5500
	struct UAnimationAsset* SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x5450dc
	void *b948b16a82(struct FName InBoneName, float Swing1Angle, float TwistAngle); // Function Engine.SkeletalMeshComponent.*b948b16a82 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6be8fac
	void SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x6c16224
	void IsPlaying(bool ReturnValue); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf6aa8
	void *1ad9295ccf(struct FName BoneName); // Function Engine.SkeletalMeshComponent.*1ad9295ccf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6be83d0
	void *50e0bcf134(); // Function Engine.SkeletalMeshComponent.*50e0bcf134 // Final|Native|Public|BlueprintCallable // @ game+0x6c23918
	void *003dacf78a(); // Function Engine.SkeletalMeshComponent.*003dacf78a // Final|Native|Public|BlueprintCallable // @ game+0x6bdc2f4
	void *c9ffb0a8f1(); // Function Engine.SkeletalMeshComponent.*c9ffb0a8f1 // Final|Native|Public|BlueprintCallable // @ game+0x6c225c4
	void *3dac8111a3(); // Function Engine.SkeletalMeshComponent.*3dac8111a3 // Final|Native|Public|BlueprintCallable // @ game+0x6be68b8
	void *c1dca80d01(); // Function Engine.SkeletalMeshComponent.*c1dca80d01 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf06dc
	void GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee404
	void *aaaa810782(); // Function Engine.SkeletalMeshComponent.*aaaa810782 // Final|Native|Public|BlueprintCallable // @ game+0x6c099d0
	void *c11c201962(struct UAnimInstance* ReturnValue); // Function Engine.SkeletalMeshComponent.*c11c201962 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd9de70
	void *b8e56f4e02(); // Function Engine.SkeletalMeshComponent.*b8e56f4e02 // Final|Native|Public|BlueprintCallable // @ game+0x6c09658
	void *f4e23cce99(); // Function Engine.SkeletalMeshComponent.*f4e23cce99 // Final|Native|Public|BlueprintCallable // @ game+0x6c15c3c
	void *8681bde224(); // Function Engine.SkeletalMeshComponent.*8681bde224 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c1cd14
	bool *f469fdb44b(); // Function Engine.SkeletalMeshComponent.*f469fdb44b // Final|Native|Public|BlueprintCallable // @ game+0x6c10c98
	enum class EAnimationMode *8cafec350a(); // Function Engine.SkeletalMeshComponent.*8cafec350a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6be7aa4
	enum class EAnimationMode *df14d2ab1e(); // Function Engine.SkeletalMeshComponent.*df14d2ab1e // Final|Native|Public|BlueprintCallable // @ game+0x544f5c
	float *7be67dd09b(); // Function Engine.SkeletalMeshComponent.*7be67dd09b // Final|Native|Public|BlueprintCallable // @ game+0x6c03d80
	bool *205990b035(); // Function Engine.SkeletalMeshComponent.*205990b035 // Final|Native|Public|BlueprintCallable // @ game+0x6c0b29c
	bool *61816ece05(); // Function Engine.SkeletalMeshComponent.*61816ece05 // Final|Native|Public|BlueprintCallable // @ game+0x6c0b41c
	bool *ab93cff151(); // Function Engine.SkeletalMeshComponent.*ab93cff151 // Final|Native|Public|BlueprintCallable // @ game+0x6c0b208
	bool *fe54059013(); // Function Engine.SkeletalMeshComponent.*fe54059013 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf767c
	struct FName *37cb4dcade(bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.*37cb4dcade // Final|Native|Public|BlueprintCallable // @ game+0x6c0f138
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x5450c8
	void *b5ab3112e7(float Scale); // Function Engine.SkeletalMeshComponent.*b5ab3112e7 // Final|Native|Public|BlueprintCallable // @ game+0x6c0ecd8
	void *e2357a32d5(); // Function Engine.SkeletalMeshComponent.*e2357a32d5 // Final|Native|Public|BlueprintCallable // @ game+0x6c0f268
	void *85a1ba9962(struct UAnimInstance* ReturnValue); // Function Engine.SkeletalMeshComponent.*85a1ba9962 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6beeca0
	void *2e33e16a05(bool bEnableGravity, struct FName BoneName); // Function Engine.SkeletalMeshComponent.*2e33e16a05 // Final|Native|Public|BlueprintCallable // @ game+0x6c108e8
	void *df6d5c3668(); // Function Engine.SkeletalMeshComponent.*df6d5c3668 // Final|Native|Public|BlueprintCallable // @ game+0x6c109d4
	void *b0b3ecdf76(struct FName BoneName, bool ReturnValue); // Function Engine.SkeletalMeshComponent.*b0b3ecdf76 // Final|Native|Public|BlueprintCallable // @ game+0x6bf63c0
	void *cb275501dc(); // Function Engine.SkeletalMeshComponent.*cb275501dc // Final|Native|Public|BlueprintCallable // @ game+0x6c096fc
	void *06a4843213(bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.*06a4843213 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcf26c
	void *958b26bc5a(struct FName InBoneName, bool bNewSimulate); // Function Engine.SkeletalMeshComponent.*958b26bc5a // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xa16788
	void *216855f3f1(); // Function Engine.SkeletalMeshComponent.*216855f3f1 // Final|Native|Public|BlueprintCallable // @ game+0x6bd3f08
	bool PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x6c048c0
	float *b7e5815bfd(); // Function Engine.SkeletalMeshComponent.*b7e5815bfd // Final|Native|Public|BlueprintCallable // @ game+0x6c0b9dc
	bool *590bc738cc(); // Function Engine.SkeletalMeshComponent.*590bc738cc // Native|Public|BlueprintCallable // @ game+0x6c1537c
	struct FName *cb270d2b61(); // Function Engine.SkeletalMeshComponent.*cb270d2b61 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd7ed8
	void *ccd384fcae(); // Function Engine.SkeletalMeshComponent.*ccd384fcae // Final|Native|Public|BlueprintCallable // @ game+0x6be68d0
	bool *9b6a2e03c1(); // Function Engine.SkeletalMeshComponent.*9b6a2e03c1 // Final|Native|Public|BlueprintCallable // @ game+0xc83dac
	float SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0x545010
	bool *1e1fba0baa(); // Function Engine.SkeletalMeshComponent.*1e1fba0baa // Final|Native|Public|BlueprintCallable // @ game+0x6bf653c
	bool *2b1d6ec9be(); // Function Engine.SkeletalMeshComponent.*2b1d6ec9be // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c0b064
	struct FName *b19e6db2c0(); // Function Engine.SkeletalMeshComponent.*b19e6db2c0 // Native|Public|BlueprintCallable // @ game+0x6c0d21c
	struct UClass* SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x6c0c43c
	void *8c46bc1c4b(float ReturnValue); // Function Engine.SkeletalMeshComponent.*8c46bc1c4b // Final|Native|Public|BlueprintCallable // @ game+0x6be8b34
	void *45cb1ffac9(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.*45cb1ffac9 // Final|Native|Public|BlueprintCallable // @ game+0x5de5b04
	void *dbb8691526(); // Function Engine.SkeletalMeshComponent.*dbb8691526 // Final|Native|Public|BlueprintCallable // @ game+0x6c0b560
	void *1bc40094b4(bool ReturnValue); // Function Engine.SkeletalMeshComponent.*1bc40094b4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf4c84
	void *a73016fcab(struct FName MorphTargetName); // Function Engine.SkeletalMeshComponent.*a73016fcab // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bed8bc
	void *b38c1f41c3(bool bRemoveZeroWeight); // Function Engine.SkeletalMeshComponent.*b38c1f41c3 // Final|Native|Public|BlueprintCallable // @ game+0x6c14ef4
	void Play(bool bLooping); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0x545150
	void *a9d045c57e(); // Function Engine.SkeletalMeshComponent.*a9d045c57e // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bce93c
	void *ea3ca52eca(struct FVector force, struct FName BoneName, bool bAccelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.*ea3ca52eca // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcf0d8
};

// Class Engine.LightComponentBase
// Size: 0x4a0 (Inherited: 0x470)
struct ULightComponentBase : USceneComponent {
	struct FGuid *a686b10c5d; // 0x468(0x10)
	float Brightness; // 0x478(0x04)
	float Intensity; // 0x47c(0x04)
	struct FColor LightColor; // 0x480(0x04)
	char bAffectsWorld : 1; // 0x484(0x01)
	char CastShadows : 1; // 0x484(0x01)
	char CastStaticShadows : 1; // 0x484(0x01)
	char CastDynamicShadows : 1; // 0x484(0x01)
	char bAffectTranslucentLighting : 1; // 0x484(0x01)
	char bCastVolumetricShadow : 1; // 0x484(0x01)
	float IndirectLightingIntensity; // 0x488(0x04)
	float VolumetricScatteringIntensity; // 0x48c(0x04)
	bool *8f19adf142; // 0x490(0x01)
	char pad_495_6 : 2; // 0x495(0x01)
	char pad_496[0xa]; // 0x496(0x0a)

	void *be965cf688(); // Function Engine.LightComponentBase.*be965cf688 // Final|Native|Public|BlueprintCallable // @ game+0x6c0e804
	void *fde7343060(); // Function Engine.LightComponentBase.*fde7343060 // Final|Native|Public|BlueprintCallable // @ game+0x6c0e770
	void *5cae41be78(struct FLinearColor ReturnValue); // Function Engine.LightComponentBase.*5cae41be78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bece14
};

// Class Engine.LightComponent
// Size: 0x590 (Inherited: 0x4a0)
struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x498(0x04)
	float MaxDrawDistance; // 0x49c(0x04)
	float *787d5d6e14; // 0x4a0(0x04)
	char bUseTemperature : 1; // 0x4a4(0x01)
	int32 ShadowMapChannel; // 0x4a8(0x04)
	float MinRoughness; // 0x4b0(0x04)
	float ShadowResolutionScale; // 0x4b4(0x04)
	float ShadowBias; // 0x4b8(0x04)
	float ShadowSharpen; // 0x4bc(0x04)
	float ContactShadowLength; // 0x4c0(0x04)
	char InverseSquaredFalloff : 1; // 0x4c4(0x01)
	char CastTranslucentShadows : 1; // 0x4c4(0x01)
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x4c4(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x4c4(0x01)
	char pad_4C4_5 : 3; // 0x4c4(0x01)
	char pad_4C5[0x3]; // 0x4c5(0x03)
	struct FLightingChannels LightingChannels; // 0x4c8(0x03)
	char pad_4CB[0x5]; // 0x4cb(0x05)
	struct UMaterialInterface* LightFunctionMaterial; // 0x4d0(0x08)
	struct FVector LightFunctionScale; // 0x4d8(0x0c)
	char pad_4E4[0x4]; // 0x4e4(0x04)
	struct U*cf31a3bb9b* IESTexture; // 0x4e8(0x08)
	char bUseIESBrightness : 1; // 0x4f0(0x01)
	char pad_4F0_1 : 7; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	float IESBrightnessScale; // 0x4f4(0x04)
	float LightFunctionFadeDistance; // 0x4f8(0x04)
	float DisabledBrightness; // 0x4fc(0x04)
	char bEnableLightShaftBloom : 1; // 0x500(0x01)
	char pad_500_1 : 7; // 0x500(0x01)
	char pad_501[0x3]; // 0x501(0x03)
	float BloomScale; // 0x504(0x04)
	float BloomThreshold; // 0x508(0x04)
	struct FColor BloomTint; // 0x50c(0x04)
	bool bUseRayTracedDistanceFieldShadows; // 0x510(0x01)
	char pad_511[0x3]; // 0x511(0x03)
	float RayStartOffsetDepthScale; // 0x514(0x04)
	char pad_518[0x78]; // 0x518(0x78)

	float *5ca15ddb64(); // Function Engine.LightComponent.*5ca15ddb64 // Final|Native|Public|BlueprintCallable // @ game+0x6c13958
	float SetIntensity(); // Function Engine.LightComponent.SetIntensity // Final|Native|Public|BlueprintCallable // @ game+0x6c131b4
	struct UMaterialInterface* *63cb3ee82f(); // Function Engine.LightComponent.*63cb3ee82f // Final|Native|Public|BlueprintCallable // @ game+0x6c139f0
	struct U*cf31a3bb9b* *96c92cd704(); // Function Engine.LightComponent.*96c92cd704 // Final|Native|Public|BlueprintCallable // @ game+0x6c128b4
	float *6e138f82c4(); // Function Engine.LightComponent.*6e138f82c4 // Final|Native|Public|BlueprintCallable // @ game+0x6c0d044
	float *18a784e23c(); // Function Engine.LightComponent.*18a784e23c // Final|Native|Public|BlueprintCallable // @ game+0x6c0d0dc
	struct FVector *46e3ca3f4d(); // Function Engine.LightComponent.*46e3ca3f4d // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c13a80
	bool *258006e252(); // Function Engine.LightComponent.*258006e252 // Final|Native|Public|BlueprintCallable // @ game+0x6c10b08
	float *bce07c35db(); // Function Engine.LightComponent.*bce07c35db // Final|Native|Public|BlueprintCallable // @ game+0x6c1a8b4
	struct FColor *f46513e72c(); // Function Engine.LightComponent.*f46513e72c // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c0d174
	bool *32714f25cf(); // Function Engine.LightComponent.*32714f25cf // Final|Native|Public|BlueprintCallable // @ game+0x6c0afd0
	float *219ca27b92(); // Function Engine.LightComponent.*219ca27b92 // Final|Native|Public|BlueprintCallable // @ game+0x6c19130
	bool *cbc79675bf(); // Function Engine.LightComponent.*cbc79675bf // Final|Native|Public|BlueprintCallable // @ game+0x6c0af00
	void *a5a07d6e2d(float NewIntensity); // Function Engine.LightComponent.*a5a07d6e2d // Final|Native|Public|BlueprintCallable // @ game+0x6c12a00
	void *c0e895a11e(struct FLinearColor NewLightColor); // Function Engine.LightComponent.*c0e895a11e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c1366c
	void *bfb5d300ac(); // Function Engine.LightComponent.*bfb5d300ac // Final|Native|Public|BlueprintCallable // @ game+0x6c138c0
};

// Class Engine.PointLightComponent
// Size: 0x5b0 (Inherited: 0x590)
struct UPointLightComponent : ULightComponent {
	float Radius; // 0x588(0x04)
	float AttenuationRadius; // 0x58c(0x04)
	char bUseInverseSquaredFalloff : 1; // 0x590(0x01)
	float LightFalloffExponent; // 0x594(0x04)
	float SourceRadius; // 0x598(0x04)
	float SourceLength; // 0x59c(0x04)
	struct F*d176fa0a45 LightmassSettings; // 0x5a0(0x0c)

	void *80f81e4215(float bNewValue); // Function Engine.PointLightComponent.*80f81e4215 // Final|Native|Public|BlueprintCallable // @ game+0x6c17600
	void *5a24c02c9d(); // Function Engine.PointLightComponent.*5a24c02c9d // Final|Native|Public|BlueprintCallable // @ game+0x6c17568
	void *485d6ff949(); // Function Engine.PointLightComponent.*485d6ff949 // Final|Native|Public|BlueprintCallable // @ game+0x6c13828
	void SetAttenuationRadius(float NewRadius); // Function Engine.PointLightComponent.SetAttenuationRadius // Final|Native|Public|BlueprintCallable // @ game+0x6c0ccfc
};

// Class Engine.SpotLightComponent
// Size: 0x5c0 (Inherited: 0x5b0)
struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x5b0(0x04)
	float OuterConeAngle; // 0x5b4(0x04)
	float *5fa0a48a2c; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)

	float *af3a4a82b2(); // Function Engine.SpotLightComponent.*af3a4a82b2 // Final|Native|Public|BlueprintCallable // @ game+0x6c15a2c
	float *6410d64b8b(); // Function Engine.SpotLightComponent.*6410d64b8b // Final|Native|Public|BlueprintCallable // @ game+0x6c12b30
};

// Class Engine.*fc2452f674
// Size: 0x38 (Inherited: 0x30)
struct U*fc2452f674 : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.*ee34789f9a
// Size: 0x38 (Inherited: 0x38)
struct U*ee34789f9a : U*fc2452f674 {
};

// Class Engine.*803292ecaa
// Size: 0x30 (Inherited: 0x30)
struct U*803292ecaa : UObject {
};

// Class Engine.*0ad023d030
// Size: 0x48 (Inherited: 0x30)
struct U*0ad023d030 : UObject {
	char bCausedByWorld : 1; // 0x30(0x01)
	char bScaleMomentumByMass : 1; // 0x30(0x01)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char pad_30_3 : 5; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DamageImpulse; // 0x34(0x04)
	float DestructibleImpulse; // 0x38(0x04)
	float DestructibleDamageSpreadScale; // 0x3c(0x04)
	float DamageFalloff; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.MovementComponent
// Size: 0x250 (Inherited: 0x200)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x200(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x208(0x08)
	char pad_210[0x4]; // 0x210(0x04)
	struct FVector Velocity; // 0x214(0x0c)
	char bConstrainToPlane : 1; // 0x220(0x01)
	char bSnapToPlaneAtStart : 1; // 0x220(0x01)
	char pad_220_2 : 6; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	enum class EPlaneConstraintAxisSetting *d76c010af6; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	struct FVector PlaneConstraintNormal; // 0x228(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x234(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x240(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x240(0x01)
	char bTickBeforeOwner : 1; // 0x240(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x240(0x01)
	char pad_240_4 : 4; // 0x240(0x01)
	char pad_241[0xf]; // 0x241(0x0f)

	void *c2ac81da0f(float ReturnValue); // Function Engine.MovementComponent.*c2ac81da0f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3098
	void *b83a90d09d(enum class EPlaneConstraintAxisSetting ReturnValue); // Function Engine.MovementComponent.*b83a90d09d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb61c8
	void *3d7e8f3f5f(); // Function Engine.MovementComponent.*3d7e8f3f5f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7a6c
	void *0f8844a2ec(); // Function Engine.MovementComponent.*0f8844a2ec // Native|Public|BlueprintCallable // @ game+0x6bc98c4
	void *db92e1435e(); // Function Engine.MovementComponent.*db92e1435e // Native|Public|BlueprintCallable // @ game+0x6bca22c
	void *55451031c8(float ReturnValue); // Function Engine.MovementComponent.*55451031c8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5084
	void *852b92179c(); // Function Engine.MovementComponent.*852b92179c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc7a58
	void *164ca92a58(); // Function Engine.MovementComponent.*164ca92a58 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc794c
	void *87d489219e(struct FVector ReturnValue); // Function Engine.MovementComponent.*87d489219e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6208
	void *3d190c2b6f(struct FVector PlaneOrigin); // Function Engine.MovementComponent.*3d190c2b6f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc7afc
	void K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb124
	void *1d3512d465(struct FVector ReturnValue); // Function Engine.MovementComponent.*1d3512d465 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bad858
	void *9c2738870a(struct FVector Delta, struct FRotator NewRotation); // Function Engine.MovementComponent.*9c2738870a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbb7e0
	struct FVector *d4fa247c58(); // Function Engine.MovementComponent.*d4fa247c58 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb61e0
	struct APhysicsVolume* *1f50dc4b23(); // Function Engine.MovementComponent.*1f50dc4b23 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb617c
	float K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb17c
	struct FVector *2b7152691b(); // Function Engine.MovementComponent.*2b7152691b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bad6c8
	struct FVector ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bad790
	struct APhysicsVolume* PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0xd15fb4
	enum class EPlaneConstraintAxisSetting *12a8e3120c(); // Function Engine.MovementComponent.*12a8e3120c // Native|Public|BlueprintCallable // @ game+0x6bc7820
	struct USceneComponent* *581d945228(); // Function Engine.MovementComponent.*581d945228 // Native|Public|BlueprintCallable // @ game+0x6bc8b78
	bool *0b63448c67(); // Function Engine.MovementComponent.*0b63448c67 // Native|Public|BlueprintCallable // @ game+0x6bc78b4
};

// Class Engine.NavMovementComponent
// Size: 0x280 (Inherited: 0x250)
struct UNavMovementComponent : UMovementComponent {
	struct F*ae60ea2542 NavAgentProps; // 0x248(0x20)
	float *2e58ec43d4; // 0x268(0x04)
	char *83fb68c948 : 1; // 0x26c(0x01)
	char bUseAccelerationForPaths : 1; // 0x26c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x26c(0x01)
	struct F*060c159331 *a415b23328; // 0x270(0x04)
	char pad_278_3 : 5; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)

	bool *927cff7993(); // Function Engine.NavMovementComponent.*927cff7993 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7e60
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x6bc9be0
	void *07aed04f02(); // Function Engine.NavMovementComponent.*07aed04f02 // Final|Native|Public|BlueprintCallable // @ game+0x6bca244
	bool *63df202894(); // Function Engine.NavMovementComponent.*63df202894 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7a14
	bool IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7b18
	bool *538e672bae(); // Function Engine.NavMovementComponent.*538e672bae // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7b40
	bool *b7c59c950e(); // Function Engine.NavMovementComponent.*b7c59c950e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8234
};

// Class Engine.PawnMovementComponent
// Size: 0x290 (Inherited: 0x280)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *99875154bc; // 0x280(0x08)
	char pad_288[0x8]; // 0x288(0x08)

	void *ec5c491810(bool ReturnValue); // Function Engine.PawnMovementComponent.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7e38
	void *74bbcbd06c(struct FVector WorldVector); // Function Engine.PawnMovementComponent.*74bbcbd06c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba9440
	void *8efd791461(); // Function Engine.PawnMovementComponent.*8efd791461 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5f18
	void *6f20605fa3(struct FVector ReturnValue); // Function Engine.PawnMovementComponent.*6f20605fa3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb49f8
	void *e1674e808d(struct FVector ReturnValue); // Function Engine.PawnMovementComponent.*e1674e808d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bad920
	void K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb0f0
	void *2d3b0c617b(); // Function Engine.PawnMovementComponent.*2d3b0c617b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5f00
};

// Class Engine.CharacterMovementComponent
// Size: 0x930 (Inherited: 0x290)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_290[0x8]; // 0x290(0x08)
	struct ACharacter* *479080a547; // 0x298(0x08)
	char bApplyGravityWhileJumping : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float GravityScale; // 0x2a4(0x04)
	float MaxStepHeight; // 0x2a8(0x04)
	float JumpZVelocity; // 0x2ac(0x04)
	float JumpOffJumpZFactor; // 0x2b0(0x04)
	float *83e8ebe44b; // 0x2b4(0x04)
	float *722c71f33c; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	float *82b606161e; // 0x2c0(0x04)
	float *fdb6771fd8; // 0x2c4(0x04)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	enum class EMovementMode MovementMode; // 0x2d0(0x01)
	bool CustomMovementMode; // 0x2d1(0x01)
	char pad_2D2[0x1e]; // 0x2d2(0x1e)
	float GroundFriction; // 0x2f0(0x04)
	float MaxWalkSpeed; // 0x2f4(0x04)
	float MaxWalkSpeedCrouched; // 0x2f8(0x04)
	float MaxSwimSpeed; // 0x2fc(0x04)
	float MaxFlySpeed; // 0x300(0x04)
	float MaxCustomMovementSpeed; // 0x304(0x04)
	float MaxAcceleration; // 0x308(0x04)
	float BrakingFrictionFactor; // 0x30c(0x04)
	float BrakingFriction; // 0x310(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x314(0x01)
	char pad_314_1 : 7; // 0x314(0x01)
	char pad_315[0x3]; // 0x315(0x03)
	float BrakingDecelerationWalking; // 0x318(0x04)
	float BrakingDecelerationFalling; // 0x31c(0x04)
	float BrakingDecelerationSwimming; // 0x320(0x04)
	float BrakingDecelerationFlying; // 0x324(0x04)
	float AirControl; // 0x328(0x04)
	float AirControlBoostMultiplier; // 0x32c(0x04)
	float AirControlBoostVelocityThreshold; // 0x330(0x04)
	float FallingLateralFriction; // 0x334(0x04)
	float CrouchedHalfHeight; // 0x338(0x04)
	float PronedHalfHeight; // 0x33c(0x04)
	float PronedRadius; // 0x340(0x04)
	float Buoyancy; // 0x344(0x04)
	float PerchRadiusThreshold; // 0x348(0x04)
	float PerchAdditionalHeight; // 0x34c(0x04)
	struct FRotator RotationRate; // 0x350(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x35c(0x01)
	char bOrientRotationToMovement : 1; // 0x35c(0x01)
	char bSweepWhileNavWalking : 1; // 0x35c(0x01)
	char pad_35C_3 : 2; // 0x35c(0x01)
	char *26cb6c84f1 : 1; // 0x35c(0x01)
	char *507ceb7bfc : 1; // 0x35c(0x01)
	char bForceMaxAccel : 1; // 0x35c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x35d(0x01)
	char bForceNextFloorCheck : 1; // 0x35d(0x01)
	char *19469483f8 : 1; // 0x35d(0x01)
	char bCanWalkOffLedges : 1; // 0x35d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x35d(0x01)
	char pad_35D_5 : 2; // 0x35d(0x01)
	char *11b8c860ec : 1; // 0x35d(0x01)
	char *7f0c890fda : 1; // 0x35e(0x01)
	char pad_35E_1 : 7; // 0x35e(0x01)
	char pad_35F[0x1]; // 0x35f(0x01)
	struct USceneComponent* *6d8897b5ca; // 0x360(0x08)
	float MaxOutOfWaterStepHeight; // 0x368(0x04)
	float OutofWaterZ; // 0x36c(0x04)
	float Mass; // 0x370(0x04)
	bool bEnablePhysicsInteraction; // 0x374(0x01)
	bool bTouchForceScaledToMass; // 0x375(0x01)
	bool bPushForceScaledToMass; // 0x376(0x01)
	bool bPushForceUsingZOffset; // 0x377(0x01)
	bool bScalePushForceToVelocity; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	float StandingDownwardForceScale; // 0x37c(0x04)
	float InitialPushForceFactor; // 0x380(0x04)
	float PushForceFactor; // 0x384(0x04)
	float PushForcePointZOffsetFactor; // 0x388(0x04)
	float TouchForceFactor; // 0x38c(0x04)
	float MinTouchForce; // 0x390(0x04)
	float MaxTouchForce; // 0x394(0x04)
	float RepulsionForce; // 0x398(0x04)
	char bForceBraking : 1; // 0x39c(0x01)
	char pad_39C_1 : 7; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	float CrouchedSpeedMultiplier; // 0x3a0(0x04)
	float UpperImpactNormalScale; // 0x3a4(0x04)
	struct FVector Acceleration; // 0x3a8(0x0c)
	struct FVector *eabc6b4d63; // 0x3b4(0x0c)
	struct FQuat *e96b7385d6; // 0x3c0(0x10)
	struct FVector *fed5f456bc; // 0x3d0(0x0c)
	float *8259a7a9d5; // 0x3dc(0x04)
	float *02e850e002; // 0x3e0(0x04)
	float *b407c9150e; // 0x3e4(0x04)
	struct FVector *3d04d1faed; // 0x3e8(0x0c)
	struct FVector *39b9fae469; // 0x3f4(0x0c)
	float *b94abc4f0d; // 0x400(0x04)
	char pad_404[0x8]; // 0x404(0x08)
	float MaxSimulationTimeStep; // 0x40c(0x04)
	int32 MaxSimulationIterations; // 0x410(0x04)
	float MaxDepenetrationWithGeometry; // 0x414(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x418(0x04)
	float MaxDepenetrationWithPawn; // 0x41c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x420(0x04)
	float *1d1c9d5d1a; // 0x424(0x04)
	float *4157bdca5f; // 0x428(0x04)
	float *ba1516f1be; // 0x42c(0x04)
	float *9f28b14cad; // 0x430(0x04)
	float *66dc603436; // 0x434(0x04)
	float *07991836b8; // 0x438(0x04)
	float *64d8e8110c; // 0x43c(0x04)
	float *5ef0e2e35c; // 0x440(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float *92e20fcab4; // 0x448(0x04)
	float *4fab791991; // 0x44c(0x04)
	float *86042875b9; // 0x450(0x04)
	float *188976dd19; // 0x454(0x04)
	float LedgeCheckThreshold; // 0x458(0x04)
	float JumpOutOfWaterPitch; // 0x45c(0x04)
	struct F*29683cadec CurrentFloor; // 0x460(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4f8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4f9(0x01)
	enum class EMovementMode *faf788f025; // 0x4fa(0x01)
	char pad_4FB[0x1]; // 0x4fb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityX : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityY : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4fc(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4fc(0x01)
	char bJustTeleported : 1; // 0x4fc(0x01)
	char *70c3d30791 : 1; // 0x4fc(0x01)
	char *acfd118ae1 : 1; // 0x4fc(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4fd(0x01)
	char bNotifyApex : 1; // 0x4fd(0x01)
	char *4321e5bacf : 1; // 0x4fd(0x01)
	char bWantsToCrouch : 1; // 0x4fd(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4fd(0x01)
	char pad_4FD_5 : 3; // 0x4fd(0x01)
	char pad_4FE[0x2]; // 0x4fe(0x02)
	enum class EStanceMode StanceMode; // 0x500(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x501(0x01)
	char pad_502[0x2]; // 0x502(0x02)
	char bIgnoreBaseRotation : 1; // 0x504(0x01)
	char *8670edea6f : 1; // 0x504(0x01)
	char bAlwaysCheckFloor : 1; // 0x504(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x504(0x01)
	char *e403872825 : 1; // 0x504(0x01)
	char *b1ee1c3f93 : 1; // 0x504(0x01)
	char bUseRVOAvoidance : 1; // 0x504(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x504(0x01)
	char pad_505[0xf]; // 0x505(0x0f)
	char *fe38a4d374 : 1; // 0x514(0x01)
	char *b6480ff259 : 1; // 0x514(0x01)
	char *4683070ca7 : 1; // 0x514(0x01)
	char pad_514_3 : 2; // 0x514(0x01)
	char bProjectNavMeshWalking : 1; // 0x514(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x514(0x01)
	char pad_514_7 : 1; // 0x514(0x01)
	char pad_515[0x13]; // 0x515(0x13)
	float AvoidanceConsiderationRadius; // 0x528(0x04)
	struct FVector *3430170cc5; // 0x52c(0x0c)
	int32 AvoidanceUID; // 0x538(0x04)
	struct F*c4bee3ea12 AvoidanceGroup; // 0x53c(0x04)
	struct F*c4bee3ea12 GroupsToAvoid; // 0x540(0x04)
	struct F*c4bee3ea12 GroupsToIgnore; // 0x544(0x04)
	float AvoidanceWeight; // 0x548(0x04)
	struct FVector *914bfba552; // 0x54c(0x0c)
	char pad_558[0xa8]; // 0x558(0xa8)
	float NavMeshProjectionInterval; // 0x600(0x04)
	float *8118c9d009; // 0x604(0x04)
	float NavMeshProjectionInterpSpeed; // 0x608(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x60c(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x610(0x04)
	float NavWalkingFloorDistTolerance; // 0x614(0x04)
	char pad_618[0xb0]; // 0x618(0xb0)
	struct F*4bffd29219 *a41d0f03b5; // 0x6c8(0x58)
	char pad_720[0x10]; // 0x720(0x10)
	float *035b3a9f9f; // 0x730(0x04)
	char pad_734[0x4]; // 0x734(0x04)
	struct FRootMotionSourceGroup *c7539c9e11; // 0x738(0x100)
	char pad_838[0x98]; // 0x838(0x98)
	struct F*515b98ffe7 *bd0a57294d; // 0x8d0(0x40)
	struct FVector *4c2486a6db; // 0x910(0x0c)
	bool *5fec1080f0; // 0x91c(0x01)
	char pad_91D[0x3]; // 0x91d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x920(0x01)
	char pad_920_1 : 7; // 0x920(0x01)
	char pad_921[0xf]; // 0x921(0x0f)

	float *9d924ae134(); // Function Engine.CharacterMovementComponent.*9d924ae134 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5058
	struct ACharacter* *44975c26ea(); // Function Engine.CharacterMovementComponent.*44975c26ea // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb202c
	struct FVector *b93a5543f3(); // Function Engine.CharacterMovementComponent.*b93a5543f3 // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x6bc9480
	int32 *4ed3e42e4c(); // Function Engine.CharacterMovementComponent.*4ed3e42e4c // Final|Native|Public|BlueprintCallable // @ game+0x6bc5d04
	float *db0f1d6afd(); // Function Engine.CharacterMovementComponent.*db0f1d6afd // Final|Native|Public|BlueprintCallable // @ game+0x6bc91dc
	struct FVector *ca70c823be(); // Function Engine.CharacterMovementComponent.*ca70c823be // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2cbc
	struct FVector AddImpulse(bool bVelocityChange); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba90b4
	void *f667569445(struct FVector CapsuleLocation, struct F*29683cadec FloorResult); // Function Engine.CharacterMovementComponent.*f667569445 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbabe0
	void *e102887b62(); // Function Engine.CharacterMovementComponent.*e102887b62 // Final|Native|Public|BlueprintCallable // @ game+0x6bc5bdc
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x6bae5d4
	void *e27d511e10(); // Function Engine.CharacterMovementComponent.*e27d511e10 // Native|Public|BlueprintCallable // @ game+0x6baae2c
	void *97cd786904(struct F*c4bee3ea12 GroupMask); // Function Engine.CharacterMovementComponent.*97cd786904 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bc37dc
	void *f54e2f4333(struct FVector ReturnValue); // Function Engine.CharacterMovementComponent.*f54e2f4333 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3c04
	void *8ac3f8d562(float BrakingDeceleration); // Function Engine.CharacterMovementComponent.*8ac3f8d562 // Native|Public|BlueprintCallable // @ game+0x6baa5e0
	void *c2656bf395(float ReturnValue); // Function Engine.CharacterMovementComponent.*c2656bf395 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5000
	void *0c71812783(); // Function Engine.CharacterMovementComponent.*0c71812783 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bc5c68
	void *4db894fcba(); // Function Engine.CharacterMovementComponent.*4db894fcba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6eac
	void *f3efc6a197(float ReturnValue); // Function Engine.CharacterMovementComponent.*f3efc6a197 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e5aef0
	void *865b67218d(int32 GroupFlags); // Function Engine.CharacterMovementComponent.*865b67218d // Final|Native|Public|BlueprintCallable // @ game+0x6bc3750
	void *e383b11c62(); // Function Engine.CharacterMovementComponent.*e383b11c62 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb3cc
	struct F*29683cadec *55d6bf611b(); // Function Engine.CharacterMovementComponent.*55d6bf611b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba73c
	bool *44e088037d(); // Function Engine.CharacterMovementComponent.*44e088037d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7e60
	struct UPrimitiveComponent* *52d57aeb3a(); // Function Engine.CharacterMovementComponent.*52d57aeb3a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb51b8
	float *cbcc333929(); // Function Engine.CharacterMovementComponent.*cbcc333929 // Final|Native|Public|BlueprintCallable // @ game+0x6bc7d1c
	bool *5eaed47ac8(); // Function Engine.CharacterMovementComponent.*5eaed47ac8 // Final|Native|Public|BlueprintCallable // @ game+0x6bc36bc
	float *e2444abdb4(); // Function Engine.CharacterMovementComponent.*e2444abdb4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4fd4
	float *7e042cca5d(); // Function Engine.CharacterMovementComponent.*7e042cca5d // Final|Native|Public|BlueprintCallable // @ game+0x6bc9274
	bool *e948ff09df(); // Function Engine.CharacterMovementComponent.*e948ff09df // Native|Public|BlueprintCallable // @ game+0x6bc7174
	float *a0ef2db392(); // Function Engine.CharacterMovementComponent.*a0ef2db392 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb12e4
	struct FHitResult CapsuleTouched(); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x6baa9e4
	struct FVector AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba8a70
	struct F*c4bee3ea12 *0fddc8929b(); // Function Engine.CharacterMovementComponent.*0fddc8929b // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bc5d90
	void *98562927be(float ReturnValue); // Function Engine.CharacterMovementComponent.*98562927be // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb502c
	void *1471005205(float ReturnValue); // Function Engine.CharacterMovementComponent.*1471005205 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5f70
	void *f6cb9100e3(); // Function Engine.CharacterMovementComponent.*f6cb9100e3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb150
	void *8faddce97d(); // Function Engine.CharacterMovementComponent.*8faddce97d // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8284
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintFunctionLibrary : UObject {
};

// Class Engine.StaticMeshActor
// Size: 0x408 (Inherited: 0x3f8)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3f8(0x08)
	bool bStaticMeshReplicateMovement; // 0x400(0x01)
	enum class ENavDataGatheringMode *44a20f5dab; // 0x401(0x01)
	char pad_402[0x6]; // 0x402(0x06)
};

// Class Engine.HUD
// Size: 0x4e0 (Inherited: 0x3f8)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x3f8(0x08)
	char bLostFocusPaused : 1; // 0x400(0x01)
	char bShowHUD : 1; // 0x400(0x01)
	char bShowDebugInfo : 1; // 0x400(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x400(0x01)
	char bShowOverlays : 1; // 0x400(0x01)
	char bEnableDebugTextShadow : 1; // 0x400(0x01)
	char pad_400_6 : 2; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct TArray<struct AActor*> *38b709293a; // 0x408(0x10)
	char pad_418[0x8]; // 0x418(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x420(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x430(0x10)
	struct UCanvas* Canvas; // 0x440(0x08)
	struct UCanvas* *f5943f676e; // 0x448(0x08)
	struct TArray<struct F*ed6dead525> *f79181af34; // 0x450(0x10)
	struct UClass* *6e615585cd; // 0x460(0x08)
	struct AActor* *fcbd63a8dd; // 0x468(0x08)
	char pad_470[0x70]; // 0x470(0x70)

	void DrawTexture(float ScreenH, float TextureU, float TextureV, float TextureUWidth, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6baf7a4
	void ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *62432812ee(float Param2, struct FVector Param3, struct FVector Param4, struct FColor Param5); // Function Engine.HUD.*62432812ee // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6ba85fc
	struct APawn* *34fff8859f(); // Function Engine.HUD.*34fff8859f // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5b70
	struct FName ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x370fbc
	struct FName ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x6bc952c
	bool *f44a827629(); // Function Engine.HUD.*f44a827629 // Final|Native|Public|BlueprintCallable // @ game+0x6bafcb4
	struct FVector Deproject(); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6badf80
	struct FName ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *0779b85564(); // Function Engine.HUD.*0779b85564 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6baf4ec
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0x5da6fac
	int32 ReceiveDrawHUD(int32 SizeY); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x370fbc
	void *f76c6f11ba(struct APlayerController* ReturnValue); // Function Engine.HUD.*f76c6f11ba // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5e7c26c
	void AddHitBox(int32 Priority); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6ba8eec
	void ShowDebugToggleSubCategory(struct FName Param0); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x6bc9668
	void ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x6bc95c0
	void *c08cd3997f(float ScreenY, float ScreenW, float ScreenH, float Scale); // Function Engine.HUD.*c08cd3997f // Final|Native|Public|BlueprintCallable // @ game+0x6baed28
	struct FVector2D *9b849b7b63(float ScreenY, float ScreenW, float ScreenH, float MaterialU); // Function Engine.HUD.*9b849b7b63 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bae8c0
	struct FLinearColor *8452ca1193(); // Function Engine.HUD.*8452ca1193 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6baefa0
	float *cfe6b2110e(); // Function Engine.HUD.*cfe6b2110e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bae694
	bool *957a89d132(); // Function Engine.HUD.*957a89d132 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x6bb0ea4
	float *c2fb95ac2b(float ScreenY, float ScreenW, float ScreenH); // Function Engine.HUD.*c2fb95ac2b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6baf310
	void *50b363f367(); // Function Engine.HUD.*50b363f367 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bbf3c0
	void *6ae72bf9b6(float OutWidth, float OutHeight, struct UFont* Font, float Scale); // Function Engine.HUD.*6ae72bf9b6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6964
	void Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbef64
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x370fbc
	void *82ab454e02(); // Function Engine.HUD.*82ab454e02 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bbf20c
};

// Class Engine.Brush
// Size: 0x430 (Inherited: 0x3f8)
struct ABrush : AActor {
	enum class *e0edfbd9de *8e17fb69f0; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	struct FColor BrushColor; // 0x3fc(0x04)
	int32 PolyFlags; // 0x400(0x04)
	char *7d8414377d : 1; // 0x404(0x01)
	char *f77657c03b : 1; // 0x404(0x01)
	char *8751e5918e : 1; // 0x404(0x01)
	char *ac8f2c7a93 : 1; // 0x404(0x01)
	char pad_404_4 : 4; // 0x404(0x01)
	char pad_405[0x3]; // 0x405(0x03)
	struct UModel* Brush; // 0x408(0x08)
	struct UBrushComponent* BrushComponent; // 0x410(0x08)
	char *98b8ef6f05 : 1; // 0x418(0x01)
	char pad_418_1 : 7; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct TArray<struct F*26d590dcc1> *1211ef514c; // 0x420(0x10)
};

// Class Engine.Volume
// Size: 0x430 (Inherited: 0x430)
struct AVolume : ABrush {
	enum class *e0edfbd9de *8e17fb69f0; // 0x3f8(0x01)
	struct FColor BrushColor; // 0x3fc(0x04)
	int32 PolyFlags; // 0x400(0x04)
	char *7d8414377d : 1; // 0x404(0x01)
	char *f77657c03b : 1; // 0x404(0x01)
	char *8751e5918e : 1; // 0x404(0x01)
	char *ac8f2c7a93 : 1; // 0x404(0x01)
	struct UModel* Brush; // 0x408(0x08)
	struct UBrushComponent* BrushComponent; // 0x410(0x08)
	char *98b8ef6f05 : 1; // 0x418(0x01)
	struct TArray<struct F*26d590dcc1> *1211ef514c; // 0x420(0x10)
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotify : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	char pad_60[0x10]; // 0x60(0x10)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.DataTable
// Size: 0x88 (Inherited: 0x30)
struct UDataTable : UObject {
	struct UScriptStruct* *eb864fa0b1; // 0x30(0x08)
	char pad_38[0x50]; // 0x38(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x458)
struct ACharacter : APawn {
	char bPressedJump : 1; // 0x458(0x01)
	char *0a07f40284 : 1; // 0x458(0x01)
	char *883f2946bb : 1; // 0x458(0x01)
	char *1bbc584058 : 1; // 0x458(0x01)
	char *5e33d65440 : 1; // 0x458(0x01)
	char *2551a88bff : 1; // 0x458(0x01)
	char *0da443813f : 1; // 0x458(0x01)
	char *3a904bf932 : 1; // 0x458(0x01)
	char bWasJumping : 1; // 0x459(0x01)
	char pad_459_1 : 7; // 0x459(0x01)
	char pad_45A[0x2]; // 0x45a(0x02)
	int32 JumpCurrentCount; // 0x45c(0x04)
	struct USkeletalMeshComponent* Mesh; // 0x460(0x08)
	struct F*d11a7f4b1f *e8a3c062a0; // 0x468(0x48)
	int32 JumpMaxCount; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct UCapsuleComponent* CapsuleComponent; // 0x4b8(0x08)
	float JumpMaxHoldTime; // 0x4c0(0x04)
	float JumpKeyHoldTime; // 0x4c4(0x04)
	struct F*d11a7f4b1f *4233f49e69; // 0x4c8(0x48)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x510(0x08)
	bool *33347614fc; // 0x518(0x01)
	bool *95854913ff; // 0x519(0x01)
	char pad_51A[0x2]; // 0x51a(0x02)
	struct FVector *05ff5e346b; // 0x51c(0x0c)
	float CrouchedEyeHeight; // 0x528(0x04)
	char bIsCrouched : 1; // 0x52c(0x01)
	char pad_52C_1 : 7; // 0x52c(0x01)
	char pad_52D[0x3]; // 0x52d(0x03)
	struct UCharacterMovementComponent* CharacterMovement; // 0x530(0x08)
	float *3ac7aa90de; // 0x538(0x04)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct FQuat *9c95665d3c; // 0x540(0x10)
	float *e4eda111d4; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	struct FMulticastDelegate OnReachedJumpApex; // 0x558(0x10)
	char pad_568[0x10]; // 0x568(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x578(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x588(0x10)
	struct FRootMotionSourceGroup *eae265d390; // 0x598(0x100)
	char pad_698[0x8]; // 0x698(0x08)
	struct F*515b98ffe7 *f5b54daaa1; // 0x6a0(0x40)
	struct TArray<struct F*2a96cdbee5> *f84fd203c5; // 0x6e0(0x10)
	struct F*0e21200897 *882a7f71ac; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	void *fb2473c60b(struct FRootMotionSourceGroup Param1, bool Param2, float Param3, struct FVector Param4, bool Param9, bool Param10, bool Param11); // Function Engine.Character.*fb2473c60b // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x900724
	void *b022a0a31e(); // Function Engine.Character.*b022a0a31e // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc1710
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x90173c
	struct FRotator *af5e11930f(); // Function Engine.Character.*af5e11930f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6baa4d4
	bool *cc63ed914a(); // Function Engine.Character.*cc63ed914a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc0984
	float OnWalkingOffLedge(); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xe2b75c
	bool Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x6badeb4
	bool *6a0e5b0286(); // Function Engine.Character.*6a0e5b0286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb80a8
	void *7e163b451c(); // Function Engine.Character.*7e163b451c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab3d4
	bool *221e5b49fe(); // Function Engine.Character.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x6bc8030
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x6bb835c
	void *ab9f13facc(float ReturnValue); // Function Engine.Character.*ab9f13facc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1328
	void *39955aa1ce(struct UAnimMontage* AnimMontage, float InPlayRate); // Function Engine.Character.*39955aa1ce // Native|Public|BlueprintCallable // @ game+0x6bbe60c
	void *ca090c119f(); // Function Engine.Character.*ca090c119f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb14f0
	void *1ce0ccef36(float Param0, struct FVector_NetQuantize10 Param1, struct FVector_NetQuantize100 Param2, bool Param7); // Function Engine.Character.*1ce0ccef36 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc13cc
	void *22fdf8e2aa(float Param0, struct FVector_NetQuantize10 Param1, struct FVector_NetQuantize100 Param6, bool Param7, bool Param8, uint32 Param9); // Function Engine.Character.*22fdf8e2aa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc0f04
	void CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6baa8a8
	void *ae290b6270(); // Function Engine.Character.*ae290b6270 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab3bc
	float K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *185bf39c1e(); // Function Engine.Character.*185bf39c1e // Native|Public|BlueprintCallable // @ game+0x6bca6a0
	float ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x7533c8
	bool *940da471e0(); // Function Engine.Character.*940da471e0 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6bab010
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0xb15db8
	float K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbd4d4
	bool K2_OnMovementModeChanged(); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *2442a24805(struct FVector ReturnValue); // Function Engine.Character.*2442a24805 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1538
	void *dd8777b92b(); // Function Engine.Character.*dd8777b92b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6e7c8c
	void IsJumpProvidingForce(bool ReturnValue); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e17734
	void *3f5ff0d280(); // Function Engine.Character.*3f5ff0d280 // Native|Public|BlueprintCallable // @ game+0x6bc9ef0
	void *109287e492(); // Function Engine.Character.*109287e492 // Final|Native|Public|BlueprintCallable // @ game+0x6bb2ce4
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x5e5f5ac
	void *74ba8d35b7(float Param0, struct FVector Param1, bool Param6, bool Param7); // Function Engine.Character.*74ba8d35b7 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x901238
	void *f183d7ae68(); // Function Engine.Character.*f183d7ae68 // Native|Public|BlueprintCallable // @ game+0x6bca1fc
	void ServerMove(bool Param4, uint32 Param5, struct UPrimitiveComponent* Param6, struct FName Param7); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc0008
	void CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x6baa8cc
	bool *426bbcfd1b(); // Function Engine.Character.*426bbcfd1b // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x902078
	struct FHitResult OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x370fbc
	bool *1add8d4ff4(); // Function Engine.Character.*1add8d4ff4 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc0404
	bool OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x370fbc
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *7f16fa6b8f(bool ReturnValue); // Function Engine.Character.*7f16fa6b8f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8084
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x5df1278
};

// Class Engine.Controller
// Size: 0x478 (Inherited: 0x3f8)
struct AController : AActor {
	char pad_3F8[0x10]; // 0x3f8(0x10)
	struct APawn* Pawn; // 0x408(0x08)
	struct USceneComponent* TransformComponent; // 0x410(0x08)
	struct APlayerState* PlayerState; // 0x418(0x08)
	char pad_420[0x14]; // 0x420(0x14)
	char *ac76c176b5 : 1; // 0x434(0x01)
	char *8f126e4c4b : 1; // 0x434(0x01)
	char pad_434_2 : 6; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	struct ACharacter* Character; // 0x438(0x08)
	char pad_440[0x8]; // 0x440(0x08)
	struct FName StateName; // 0x448(0x08)
	char pad_450[0x8]; // 0x450(0x08)
	struct FRotator *67a18bfbf4; // 0x458(0x0c)
	char pad_464[0x4]; // 0x464(0x04)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x468(0x10)

	void GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2830
	void *cfc621cd2f(); // Function Engine.Controller.*cfc621cd2f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8068
	void *e13b76f42a(struct AActor* Other, struct FVector ViewPoint, bool bAlternateChecks); // Function Engine.Controller.*e13b76f42a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd758
	void *4a6a8f3046(); // Function Engine.Controller.*4a6a8f3046 // Native|Public|BlueprintCallable // @ game+0x6bc60e8
	struct FRotator *ea60ba9b64(); // Function Engine.Controller.*ea60ba9b64 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc5078
	struct FRotator *2c0d9f2569(); // Function Engine.Controller.*2c0d9f2569 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bac918
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x6bca214
	bool *7e3667efd8(); // Function Engine.Controller.*7e3667efd8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7cf0
	bool *8e4ab02dd2(); // Function Engine.Controller.*8e4ab02dd2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7c84
	bool *ec5c491810(); // Function Engine.Controller.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7de8
	void *21b6505060(); // Function Engine.Controller.*21b6505060 // Native|Public|BlueprintCallable // @ game+0x6bbf6f0
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0xa917d0
	struct AActor* *3dcfe68cdd(); // Function Engine.Controller.*3dcfe68cdd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb70b0
	bool *78d24b5032(); // Function Engine.Controller.*78d24b5032 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x5f7e74
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x6c86f8
	struct APawn* K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb1a8
	bool *c997c1061d(); // Function Engine.Controller.*c997c1061d // Native|Public|BlueprintCallable // @ game+0x6bc6050
	void *bdd7417b98(); // Function Engine.Controller.*bdd7417b98 // Native|Public|BlueprintCallable // @ game+0x6bbf708
	struct APlayerController* *5d41444446(); // Function Engine.Controller.*5d41444446 // Final|Native|Public|BlueprintCallable // @ game+0x6baac38
	struct FRotator *b9246aa8a1(); // Function Engine.Controller.*b9246aa8a1 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2df0
	void *00bc40e59f(); // Function Engine.Controller.*00bc40e59f // Native|Public|BlueprintCallable // @ game+0x6bbf720
	struct APawn* Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x5dcd6d4
	void *4efb158107(bool ReturnValue); // Function Engine.Controller.*4efb158107 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7cac
	void *0b8dd02f61(); // Function Engine.Controller.*0b8dd02f61 // Native|Public|BlueprintCallable // @ game+0x6baae2c
	void ReceiveInstigatedAnyDamage(float Damage); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x370fbc
};

// Class Engine.SpringArmComponent
// Size: 0x4f0 (Inherited: 0x470)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x468(0x04)
	struct FVector SocketOffset; // 0x46c(0x0c)
	struct FVector TargetOffset; // 0x478(0x0c)
	float ProbeSize; // 0x484(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x488(0x01)
	char bDoCollisionTest : 1; // 0x48c(0x01)
	char bUsePawnControlRotation : 1; // 0x48c(0x01)
	char bInheritPitch : 1; // 0x48c(0x01)
	char bInheritYaw : 1; // 0x48c(0x01)
	char bInheritRoll : 1; // 0x48c(0x01)
	char bLockPitchLag : 1; // 0x48c(0x01)
	char bLockYawLag : 1; // 0x48c(0x01)
	char bLockRollLag : 1; // 0x48c(0x01)
	char bEnableCameraLag : 1; // 0x48d(0x01)
	char bEnableCameraRotationLag : 1; // 0x48d(0x01)
	char bUseCameraLagSubstepping : 1; // 0x48d(0x01)
	char bDrawDebugLagMarkers : 1; // 0x48d(0x01)
	float CameraLagSpeed; // 0x490(0x04)
	float CameraRotationLagSpeed; // 0x494(0x04)
	float CameraLagMaxTimeStep; // 0x498(0x04)
	float CameraLagMaxDistance; // 0x49c(0x04)
	char pad_4A2[0x4e]; // 0x4a2(0x4e)
};

// Class Engine.PlayerController
// Size: 0x7b0 (Inherited: 0x478)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)
	struct APawn* *b84c005177; // 0x488(0x08)
	struct U*56292a4ba0* *b61860ece1; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)
	struct AHUD* *ae70eed463; // 0x4a0(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x4a8(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4b0(0x08)
	bool *2381123a8f; // 0x4b8(0x01)
	char pad_4B9[0x3]; // 0x4b9(0x03)
	struct FRotator TargetViewRotation; // 0x4bc(0x0c)
	char pad_4C8[0xc]; // 0x4c8(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4d4(0x04)
	struct TArray<struct AActor*> *8954a8e936; // 0x4d8(0x10)
	char pad_4E8[0x4]; // 0x4e8(0x04)
	float *c35bd652f0; // 0x4ec(0x04)
	struct FVector *87054d570e; // 0x4f0(0x0c)
	struct FRotator *648c282ed2; // 0x4fc(0x0c)
	int32 *b6892fc048; // 0x508(0x04)
	char pad_50C[0x4]; // 0x50c(0x04)
	struct UCheatManager* CheatManager; // 0x510(0x08)
	struct UClass* CheatClass; // 0x518(0x08)
	struct UPlayerInput* PlayerInput; // 0x520(0x08)
	struct TArray<struct F*444f71f5b9> *a23dbcc48d; // 0x528(0x10)
	char pad_538[0x90]; // 0x538(0x90)
	char pad_5C8_0 : 3; // 0x5c8(0x01)
	char bPlayerIsWaiting : 1; // 0x5c8(0x01)
	char pad_5C8_4 : 4; // 0x5c8(0x01)
	char pad_5C9[0x3]; // 0x5c9(0x03)
	bool *ed1b53c175; // 0x5cc(0x01)
	char pad_5CD[0x3b]; // 0x5cd(0x3b)
	struct UNetConnection* *a47c378a48; // 0x608(0x08)
	struct UNetConnection* NetConnection; // 0x610(0x08)
	char pad_618[0xc]; // 0x618(0x0c)
	float InputYawScale; // 0x624(0x04)
	float InputPitchScale; // 0x628(0x04)
	float InputRollScale; // 0x62c(0x04)
	char bShowMouseCursor : 1; // 0x630(0x01)
	char bEnableClickEvents : 1; // 0x630(0x01)
	char bEnableTouchEvents : 1; // 0x630(0x01)
	char bEnableMouseOverEvents : 1; // 0x630(0x01)
	char bEnableTouchOverEvents : 1; // 0x630(0x01)
	char bForceFeedbackEnabled : 1; // 0x630(0x01)
	char pad_630_6 : 2; // 0x630(0x01)
	char pad_631[0x7]; // 0x631(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x638(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x648(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x649(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x64a(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x64b(0x01)
	float HitResultTraceDistance; // 0x64c(0x04)
	char pad_650[0x80]; // 0x650(0x80)
	struct U*89f9a84286* *d266a16c01; // 0x6d0(0x08)
	char pad_6D8_0 : 3; // 0x6d8(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6d8(0x01)
	char pad_6D8_4 : 4; // 0x6d8(0x01)
	char pad_6D9[0x17]; // 0x6d9(0x17)
	struct UTouchInterface* *703c33e737; // 0x6f0(0x08)
	char pad_6F8[0x40]; // 0x6f8(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x738(0x08)
	struct FVector SpawnLocation; // 0x740(0x0c)
	char pad_74C[0x4]; // 0x74c(0x04)
	bool *d0584e6155; // 0x750(0x01)
	char pad_751[0x1]; // 0x751(0x01)
	uint16 *040aa881fb; // 0x752(0x02)
	uint16 *d1b605cbb0; // 0x754(0x02)
	char pad_756[0x2]; // 0x756(0x02)
	struct AActor* *164573ddac; // 0x758(0x08)
	struct AActor* *dd0398ab0a; // 0x760(0x08)
	char pad_768[0x48]; // 0x768(0x48)

	bool *9bc79729ce(); // Function Engine.PlayerController.*9bc79729ce // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb30c4
	void *6db76a3a17(struct AHUD* ReturnValue); // Function Engine.PlayerController.*6db76a3a17 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd95f24
	void *1bb1630d13(struct UTouchInterface* NewTouchInterface); // Function Engine.PlayerController.*1bb1630d13 // Native|Public|BlueprintCallable // @ game+0x6ba81ac
	void *754b16dc40(); // Function Engine.PlayerController.*754b16dc40 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb68ac
	void SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x6bc7254
	void FOV(float Param0); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x6bb00c0
	void *492c0dfb10(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag); // Function Engine.PlayerController.*492c0dfb10 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x6bacc4c
	void *7d26778a3d(struct FGuid Param3); // Function Engine.PlayerController.*7d26778a3d // Final|Native|Public|HasDefaults // @ game+0x6bacee8
	void *64bae42b40(struct USceneComponent* AttachToComponent, struct FVector Location); // Function Engine.PlayerController.*64bae42b40 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc31b4
	void *ba0fe87a17(); // Function Engine.PlayerController.*ba0fe87a17 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bac398
	void *4c8f98c6b1(struct USoundBase* Param0, struct FVector Param1, float Param2, float Param3); // Function Engine.PlayerController.*4c8f98c6b1 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6babd88
	void AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x6baa1c4
	void *67e47f555a(); // Function Engine.PlayerController.*67e47f555a // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab3a4
	bool *fc5c98289c(); // Function Engine.PlayerController.*fc5c98289c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab584
	struct FName *66cb3b1abb(); // Function Engine.PlayerController.*66cb3b1abb // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bbfdd4
	bool *27d9967514(); // Function Engine.PlayerController.*27d9967514 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bbe16c
	void *a36a90c259(); // Function Engine.PlayerController.*a36a90c259 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xf66e18
	bool *1c8a42dada(); // Function Engine.PlayerController.*1c8a42dada // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb355c
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x5e7dff4
	void *ace4896d72(); // Function Engine.PlayerController.*ace4896d72 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5e1e618
	bool *c741e7b156(); // Function Engine.PlayerController.*c741e7b156 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf024
	struct FKey ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x6bad5e0
	struct FName *b650a3c66a(); // Function Engine.PlayerController.*b650a3c66a // Net|NetReliableNative|Event|Public|NetClient // @ game+0xa90aac
	bool *065c841a85(); // Function Engine.PlayerController.*065c841a85 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bca9d0
	void *dc78805044(); // Function Engine.PlayerController.*dc78805044 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5e1e314
	int32 *337748a8a4(); // Function Engine.PlayerController.*337748a8a4 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb70d8
	int32 *600eb14c1b(); // Function Engine.PlayerController.*600eb14c1b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xe5dab8
	void *b2ff9a6f9b(float Intensity, float Duration, bool bAffectsLeftLarge, struct F*badb9cc575 LatentInfo); // Function Engine.PlayerController.*b2ff9a6f9b // Final|Native|Public|BlueprintCallable // @ game+0x6bbead4
	void *64bd60d6ad(); // Function Engine.PlayerController.*64bd60d6ad // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5da7aa4
	void *9cd6096020(); // Function Engine.PlayerController.*9cd6096020 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xf5d8f4
	void *1cdcd7de79(); // Function Engine.PlayerController.*1cdcd7de79 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb48b4
	void *da7f49c34f(struct F*12ea908fc3 Param1); // Function Engine.PlayerController.*da7f49c34f // Net|NetReliableNative|Event|Public|NetClient // @ game+0xe8d610
	void *5e803224a0(struct FName Param0, bool Param1); // Function Engine.PlayerController.*5e803224a0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x956f50
	void *d12287e8bd(struct AActor* Param0, float Param1, bool Param2, int32 Param3); // Function Engine.PlayerController.*d12287e8bd // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bac044
	void *413a74fc4a(); // Function Engine.PlayerController.*413a74fc4a // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc1d48
	void *017f81fff0(); // Function Engine.PlayerController.*017f81fff0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xe3c29c
	struct FName *18f0867bd1(); // Function Engine.PlayerController.*18f0867bd1 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc19d8
	bool ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x6bca4cc
	bool *dba1cb64a2(); // Function Engine.PlayerController.*dba1cb64a2 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6baaecc
	struct FName *e4e3fd3561(); // Function Engine.PlayerController.*e4e3fd3561 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0xd137f4
	struct TArray<struct F*e276d3ecaf> *b4cc95ff22(); // Function Engine.PlayerController.*b4cc95ff22 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bad3b0
	bool *646923e85b(); // Function Engine.PlayerController.*646923e85b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xca59d0
	float *926d6135f4(); // Function Engine.PlayerController.*926d6135f4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bacd2c
	void *8775495bb7(); // Function Engine.PlayerController.*8775495bb7 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab404
	bool *77388303a1(); // Function Engine.PlayerController.*77388303a1 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x6bacb68
	bool StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x6bc9b20
	float *c32dee1b26(float DeltaY); // Function Engine.PlayerController.*c32dee1b26 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb44f8
	void *a0484bb951(); // Function Engine.PlayerController.*a0484bb951 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x2e534c
	void *a1a43b96bb(struct FName Param0); // Function Engine.PlayerController.*a1a43b96bb // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bac75c
	void *0846d613e3(); // Function Engine.PlayerController.*0846d613e3 // Final|Native|Public|BlueprintCallable // @ game+0x6bc7004
	void *6b86f87435(struct FText Param0); // Function Engine.PlayerController.*6b86f87435 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bad46c
	void *be5ef35171(struct FUniqueNetIdRepl Param0); // Function Engine.PlayerController.*be5ef35171 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc1878
	void SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x6bbfd10
	void ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0xa88ff0
	void *c32597ff8f(enum class ETouchIndex FingerIndex, struct TArray<enum class EObjectTypeQuery> ObjectTypes, bool bTraceComplex); // Function Engine.PlayerController.*c32597ff8f // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb38bc
	void *99deb6a5df(); // Function Engine.PlayerController.*99deb6a5df // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc249c
	void *f6b10b700f(struct FVector Param0, struct FRotator Param1); // Function Engine.PlayerController.*f6b10b700f // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x6bc1de0
	void *6ca8f81f82(); // Function Engine.PlayerController.*6ca8f81f82 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc23b8
	void *551859c184(); // Function Engine.PlayerController.*551859c184 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3f58
	void *be8df9dac5(); // Function Engine.PlayerController.*be8df9dac5 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc2450
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x6bafea0
	bool *29fe5019a0(); // Function Engine.PlayerController.*29fe5019a0 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc1f28
	float *9330da061e(); // Function Engine.PlayerController.*9330da061e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3d1c
	enum class EControllerHand *d85a21b831(); // Function Engine.PlayerController.*d85a21b831 // Final|Native|Public|BlueprintCallable // @ game+0x6bca164
	bool *48c46e979b(); // Function Engine.PlayerController.*48c46e979b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab61c
	void *50dd42b97f(); // Function Engine.PlayerController.*50dd42b97f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc1fe8
	void *4f029e8b42(); // Function Engine.PlayerController.*4f029e8b42 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bacb50
	bool *fac0fe6371(); // Function Engine.PlayerController.*fac0fe6371 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb370c
	float *3a17d02d0a(); // Function Engine.PlayerController.*3a17d02d0a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb423c
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x5e5bbb0
	struct FString *515ca9bd09(); // Function Engine.PlayerController.*515ca9bd09 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bbfe88
	int32 ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc2194
	struct FColor *b2cd120b3b(); // Function Engine.PlayerController.*b2cd120b3b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc50ec
	void *202ea03278(enum class ETraceTypeQuery TraceChannel, bool bTraceComplex, struct FHitResult HitResult, bool ReturnValue); // Function Engine.PlayerController.*202ea03278 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3234
	void *68b9f2b1c8(); // Function Engine.PlayerController.*68b9f2b1c8 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bbffbc
	void *b8ad63a8db(bool ReturnValue); // Function Engine.PlayerController.*b8ad63a8db // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb50b0
	void *6bececdfa5(struct FUniqueNetIdRepl Param0); // Function Engine.PlayerController.*6bececdfa5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab81c
	void DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bae114
	void *a3ff594db9(struct APawn* Param0); // Function Engine.PlayerController.*a3ff594db9 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xe30f68
	void *1b581f5708(struct AActor* NewViewTarget, float BlendTime); // Function Engine.PlayerController.*1b581f5708 // Native|Public|BlueprintCallable // @ game+0x6bc8f7c
	void *c063f400fc(struct UClass* LensEffectEmitterClass); // Function Engine.PlayerController.*c063f400fc // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x6bacabc
	void *7badcea36e(struct FName Param0, bool Param1); // Function Engine.PlayerController.*7badcea36e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6babf0c
	struct FRotator *c0bfdc5bc7(); // Function Engine.PlayerController.*c0bfdc5bc7 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x7517a8
	bool *30ed96f4e7(); // Function Engine.PlayerController.*30ed96f4e7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bca8dc
	float AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x6ba9958
	struct FName Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x6baa76c
	struct FGuid *ff56e2228f(); // Function Engine.PlayerController.*ff56e2228f // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bad0bc
	struct FVector *07e9ba9cd5(); // Function Engine.PlayerController.*07e9ba9cd5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2f94
	struct FUniqueNetIdRepl *631d4dd4e1(); // Function Engine.PlayerController.*631d4dd4e1 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc2034
	bool ServerUpdateLevelVisibility(); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xd13234
	enum class EControllerHand *ed7a62c23a(); // Function Engine.PlayerController.*ed7a62c23a // Final|Native|Public|BlueprintCallable // @ game+0x6bc5e2c
	bool *c680b04a41(); // Function Engine.PlayerController.*c680b04a41 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bae21c
	void ClientRetryClientRestart(struct APawn* Param0); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bac42c
	void *504cc5b5ec(); // Function Engine.PlayerController.*504cc5b5ec // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb33a4
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x5e1fe04
	void *1da0c51c15(struct UCameraAnim* Param0); // Function Engine.PlayerController.*1da0c51c15 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x653eda8
	void *7843cf5b19(); // Function Engine.PlayerController.*7843cf5b19 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bac7f0
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x5df16f4
	void *1c0be40025(struct FKey Key, bool ReturnValue); // Function Engine.PlayerController.*1c0be40025 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7b90
	void *de5cdb845e(float BlendOutTime, bool bLoop, bool bRandomStartTime, enum class ECameraAnimPlaySpace Space); // Function Engine.PlayerController.*de5cdb845e // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x6bab938
	void *994d9585e4(); // Function Engine.PlayerController.*994d9585e4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6baca24
	void *f12676d8d9(); // Function Engine.PlayerController.*f12676d8d9 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc1d94
	void *30f65c03fa(); // Function Engine.PlayerController.*30f65c03fa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc2404
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x5de4c08
	void *3c955a30f1(); // Function Engine.PlayerController.*3c955a30f1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab3ec
	bool *5a504151cb(); // Function Engine.PlayerController.*5a504151cb // Native|Public|BlueprintCallable // @ game+0x6bc4754
	float *42ab205675(); // Function Engine.PlayerController.*42ab205675 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3e10
	void *45753d8258(); // Function Engine.PlayerController.*45753d8258 // Final|Native|Public|BlueprintCallable // @ game+0x6baae44
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x6bbe204
	bool *83fe00935b(); // Function Engine.PlayerController.*83fe00935b // Native|Public|BlueprintCallable // @ game+0x6bc9144
	struct FString SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x6bca33c
	bool *f02dad65dc(); // Function Engine.PlayerController.*f02dad65dc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab4a0
	struct FUniqueNetIdRepl *8b49197eab(); // Function Engine.PlayerController.*8b49197eab // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bad294
	float *98b518ef28(); // Function Engine.PlayerController.*98b518ef28 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab6b4
	float AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x6ba9d9c
	void *586f1ffdba(); // Function Engine.PlayerController.*586f1ffdba // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bab488
	void *ec4658b026(); // Function Engine.PlayerController.*ec4658b026 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bbff70
	void LocalTravel(struct FString Param0); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x6bbd89c
	void *cc6aa4203e(struct UClass* Param0); // Function Engine.PlayerController.*cc6aa4203e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bac1d0
	void *599d38076c(bool Param0, struct FColor Param1, struct FVector2D Param2); // Function Engine.PlayerController.*599d38076c // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bac584
	void *240d2c5a52(enum class EControllerHand Hand, float Scale, bool bLoop); // Function Engine.PlayerController.*240d2c5a52 // Final|Native|Public|BlueprintCallable // @ game+0x6bbede0
	void *7ad5457e5d(struct FVector Acceleration); // Function Engine.PlayerController.*7ad5457e5d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4330
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x6bafe88
	void *f41bd4c807(enum class ETouchIndex FingerIndex); // Function Engine.PlayerController.*f41bd4c807 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb45fc
	struct FString *3f159e81eb(); // Function Engine.PlayerController.*3f159e81eb // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0xafbf68
	struct FString *50dacbc7ed(); // Function Engine.PlayerController.*50dacbc7ed // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bac4c0
	float *17b1db61f7(); // Function Engine.PlayerController.*17b1db61f7 // Net|Native|Event|Public|NetClient // @ game+0x6babc64
	struct TArray<struct F*956690b004> *a4df4a4cc6(); // Function Engine.PlayerController.*a4df4a4cc6 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc22c0
};

// Class Engine.Info
// Size: 0x3f8 (Inherited: 0x3f8)
struct AInfo : AActor {
	float NetUpdateFrequency; // 0x30(0x04)
	char pad_3FC_0 : 3; // 0x3fc(0x01)
	char *afc0b607c1 : 1; // 0x40(0x01)
	char *195141a832 : 1; // 0x41(0x01)
	char bReplicates : 1; // 0x41(0x01)
	struct FName *dc8dad45d2; // 0x48(0x08)
	enum class ENetRole RemoteRole; // 0x50(0x01)
	struct AActor* Owner; // 0x58(0x08)
	struct FRepMovement ReplicatedMovement; // 0x60(0x34)
	struct F*163cdb3029 *4998573317; // 0x98(0x40)
	float *f4ec68df5a; // 0xd8(0x04)
	char bHidden : 1; // 0xf8(0x01)
	char *ccd23c4d11 : 1; // 0xf8(0x01)
	char *00c044e8f3 : 1; // 0xf8(0x01)
	char bOnlyRelevantToOwner : 1; // 0xf8(0x01)
	char bAlwaysRelevant : 1; // 0xf8(0x01)
	char *0b52d4980d : 1; // 0xf8(0x01)
	char *581c4aea8e : 1; // 0xf8(0x01)
	char *00a5818f10 : 1; // 0xf8(0x01)
	char *578ce01c9c : 1; // 0xf9(0x01)
	char *dc908ea105 : 1; // 0xf9(0x01)
	char bNetUseOwnerRelevancy : 1; // 0xf9(0x01)
	char *e59ae21b72 : 1; // 0xf9(0x01)
	char *42194894c7 : 1; // 0xf9(0x01)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x100(0x10)
	struct APawn* Instigator; // 0x160(0x08)
	char bAutoDestroyWhenFinished : 1; // 0x168(0x01)
	char bCanBeDamaged : 1; // 0x168(0x01)
	char *48c13dc856 : 1; // 0x168(0x01)
	char *b6f52fdcb3 : 1; // 0x168(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x168(0x01)
	char *ff1816ff9e : 1; // 0x168(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x168(0x01)
	char *a9f513e55a : 1; // 0x168(0x01)
	char *07bc7fef21 : 1; // 0x169(0x01)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x170(0x10)
	float NetPriority; // 0x180(0x04)
	struct FMulticastDelegate OnBeginCursorOver; // 0x188(0x10)
	struct FMulticastDelegate OnReleased; // 0x198(0x10)
	struct TArray<struct FName> Tags; // 0x1a8(0x10)
	char *72b47ba3cd : 1; // 0x1b8(0x01)
	char *8b1bf7449f : 1; // 0x1b8(0x01)
	char *d253d94f65 : 1; // 0x1b8(0x01)
	char *3b999d2d7a : 1; // 0x1b8(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x1b9(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x1ba(0x01)
	float MinNetUpdateFrequency; // 0x1bc(0x04)
	struct AActor* ParentComponentActor; // 0x1c0(0x08)
	struct FMulticastDelegate OnEndCursorOver; // 0x1c8(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x1d8(0x10)
	struct TArray<struct AActor*> Children; // 0x1e8(0x10)
	enum class *d729d3c5a5 InputConsumeOption; // 0x1f8(0x01)
	uint64 *59b4fa8b00; // 0x200(0x08)
	enum class ENetRole Role; // 0x208(0x01)
	int32 *403c4f6ec5; // 0x210(0x04)
	float InitialLifeSpan; // 0x214(0x04)
	struct FMulticastDelegate OnTakePointDamage; // 0x218(0x10)
	int32 *c2b5fafb50; // 0x228(0x04)
	struct FMulticastDelegate OnInputTouchEnd; // 0x230(0x10)
	float CustomTimeDilation; // 0x240(0x04)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x248(0x10)
	struct TArray<struct AMatineeActor*> *24dd036ec9; // 0x258(0x10)
	struct USceneComponent* RootComponent; // 0x268(0x08)
	struct FMulticastDelegate OnActorHit; // 0x270(0x10)
	struct UChildActorComponent* *18ff5b3923; // 0x280(0x08)
	struct FMulticastDelegate OnInputTouchBegin; // 0x288(0x10)
	struct FGuid DestructibleId; // 0x298(0x10)
	bool bIsDestroyedVersion; // 0x2a8(0x01)
	bool RemoveFromLevelLOD; // 0x2a9(0x01)
	struct F*b3a779a928 PrimaryActorTick; // 0x2b0(0x58)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x310(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x320(0x01)
	float NetCullDistanceSquared; // 0x324(0x04)
	struct FMulticastDelegate OnClicked; // 0x328(0x10)
	struct U*89f9a84286* *89f9a84286; // 0x338(0x08)
	enum class EAutoReceiveInput *aaa4c6b0aa; // 0x340(0x01)
	struct FMulticastDelegate OnDestroyed; // 0x398(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3a8(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x3c0(0x10)
	struct TArray<struct FName> Layers; // 0x3d0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x3e0(0x10)

	bool K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8374
	bool K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x6bb9ffc
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbbe48
	struct FHitResult K2_AddActorLocalRotation(bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb854c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xb50d98
	void GetActorBounds(bool bOnlyCollidingComponents); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb079c
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x6bb9e7c
	void *cdc7b91d6d(); // Function Engine.Actor.*cdc7b91d6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb68c4
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbda74
	void *75f3114c08(); // Function Engine.Actor.*75f3114c08 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb76e4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xbed704
	void *b999b3d1c3(struct UMaterialInterface* Parent, struct UMaterialInstanceDynamic* ReturnValue); // Function Engine.Actor.*b999b3d1c3 // Final|Native|Public|BlueprintCallable // @ game+0x6bbd9f8
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *bad918d000(); // Function Engine.Actor.*bad918d000 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bcaac4
	float *7311615d4b(); // Function Engine.Actor.*7311615d4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d50
	float *685e3b5cc9(); // Function Engine.Actor.*685e3b5cc9 // Native|Public|BlueprintCallable // @ game+0x6bc6498
	struct FVector *1206b0a740(); // Function Engine.Actor.*1206b0a740 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0bd8
	float *5c41a9b3d8(); // Function Engine.Actor.*5c41a9b3d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb40a0
	struct FVector *806c296001(); // Function Engine.Actor.*806c296001 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae14
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x370fbc
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct USceneComponent* *6c12a1a971(); // Function Engine.Actor.*6c12a1a971 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb350
	bool *0533b13c90(); // Function Engine.Actor.*0533b13c90 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb112c
	bool *91da404789(); // Function Engine.Actor.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0xdbd9a8
	void *72d1ab0701(struct FVector NewScale3D); // Function Engine.Actor.*72d1ab0701 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc2b94
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x370fbc
	void K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8950
	void K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbba2c
	void *bda82fb76a(); // Function Engine.Actor.*bda82fb76a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1364
	void *de9d01b3f6(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.*de9d01b3f6 // Final|Native|Public|BlueprintCallable // @ game+0x6bba2fc
	void *8ee0b9e990(); // Function Engine.Actor.*8ee0b9e990 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb49d0
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaee4
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5964
	bool *d57fbe8fc6(); // Function Engine.Actor.*d57fbe8fc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7630
	float *511ef00739(); // Function Engine.Actor.*511ef00739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2e28
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct UChildActorComponent* *ef270d1a10(); // Function Engine.Actor.*ef270d1a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5bb8
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xf1a3fc
	struct TArray<struct UActorComponent*> *d93dde83f1(); // Function Engine.Actor.*d93dde83f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2600
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbbc10
	struct AActor* *e22a09fc3d(); // Function Engine.Actor.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5af4
	struct APawn* *dd10056177(); // Function Engine.Actor.*dd10056177 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb49b8
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5d95e60
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *118a22ba37(struct FName InputAxisName, float ReturnValue); // Function Engine.Actor.*118a22ba37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4194
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x6bae4ac
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x40a36c
	void *b7511d0ed8(enum class *ecdd115207 RotationRule); // Function Engine.Actor.*b7511d0ed8 // Final|Native|Public|BlueprintCallable // @ game+0x6bbaaa4
	void K2_AddActorWorldTransform(struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8d00
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x370fbc
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xd9fc70
	void *f3429ceb97(struct UClass* ComponentClass, struct UActorComponent* ReturnValue); // Function Engine.Actor.*f3429ceb97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2508
	void *eb66fec44e(struct FVector ReturnValue); // Function Engine.Actor.*eb66fec44e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d04
	void GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5704
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x6bc2c34
	bool *461623950c(); // Function Engine.Actor.*461623950c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb764c
	struct AActor* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x370fbc
	bool K2_AddActorLocalTransform(); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8724
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct AActor* *c4fee2a50d(); // Function Engine.Actor.*c4fee2a50d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1340
	struct AActor* *5d41351842(float ReturnValue); // Function Engine.Actor.*5d41351842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3b64
	void AddComponent(struct FName TemplateName, bool bManualAttachment); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xcade1c
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *e45fc9ffc9(struct FVector OutLocation, struct FRotator OutRotation); // Function Engine.Actor.*e45fc9ffc9 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb096c
	void *383cbfbf66(); // Function Engine.Actor.*383cbfbf66 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb13a8
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *d4b72b197e(enum class ENetRole ReturnValue); // Function Engine.Actor.*d4b72b197e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6404
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6fd8
	void *0f7b3f99fd(); // Function Engine.Actor.*0f7b3f99fd // Native|Public|BlueprintCallable // @ game+0x6bb0000
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x6a12d0
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x6bae540
	void K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8b28
	struct UActorComponent* *f221ff8513(); // Function Engine.Actor.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6ba9f60
	float *14c0f68ea4(); // Function Engine.Actor.*14c0f68ea4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bb3070
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe76424
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb059c
	enum class ETickingGroup *814a121c39(); // Function Engine.Actor.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x6bc8598
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x370fbc
	float *52068fadb9(); // Function Engine.Actor.*52068fadb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3ac4
	void *5f8251239e(); // Function Engine.Actor.*5f8251239e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb0588
	struct FVector *a0012f52a9(); // Function Engine.Actor.*a0012f52a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0ba4
	bool SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x6bc2890
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6ba9e38
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *d85c70de6e(); // Function Engine.Actor.*d85c70de6e // Final|Native|Public|BlueprintCallable // @ game+0x6bb6b90
	void *65fa332f56(); // Function Engine.Actor.*65fa332f56 // Native|Public|BlueprintCallable // @ game+0x6bca400
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x370fbc
	struct FVector *058a798681(); // Function Engine.Actor.*058a798681 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc2af4
	struct UActorComponent* *581f8985e1(); // Function Engine.Actor.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x6bba954
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *0d0c513b2c(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x6bbf5c8
	void *83d2d5c58f(); // Function Engine.Actor.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7e88
	void *efaba219b2(struct FName Tag, struct TArray<struct UActorComponent*> ReturnValue); // Function Engine.Actor.*efaba219b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb26f0
	void *541a06a744(); // Function Engine.Actor.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x6bbf4a0
	void *ce1958648c(); // Function Engine.Actor.*ce1958648c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2ec8
	void *891a15da22(struct FVector DestLocation, struct FRotator DestRotation, bool ReturnValue); // Function Engine.Actor.*891a15da22 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbd3c0
	void ReceiveHit(bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	void *76f4a54e31(); // Function Engine.Actor.*76f4a54e31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d38
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd1263c
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6bba93c
	float *7cff7fa404(); // Function Engine.Actor.*7cff7fa404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7010
	struct FVector *d5ff08bf52(); // Function Engine.Actor.*d5ff08bf52 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0a78
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	struct FVector *bbf004721b(); // Function Engine.Actor.*bbf004721b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb47b0
	bool *221e5b49fe(); // Function Engine.Actor.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x6bc8030
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc020
	bool *4bc88286ff(); // Function Engine.Actor.*4bc88286ff // Final|Native|Public|BlueprintCallable // @ game+0x6bc27f8
	struct AActor* *057be55286(); // Function Engine.Actor.*057be55286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5b94
	float *48b2b80fa1(); // Function Engine.Actor.*48b2b80fa1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4a80
	struct FRotator K2_SetActorRotation(bool bTeleportPhysics, bool ReturnValue); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbc424
	void K2_SetActorTransform(struct FTransform NewTransform); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc524
	void *209c054b22(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.*209c054b22 // Final|Native|Public|BlueprintCallable // @ game+0x6bc96f8
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbe9b28
	void *87d1cdd662(); // Function Engine.Actor.*87d1cdd662 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bc80c8
	void K2_SetActorRelativeTransform(struct FTransform NewRelativeTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc1f8
	void *32ee7138ab(); // Function Engine.Actor.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x6bc86b0
	void *45e9b736d8(); // Function Engine.Actor.*45e9b736d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0944
	void *f4f472a4df(struct FVector ReturnValue); // Function Engine.Actor.*f4f472a4df // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d78
	void *1357a6903c(float TickInterval); // Function Engine.Actor.*1357a6903c // Final|Native|Public|BlueprintCallable // @ game+0x6bc2cc8
};

// Class Engine.GameModeBase
// Size: 0x498 (Inherited: 0x3f8)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x3f8(0x10)
	struct UClass* GameSessionClass; // 0x408(0x08)
	struct UClass* GameStateClass; // 0x410(0x08)
	struct UClass* PlayerControllerClass; // 0x418(0x08)
	struct UClass* PlayerStateClass; // 0x420(0x08)
	struct FStringClassReference HUDClass; // 0x428(0x10)
	struct UClass* DefaultPawnClass; // 0x438(0x08)
	struct FStringClassReference SpectatorClass; // 0x440(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x450(0x08)
	struct AGameSession* GameSession; // 0x458(0x08)
	struct AGameStateBase* GameState; // 0x460(0x08)
	struct FText *36bef0b8bb; // 0x468(0x18)
	char bUseSeamlessTravel : 1; // 0x480(0x01)
	char bStartPlayersAsSpectators : 1; // 0x480(0x01)
	char bPauseable : 1; // 0x480(0x01)
	char pad_480_3 : 5; // 0x480(0x01)
	char pad_481[0x17]; // 0x481(0x17)

	struct AActor* FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xdf0bc8
	void *a7b4935b36(); // Function Engine.GameModeBase.*a7b4935b36 // Native|Public|BlueprintCallable // @ game+0xc281a4
	bool MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xe08134
	bool *d4e79c9423(); // Function Engine.GameModeBase.*d4e79c9423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e1b8d4
	struct AActor* *0640ebc54a(); // Function Engine.GameModeBase.*0640ebc54a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bbacf8
	bool ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x6bbf318
	bool PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0xb8cd6c
	struct APlayerController* InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xf35f50
	struct APawn* SpawnDefaultPawnFor(); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xe26040
	void *ea3038b0fd(struct AController* Controller, struct FString NewName, bool bNameChange); // Function Engine.GameModeBase.*ea3038b0fd // Native|Public|BlueprintCallable // @ game+0x6baacc8
	void HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0xb8ce2c
	void RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x6bbf800
	void K2_OnLogout(struct AController* ExitingController); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *ccb74fed66(int32 ReturnValue); // Function Engine.GameModeBase.*ccb74fed66 // Native|Public|BlueprintCallable // @ game+0x6bb5664
	void *82ff0fcd4e(); // Function Engine.GameModeBase.*82ff0fcd4e // Native|Public|BlueprintCallable // @ game+0x6bb5580
	void RestartPlayerAtTransform(struct FTransform SpawnTransform); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbf974
	void RestartPlayerAtPlayerStart(struct AController* NewPlayer, struct AActor* StartSpot); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x6bbf894
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x5e82df4
	void GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xe451c0
	void K2_OnRestartPlayer(struct AController* NewPlayer); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x370fbc
	void K2_PostLogin(struct APlayerController* NewPlayer); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ChoosePlayerStart(); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xde3500
	bool CanSpectate(); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x6baa8f4
	struct APawn* SpawnDefaultPawnAtTransform(); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xe774f8
	struct APlayerController* K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x370fbc
	bool K2_OnChangeName(); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct AController* InitStartSpot(); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xf24d8c
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xd3cff4
};

// Class Engine.GameMode
// Size: 0x4d8 (Inherited: 0x498)
struct AGameMode : AGameModeBase {
	struct FName *bb64d0d946; // 0x498(0x08)
	char bDelayedStart : 1; // 0x4a0(0x01)
	char pad_4A0_1 : 7; // 0x4a0(0x01)
	char pad_4A1[0x3]; // 0x4a1(0x03)
	int32 NumSpectators; // 0x4a4(0x04)
	int32 NumPlayers; // 0x4a8(0x04)
	int32 NumBots; // 0x4ac(0x04)
	float MinRespawnDelay; // 0x4b0(0x04)
	int32 NumTravellingPlayers; // 0x4b4(0x04)
	struct UClass* *db19159cfc; // 0x4b8(0x08)
	struct TArray<struct APlayerState*> *a6accb8e63; // 0x4c0(0x10)
	float *9df405dde0; // 0x4d0(0x04)
	bool bHandleDedicatedServerReplays; // 0x4d4(0x01)
	char pad_4D5[0x3]; // 0x4d5(0x03)

	void *9b6ffe7a3d(); // Function Engine.GameMode.*9b6ffe7a3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4cb4
	void *8430b4980a(); // Function Engine.GameMode.*8430b4980a // Native|Public|BlueprintCallable // @ game+0x6bb0094
	void *765398c9d4(); // Function Engine.GameMode.*765398c9d4 // Native|Public|BlueprintCallable // @ game+0x6bbf74c
	void ReadyToEndMatch(bool ReturnValue); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0xc4fd38
	void Say(struct FString Msg); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x6bbfb38
	void *20e3515243(); // Function Engine.GameMode.*20e3515243 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7d18
	void K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x370fbc
	void ReadyToStartMatch(bool ReturnValue); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xe84e44
	void *ba4aa21903(); // Function Engine.GameMode.*ba4aa21903 // Native|Public|BlueprintCallable // @ game+0x5e1a8f0
	void *3f89f1978b(bool ReturnValue); // Function Engine.GameMode.*3f89f1978b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7244
	void SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x6bc3878
	void *cf4f0d8a8f(); // Function Engine.GameMode.*cf4f0d8a8f // Native|Public|BlueprintCallable // @ game+0x5de1c6c
};

// Class Engine.PlayerState
// Size: 0x490 (Inherited: 0x3f8)
struct APlayerState : AInfo {
	float Score; // 0x3f8(0x04)
	int32 StartTime; // 0x3fc(0x04)
	char pad_400[0x10]; // 0x400(0x10)
	struct FUniqueNetIdRepl UniqueId; // 0x410(0x18)
	char bIsSpectator : 1; // 0x428(0x01)
	char *27105a3b1d : 1; // 0x428(0x01)
	char bIsABot : 1; // 0x428(0x01)
	char pad_428_3 : 1; // 0x428(0x01)
	char *e0a90482a6 : 1; // 0x428(0x01)
	char *37ab395502 : 1; // 0x428(0x01)
	char pad_428_6 : 2; // 0x428(0x01)
	char pad_429[0x3]; // 0x429(0x03)
	int32 PlayerId; // 0x42c(0x04)
	char pad_430[0x8]; // 0x430(0x08)
	struct FString PlayerName; // 0x438(0x10)
	bool Ping; // 0x448(0x01)
	char pad_449[0xf]; // 0x449(0x0f)
	struct FString *bd04ae9cde; // 0x458(0x10)
	struct UClass* *db19159cfc; // 0x468(0x08)
	char pad_470[0x18]; // 0x470(0x18)
	bool *4253d56a24; // 0x488(0x01)
	char pad_489[0x7]; // 0x489(0x07)

	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0x5da6fac
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x5e794d4
	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x5e3efb4
	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x5e794bc
	struct APlayerState* ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x370fbc
	struct APlayerState* ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x370fbc
};

// Class Engine.TargetPoint
// Size: 0x3f8 (Inherited: 0x3f8)
struct ATargetPoint : AActor {
	float NetUpdateFrequency; // 0x30(0x04)
	char pad_3FC_0 : 3; // 0x3fc(0x01)
	char *afc0b607c1 : 1; // 0x40(0x01)
	char *195141a832 : 1; // 0x41(0x01)
	char bReplicates : 1; // 0x41(0x01)
	struct FName *dc8dad45d2; // 0x48(0x08)
	enum class ENetRole RemoteRole; // 0x50(0x01)
	struct AActor* Owner; // 0x58(0x08)
	struct FRepMovement ReplicatedMovement; // 0x60(0x34)
	struct F*163cdb3029 *4998573317; // 0x98(0x40)
	float *f4ec68df5a; // 0xd8(0x04)
	char bHidden : 1; // 0xf8(0x01)
	char *ccd23c4d11 : 1; // 0xf8(0x01)
	char *00c044e8f3 : 1; // 0xf8(0x01)
	char bOnlyRelevantToOwner : 1; // 0xf8(0x01)
	char bAlwaysRelevant : 1; // 0xf8(0x01)
	char *0b52d4980d : 1; // 0xf8(0x01)
	char *581c4aea8e : 1; // 0xf8(0x01)
	char *00a5818f10 : 1; // 0xf8(0x01)
	char *578ce01c9c : 1; // 0xf9(0x01)
	char *dc908ea105 : 1; // 0xf9(0x01)
	char bNetUseOwnerRelevancy : 1; // 0xf9(0x01)
	char *e59ae21b72 : 1; // 0xf9(0x01)
	char *42194894c7 : 1; // 0xf9(0x01)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x100(0x10)
	struct APawn* Instigator; // 0x160(0x08)
	char bAutoDestroyWhenFinished : 1; // 0x168(0x01)
	char bCanBeDamaged : 1; // 0x168(0x01)
	char *48c13dc856 : 1; // 0x168(0x01)
	char *b6f52fdcb3 : 1; // 0x168(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x168(0x01)
	char *ff1816ff9e : 1; // 0x168(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x168(0x01)
	char *a9f513e55a : 1; // 0x168(0x01)
	char *07bc7fef21 : 1; // 0x169(0x01)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x170(0x10)
	float NetPriority; // 0x180(0x04)
	struct FMulticastDelegate OnBeginCursorOver; // 0x188(0x10)
	struct FMulticastDelegate OnReleased; // 0x198(0x10)
	struct TArray<struct FName> Tags; // 0x1a8(0x10)
	char *72b47ba3cd : 1; // 0x1b8(0x01)
	char *8b1bf7449f : 1; // 0x1b8(0x01)
	char *d253d94f65 : 1; // 0x1b8(0x01)
	char *3b999d2d7a : 1; // 0x1b8(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x1b9(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x1ba(0x01)
	float MinNetUpdateFrequency; // 0x1bc(0x04)
	struct AActor* ParentComponentActor; // 0x1c0(0x08)
	struct FMulticastDelegate OnEndCursorOver; // 0x1c8(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x1d8(0x10)
	struct TArray<struct AActor*> Children; // 0x1e8(0x10)
	enum class *d729d3c5a5 InputConsumeOption; // 0x1f8(0x01)
	uint64 *59b4fa8b00; // 0x200(0x08)
	enum class ENetRole Role; // 0x208(0x01)
	int32 *403c4f6ec5; // 0x210(0x04)
	float InitialLifeSpan; // 0x214(0x04)
	struct FMulticastDelegate OnTakePointDamage; // 0x218(0x10)
	int32 *c2b5fafb50; // 0x228(0x04)
	struct FMulticastDelegate OnInputTouchEnd; // 0x230(0x10)
	float CustomTimeDilation; // 0x240(0x04)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x248(0x10)
	struct TArray<struct AMatineeActor*> *24dd036ec9; // 0x258(0x10)
	struct USceneComponent* RootComponent; // 0x268(0x08)
	struct FMulticastDelegate OnActorHit; // 0x270(0x10)
	struct UChildActorComponent* *18ff5b3923; // 0x280(0x08)
	struct FMulticastDelegate OnInputTouchBegin; // 0x288(0x10)
	struct FGuid DestructibleId; // 0x298(0x10)
	bool bIsDestroyedVersion; // 0x2a8(0x01)
	bool RemoveFromLevelLOD; // 0x2a9(0x01)
	struct F*b3a779a928 PrimaryActorTick; // 0x2b0(0x58)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x310(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x320(0x01)
	float NetCullDistanceSquared; // 0x324(0x04)
	struct FMulticastDelegate OnClicked; // 0x328(0x10)
	struct U*89f9a84286* *89f9a84286; // 0x338(0x08)
	enum class EAutoReceiveInput *aaa4c6b0aa; // 0x340(0x01)
	struct FMulticastDelegate OnDestroyed; // 0x398(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3a8(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x3c0(0x10)
	struct TArray<struct FName> Layers; // 0x3d0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x3e0(0x10)

	bool K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8374
	bool K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x6bb9ffc
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbbe48
	struct FHitResult K2_AddActorLocalRotation(bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb854c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xb50d98
	void GetActorBounds(bool bOnlyCollidingComponents); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb079c
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x6bb9e7c
	void *cdc7b91d6d(); // Function Engine.Actor.*cdc7b91d6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb68c4
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbda74
	void *75f3114c08(); // Function Engine.Actor.*75f3114c08 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb76e4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xbed704
	void *b999b3d1c3(struct UMaterialInterface* Parent, struct UMaterialInstanceDynamic* ReturnValue); // Function Engine.Actor.*b999b3d1c3 // Final|Native|Public|BlueprintCallable // @ game+0x6bbd9f8
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *bad918d000(); // Function Engine.Actor.*bad918d000 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bcaac4
	float *7311615d4b(); // Function Engine.Actor.*7311615d4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d50
	float *685e3b5cc9(); // Function Engine.Actor.*685e3b5cc9 // Native|Public|BlueprintCallable // @ game+0x6bc6498
	struct FVector *1206b0a740(); // Function Engine.Actor.*1206b0a740 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0bd8
	float *5c41a9b3d8(); // Function Engine.Actor.*5c41a9b3d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb40a0
	struct FVector *806c296001(); // Function Engine.Actor.*806c296001 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae14
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x370fbc
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct USceneComponent* *6c12a1a971(); // Function Engine.Actor.*6c12a1a971 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb350
	bool *0533b13c90(); // Function Engine.Actor.*0533b13c90 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb112c
	bool *91da404789(); // Function Engine.Actor.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0xdbd9a8
	void *72d1ab0701(struct FVector NewScale3D); // Function Engine.Actor.*72d1ab0701 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc2b94
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x370fbc
	void K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8950
	void K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbba2c
	void *bda82fb76a(); // Function Engine.Actor.*bda82fb76a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1364
	void *de9d01b3f6(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.*de9d01b3f6 // Final|Native|Public|BlueprintCallable // @ game+0x6bba2fc
	void *8ee0b9e990(); // Function Engine.Actor.*8ee0b9e990 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb49d0
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaee4
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5964
	bool *d57fbe8fc6(); // Function Engine.Actor.*d57fbe8fc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7630
	float *511ef00739(); // Function Engine.Actor.*511ef00739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2e28
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct UChildActorComponent* *ef270d1a10(); // Function Engine.Actor.*ef270d1a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5bb8
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xf1a3fc
	struct TArray<struct UActorComponent*> *d93dde83f1(); // Function Engine.Actor.*d93dde83f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2600
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbbc10
	struct AActor* *e22a09fc3d(); // Function Engine.Actor.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5af4
	struct APawn* *dd10056177(); // Function Engine.Actor.*dd10056177 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb49b8
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5d95e60
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *118a22ba37(struct FName InputAxisName, float ReturnValue); // Function Engine.Actor.*118a22ba37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4194
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x6bae4ac
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x40a36c
	void *b7511d0ed8(enum class *ecdd115207 RotationRule); // Function Engine.Actor.*b7511d0ed8 // Final|Native|Public|BlueprintCallable // @ game+0x6bbaaa4
	void K2_AddActorWorldTransform(struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8d00
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x370fbc
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xd9fc70
	void *f3429ceb97(struct UClass* ComponentClass, struct UActorComponent* ReturnValue); // Function Engine.Actor.*f3429ceb97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2508
	void *eb66fec44e(struct FVector ReturnValue); // Function Engine.Actor.*eb66fec44e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d04
	void GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5704
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x6bc2c34
	bool *461623950c(); // Function Engine.Actor.*461623950c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb764c
	struct AActor* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x370fbc
	bool K2_AddActorLocalTransform(); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8724
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x370fbc
	struct AActor* *c4fee2a50d(); // Function Engine.Actor.*c4fee2a50d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1340
	struct AActor* *5d41351842(float ReturnValue); // Function Engine.Actor.*5d41351842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3b64
	void AddComponent(struct FName TemplateName, bool bManualAttachment); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xcade1c
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *e45fc9ffc9(struct FVector OutLocation, struct FRotator OutRotation); // Function Engine.Actor.*e45fc9ffc9 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb096c
	void *383cbfbf66(); // Function Engine.Actor.*383cbfbf66 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb13a8
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *d4b72b197e(enum class ENetRole ReturnValue); // Function Engine.Actor.*d4b72b197e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6404
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6fd8
	void *0f7b3f99fd(); // Function Engine.Actor.*0f7b3f99fd // Native|Public|BlueprintCallable // @ game+0x6bb0000
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x6a12d0
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x6bae540
	void K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bb8b28
	struct UActorComponent* *f221ff8513(); // Function Engine.Actor.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6ba9f60
	float *14c0f68ea4(); // Function Engine.Actor.*14c0f68ea4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bb3070
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe76424
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb059c
	enum class ETickingGroup *814a121c39(); // Function Engine.Actor.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x6bc8598
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x370fbc
	float *52068fadb9(); // Function Engine.Actor.*52068fadb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb3ac4
	void *5f8251239e(); // Function Engine.Actor.*5f8251239e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb0588
	struct FVector *a0012f52a9(); // Function Engine.Actor.*a0012f52a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0ba4
	bool SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x6bc2890
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6ba9e38
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool *d85c70de6e(); // Function Engine.Actor.*d85c70de6e // Final|Native|Public|BlueprintCallable // @ game+0x6bb6b90
	void *65fa332f56(); // Function Engine.Actor.*65fa332f56 // Native|Public|BlueprintCallable // @ game+0x6bca400
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x370fbc
	struct FVector *058a798681(); // Function Engine.Actor.*058a798681 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc2af4
	struct UActorComponent* *581f8985e1(); // Function Engine.Actor.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x6bba954
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *0d0c513b2c(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x6bbf5c8
	void *83d2d5c58f(); // Function Engine.Actor.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7e88
	void *efaba219b2(struct FName Tag, struct TArray<struct UActorComponent*> ReturnValue); // Function Engine.Actor.*efaba219b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb26f0
	void *541a06a744(); // Function Engine.Actor.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x6bbf4a0
	void *ce1958648c(); // Function Engine.Actor.*ce1958648c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2ec8
	void *891a15da22(struct FVector DestLocation, struct FRotator DestRotation, bool ReturnValue); // Function Engine.Actor.*891a15da22 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbd3c0
	void ReceiveHit(bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	void *76f4a54e31(); // Function Engine.Actor.*76f4a54e31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d38
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd1263c
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6bba93c
	float *7cff7fa404(); // Function Engine.Actor.*7cff7fa404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7010
	struct FVector *d5ff08bf52(); // Function Engine.Actor.*d5ff08bf52 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0a78
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	struct FVector *bbf004721b(); // Function Engine.Actor.*bbf004721b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb47b0
	bool *221e5b49fe(); // Function Engine.Actor.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x6bc8030
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc020
	bool *4bc88286ff(); // Function Engine.Actor.*4bc88286ff // Final|Native|Public|BlueprintCallable // @ game+0x6bc27f8
	struct AActor* *057be55286(); // Function Engine.Actor.*057be55286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5b94
	float *48b2b80fa1(); // Function Engine.Actor.*48b2b80fa1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb4a80
	struct FRotator K2_SetActorRotation(bool bTeleportPhysics, bool ReturnValue); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbc424
	void K2_SetActorTransform(struct FTransform NewTransform); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc524
	void *209c054b22(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.*209c054b22 // Final|Native|Public|BlueprintCallable // @ game+0x6bc96f8
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbe9b28
	void *87d1cdd662(); // Function Engine.Actor.*87d1cdd662 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bc80c8
	void K2_SetActorRelativeTransform(struct FTransform NewRelativeTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bbc1f8
	void *32ee7138ab(); // Function Engine.Actor.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x6bc86b0
	void *45e9b736d8(); // Function Engine.Actor.*45e9b736d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0944
	void *f4f472a4df(struct FVector ReturnValue); // Function Engine.Actor.*f4f472a4df // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb0d78
	void *1357a6903c(float TickInterval); // Function Engine.Actor.*1357a6903c // Final|Native|Public|BlueprintCallable // @ game+0x6bc2cc8
};

// Class Engine.SkeletalMeshActor
// Size: 0x480 (Inherited: 0x3f8)
struct ASkeletalMeshActor : AActor {
	char pad_3F8[0x8]; // 0x3f8(0x08)
	char bShouldDoAnimNotifies : 1; // 0x400(0x01)
	char bWakeOnLevelStart : 1; // 0x400(0x01)
	char pad_400_2 : 6; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x408(0x08)
	struct USkeletalMesh* *78ac740bab; // 0x410(0x08)
	struct UPhysicsAsset* *c076d8455d; // 0x418(0x08)
	struct UMaterialInterface* *30be61bd2f; // 0x420(0x08)
	struct UMaterialInterface* *a44e49c1f5; // 0x428(0x08)
	char pad_430[0x50]; // 0x430(0x50)

	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x5e794bc
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x5e794d4
	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x5e3efb4
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0x5da6fac
};

// Class Engine.DestructibleComponent
// Size: 0xd10 (Inherited: 0xc50)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc48(0x01)
	struct TArray<struct F*ab298b5726> FractureEffects; // 0xc50(0x10)
	bool bEnableHardSleeping; // 0xc60(0x01)
	char pad_C61_1 : 7; // 0xc61(0x01)
	char pad_C62[0x2]; // 0xc62(0x02)
	float LargeChunkThreshold; // 0xc64(0x04)
	char pad_C68[0x10]; // 0xc68(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xc78(0x10)
	char pad_C88[0x88]; // 0xc88(0x88)

	struct UDestructibleMesh* *81619df15f(); // Function Engine.DestructibleComponent.*81619df15f // Final|Native|Public|BlueprintCallable // @ game+0x6c0fff4
	struct UDestructibleMesh* *c2a51a8aea(); // Function Engine.DestructibleComponent.*c2a51a8aea // Final|Native|Public|BlueprintCallable // @ game+0x6be9e80
	bool *15c3764f94(); // Function Engine.DestructibleComponent.*15c3764f94 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd2200
	float *78cda25b7e(); // Function Engine.DestructibleComponent.*78cda25b7e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd1004
};

// Class Engine.SaveGame
// Size: 0x30 (Inherited: 0x30)
struct USaveGame : UObject {
};

// Class Engine.*a3b7e4d578
// Size: 0x9d0 (Inherited: 0x9b0)
struct U*a3b7e4d578 : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x9a8(0x04)
	struct UBodySetup* *03f0c31ef3; // 0x9b0(0x08)
	char *97e70e56df : 1; // 0x9b8(0x01)
	char *caf3bcb1ba : 1; // 0x9b8(0x01)
	char *25b1d2d4e0 : 1; // 0x9b8(0x01)
	char pad_9BC_3 : 5; // 0x9bc(0x01)
	char pad_9BD[0x3]; // 0x9bd(0x03)
	struct UClass* AreaClass; // 0x9c0(0x08)
	char pad_9C8[0x8]; // 0x9c8(0x08)
};

// Class Engine.GameStateBase
// Size: 0x438 (Inherited: 0x3f8)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x3f8(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x400(0x08)
	struct UClass* SpectatorClass; // 0x408(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x410(0x10)
	bool *d3c2be67c8; // 0x420(0x01)
	char pad_421[0x3]; // 0x421(0x03)
	float *97f1b2a6ec; // 0x424(0x04)
	float *ad4174af37; // 0x428(0x04)
	float *f4803290f8; // 0x42c(0x04)
	char pad_430[0x8]; // 0x430(0x08)

	void *30eff713e8(); // Function Engine.GameStateBase.*30eff713e8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb502c
	float *c19ec27f91(); // Function Engine.GameStateBase.*c19ec27f91 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6304
	float *2ae46ac202(); // Function Engine.GameStateBase.*2ae46ac202 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb625c
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0xc06800
	float *8c90983c69(); // Function Engine.GameStateBase.*8c90983c69 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e18148
	float *9c5ebaa37b(); // Function Engine.GameStateBase.*9c5ebaa37b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e96524
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0x5e42070
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0xc89f80
	bool *d4e79c9423(); // Function Engine.GameStateBase.*d4e79c9423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb726c
	bool *9816c4a151(); // Function Engine.GameStateBase.*9816c4a151 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb721c
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xd3cff4
};

// Class Engine.GameState
// Size: 0x458 (Inherited: 0x438)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x438(0x08)
	struct FName PreviousMatchState; // 0x440(0x08)
	int32 ElapsedTime; // 0x448(0x04)
	char pad_44C[0xc]; // 0x44c(0x0c)

	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x5de512c
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0xc281a4
};

// Class Engine.BoxComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UBoxComponent : U*a3b7e4d578 {
	struct FVector BoxExtent; // 0x9c8(0x0c)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	struct FVector *0211fba5c3(); // Function Engine.BoxComponent.*0211fba5c3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf2644
	bool *f4af67cd92(); // Function Engine.BoxComponent.*f4af67cd92 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c0de68
	struct FVector *6ed44cdd4c(); // Function Engine.BoxComponent.*6ed44cdd4c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf01e8
};

// Class Engine.ProjectileMovementComponent
// Size: 0x310 (Inherited: 0x250)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x248(0x04)
	float MaxSpeed; // 0x24c(0x04)
	char bRotationFollowsVelocity : 1; // 0x250(0x01)
	char bShouldBounce : 1; // 0x250(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x250(0x01)
	char bForceSubStepping : 1; // 0x250(0x01)
	char bSimulationEnabled : 1; // 0x250(0x01)
	char bSweepCollision : 1; // 0x250(0x01)
	char bIsHomingProjectile : 1; // 0x250(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x250(0x01)
	char bIsSliding : 1; // 0x251(0x01)
	char bInterpMovement : 1; // 0x251(0x01)
	char bInterpRotation : 1; // 0x251(0x01)
	float PreviousHitTime; // 0x254(0x04)
	struct FVector PreviousHitNormal; // 0x258(0x0c)
	float ProjectileGravityScale; // 0x264(0x04)
	float *00c93b38f7; // 0x268(0x04)
	float Bounciness; // 0x26c(0x04)
	float Friction; // 0x270(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x274(0x04)
	float MinFrictionFraction; // 0x278(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x280(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x290(0x10)
	float HomingAccelerationMagnitude; // 0x2a0(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x2a4(0x08)
	float MaxSimulationTimeStep; // 0x2ac(0x04)
	int32 MaxSimulationIterations; // 0x2b0(0x04)
	int32 BounceAdditionalIterations; // 0x2b4(0x04)
	float InterpLocationTime; // 0x2b8(0x04)
	float InterpRotationTime; // 0x2bc(0x04)
	float InterpLocationMaxLagDistance; // 0x2c0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2c4(0x04)
	char pad_2C9[0x47]; // 0x2c9(0x47)

	void OnProjectileBounceDelegate__DelegateSignature(struct FHitResult ImpactResult, struct FVector ImpactVelocity); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x370fbc
	void *682b698b23(struct USceneComponent* Component); // Function Engine.ProjectileMovementComponent.*682b698b23 // Native|Public|BlueprintCallable // @ game+0x6c13540
	void OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x370fbc
	void *417e40db25(); // Function Engine.ProjectileMovementComponent.*417e40db25 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf67fc
	struct FVector LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf9da8
	struct FHitResult StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c21b20
	struct FRotator *b0b3c27e08(); // Function Engine.ProjectileMovementComponent.*b0b3c27e08 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c01abc
	void *8a3fcb4372(); // Function Engine.ProjectileMovementComponent.*8a3fcb4372 // Native|Public|BlueprintCallable // @ game+0x5e1fdec
	struct FVector *ddf11306f9(); // Function Engine.ProjectileMovementComponent.*ddf11306f9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c1a104
	bool *d1c2c36cc0(); // Function Engine.ProjectileMovementComponent.*d1c2c36cc0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf726c
};

// Class Engine.CurveBase
// Size: 0x38 (Inherited: 0x30)
struct UCurveBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.GameUserSettings
// Size: 0x118 (Inherited: 0x30)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x30(0x01)
	bool bUseDynamicResolution; // 0x31(0x01)
	char pad_32[0x4e]; // 0x32(0x4e)
	uint32 ResolutionSizeX; // 0x80(0x04)
	uint32 ResolutionSizeY; // 0x84(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	int32 WindowPosX; // 0x90(0x04)
	int32 WindowPosY; // 0x94(0x04)
	int32 FullscreenMode; // 0x98(0x04)
	int32 LastConfirmedFullscreenMode; // 0x9c(0x04)
	int32 PreferredFullscreenMode; // 0xa0(0x04)
	uint32 Version; // 0xa4(0x04)
	int32 AudioQualityLevel; // 0xa8(0x04)
	float FrameRateLimit; // 0xac(0x04)
	char pad_B0[0x4]; // 0xb0(0x04)
	int32 DesiredScreenWidth; // 0xb4(0x04)
	bool bUseDesiredScreenHeight; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DesiredScreenHeight; // 0xbc(0x04)
	float LastRecommendedScreenWidth; // 0xc0(0x04)
	float LastRecommendedScreenHeight; // 0xc4(0x04)
	float LastCPUBenchmarkResult; // 0xc8(0x04)
	float LastGPUBenchmarkResult; // 0xcc(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xd0(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xe0(0x10)
	float LastGPUBenchmarkMultiplier; // 0xf0(0x04)
	bool bUseHDRDisplayOutput; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	int32 HDRDisplayOutputNits; // 0xf8(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xfc(0x01)
	bool bGPUDebug; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0x100(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x108(0x10)

	void *f09878a527(bool bEnable, int32 DisplayNits); // Function Engine.GameUserSettings.*f09878a527 // Final|Native|Public|BlueprintCallable // @ game+0x6c32fe4
	void *7a77ec6483(bool ReturnValue); // Function Engine.GameUserSettings.*7a77ec6483 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3f99c
	void *62bb0b9181(); // Function Engine.GameUserSettings.*62bb0b9181 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c356e0
	void *16010d7314(); // Function Engine.GameUserSettings.*16010d7314 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xb87394
	void *a5e93d4853(bool bEnable); // Function Engine.GameUserSettings.*a5e93d4853 // Final|Native|Public|BlueprintCallable // @ game+0x6c3ea1c
	void *54584e1936(bool ReturnValue); // Function Engine.GameUserSettings.*54584e1936 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c380b0
	void *e3a237f6aa(); // Function Engine.GameUserSettings.*e3a237f6aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c37668
	void *d62db2618b(); // Function Engine.GameUserSettings.*d62db2618b // Native|Public|BlueprintCallable // @ game+0xc35fec
	void *50d117aec6(float CurrentScaleNormalized, float CurrentScaleValue, float MinScaleValue, float MaxScaleValue); // Function Engine.GameUserSettings.*50d117aec6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6c36984
	void *52b88c9c83(); // Function Engine.GameUserSettings.*52b88c9c83 // Native|Public|BlueprintCallable // @ game+0x5e2a244
	void *13d64b82da(); // Function Engine.GameUserSettings.*13d64b82da // Final|Native|Public|BlueprintCallable // @ game+0x6c3defc
	enum class EWindowMode *34bb69adfa(); // Function Engine.GameUserSettings.*34bb69adfa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c351e4
	void *f18a34db27(); // Function Engine.GameUserSettings.*f18a34db27 // Final|Native|Public|BlueprintCallable // @ game+0x6c301a0
	bool *bf934dae7a(); // Function Engine.GameUserSettings.*bf934dae7a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c37b4c
	float *b6b6477ce1(); // Function Engine.GameUserSettings.*b6b6477ce1 // Native|Public|BlueprintCallable // @ game+0x6c3667c
	enum class EWindowMode *7398906ef8(); // Function Engine.GameUserSettings.*7398906ef8 // Final|Native|Public|BlueprintCallable // @ game+0x6c3df94
	int32 *4deaae310e(); // Function Engine.GameUserSettings.*4deaae310e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c349a8
	bool *9685e14f57(); // Function Engine.GameUserSettings.*9685e14f57 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c2fd5c
	bool LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x6c32c60
	int32 *4338d69a5b(); // Function Engine.GameUserSettings.*4338d69a5b // Final|Native|Public|BlueprintCallable // @ game+0x6c3dc98
	struct FIntPoint *bc9926799e(); // Function Engine.GameUserSettings.*bc9926799e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c3e5d8
	bool *a8e280c616(); // Function Engine.GameUserSettings.*a8e280c616 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3808c
	enum class EWindowMode *ae46e29729(); // Function Engine.GameUserSettings.*ae46e29729 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c36168
	struct FIntPoint *f90938b578(); // Function Engine.GameUserSettings.*f90938b578 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6c34c10
	struct FIntPoint *56639da4d9(); // Function Engine.GameUserSettings.*56639da4d9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c36b64
	bool *21dcbf64ef(); // Function Engine.GameUserSettings.*21dcbf64ef // Native|Public|BlueprintCallable // @ game+0x5e2a2f4
	void *ab471d586e(); // Function Engine.GameUserSettings.*ab471d586e // Native|Public|BlueprintCallable // @ game+0xb50d98
	int32 *4c79fccc09(); // Function Engine.GameUserSettings.*4c79fccc09 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c36b88
	void *a609aa78e1(bool bEnable); // Function Engine.GameUserSettings.*a609aa78e1 // Final|Native|Public|BlueprintCallable // @ game+0x6c3ddd4
	void *56cb0d0526(struct FIntPoint ReturnValue); // Function Engine.GameUserSettings.*56cb0d0526 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c34c28
	void *4f7c4e69be(); // Function Engine.GameUserSettings.*4f7c4e69be // Final|Native|Public|BlueprintCallable // @ game+0x6c3d528
	void *67e0825c74(); // Function Engine.GameUserSettings.*67e0825c74 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c351b8
	void *d6b3133478(); // Function Engine.GameUserSettings.*d6b3133478 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c37310
	void *a14804f3fa(float NewScaleNormalized); // Function Engine.GameUserSettings.*a14804f3fa // Final|Native|Public|BlueprintCallable // @ game+0x6c3e288
	void *c71c9b8280(int32 Value); // Function Engine.GameUserSettings.*c71c9b8280 // Final|Native|Public|BlueprintCallable // @ game+0x6c3e664
	void *281d60d9bd(); // Function Engine.GameUserSettings.*281d60d9bd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c35be0
	void *a498d39449(); // Function Engine.GameUserSettings.*a498d39449 // Final|Native|Public|BlueprintCallable // @ game+0x6c3de60
	void GetResolutionScaleInformation(float CurrentScaleNormalized, int32 CurrentScaleValue, int32 MinScaleValue); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3678c
	void *da4f81d627(); // Function Engine.GameUserSettings.*da4f81d627 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3477c
	void *a7688da407(float NewScaleValue); // Function Engine.GameUserSettings.*a7688da407 // Final|Native|Public|BlueprintCallable // @ game+0x6c3e3cc
	void *5ad2ec17ad(int32 Value); // Function Engine.GameUserSettings.*5ad2ec17ad // Final|Native|Public|BlueprintCallable // @ game+0x6c3eb98
	void *7968528a88(); // Function Engine.GameUserSettings.*7968528a88 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c36154
	void *4c94344049(); // Function Engine.GameUserSettings.*4c94344049 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c37b84
	float *5c14849ddf(); // Function Engine.GameUserSettings.*5c14849ddf // Native|Public|BlueprintCallable // @ game+0x6c34be4
	int32 *e183b3cb37(); // Function Engine.GameUserSettings.*e183b3cb37 // Native|Public|BlueprintCallable // @ game+0x6c0ee8c
	int32 *3db9445308(); // Function Engine.GameUserSettings.*3db9445308 // Final|Native|Public|BlueprintCallable // @ game+0x5e245cc
	struct FIntPoint *92dcc7d375(); // Function Engine.GameUserSettings.*92dcc7d375 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6c34bc4
	void *b5a9c7fe3c(); // Function Engine.GameUserSettings.*b5a9c7fe3c // Native|Public|BlueprintCallable // @ game+0x5e4d4e4
	bool *d9d0600777(); // Function Engine.GameUserSettings.*d9d0600777 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c37b28
	bool *a27483cae9(); // Function Engine.GameUserSettings.*a27483cae9 // Final|Native|Public|BlueprintCallable // @ game+0x6c2c64c
	enum class EWindowMode *4b36d81370(); // Function Engine.GameUserSettings.*4b36d81370 // Final|Native|Static|Public|BlueprintCallable // @ game+0xdaa580
	float *2120c68df5(); // Function Engine.GameUserSettings.*2120c68df5 // Native|Public|BlueprintCallable // @ game+0x6c3da9c
	struct UGameUserSettings* *0a1ea4b6ce(); // Function Engine.GameUserSettings.*0a1ea4b6ce // Final|Native|Static|Public|BlueprintCallable // @ game+0x6c352e4
	void *5405e8f3e5(); // Function Engine.GameUserSettings.*5405e8f3e5 // Final|Native|Public|BlueprintCallable // @ game+0x6c3dd24
	enum class EWindowMode *3292c1651c(); // Function Engine.GameUserSettings.*3292c1651c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c356bc
	int32 *9786fe7e17(); // Function Engine.GameUserSettings.*9786fe7e17 // Final|Native|Public|BlueprintCallable // @ game+0x6c3dc0c
	int32 *d55782ad36(); // Function Engine.GameUserSettings.*d55782ad36 // Final|Native|Public|BlueprintCallable // @ game+0x6c3e1fc
	int32 SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x6c3e338
	bool *d319a7ba30(); // Function Engine.GameUserSettings.*d319a7ba30 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c38048
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x5e4d48c
	void *179e926ab3(int32 Value); // Function Engine.GameUserSettings.*179e926ab3 // Final|Native|Public|BlueprintCallable // @ game+0x6c3e990
	void *a70fd254a1(int32 ReturnValue); // Function Engine.GameUserSettings.*a70fd254a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c37654
	void *a36569de53(); // Function Engine.GameUserSettings.*a36569de53 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c37b60
	void *7216dd5245(); // Function Engine.GameUserSettings.*7216dd5245 // Native|Public|BlueprintCallable // @ game+0x6629f08
	void *871e12b97e(int32 ReturnValue); // Function Engine.GameUserSettings.*871e12b97e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c34768
	void *274fd91604(float ReturnValue); // Function Engine.GameUserSettings.*274fd91604 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c351cc
};

// Class Engine.GameInstance
// Size: 0x1f0 (Inherited: 0x30)
struct UGameInstance : UObject {
	char pad_30[0x80]; // 0x30(0x80)
	struct U*d3391c2860* *d3391c2860; // 0xb0(0x08)
	char pad_B8[0x18]; // 0xb8(0x18)
	struct U*bd40d2e124* *bd40d2e124; // 0xd0(0x08)
	char pad_D8[0x28]; // 0xd8(0x28)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0x100(0x10)
	char pad_110[0xe0]; // 0x110(0xe0)

	int32 DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x6bdfdf0
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x370fbc
	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x370fbc
	enum class ETravelFailure HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x370fbc
	void DebugCreatePlayer(int32 Param0); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x6bdfd5c
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x370fbc
};

// Class Engine.TriggerBase
// Size: 0x400 (Inherited: 0x3f8)
struct ATriggerBase : AActor {
	struct U*a3b7e4d578* CollisionComponent; // 0x3f8(0x08)
};

// Class Engine.TriggerBox
// Size: 0x400 (Inherited: 0x400)
struct ATriggerBox : ATriggerBase {
	struct U*a3b7e4d578* CollisionComponent; // 0x3f8(0x08)
};

// Class Engine.CapsuleComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UCapsuleComponent : U*a3b7e4d578 {
	float CapsuleHalfHeight; // 0x9c8(0x04)
	float CapsuleRadius; // 0x9cc(0x04)
	float CapsuleHeight; // 0x9d0(0x04)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	struct FName *2e26aaaf30(); // Function Engine.CapsuleComponent.*2e26aaaf30 // Native|Public|BlueprintCallable // @ game+0x6bc49dc
	float *ef518e2bd2(); // Function Engine.CapsuleComponent.*ef518e2bd2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0330
	float *bc3968cb8f(bool bUpdateOverlaps); // Function Engine.CapsuleComponent.*bc3968cb8f // Final|Native|Public|BlueprintCallable // @ game+0x6c0e210
	void *011d593501(float ReturnValue); // Function Engine.CapsuleComponent.*011d593501 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0290
	void *26dc85d144(); // Function Engine.CapsuleComponent.*26dc85d144 // Final|Native|Public|BlueprintCallable // @ game+0x6c0e2fc
	void *bdde07625c(float ReturnValue); // Function Engine.CapsuleComponent.*bdde07625c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0698
	void *f8205dfbb2(float ReturnValue); // Function Engine.CapsuleComponent.*f8205dfbb2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf2684
	void *0875f2063a(); // Function Engine.CapsuleComponent.*0875f2063a // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf27c8
	void *1e1f900e13(bool bUpdateOverlaps); // Function Engine.CapsuleComponent.*1e1f900e13 // Final|Native|Public|BlueprintCallable // @ game+0x6c0e07c
	void *3a3aa0f9aa(enum class ECollisionResponse NewResponse); // Function Engine.CapsuleComponent.*3a3aa0f9aa // Native|Public|BlueprintCallable // @ game+0x6bc4a70
	void *2c7d490376(); // Function Engine.CapsuleComponent.*2c7d490376 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf26c0
	void *9b7bc42e76(); // Function Engine.CapsuleComponent.*9b7bc42e76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0244
	void *67e552295b(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse); // Function Engine.CapsuleComponent.*67e552295b // Native|Public|BlueprintCallable // @ game+0x6bc4b08
	void *e181a1cfbd(); // Function Engine.CapsuleComponent.*e181a1cfbd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf266c
	void *e4b72b64f4(); // Function Engine.CapsuleComponent.*e4b72b64f4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf26a8
	float *aed5587e4f(); // Function Engine.CapsuleComponent.*aed5587e4f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf02e4
	float *a34ddecc70(); // Function Engine.CapsuleComponent.*a34ddecc70 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0464
};

// Class Engine.PhysicsVolume
// Size: 0x448 (Inherited: 0x430)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x430(0x04)
	int32 Priority; // 0x434(0x04)
	float FluidFriction; // 0x438(0x04)
	char bWaterVolume : 1; // 0x43c(0x01)
	char bPhysicsOnContact : 1; // 0x43c(0x01)
	char pad_43C_2 : 6; // 0x43c(0x01)
	char pad_43D[0x3]; // 0x43d(0x03)
	bool *dd9a04a32f; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x800 (Inherited: 0x7b0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7b0(0x01)
	char *76e211aeb5 : 1; // 0x7b0(0x01)
	char pad_7B0_2 : 6; // 0x7b0(0x01)
	char pad_7B1[0x7]; // 0x7b1(0x07)
	struct U*dd9d99e533* *148f44aecb; // 0x7b8(0x08)
	char pad_7C0[0x20]; // 0x7c0(0x20)
	float SpeedScale; // 0x7e0(0x04)
	float InitialMaxSpeed; // 0x7e4(0x04)
	float InitialAccel; // 0x7e8(0x04)
	float InitialDecel; // 0x7ec(0x04)
	char pad_7F0[0x10]; // 0x7f0(0x10)

	struct APlayerController* ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x370fbc
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x5ddd564
	void *75c4cb893b(); // Function Engine.DebugCameraController.*75c4cb893b // Final|Native|Public|BlueprintCallable // @ game+0x6bca468
	struct AActor* *f6b8be8510(); // Function Engine.DebugCameraController.*f6b8be8510 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb64bc
	float *35c773a147(); // Function Engine.DebugCameraController.*35c773a147 // Final|Native|Public|BlueprintCallable // @ game+0x6bc75b4
	struct FHitResult ReceiveOnActorSelected(); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	struct APlayerController* ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x370fbc
};

// Class Engine.Channel
// Size: 0x70 (Inherited: 0x30)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x38]; // 0x38(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x70)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_78[0x2f8]; // 0x78(0x2f8)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_378[0x18]; // 0x378(0x18)
};

// Class Engine.NavigationObjectBase
// Size: 0x420 (Inherited: 0x3f8)
struct ANavigationObjectBase : AActor {
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x400(0x08)
	struct UBillboardComponent* *1e66e18c2d; // 0x408(0x08)
	struct UBillboardComponent* *7b636d7ee5; // 0x410(0x08)
	char *0cf4674479 : 1; // 0x418(0x01)
	char pad_418_1 : 7; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
};

// Class Engine.PlayerStart
// Size: 0x428 (Inherited: 0x420)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x420(0x08)
};

// Class Engine.CheatManager
// Size: 0x80 (Inherited: 0x30)
struct UCheatManager : UObject {
	struct ADebugCameraController* *7d926fcff8; // 0x30(0x08)
	struct UClass* DebugCameraControllerClass; // 0x38(0x08)
	char pad_40[0x40]; // 0x40(0x40)

	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x5e4d48c
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x370fbc
	void Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x6c3eff0
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x6c32c30
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0x5e2a244
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x5e4d434
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x6bba93c
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x6c329f4
	void *50dd42b97f(); // Function Engine.CheatManager.*50dd42b97f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6c3dbc0
	struct FString ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x6c40fe8
	struct FString Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x6c3f8d8
	void *700af58636(); // Function Engine.CheatManager.*700af58636 // Native|Protected|BlueprintCallable // @ game+0x6c32c48
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x6c345c0
	struct UClass* ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x6c40f54
	float DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x6c32958
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x6c40788
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x5dcd48c
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x6c3e150
	float FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x6c345d8
	struct UClass* DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x6c32b9c
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x5e4d4cc
	struct UClass* DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x65376a4
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x5e4d44c
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x6c3cb80
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x6c37abc
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x6c32e10
	struct FString CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x6c2fe20
	bool DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x6bc2890
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x6c32e28
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x6c32aa4
	void SetNavDrawDistance(float Param0); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x6c3e164
	void BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x6c2e190
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x6c3cd90
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x6c40770
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x5e429e4
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x6c32e40
	void StreamLevelOut(struct FName Param0); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x6c3f61c
	void DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x6c32a0c
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x370fbc
	void *3854a48cf0(); // Function Engine.CheatManager.*3854a48cf0 // Native|Protected|BlueprintCallable // @ game+0x6c32ed8
	void StreamLevelIn(struct FName Param0); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x6c3f588
	void ViewActor(struct FName Param0); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x6c40ec0
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x5e425cc
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x6c410ac
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x6c3f9c4
	void BugItStringCreator(struct FRotator Param1, struct FString Param2, struct FString Param3); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x6c2e470
	void ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x6c2fd84
	void DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x6c32abc
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x6c3ec24
	struct FName OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6c3c600
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0xd9fc70
	float BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x6c2e254
};

// Class Engine.*e915f35194
// Size: 0x9c0 (Inherited: 0x9b0)
struct U*e915f35194 : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0x9b0(0x10)
};

// Class Engine.NavArea
// Size: 0x48 (Inherited: 0x30)
struct UNavArea : UObject {
	float DefaultCost; // 0x30(0x04)
	float FixedAreaEnteringCost; // 0x34(0x04)
	struct FColor DrawColor; // 0x38(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x3c(0x04)
	char bSupportsAgent0 : 1; // 0x40(0x01)
	char bSupportsAgent1 : 1; // 0x40(0x01)
	char bSupportsAgent2 : 1; // 0x40(0x01)
	char bSupportsAgent3 : 1; // 0x40(0x01)
	char bSupportsAgent4 : 1; // 0x40(0x01)
	char bSupportsAgent5 : 1; // 0x40(0x01)
	char bSupportsAgent6 : 1; // 0x40(0x01)
	char bSupportsAgent7 : 1; // 0x40(0x01)
	char bSupportsAgent8 : 1; // 0x41(0x01)
	char bSupportsAgent9 : 1; // 0x41(0x01)
	char bSupportsAgent10 : 1; // 0x41(0x01)
	char bSupportsAgent11 : 1; // 0x41(0x01)
	char bSupportsAgent12 : 1; // 0x41(0x01)
	char bSupportsAgent13 : 1; // 0x41(0x01)
	char bSupportsAgent14 : 1; // 0x41(0x01)
	char bSupportsAgent15 : 1; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x400 (Inherited: 0x3f8)
struct ALevelScriptActor : AActor {
	char *a7ca75b064 : 1; // 0x3f8(0x01)
	char pad_3F8_1 : 7; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)

	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x370fbc
	struct FIntVector WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x370fbc
	bool *5a504151cb(); // Function Engine.LevelScriptActor.*5a504151cb // Native|Public|BlueprintCallable // @ game+0xca5094
	bool *dcb17fb5d9(); // Function Engine.LevelScriptActor.*dcb17fb5d9 // Native|Public|BlueprintCallable // @ game+0x5e53474
};

// Class Engine.ChildActorComponent
// Size: 0x4a0 (Inherited: 0x470)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x468(0x08)
	struct AActor* ChildActor; // 0x470(0x08)
	struct AActor* ChildActorTemplate; // 0x478(0x08)
	char pad_488[0x18]; // 0x488(0x18)

	void *a0eca42e03(); // Function Engine.ChildActorComponent.*a0eca42e03 // Final|Native|Public|BlueprintCallable // @ game+0x6bc46c4
};

// Class Engine.CameraComponent
// Size: 0xa60 (Inherited: 0x470)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x468(0x04)
	float OrthoWidth; // 0x46c(0x04)
	float OrthoNearClipPlane; // 0x470(0x04)
	float OrthoFarClipPlane; // 0x474(0x04)
	float AspectRatio; // 0x478(0x04)
	char bConstrainAspectRatio : 1; // 0x47c(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x47c(0x01)
	char bLockToHmd : 1; // 0x47c(0x01)
	char bUsePawnControlRotation : 1; // 0x47c(0x01)
	enum class ECameraProjectionMode ProjectionMode; // 0x480(0x01)
	float PostProcessBlendWeight; // 0x484(0x04)
	char pad_489_4 : 4; // 0x489(0x01)
	char pad_48A[0x6]; // 0x48a(0x06)
	struct FPostProcessSettings PostProcessSettings; // 0x490(0x570)
	char pad_A00[0x58]; // 0xa00(0x58)
	char bUseControllerViewRotation : 1; // 0xa58(0x01)
	char pad_A58_1 : 7; // 0xa58(0x01)
	char pad_A59[0x7]; // 0xa59(0x07)

	void *3e8a28e83e(bool bInUseFieldOfViewForLOD); // Function Engine.CameraComponent.*3e8a28e83e // Final|Native|Public|BlueprintCallable // @ game+0x6c19bbc
	void *ed3ee02381(float InAspectRatio); // Function Engine.CameraComponent.*ed3ee02381 // Final|Native|Public|BlueprintCallable // @ game+0x6c0c89c
	void *2cfadfbbf2(); // Function Engine.CameraComponent.*2cfadfbbf2 // Final|Native|Public|BlueprintCallable // @ game+0x6c0f0a0
	void *65b65a3f19(struct F*067063007d DesiredView); // Function Engine.CameraComponent.*65b65a3f19 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6be8910
	void *1dc2d160f2(float InFieldOfView); // Function Engine.CameraComponent.*1dc2d160f2 // Final|Native|Public|BlueprintCallable // @ game+0x6c116a4
	void *052965d968(); // Function Engine.CameraComponent.*052965d968 // Final|Native|Public|BlueprintCallable // @ game+0x6c15994
	void *cb2bddba68(); // Function Engine.CameraComponent.*cb2bddba68 // Final|Native|Public|BlueprintCallable // @ game+0x6c167c8
	void *fc57e66de9(float InPostProcessBlendWeight); // Function Engine.CameraComponent.*fc57e66de9 // Final|Native|Public|BlueprintCallable // @ game+0x6c1643c
	void *a634495c79(float InOrthoFarClipPlane); // Function Engine.CameraComponent.*a634495c79 // Final|Native|Public|BlueprintCallable // @ game+0x6c13380
	void *47a266b8d3(); // Function Engine.CameraComponent.*47a266b8d3 // Final|Native|Public|BlueprintCallable // @ game+0x6c158fc
	void *fa132a0246(); // Function Engine.CameraComponent.*fa132a0246 // Final|Native|Public|BlueprintCallable // @ game+0x6bcfd24
};

// Class Engine.Engine
// Size: 0xf60 (Inherited: 0x30)
struct UEngine : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FStringAssetReference TinyFontName; // 0x40(0x10)
	struct UFont* SmallFont; // 0x50(0x08)
	struct FStringAssetReference SmallFontName; // 0x58(0x10)
	struct UFont* *507343f03f; // 0x68(0x08)
	struct FStringAssetReference MediumFontName; // 0x70(0x10)
	struct UFont* LargeFont; // 0x80(0x08)
	struct FStringAssetReference LargeFontName; // 0x88(0x10)
	struct UFont* *ae8c533874; // 0x98(0x08)
	struct FStringAssetReference SubtitleFontName; // 0xa0(0x10)
	struct TArray<struct UFont*> *bf37e23aad; // 0xb0(0x10)
	struct UClass* *bca32af458; // 0xc0(0x08)
	struct UMaterialInstanceDynamic* *c9913ab955; // 0xc8(0x08)
	struct UMaterialInstanceDynamic* *d3f16fe233; // 0xd0(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0xd8(0x10)
	struct FColor *0726a044a7; // 0xe8(0x04)
	struct FColor *d70aaca090; // 0xec(0x04)
	struct FStringClassReference AIControllerClassName; // 0xf0(0x10)
	struct UClass* *eac8e4cb12; // 0x100(0x08)
	char pad_108[0x8]; // 0x108(0x08)
	struct UClass* *f097998e2e; // 0x110(0x08)
	struct UClass* *5df25eabe1; // 0x118(0x08)
	struct UTexture2D* *6f11af224f; // 0x120(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x128(0x10)
	struct FString *2a2ef25c03; // 0x138(0x10)
	struct FStringClassReference ConsoleClassName; // 0x148(0x10)
	struct UMaterialInstanceDynamic* *7e0f4b06ea; // 0x158(0x08)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x160(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x170(0x10)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x180(0x10)
	struct UMaterial* *3c832889f7; // 0x190(0x08)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x198(0x10)
	struct FStringClassReference LevelScriptActorClassName; // 0x1a8(0x10)
	struct TArray<struct F*53e10b7853> ActiveStructRedirects; // 0x1b8(0x10)
	struct FString *9c43f6ae30; // 0x1c8(0x10)
	struct FStringClassReference AssetManagerClassName; // 0x1d8(0x10)
	char bCanBlueprintsTickByDefault : 1; // 0x1e8(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x1e8(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x1e8(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x1e8(0x01)
	char pad_1E8_4 : 1; // 0x1e8(0x01)
	char bSmoothFrameRate : 1; // 0x1e8(0x01)
	char bUseFixedFrameRate : 1; // 0x1e8(0x01)
	char pad_1E8_7 : 1; // 0x1e8(0x01)
	char pad_1E9[0x3]; // 0x1e9(0x03)
	struct FColor *93d8306f3e; // 0x1ec(0x04)
	struct FStringAssetReference DefaultBokehTextureName; // 0x1f0(0x10)
	struct FStringClassReference GameUserSettingsClassName; // 0x200(0x10)
	struct F*a670be9e73 PhysicErrorCorrection; // 0x210(0x1c)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0x230(0x10)
	struct TArray<struct F*7decbe1dec> ActivePluginRedirects; // 0x240(0x10)
	struct FString ShadedLevelColorationLitMaterialName; // 0x250(0x10)
	struct FColor *f3e6f5bfd3; // 0x260(0x04)
	float MeshLODRange; // 0x264(0x04)
	struct UMaterialInstanceDynamic* *254455a899; // 0x268(0x08)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x270(0x10)
	float FixedFrameRate; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct TArray<struct F*ca6e9f58f0> *665f43cd1a; // 0x288(0x10)
	int32 *0a40c80458; // 0x298(0x04)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct UMaterial* *64c29e4c8e; // 0x2a0(0x08)
	struct UTexture2D* *acefe7e29a; // 0x2a8(0x08)
	struct UMaterial* *38f7dc552f; // 0x2b0(0x08)
	struct UMaterial* VertexColorMaterial; // 0x2b8(0x08)
	int32 MaxParticleResizeWarn; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct TArray<struct FString> *93075208c5; // 0x2c8(0x10)
	char pad_2D8[0x18]; // 0x2d8(0x18)
	struct FString LevelColorationUnlitMaterialName; // 0x2f0(0x10)
	float MaxOcclusionPixelsFraction; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0x308(0x10)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x318(0x10)
	struct TArray<struct F*c345caf06a> ActiveClassRedirects; // 0x328(0x10)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0x338(0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x348(0x10)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x358(0x10)
	struct UMaterial* WireframeMaterial; // 0x368(0x08)
	int32 MaximumLoopIterationCount; // 0x370(0x04)
	char pad_374[0x4]; // 0x374(0x04)
	struct UMaterial* *ab703d8f59; // 0x378(0x08)
	struct FString LevelColorationLitMaterialName; // 0x380(0x10)
	int32 *1869c29680; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	struct UMaterial* *e6d19dd636; // 0x398(0x08)
	struct FStringClassReference GameSingletonClassName; // 0x3a0(0x10)
	int32 *ffcb6d7674; // 0x3b0(0x04)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct UTextureCube* *27c2cc10e6; // 0x3b8(0x08)
	float MinLightMapDensity; // 0x3c0(0x04)
	struct FLinearColor LightingOnlyBrightness; // 0x3c4(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x3d4(0x10)
	char pad_3E4[0x4]; // 0x3e4(0x04)
	struct FString VertexColorMaterialName; // 0x3e8(0x10)
	char pad_3F8[0x50]; // 0x3f8(0x50)
	struct FStringAssetReference ArrowMaterialName; // 0x448(0x10)
	struct FStringClassReference NavigationSystemClassName; // 0x458(0x10)
	struct FStringClassReference GameViewportClientClassName; // 0x468(0x10)
	char bSubtitlesForcedOff : 1; // 0x478(0x01)
	char pad_478_1 : 7; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)
	struct FStringAssetReference DefaultPhysMaterialName; // 0x480(0x10)
	char bHardwareSurveyEnabled : 1; // 0x490(0x01)
	char pad_490_1 : 7; // 0x490(0x01)
	char pad_491[0x7]; // 0x491(0x07)
	struct FString LightingTexelDensityName; // 0x498(0x10)
	struct UMaterialInstanceDynamic* *72154a0386; // 0x4a8(0x08)
	float NearClipPlane; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct UTexture2D* *8f60aed062; // 0x4b8(0x08)
	struct UMaterial* *9eae766840; // 0x4c0(0x08)
	float DisplayGamma; // 0x4c8(0x04)
	float RenderLightMapDensityColorScale; // 0x4cc(0x04)
	char bAllowMatureLanguage : 1; // 0x4d0(0x01)
	char pad_4D0_1 : 7; // 0x4d0(0x01)
	char pad_4D1[0x3]; // 0x4d1(0x03)
	float CameraRotationThreshold; // 0x4d4(0x04)
	char bRenderLightMapDensityGrayscale : 1; // 0x4d8(0x01)
	char pad_4D8_1 : 7; // 0x4d8(0x01)
	char pad_4D9[0x7]; // 0x4d9(0x07)
	struct UClass* *398beed366; // 0x4e0(0x08)
	float *8650eed282; // 0x4e8(0x04)
	struct FColor *5a2eee72e8; // 0x4ec(0x04)
	struct UClass* *493183b606; // 0x4f0(0x08)
	struct FStringClassReference AvoidanceManagerClassName; // 0x4f8(0x10)
	struct FString PlayOnConsoleSaveDir; // 0x508(0x10)
	struct UTexture2D* MiniFontTexture; // 0x518(0x08)
	struct FColor *563b988ac5; // 0x520(0x04)
	char pad_524[0x4]; // 0x524(0x04)
	struct UTexture* WeightMapPlaceholderTexture; // 0x528(0x08)
	enum class *dcab1bab62 *20eca73099; // 0x530(0x01)
	char pad_531[0x7]; // 0x531(0x07)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x538(0x10)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UTexture2D* *724b637f77; // 0x550(0x08)
	struct UClass* *86033d1ce7; // 0x558(0x08)
	struct FStringAssetReference DebugMeshMaterialName; // 0x560(0x10)
	struct UClass* *802217e7fd; // 0x570(0x08)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x578(0x08)
	struct UMaterial* *4bb7c31cac; // 0x580(0x08)
	struct TArray<struct F*0ae4a8d9ad> ActiveGameNameRedirects; // 0x588(0x10)
	char bSubtitlesEnabled : 1; // 0x598(0x01)
	char pad_598_1 : 7; // 0x598(0x01)
	char pad_599[0x7]; // 0x599(0x07)
	struct UAssetManager* AssetManager; // 0x5a0(0x08)
	struct FStringAssetReference LightMapDensityTextureName; // 0x5a8(0x10)
	struct UObject* *c09072c920; // 0x5b8(0x08)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0x5c0(0x10)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0x5d0(0x10)
	float MinDesiredFrameRate; // 0x5e0(0x04)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x5e4(0x01)
	char pad_5E4_1 : 7; // 0x5e4(0x01)
	char pad_5E5[0x3]; // 0x5e5(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0x5e8(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x5ec(0x01)
	char pad_5EC_1 : 7; // 0x5ec(0x01)
	char pad_5ED[0x3]; // 0x5ed(0x03)
	struct UMaterial* *eae6f63fae; // 0x5f0(0x08)
	struct FStringAssetReference MiniFontTextureName; // 0x5f8(0x10)
	struct TArray<struct F*4fc053d54d> StatColorMappings; // 0x608(0x10)
	struct UMaterial* *ed6cf214e5; // 0x618(0x08)
	char bPauseOnLossOfFocus : 1; // 0x620(0x01)
	char pad_620_1 : 7; // 0x620(0x01)
	char pad_621[0x3]; // 0x621(0x03)
	int32 MaxParticleResize; // 0x624(0x04)
	float MaxLightMapDensity; // 0x628(0x04)
	struct FFloatRange SmoothedFrameRateRange; // 0x62c(0x10)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x640(0x08)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x648(0x08)
	float MaxPixelShaderAdditiveComplexityCount; // 0x650(0x04)
	char pad_654[0x4]; // 0x654(0x04)
	struct UTexture2D* *b064f85396; // 0x658(0x08)
	struct UMaterial* *2364035723; // 0x660(0x08)
	struct UMaterial* DebugMeshMaterial; // 0x668(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0x670(0x10)
	struct FColor *52674cf283; // 0x680(0x04)
	char pad_684[0x4]; // 0x684(0x04)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x688(0x10)
	struct FColor *244e026abb; // 0x698(0x04)
	char pad_69C[0x4]; // 0x69c(0x04)
	struct UTexture2D* DefaultTexture; // 0x6a0(0x08)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0x6a8(0x10)
	struct UMaterial* *3af804f5e4; // 0x6b8(0x08)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0x6c0(0x10)
	float NetClientTicksPerSecond; // 0x6d0(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x6d4(0x10)
	struct FLinearColor *3102132612; // 0x6e4(0x10)
	struct FLinearColor *bde2361a9e; // 0x6f4(0x10)
	struct FLinearColor *51c458ade6; // 0x704(0x10)
	struct FLinearColor *5ec7359838; // 0x714(0x10)
	bool *c803f0265e; // 0x724(0x01)
	char pad_725[0x3]; // 0x725(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x728(0x01)
	char *752ed78a39 : 1; // 0x728(0x01)
	char bSuppressMapWarnings : 1; // 0x728(0x01)
	char bDisableAILogging : 1; // 0x728(0x01)
	char pad_728_4 : 4; // 0x728(0x01)
	char pad_729[0x3]; // 0x729(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x72c(0x04)
	struct FBox *bd784f0e4c; // 0x730(0x1c)
	char pad_74C[0x4]; // 0x74c(0x04)
	int32 *b6f2f8e636; // 0x750(0x04)
	char *bdad3e99f4 : 1; // 0x754(0x01)
	char pad_754_1 : 7; // 0x754(0x01)
	char pad_755[0x3]; // 0x755(0x03)
	struct FString ParticleEventManagerClassPath; // 0x758(0x10)
	char pad_768[0x28]; // 0x768(0x28)
	float SelectionHighlightIntensity; // 0x790(0x04)
	float *c80ce80761; // 0x794(0x04)
	float BSPSelectionHighlightIntensity; // 0x798(0x04)
	float HoverHighlightIntensity; // 0x79c(0x04)
	float *dd881ac63c; // 0x7a0(0x04)
	float PrimitiveBaseIntensity; // 0x7a4(0x04)
	float PrimitiveSelectedIntensity; // 0x7a8(0x04)
	float PrimitiveHoverIntensity; // 0x7ac(0x04)
	char pad_7B0[0x290]; // 0x7b0(0x290)
	float PrimitiveProbablyVisibleTime; // 0xa40(0x04)
	char pad_A44[0x4]; // 0xa44(0x04)
	struct UGameUserSettings* GameUserSettings; // 0xa48(0x08)
	struct UClass* *ad8296b465; // 0xa50(0x08)
	struct FColor *707f925d4e; // 0xa58(0x04)
	struct FColor *e415b10ea1; // 0xa5c(0x04)
	float IdealLightMapDensity; // 0xa60(0x04)
	char pad_A64[0x4]; // 0xa64(0x04)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0xa68(0x10)
	struct FString WireframeMaterialName; // 0xa78(0x10)
	struct UMaterialInstanceDynamic* *c12f2d2c67; // 0xa88(0x08)
	struct FStringClassReference WorldSettingsClassName; // 0xa90(0x10)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0xaa0(0x10)
	float RenderLightMapDensityGrayscaleScale; // 0xab0(0x04)
	char pad_AB4[0x1dc]; // 0xab4(0x1dc)
	struct TArray<struct F*71c8b5597f> NetDriverDefinitions; // 0xc90(0x10)
	struct TArray<struct FString> ServerActors; // 0xca0(0x10)
	struct TArray<struct FString> *2ce8af1bee; // 0xcb0(0x10)
	char *e86f62ac90 : 1; // 0xcc0(0x01)
	char pad_CC0_1 : 7; // 0xcc0(0x01)
	char pad_CC1[0x7]; // 0xcc1(0x07)
	struct UMaterialInstanceDynamic* *2fc3307afc; // 0xcc8(0x08)
	struct FStringAssetReference DefaultTextureName; // 0xcd0(0x10)
	struct FColor *8630e54ec6; // 0xce0(0x04)
	char pad_CE4[0x4]; // 0xce4(0x04)
	struct FStringClassReference LocalPlayerClassName; // 0xce8(0x10)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0xcf8(0x10)
	struct FColor *e67cf9003a; // 0xd08(0x04)
	char pad_D0C[0x4]; // 0xd0c(0x04)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0xd10(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0xd20(0x08)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0xd28(0x10)
	struct FColor *aea916ce36; // 0xd38(0x04)
	char pad_D3C[0x4]; // 0xd3c(0x04)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0xd40(0x10)
	struct UGameViewportClient* GameViewport; // 0xd50(0x08)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0xd58(0x10)
	struct UTexture2D* *4da9fb7bb4; // 0xd68(0x08)
	struct UTexture* DefaultDiffuseTexture; // 0xd70(0x08)
	float CameraTranslationThreshold; // 0xd78(0x04)
	char pad_D7C[0x4]; // 0xd7c(0x04)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0xd80(0x10)
	struct UMaterial* LevelColorationLitMaterial; // 0xd90(0x08)
	char pad_D98[0x20]; // 0xd98(0x20)
	int32 *d6c76d00bb; // 0xdb8(0x04)
	char pad_DBC[0x1a4]; // 0xdbc(0x1a4)
};

// Class Engine.*9f9daacaf2
// Size: 0x40 (Inherited: 0x30)
struct U*9f9daacaf2 : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x6a0 (Inherited: 0x40)
struct UGameViewportClient : U*9f9daacaf2 {
	char pad_40[0x8]; // 0x40(0x08)
	struct UConsole* *d90abf5355; // 0x48(0x08)
	char pad_50[0x2d0]; // 0x50(0x2d0)
	struct UGameInstance* GameInstance; // 0x320(0x08)
	char pad_328[0x1e8]; // 0x328(0x1e8)
	struct TArray<struct F*c7179e5679> *fc61f1b873; // 0x510(0x10)
	char pad_520[0x180]; // 0x520(0x180)

	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0xf1a3fc
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x6bceb30
	void SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x6c0ee8c
};

// Class Engine.Console
// Size: 0x110 (Inherited: 0x30)
struct UConsole : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct ULocalPlayer* *5524a3c76c; // 0x40(0x08)
	struct UTexture2D* *f4becc10a3; // 0x48(0x08)
	struct UTexture2D* *75070b6094; // 0x50(0x08)
	char pad_58[0x18]; // 0x58(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x70(0x10)
	char pad_80[0x90]; // 0x80(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c8 (Inherited: 0x30)
struct UNetDriver : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct FString NetConnectionClassName; // 0x38(0x10)
	int32 MaxDownloadSize; // 0x48(0x04)
	char bClampListenServerTickRate : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32 NetServerMaxTickRate; // 0x50(0x04)
	int32 MaxInternetClientRate; // 0x54(0x04)
	int32 MaxClientRate; // 0x58(0x04)
	float ServerTravelPause; // 0x5c(0x04)
	float SpawnPrioritySeconds; // 0x60(0x04)
	float RelevantTimeout; // 0x64(0x04)
	float KeepAliveTime; // 0x68(0x04)
	float InitialConnectTimeout; // 0x6c(0x04)
	float ConnectionTimeout; // 0x70(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x74(0x04)
	bool bNoTimeouts; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UNetConnection* *7d547c567d; // 0x80(0x08)
	struct TArray<struct UNetConnection*> *e5213003a6; // 0x88(0x10)
	char pad_98[0x28]; // 0x98(0x28)
	struct UWorld* World; // 0xc0(0x08)
	struct UPackage* *08f3ae6a9a; // 0xc8(0x08)
	char pad_D0[0x20]; // 0xd0(0x20)
	struct UClass* *cac88d6246; // 0xf0(0x08)
	struct UProperty* *ea450d9b76; // 0xf8(0x08)
	struct UProperty* *662b5c1bdb; // 0x100(0x08)
	struct FName NetDriverName; // 0x108(0x08)
	char pad_110[0x8]; // 0x110(0x08)
	float Time; // 0x118(0x04)
	char pad_11C[0x3ac]; // 0x11c(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c8)
struct UDemoNetDriver : UNetDriver {
	char pad_4C8[0xf8]; // 0x4c8(0xf8)
	struct TMap<struct FString, struct F*2c11a2a2dc> *0468103a99; // 0x5c0(0x50)
	char pad_610[0x430]; // 0x610(0x430)
	bool *0efb4f545b; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc30 (Inherited: 0xb50)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*00296bd9df> PerInstanceSMData; // 0xb50(0x10)
	int32 InstancingRandomSeed; // 0xb60(0x04)
	int32 InstanceStartCullDistance; // 0xb64(0x04)
	int32 InstanceEndCullDistance; // 0xb68(0x04)
	char pad_B6C[0x4]; // 0xb6c(0x04)
	struct TArray<int32> *8ac0f5c877; // 0xb70(0x10)
	struct TArray<int32> *779539efbd; // 0xb80(0x10)
	char pad_B90[0x78]; // 0xb90(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xc08(0x08)
	bool *b3b71326a9; // 0xc10(0x01)
	char pad_C11[0x3]; // 0xc11(0x03)
	int32 *9ff5d4ad59; // 0xc14(0x04)
	struct TArray<struct F*cf35bf3a14> *a62ebc8109; // 0xc18(0x10)
	char pad_C28[0x8]; // 0xc28(0x08)

	int32 *af6477ee17(); // Function Engine.InstancedStaticMeshComponent.*af6477ee17 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bcf6f0
	bool *91e4299bf1(); // Function Engine.InstancedStaticMeshComponent.*91e4299bf1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c12df8
	bool *068cda575c(); // Function Engine.InstancedStaticMeshComponent.*068cda575c // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c23ae0
	int32 *6676b9aa35(); // Function Engine.InstancedStaticMeshComponent.*6676b9aa35 // Final|Native|Public|BlueprintCallable // @ game+0x6c0fa3c
	void *e298126c80(struct FVector Center, float Radius, bool bSphereInWorldSpace); // Function Engine.InstancedStaticMeshComponent.*e298126c80 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bec584
	void *be3ae800fc(struct FVector4 InPerInstanceCustomData, int32 ReturnValue); // Function Engine.InstancedStaticMeshComponent.*be3ae800fc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bcfb30
	void *f58b7ec745(); // Function Engine.InstancedStaticMeshComponent.*f58b7ec745 // Native|Public|BlueprintCallable // @ game+0x5e1e618
	void *4b502e7200(); // Function Engine.InstancedStaticMeshComponent.*4b502e7200 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6beb63c
	void *cf01ee4c9a(bool ReturnValue); // Function Engine.InstancedStaticMeshComponent.*cf01ee4c9a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6beb818
	void *765b562637(int32 InstanceIndex, struct FTransform OutInstanceTransform); // Function Engine.InstancedStaticMeshComponent.*765b562637 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bebc98
	void *a978c20ae5(bool bBoxInWorldSpace, struct TArray<int32> ReturnValue); // Function Engine.InstancedStaticMeshComponent.*a978c20ae5 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bec41c
	void *e1ee01c104(); // Function Engine.InstancedStaticMeshComponent.*e1ee01c104 // Native|Public|BlueprintCallable // @ game+0x6c0915c
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xd60 (Inherited: 0xc30)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C30[0x68]; // 0xc30(0x68)
	struct TArray<int32> *5476f2f76f; // 0xc98(0x10)
	int32 *e097f8dc22; // 0xca8(0x04)
	char pad_CAC[0x4]; // 0xcac(0x04)
	struct FBox *73116382bf; // 0xcb0(0x1c)
	struct FBox *0a7014d240; // 0xccc(0x1c)
	struct TArray<struct FBox> *36aef9bc89; // 0xce8(0x10)
	char pad_CF8[0x20]; // 0xcf8(0x20)
	int32 *03b06dfb87; // 0xd18(0x04)
	struct FBoxSphereBounds *df22e79645; // 0xd1c(0x1c)
	char *515f2592b9 : 1; // 0xd38(0x01)
	char *d571b06104 : 1; // 0xd38(0x01)
	char pad_D38_2 : 6; // 0xd38(0x01)
	char pad_D39[0x27]; // 0xd39(0x27)

	void *0c79aede64(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*0c79aede64 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c09200
};

// Class Engine.GameEngine
// Size: 0xfc0 (Inherited: 0xf60)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf60(0x04)
	float ServerFlushLogInterval; // 0xf64(0x04)
	struct UGameInstance* GameInstance; // 0xf68(0x08)
	char pad_F70[0x40]; // 0xf70(0x40)
	struct TArray<struct UWorld*> *7be9bd717a; // 0xfb0(0x10)
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
struct UPlayer : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	int32 *c8c4b728e8; // 0x40(0x04)
	int32 ConfiguredInternetSpeed; // 0x44(0x04)
	int32 ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.NetConnection
// Size: 0x65850 (Inherited: 0x50)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UClass* *7cc253e76a; // 0x68(0x08)
	struct UPackageMap* PackageMap; // 0x70(0x08)
	struct TArray<struct UChannel*> *e44c91181f; // 0x78(0x10)
	struct TArray<struct AActor*> *274863db2e; // 0x88(0x10)
	struct AActor* ViewTarget; // 0x98(0x08)
	struct AActor* *5e3a3b3f66; // 0xa0(0x08)
	int32 *260ba92558; // 0xa8(0x04)
	char *f5fadd2d69 : 1; // 0xac(0x01)
	char pad_AC_1 : 1; // 0xac(0x01)
	char *1194f7a57c : 1; // 0xac(0x01)
	char pad_AC_3 : 5; // 0xac(0x01)
	char pad_AD[0x8b]; // 0xad(0x8b)
	struct TArray<struct UChannel*> *8a96153c21; // 0x138(0x10)
	char pad_148[0x28]; // 0x148(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x170(0x18)
	char pad_188[0x68]; // 0x188(0x68)
	double *a564cf33c7; // 0x1f0(0x08)
	char pad_1F8[0x65538]; // 0x1f8(0x65538)
	struct TArray<struct UChannel*> *c638db3738; // 0x65730(0x10)
	char pad_65740[0x110]; // 0x65740(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x48 (Inherited: 0x30)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*ef998f31f9> ChannelDetails; // 0x30(0x10)
	float Duration; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.GameSession
// Size: 0x410 (Inherited: 0x3f8)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x3f8(0x04)
	int32 MaxPlayers; // 0x3fc(0x04)
	int32 *b4f47afb15; // 0x400(0x04)
	bool MaxSplitscreensPerConnection; // 0x404(0x01)
	bool bRequiresPushToTalk; // 0x405(0x01)
	char pad_406[0x2]; // 0x406(0x02)
	struct FName SessionName; // 0x408(0x08)
};

// Class Engine.*6915f10115
// Size: 0xd60 (Inherited: 0xd60)
struct U*6915f10115 : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xd58(0x04)
};

// Class Engine.NavLinkProxy
// Size: 0x448 (Inherited: 0x3f8)
struct ANavLinkProxy : AActor {
	char pad_3F8[0x10]; // 0x3f8(0x10)
	struct TArray<struct FNavigationLink> PointLinks; // 0x408(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks; // 0x418(0x10)
	struct UNavLinkCustomComponent* SmartLinkComp; // 0x428(0x08)
	bool *4a699c1124; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct FMulticastDelegate OnSmartLinkReached; // 0x438(0x10)

	void ReceiveSmartLinkReached(struct AActor* Agent, struct FVector Destination); // Function Engine.NavLinkProxy.ReceiveSmartLinkReached // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x370fbc
	void *8e0ffa0cec(); // Function Engine.NavLinkProxy.*8e0ffa0cec // Final|Native|Public|BlueprintCallable // @ game+0x6bc821c
	void *65cee31bae(); // Function Engine.NavLinkProxy.*65cee31bae // Final|Native|Public|BlueprintCallable // @ game+0x6bbfaa8
	void *d4d460f675(bool ReturnValue); // Function Engine.NavLinkProxy.*d4d460f675 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8210
	void *8a49c9c7d5(bool ReturnValue); // Function Engine.NavLinkProxy.*8a49c9c7d5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb7294
	void *213ddab35f(); // Function Engine.NavLinkProxy.*213ddab35f // Final|Native|Public // @ game+0xd5fc94
};

// Class Engine.LocalPlayer
// Size: 0x290 (Inherited: 0x50)
struct ULocalPlayer : UPlayer {
	char pad_50[0x10]; // 0x50(0x10)
	struct UClass* *cf7a7c7fa4; // 0x60(0x08)
	char pad_68[0xa8]; // 0x68(0xa8)
	char *4f02c33d6e : 1; // 0x110(0x01)
	char pad_110_1 : 7; // 0x110(0x01)
	char pad_111[0x17f]; // 0x111(0x17f)
};

// Class Engine.NavModifierVolume
// Size: 0x440 (Inherited: 0x430)
struct ANavModifierVolume : AVolume {
	char pad_430[0x8]; // 0x430(0x08)
	struct UClass* AreaClass; // 0x438(0x08)

	void *b0af645c38(); // Function Engine.NavModifierVolume.*b0af645c38 // Final|Native|Public|BlueprintCallable // @ game+0x6bc3124
};

// Class Engine.*995c5bd3c5
// Size: 0x30 (Inherited: 0x30)
struct U*995c5bd3c5 : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1d10 (Inherited: 0x3f8)
struct APlayerCameraManager : AActor {
	struct APlayerController* *cbb1abb503; // 0x3f8(0x08)
	struct USceneComponent* TransformComponent; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)
	struct F*67dd5045be *973c315985; // 0x410(0x5e0)
	float FreeCamDistance; // 0x9f0(0x04)
	struct FVector ViewTargetOffset; // 0x9f4(0x0c)
	char pad_A00[0x4]; // 0xa00(0x04)
	float DefaultOrthoWidth; // 0xa04(0x04)
	char pad_A08[0x20]; // 0xa08(0x20)
	struct TArray<struct UClass*> DefaultModifiers; // 0xa28(0x10)
	float DefaultAspectRatio; // 0xa38(0x04)
	char pad_A3C[0x8]; // 0xa3c(0x08)
	float ViewPitchMax; // 0xa44(0x04)
	char pad_A48[0x38]; // 0xa48(0x38)
	struct F*67dd5045be ViewTarget; // 0xa80(0x5e0)
	struct F*506119bf4d *afbcd45916; // 0x1060(0x5d0)
	struct TArray<struct U*5ff6efacd0*> *61fd6ce2ce; // 0x1630(0x10)
	float ViewYawMax; // 0x1640(0x04)
	char pad_1644[0xc]; // 0x1644(0x0c)
	float ViewYawMin; // 0x1650(0x04)
	float ViewPitchMin; // 0x1654(0x04)
	float DefaultFOV; // 0x1658(0x04)
	float ViewRollMin; // 0x165c(0x04)
	struct TArray<struct AEmitterCameraLensEffectBase*> *400b25e039; // 0x1660(0x10)
	struct U*f2efdc3e42* *cd0bb6c040; // 0x1670(0x08)
	struct U*d3f66f5eff* *366f414e61[0x08]; // 0x1678(0x40)
	struct TArray<struct FPostProcessSettings> *5ecc4759ed; // 0x16b8(0x10)
	char pad_16C8[0x10]; // 0x16c8(0x10)
	struct TArray<struct U*d3f66f5eff*> *550f662a17; // 0x16d8(0x10)
	struct TArray<struct U*d3f66f5eff*> *2bbafcfe72; // 0x16e8(0x10)
	struct ACameraActor* *7a77fb1011; // 0x16f8(0x08)
	char bIsOrthographic : 1; // 0x1700(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x1700(0x01)
	char pad_1700_2 : 5; // 0x1700(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1700(0x01)
	char pad_1701[0x7]; // 0x1701(0x07)
	struct FVector FreeCamOffset; // 0x1708(0x0c)
	char pad_1714[0xc]; // 0x1714(0x0c)
	struct F*506119bf4d *086e7720b6; // 0x1720(0x5d0)
	char pad_1CF0[0x4]; // 0x1cf0(0x04)
	float ViewRollMax; // 0x1cf4(0x04)
	char pad_1CF8[0x18]; // 0x1cf8(0x18)

	struct UCameraShake* *d72ed20b0c(); // Function Engine.PlayerCameraManager.*d72ed20b0c // Native|Public|HasDefaults|BlueprintCallable // @ game+0xe01ba0
	struct FRotator *d36a44000d(); // Function Engine.PlayerCameraManager.*d36a44000d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb1f54
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5da6fac
	bool *78e591ace3(); // Function Engine.PlayerCameraManager.*78e591ace3 // Native|Public|BlueprintCallable // @ game+0x6bc9bf8
	struct U*5ff6efacd0* *2a26303c57(); // Function Engine.PlayerCameraManager.*2a26303c57 // Native|Public|BlueprintCallable // @ game+0x6bb0350
	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5e794d4
	bool *b292c5da71(); // Function Engine.PlayerCameraManager.*b292c5da71 // Native|Public|BlueprintCallable // @ game+0x6bca080
	bool *69965e09a8(); // Function Engine.PlayerCameraManager.*69965e09a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc6a08
	bool *2988a7cb08(); // Function Engine.PlayerCameraManager.*2988a7cb08 // Native|Public|BlueprintCallable // @ game+0x6bbf318
	struct AEmitterCameraLensEffectBase* *665cee3c9b(); // Function Engine.PlayerCameraManager.*665cee3c9b // Native|Public|BlueprintCallable // @ game+0x6ba8380
	struct FVector PhotographyCameraModify(); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x6bbe3b0
	struct UClass* *8c09008e7d(struct U*5ff6efacd0* ReturnValue); // Function Engine.PlayerCameraManager.*8c09008e7d // Native|Public|BlueprintCallable // @ game+0x6ba979c
	void *bb6cf3b047(struct U*d3f66f5eff* AnimInst, bool bImmediate); // Function Engine.PlayerCameraManager.*bb6cf3b047 // Native|Public|BlueprintCallable // @ game+0x6bc9f84
	void *f2772d70c2(); // Function Engine.PlayerCameraManager.*f2772d70c2 // Native|Public|BlueprintCallable // @ game+0x6bc9d28
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5e794bc
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5e3efb4
	void *8b2eaca224(bool bImmediately); // Function Engine.PlayerCameraManager.*8b2eaca224 // Native|Public|BlueprintCallable // @ game+0x6bc9c90
	void *7fd72b3b48(); // Function Engine.PlayerCameraManager.*7fd72b3b48 // Native|Public|BlueprintCallable // @ game+0x6bc9e0c
	void *a2a77b6a01(float ToAlpha, float Duration, struct FLinearColor Color, bool bShouldFadeAudio); // Function Engine.PlayerCameraManager.*a2a77b6a01 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc98f4
	void *2fbc2ae8e6(); // Function Engine.PlayerCameraManager.*2fbc2ae8e6 // Native|Public|BlueprintCallable // @ game+0x6bbf284
	struct U*d3f66f5eff* *71d0b4dd39(struct UCameraAnim* Anim, float Rate, float Scale, float BlendInTime); // Function Engine.PlayerCameraManager.*71d0b4dd39 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbe744
	void *9335482b6a(); // Function Engine.PlayerCameraManager.*9335482b6a // Native|Public|BlueprintCallable // @ game+0x6baae68
	struct APlayerController* *f76c6f11ba(); // Function Engine.PlayerCameraManager.*f76c6f11ba // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e3c050
	struct FVector *d3c1b5233d(); // Function Engine.PlayerCameraManager.*d3c1b5233d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xbd7b6c
