// BlueprintGeneratedClass LaserPointerAttachment.LaserPointerAttachment_C
// Size: 0xc50 (Inherited: 0xc50)
struct ULaserPointerAttachment_C : U*61f3f05ba5 {
	struct UParticleSystem* *438579a278; // 0xbe0(0x08)
	struct FName *82d5cb2279; // 0xbe8(0x08)
	float *58e9f6b53f; // 0xbf0(0x04)
	struct U*e6746d9844* *349516df36; // 0xbf8(0x08)
	float *42fb782076; // 0xc00(0x04)
	struct FLinearColor *acedf12f49; // 0xc04(0x10)
	float *5ff2578b3a; // 0xc14(0x04)
	float *4a562e28f3; // 0xc18(0x04)
	struct UParticleSystemComponent* *5d5e94fd71; // 0xc20(0x08)
	struct USpotLightComponent* *7e7a676af8; // 0xc28(0x08)
	struct ATslCharacter* Character; // 0xc30(0x08)
	struct ATslWeapon_Gun* Gun; // 0xc38(0x08)

	void ActivateLaser(); // Function TslGame.*61f3f05ba5.ActivateLaser // Final|Native|Private // @ game+0x691b40
	void *b0c1a7304a(); // Function TslGame.*61f3f05ba5.*b0c1a7304a // Final|Native|Private // @ game+0x5df1aec
	void *72c1880dcd(); // Function TslGame.*61f3f05ba5.*72c1880dcd // Final|Native|Private|BlueprintCallable // @ game+0x5e06aa8
};

