// BlueprintGeneratedClass P_Vehicle_Explosion_BP.P_Vehicle_Explosion_BP_C
// Size: 0x538 (Inherited: 0x500)
struct AP_Vehicle_Explosion_BP_C : ATslParticle {
	bool bEnableSurfaceSwitch; // 0x500(0x01)
	char pad_501[0x7]; // 0x501(0x07)
	struct UParticleSystem* PS_Water; // 0x508(0x08)
	struct UParticleSystem* PS_Dirt; // 0x510(0x08)
	struct UParticleSystem* PS_Default; // 0x518(0x08)
	struct UParticleSystem* PS_Sand; // 0x520(0x08)
	struct UParticleSystem* PS_Mud; // 0x528(0x08)
	struct UParticleSystem* PS_Snow; // 0x530(0x08)
};

