// BlueprintGeneratedClass TslWorldMarkerManager_BP.TslWorldMarkerManager_BP_C
// Size: 0x4f8 (Inherited: 0x4f8)
struct ATslWorldMarkerManager_BP_C : ATslWorldMarkerManager {
	int32 ReservedQueueSize; // 0x460(0x04)
	struct UClass* WidgetClass; // 0x468(0x08)
	struct UClass* WidgetComponent; // 0x470(0x08)
	struct UCurveFloat* WidgetScalingCurve; // 0x478(0x08)
	struct UCurveFloat* WidgetOpacityCurve; // 0x480(0x08)
	struct UAkAudioEvent* *07bb04f6bf; // 0x488(0x08)
	struct UAkComponent* AkComponent; // 0x490(0x08)
	float *c4f410840f; // 0x498(0x04)
	int32 *7338342576; // 0x49c(0x04)

	void *6326da1631(struct FWorldMarker WorldMarker, struct U*c4607b5b7c* ReturnValue); // Function TslGame.TslWorldMarkerManager.*6326da1631 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x5dee8bc
	void *845ed20d8c(); // Function TslGame.TslWorldMarkerManager.*845ed20d8c // Final|Native|Public|HasOutParms // @ game+0x5df3434
	void *0c580ac63a(struct TArray<struct FWorldMarker> Param0); // Function TslGame.TslWorldMarkerManager.*0c580ac63a // Final|Native|Public|HasOutParms // @ game+0x5ddafcc
	void *c22204e1dc(struct FWorldMarker Param0); // Function TslGame.TslWorldMarkerManager.*c22204e1dc // Final|Native|Public|HasOutParms // @ game+0x5e06c84
	void *5983972c40(); // Function TslGame.TslWorldMarkerManager.*5983972c40 // Final|Native|Public|HasOutParms // @ game+0x5df32c8
	void *833739a898(struct FGuid Param0); // Function TslGame.TslWorldMarkerManager.*833739a898 // Final|Native|Public|HasOutParms|HasDefaults // @ game+0x5df3390
};

