// WidgetBlueprintGeneratedClass BP_FlowTextWidget.BP_FlowTextWidget_C
// Size: 0x440 (Inherited: 0x440)
struct UBP_FlowTextWidget_C : U*0399764a34 {
	struct UHorizontalBox* ClippingBox; // 0x310(0x08)
	struct UTextBlock* FlowingText; // 0x318(0x08)
	struct U*6b11b3bf02* TextDisappearAnimation; // 0x320(0x08)
	struct U*6b11b3bf02* TextAppearAnimation; // 0x328(0x08)
	bool bEnableFlow; // 0x330(0x01)
	bool bUseAutoSize; // 0x331(0x01)
	float MaxClippingWidth; // 0x334(0x04)
	struct FVector2D ClippingSize; // 0x338(0x08)
	struct UClass* ModeFuncClass; // 0x340(0x08)
	float FlowSpeed; // 0x348(0x04)
	float WaitTime; // 0x34c(0x04)
	float WaitTime2; // 0x350(0x04)
	int32 PlayCount; // 0x354(0x04)
	float EaseExp; // 0x358(0x04)
	enum class EHorizontalAlignment TextHorizontalAlignment; // 0x35c(0x01)
	enum class EVerticalAlignment TextVerticalAlignment; // 0x35d(0x01)
	bool bPreventCultureAlignment; // 0x35e(0x01)
	bool bPreventCultureFlow; // 0x35f(0x01)
	struct FText *bd6c3f4e65; // 0x360(0x18)
	struct FSlateColor Inner_ColorAndOpacity; // 0x378(0x28)
	struct FSlateFontInfo Inner_Font; // 0x3a0(0x68)
	struct FVector2D Inner_ShadowOffset; // 0x408(0x08)
	struct FLinearColor Inner_ShadowColorAndOpacity; // 0x410(0x10)
	float Inner_MinDesiredWidth; // 0x420(0x04)
	struct U*dccce385e4* *45d151eb07; // 0x428(0x08)
	struct FVector2D *706f443589; // 0x430(0x08)
	bool *4410651c6f; // 0x438(0x01)
	bool *2c2b0401cd; // 0x439(0x01)
};

