// ScriptStruct ChromaSDKPlugin.*fa2ed9bea3
// Size: 0x10 (Inherited: 0x00)
struct F*fa2ed9bea3 {
	struct TArray<struct F*d39aab3db1> Effects; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*d39aab3db1
// Size: 0x38 (Inherited: 0x00)
struct F*d39aab3db1 {
	struct FString Animation; // 0x00(0x10)
	bool State; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 PrimaryColor; // 0x14(0x04)
	int32 SecondaryColor; // 0x18(0x04)
	int32 Speed; // 0x1c(0x04)
	enum class *75ec846e50 Blend; // 0x20(0x01)
	enum class *572f130643 Mode; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct F*8c02e1c0d3 FrameIndex; // 0x28(0x10)
};

// ScriptStruct ChromaSDKPlugin.*8c02e1c0d3
// Size: 0x10 (Inherited: 0x00)
struct F*8c02e1c0d3 {
	struct TArray<int32> *025805ac14; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*8f9c47f309
// Size: 0x48 (Inherited: 0x00)
struct F*8f9c47f309 {
	struct FString Title; // 0x00(0x10)
	struct FString Description; // 0x10(0x10)
	struct FString *d4ca013e81; // 0x20(0x10)
	struct FString *127f818a2a; // 0x30(0x10)
	int32 *d2288a5700; // 0x40(0x04)
	int32 Category; // 0x44(0x04)
};

// ScriptStruct ChromaSDKPlugin.*5f77b2a223
// Size: 0x18 (Inherited: 0x00)
struct F*5f77b2a223 {
	struct TArray<struct F*c4939c1f4c> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*c4939c1f4c
// Size: 0x10 (Inherited: 0x00)
struct F*c4939c1f4c {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*d64963fe90
// Size: 0x18 (Inherited: 0x00)
struct F*d64963fe90 {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*8b82e572d0
// Size: 0x14 (Inherited: 0x00)
struct F*8b82e572d0 {
	int32 Result; // 0x00(0x04)
	struct F*d12c13cd08 EffectId; // 0x04(0x10)
};

// ScriptStruct ChromaSDKPlugin.*d12c13cd08
// Size: 0x10 (Inherited: 0x00)
struct F*d12c13cd08 {
	char pad_0[0x10]; // 0x00(0x10)
};

