// ScriptStruct CoherentUIGTPlugin.*94ff8513c9
// Size: 0x10 (Inherited: 0x00)
struct F*94ff8513c9 {
	struct UAudioComponent* Component; // 0x00(0x08)
	struct U*4a2c8ddd5c* Stream; // 0x08(0x08)
};

// ScriptStruct CoherentUIGTPlugin.*2dc54ac3f2
// Size: 0x18 (Inherited: 0x00)
struct F*2dc54ac3f2 {
	float MinimumLoadingScreenDisplayTime; // 0x00(0x04)
	bool bAutoCompleteWhenLoadingCompletes; // 0x04(0x01)
	bool bWaitForManualStop; // 0x05(0x01)
	char pad_6[0x2]; // 0x06(0x02)
	struct FString URL; // 0x08(0x10)
};

// ScriptStruct CoherentUIGTPlugin.*533b3d89b8
// Size: 0x14 (Inherited: 0x00)
struct F*533b3d89b8 {
	int32 Width; // 0x00(0x04)
	int32 Height; // 0x04(0x04)
	bool IsTransparent; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ClickThroughAlphaThreshold; // 0x0c(0x04)
	float AnimationFrameDefer; // 0x10(0x04)
};

