// BlueprintGeneratedClass DefaultRifleSetting.DefaultRifleSetting_C
// Size: 0x1100 (Inherited: 0x1100)
struct ADefaultRifleSetting_C : ATslWeapon_Trajectory {
	float *0e72b6a21f; // 0xf90(0x04)
	struct UClass* *dd7b750fd1; // 0xfa0(0x08)
	struct UClass* *e6c11241ae; // 0xfa8(0x08)
	struct TMap<float, struct UClass*> *369fb6afe7; // 0xfb8(0x50)
	float TrajectoryGravityZ; // 0x100c(0x04)
	struct FMulticastDelegate OnWeaponRecoil; // 0x1040(0x10)
	struct UParticleSystem* *7407395172; // 0x1058(0x08)
	struct FName *aed64476a7; // 0x1070(0x08)
	struct UWeaponTrajectoryData* WeaponTrajectoryData; // 0x1088(0x08)

	void *8c8b6f5b20(); // Function TslGame.TslWeapon_Trajectory.*8c8b6f5b20 // None // @ game+0x560f90c
	enum class EAnimStance *bf2ccd9e4c(); // Function TslGame.TslWeapon_Trajectory.*bf2ccd9e4c // None // @ game+0x55ef264
	void *0978d812ae(); // Function TslGame.TslWeapon_Trajectory.*0978d812ae // None // @ game+0x563c520
	void *09e1442c0b(); // Function TslGame.TslWeapon_Trajectory.*09e1442c0b // None // @ game+0x563bdf4
	void *560f55aa5d(struct FVector Param1); // Function TslGame.TslWeapon_Trajectory.*560f55aa5d // None // @ game+0x564dc4c
	void *12b23e5416(); // Function TslGame.TslWeapon_Trajectory.*12b23e5416 // None // @ game+0x5646bb0
	struct FAttackId *91ec242b4d(); // Function TslGame.TslWeapon_Trajectory.*91ec242b4d // None // @ game+0x56475b8
	void *1e952318c1(struct FVector Param0); // Function TslGame.TslWeapon_Trajectory.*1e952318c1 // None // @ game+0x563a1e8
	void *f5cd3b2b19(); // Function TslGame.TslWeapon_Trajectory.*f5cd3b2b19 // None // @ game+0x563c4f8
	void *5132896c3f(); // Function TslGame.TslWeapon_Trajectory.*5132896c3f // None // @ game+0x563e78c
	struct FVector *1af39f23f5(); // Function TslGame.TslWeapon_Trajectory.*1af39f23f5 // None // @ game+0x56474b4
	void *30a84816a7(); // Function TslGame.TslWeapon_Trajectory.*30a84816a7 // None // @ game+0x5647ee0
	struct FVector2D *7deb8a48d1(); // Function TslGame.TslWeapon_Trajectory.*7deb8a48d1 // None // @ game+0x5646a3c
	void *fc109c2499(); // Function TslGame.TslWeapon_Trajectory.*fc109c2499 // None // @ game+0x563be28
	void *e01a9f55f8(); // Function TslGame.TslWeapon_Trajectory.*e01a9f55f8 // None // @ game+0x563c564
	void *b85e594168(struct FName Param1); // Function TslGame.TslWeapon_Trajectory.*b85e594168 // None // @ game+0x5645034
	void *c07642bb51(); // Function TslGame.TslWeapon_Trajectory.*c07642bb51 // None // @ game+0x90618c
	struct FVector *2f8afb1153(); // Function TslGame.TslWeapon_Trajectory.*2f8afb1153 // None // @ game+0x427154
	void *fd2a789628(); // Function TslGame.TslWeapon_Trajectory.*fd2a789628 // None // @ game+0x563e7a4
	void *a7d435ec1f(struct FVector_NetQuantize Param1); // Function TslGame.TslWeapon_Trajectory.*a7d435ec1f // None // @ game+0x5645334
	void OnRep_WeaponSpread(); // Function TslGame.TslWeapon_Trajectory.OnRep_WeaponSpread // None // @ game+0x5643b10
	void *95fc5b5950(); // Function TslGame.TslWeapon_Trajectory.*95fc5b5950 // None // @ game+0x563e76c
	void *717cc4cb6f(struct FVector Param0); // Function TslGame.TslWeapon_Trajectory.*717cc4cb6f // None // @ game+0x564db10
	void *8a1758c744(); // Function TslGame.TslWeapon_Trajectory.*8a1758c744 // None // @ game+0x56476c4
	struct FVector *151f400028(); // Function TslGame.TslWeapon_Trajectory.*151f400028 // None // @ game+0xad7dd4
	bool *4bec4cb25b(struct TArray<int32> Param0, float Param2, float Param4, uint64 Param13, bool Param15, int32 Param17, struct FVector Param19, struct TArray<int32> Param30, struct FVector Param32, struct FVector_NetQuantizeNormal Param34, struct FVector Param44, float Param46, bool Param48, int32 Param50); // Function TslGame.TslWeapon_Trajectory.*4bec4cb25b // None // @ game+0x56454a8
	struct FVector *0546dda494(); // Function TslGame.TslWeapon_Trajectory.*0546dda494 // None // @ game+0x564da2c
	void *77cb48c181(struct FVector Param1); // Function TslGame.TslWeapon_Trajectory.*77cb48c181 // None // @ game+0x56451dc
	void *5dd4e587f9(); // Function TslGame.TslWeapon_Trajectory.*5dd4e587f9 // None // @ game+0x564470c
	void *86b4cb4a90(); // Function TslGame.TslWeapon_Trajectory.*86b4cb4a90 // None // @ game+0x563c778
	struct F*36c5bcea08 *69f8b37c4f(struct AActor* Param2); // Function TslGame.TslWeapon_Trajectory.*69f8b37c4f // None // @ game+0x563a03c
	void *b15361c852(); // Function TslGame.TslWeapon_Trajectory.*b15361c852 // None // @ game+0x563ff64
};

