// ScriptStruct OceanPlugin.*234d7ae7d5
// Size: 0xa0 (Inherited: 0x00)
struct F*234d7ae7d5 {
	struct F*552d0702b2 Wave01; // 0x00(0x14)
	struct F*552d0702b2 Wave02; // 0x14(0x14)
	struct F*552d0702b2 Wave03; // 0x28(0x14)
	struct F*552d0702b2 Wave04; // 0x3c(0x14)
	struct F*552d0702b2 Wave05; // 0x50(0x14)
	struct F*552d0702b2 Wave06; // 0x64(0x14)
	struct F*552d0702b2 Wave07; // 0x78(0x14)
	struct F*552d0702b2 Wave08; // 0x8c(0x14)
};

// ScriptStruct OceanPlugin.*552d0702b2
// Size: 0x14 (Inherited: 0x00)
struct F*552d0702b2 {
	float Rotation; // 0x00(0x04)
	float Length; // 0x04(0x04)
	float Amplitude; // 0x08(0x04)
	float Steepness; // 0x0c(0x04)
	float TimeScale; // 0x10(0x04)
};

// ScriptStruct OceanPlugin.*579a2cd28a
// Size: 0x6c (Inherited: 0x00)
struct F*579a2cd28a {
	char pad_0[0x6c]; // 0x00(0x6c)
};

// ScriptStruct OceanPlugin.*7badcfa1cd
// Size: 0x10 (Inherited: 0x00)
struct F*7badcfa1cd {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct OceanPlugin.*30f71a2cfb
// Size: 0x10 (Inherited: 0x00)
struct F*30f71a2cfb {
	struct FName BoneName; // 0x00(0x08)
	float Density; // 0x08(0x04)
	float TestRadius; // 0x0c(0x04)
};

// ScriptStruct OceanPlugin.*809d41c387
// Size: 0x1c (Inherited: 0x00)
struct F*809d41c387 {
	int32 Millisecond; // 0x00(0x04)
	int32 second; // 0x04(0x04)
	int32 Minute; // 0x08(0x04)
	int32 Hour; // 0x0c(0x04)
	int32 Day; // 0x10(0x04)
	int32 Month; // 0x14(0x04)
	int32 Year; // 0x18(0x04)
};

