// WidgetBlueprintGeneratedClass RichTextBlockWidget.RichTextBlockWidget_C
// Size: 0x640 (Inherited: 0x640)
struct URichTextBlockWidget_C : UTslRichTextBlock {
	struct FText *01a6ca3f58; // 0x410(0x18)
	struct TMap<struct FString, struct F*c9e2b1ab63> *8e50c50ae0; // 0x428(0x50)
	struct FSlateFontInfo FontInfo; // 0x478(0x68)
	struct FSlateColor *157cdf2db7; // 0x4e0(0x28)
	struct FVector2D *ade98149bb; // 0x508(0x08)
	struct FLinearColor *e478c399e9; // 0x510(0x10)
	float *ea7bf7ca07; // 0x520(0x04)
	bool *2fd67b022c; // 0x524(0x01)
	float *4455cdaf73; // 0x528(0x04)
	enum class *00a79681fd *046e69ae98; // 0x52c(0x01)
	bool *f8a3653053; // 0x52d(0x01)
	enum class EVerticalAlignment *0fc375487e; // 0x52f(0x01)
	struct FSlateChildSize *d982d6a72d; // 0x530(0x08)
	float *88161e7aa0; // 0x538(0x04)
	struct FSlateChildSize *7dba0f7357; // 0x53c(0x08)
	struct FVector2D *789452384a; // 0x544(0x08)
	struct UVerticalBox* MainVerticalBox; // 0x550(0x08)
	struct TArray<struct USpacer*> *80ea26efc5; // 0x558(0x10)
	struct TArray<struct UHorizontalBox*> *3af6a8f73d; // 0x568(0x10)
	struct TArray<struct UTextBlock*> *c46cc41cc4; // 0x578(0x10)
	struct TArray<struct UImage*> *118aacda04; // 0x588(0x10)
	struct TArray<struct USizeBox*> *84d3db8af9; // 0x598(0x10)
	struct TArray<struct UOverlay*> *39ca65b51b; // 0x5a8(0x10)
	struct UHorizontalBox* *6d2a215226; // 0x5b8(0x08)
	struct UClass* KeyIconWidgetClass; // 0x5d0(0x08)
	struct TMap<struct FName, struct F*68031af743> *8413ec12cf; // 0x5f0(0x50)

	void UpdateText(); // Function TslGame.TslRichTextBlock.UpdateText // None // @ game+0x55d183c
};

