// Class Slate.*f4f189a61b
// Size: 0x2d8 (Inherited: 0x30)
struct U*f4f189a61b : USlateWidgetStyleContainerBase {
	struct F*d5cdd95f37 ButtonStyle; // 0x30(0x2a8)
};

// Class Slate.*2eacb0ec55
// Size: 0x610 (Inherited: 0x30)
struct U*2eacb0ec55 : USlateWidgetStyleContainerBase {
	struct F*ea1c6f5c2e *ea1c6f5c2e; // 0x30(0x5e0)
};

// Class Slate.*806eb9bb65
// Size: 0x458 (Inherited: 0x30)
struct U*806eb9bb65 : USlateWidgetStyleContainerBase {
	struct F*8032c74862 *8032c74862; // 0x30(0x428)
};

// Class Slate.*e775e31bcf
// Size: 0x410 (Inherited: 0x30)
struct U*e775e31bcf : USlateWidgetStyleContainerBase {
	struct F*735b523b98 *735b523b98; // 0x30(0x3e0)
};

// Class Slate.*8a189fcc96
// Size: 0x8a0 (Inherited: 0x30)
struct U*8a189fcc96 : USlateWidgetStyleContainerBase {
	struct F*66dc9af89d *66dc9af89d; // 0x30(0x870)
};

// Class Slate.*3c9d9c1110
// Size: 0x278 (Inherited: 0x30)
struct U*3c9d9c1110 : USlateWidgetStyleContainerBase {
	struct F*1655c7f388 *1655c7f388; // 0x30(0x248)
};

// Class Slate.*804794639b
// Size: 0x1e8 (Inherited: 0x30)
struct U*804794639b : USlateWidgetStyleContainerBase {
	struct F*4153f21470 ProgressBarStyle; // 0x30(0x1b8)
};

// Class Slate.*ad0f5e3e39
// Size: 0x548 (Inherited: 0x30)
struct U*ad0f5e3e39 : USlateWidgetStyleContainerBase {
	struct F*136abc3336 *136abc3336; // 0x30(0x518)
};

// Class Slate.*d86c2575d0
// Size: 0x278 (Inherited: 0x30)
struct U*d86c2575d0 : USlateWidgetStyleContainerBase {
	struct F*22ad09d4a5 *22ad09d4a5; // 0x30(0x248)
};

// Class Slate.SlateSettings
// Size: 0x30 (Inherited: 0x28)
struct USlateSettings : UObject {
	bool bVirtualKeyboardSendsTextChanged; // 0x28(0x01)
	bool bVirtualKeyboardDisplayOnFocus; // 0x29(0x01)
	bool bExplicitCanvasChildZOrder; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// Class Slate.*203c966a4d
// Size: 0x340 (Inherited: 0x30)
struct U*203c966a4d : USlateWidgetStyleContainerBase {
	struct F*b5d3bae02e *b5d3bae02e; // 0x30(0x310)
};

// Class Slate.*d72e22fc8f
// Size: 0x238 (Inherited: 0x30)
struct U*d72e22fc8f : USlateWidgetStyleContainerBase {
	struct F*37ba76b02f *37ba76b02f; // 0x30(0x208)
};

