// WidgetBlueprintGeneratedClass StepperWidget.StepperWidget_C
// Size: 0x4f0 (Inherited: 0x4f0)
struct UStepperWidget_C : U*8f5d236427 {
	struct UButton* LeftArrowButton; // 0x480(0x08)
	struct UButton* RightArrowButton; // 0x488(0x08)
	struct UTextBlock* StepperText; // 0x490(0x08)
	struct UHorizontalBox* IndicatorHorizontalBox; // 0x498(0x08)
	float *aaa61ccbf7; // 0x4a0(0x04)
	float *720e25c8b1; // 0x4a4(0x04)
	float *6a55bd830f; // 0x4a8(0x04)
	float *03baefd152; // 0x4ac(0x04)
	struct UClass* *3015158546; // 0x4b0(0x08)

	void OnClickLeft(); // Function TslGame.*8f5d236427.OnClickLeft // None // @ game+0x55f3b88
	void OnClickRight(); // Function TslGame.*8f5d236427.OnClickRight // None // @ game+0x55f3b9c
};

