// BlueprintGeneratedClass TslWorldMarkerManager_BP.TslWorldMarkerManager_BP_C
// Size: 0x4f8 (Inherited: 0x4f8)
struct ATslWorldMarkerManager_BP_C : ATslWorldMarkerManager {
	int32 ReservedQueueSize; // 0x460(0x04)
	struct UClass* WidgetClass; // 0x468(0x08)
	struct UClass* WidgetComponent; // 0x470(0x08)
	struct UCurveFloat* WidgetScalingCurve; // 0x478(0x08)
	struct UCurveFloat* WidgetOpacityCurve; // 0x480(0x08)
	struct UAkAudioEvent* *be94cb853e; // 0x488(0x08)
	struct UAkComponent* AkComponent; // 0x490(0x08)
	float *84c0436201; // 0x498(0x04)
	int32 *756750a02e; // 0x49c(0x04)

	void *8d72205894(); // Function TslGame.TslWorldMarkerManager.*8d72205894 // None // @ game+0x562da34
	void *46e72b734e(); // Function TslGame.TslWorldMarkerManager.*46e72b734e // None // @ game+0x56194d0
	void *6d64c1d5fe(); // Function TslGame.TslWorldMarkerManager.*6d64c1d5fe // None // @ game+0x5619574
	void *5059ff9581(); // Function TslGame.TslWorldMarkerManager.*5059ff9581 // None // @ game+0x5619408
	void *63056c29b2(struct FWorldMarker WorldMarker); // Function TslGame.TslWorldMarkerManager.*63056c29b2 // None // @ game+0x5614814
	void *2a1e83ff0c(); // Function TslGame.TslWorldMarkerManager.*2a1e83ff0c // None // @ game+0x560010c
};

