// BlueprintGeneratedClass BP_FireEffectController_JerryCan.BP_FireEffectController_JerryCan_C
// Size: 0x5f0 (Inherited: 0x5f0)
struct ABP_FireEffectController_JerryCan_C : ATslEffectController {
	struct U*e40c529ffb* SimpleCollision; // 0x408(0x08)
	struct USceneComponent* SceneRoot; // 0x420(0x08)
	struct TArray<struct FVector> *9edf35cfb4; // 0x428(0x10)
	int32 *d36d2b1a12; // 0x438(0x04)
	int32 *5b1e36c05a; // 0x43c(0x04)
	int32 *861c5c8cfa; // 0x440(0x04)
	int32 *caaf6decdc; // 0x444(0x04)
	int32 *f7884204b2; // 0x448(0x04)
	int32 *f71e5c7e2a; // 0x44c(0x04)
	float *ecfd009f48; // 0x450(0x04)
	struct FName *988f1d0e5c; // 0x458(0x08)
	float *68d8fe4cc1; // 0x460(0x04)
	float *1ab65137f0; // 0x464(0x04)
	float *f4a2ae1fa2; // 0x468(0x04)
	float *22266ae7e2; // 0x46c(0x04)
	float *dfc6305091; // 0x470(0x04)
	float SphereRadius; // 0x474(0x04)
	float *64dedbe78d; // 0x478(0x04)
	float *dbded513af; // 0x47c(0x04)
	struct UClass* *1658bcad38; // 0x480(0x08)
	bool *615f4a18bf; // 0x488(0x01)
	float *9a04c1204d; // 0x48c(0x04)
	float *42e6de99f9; // 0x490(0x04)
	float *caea74f5a4; // 0x494(0x04)
	float *fd2b45c6a4; // 0x498(0x04)
	bool *8acf0c7420; // 0x49c(0x01)
	float DamageTickInterval; // 0x4a0(0x04)
	float DamagePerTick; // 0x4a4(0x04)
	struct UClass* *498af98d1d; // 0x4a8(0x08)
	struct TArray<struct USphereComponent*> *6aebdf4e18; // 0x4c8(0x10)
	struct TArray<struct USphereComponent*> *e85cd78805; // 0x4d8(0x10)
	struct TArray<struct USphereComponent*> *7998d72244; // 0x4e8(0x10)
	struct TArray<struct ATslDamageField*> *2b320fe738; // 0x4f8(0x10)
	struct TArray<struct ACharacter*> *a21186d930; // 0x508(0x10)
	struct USphereComponent* *c12931ec66; // 0x5d8(0x08)

	void *ead79dbff5(struct FVector Param0, struct AActor* Param2); // Function TslGame.TslEffectController.*ead79dbff5 // None // @ game+0x569ee44
	void *39b5ad0f76(); // Function TslGame.TslEffectController.*39b5ad0f76 // None // @ game+0x569f848
	void *40851930c5(); // Function TslGame.TslEffectController.*40851930c5 // None // @ game+0x56aeb90
	void OnTakeDamage(struct AActor* Param0, struct U*498af98d1d* Param2); // Function TslGame.TslEffectController.OnTakeDamage // None // @ game+0x56a9ca8
	float *6fe9625775(); // Function TslGame.TslEffectController.*6fe9625775 // None // @ game+0x569eb44
	struct FVector *a0d12ce7ff(struct FColor Param2); // Function TslGame.TslEffectController.*a0d12ce7ff // None // @ game+0x565901c
	void *74fff4d452(float Param1); // Function TslGame.TslEffectController.*74fff4d452 // None // @ game+0x569ecc4
};

