// BlueprintGeneratedClass BP_MasteryBannerController.BP_MasteryBannerController_C
// Size: 0x480 (Inherited: 0x480)
struct ABP_MasteryBannerController_C : AMasteryBannerController {
	struct FName BannerMaterialSlotName; // 0x3f8(0x08)
	struct FName RankParamName; // 0x400(0x08)
	struct FName RankBorderParamName; // 0x408(0x08)
	struct FName PrimaryBannerColorParamName; // 0x410(0x08)
	struct FName SecondaryBannerColorParamName; // 0x418(0x08)
	struct UAnimationAsset* BannerAnimation; // 0x420(0x08)
	struct TMap<int32, struct UTexture*> RankBorderTextures; // 0x428(0x50)
	struct AActor* *f1eb20fd54; // 0x478(0x08)

	bool *4d69f1a667(); // Function TslGame.MasteryBannerController.*4d69f1a667 // None // @ game+0x56715e0
	void *905eb02f88(); // Function TslGame.MasteryBannerController.*905eb02f88 // None // @ game+0x565ad8c
};

