// BlueprintGeneratedClass TslCaptureLobby.TslCaptureLobby_C
// Size: 0x486 (Inherited: 0x400)
struct ATslCaptureLobby_C : ALevelScriptActor {
	struct F*73a77c28fa UberGraphFrame; // 0x400(0x08)
	struct ALobbyViewMode_C* ViewModeStudio; // 0x408(0x08)
	struct ATslWeapon* TslWeapon; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct FTransform UiCameraTM; // 0x420(0x30)
	struct FTransform ViewModeTM; // 0x450(0x30)
	bool bLeft; // 0x480(0x01)
	bool bright; // 0x481(0x01)
	bool bUp; // 0x482(0x01)
	bool bDown; // 0x483(0x01)
	bool AddView; // 0x484(0x01)
	bool MinusView; // 0x485(0x01)

	void InpActEvt_Backslash_*081c3f41d2_26(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Backslash_*081c3f41d2_26 // None // @ game+0x26a108
	void InpActEvt_Left_*081c3f41d2_25(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*081c3f41d2_25 // None // @ game+0x26a108
	void InpActEvt_Left_*081c3f41d2_24(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*081c3f41d2_24 // None // @ game+0x26a108
	void InpActEvt_Right_*081c3f41d2_23(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*081c3f41d2_23 // None // @ game+0x26a108
	void InpActEvt_Right_*081c3f41d2_22(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*081c3f41d2_22 // None // @ game+0x26a108
	void InpActEvt_Up_*081c3f41d2_21(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*081c3f41d2_21 // None // @ game+0x26a108
	void InpActEvt_Up_*081c3f41d2_20(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*081c3f41d2_20 // None // @ game+0x26a108
	void InpActEvt_Down_*081c3f41d2_19(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*081c3f41d2_19 // None // @ game+0x26a108
	void InpActEvt_Down_*081c3f41d2_18(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*081c3f41d2_18 // None // @ game+0x26a108
	void InpActEvt_LeftBracket_*081c3f41d2_17(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*081c3f41d2_17 // None // @ game+0x26a108
	void InpActEvt_LeftBracket_*081c3f41d2_16(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*081c3f41d2_16 // None // @ game+0x26a108
	void InpActEvt_RightBracket_*081c3f41d2_15(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*081c3f41d2_15 // None // @ game+0x26a108
	void InpActEvt_RightBracket_*081c3f41d2_14(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*081c3f41d2_14 // None // @ game+0x26a108
	void ReceiveTick(); // Function TslCaptureLobby.TslCaptureLobby_C.ReceiveTick // None // @ game+0x26a108
	float ExecuteUbergraph_TslCaptureLobby(int32 EntryPoint, struct FKey _081c3f41d2_Key5, struct FKey _081c3f41d2_Key4, struct FKey ___struct_Variable5, struct FKey _081c3f41d2_Key, bool CallFunc_IsValid_ReturnValue3, bool CallFunc__7b2af9cb72_ReturnValue2, struct U*3af93f9c2e* CallFunc_GetWeaponMesh_ReturnValue2, struct FTransform CallFunc__b1a1a6f5cd_ReturnValue, struct FRotator CallFunc_BreakTransform_Rotation2, struct FTransform CallFunc_MakeTransform_ReturnValue, float CallFunc_BreakRotator_Pitch2, struct FHitResult CallFunc_K2_SetRelativeTransform_SweepHitResult, bool CallFunc_IsValid_ReturnValue5, bool CallFunc__7b2af9cb72_ReturnValue4, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue2, float CallFunc__ae60dcbe74_ReturnValue3, bool CallFunc__7b2af9cb72_ReturnValue6, bool CallFunc_BooleanAND_ReturnValue5, float CallFunc__abc2022f64_ReturnValue5); // Function TslCaptureLobby.TslCaptureLobby_C.ExecuteUbergraph_TslCaptureLobby // None // @ game+0x26a108
};

