// WidgetBlueprintGeneratedClass W_RecoilRotation_Row.W_RecoilRotation_Row_C
// Size: 0x29c (Inherited: 0x250)
struct UW_RecoilRotation_Row_C : UUserWidget {
	struct F*73a77c28fa UberGraphFrame; // 0x250(0x08)
	struct UImage* Image_1; // 0x258(0x08)
	struct UTextBlock* TextBlock_ID; // 0x260(0x08)
	struct UTextBlock* TextBlock_RH; // 0x268(0x08)
	struct UTextBlock* TextBlock_RTV; // 0x270(0x08)
	struct UTextBlock* TextBlock_RV; // 0x278(0x08)
	struct UTextBlock* TextBlock_RVal; // 0x280(0x08)
	int32 ID; // 0x288(0x04)
	float CharX; // 0x28c(0x04)
	float CharY; // 0x290(0x04)
	float WeapX; // 0x294(0x04)
	float WeapY; // 0x298(0x04)

	void Construct(); // Function W_RecoilRotation_Row.W_RecoilRotation_Row_C.Construct // None // @ game+0x26a108
	void ExecuteUbergraph_W_RecoilRotation_Row(struct FText CallFunc__ace63d1958_ReturnValue, struct FText CallFunc__ace63d1958_ReturnValue2); // Function W_RecoilRotation_Row.W_RecoilRotation_Row_C.ExecuteUbergraph_W_RecoilRotation_Row // None // @ game+0x26a108
};

