// Class ZipUtility.*b5246c1e6b
// Size: 0x28 (Inherited: 0x28)
struct U*b5246c1e6b : UInterface {
};

// Class ZipUtility.*a40fc12f27
// Size: 0x70 (Inherited: 0x28)
struct U*a40fc12f27 : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	enum class *ab94b09326 CompressionFormat; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FString file; // 0x38(0x10)
	struct FString DestinationFolder; // 0x48(0x10)
	int32 *4f77c535ab; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct UObject* Callback; // 0x60(0x08)
	bool *b1c337d7c7; // 0x68(0x01)
	bool *f388e1df63; // 0x69(0x01)
	bool *24453e1145; // 0x6a(0x01)
	char pad_6B[0x5]; // 0x6b(0x05)
};

// Class ZipUtility.*da1df6b610
// Size: 0x28 (Inherited: 0x28)
struct U*da1df6b610 : UBlueprintFunctionLibrary {
};

// Class ZipUtility.*b300ca37b9
// Size: 0xd0 (Inherited: 0x28)
struct U*b300ca37b9 : UObject {
	char pad_28[0xa8]; // 0x28(0xa8)
};

