// BlueprintGeneratedClass BP_DBX.BP_DBX_C
// Size: 0x1028 (Inherited: 0xfa8)
struct ABP_DBX_C : AVehicleBase_C {
	struct UBoxComponent* PlayerBlockingVolume[0x08]; // 0xfa8(0x08)
	struct USphereComponent* PassengerBRCollision[0x08]; // 0xfb0(0x08)
	struct USphereComponent* PassengerBLCollision[0x08]; // 0xfb8(0x08)
	struct USphereComponent* PassengerFRCollision[0x08]; // 0xfc0(0x08)
	struct USphereComponent* DriverCollision[0x08]; // 0xfc8(0x08)
	struct UStaticMeshComponent* WindscreenFront[0x08]; // 0xfd0(0x08)
	struct U*df6a705964* MaterialClipVolume[0x08]; // 0xfd8(0x08)
	struct UStaticMeshComponent* WeaponCollisionComponent[0x08]; // 0xfe0(0x08)
	struct USphereComponent* Sphere3[0x08]; // 0xfe8(0x08)
	struct U*9644c8969d* PassengerBRSeat[0x08]; // 0xff0(0x08)
	struct USphereComponent* Sphere2[0x08]; // 0xff8(0x08)
	struct U*9644c8969d* PassengerBLSeat[0x08]; // 0x1000(0x08)
	struct USphereComponent* Sphere1[0x08]; // 0x1008(0x08)
	struct U*9644c8969d* PassengerFRSeat[0x08]; // 0x1010(0x08)
	struct USphereComponent* Sphere[0x08]; // 0x1018(0x08)
	struct U*9644c8969d* DriverSeat[0x08]; // 0x1020(0x08)

	void UserConstructionScript(); // Function BP_DBX.BP_DBX_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x2cd4ac
};

