// AnimBlueprintGeneratedClass CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C
// Size: 0x8b4c (Inherited: 0x580)
struct UCharProxy_AnimBP_Lobby_C : U*019f36f5b1 {
	struct F*abc8f374e0 UberGraphFrame[0x08]; // 0x580(0x08)
	struct FAnimNode_SaveCachedPose _fb3ee026f2_CF4C69E94D4584561F0E05BD3E8362E5[0xe0]; // 0x588(0xe0)
	struct FAnimNode_SequencePlayer _97c249d230_88CAAB864B27793D6A4FEA9278275EBA[0x70]; // 0x668(0x70)
	struct FAnimNode_SaveCachedPose _fb3ee026f2_88EF657744D7CD0A7FDC0899BF7388B1[0xe0]; // 0x6d8(0xe0)
	struct FAnimNode_CopyBone _b0b7c19820_64036C624695CCAE871C91A12B7E4BD6[0x130]; // 0x7b8(0x130)
	struct FAnimNode_CopyBone _b0b7c19820_9A2FC77A4F553199FE35D8B9FB312960[0x130]; // 0x8e8(0x130)
	char pad_A18[0x8]; // 0xa18(0x08)
	struct FAnimNode_Fabrik _157752249b_217FCB10470A39214309EBB1129EC727[0x1a0]; // 0xa20(0x1a0)
	struct FAnimNode_CopyBone _b0b7c19820_825C3AE34510DAC702F38299520320E5[0x130]; // 0xbc0(0x130)
	struct FAnimNode_Fabrik _157752249b_50E1CCC144ED9B7CFB3C1890CBA2E662[0x1a0]; // 0xcf0(0x1a0)
	struct FAnimNode_CopyBone _b0b7c19820_94E5E49E48018345AB9C488D9EB44172[0x130]; // 0xe90(0x130)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_1F1853924178BAEA6BEACCB192D84949[0x48]; // 0xfc0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_E5C510214B9D93BD292810BFE2F603D1[0x48]; // 0x1008(0x48)
	struct FAnimNode_LayeredBoneBlend _b1c187ecb1_C2F30D7E4BD89239D23E298DD1729B77[0xf8]; // 0x1050(0xf8)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_8FC1604343ED2A23C11EAEB5261125E0[0x48]; // 0x1148(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_5432A2504DCB7C5C33D17E850B0953B1[0x48]; // 0x1190(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_FE57F22747D2CBE68A6B6C8735A0AA7D[0x128]; // 0x11d8(0x128)
	struct FAnimNode_SaveCachedPose _fb3ee026f2_406BD3B743A02018F5ECE0B6152CF4CC[0xe0]; // 0x1300(0xe0)
	struct FAnimNode_UseCachedPose _27ee13f4bb_21B205254447B5FE68F94B84047A1376[0x50]; // 0x13e0(0x50)
	struct FAnimNode_UseCachedPose _27ee13f4bb_203D8C8B449C7B836D3E24B6FE69D850[0x50]; // 0x1430(0x50)
	struct FAnimNode_BlendListByEnum _3b6c7224e9_044C21FF45F8C9135ED72E90A1317ACF[0xe0]; // 0x1480(0xe0)
	struct FAnimNode_SaveCachedPose _fb3ee026f2_D52F2FC34283A3A47745B6B886AFFBB0[0xe0]; // 0x1560(0xe0)
	struct FAnimNode_UseCachedPose _27ee13f4bb_7E97E81B42424702F70AC7A0BE1DAC7B[0x50]; // 0x1640(0x50)
	struct FAnimNode_UseCachedPose _27ee13f4bb_7A7BFE2C46B8961489CB07A5A54B844B[0x50]; // 0x1690(0x50)
	struct FAnimNode_UseCachedPose _27ee13f4bb_13BC291546E37382B9421CB005024781[0x50]; // 0x16e0(0x50)
	struct FAnimNode_UseCachedPose _27ee13f4bb_4FEB3CBB4993C735E5697B9ABA86D593[0x50]; // 0x1730(0x50)
	struct FAnimNode_UseCachedPose _27ee13f4bb_7EF5FE2D4969E9806EE6038352FFCA29[0x50]; // 0x1780(0x50)
	struct FAnimNode_UseCachedPose _27ee13f4bb_D1F2A2F94C6F6B4125EA27959FC98302[0x50]; // 0x17d0(0x50)
	struct FAnimNode_CopyBone _b0b7c19820_24E7A2C345D59A37751D55ACF23B7355[0x130]; // 0x1820(0x130)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_074320674063AC07AB26F283D6D78E58[0x48]; // 0x1950(0x48)
	struct FAnimNode_BlendListByEnum _3b6c7224e9_341CAEF947395CE8613E1AA1A1B0CEB9[0xe0]; // 0x1998(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_50CC758845EBAE09DFE0FFA151BC45A3[0x128]; // 0x1a78(0x128)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_F55B74BC41101BEBCB2E1FB32E00F62E[0x108]; // 0x1ba0(0x108)
	char pad_1CA8[0x8]; // 0x1ca8(0x08)
	struct FAnimNode_TransitionResult _ac44d6711a_BFBC4F03438CEF46794AF49E56D43629[0x80]; // 0x1cb0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_5C591DE54F0AB6A9C9ADEEB4FDDC4C62[0x80]; // 0x1d30(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_B23A39644DB5ECB2C2CC0A9BBA7BD3B7[0x80]; // 0x1db0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_B4789EB84B94BAF324DEDE8E04D6F50B[0x80]; // 0x1e30(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_1B9B424241FB104B11A537B7349DA4C7[0x80]; // 0x1eb0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_3DA5C7214658D193C32CA1B3EDEC5B06[0x80]; // 0x1f30(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_6C54ABE943792943229ED3BBDF7F1710[0x80]; // 0x1fb0(0x80)
	struct FTslAnimNode_BlendListRandom _71d1d64d88_F9E266B24579866CA50116A9A5AEEC44[0x120]; // 0x2030(0x120)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_531BEF47483A967D265BCEA41B76213F[0x100]; // 0x2150(0x100)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_EFB7997B46EBC25E4A13AF9813CAED41[0x100]; // 0x2250(0x100)
	struct FAnimNode_Root _2104ab13c9_A5965D5342D8C33B8E9E9393808FB6FD4[0x48]; // 0x2350(0x48)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_4DC5C840461193E66E77CAA5D42AA989[0x100]; // 0x2398(0x100)
	struct FTslAnimNode_BlendListRandom _71d1d64d88_BCA660E54BEA71CAFED51B83EAB5A330[0x120]; // 0x2498(0x120)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_B2157E35433CD1DB30B5C2A23D8766D0[0x100]; // 0x25b8(0x100)
	struct FAnimNode_Root _2104ab13c9_A5965D5342D8C33B8E9E9393808FB6FD3[0x48]; // 0x26b8(0x48)
	struct FTslAnimNode_BlendListRandom _71d1d64d88_5FEBC6E944AAE906A6EF128E81217A23[0x120]; // 0x2700(0x120)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_B40256D5470A10C97DE212BD7C2CEE7D[0x100]; // 0x2820(0x100)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_9466048A4DE0D1C40429FD8213399D1E[0x100]; // 0x2920(0x100)
	struct FAnimNode_Root _2104ab13c9_A5965D5342D8C33B8E9E9393808FB6FD2[0x48]; // 0x2a20(0x48)
	struct FTslAnimNode_BlendListRandom _71d1d64d88_B028C4E545C7A16ACA23A68B6D3132EA[0x120]; // 0x2a68(0x120)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_65B850774C53532B188729B969A51945[0x100]; // 0x2b88(0x100)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_D61C21E745C13E71CA53A8B5899F55FF[0x100]; // 0x2c88(0x100)
	struct FAnimNode_Root _2104ab13c9_A5965D5342D8C33B8E9E9393808FB6FD[0x48]; // 0x2d88(0x48)
	struct FAnimNode_StateMachine _0f9259dd31_42B4671A4DA1A6449F28E6BF77BB3235[0xe0]; // 0x2dd0(0xe0)
	struct FAnimNode_BlendListByBool _3e3883fc48_DE260CEA407C68776D9118B2960C17E9[0xd0]; // 0x2eb0(0xd0)
	struct FAnimNode_AnimDynamics _cab0d59e19_FC292CB34C9D970E666EF9B7433D62D3[0x348]; // 0x2f80(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_631C88D546201C974F742CB8806E8F09[0x348]; // 0x32c8(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_E9C191E14BB06C296AAC56B0AB1FA6BF[0x348]; // 0x3610(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_5991C3C04B715B36A0D33080B66FBECE[0x348]; // 0x3958(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_01099A7D4A5ABA33AFBA468333D3C0E6[0x348]; // 0x3ca0(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_5AC0BDB14D2A3D1267886E90B77FE3C8[0x348]; // 0x3fe8(0x348)
	struct FAnimNode_ModifyBone _30231a7c9c_138D096848F6627DCB3C9496E0576FF0[0x140]; // 0x4330(0x140)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_B60838F74D3948F45299BAA39E5A42CA[0x48]; // 0x4470(0x48)
	struct FAnimNode_LayeredBoneBlend _b1c187ecb1_E4F411C2440952ED340FA18691589094[0xf8]; // 0x44b8(0xf8)
	struct FAnimNode_UseCachedPose _27ee13f4bb_6C5CC2124BFDF72A2E770B838AB7F6EE[0x50]; // 0x45b0(0x50)
	struct FAnimNode_ModifyBone _30231a7c9c_BD6709DD4B5C02B97A30ADA130680965[0x140]; // 0x4600(0x140)
	struct FAnimNode_ModifyBone _30231a7c9c_32A421124D76CB4FA4D07B8B33404E2F[0x140]; // 0x4740(0x140)
	struct FAnimNode_UseCachedPose _27ee13f4bb_CBC1D0164B60BC6744CC67A7498B6C73[0x50]; // 0x4880(0x50)
	struct FAnimNode_SaveCachedPose _fb3ee026f2_DEE412844DF63DD57177199BCCB4D6C7[0xe0]; // 0x48d0(0xe0)
	struct FAnimNode_AnimDynamics _cab0d59e19_A84BCBEA47A42CFCC1746B9714A69C80[0x348]; // 0x49b0(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_9CE93AA14E65AE0F24AC659FCD3CDBB6[0x348]; // 0x4cf8(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_784B5B1A4FE48049FF3706AADCE816F3[0x348]; // 0x5040(0x348)
	struct FAnimNode_AnimDynamics _cab0d59e19_241AE0874FD9B2E6CFF20FBFA731C9BB[0x348]; // 0x5388(0x348)
	struct FAnimNode_TransitionResult _ac44d6711a_FA965ABC4906726969ADD0A14685AD69[0x80]; // 0x56d0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_6FAC51FB4A405AA0DC0E8D96ABC32B6A2[0x80]; // 0x5750(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_915F95424427296F0AAADD9FB790FE83[0x80]; // 0x57d0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_B28D304546719889502F7196BE77331D[0x80]; // 0x5850(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_54A1ECA440D695B718577896DAEEBBBA2[0x80]; // 0x58d0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_86E328FB4B206EC863D5D591E9897A00[0x80]; // 0x5950(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_1C59F71F453844EB762D33AA424B55452[0x80]; // 0x59d0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_3EFFBC214A9720912CFDC49CC91959332[0x80]; // 0x5a50(0x80)
	struct FAnimNode_BlendListByBool _3e3883fc48_CEAE086E4AAF55A25A971A8A6E0A51AB[0xd0]; // 0x5ad0(0xd0)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_E7CF370F476AC0343A63FD8AE576BD03[0x100]; // 0x5ba0(0x100)
	struct FTslAnimNode_LobbyAnimSequence _b0677448f7_32512A324DCFB6BB202AB391A5D72368[0x100]; // 0x5ca0(0x100)
	struct FAnimNode_Root _2104ab13c9_FF4764054176C39B518808A6ADE577B52[0x48]; // 0x5da0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_50319A28442CEC6A66F09AAA1CF432E74[0x48]; // 0x5de8(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_4C9B2CCE4DB510CFA8E9CD9B5715C2FE4[0x48]; // 0x5e30(0x48)
	struct FAnimNode_ModifyBone _30231a7c9c_27EF191A40B139062F7EE1B35E0F58534[0x140]; // 0x5e78(0x140)
	struct FAnimNode_SequencePlayer _97c249d230_26AC071F48330830E366B3ABF71512414[0x70]; // 0x5fb8(0x70)
	struct FAnimNode_Slot _e36919abdc_4D78DCDC49DAE824B3D93692F28215C94[0x70]; // 0x6028(0x70)
	struct FAnimNode_Slot _e36919abdc_92BF24D7422E4FF37C7292874E8128C44[0x70]; // 0x6098(0x70)
	struct FAnimNode_Root _2104ab13c9_45540D0F4B3D1253461381A0E82115014[0x48]; // 0x6108(0x48)
	struct FAnimNode_SequencePlayer _97c249d230_B669BF064CA73609C8747CBC24DFFA67[0x70]; // 0x6150(0x70)
	struct FAnimNode_Root _2104ab13c9_FF4764054176C39B518808A6ADE577B5[0x48]; // 0x61c0(0x48)
	struct FAnimNode_UseCachedPose _27ee13f4bb_09EDA3AB4B94830C91DD21B77FC031A22[0x50]; // 0x6208(0x50)
	struct FAnimNode_Root _2104ab13c9_FC5FEA4E4757AF43D7DA82B1DAEEA2102[0x48]; // 0x6258(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_50319A28442CEC6A66F09AAA1CF432E73[0x48]; // 0x62a0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_4C9B2CCE4DB510CFA8E9CD9B5715C2FE3[0x48]; // 0x62e8(0x48)
	struct FAnimNode_ModifyBone _30231a7c9c_27EF191A40B139062F7EE1B35E0F58533[0x140]; // 0x6330(0x140)
	struct FAnimNode_SequencePlayer _97c249d230_26AC071F48330830E366B3ABF71512413[0x70]; // 0x6470(0x70)
	struct FAnimNode_Slot _e36919abdc_4D78DCDC49DAE824B3D93692F28215C93[0x70]; // 0x64e0(0x70)
	struct FAnimNode_Slot _e36919abdc_92BF24D7422E4FF37C7292874E8128C43[0x70]; // 0x6550(0x70)
	struct FAnimNode_Root _2104ab13c9_45540D0F4B3D1253461381A0E82115013[0x48]; // 0x65c0(0x48)
	struct FAnimNode_StateMachine _0f9259dd31_B1B8D05047C0276E40EC4982E8DCD52A[0xe0]; // 0x6608(0xe0)
	struct FAnimNode_SaveCachedPose _fb3ee026f2_1ACF15E14242FCF6F35B54AD108C5E4D[0xe0]; // 0x66e8(0xe0)
	struct FAnimNode_SequencePlayer _97c249d230_8CEB5EA94DE47DD2F9566D9864274BC1[0x70]; // 0x67c8(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_BC8D319540A5FD23C5CA519E8C2FFA0D[0x70]; // 0x6838(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_FF5F1D0D4999D3FC20A9ABBDD916501E[0x70]; // 0x68a8(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_60D457F0437BD0941E743F97374335F4[0x70]; // 0x6918(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_7E444141446032D2C667E3B21195FB53[0x70]; // 0x6988(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_DB5FD9AC41A1DAD6D3BA2581D0A1FA47[0x70]; // 0x69f8(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_CFCF09BC463F7C0AC6A052A0EB3DA6AD[0x70]; // 0x6a68(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_04EA736E43AC456809982C905F923F52[0x70]; // 0x6ad8(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_6735DA1E474C3C86505F22BF5AD37830[0x70]; // 0x6b48(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_276D5CDF43F85F28142267B089375167[0x70]; // 0x6bb8(0x70)
	struct FAnimNode_UseCachedPose _27ee13f4bb_911A5BF94D7FA7D6B7D58297CEF93149[0x50]; // 0x6c28(0x50)
	struct FAnimNode_BlendListByEnum _3b6c7224e9_7DD4DF2E4EE51B857C8F8BBA6ADD08B0[0xe0]; // 0x6c78(0xe0)
	struct FAnimNode_SequencePlayer _97c249d230_1656669B4874480FB29CDFB13B3CD70A[0x70]; // 0x6d58(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_80285FE6415E1F8AA30E20833DB065D9[0x70]; // 0x6dc8(0x70)
	struct FAnimNode_BlendListByEnum _3b6c7224e9_A50437FC42EBAFCE394BF6B0A50A57E2[0xe0]; // 0x6e38(0xe0)
	struct FAnimNode_SequencePlayer _97c249d230_8AE019434ED53F35CBE569BF7BDBC106[0x70]; // 0x6f18(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_8097202E431F22442C132CB2787BD89C[0x70]; // 0x6f88(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_C3833E7F4F5CED3C7DCF5385E0BFE33C[0x70]; // 0x6ff8(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_FB62FE64461BE757B0AE46ADF7A89846[0x70]; // 0x7068(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_B9A3525842BD3F4643465E837BC5CF25[0x70]; // 0x70d8(0x70)
	struct FAnimNode_SequencePlayer _97c249d230_5BADF3934F89E31A13AF35B7DCD53ADB[0x70]; // 0x7148(0x70)
	struct FAnimNode_ModifyBone _30231a7c9c_5E3ABB2C4E9D2985FEC1F488B82FCDAE[0x140]; // 0x71b8(0x140)
	struct FAnimNode_ModifyBone _30231a7c9c_FEA8B3D149C4B3B618DE0383CBA83AA2[0x140]; // 0x72f8(0x140)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_FCA71DF74C9B773E1FD33894805C13E3[0x48]; // 0x7438(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_FCE886B747B29D71AC155396740EE00F[0x48]; // 0x7480(0x48)
	struct FAnimNode_Slot _e36919abdc_C8F683404625884F8E8AE9A27A9734DF[0x70]; // 0x74c8(0x70)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_A82C87964E007C995C759E83380AF31E[0x48]; // 0x7538(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_B59033A5418D48C01076F7A3B5B106D5[0x48]; // 0x7580(0x48)
	struct FAnimNode_ModifyBone _30231a7c9c_1D1CA2534076BB63036E7BAEF0890DA8[0x140]; // 0x75c8(0x140)
	struct FAnimNode_SequencePlayer _97c249d230_6FB1B25F441949792EAF7297B5A9F6F8[0x70]; // 0x7708(0x70)
	struct FAnimNode_Root _2104ab13c9_ECA888DC474579B07A7A538D114E450F[0x48]; // 0x7778(0x48)
	struct FAnimNode_StateMachine _0f9259dd31_D1629A9C4B2B3F0A270D3A8F9B1B49DB[0xe0]; // 0x77c0(0xe0)
	struct FAnimNode_BlendListByBool _3e3883fc48_E5B455314B0E7A963136ADB1325A9C73[0xd0]; // 0x78a0(0xd0)
	struct FAnimNode_BlendListByBool _3e3883fc48_BAF75A8C4BA4186C9A32348BB7C178FB[0xd0]; // 0x7970(0xd0)
	struct FAnimNode_TransitionResult _ac44d6711a_6FAC51FB4A405AA0DC0E8D96ABC32B6A[0x80]; // 0x7a40(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_54A1ECA440D695B718577896DAEEBBBA[0x80]; // 0x7ac0(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_1C59F71F453844EB762D33AA424B5545[0x80]; // 0x7b40(0x80)
	struct FAnimNode_TransitionResult _ac44d6711a_3EFFBC214A9720912CFDC49CC9195933[0x80]; // 0x7bc0(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_50319A28442CEC6A66F09AAA1CF432E72[0x48]; // 0x7c40(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_4C9B2CCE4DB510CFA8E9CD9B5715C2FE2[0x48]; // 0x7c88(0x48)
	struct FAnimNode_ModifyBone _30231a7c9c_27EF191A40B139062F7EE1B35E0F58532[0x140]; // 0x7cd0(0x140)
	struct FAnimNode_SequencePlayer _97c249d230_26AC071F48330830E366B3ABF71512412[0x70]; // 0x7e10(0x70)
	struct FAnimNode_Slot _e36919abdc_4D78DCDC49DAE824B3D93692F28215C92[0x70]; // 0x7e80(0x70)
	struct FAnimNode_Slot _e36919abdc_92BF24D7422E4FF37C7292874E8128C42[0x70]; // 0x7ef0(0x70)
	struct FAnimNode_Root _2104ab13c9_45540D0F4B3D1253461381A0E82115012[0x48]; // 0x7f60(0x48)
	struct FAnimNode_UseCachedPose _27ee13f4bb_09EDA3AB4B94830C91DD21B77FC031A2[0x50]; // 0x7fa8(0x50)
	struct FAnimNode_Root _2104ab13c9_FC5FEA4E4757AF43D7DA82B1DAEEA210[0x48]; // 0x7ff8(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _2825d41637_50319A28442CEC6A66F09AAA1CF432E7[0x48]; // 0x8040(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _92c0b44058_4C9B2CCE4DB510CFA8E9CD9B5715C2FE[0x48]; // 0x8088(0x48)
	struct FAnimNode_ModifyBone _30231a7c9c_27EF191A40B139062F7EE1B35E0F5853[0x140]; // 0x80d0(0x140)
	struct FAnimNode_SequencePlayer _97c249d230_26AC071F48330830E366B3ABF7151241[0x70]; // 0x8210(0x70)
	struct FAnimNode_Slot _e36919abdc_4D78DCDC49DAE824B3D93692F28215C9[0x70]; // 0x8280(0x70)
	struct FAnimNode_Slot _e36919abdc_92BF24D7422E4FF37C7292874E8128C4[0x70]; // 0x82f0(0x70)
	struct FAnimNode_Root _2104ab13c9_45540D0F4B3D1253461381A0E8211501[0x48]; // 0x8360(0x48)
	struct FAnimNode_StateMachine _0f9259dd31_9238ABF042E23C01C64A8D880F3647F7[0xe0]; // 0x83a8(0xe0)
	struct FAnimNode_BlendListByBool _3e3883fc48_C22BA17245EC1D050A9F718CD37E7CF8[0xd0]; // 0x8488(0xd0)
	struct FAnimNode_SaveCachedPose _fb3ee026f2_1E1549A447D1ECEC05AB4589265BC7C4[0xe0]; // 0x8558(0xe0)
	struct FAnimNode_UseCachedPose _27ee13f4bb_EC6B2F94473BC89ACF93B78762136834[0x50]; // 0x8638(0x50)
	struct FAnimNode_UseCachedPose _27ee13f4bb_078A9AE648E163E90FF886A02FB9D860[0x50]; // 0x8688(0x50)
	struct FAnimNode_AnimDynamics _cab0d59e19_5B80091E43E07138708FE7A8A0BFEFB0[0x348]; // 0x86d8(0x348)
	struct FAnimNode_Root _84956cc575_8D65CA8E4C2DF91736AC45B7731017E9[0x48]; // 0x8a20(0x48)
	enum class EAnimWeaponType AnimWeaponType; // 0x8a68(0x01)
	char pad_8A69[0x7]; // 0x8a69(0x07)
	struct UBlendSpaceBase* GripBlendspace[0x08]; // 0x8a70(0x08)
	float BlendTime[0x04]; // 0x8a78(0x04)
	struct FVector PistolOffset[0x0c]; // 0x8a7c(0x0c)
	float GripType[0x04]; // 0x8a88(0x04)
	float BlinkAlpha[0x04]; // 0x8a8c(0x04)
	enum class EWeaponClass WeaponClassEnum; // 0x8a90(0x01)
	char pad_8A91[0x3]; // 0x8a91(0x03)
	float LH_GripIndex[0x04]; // 0x8a94(0x04)
	struct UBlendSpaceBase* LH_GripBS[0x08]; // 0x8a98(0x08)
	bool IsLobbyReady; // 0x8aa0(0x01)
	char pad_8AA1[0x3]; // 0x8aa1(0x03)
	struct FVector Wind[0x0c]; // 0x8aa4(0x0c)
	struct FVector InitialWind[0x0c]; // 0x8ab0(0x0c)
	char pad_8ABC[0x4]; // 0x8abc(0x04)
	struct UCurveFloat* Curve[0x08]; // 0x8ac0(0x08)
	struct FVector AxisFix[0x0c]; // 0x8ac8(0x0c)
	char pad_8AD4[0x4]; // 0x8ad4(0x04)
	struct UCurveFloat* LobbyAdjust[0x08]; // 0x8ad8(0x08)
	struct UAnimSequence* AnimWeapon_Default[0x08]; // 0x8ae0(0x08)
	struct UAnimSequence* AnimWeapon_Pistol[0x08]; // 0x8ae8(0x08)
	struct UAnimSequence* AnimWeapon_SR[0x08]; // 0x8af0(0x08)
	struct UAnimSequence* AnimWeapon_Shotgun[0x08]; // 0x8af8(0x08)
	struct UAnimSequence* AnimWeapon_SMG[0x08]; // 0x8b00(0x08)
	struct UAnimSequence* AnimWeapon_LMG[0x08]; // 0x8b08(0x08)
	struct UAnimSequence* AnimWeapon_Melee[0x08]; // 0x8b10(0x08)
	struct UAnimSequence* AnimWeapon_DMR[0x08]; // 0x8b18(0x08)
	struct UAnimSequence* AnimWeapon_Carbine[0x08]; // 0x8b20(0x08)
	struct UAnimSequence* AnimWeapon_Rifle[0x08]; // 0x8b28(0x08)
	float AdjustedIKLH[0x04]; // 0x8b30(0x04)
	char pad_8B34[0x4]; // 0x8b34(0x04)
	struct UAnimSequence* AnimUnarmed[0x08]; // 0x8b38(0x08)
	float AdjustedIKRH[0x04]; // 0x8b40(0x04)
	float AD_BlendIn[0x04]; // 0x8b44(0x04)
	enum class EThrownWeaponType ThrownClass; // 0x8b48(0x01)
	bool bUseBlink; // 0x8b49(0x01)
	bool IsSetLobbyPose; // 0x8b4a(0x01)
	bool Trigger_ToggleReady; // 0x8b4b(0x01)

	float ProcessLobbyCharacter(int32* CallFunc_FMod_ReturnValue); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.ProcessLobbyCharacter // Public|BlueprintCallable|BlueprintEvent // @ game+0x2cd4ac
	float UpdateBlink(float* CallFunc_FMod_Remainder, float* CallFunc_FClamp_ReturnValue); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.UpdateBlink // Public|BlueprintCallable|BlueprintEvent // @ game+0x2cd4ac
	void GetAnimWeaponType(); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.GetAnimWeaponType // Public|HasOutParms|BlueprintCallable|BlueprintEvent // @ game+0x2cd4ac
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CharProxy_AnimBP_Lobby_*ac44d6711a_54A1ECA440D695B718577896DAEEBBBA_1(); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharProxy_AnimBP_Lobby_*ac44d6711a_54A1ECA440D695B718577896DAEEBBBA_1 // BlueprintEvent // @ game+0x2cd4ac
