// ScriptStruct ClothingSystemRuntimeInterface.*cc87d7d6b4
// Size: 0x30 (Inherited: 0x00)
struct F*cc87d7d6b4 {
	struct TArray<struct F*6b63e040cf> Spheres[0x10]; // 0x00(0x10)
	struct TArray<struct F*1813985ca2> *ef5b250cde[0x10]; // 0x10(0x10)
	struct TArray<struct F*bcd1b697b1> *d50e00ed8e[0x10]; // 0x20(0x10)
};

// ScriptStruct ClothingSystemRuntimeInterface.*bcd1b697b1
// Size: 0x18 (Inherited: 0x00)
struct F*bcd1b697b1 {
	struct TArray<struct FPlane> Planes[0x10]; // 0x00(0x10)
	int32 BoneIndex[0x04]; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct ClothingSystemRuntimeInterface.*1813985ca2
// Size: 0x08 (Inherited: 0x00)
struct F*1813985ca2 {
	int32 *73ecff0e1b[0x04]; // 0x00(0x08)
};

// ScriptStruct ClothingSystemRuntimeInterface.*6b63e040cf
// Size: 0x14 (Inherited: 0x00)
struct F*6b63e040cf {
	int32 BoneIndex[0x04]; // 0x00(0x04)
	float Radius[0x04]; // 0x04(0x04)
	struct FVector LocalPosition[0x0c]; // 0x08(0x0c)
};

