// Class Engine.Actor
// Size: 0x3e8 (Inherited: 0x28)
struct AActor : UObject {
	struct FMulticastDelegate OnActorEndOverlap[0x10]; // 0x28(0x10)
	char pad_38[0xc]; // 0x38(0x0c)
	float NetUpdateFrequency[0x04]; // 0x44(0x04)
	struct FMulticastDelegate OnEndCursorOver[0x10]; // 0x48(0x10)
	char pad_58_0 : 3; // 0x58(0x01)
	char *b8d59458c6 : 1; // 0x58(0x01)
	char pad_58_4 : 4; // 0x58(0x01)
	char pad_59_0 : 1; // 0x59(0x01)
	char *cf80e92dfd : 1; // 0x59(0x01)
	char bReplicates : 1; // 0x59(0x01)
	char pad_59_3 : 5; // 0x59(0x01)
	char pad_5A[0x6]; // 0x5a(0x06)
	struct FName *ab64aa9b2c[0x08]; // 0x60(0x08)
	enum class ENetRole RemoteRole; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct AActor* Owner[0x08]; // 0x70(0x08)
	struct FRepMovement ReplicatedMovement[0x34]; // 0x78(0x34)
	char pad_AC[0x4]; // 0xac(0x04)
	struct F*f897083c18 *732a816970[0x40]; // 0xb0(0x40)
	float *7974797124[0x04]; // 0xf0(0x04)
	float NetCullDistanceSquared[0x04]; // 0xf4(0x04)
	float NetPriority[0x04]; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct TArray<struct FName> Layers[0x10]; // 0x100(0x10)
	enum class ENetRole Role; // 0x110(0x01)
	char pad_111[0x7]; // 0x111(0x07)
	struct FMulticastDelegate OnBeginCursorOver[0x10]; // 0x118(0x10)
	struct UChildActorComponent* *bcea33173e[0x08]; // 0x128(0x08)
	char pad_130[0x50]; // 0x130(0x50)
	char bAutoDestroyWhenFinished : 1; // 0x180(0x01)
	char bCanBeDamaged : 1; // 0x180(0x01)
	char *f9145fc180 : 1; // 0x180(0x01)
	char *f7e3b7cb03 : 1; // 0x180(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x180(0x01)
	char *c5217f0fba : 1; // 0x180(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x180(0x01)
	char *97257759e9 : 1; // 0x180(0x01)
	char *951e142077 : 1; // 0x181(0x01)
	char pad_181_1 : 7; // 0x181(0x01)
	char pad_182[0x6]; // 0x182(0x06)
	struct FMulticastDelegate OnReleased[0x10]; // 0x188(0x10)
	enum class EAutoReceiveInput *1b5d625838; // 0x198(0x01)
	char pad_199[0x7]; // 0x199(0x07)
	struct FMulticastDelegate OnInputTouchBegin[0x10]; // 0x1a0(0x10)
	uint64 *5b976d7486[0x08]; // 0x1b0(0x08)
	struct APawn* Instigator[0x08]; // 0x1b8(0x08)
	int32 *024611cfc7[0x04]; // 0x1c0(0x04)
	char *62cc053e31 : 1; // 0x1c4(0x01)
	char pad_1C4_1 : 4; // 0x1c4(0x01)
	char *97c9e9d9d8 : 1; // 0x1c4(0x01)
	char *899333b5f1 : 1; // 0x1c4(0x01)
	char *251c0d9766 : 1; // 0x1c4(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x1c5(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x1c6(0x01)
	char pad_1C7[0x1]; // 0x1c7(0x01)
	struct FMulticastDelegate OnInputTouchEnter[0x10]; // 0x1c8(0x10)
	struct AActor* ParentComponentActor[0x08]; // 0x1d8(0x08)
	struct FMulticastDelegate OnTakeAnyDamage[0x10]; // 0x1e0(0x10)
	float CustomTimeDilation[0x04]; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct AMatineeActor*> *8a80c37de5[0x10]; // 0x1f8(0x10)
	char pad_208[0x58]; // 0x208(0x58)
	struct TArray<struct UActorComponent*> InstanceComponents[0x10]; // 0x260(0x10)
	struct FGuid DestructibleId[0x10]; // 0x270(0x10)
	bool bIsDestroyedVersion; // 0x280(0x01)
	bool RemoveFromLevelLOD; // 0x281(0x01)
	char pad_282[0x6]; // 0x282(0x06)
	struct F*82957ba793 PrimaryActorTick[0x58]; // 0x288(0x58)
	float MinNetUpdateFrequency[0x04]; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents[0x10]; // 0x2e8(0x10)
	struct TArray<struct FName> Tags[0x10]; // 0x2f8(0x10)
	struct FMulticastDelegate OnInputTouchEnd[0x10]; // 0x308(0x10)
	struct FMulticastDelegate OnTakePointDamage[0x10]; // 0x318(0x10)
	char pad_328[0x8]; // 0x328(0x08)
	struct FMulticastDelegate OnActorHit[0x10]; // 0x330(0x10)
	enum class *95c5f230f9 InputConsumeOption; // 0x340(0x01)
	char pad_341[0x7]; // 0x341(0x07)
	struct U*4aa7f8d102* *4aa7f8d102[0x08]; // 0x348(0x08)
	struct FMulticastDelegate OnClicked[0x10]; // 0x350(0x10)
	int32 *16d0bb46bd[0x04]; // 0x360(0x04)
	char pad_364[0x1]; // 0x364(0x01)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x365(0x01)
	char bHidden : 1; // 0x366(0x01)
	char *dca4a04378 : 1; // 0x366(0x01)
	char *b3a4f52d88 : 1; // 0x366(0x01)
	char bOnlyRelevantToOwner : 1; // 0x366(0x01)
	char bAlwaysRelevant : 1; // 0x366(0x01)
	char *4b5ea83cba : 1; // 0x366(0x01)
	char *105e02f348 : 1; // 0x366(0x01)
	char *6980862dd6 : 1; // 0x366(0x01)
	char *ad303653fe : 1; // 0x367(0x01)
	char pad_367_1 : 1; // 0x367(0x01)
	char *f82bbe5644 : 1; // 0x367(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x367(0x01)
	char *e441233b38 : 1; // 0x367(0x01)
	char pad_367_5 : 1; // 0x367(0x01)
	char *b42f39270d : 1; // 0x367(0x01)
	char pad_367_7 : 1; // 0x367(0x01)
	struct USceneComponent* RootComponent[0x08]; // 0x368(0x08)
	struct FMulticastDelegate OnInputTouchLeave[0x10]; // 0x370(0x10)
	struct FMulticastDelegate OnActorBeginOverlap[0x10]; // 0x380(0x10)
	float InitialLifeSpan[0x04]; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	struct TArray<struct AActor*> Children[0x10]; // 0x398(0x10)
	struct FMulticastDelegate OnDestroyed[0x10]; // 0x3a8(0x10)
	struct FMulticastDelegate OnEndPlay[0x10]; // 0x3b8(0x10)
	char pad_3C8[0x20]; // 0x3c8(0x20)

	void ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct FHitResult K2_AddActorLocalTransform(struct FTransform* NewTransform); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cd514
	void *00b640eb07(); // Function Engine.Actor.*00b640eb07 // Native|Public|BlueprintCallable // @ game+0x65be494
	void K2_SetActorRelativeTransform(struct FTransform* NewRelativeTransform, struct FHitResult* SweepHitResult); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d1050
	void K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct UClass* *dfe7c31236(); // Function Engine.Actor.*dfe7c31236 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7374
	void ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void K2_AttachRootComponentTo(struct USceneComponent** InParent, enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x65cec6c
	void *5ef1f9adbd(); // Function Engine.Actor.*5ef1f9adbd // Native|Public|BlueprintCallable // @ game+0x65d47d8
	void *394d08df53(); // Function Engine.Actor.*394d08df53 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9714
	struct UPrimitiveComponent* ReceiveHit(struct AActor** Other, bool bSelfMoved, struct FVector* HitNormal); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
	bool K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d137c
	void GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbabc
	void K2_AddActorLocalRotation(bool bSweep); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cd33c
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct TArray<struct AActor*> GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca460
	void *3068ec2eb0(); // Function Engine.Actor.*3068ec2eb0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5980
	void *23179b0761(struct UMaterialInterface** Parent); // Function Engine.Actor.*23179b0761 // Final|Native|Public|BlueprintCallable // @ game+0x65d2bf4
	void *bd60b203e7(); // Function Engine.Actor.*bd60b203e7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d7d4c
	void *13d64425d8(); // Function Engine.Actor.*13d64425d8 // Final|Native|Public|BlueprintCallable // @ game+0x65d79b0
	void *9790e1fca0(); // Function Engine.Actor.*9790e1fca0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8820
	void *45fd8a20ef(struct AActor** OtherActor); // Function Engine.Actor.*45fd8a20ef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7b84
	struct AActor* *2d603aa95a(); // Function Engine.Actor.*2d603aa95a // Final|Native|Public|BlueprintCallable // @ game+0x65de7c4
	void *38cb59ce4e(); // Function Engine.Actor.*38cb59ce4e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c60d0
	void *4db2f11121(struct FVector* DestLocation); // Function Engine.Actor.*4db2f11121 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d25bc
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xc7d50c
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x29a800
	void *ce46fbd05d(); // Function Engine.Actor.*ce46fbd05d // Final|Native|Public|BlueprintCallable // @ game+0x65cb844
	struct FRotator K2_SetActorRelativeRotation(bool bSweep); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d0e78
	void *b5dbf0fa4d(); // Function Engine.Actor.*b5dbf0fa4d // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c97dc
	enum class EAttachmentRule *3d6bef52db(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*3d6bef52db // Final|Native|Public|BlueprintCallable // @ game+0x65cf0ec
	bool K2_SetActorLocation(bool bSweep); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d0884
	struct AActor* *1e359ac376(); // Function Engine.Actor.*1e359ac376 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7c24
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x65d7a48
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *6f6c4999f4(); // Function Engine.Actor.*6f6c4999f4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5aac
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *e1b7176d37(); // Function Engine.Actor.*e1b7176d37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5ae0
	void K2_AddActorWorldTransform(struct FTransform* DeltaTransform, struct FHitResult* SweepHitResult); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cdaf0
	void *70d0b60e57(); // Function Engine.Actor.*70d0b60e57 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5820
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *3730f5c729(); // Function Engine.Actor.*3730f5c729 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65d01a8
	void K2_AddActorLocalOffset(struct FVector* DeltaLocation, struct FHitResult* SweepHitResult); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cd164
	void *750dd6d1b4(); // Function Engine.Actor.*750dd6d1b4 // Final|Native|Public|BlueprintCallable // @ game+0x65dd664
	void K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *07af7aee83(); // Function Engine.Actor.*07af7aee83 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8ef0
	void *6dabfe76eb(); // Function Engine.Actor.*6dabfe76eb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc4a8
	void *4e5e8a5c04(); // Function Engine.Actor.*4e5e8a5c04 // Native|Public|BlueprintCallable // @ game+0x65c4da8
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xbfb42c
	void *0f4aed8ef9(); // Function Engine.Actor.*0f4aed8ef9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c594c
	void *0919a2c424(); // Function Engine.Actor.*0919a2c424 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca914
	struct UObject* AddComponent(struct FName* TemplateName); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xb8b6bc
	void *614fe47857(); // Function Engine.Actor.*614fe47857 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc48c
	void *6d7d5caa8e(); // Function Engine.Actor.*6d7d5caa8e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb0b8
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0x86d5dc
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *90b7b2cf4b(); // Function Engine.Actor.*90b7b2cf4b // Native|Public|BlueprintCallable // @ game+0xcc2cdc
	void GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca6c0
	void *a030dac26f(struct AActor** OtherActor); // Function Engine.Actor.*a030dac26f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb578
	enum class *c67378b5c9 *df34dc9ee1(); // Function Engine.Actor.*df34dc9ee1 // Final|Native|Public|BlueprintCallable // @ game+0x65cf894
	void *be02dcd6c1(struct AActor** OtherActor); // Function Engine.Actor.*be02dcd6c1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c88c0
	void *eb97b78500(struct AActor** OtherActor); // Function Engine.Actor.*eb97b78500 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbe54
	struct FVector GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5544
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void K2_SetActorRotation(struct FRotator* NewRotation); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d127c
	void *91c797133f(); // Function Engine.Actor.*91c797133f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c972c
	void DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x65c326c
	void *9bff12536a(struct UClass** ComponentClass, struct FName* Tag); // Function Engine.Actor.*9bff12536a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7464
	void *686ee8fadd(); // Function Engine.Actor.*686ee8fadd // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d7cac
	void *8c98ce177e(); // Function Engine.Actor.*8c98ce177e // Final|Native|Public|BlueprintCallable // @ game+0x65cf744
	struct FHitResult K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d0ca0
	void SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x582f2cc
	void *641423d1a4(); // Function Engine.Actor.*641423d1a4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5b08
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cfcd4
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x65cf72c
	void *a14cb7b3ca(); // Function Engine.Actor.*a14cb7b3ca // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x65c5330
	void SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x65d7dec
	void *5d72d1d4c9(); // Function Engine.Actor.*5d72d1d4c9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca8f0
	void AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x65be36c
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x6e6bbc
	void *9e37cb0e5c(struct TArray<struct AActor*>* ChildActors); // Function Engine.Actor.*9e37cb0e5c // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5ebc
	void *1e3f4f9b76(); // Function Engine.Actor.*1e3f4f9b76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc540
	void *613e01c62a(); // Function Engine.Actor.*613e01c62a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cfc04
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct FRotator K2_SetActorLocationAndRotation(bool bSweep, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d0a68
	void *d4ab759ea6(); // Function Engine.Actor.*d4ab759ea6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca850
	struct FName ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65bc6d4
	void *93d0f10bfb(); // Function Engine.Actor.*93d0f10bfb // Final|Native|Public|BlueprintCallable // @ game+0x65d7e80
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *4d66259ce2(); // Function Engine.Actor.*4d66259ce2 // Native|Public|BlueprintCallable // @ game+0x65df4b4
	void *0014400b33(); // Function Engine.Actor.*0014400b33 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x65dd194
	struct FName ReceivePointDamage(struct FVector* ShotFromDirection, struct AActor** DamageCauser); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
	void *d79c49c550(); // Function Engine.Actor.*d79c49c550 // Native|Public|BlueprintCallable // @ game+0x65dd0fc
	void ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *5ad1d3c9a1(); // Function Engine.Actor.*5ad1d3c9a1 // Native|Public|BlueprintCallable // @ game+0x65d46b0
	void *4fc38b8595(struct FVector* OutLocation); // Function Engine.Actor.*4fc38b8595 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5714
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x65c5344
	struct FHitResult K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cd740
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x65c3300
	void *ef2725e645(); // Function Engine.Actor.*ef2725e645 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c950c
	float *ab8b52a15b(); // Function Engine.Actor.*ab8b52a15b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65dfb94
	void *1092e5e400(); // Function Engine.Actor.*1092e5e400 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6120
	void ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *a4e857ec43(); // Function Engine.Actor.*a4e857ec43 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c60f4
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct AController* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
	void *2fb8c5686e(); // Function Engine.Actor.*2fb8c5686e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c727c
	enum class EAttachmentRule *f414cfd93b(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*f414cfd93b // Final|Native|Public|BlueprintCallable // @ game+0x86c9e4
	void *fd96d57958(struct AActor** Other); // Function Engine.Actor.*fd96d57958 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccc78
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xb83670
	void *49913882bb(); // Function Engine.Actor.*49913882bb // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbe1c
	void *2aaaa32fa0(); // Function Engine.Actor.*2aaaa32fa0 // Final|Native|Public|BlueprintCallable // @ game+0x65dd77c
	void ReceiveAnyDamage(float* Damage, struct AController** InstigatedBy); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct FHitResult K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cd918
	void *94feccb1e2(); // Function Engine.Actor.*94feccb1e2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c56ec
	void *c38f5475d6(); // Function Engine.Actor.*c38f5475d6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65c7dcc
	enum class EAttachLocation K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x65cedec
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xac23a4
	void *48afe05568(struct FKey* InputAxisKey); // Function Engine.Actor.*48afe05568 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8dfc
	void *ab7a656a16(); // Function Engine.Actor.*ab7a656a16 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58cb538
	float MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d2c70
};

// Class Engine.AnimInstance
// Size: 0x398 (Inherited: 0x28)
struct UAnimInstance : UObject {
	float DeltaTime[0x04]; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct USkeleton* *ed667f4877[0x08]; // 0x30(0x08)
	enum class *f710213dc1 *11e7e042ca; // 0x38(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x39(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x3a(0x01)
	bool *6c5cd0fbcc; // 0x3b(0x01)
	bool bWarnAboutBlueprintUsage; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	struct FMulticastDelegate OnMontageBlendingOut[0x10]; // 0x40(0x10)
	struct FMulticastDelegate OnMontageStarted[0x10]; // 0x50(0x10)
	struct FMulticastDelegate OnMontageEnded[0x10]; // 0x60(0x10)
	struct FMulticastDelegate OnMontageInterrupted[0x10]; // 0x70(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded[0x10]; // 0x80(0x10)
	char pad_90[0x60]; // 0x90(0x60)
	bool *26e169fab8; // 0xf0(0x01)
	char pad_F1[0x9f]; // 0xf1(0x9f)
	struct TArray<struct FAnimNotifyEvent> *505b5151ee[0x10]; // 0x190(0x10)
	char pad_1A0[0x1f8]; // 0x1a0(0x1f8)

	void GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x65fc8a8
	struct UAnimMontage* *da8b5dda0c(); // Function Engine.AnimInstance.*da8b5dda0c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66164d0
	void *f7028cf890(int32* MachineIndex); // Function Engine.AnimInstance.*f7028cf890 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66015a0
	void *4e5ea7e426(); // Function Engine.AnimInstance.*4e5ea7e426 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc7a9a0
	struct UAnimMontage* *7ad988b653(); // Function Engine.AnimInstance.*7ad988b653 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66166ac
	struct UAnimMontage* *8222fd1c56(); // Function Engine.AnimInstance.*8222fd1c56 // Final|Native|Public|BlueprintCallable // @ game+0x6616ac8
	void *614f873041(); // Function Engine.AnimInstance.*614f873041 // Final|Native|Public|BlueprintCallable // @ game+0x65f129c
	void *7004794d0c(); // Function Engine.AnimInstance.*7004794d0c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66007a8
	float *460e32196d(); // Function Engine.AnimInstance.*460e32196d // Final|Native|Public|BlueprintCallable // @ game+0x6637458
	struct UAnimMontage* *333bc82610(); // Function Engine.AnimInstance.*333bc82610 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x661660c
	void *31b3be8143(); // Function Engine.AnimInstance.*31b3be8143 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65fe524
	void GetAnimAssetPlayerTimeFraction(float* CurrentTime); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x65fc93c
	struct FName *5c84548a1e(); // Function Engine.AnimInstance.*5c84548a1e // Final|Native|Public|BlueprintCallable // @ game+0x66167ec
	struct FName *7a4d3e2de7(struct FName* MarkerName); // Function Engine.AnimInstance.*7a4d3e2de7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6606a5c
	void *b40d60a3ab(struct FRotator* BaseRotation); // Function Engine.AnimInstance.*b40d60a3ab // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65ee004
	void *9c286a1dd6(); // Function Engine.AnimInstance.*9c286a1dd6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66391a0
	struct UAnimMontage* *8f5e8caa01(); // Function Engine.AnimInstance.*8f5e8caa01 // Final|Native|Public|BlueprintCallable // @ game+0x66169e8
	void *35d3016b0e(struct FName* SyncGroup); // Function Engine.AnimInstance.*35d3016b0e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6609f70
	int32 *a1cdf92d33(); // Function Engine.AnimInstance.*a1cdf92d33 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66005e4
	int32 *7b1d412206(); // Function Engine.AnimInstance.*7b1d412206 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6600068
	void *50d1a575e9(); // Function Engine.AnimInstance.*50d1a575e9 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6632474
	void *9113d38401(struct UAnimMontage** Montage); // Function Engine.AnimInstance.*9113d38401 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6616430
	int32 *c6aa635ece(); // Function Engine.AnimInstance.*c6aa635ece // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6600c90
	struct FName *5ae2ffaa34(); // Function Engine.AnimInstance.*5ae2ffaa34 // Final|Native|Public|BlueprintCallable // @ game+0x662a674
	void *9f4159a1c0(int32* StateIndex); // Function Engine.AnimInstance.*9f4159a1c0 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2f24f8
	void *516889ae6d(int32* MachineIndex); // Function Engine.AnimInstance.*516889ae6d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66045a8
	int32 *b71ba1b5fb(); // Function Engine.AnimInstance.*b71ba1b5fb // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6600244
	void *61c86306be(struct UAnimSequenceBase** Asset); // Function Engine.AnimInstance.*61c86306be // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660c1a0
	void GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65fe484
	int32 *e403a62386(); // Function Engine.AnimInstance.*e403a62386 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x660117c
	void BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *cfc2a4c7e9(); // Function Engine.AnimInstance.*cfc2a4c7e9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65fe09c
	void *60dd5a4893(); // Function Engine.AnimInstance.*60dd5a4893 // Final|Native|Public|BlueprintCallable // @ game+0x662c538
	float GetAnimAssetPlayerTimeFromEnd(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65fca1c
	struct FName *c1dab9bbb4(struct FName* NextSection); // Function Engine.AnimInstance.*c1dab9bbb4 // Native|Public|BlueprintCallable // @ game+0x58ec8dc
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void GetAnimAssetPlayerTimeFromEndFraction(struct UAnimationAsset** AnimAsset); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x65fcb20
	void *d764287b5e(); // Function Engine.AnimInstance.*d764287b5e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660ba5c
	struct UAnimSequenceBase* PlaySlotAnimation(struct FName* SlotNodeName, float* BlendOutTime, int32* LoopCount); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x661a48c
	void *9607422949(); // Function Engine.AnimInstance.*9607422949 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6603458
	int32 *504e9f6ebf(); // Function Engine.AnimInstance.*504e9f6ebf // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x977294
	void GetStateWeight(int32* StateIndex); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6605e84
	void *89bd946387(); // Function Engine.AnimInstance.*89bd946387 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6611fa4
	int32 *cc84762a5a(); // Function Engine.AnimInstance.*cc84762a5a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6600420
	struct UAnimMontage* *dc552bfa63(); // Function Engine.AnimInstance.*dc552bfa63 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x661656c
	void *484b63942a(struct FName* InSyncGroupName, struct FName* NextMarker); // Function Engine.AnimInstance.*484b63942a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660c728
	struct UAnimMontage* *7ddaa5c7cb(); // Function Engine.AnimInstance.*7ddaa5c7cb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x661674c
	float *63c56d3338(); // Function Engine.AnimInstance.*63c56d3338 // Native|Public|BlueprintCallable // @ game+0xbe27a8
	void *3e3e5841ae(int32* MachineIndex); // Function Engine.AnimInstance.*3e3e5841ae // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x976fe0
	bool *5b379fddd3(); // Function Engine.AnimInstance.*5b379fddd3 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6611fa4
	void *18cf7a25ea(); // Function Engine.AnimInstance.*18cf7a25ea // Final|Native|Public|BlueprintCallable // @ game+0x66168c8
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *feeeff43b3(); // Function Engine.AnimInstance.*feeeff43b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcc2d5c
	float Montage_Play(); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x776b48
	void *8e0d490c68(int32* MachineIndex); // Function Engine.AnimInstance.*8e0d490c68 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x660437c
	void *a370694256(int32* MachineIndex); // Function Engine.AnimInstance.*a370694256 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x660099c
	void *44662a9bc1(); // Function Engine.AnimInstance.*44662a9bc1 // Final|Native|Public|BlueprintCallable // @ game+0x6616958
	int32 *c4fc059f80(); // Function Engine.AnimInstance.*c4fc059f80 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6601390
	void *4f5ff7b06c(); // Function Engine.AnimInstance.*4f5ff7b06c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6606394
	void *9f48e4fa70(); // Function Engine.AnimInstance.*9f48e4fa70 // Native|Public|BlueprintCallable // @ game+0x58ec67c
	float PlaySlotAnimationAsDynamicMontage(int32* LoopCount, float* InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x661a6b0
	int32 *97cd00756e(); // Function Engine.AnimInstance.*97cd00756e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6604168
	void *41e1acbaff(); // Function Engine.AnimInstance.*41e1acbaff // Native|Public|BlueprintCallable // @ game+0x661f74c
	void *b538b022ef(struct FName* CurveName); // Function Engine.AnimInstance.*b538b022ef // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x776404
};

// Class Engine.ActorComponent
// Size: 0x1f0 (Inherited: 0x28)
struct UActorComponent : UObject {
	char pad_28[0xe8]; // 0x28(0xe8)
	struct F*0f0451e91e PrimaryComponentTick[0x58]; // 0x110(0x58)
	struct TArray<struct FName> ComponentTags[0x10]; // 0x168(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData[0x10]; // 0x178(0x10)
	char pad_188_0 : 3; // 0x188(0x01)
	char bReplicates : 1; // 0x188(0x01)
	char bNetAddressable : 1; // 0x188(0x01)
	char *eb9a7c0234 : 1; // 0x188(0x01)
	char pad_188_6 : 2; // 0x188(0x01)
	char pad_189[0x1]; // 0x189(0x01)
	char pad_18A_0 : 2; // 0x18a(0x01)
	char bCreatedByConstructionScript : 1; // 0x18a(0x01)
	char bInstanceComponent : 1; // 0x18a(0x01)
	char bAutoActivate : 1; // 0x18a(0x01)
	char *a0e3b46900 : 1; // 0x18a(0x01)
	char *f5528674d0 : 1; // 0x18a(0x01)
	char pad_18A_7 : 1; // 0x18a(0x01)
	char pad_18B[0x1]; // 0x18b(0x01)
	struct FGuid DestructibleId[0x10]; // 0x18c(0x10)
	bool bIsDestroyedVersion; // 0x19c(0x01)
	char pad_19D[0x3]; // 0x19d(0x03)
	char *4104c47be9 : 1; // 0x1a0(0x01)
	char pad_1A0_1 : 2; // 0x1a0(0x01)
	char bIsEditorOnly : 1; // 0x1a0(0x01)
	char pad_1A0_4 : 4; // 0x1a0(0x01)
	char pad_1A1[0x4]; // 0x1a1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1a5(0x01)
	enum class EPendingCreationType *b5609ab139; // 0x1a6(0x01)
	char pad_1A7[0x9]; // 0x1a7(0x09)
	struct TArray<struct FSimpleMemberReference> *146dc34f04[0x10]; // 0x1b0(0x10)
	struct FMulticastDelegate OnComponentActivated[0x10]; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentDeactivated[0x10]; // 0x1d0(0x10)
	char pad_1E0[0x9]; // 0x1e0(0x09)
	char *cf80e92dfd : 1; // 0x1e9(0x01)
	char pad_1E9_1 : 7; // 0x1e9(0x01)
	char pad_1EA[0x6]; // 0x1ea(0x06)

	void *8c98ce177e(); // Function Engine.ActorComponent.*8c98ce177e // Final|Native|Public|BlueprintCallable // @ game+0x65cf7dc
	void *1f22ea7014(); // Function Engine.ActorComponent.*1f22ea7014 // Native|Public|BlueprintCallable // @ game+0x6079ae8
	void *785b4984be(); // Function Engine.ActorComponent.*785b4984be // Native|Public|BlueprintCallable // @ game+0x65da068
	void IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58ccedc
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *1a019a9e51(); // Function Engine.ActorComponent.*1a019a9e51 // Native|Public|BlueprintCallable // @ game+0x65d84b4
	void *da68cb3372(); // Function Engine.ActorComponent.*da68cb3372 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7324
	void *0d8e3f17b7(); // Function Engine.ActorComponent.*0d8e3f17b7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc524
	void AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x65be400
	void *d4ab759ea6(); // Function Engine.ActorComponent.*d4ab759ea6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc858cc
	void *00b640eb07(); // Function Engine.ActorComponent.*00b640eb07 // Native|Public|BlueprintCallable // @ game+0x65be528
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x65d31d0
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0x6b9194
	void *5ef1f9adbd(); // Function Engine.ActorComponent.*5ef1f9adbd // Native|Public|BlueprintCallable // @ game+0x65d486c
	void *5ad1d3c9a1(); // Function Engine.ActorComponent.*5ad1d3c9a1 // Native|Public|BlueprintCallable // @ game+0x65d4744
	void *ea49bd0d03(); // Function Engine.ActorComponent.*ea49bd0d03 // Final|Native|Public|BlueprintCallable // @ game+0x65da100
	void *2aaaa32fa0(); // Function Engine.ActorComponent.*2aaaa32fa0 // Final|Native|Public|BlueprintCallable // @ game+0x65dd814
	void ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct FName *8a0aedbeac(); // Function Engine.ActorComponent.*8a0aedbeac // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c229c
	void ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *750dd6d1b4(); // Function Engine.ActorComponent.*750dd6d1b4 // Final|Native|Public|BlueprintCallable // @ game+0x65dd6f0
	void Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xda134c
	void *8ebaaa3f1c(); // Function Engine.ActorComponent.*8ebaaa3f1c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc65c
	void *daf95a6d0f(); // Function Engine.ActorComponent.*daf95a6d0f // Final|Native|Public|BlueprintCallable // @ game+0x65db5c0
	void *d16a426ed5(); // Function Engine.ActorComponent.*d16a426ed5 // Native|Public|BlueprintCallable // @ game+0x65d78bc
};

// Class Engine.Pawn
// Size: 0x448 (Inherited: 0x3e8)
struct APawn : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	char bUseControllerRotationPitch : 1; // 0x3f0(0x01)
	char bUseControllerRotationYaw : 1; // 0x3f0(0x01)
	char bUseControllerRotationRoll : 1; // 0x3f0(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x3f0(0x01)
	char pad_3F0_4 : 4; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	float BaseEyeHeight[0x04]; // 0x3f4(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x3f8(0x01)
	enum class EAutoPossessAI *637d6226e2; // 0x3f9(0x01)
	char pad_3FA[0x6]; // 0x3fa(0x06)
	struct UClass* AIControllerClass[0x08]; // 0x400(0x08)
	struct AController* *ae51997ba6[0x08]; // 0x408(0x08)
	struct APlayerState* PlayerState[0x08]; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct AController* Controller[0x08]; // 0x420(0x08)
	uint16 *b10f56f1ec[0x02]; // 0x428(0x02)
	char pad_42A[0x6]; // 0x42a(0x06)
	struct FVector *814ccd4912[0x0c]; // 0x430(0x0c)
	struct FVector *3f76097423[0x0c]; // 0x43c(0x0c)

	void *32c30cb7ba(); // Function Engine.Pawn.*32c30cb7ba // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c26b4
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0xa5db94
	void *e0a9fcbfb7(); // Function Engine.Pawn.*e0a9fcbfb7 // Native|Public|BlueprintCallable // @ game+0x5875394
	void AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x65bc95c
	void *acf54802ff(bool bNewValue); // Function Engine.Pawn.*acf54802ff // Final|Native|Public|BlueprintCallable // @ game+0x65d9544
	void GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7610
	void *daec38650f(); // Function Engine.Pawn.*daec38650f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cabfc
	void *cd2880c3b9(); // Function Engine.Pawn.*cd2880c3b9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc06cb4
	void *ce2d089123(); // Function Engine.Pawn.*ce2d089123 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5879b74
	void ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	bool *36a58cc031(); // Function Engine.Pawn.*36a58cc031 // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d342c
	void K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cabfc
	void GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c75dc
	bool *ecf94bc62e(); // Function Engine.Pawn.*ecf94bc62e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d2814
	struct APawn* *f4052479f6(); // Function Engine.Pawn.*f4052479f6 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x65c9f38
	void AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x65bca94
	void *c4dd205927(); // Function Engine.Pawn.*c4dd205927 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c97b4
	void ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *c2917ac77a(); // Function Engine.Pawn.*c2917ac77a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc688
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x58f036c
	void *7f9978cc5d(); // Function Engine.Pawn.*7f9978cc5d // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6208
	void *5169d06c8f(); // Function Engine.Pawn.*5169d06c8f // Native|Public|BlueprintCallable // @ game+0x65de9a8
	float *8abf75d769(); // Function Engine.Pawn.*8abf75d769 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bdb88
	void AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x65bc9f8
	void *c6dcfd395c(); // Function Engine.Pawn.*c6dcfd395c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58ab078
	void *796d6f386f(); // Function Engine.Pawn.*796d6f386f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccc00
	void *8bf01eefd9(); // Function Engine.Pawn.*8bf01eefd9 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca070
};

// Class Engine.DataAsset
// Size: 0x30 (Inherited: 0x28)
struct UDataAsset : UObject {
	struct UClass* *10becfdadd[0x08]; // 0x28(0x08)
};

// Class Engine.SceneComponent
// Size: 0x4d0 (Inherited: 0x1f0)
struct USceneComponent : UActorComponent {
	char pad_1F0[0x8]; // 0x1f0(0x08)
	struct FVector *9a43cb5eb0[0x0c]; // 0x1f8(0x0c)
	enum class EComponentMobility Mobility; // 0x204(0x01)
	char pad_205[0xb]; // 0x205(0x0b)
	char pad_210_0 : 1; // 0x210(0x01)
	char bReplicatesAttachmentReference : 1; // 0x210(0x01)
	char bReplicatesAttachment : 1; // 0x210(0x01)
	char *7edcd61a27 : 1; // 0x210(0x01)
	char pad_210_4 : 1; // 0x210(0x01)
	char bAbsoluteLocation : 1; // 0x210(0x01)
	char bAbsoluteRotation : 1; // 0x210(0x01)
	char bAbsoluteScale : 1; // 0x210(0x01)
	char bVisible : 1; // 0x211(0x01)
	char bHiddenInGame : 1; // 0x211(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x211(0x01)
	char *24ea2d2db6 : 1; // 0x211(0x01)
	char bUseAttachParentBound : 1; // 0x211(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x211(0x01)
	char pad_211_6 : 2; // 0x211(0x01)
	char pad_212[0x2e]; // 0x212(0x2e)
	char bAbsoluteTranslation : 1; // 0x240(0x01)
	char pad_240_1 : 7; // 0x240(0x01)
	char pad_241[0x3]; // 0x241(0x03)
	struct APhysicsVolume* PhysicsVolume[0x08]; // 0x244(0x08)
	char pad_24C[0x20]; // 0x24c(0x20)
	struct FVector RelativeLocation[0x0c]; // 0x26c(0x0c)
	char pad_278[0x28]; // 0x278(0x28)
	enum class *8d98cbd81d DetailMode; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	SetProperty *e5b54241ae[0x50]; // 0x2a8(0x50)
	char pad_2F8[0x28]; // 0x2f8(0x28)
	struct TArray<struct USceneComponent*> AttachChildren[0x10]; // 0x320(0x10)
	char pad_330[0x40]; // 0x330(0x40)
	struct FVector RelativeTranslation[0x0c]; // 0x370(0x0c)
	struct FVector RelativeScale3D[0x0c]; // 0x37c(0x0c)
	struct FRotator RelativeRotation[0x0c]; // 0x388(0x0c)
	char pad_394[0x4]; // 0x394(0x04)
	struct FName *d373ab65c0[0x08]; // 0x398(0x08)
	struct USceneComponent* AttachParent[0x08]; // 0x3a0(0x08)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate[0x10]; // 0x3a8(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate[0x10]; // 0x3b8(0x10)
	char pad_3C8[0x108]; // 0x3c8(0x108)

	void *13433cbc36(); // Function Engine.SceneComponent.*13433cbc36 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c5fec
	int32 *b37ee9a628(); // Function Engine.SceneComponent.*b37ee9a628 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6e1c
	void *3042ae5482(); // Function Engine.SceneComponent.*3042ae5482 // Final|Native|Public|BlueprintCallable // @ game+0x65db488
	struct FHitResult K2_SetWorldLocation(); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d1db0
	void *9880b8ac03(); // Function Engine.SceneComponent.*9880b8ac03 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59258e8
	void *616a4bc95d(); // Function Engine.SceneComponent.*616a4bc95d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xc2f560
	void *d1e160453f(struct FName* InSocketName); // Function Engine.SceneComponent.*d1e160453f // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb448
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xb023a4
	void *00805e15a0(); // Function Engine.SceneComponent.*00805e15a0 // Final|Native|Public|BlueprintCallable // @ game+0x65d4930
	void *b65feeef3f(); // Function Engine.SceneComponent.*b65feeef3f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cfe68
	void ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x65df618
	void K2_AddRelativeRotation(bool bSweep); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65ce4c4
	struct FHitResult K2_SetRelativeRotation(); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d19ac
	void K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cfeac
	void *acf5999592(); // Function Engine.SceneComponent.*acf5999592 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb390
	void *3c6ecb02cb(); // Function Engine.SceneComponent.*3c6ecb02cb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb0cc
	struct FHitResult K2_AddWorldTransform(); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cea40
	void *b7202f79f2(); // Function Engine.SceneComponent.*b7202f79f2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65caaec
	struct FHitResult K2_SetRelativeLocation(); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d15b0
	bool K2_AddWorldOffset(struct FHitResult* SweepHitResult); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65ce690
	void *6948fa2e48(); // Function Engine.SceneComponent.*6948fa2e48 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7d28
	void *50da2f3057(); // Function Engine.SceneComponent.*50da2f3057 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cfde4
	bool *f6d44887dc(); // Function Engine.SceneComponent.*f6d44887dc // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6ebc
	void IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cd04c
	void SetVisibility(bool bNewVisibility); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xc7cd64
	struct FHitResult K2_AddRelativeLocation(); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65ce2f8
	struct FRotator K2_AddWorldRotation(bool bSweep); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65ce868
	void *ed9b4c17e2(); // Function Engine.SceneComponent.*ed9b4c17e2 // Final|Native|Public|BlueprintCallable // @ game+0x65db524
	void *38d51f9159(); // Function Engine.SceneComponent.*38d51f9159 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca27c
	struct FName *f414cfd93b(enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.*f414cfd93b // Final|Native|Public|BlueprintCallable // @ game+0x65cf30c
	bool K2_AttachTo(); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x65cef6c
	void *efd3807eb2(struct FName* InSocketName); // Function Engine.SceneComponent.*efd3807eb2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c33ac
	void *438a5949ee(struct FName* BoneName); // Function Engine.SceneComponent.*438a5949ee // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59072f4
	struct FHitResult K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cdef4
	void *444c1212e4(); // Function Engine.SceneComponent.*444c1212e4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc4fc
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xb023a4
	void *e779c0903a(); // Function Engine.SceneComponent.*e779c0903a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb228
	void OnRep_Visibility(); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x65d32c4
	bool DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x65c3178
	void *21f58f1be6(); // Function Engine.SceneComponent.*21f58f1be6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcffed8
	void *64a21ee5e3(struct FVector* NewLocation, bool bSweep); // Function Engine.SceneComponent.*64a21ee5e3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d177c
	struct FName *e13883b81c(); // Function Engine.SceneComponent.*e13883b81c // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb2e0
	void *4b5116dfbb(); // Function Engine.SceneComponent.*4b5116dfbb // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c733c
	void *5ce6cd6a9b(); // Function Engine.SceneComponent.*5ce6cd6a9b // Native|Public|HasDefaults|BlueprintCallable // @ game+0xc3b0c8
	void *b0520f213c(); // Function Engine.SceneComponent.*b0520f213c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb060
	struct FHitResult K2_SetRelativeTransform(); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d1b84
	void *56cf68d820(bool bNewAbsoluteRotation); // Function Engine.SceneComponent.*56cf68d820 // Final|Native|Public|BlueprintCallable // @ game+0x65d7778
	enum class *c67378b5c9 *9917bfece4(); // Function Engine.SceneComponent.*9917bfece4 // Final|Native|Public|BlueprintCallable // @ game+0x725820
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xb57df8
	void K2_SetWorldRotation(struct FRotator* NewRotation, struct FHitResult* SweepHitResult); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d21b8
	void *f6dcf1f073(); // Function Engine.SceneComponent.*f6dcf1f073 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65de4ac
	bool *5822caec90(); // Function Engine.SceneComponent.*5822caec90 // Final|Native|Public|BlueprintCallable // @ game+0x65db1b0
	void *d0e066f51a(struct FVector* NewLocation, bool bSweep); // Function Engine.SceneComponent.*d0e066f51a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d1f88
	void *17ae5231cf(); // Function Engine.SceneComponent.*17ae5231cf // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbc4c
	struct FName *5196502450(); // Function Engine.SceneComponent.*5196502450 // Final|Native|Public|BlueprintCallable // @ game+0x65de8a0
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xab1624
	void K2_AddLocalTransform(bool bSweep); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65ce0cc
	void *0f7e9a03af(); // Function Engine.SceneComponent.*0f7e9a03af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cae58
	struct FHitResult K2_AddLocalOffset(); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65cdd1c
	void K2_SetWorldTransform(bool bSweep); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d2390
};

// Class Engine.PrimitiveComponent
// Size: 0xa00 (Inherited: 0x4d0)
struct UPrimitiveComponent : USceneComponent {
	char pad_4D0[0x8]; // 0x4d0(0x08)
	float MinDrawDistance[0x04]; // 0x4d8(0x04)
	float LDMaxDrawDistance[0x04]; // 0x4dc(0x04)
	float CachedMaxDrawDistance[0x04]; // 0x4e0(0x04)
	enum class *aa5951ad16 *beac6f3512; // 0x4e4(0x01)
	enum class *aa5951ad16 *c05f331378; // 0x4e5(0x01)
	char pad_4E6[0x2]; // 0x4e6(0x02)
	char pad_4E8_0 : 3; // 0x4e8(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x4e8(0x01)
	char bGenerateOverlapEvents : 1; // 0x4e8(0x01)
	char bMultiBodyOverlap : 1; // 0x4e8(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x4e8(0x01)
	char bTraceComplexOnMove : 1; // 0x4e8(0x01)
	char bDisableForceFromCharacter : 1; // 0x4e9(0x01)
	char bReturnMaterialOnMove : 1; // 0x4e9(0x01)
	char *7d72c87c3b : 1; // 0x4e9(0x01)
	char bAllowCullDistanceVolume : 1; // 0x4e9(0x01)
	char bImportantMesh : 1; // 0x4e9(0x01)
	char bOverrideCullingDistances : 1; // 0x4e9(0x01)
	char pad_4E9_6 : 2; // 0x4e9(0x01)
	char pad_4EA[0x2]; // 0x4ea(0x02)
	float HLODScreenSize[0x04]; // 0x4ec(0x04)
	char *5e4ce749ad : 1; // 0x4f0(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x4f0(0x01)
	char bRenderInMainPass : 1; // 0x4f0(0x01)
	char bRenderInMono : 1; // 0x4f0(0x01)
	char bOwnerNoSee : 1; // 0x4f0(0x01)
	char bOnlyOwnerSee : 1; // 0x4f0(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x4f0(0x01)
	char bUseAsOccluder : 1; // 0x4f0(0x01)
	char bForceAsOccluder : 1; // 0x4f1(0x01)
	char bForceOcclusionQuerying : 1; // 0x4f1(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x4f1(0x01)
	char *5be8cbe28b : 1; // 0x4f1(0x01)
	char bForceMipStreaming : 1; // 0x4f1(0x01)
	char *df83a74442 : 1; // 0x4f1(0x01)
	char pad_4F1_6 : 1; // 0x4f1(0x01)
	char CastShadow : 1; // 0x4f1(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x4f2(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x4f2(0x01)
	char bCastDynamicShadow : 1; // 0x4f2(0x01)
	char bCastStaticShadow : 1; // 0x4f2(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x4f2(0x01)
	char bSelfShadowOnly : 1; // 0x4f2(0x01)
	char bCastFarShadow : 1; // 0x4f2(0x01)
	char bCastInsetShadow : 1; // 0x4f2(0x01)
	char bCastCinematicShadow : 1; // 0x4f3(0x01)
	char bCastHiddenShadow : 1; // 0x4f3(0x01)
	char bCastShadowAsTwoSided : 1; // 0x4f3(0x01)
	char bLightAsIfStatic : 1; // 0x4f3(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x4f3(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x4f3(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x4f3(0x01)
	char bIgnoreRadialImpulse : 1; // 0x4f3(0x01)
	char bIgnoreRadialForce : 1; // 0x4f4(0x01)
	char bApplyImpulseOnDamage : 1; // 0x4f4(0x01)
	char bSyncBodySleep : 1; // 0x4f4(0x01)
	char *c4dba7907d : 1; // 0x4f4(0x01)
	char *9a602298e0 : 1; // 0x4f4(0x01)
	char *8a825352a8 : 1; // 0x4f4(0x01)
	char bRenderCustomDepth : 1; // 0x4f4(0x01)
	char pad_4F4_7 : 1; // 0x4f4(0x01)
	char pad_4F5_0 : 7; // 0x4f5(0x01)
	char *f0ec410b1c : 1; // 0x4f5(0x01)
	char *e465b784ab : 1; // 0x4f6(0x01)
	char *0566bc7293 : 1; // 0x4f6(0x01)
	char pad_4F6_2 : 6; // 0x4f6(0x01)
	char pad_4F7[0x1]; // 0x4f7(0x01)
	enum class EDecalChannel DecalChannel; // 0x4f8(0x01)
	enum class *a6cf5bae1a IndoorOutdoorMask; // 0x4f9(0x01)
	struct FLightingChannels LightingChannels[0x03]; // 0x4fa(0x03)
	enum class *8421afef2f IndirectLightingCacheQuality; // 0x4fd(0x01)
	bool CustomDepthStencilValue; // 0x4fe(0x01)
	enum class *dc75936d4b CustomDepthStencilWriteMask; // 0x4ff(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep[0x10]; // 0x500(0x10)
	int32 TranslucencySortPriority[0x04]; // 0x510(0x04)
	int32 *9de4760b7d[0x04]; // 0x514(0x04)
	char pad_518[0x4]; // 0x518(0x04)
	float LpvBiasMultiplier[0x04]; // 0x51c(0x04)
	struct FBodyInstance BodyInstance[0x230]; // 0x520(0x230)
	char pad_750[0x8]; // 0x750(0x08)
	enum class EHasCustomNavigableGeometry *8df498730b; // 0x758(0x01)
	char pad_759[0x3b]; // 0x759(0x3b)
	float BoundsScale[0x04]; // 0x794(0x04)
	float *8e81fad5fc[0x04]; // 0x798(0x04)
	float *c058bd94eb[0x04]; // 0x79c(0x04)
	float *02253285d4[0x04]; // 0x7a0(0x04)
	enum class *2cf50fcfdf CanBeCharacterBase; // 0x7a4(0x01)
	char pad_7A5[0x1]; // 0x7a5(0x01)
	enum class *2cf50fcfdf CanCharacterStepUpOn; // 0x7a6(0x01)
	char pad_7A7[0x1]; // 0x7a7(0x01)
	struct TArray<struct AActor*> *2588299a27[0x10]; // 0x7a8(0x10)
	struct TArray<struct UPrimitiveComponent*> *67a415eac1[0x10]; // 0x7b8(0x10)
	char pad_7C8[0xb8]; // 0x7c8(0xb8)
	struct FMulticastDelegate OnComponentHit[0x10]; // 0x880(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap[0x10]; // 0x890(0x10)
	struct FMulticastDelegate OnComponentEndOverlap[0x10]; // 0x8a0(0x10)
	struct FMulticastDelegate OnComponentWake[0x10]; // 0x8b0(0x10)
	struct FMulticastDelegate OnComponentSleep[0x10]; // 0x8c0(0x10)
	char pad_8D0[0x10]; // 0x8d0(0x10)
	struct FMulticastDelegate OnBeginCursorOver[0x10]; // 0x8e0(0x10)
	struct FMulticastDelegate OnEndCursorOver[0x10]; // 0x8f0(0x10)
	struct FMulticastDelegate OnClicked[0x10]; // 0x900(0x10)
	struct FMulticastDelegate OnReleased[0x10]; // 0x910(0x10)
	struct FMulticastDelegate OnInputTouchBegin[0x10]; // 0x920(0x10)
	struct FMulticastDelegate OnInputTouchEnd[0x10]; // 0x930(0x10)
	struct FMulticastDelegate OnInputTouchEnter[0x10]; // 0x940(0x10)
	struct FMulticastDelegate OnInputTouchLeave[0x10]; // 0x950(0x10)
	char pad_960[0x28]; // 0x960(0x28)
	struct UPrimitiveComponent* *e6a95e2ca0[0x08]; // 0x988(0x08)
	struct UPrimitiveComponent* *7982e5317b[0x08]; // 0x990(0x08)
	struct F*3a1b9f6b9c *601e25c40b[0x58]; // 0x998(0x58)
	char pad_9F0[0x10]; // 0x9f0(0x10)

	void SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x65d8240
	void *dfbae66789(struct FName* BoneName); // Function Engine.PrimitiveComponent.*dfbae66789 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c89c0
	void *0a6204477c(); // Function Engine.PrimitiveComponent.*0a6204477c // Final|Native|Public|BlueprintCallable // @ game+0x65dd044
	void *eb52f532a5(); // Function Engine.PrimitiveComponent.*eb52f532a5 // Final|Native|Public|BlueprintCallable // @ game+0x65c2814
	void *ea3f9e2cf3(); // Function Engine.PrimitiveComponent.*ea3f9e2cf3 // Native|Public|BlueprintCallable // @ game+0xc3d89c
	void *c074a79845(); // Function Engine.PrimitiveComponent.*c074a79845 // Final|Native|Public|BlueprintCallable // @ game+0x65da3c8
	void *6ee3451862(); // Function Engine.PrimitiveComponent.*6ee3451862 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c714c
	void *44a43b0322(); // Function Engine.PrimitiveComponent.*44a43b0322 // Final|Native|Public|BlueprintCallable // @ game+0x65da330
	struct UMaterialInterface* SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0x65dbcf8
	void *e9ee2ab3a1(); // Function Engine.PrimitiveComponent.*e9ee2ab3a1 // Final|Native|Public|BlueprintCallable // @ game+0x65da458
	void *4e7d139cf0(); // Function Engine.PrimitiveComponent.*4e7d139cf0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65d0268
	struct APawn* *5cb343a96e(); // Function Engine.PrimitiveComponent.*5cb343a96e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65bed34
	void *f94dd47839(); // Function Engine.PrimitiveComponent.*f94dd47839 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65d023c
	void *13b1364c95(); // Function Engine.PrimitiveComponent.*13b1364c95 // Native|Public|BlueprintCallable // @ game+0x65cc4d4
	void *b87315fc50(int32* ElementIndex); // Function Engine.PrimitiveComponent.*b87315fc50 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9a54
	struct FName GetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65cac70
	struct UPrimitiveComponent* *2a4abc706a(); // Function Engine.PrimitiveComponent.*2a4abc706a // Final|Native|Public|BlueprintCallable // @ game+0x65cc1e4
	void CreateDynamicMaterialInstance(struct UMaterialInterface** SourceMaterial); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x65c2a7c
	struct FVector AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd828
	struct FName *93488147e1(); // Function Engine.PrimitiveComponent.*93488147e1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c6cf0
	void SetPhysicsLinearVelocity(struct FVector* NewVel); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xbb3958
	struct FName SetMassScale(); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x58ece78
	void *30938d503c(); // Function Engine.PrimitiveComponent.*30938d503c // Final|Native|Public|BlueprintCallable // @ game+0x65dda34
	void *379b1e37e1(); // Function Engine.PrimitiveComponent.*379b1e37e1 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65de3d8
	void *21a20b6c62(); // Function Engine.PrimitiveComponent.*21a20b6c62 // Native|Public|BlueprintCallable // @ game+0x65d9cc0
	struct FName AddForce(); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd048
	float *ccd28ea01f(enum class *0baddcb8e4 Falloff); // Function Engine.PrimitiveComponent.*ccd28ea01f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bdf28
	void *5b987becac(); // Function Engine.PrimitiveComponent.*5b987becac // Native|Public|BlueprintCallable // @ game+0x7257a4
	struct FName *b8234e2743(); // Function Engine.PrimitiveComponent.*b8234e2743 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65d4e0c
	float *bea52685d2(); // Function Engine.PrimitiveComponent.*bea52685d2 // Native|Public|BlueprintCallable // @ game+0x65dbbcc
	void *30924b231e(); // Function Engine.PrimitiveComponent.*30924b231e // Final|Native|Public|BlueprintCallable // @ game+0x65dc474
	void AddImpulse(struct FVector* Impulse); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd6e8
	struct FVector AddForceAtLocationLocal(); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd2d4
	void GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca590
	void SetPhysicsAngularVelocity(struct FVector* NewAngVel); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xc22c24
	enum class ECollisionChannel *465dde8592(); // Function Engine.PrimitiveComponent.*465dde8592 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c71d4
	void *dbe4b0a4e1(); // Function Engine.PrimitiveComponent.*dbe4b0a4e1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7174
	void *d2ee8cd4c7(); // Function Engine.PrimitiveComponent.*d2ee8cd4c7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9994
	void *736adad895(); // Function Engine.PrimitiveComponent.*736adad895 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca3e8
	void CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x65c278c
	void *fcf556dc5a(); // Function Engine.PrimitiveComponent.*fcf556dc5a // Final|Native|Public|BlueprintCallable // @ game+0x65bf35c
	void *090f50e275(); // Function Engine.PrimitiveComponent.*090f50e275 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c608c
	struct FHitResult K2_LineTraceComponent(struct FVector* TraceStart); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d02cc
	void *6071051144(); // Function Engine.PrimitiveComponent.*6071051144 // Native|Public|BlueprintCallable // @ game+0x65ddcd8
	void AddAngularImpulse(struct FVector* Impulse); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bc774
	struct AActor* *fd96d57958(); // Function Engine.PrimitiveComponent.*fd96d57958 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccd18
	int32 *b3a3c00bbd(); // Function Engine.PrimitiveComponent.*b3a3c00bbd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9af8
	void *c851d0aa12(); // Function Engine.PrimitiveComponent.*c851d0aa12 // Native|Public|BlueprintCallable // @ game+0x65db95c
	void *3292c0b7df(); // Function Engine.PrimitiveComponent.*3292c0b7df // Native|Public|BlueprintCallable // @ game+0x65d9b94
	void *70595e1cd6(); // Function Engine.PrimitiveComponent.*70595e1cd6 // Final|Native|Public|BlueprintCallable // @ game+0x65bf378
	void SetCollisionObjectType(); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x65d9afc
	void *e5ffb56c9a(); // Function Engine.PrimitiveComponent.*e5ffb56c9a // Native|Public|BlueprintCallable // @ game+0x65d9c28
	void *7b7fd27d02(struct FVector* NewAngVel); // Function Engine.PrimitiveComponent.*7b7fd27d02 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d7fb0
	void *256ba244cc(); // Function Engine.PrimitiveComponent.*256ba244cc // Native|Public|BlueprintCallable // @ game+0x65dc3dc
	bool SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x65dc7b8
	void *7923455fa2(); // Function Engine.PrimitiveComponent.*7923455fa2 // Final|Native|Public|BlueprintCallable // @ game+0x65dc5c8
	void CreateAndSetMaterialInstanceDynamic(int32* ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x65c289c
	void *44661dddcf(); // Function Engine.PrimitiveComponent.*44661dddcf // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9834
	void *a652adf220(); // Function Engine.PrimitiveComponent.*a652adf220 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc980
	void *c8a9007ebc(); // Function Engine.PrimitiveComponent.*c8a9007ebc // Final|Native|Public|BlueprintCallable // @ game+0x65d9408
	void *b92ee3b9c0(); // Function Engine.PrimitiveComponent.*b92ee3b9c0 // Native|Public|BlueprintCallable // @ game+0x65df918
	struct UMaterialInterface* CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x65c298c
	void GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca788
	void *d4294e3947(); // Function Engine.PrimitiveComponent.*d4294e3947 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca2b4
	void *009c0f2a1d(); // Function Engine.PrimitiveComponent.*009c0f2a1d // Final|Native|Public|BlueprintCallable // @ game+0x65dcfb0
	struct FName *cdfb4b1220(); // Function Engine.PrimitiveComponent.*cdfb4b1220 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6ff0
	void SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x65bc9f8
	void AddTorque(struct FName* BoneName); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65be5bc
	void *ebf54e58f9(); // Function Engine.PrimitiveComponent.*ebf54e58f9 // Native|Public|BlueprintCallable // @ game+0x65da198
	void *6dba8b25b2(); // Function Engine.PrimitiveComponent.*6dba8b25b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc020
	void *fc6fe4c940(); // Function Engine.PrimitiveComponent.*fc6fe4c940 // Final|Native|Public|BlueprintCallable // @ game+0x65c719c
	void *3d4f5f6da1(); // Function Engine.PrimitiveComponent.*3d4f5f6da1 // Final|Native|Public|BlueprintCallable // @ game+0x65cc104
	void *794ecded84(); // Function Engine.PrimitiveComponent.*794ecded84 // Native|Public|BlueprintCallable // @ game+0x65dc724
	void *e83e82c836(); // Function Engine.PrimitiveComponent.*e83e82c836 // Native|Public|BlueprintCallable // @ game+0x65df900
	struct FName *fb3c2a98a1(); // Function Engine.PrimitiveComponent.*fb3c2a98a1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65cad20
	void *e336185bf8(); // Function Engine.PrimitiveComponent.*e336185bf8 // Final|Native|Public|BlueprintCallable // @ game+0x65d438c
	void *da08b8ba8d(); // Function Engine.PrimitiveComponent.*da08b8ba8d // Native|Public|BlueprintCallable // @ game+0x65da708
	void *473e1da61e(); // Function Engine.PrimitiveComponent.*473e1da61e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccdb8
	struct FVector SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d978c
	void GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9968
	void *78f7d5ad87(float* Radius, enum class *0baddcb8e4 Falloff); // Function Engine.PrimitiveComponent.*78f7d5ad87 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65be0fc
	void *e2737e7e29(); // Function Engine.PrimitiveComponent.*e2737e7e29 // Final|Native|Public|BlueprintCallable // @ game+0x65d9660
	struct FVector SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d80a8
	void *9594116b12(); // Function Engine.PrimitiveComponent.*9594116b12 // Final|Native|Public|BlueprintCallable // @ game+0x65dcf1c
	void *bf796448cc(struct FName* MaterialSlotName); // Function Engine.PrimitiveComponent.*bf796448cc // Native|Public|BlueprintCallable // @ game+0x65dbe1c
	void *5aa27e0388(); // Function Engine.PrimitiveComponent.*5aa27e0388 // Native|Public|BlueprintCallable // @ game+0x65d2f88
	void *b9d962ff83(); // Function Engine.PrimitiveComponent.*b9d962ff83 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65d0298
	void AddForceAtLocation(struct FVector* Location); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd188
	void GetPhysicsLinearVelocity(struct FName* BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xc81138
	void *84914014a9(); // Function Engine.PrimitiveComponent.*84914014a9 // Native|Public|BlueprintCallable // @ game+0x65d81a8
};

// Class Engine.MeshComponent
// Size: 0xb00 (Inherited: 0xa00)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials[0x10]; // 0x9f8(0x10)
	char pad_A10[0xf0]; // 0xa10(0xf0)

	void *489b9cbe67(); // Function Engine.MeshComponent.*489b9cbe67 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9c44
	void *0b87d25dc2(); // Function Engine.MeshComponent.*0b87d25dc2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9cd0
	struct FName *b78c042dcb(); // Function Engine.MeshComponent.*b78c042dcb // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xb8e0c0
	struct FName *199deabfb3(); // Function Engine.MeshComponent.*199deabfb3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9b9c
	void *1aad846c30(struct FName* ParameterName); // Function Engine.MeshComponent.*1aad846c30 // Final|Native|Public|BlueprintCallable // @ game+0x7762b8
	struct FName *84436b1e1a(); // Function Engine.MeshComponent.*84436b1e1a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccb30
};

// Class Engine.StaticMeshComponent
// Size: 0xba0 (Inherited: 0xb00)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel[0x04]; // 0xb00(0x04)
	int32 *90bd71ffae[0x04]; // 0xb04(0x04)
	bool bOverrideMinLOD; // 0xb08(0x01)
	char pad_B09[0x3]; // 0xb09(0x03)
	int32 MinLOD[0x04]; // 0xb0c(0x04)
	struct UStaticMesh* StaticMesh[0x08]; // 0xb10(0x08)
	bool bOverrideWireframeColor; // 0xb18(0x01)
	char pad_B19[0x3]; // 0xb19(0x03)
	struct FColor WireframeColorOverride[0x04]; // 0xb1c(0x04)
	struct FLinearColor PerInstanceCustomData[0x10]; // 0xb20(0x10)
	char *7e2d9548d8 : 1; // 0xb30(0x01)
	char *8338f52a12 : 1; // 0xb30(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xb30(0x01)
	char *1ee48c2b08 : 1; // 0xb30(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xb30(0x01)
	char bOverrideLightMapRes : 1; // 0xb30(0x01)
	char pad_B30_6 : 2; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	int32 OverriddenLightMapRes[0x04]; // 0xb34(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xb38(0x01)
	char pad_B38_1 : 7; // 0xb38(0x01)
	char pad_B39[0x3]; // 0xb39(0x03)
	float DistanceFieldIndirectShadowMinVisibility[0x04]; // 0xb3c(0x04)
	float StreamingDistanceMultiplier[0x04]; // 0xb40(0x04)
	int32 *af073d6e42[0x04]; // 0xb44(0x04)
	char *3af970e567 : 1; // 0xb48(0x01)
	char pad_B48_1 : 7; // 0xb48(0x01)
	char pad_B49[0x7]; // 0xb49(0x07)
	struct TArray<struct FGuid> IrrelevantLights[0x10]; // 0xb50(0x10)
	struct TArray<struct F*36c5fc3da1> *a09dd6c691[0x10]; // 0xb60(0x10)
	struct TArray<struct F*110531103f> *ba85d1c43d[0x10]; // 0xb70(0x10)
	bool *51bf197520; // 0xb80(0x01)
	char pad_B81[0x3]; // 0xb81(0x03)
	struct F*25888ccc71 LightmassSettings[0x18]; // 0xb84(0x18)
	char pad_B9C[0x4]; // 0xb9c(0x04)

	void SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x608a4a4
	void OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x65d321c
	void *f07c990051(); // Function Engine.StaticMeshComponent.*f07c990051 // Final|Native|Public|BlueprintCallable // @ game+0x65da9e8
	struct FVector *bd3a17aa7c(); // Function Engine.StaticMeshComponent.*bd3a17aa7c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9860
};

// Class Engine.SkinnedMeshComponent
// Size: 0xca0 (Inherited: 0xb00)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh[0x08]; // 0xb00(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent[0x08]; // 0xb08(0x08)
	char pad_B10[0x60]; // 0xb10(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb70(0x01)
	char pad_B70_1 : 7; // 0xb70(0x01)
	char pad_B71[0x7]; // 0xb71(0x07)
	struct TArray<struct FBoxSphereBounds> *3dbfb27017[0x10]; // 0xb78(0x10)
	char pad_B88[0x20]; // 0xb88(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride[0x08]; // 0xba8(0x08)
	int32 ForcedLodModel[0x04]; // 0xbb0(0x04)
	int32 MinLodModel[0x04]; // 0xbb4(0x04)
	char pad_BB8[0x10]; // 0xbb8(0x10)
	struct TArray<struct F*30fe3c2ae3> LODInfo[0x10]; // 0xbc8(0x10)
	float StreamingDistanceMultiplier[0x04]; // 0xbd8(0x04)
	struct FColor WireframeColor[0x04]; // 0xbdc(0x04)
	char *659560d097 : 1; // 0xbe0(0x01)
	char *475e008585 : 1; // 0xbe0(0x01)
	char bDisableMorphTarget : 1; // 0xbe0(0x01)
	char *47c3b74fa9 : 1; // 0xbe0(0x01)
	char pad_BE0_4 : 4; // 0xbe0(0x01)
	char pad_BE1[0x17]; // 0xbe1(0x17)
	char bPerBoneMotionBlur : 1; // 0xbf8(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xbf8(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xbf8(0x01)
	char bSyncAttachParentLOD : 1; // 0xbf8(0x01)
	char pad_BF8_4 : 4; // 0xbf8(0x01)
	char pad_BF9[0x3]; // 0xbf9(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xbfc(0x01)
	char pad_BFD[0x3]; // 0xbfd(0x03)
	char *ed8b7c0cd1 : 1; // 0xc00(0x01)
	char *2dec0d4b3d : 1; // 0xc00(0x01)
	char *d7ee5beccf : 1; // 0xc00(0x01)
	char pad_C00_3 : 5; // 0xc00(0x01)
	char pad_C01[0x3]; // 0xc01(0x03)
	bool *7205949c98; // 0xc04(0x01)
	char pad_C05[0x3]; // 0xc05(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xc08(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xc08(0x01)
	char pad_C08_2 : 6; // 0xc08(0x01)
	char pad_C09[0x3]; // 0xc09(0x03)
	char bRenderStatic : 1; // 0xc0c(0x01)
	char pad_C0C_1 : 7; // 0xc0c(0x01)
	char pad_C0D[0x3]; // 0xc0d(0x03)
	float CapsuleIndirectShadowMinVisibility[0x04]; // 0xc10(0x04)
	char *5d608d2726 : 1; // 0xc14(0x01)
	char pad_C14_1 : 7; // 0xc14(0x01)
	char pad_C15[0xf]; // 0xc15(0x0f)
	struct FBoxSphereBounds *e8aa361390[0x1c]; // 0xc24(0x1c)
	bool *3db651bce3; // 0xc40(0x01)
	bool bEnableUpdateRateOptimizations; // 0xc41(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xc42(0x01)
	char pad_C43[0x4e]; // 0xc43(0x4e)
	bool *c6d2b441e6; // 0xc91(0x01)
	bool *2b84848e75; // 0xc92(0x01)
	char pad_C93[0xd]; // 0xc93(0x0d)

	void *a9b796c1d6(struct FVector* InPosition, struct FVector* OutPosition); // Function Engine.SkinnedMeshComponent.*a9b796c1d6 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6638f90
	struct FName GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65fd35c
	void SetSkinWeightOverride(int32* LODIndex); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x662c904
	void *7a5bcec032(int32* BoneIndex); // Function Engine.SkinnedMeshComponent.*7a5bcec032 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65fd618
	int32 *bb2cf533fa(); // Function Engine.SkinnedMeshComponent.*bb2cf533fa // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x662fa94
	struct FName *9b95cbd08f(); // Function Engine.SkinnedMeshComponent.*9b95cbd08f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6605b64
	void *ec630a3bd7(struct FName* BoneName); // Function Engine.SkinnedMeshComponent.*ec630a3bd7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ea188
	struct UPhysicsAsset* *b420fb9e25(); // Function Engine.SkinnedMeshComponent.*b420fb9e25 // Native|Public|BlueprintCallable // @ game+0x662b3c0
	bool *81bb09f3f1(); // Function Engine.SkinnedMeshComponent.*81bb09f3f1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fa068
	void *422993eabc(); // Function Engine.SkinnedMeshComponent.*422993eabc // Final|Native|Public|BlueprintCallable // @ game+0x6627750
	void *c29b32cdeb(); // Function Engine.SkinnedMeshComponent.*c29b32cdeb // Final|Native|Public|BlueprintCallable // @ game+0x660a4a0
	void *cfda61cd72(); // Function Engine.SkinnedMeshComponent.*cfda61cd72 // Final|Native|Public|BlueprintCallable // @ game+0x662a488
	void *572be15f1a(); // Function Engine.SkinnedMeshComponent.*572be15f1a // Final|Native|Public|BlueprintCallable // @ game+0x66239dc
	void *0a10b2cd0f(struct FName* BoneName); // Function Engine.SkinnedMeshComponent.*0a10b2cd0f // Final|Native|Public|BlueprintCallable // @ game+0x660bb28
	void *7468ce33f2(); // Function Engine.SkinnedMeshComponent.*7468ce33f2 // Final|Native|Public|BlueprintCallable // @ game+0x66391c8
	void *ebab473a5d(); // Function Engine.SkinnedMeshComponent.*ebab473a5d // Final|Native|Public|BlueprintCallable // @ game+0x662a358
	struct USkeletalMesh* SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x662c790
	void *fc7b44b1d1(); // Function Engine.SkinnedMeshComponent.*fc7b44b1d1 // Final|Native|Public|BlueprintCallable // @ game+0x65f16c8
	void *92816e14f0(); // Function Engine.SkinnedMeshComponent.*92816e14f0 // Final|Native|Public|BlueprintCallable // @ game+0x6623e8c
	void *2a5d8e52d6(); // Function Engine.SkinnedMeshComponent.*2a5d8e52d6 // Final|Native|Public|BlueprintCallable // @ game+0x662c2f0
	struct FVector *64cb181e22(); // Function Engine.SkinnedMeshComponent.*64cb181e22 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6638bbc
	void *381741b6ee(); // Function Engine.SkinnedMeshComponent.*381741b6ee // Final|Native|Public|BlueprintCallable // @ game+0x6623f3c
	void *9f5953896a(); // Function Engine.SkinnedMeshComponent.*9f5953896a // Final|Native|Public|BlueprintCallable // @ game+0x65f1360
	struct FName *27a259593c(); // Function Engine.SkinnedMeshComponent.*27a259593c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66034b0
	void *03205eb86e(); // Function Engine.SkinnedMeshComponent.*03205eb86e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6602d50
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1190 (Inherited: 0xca0)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass[0x08]; // 0xca0(0x08)
	struct UClass* AnimClass[0x08]; // 0xca8(0x08)
	struct UAnimInstance* AnimScriptInstance[0x08]; // 0xcb0(0x08)
	struct TArray<struct UAnimInstance*> *cac389782e[0x10]; // 0xcb8(0x10)
	struct UAnimInstance* *0f41b41bc6[0x08]; // 0xcc8(0x08)
	struct F*795231f53f AnimationData[0x18]; // 0xcd0(0x18)
	char pad_CE8[0x30]; // 0xce8(0x30)
	struct TArray<struct FTransform> *30c04377c4[0x10]; // 0xd18(0x10)
	struct TArray<struct FTransform> *48246de69f[0x10]; // 0xd28(0x10)
	char pad_D38[0x20]; // 0xd38(0x20)
	float GlobalAnimRateScale[0x04]; // 0xd58(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd5c(0x01)
	enum class *6b7dd1323d PhysicsTransformUpdateMode; // 0xd5d(0x01)
	char pad_D5E[0x1]; // 0xd5e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd5f(0x01)
	char pad_D60[0x4]; // 0xd60(0x04)
	char pad_D64_0 : 1; // 0xd64(0x01)
	char *cd629f2904 : 1; // 0xd64(0x01)
	char pad_D64_2 : 1; // 0xd64(0x01)
	char *368f830df6 : 1; // 0xd64(0x01)
	char pad_D64_4 : 2; // 0xd64(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd64(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd64(0x01)
	char bDisableClothSimulation : 1; // 0xd65(0x01)
	char pad_D65_1 : 2; // 0xd65(0x01)
	char bCollideWithEnvironment : 1; // 0xd65(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd65(0x01)
	char bLocalSpaceSimulation : 1; // 0xd65(0x01)
	char *9d5f911249 : 1; // 0xd65(0x01)
	char bResetAfterTeleport : 1; // 0xd65(0x01)
	char pad_D66_0 : 1; // 0xd66(0x01)
	char bNoSkeletonUpdate : 1; // 0xd66(0x01)
	char bPauseAnims : 1; // 0xd66(0x01)
	char *5576a9afdf : 1; // 0xd66(0x01)
	char bEnablePerPolyCollision : 1; // 0xd66(0x01)
	char *e60af2509a : 1; // 0xd66(0x01)
	char *1dcbaec13b : 1; // 0xd66(0x01)
	char *639b831db9 : 1; // 0xd66(0x01)
	char *a5d9754d88 : 1; // 0xd67(0x01)
	char *31549101df : 1; // 0xd67(0x01)
	char *dfe8dc6b1c : 1; // 0xd67(0x01)
	char *ec824e2227 : 1; // 0xd67(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd67(0x01)
	char *3f60233fd2 : 1; // 0xd67(0x01)
	char pad_D67_6 : 2; // 0xd67(0x01)
	char *de7a769060 : 1; // 0xd68(0x01)
	char pad_D68_1 : 7; // 0xd68(0x01)
	char pad_D69_0 : 2; // 0xd69(0x01)
	char bDefaultLooping : 1; // 0xd69(0x01)
	char bDefaultPlaying : 1; // 0xd69(0x01)
	char pad_D69_4 : 4; // 0xd69(0x01)
	uint16 *4f3e8a52f4[0x02]; // 0xd6a(0x02)
	float ClothBlendWeight[0x04]; // 0xd6c(0x04)
	struct FVector *a7427fc46d[0x0c]; // 0xd70(0x0c)
	char pad_D7C[0x4]; // 0xd7c(0x04)
	struct UBodySetup* BodySetup[0x08]; // 0xd80(0x08)
	float TeleportDistanceThreshold[0x04]; // 0xd88(0x04)
	float TeleportRotationThreshold[0x04]; // 0xd8c(0x04)
	struct FVector *769ee627e3[0x0c]; // 0xd90(0x0c)
	char pad_D9C[0x4]; // 0xd9c(0x04)
	struct FMulticastDelegate OnConstraintBroken[0x10]; // 0xda0(0x10)
	char pad_DB0[0xe0]; // 0xdb0(0xe0)
	struct UClass* *aefcf253a9[0x08]; // 0xe90(0x08)
	char pad_E98[0x1e8]; // 0xe98(0x1e8)
	struct UAnimSequence* SequenceToPlay[0x08]; // 0x1080(0x08)
	struct UAnimationAsset* AnimToPlay[0x08]; // 0x1088(0x08)
	float DefaultPosition[0x04]; // 0x1090(0x04)
	float DefaultPlayRate[0x04]; // 0x1094(0x04)
	uint32 *95fd69c2cb[0x04]; // 0x1098(0x04)
	float *b5cc14a665[0x04]; // 0x109c(0x04)
	char pad_10A0[0xf0]; // 0x10a0(0xf0)

	bool *c56b07f144(); // Function Engine.SkeletalMeshComponent.*c56b07f144 // Final|Native|Public|BlueprintCallable // @ game+0x66261a8
	void *a9bd8ab703(); // Function Engine.SkeletalMeshComponent.*a9bd8ab703 // Final|Native|Public|BlueprintCallable // @ game+0xc24528
	void *9dddf56a91(); // Function Engine.SkeletalMeshComponent.*9dddf56a91 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660a358
	void *50d1a575e9(); // Function Engine.SkeletalMeshComponent.*50d1a575e9 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x663256c
	bool *d3ad1def60(); // Function Engine.SkeletalMeshComponent.*d3ad1def60 // Native|Public|BlueprintCallable // @ game+0x6622a90
	void *f6964fda19(struct UAnimationAsset** InAnimToPlay, bool bIsPlaying); // Function Engine.SkeletalMeshComponent.*f6964fda19 // Final|Native|Public|BlueprintCallable // @ game+0x66192b0
	float *021885e3b0(); // Function Engine.SkeletalMeshComponent.*021885e3b0 // Final|Native|Public|BlueprintCallable // @ game+0x6621248
	bool *e433eef528(); // Function Engine.SkeletalMeshComponent.*e433eef528 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65fd52c
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x675b00
	void *930fde712a(); // Function Engine.SkeletalMeshComponent.*930fde712a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc8c840
	bool *24e946edb2(); // Function Engine.SkeletalMeshComponent.*24e946edb2 // Final|Native|Public|BlueprintCallable // @ game+0x6620c84
	void *614f873041(); // Function Engine.SkeletalMeshComponent.*614f873041 // Final|Native|Public|BlueprintCallable // @ game+0x65f12b0
	void *ad01a8f0e8(struct FName* BoneName); // Function Engine.SkeletalMeshComponent.*ad01a8f0e8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65e4244
	void *0f98d962fe(); // Function Engine.SkeletalMeshComponent.*0f98d962fe // Final|Native|Public|BlueprintCallable // @ game+0x65e8ed4
	float *40da40db84(); // Function Engine.SkeletalMeshComponent.*40da40db84 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65e392c
	void *6365012393(); // Function Engine.SkeletalMeshComponent.*6365012393 // Final|Native|Public|BlueprintCallable // @ game+0x6639258
	void *3e29b8164e(struct FName* BoneName); // Function Engine.SkeletalMeshComponent.*3e29b8164e // Final|Native|Public|BlueprintCallable // @ game+0x660ba78
	void *29dcd8040f(); // Function Engine.SkeletalMeshComponent.*29dcd8040f // Final|Native|Public|BlueprintCallable // @ game+0x23b3fc
	struct FName *6a167b3650(); // Function Engine.SkeletalMeshComponent.*6a167b3650 // Final|Native|Public|BlueprintCallable // @ game+0x66249bc
	void *41e4010056(); // Function Engine.SkeletalMeshComponent.*41e4010056 // Final|Native|Public|BlueprintCallable // @ game+0x65fdc48
	void *69cff9aed5(); // Function Engine.SkeletalMeshComponent.*69cff9aed5 // Final|Native|Public|BlueprintCallable // @ game+0x660bbf4
	void *d434eea481(); // Function Engine.SkeletalMeshComponent.*d434eea481 // Final|Native|Public|BlueprintCallable // @ game+0x65fba40
	void *c03f41b0aa(); // Function Engine.SkeletalMeshComponent.*c03f41b0aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6603fa8
	void *3462fbfb5c(); // Function Engine.SkeletalMeshComponent.*3462fbfb5c // Final|Native|Public|BlueprintCallable // @ game+0x661ee44
	struct FVector *d9e7603b72(); // Function Engine.SkeletalMeshComponent.*d9e7603b72 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65ece80
	void SetPosition(float* InPos); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x662ba8c
	float *5ae2ffaa34(); // Function Engine.SkeletalMeshComponent.*5ae2ffaa34 // Final|Native|Public|BlueprintCallable // @ game+0x662a754
	struct FName *f74f280075(); // Function Engine.SkeletalMeshComponent.*f74f280075 // Final|Native|Public|BlueprintCallable // @ game+0x6626294
	void SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x6621ca8
	void *1d57b1bb52(); // Function Engine.SkeletalMeshComponent.*1d57b1bb52 // Final|Native|Public|BlueprintCallable // @ game+0x65fba28
	void *23d2ba5196(); // Function Engine.SkeletalMeshComponent.*23d2ba5196 // Final|Native|Public|BlueprintCallable // @ game+0x662455c
	float *6e1429b48f(); // Function Engine.SkeletalMeshComponent.*6e1429b48f // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65fe0c0
	void *c1767223e2(); // Function Engine.SkeletalMeshComponent.*c1767223e2 // Final|Native|Public|BlueprintCallable // @ game+0x5875e0c
	void *cbc612e27a(); // Function Engine.SkeletalMeshComponent.*cbc612e27a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6605b30
	struct FName *9f9a8070a6(); // Function Engine.SkeletalMeshComponent.*9f9a8070a6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6602c54
	bool *7f135ecfd6(); // Function Engine.SkeletalMeshComponent.*7f135ecfd6 // Final|Native|Public|BlueprintCallable // @ game+0x6620dc8
	void *de6402c79a(); // Function Engine.SkeletalMeshComponent.*de6402c79a // Final|Native|Public|BlueprintCallable // @ game+0x6626558
	void *40e7e573ca(bool bNewNotifyRigidBodyCollision); // Function Engine.SkeletalMeshComponent.*40e7e573ca // Native|Public|BlueprintCallable // @ game+0x662abe0
	void GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6603c64
	void Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0x675d28
	void *71482262f9(float* InSpring, float* InForceLimit); // Function Engine.SkeletalMeshComponent.*71482262f9 // Final|Native|Public|BlueprintCallable // @ game+0x6620b04
	bool *84cfacb4c2(); // Function Engine.SkeletalMeshComponent.*84cfacb4c2 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66208cc
	struct FName *c5a6bc927d(); // Function Engine.SkeletalMeshComponent.*c5a6bc927d // Final|Native|Public|BlueprintCallable // @ game+0x6624aec
	void *185f746e31(); // Function Engine.SkeletalMeshComponent.*185f746e31 // Final|Native|Public|BlueprintCallable // @ game+0x662b4a4
	void *dc39210b5a(); // Function Engine.SkeletalMeshComponent.*dc39210b5a // Final|Native|Public|BlueprintCallable // @ game+0x661f118
	void SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x675cb4
	void SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0x675ba0
	void GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660370c
	void *96095d2473(struct FVector* ClosestWorldPosition, struct FName* BoneName); // Function Engine.SkeletalMeshComponent.*96095d2473 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x660cc5c
	void *a330220722(); // Function Engine.SkeletalMeshComponent.*a330220722 // Final|Native|Public|BlueprintCallable // @ game+0x6620a70
	struct UAnimationAsset* PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x6619df0
	void IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660c160
	void *3033d50dc7(); // Function Engine.SkeletalMeshComponent.*3033d50dc7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65fcc00
	bool *51412c4656(); // Function Engine.SkeletalMeshComponent.*51412c4656 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x72528c
	void *37329cc52f(); // Function Engine.SkeletalMeshComponent.*37329cc52f // Final|Native|Public|BlueprintCallable // @ game+0x6637f04
	void *a26539e1ba(); // Function Engine.SkeletalMeshComponent.*a26539e1ba // Final|Native|Public|BlueprintCallable // @ game+0x661eda0
	void *e7aa7d7da3(struct FVector* force, bool bAccelChange); // Function Engine.SkeletalMeshComponent.*e7aa7d7da3 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65e40b0
	int32 *6e324d9bce(); // Function Engine.SkeletalMeshComponent.*6e324d9bce // Final|Native|Public|BlueprintCallable // @ game+0x65fa670
};

// Class Engine.*3ea9fa89b4
// Size: 0x30 (Inherited: 0x28)
struct U*3ea9fa89b4 : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Engine.*468963f0bd
// Size: 0x30 (Inherited: 0x30)
struct U*468963f0bd : U*3ea9fa89b4 {
};

// Class Engine.*6273c6b474
// Size: 0x28 (Inherited: 0x28)
struct U*6273c6b474 : UObject {
};

// Class Engine.*271a14efcc
// Size: 0x40 (Inherited: 0x28)
struct U*271a14efcc : UObject {
	char bCausedByWorld : 1; // 0x28(0x01)
	char bScaleMomentumByMass : 1; // 0x28(0x01)
	char bRadialDamageVelChange : 1; // 0x28(0x01)
	char pad_28_3 : 5; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float DamageImpulse[0x04]; // 0x2c(0x04)
	float DestructibleImpulse[0x04]; // 0x30(0x04)
	float DestructibleDamageSpreadScale[0x04]; // 0x34(0x04)
	float DamageFalloff[0x04]; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.MovementComponent
// Size: 0x240 (Inherited: 0x1f0)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent[0x08]; // 0x1f0(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive[0x08]; // 0x1f8(0x08)
	char pad_200[0x4]; // 0x200(0x04)
	struct FVector Velocity[0x0c]; // 0x204(0x0c)
	char bConstrainToPlane : 1; // 0x210(0x01)
	char bSnapToPlaneAtStart : 1; // 0x210(0x01)
	char pad_210_2 : 6; // 0x210(0x01)
	char pad_211[0x3]; // 0x211(0x03)
	enum class EPlaneConstraintAxisSetting *7ab4b5f3c1; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	struct FVector PlaneConstraintNormal[0x0c]; // 0x218(0x0c)
	struct FVector PlaneConstraintOrigin[0x0c]; // 0x224(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x230(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x230(0x01)
	char bTickBeforeOwner : 1; // 0x230(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x230(0x01)
	char pad_230_4 : 4; // 0x230(0x01)
	char pad_231[0xf]; // 0x231(0x0f)

	void *804d12d910(); // Function Engine.MovementComponent.*804d12d910 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cae94
	void PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0xa77e0c
	void *d248a1aaae(); // Function Engine.MovementComponent.*d248a1aaae // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc884
	void *c1398b37a6(); // Function Engine.MovementComponent.*c1398b37a6 // Native|Public|BlueprintCallable // @ game+0x65df2e0
	void *053425dd63(); // Function Engine.MovementComponent.*053425dd63 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9de0
	void *92a97de1ad(); // Function Engine.MovementComponent.*92a97de1ad // Native|Public|BlueprintCallable // @ game+0x65ddc44
	void *833d7039fe(); // Function Engine.MovementComponent.*833d7039fe // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c2424
	struct FVector *0332c73f2c(); // Function Engine.MovementComponent.*0332c73f2c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65dca18
	void *2fea06ffbc(); // Function Engine.MovementComponent.*2fea06ffbc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cae7c
	void *878acd980b(struct FVector* Delta, struct FHitResult* OutHit, bool bTeleport); // Function Engine.MovementComponent.*878acd980b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d0638
	struct FVector ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c24ec
	void *1c513777e4(); // Function Engine.MovementComponent.*1c513777e4 // Native|Public|BlueprintCallable // @ game+0x65de990
	void *9f3eaf5b59(); // Function Engine.MovementComponent.*9f3eaf5b59 // Native|Public|BlueprintCallable // @ game+0x65dc8ec
	void K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cff14
	struct FVector *052621d1b5(); // Function Engine.MovementComponent.*052621d1b5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c25b4
	void *70244a322f(); // Function Engine.MovementComponent.*70244a322f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65dcbc8
	void *6e8e2e686e(); // Function Engine.MovementComponent.*6e8e2e686e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65caebc
	void *fd2eb42e11(); // Function Engine.MovementComponent.*fd2eb42e11 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65dcb24
	void *2607cf7854(); // Function Engine.MovementComponent.*2607cf7854 // Native|Public|BlueprintCallable // @ game+0x65dc980
	void *0f7e9a03af(); // Function Engine.MovementComponent.*0f7e9a03af // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cae30
	void K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cff6c
	void *25a4009423(); // Function Engine.MovementComponent.*25a4009423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7df4
};

// Class Engine.NavMovementComponent
// Size: 0x270 (Inherited: 0x240)
struct UNavMovementComponent : UMovementComponent {
	struct F*4093962ce1 NavAgentProps[0x20]; // 0x238(0x20)
	float *4bbf1eb9ad[0x04]; // 0x258(0x04)
	char *90ca0dcfa9 : 1; // 0x25c(0x01)
	char bUseAccelerationForPaths : 1; // 0x25c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x25c(0x01)
	struct F*9f1f98e668 *af58b59ba5[0x04]; // 0x260(0x04)
	char pad_268_3 : 5; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)

	void IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc930
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x65decac
	void *b22af963f4(); // Function Engine.NavMovementComponent.*b22af963f4 // Final|Native|Public|BlueprintCallable // @ game+0x65df2f8
	void *e1ac14f9ef(); // Function Engine.NavMovementComponent.*e1ac14f9ef // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc82c
	void *3b5df87a4f(); // Function Engine.NavMovementComponent.*3b5df87a4f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc958
	void *89ecc9aaac(); // Function Engine.NavMovementComponent.*89ecc9aaac // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccc50
	void *e7adbe771e(); // Function Engine.NavMovementComponent.*e7adbe771e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cd024
};

// Class Engine.PawnMovementComponent
// Size: 0x280 (Inherited: 0x270)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *9376ef64fb[0x08]; // 0x270(0x08)
	char pad_278[0x8]; // 0x278(0x08)

	void *3d81af3a18(); // Function Engine.PawnMovementComponent.*3d81af3a18 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c267c
	struct FVector *6dd846560b(); // Function Engine.PawnMovementComponent.*6dd846560b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd974
	void *d8b516cdf6(); // Function Engine.PawnMovementComponent.*d8b516cdf6 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cabcc
	void *b2a08a6a1d(); // Function Engine.PawnMovementComponent.*b2a08a6a1d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9754
	void K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cfee0
	void *796d6f386f(); // Function Engine.PawnMovementComponent.*796d6f386f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccc28
	void *015cf4862c(); // Function Engine.PawnMovementComponent.*015cf4862c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cabb4
};

// Class Engine.CharacterMovementComponent
// Size: 0x920 (Inherited: 0x280)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_280[0x8]; // 0x280(0x08)
	struct ACharacter* *4938c83d2a[0x08]; // 0x288(0x08)
	char bApplyGravityWhileJumping : 1; // 0x290(0x01)
	char pad_290_1 : 7; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	float GravityScale[0x04]; // 0x294(0x04)
	float MaxStepHeight[0x04]; // 0x298(0x04)
	float JumpZVelocity[0x04]; // 0x29c(0x04)
	float JumpOffJumpZFactor[0x04]; // 0x2a0(0x04)
	float *dd15910807[0x04]; // 0x2a4(0x04)
	float *5071bbe841[0x04]; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	float *1aeeb67342[0x04]; // 0x2b0(0x04)
	float *d1c2ea1058[0x04]; // 0x2b4(0x04)
	char pad_2B8[0x8]; // 0x2b8(0x08)
	enum class EMovementMode MovementMode; // 0x2c0(0x01)
	bool CustomMovementMode; // 0x2c1(0x01)
	char pad_2C2[0x1e]; // 0x2c2(0x1e)
	float GroundFriction[0x04]; // 0x2e0(0x04)
	float MaxWalkSpeed[0x04]; // 0x2e4(0x04)
	float MaxWalkSpeedCrouched[0x04]; // 0x2e8(0x04)
	float MaxSwimSpeed[0x04]; // 0x2ec(0x04)
	float MaxFlySpeed[0x04]; // 0x2f0(0x04)
	float MaxCustomMovementSpeed[0x04]; // 0x2f4(0x04)
	float MaxAcceleration[0x04]; // 0x2f8(0x04)
	float BrakingFrictionFactor[0x04]; // 0x2fc(0x04)
	float BrakingFriction[0x04]; // 0x300(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x304(0x01)
	char pad_304_1 : 7; // 0x304(0x01)
	char pad_305[0x3]; // 0x305(0x03)
	float BrakingDecelerationWalking[0x04]; // 0x308(0x04)
	float BrakingDecelerationFalling[0x04]; // 0x30c(0x04)
	float BrakingDecelerationSwimming[0x04]; // 0x310(0x04)
	float BrakingDecelerationFlying[0x04]; // 0x314(0x04)
	float AirControl[0x04]; // 0x318(0x04)
	float AirControlBoostMultiplier[0x04]; // 0x31c(0x04)
	float AirControlBoostVelocityThreshold[0x04]; // 0x320(0x04)
	float FallingLateralFriction[0x04]; // 0x324(0x04)
	float CrouchedHalfHeight[0x04]; // 0x328(0x04)
	float PronedHalfHeight[0x04]; // 0x32c(0x04)
	float PronedRadius[0x04]; // 0x330(0x04)
	float Buoyancy[0x04]; // 0x334(0x04)
	float PerchRadiusThreshold[0x04]; // 0x338(0x04)
	float PerchAdditionalHeight[0x04]; // 0x33c(0x04)
	struct FRotator RotationRate[0x0c]; // 0x340(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x34c(0x01)
	char bOrientRotationToMovement : 1; // 0x34c(0x01)
	char bSweepWhileNavWalking : 1; // 0x34c(0x01)
	char pad_34C_3 : 2; // 0x34c(0x01)
	char *377367ad67 : 1; // 0x34c(0x01)
	char *d391fd96a8 : 1; // 0x34c(0x01)
	char bForceMaxAccel : 1; // 0x34c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x34d(0x01)
	char bForceNextFloorCheck : 1; // 0x34d(0x01)
	char *114aa72bfd : 1; // 0x34d(0x01)
	char bCanWalkOffLedges : 1; // 0x34d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x34d(0x01)
	char pad_34D_5 : 2; // 0x34d(0x01)
	char *c2abb2c6d4 : 1; // 0x34d(0x01)
	char *cb30edb4d5 : 1; // 0x34e(0x01)
	char pad_34E_1 : 7; // 0x34e(0x01)
	char pad_34F[0x1]; // 0x34f(0x01)
	struct USceneComponent* *e932784708[0x08]; // 0x350(0x08)
	float MaxOutOfWaterStepHeight[0x04]; // 0x358(0x04)
	float OutofWaterZ[0x04]; // 0x35c(0x04)
	float Mass[0x04]; // 0x360(0x04)
	bool bEnablePhysicsInteraction; // 0x364(0x01)
	bool bTouchForceScaledToMass; // 0x365(0x01)
	bool bPushForceScaledToMass; // 0x366(0x01)
	bool bPushForceUsingZOffset; // 0x367(0x01)
	bool bScalePushForceToVelocity; // 0x368(0x01)
	char pad_369[0x3]; // 0x369(0x03)
	float StandingDownwardForceScale[0x04]; // 0x36c(0x04)
	float InitialPushForceFactor[0x04]; // 0x370(0x04)
	float PushForceFactor[0x04]; // 0x374(0x04)
	float PushForcePointZOffsetFactor[0x04]; // 0x378(0x04)
	float TouchForceFactor[0x04]; // 0x37c(0x04)
	float MinTouchForce[0x04]; // 0x380(0x04)
	float MaxTouchForce[0x04]; // 0x384(0x04)
	float RepulsionForce[0x04]; // 0x388(0x04)
	char bForceBraking : 1; // 0x38c(0x01)
	char pad_38C_1 : 7; // 0x38c(0x01)
	char pad_38D[0x3]; // 0x38d(0x03)
	float CrouchedSpeedMultiplier[0x04]; // 0x390(0x04)
	float UpperImpactNormalScale[0x04]; // 0x394(0x04)
	struct FVector Acceleration[0x0c]; // 0x398(0x0c)
	struct FVector *f2cdf36f17[0x0c]; // 0x3a4(0x0c)
	struct FQuat *2344f9b1ba[0x10]; // 0x3b0(0x10)
	struct FVector *3d5bc6c8e3[0x0c]; // 0x3c0(0x0c)
	float *1379983bf5[0x04]; // 0x3cc(0x04)
	float *9b713bace2[0x04]; // 0x3d0(0x04)
	float *32f74edb4a[0x04]; // 0x3d4(0x04)
	struct FVector *53684725eb[0x0c]; // 0x3d8(0x0c)
	struct FVector *83c3dcb84b[0x0c]; // 0x3e4(0x0c)
	float *18b0dcf7ea[0x04]; // 0x3f0(0x04)
	char pad_3F4[0x8]; // 0x3f4(0x08)
	float MaxSimulationTimeStep[0x04]; // 0x3fc(0x04)
	int32 MaxSimulationIterations[0x04]; // 0x400(0x04)
	float MaxDepenetrationWithGeometry[0x04]; // 0x404(0x04)
	float MaxDepenetrationWithGeometryAsProxy[0x04]; // 0x408(0x04)
	float MaxDepenetrationWithPawn[0x04]; // 0x40c(0x04)
	float MaxDepenetrationWithPawnAsProxy[0x04]; // 0x410(0x04)
	float *bc7a9107d9[0x04]; // 0x414(0x04)
	float *f468814d86[0x04]; // 0x418(0x04)
	float *396f8361b7[0x04]; // 0x41c(0x04)
	float *58c123bfd6[0x04]; // 0x420(0x04)
	float *95b5d33d2f[0x04]; // 0x424(0x04)
	float *1a782b9ac2[0x04]; // 0x428(0x04)
	float *f5bbe755ef[0x04]; // 0x42c(0x04)
	float *48231160a6[0x04]; // 0x430(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	float *dfc538dd63[0x04]; // 0x438(0x04)
	float *6a6d42d7f4[0x04]; // 0x43c(0x04)
	float *afadae7855[0x04]; // 0x440(0x04)
	float *33d9b4fb8b[0x04]; // 0x444(0x04)
	float LedgeCheckThreshold[0x04]; // 0x448(0x04)
	float JumpOutOfWaterPitch[0x04]; // 0x44c(0x04)
	struct F*3718d46421 CurrentFloor[0x98]; // 0x450(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4e8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4e9(0x01)
	enum class EMovementMode *64d9549867; // 0x4ea(0x01)
	char pad_4EB[0x1]; // 0x4eb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityX : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityY : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4ec(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4ec(0x01)
	char bJustTeleported : 1; // 0x4ec(0x01)
	char *1f2fb81ea2 : 1; // 0x4ec(0x01)
	char *1f30f54ae9 : 1; // 0x4ec(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4ed(0x01)
	char bNotifyApex : 1; // 0x4ed(0x01)
	char *f36ca33c0e : 1; // 0x4ed(0x01)
	char bWantsToCrouch : 1; // 0x4ed(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4ed(0x01)
	char pad_4ED_5 : 3; // 0x4ed(0x01)
	char pad_4EE[0x2]; // 0x4ee(0x02)
	enum class EStanceMode StanceMode; // 0x4f0(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x4f1(0x01)
	char pad_4F2[0x2]; // 0x4f2(0x02)
	char bIgnoreBaseRotation : 1; // 0x4f4(0x01)
	char *e1b9431844 : 1; // 0x4f4(0x01)
	char bAlwaysCheckFloor : 1; // 0x4f4(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x4f4(0x01)
	char *eaba1e724f : 1; // 0x4f4(0x01)
	char *74c4a6681c : 1; // 0x4f4(0x01)
	char bUseRVOAvoidance : 1; // 0x4f4(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x4f4(0x01)
	char pad_4F5[0xf]; // 0x4f5(0x0f)
	char *64a1cb3dd6 : 1; // 0x504(0x01)
	char *cd0f91380a : 1; // 0x504(0x01)
	char *fbcb4f7122 : 1; // 0x504(0x01)
	char pad_504_3 : 2; // 0x504(0x01)
	char bProjectNavMeshWalking : 1; // 0x504(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x504(0x01)
	char pad_504_7 : 1; // 0x504(0x01)
	char pad_505[0x13]; // 0x505(0x13)
	float AvoidanceConsiderationRadius[0x04]; // 0x518(0x04)
	struct FVector *71a3c5f6d6[0x0c]; // 0x51c(0x0c)
	int32 AvoidanceUID[0x04]; // 0x528(0x04)
	struct F*f2710e04b9 AvoidanceGroup[0x04]; // 0x52c(0x04)
	struct F*f2710e04b9 GroupsToAvoid[0x04]; // 0x530(0x04)
	struct F*f2710e04b9 GroupsToIgnore[0x04]; // 0x534(0x04)
	float AvoidanceWeight[0x04]; // 0x538(0x04)
	struct FVector *e29a3efc6f[0x0c]; // 0x53c(0x0c)
	char pad_548[0xa8]; // 0x548(0xa8)
	float NavMeshProjectionInterval[0x04]; // 0x5f0(0x04)
	float *7a0e85f2f7[0x04]; // 0x5f4(0x04)
	float NavMeshProjectionInterpSpeed[0x04]; // 0x5f8(0x04)
	float NavMeshProjectionHeightScaleUp[0x04]; // 0x5fc(0x04)
	float NavMeshProjectionHeightScaleDown[0x04]; // 0x600(0x04)
	float NavWalkingFloorDistTolerance[0x04]; // 0x604(0x04)
	char pad_608[0xb0]; // 0x608(0xb0)
	struct F*7d36dc8762 *f4c4231f71[0x58]; // 0x6b8(0x58)
	char pad_710[0x10]; // 0x710(0x10)
	float *4df95f3c1b[0x04]; // 0x720(0x04)
	char pad_724[0x4]; // 0x724(0x04)
	struct FRootMotionSourceGroup *d26ef8f08d[0x100]; // 0x728(0x100)
	char pad_828[0x98]; // 0x828(0x98)
	struct F*77ba1cb021 *67f0cdfabe[0x40]; // 0x8c0(0x40)
	struct FVector *45e1cf143e[0x0c]; // 0x900(0x0c)
	bool *a27368222e; // 0x90c(0x01)
	char pad_90D[0x3]; // 0x90d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x910(0x01)
	char pad_910_1 : 7; // 0x910(0x01)
	char pad_911[0xf]; // 0x911(0x0f)

	struct FHitResult *f2e8aa35e0(); // Function Engine.CharacterMovementComponent.*f2e8aa35e0 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65cd074
	void *c70f537a0a(); // Function Engine.CharacterMovementComponent.*c70f537a0a // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65daebc
	void *e553325af3(); // Function Engine.CharacterMovementComponent.*e553325af3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6da0
	void *bc6abdde9a(); // Function Engine.CharacterMovementComponent.*bc6abdde9a // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x65de54c
	void *e501ac931e(); // Function Engine.CharacterMovementComponent.*e501ac931e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9d88
	enum class EMovementMode *a38eeeca9f(); // Function Engine.CharacterMovementComponent.*a38eeeca9f // Native|Public|BlueprintCallable // @ game+0x65dc238
	void *14f1b49e8a(); // Function Engine.CharacterMovementComponent.*14f1b49e8a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cff40
	void AddImpulse(struct FVector* Impulse); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd5e8
	void *581baeac28(); // Function Engine.CharacterMovementComponent.*581baeac28 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8960
	void *b7442b5506(); // Function Engine.CharacterMovementComponent.*b7442b5506 // Final|Native|Public|BlueprintCallable // @ game+0x65de2a8
	void *c4b8270fb7(); // Function Engine.CharacterMovementComponent.*c4b8270fb7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbcf0
	void *8b32685714(); // Function Engine.CharacterMovementComponent.*8b32685714 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7a30
	void *e6a8435a7d(); // Function Engine.CharacterMovementComponent.*e6a8435a7d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccc50
	void *e9b207e0ce(); // Function Engine.CharacterMovementComponent.*e9b207e0ce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9db4
	void *4c989de930(); // Function Engine.CharacterMovementComponent.*4c989de930 // Final|Native|Public|BlueprintCallable // @ game+0x65d8908
	void *43b516a96e(); // Function Engine.CharacterMovementComponent.*43b516a96e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65d0224
	void *cd6e07bf02(); // Function Engine.CharacterMovementComponent.*cd6e07bf02 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9f14
	void AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bcfa4
	void *2e43ceda7f(); // Function Engine.CharacterMovementComponent.*2e43ceda7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cac24
	struct FVector *04ec90a9d8(); // Function Engine.CharacterMovementComponent.*04ec90a9d8 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cf9d0
	void *208a65c218(float* DeltaTime, bool bFluid); // Function Engine.CharacterMovementComponent.*208a65c218 // Native|Public|BlueprintCallable // @ game+0x65beb14
	void *35735c5cd3(); // Function Engine.CharacterMovementComponent.*35735c5cd3 // Native|Public|BlueprintCallable // @ game+0x583cd44
	void *ae7f14da74(); // Function Engine.CharacterMovementComponent.*ae7f14da74 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65dafe4
	void *087f6c73d3(); // Function Engine.CharacterMovementComponent.*087f6c73d3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58ea3e8
	void *fbab99523c(); // Function Engine.CharacterMovementComponent.*fbab99523c // Final|Native|Public|BlueprintCallable // @ game+0x65de340
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x65c3394
	void *18e1c80ce6(); // Function Engine.CharacterMovementComponent.*18e1c80ce6 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65d8994
	void *7a61a19a27(); // Function Engine.CharacterMovementComponent.*7a61a19a27 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6074
	void *284edf62e0(); // Function Engine.CharacterMovementComponent.*284edf62e0 // Final|Native|Public|BlueprintCallable // @ game+0x65d8874
	void *e2309bf902(); // Function Engine.CharacterMovementComponent.*e2309bf902 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58a6ab0
	void *cf126f0075(float* LineDistance, float* SweepRadius); // Function Engine.CharacterMovementComponent.*cf126f0075 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65cf52c
	void *34f9057aac(); // Function Engine.CharacterMovementComponent.*34f9057aac // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9d5c
	void *a946e888d9(); // Function Engine.CharacterMovementComponent.*a946e888d9 // Final|Native|Public|BlueprintCallable // @ game+0x65dcde8
	void CapsuleTouched(struct AActor** Param1, int32* Param3); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x65beef0
	void *c686538277(); // Function Engine.CharacterMovementComponent.*c686538277 // Final|Native|Public|BlueprintCallable // @ game+0x65dae30
	void *a4ebf22dc8(); // Function Engine.CharacterMovementComponent.*a4ebf22dc8 // Final|Native|Public|BlueprintCallable // @ game+0x65daf58
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject {

	struct FString MakeStringAssetReference(); // Function Engine.BlueprintFunctionLibrary.MakeStringAssetReference // Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x6613ea0
};

// Class Engine.StaticMeshActor
// Size: 0x3f8 (Inherited: 0x3e8)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent[0x08]; // 0x3e8(0x08)
	bool bStaticMeshReplicateMovement; // 0x3f0(0x01)
	enum class ENavDataGatheringMode *470c9f1b83; // 0x3f1(0x01)
	char pad_3F2[0x6]; // 0x3f2(0x06)
};

// Class Engine.HUD
// Size: 0x4d0 (Inherited: 0x3e8)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner[0x08]; // 0x3e8(0x08)
	char bLostFocusPaused : 1; // 0x3f0(0x01)
	char bShowHUD : 1; // 0x3f0(0x01)
	char bShowDebugInfo : 1; // 0x3f0(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x3f0(0x01)
	char bShowOverlays : 1; // 0x3f0(0x01)
	char bEnableDebugTextShadow : 1; // 0x3f0(0x01)
	char pad_3F0_6 : 2; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct TArray<struct AActor*> *5e3e96ddc9[0x10]; // 0x3f8(0x10)
	char pad_408[0x8]; // 0x408(0x08)
	struct TArray<struct FName> DebugDisplay[0x10]; // 0x410(0x10)
	struct TArray<struct FName> ToggledDebugCategories[0x10]; // 0x420(0x10)
	struct UCanvas* Canvas[0x08]; // 0x430(0x08)
	struct UCanvas* *4e5d7ebf6f[0x08]; // 0x438(0x08)
	struct TArray<struct F*56b1f6ab8b> *71494f9592[0x10]; // 0x440(0x10)
	struct UClass* *87c7d0deab[0x08]; // 0x450(0x08)
	struct AActor* *a812f78775[0x08]; // 0x458(0x08)
	char pad_460[0x70]; // 0x460(0x70)

	struct FVector2D *57c786c3b7(struct FLinearColor* V0_Color); // Function Engine.HUD.*57c786c3b7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c3d60
	void ReceiveDrawHUD(); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x2cd4ac
	float *090b07aebe(); // Function Engine.HUD.*090b07aebe // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c40d0
	void Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65d4174
	void ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x2cd4ac
	bool *2ac1731934(bool Param8, float* Param10); // Function Engine.HUD.*2ac1731934 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x65bcb30
	float *842d883d63(float* Scale, float* Rotation); // Function Engine.HUD.*842d883d63 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c3680
	struct UFont* *e23130372f(struct FString* Text); // Function Engine.HUD.*e23130372f // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb618
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0x5823324
	void ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x65de5f8
	void *9e3bd21f17(); // Function Engine.HUD.*9e3bd21f17 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca8cc
	void *9cedc41b81(); // Function Engine.HUD.*9cedc41b81 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x65d441c
	void *596dfaadd8(); // Function Engine.HUD.*596dfaadd8 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x590a940
	void ShowDebugToggleSubCategory(); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x65de734
	void Deproject(float* ScreenY); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c2d40
	float *669fd7d092(); // Function Engine.HUD.*669fd7d092 // Final|Native|Public|BlueprintCallable // @ game+0x65c3ae8
	void ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x65de68c
	struct AActor* *d7c730a3af(); // Function Engine.HUD.*d7c730a3af // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x65d45d0
	float *2d1c2faf12(float* EndScreenX, struct FLinearColor* LineColor); // Function Engine.HUD.*2d1c2faf12 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c3454
	float DrawTexture(struct FLinearColor* TintColor, float* Scale, float* Rotation); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c4564
	float *014b6abad2(); // Function Engine.HUD.*014b6abad2 // Final|Native|Public|BlueprintCallable // @ game+0x65c4a74
	struct UClass* *2e092f08e4(struct FVector2D* FirstPoint, struct FVector2D* SecondPoint, bool bIncludeNonCollidingComponents); // Function Engine.HUD.*2e092f08e4 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x65c5c34
	float *376229bab6(); // Function Engine.HUD.*376229bab6 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c42ac
	void AddHitBox(struct FVector2D* Position, struct FName* InName); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bd420
	void ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class Engine.Brush
// Size: 0x420 (Inherited: 0x3e8)
struct ABrush : AActor {
	enum class *98ccb57006 *07bf3e561c; // 0x3e8(0x01)
	char pad_3E9[0x3]; // 0x3e9(0x03)
	struct FColor BrushColor[0x04]; // 0x3ec(0x04)
	int32 PolyFlags[0x04]; // 0x3f0(0x04)
	char *fb6ef6a222 : 1; // 0x3f4(0x01)
	char *7676895afc : 1; // 0x3f4(0x01)
	char *fc9b5395c4 : 1; // 0x3f4(0x01)
	char *dcc8979d15 : 1; // 0x3f4(0x01)
	char pad_3F4_4 : 4; // 0x3f4(0x01)
	char pad_3F5[0x3]; // 0x3f5(0x03)
	struct UModel* Brush[0x08]; // 0x3f8(0x08)
	struct UBrushComponent* BrushComponent[0x08]; // 0x400(0x08)
	char *77a48e7c2a : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct TArray<struct F*5bb08df245> *9d01312ac4[0x10]; // 0x410(0x10)
};

// Class Engine.Volume
// Size: 0x420 (Inherited: 0x420)
struct AVolume : ABrush {
};

// Class Engine.AnimNotify
// Size: 0x38 (Inherited: 0x28)
struct UAnimNotify : UObject {
	char pad_28[0x10]; // 0x28(0x10)

	void Received_Notify(struct USkeletalMeshComponent** MeshComp); // Function Engine.AnimNotify.Received_Notify // Event|Public|BlueprintEvent|Const // @ game+0x2cd4ac
	void GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x65ca184
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x38)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate[0x08]; // 0x38(0x08)
	struct FVector LocationOffset[0x0c]; // 0x40(0x0c)
	struct FRotator RotationOffset[0x0c]; // 0x4c(0x0c)
	char pad_58[0x18]; // 0x58(0x18)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName[0x08]; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x30 (Inherited: 0x28)
struct UAnimNotifyState : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	float Received_NotifyBegin(); // Function Engine.AnimNotifyState.Received_NotifyBegin // Event|Public|BlueprintEvent|Const // @ game+0x2cd4ac
	void GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x65ca184
	void Received_NotifyTick(struct UAnimSequenceBase** Animation); // Function Engine.AnimNotifyState.Received_NotifyTick // Event|Public|BlueprintEvent|Const // @ game+0x2cd4ac
	struct UAnimSequenceBase* Received_NotifyEnd(); // Function Engine.AnimNotifyState.Received_NotifyEnd // Event|Public|BlueprintEvent|Const // @ game+0x2cd4ac
};

// Class Engine.DataTable
// Size: 0x80 (Inherited: 0x28)
struct UDataTable : UObject {
	struct UScriptStruct* *ead82841b2[0x08]; // 0x28(0x08)
	char pad_30[0x50]; // 0x30(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x448)
struct ACharacter : APawn {
	char bPressedJump : 1; // 0x448(0x01)
	char *4eb88c8a38 : 1; // 0x448(0x01)
	char *22d1b18b88 : 1; // 0x448(0x01)
	char *9dd8ada685 : 1; // 0x448(0x01)
	char *1cdec1f898 : 1; // 0x448(0x01)
	char *34ade2fed5 : 1; // 0x448(0x01)
	char *88e7d0a925 : 1; // 0x448(0x01)
	char *f60ec74df2 : 1; // 0x448(0x01)
	char bWasJumping : 1; // 0x449(0x01)
	char pad_449_1 : 7; // 0x449(0x01)
	char pad_44A[0x2]; // 0x44a(0x02)
	int32 JumpCurrentCount[0x04]; // 0x44c(0x04)
	float *1f829a81a5[0x04]; // 0x450(0x04)
	float JumpMaxHoldTime[0x04]; // 0x454(0x04)
	struct UCapsuleComponent* ProneCapsuleComponent[0x08]; // 0x458(0x08)
	bool *1d64cd16dd; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	float *fdceab32c3[0x04]; // 0x464(0x04)
	bool *47ce0f5314; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct UCharacterMovementComponent* CharacterMovement[0x08]; // 0x470(0x08)
	float JumpKeyHoldTime[0x04]; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct F*6e7b288381 *fde57a2c96[0x48]; // 0x480(0x48)
	char pad_4C8[0x8]; // 0x4c8(0x08)
	struct FQuat *e5f2932677[0x10]; // 0x4d0(0x10)
	float CrouchedEyeHeight[0x04]; // 0x4e0(0x04)
	char bIsCrouched : 1; // 0x4e4(0x01)
	char pad_4E4_1 : 7; // 0x4e4(0x01)
	char pad_4E5[0x3]; // 0x4e5(0x03)
	struct FVector *fa08663006[0x0c]; // 0x4e8(0x0c)
	char pad_4F4[0x4]; // 0x4f4(0x04)
	struct F*6e7b288381 *950fafca74[0x48]; // 0x4f8(0x48)
	struct UCapsuleComponent* CapsuleComponent[0x08]; // 0x540(0x08)
	int32 JumpMaxCount[0x04]; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct USkeletalMeshComponent* Mesh[0x08]; // 0x550(0x08)
	struct FMulticastDelegate OnReachedJumpApex[0x10]; // 0x558(0x10)
	char pad_568[0x10]; // 0x568(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate[0x10]; // 0x578(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated[0x10]; // 0x588(0x10)
	struct FRootMotionSourceGroup *795892ac52[0x100]; // 0x598(0x100)
	char pad_698[0x8]; // 0x698(0x08)
	struct F*77ba1cb021 *efe800db11[0x40]; // 0x6a0(0x40)
	struct TArray<struct F*bb18ec9648> *7b1f597c0d[0x10]; // 0x6e0(0x10)
	struct F*05d7763b32 *bec31ce030[0x160]; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	void *b23f868331(); // Function Engine.Character.*b23f868331 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5818354
	void K2_OnMovementModeChanged(enum class EMovementMode NewMovementMode); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	bool *540037a5a4(bool Param7); // Function Engine.Character.*540037a5a4 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x60d358
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0xd1ac78
	void *b4b8a67d69(); // Function Engine.Character.*b4b8a67d69 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6268
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x5881f50
	float *5ff84accd4(struct UPrimitiveComponent** Param3, bool Param5); // Function Engine.Character.*5ff84accd4 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0xc5cb14
	bool *c669440a6a(uint32* Param9); // Function Engine.Character.*c669440a6a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d6114
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x65cd14c
	void *5a940b9732(); // Function Engine.Character.*5a940b9732 // Native|Public|BlueprintCallable // @ game+0x65df2b0
	void Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x65c2c5c
	void ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x60e0b8
	void *836cb3ba33(struct FVector_NetQuantize10* Param1, bool Param3, uint32* Param5); // Function Engine.Character.*836cb3ba33 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d65dc
	void *bd798b0484(); // Function Engine.Character.*bd798b0484 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cce98
	void CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0xbd1154
	void *4aff9effe3(); // Function Engine.Character.*4aff9effe3 // Native|Public|BlueprintCallable // @ game+0x65defbc
	struct UPrimitiveComponent* *5e1e8b0a9d(struct FVector_NetQuantize10* Param1, struct FName* Param11); // Function Engine.Character.*5e1e8b0a9d // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d5b94
	void *c5401cd2d9(); // Function Engine.Character.*c5401cd2d9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c62b0
	float *5cc3a54e3d(struct UPrimitiveComponent** Param7, bool Param9); // Function Engine.Character.*5cc3a54e3d // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x65bf880
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x65d3208
	void K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct FVector OnWalkingOffLedge(); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xbed14c
	void *8e99d6a8ee(); // Function Engine.Character.*8e99d6a8ee // Final|Native|Public|BlueprintCallable // @ game+0x65c7a58
	void *af1cfdadf5(); // Function Engine.Character.*af1cfdadf5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5911910
	void *d79c49c550(); // Function Engine.Character.*d79c49c550 // Native|Public|BlueprintCallable // @ game+0x65dd0fc
	struct FVector *df1f1f38a8(); // Function Engine.Character.*df1f1f38a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65bea08
	void *918328595d(float* InPlayRate); // Function Engine.Character.*918328595d // Native|Public|BlueprintCallable // @ game+0x65d381c
	float K2_OnStartCrouch(); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	bool OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
	void OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x2cd4ac
	void *41035236aa(); // Function Engine.Character.*41035236aa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5911d68
	bool *cc71faddc9(); // Function Engine.Character.*cc71faddc9 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x65bf4ec
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x9c76c4
	void IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc4d4
	void *07fd890b66(); // Function Engine.Character.*07fd890b66 // Native|Public|BlueprintCallable // @ game+0x65df754
	void *53934c922e(); // Function Engine.Character.*53934c922e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cce74
	void K2_OnEndCrouch(float* HalfHeightAdjust); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *03d7ad404f(float* Param0); // Function Engine.Character.*03d7ad404f // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d6920
	void *5380e4b081(); // Function Engine.Character.*5380e4b081 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c60b8
	bool LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d26d0
	bool ServerMove(float* Param0, struct FVector_NetQuantize100* Param2, bool Param4); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d5218
	bool *3bfd75b1a3(struct FVector_NetQuantize10* Param1, uint32* Param3, struct FVector_NetQuantize10* Param5, bool Param7); // Function Engine.Character.*3bfd75b1a3 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d5614
	void CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65beddc
};

// Class Engine.Controller
// Size: 0x470 (Inherited: 0x3e8)
struct AController : AActor {
	char pad_3E8[0x18]; // 0x3e8(0x18)
	struct USceneComponent* TransformComponent[0x08]; // 0x400(0x08)
	char pad_408[0xc]; // 0x408(0x0c)
	struct FRotator *c58941edc9[0x0c]; // 0x414(0x0c)
	char pad_420[0x8]; // 0x420(0x08)
	struct ACharacter* Character[0x08]; // 0x428(0x08)
	char pad_430[0x10]; // 0x430(0x10)
	char *a4b6e8f562 : 1; // 0x440(0x01)
	char *e0bc488814 : 1; // 0x440(0x01)
	char pad_440_2 : 6; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct FName StateName[0x08]; // 0x448(0x08)
	struct APlayerState* PlayerState[0x08]; // 0x450(0x08)
	struct APawn* Pawn[0x08]; // 0x458(0x08)
	struct FMulticastDelegate OnInstigatedAnyDamage[0x10]; // 0x460(0x10)

	void *fe617afbe6(); // Function Engine.Controller.*fe617afbe6 // Native|Public|BlueprintCallable // @ game+0x65d4918
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x583cd98
	void Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x585ece8
	bool *08ab1c5256(struct AActor** Other); // Function Engine.Controller.*08ab1c5256 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65d2954
	void *5d83ffddec(); // Function Engine.Controller.*5d83ffddec // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccac4
	void *05bca2745b(); // Function Engine.Controller.*05bca2745b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbef4
	void *8da1de78a6(); // Function Engine.Controller.*8da1de78a6 // Native|Public|BlueprintCallable // @ game+0x65db2a4
	void GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c75a4
	void *25604da1d8(); // Function Engine.Controller.*25604da1d8 // Native|Public|BlueprintCallable // @ game+0x58abe1c
	struct FVector *047360b192(); // Function Engine.Controller.*047360b192 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x65c14b4
	void *dcb26b0e9a(); // Function Engine.Controller.*dcb26b0e9a // Native|Public|BlueprintCallable // @ game+0x586e5d4
	void *2e5b1c76bd(); // Function Engine.Controller.*2e5b1c76bd // Final|Native|Public|BlueprintCallable // @ game+0x65bf144
	void *12f9777c6b(); // Function Engine.Controller.*12f9777c6b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65da230
	void *2dd8068e51(); // Function Engine.Controller.*2dd8068e51 // Native|Public|BlueprintCallable // @ game+0x65d4900
	void *2c664b8b49(); // Function Engine.Controller.*2c664b8b49 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc980
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x65df2c8
	void *a51dacc819(); // Function Engine.Controller.*a51dacc819 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7b4c
	void *9955fb3f45(); // Function Engine.Controller.*9955fb3f45 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cca9c
	struct FRotator *32780b0e26(); // Function Engine.Controller.*32780b0e26 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0xacf898
	struct U*271a14efcc* ReceiveInstigatedAnyDamage(struct AActor** DamagedActor); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void *796d6f386f(); // Function Engine.Controller.*796d6f386f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccbd8
	void K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cff98
	void *7d0cb6afd9(); // Function Engine.Controller.*7d0cb6afd9 // Native|Public|BlueprintCallable // @ game+0x65df7ec
	void *3d893e1812(); // Function Engine.Controller.*3d893e1812 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cce58
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x580f068
};

// Class Engine.SpringArmComponent
// Size: 0x560 (Inherited: 0x4d0)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength[0x04]; // 0x4d0(0x04)
	struct FVector SocketOffset[0x0c]; // 0x4d4(0x0c)
	struct FVector TargetOffset[0x0c]; // 0x4e0(0x0c)
	float ProbeSize[0x04]; // 0x4ec(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	char bDoCollisionTest : 1; // 0x4f4(0x01)
	char bUsePawnControlRotation : 1; // 0x4f4(0x01)
	char bInheritPitch : 1; // 0x4f4(0x01)
	char bInheritYaw : 1; // 0x4f4(0x01)
	char bInheritRoll : 1; // 0x4f4(0x01)
	char bLockPitchLag : 1; // 0x4f4(0x01)
	char bLockYawLag : 1; // 0x4f4(0x01)
	char bLockRollLag : 1; // 0x4f4(0x01)
	char bEnableCameraLag : 1; // 0x4f5(0x01)
	char bEnableCameraRotationLag : 1; // 0x4f5(0x01)
	char bUseCameraLagSubstepping : 1; // 0x4f5(0x01)
	char bDrawDebugLagMarkers : 1; // 0x4f5(0x01)
	char pad_4F5_4 : 4; // 0x4f5(0x01)
	char pad_4F6[0x2]; // 0x4f6(0x02)
	float CameraLagSpeed[0x04]; // 0x4f8(0x04)
	float CameraRotationLagSpeed[0x04]; // 0x4fc(0x04)
	float CameraLagMaxTimeStep[0x04]; // 0x500(0x04)
	float CameraLagMaxDistance[0x04]; // 0x504(0x04)
	char pad_508[0x58]; // 0x508(0x58)
};

// Class Engine.PlayerController
// Size: 0x7a0 (Inherited: 0x470)
struct APlayerController : AController {
	struct UPlayer* Player[0x08]; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)
	struct APawn* *5355705fb6[0x08]; // 0x480(0x08)
	struct U*7f392fdd20* *53da961471[0x08]; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
	struct AHUD* *09f6cda326[0x08]; // 0x498(0x08)
	struct APlayerCameraManager* PlayerCameraManager[0x08]; // 0x4a0(0x08)
	struct UClass* PlayerCameraManagerClass[0x08]; // 0x4a8(0x08)
	bool *c935c04b6a; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	struct FRotator TargetViewRotation[0x0c]; // 0x4b4(0x0c)
	char pad_4C0[0xc]; // 0x4c0(0x0c)
	float SmoothTargetViewRotationSpeed[0x04]; // 0x4cc(0x04)
	struct TArray<struct AActor*> *62de05ec1f[0x10]; // 0x4d0(0x10)
	char pad_4E0[0x4]; // 0x4e0(0x04)
	float *7127c3b7ef[0x04]; // 0x4e4(0x04)
	struct FVector *1c94c6d466[0x0c]; // 0x4e8(0x0c)
	struct FRotator *104047d191[0x0c]; // 0x4f4(0x0c)
	int32 *0b2013c943[0x04]; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct UCheatManager* CheatManager[0x08]; // 0x508(0x08)
	struct UClass* CheatClass[0x08]; // 0x510(0x08)
	struct UPlayerInput* PlayerInput[0x08]; // 0x518(0x08)
	struct TArray<struct F*dfbef80de6> *6f0ea30984[0x10]; // 0x520(0x10)
	char pad_530[0x90]; // 0x530(0x90)
	char pad_5C0_0 : 3; // 0x5c0(0x01)
	char bPlayerIsWaiting : 1; // 0x5c0(0x01)
	char pad_5C0_4 : 4; // 0x5c0(0x01)
	char pad_5C1[0x3]; // 0x5c1(0x03)
	bool *348e8c60ad; // 0x5c4(0x01)
	char pad_5C5[0x3b]; // 0x5c5(0x3b)
	struct UNetConnection* *ef8b6622cb[0x08]; // 0x600(0x08)
	struct UNetConnection* NetConnection[0x08]; // 0x608(0x08)
	char pad_610[0xc]; // 0x610(0x0c)
	float InputYawScale[0x04]; // 0x61c(0x04)
	float InputPitchScale[0x04]; // 0x620(0x04)
	float InputRollScale[0x04]; // 0x624(0x04)
	char bShowMouseCursor : 1; // 0x628(0x01)
	char bEnableClickEvents : 1; // 0x628(0x01)
	char bEnableTouchEvents : 1; // 0x628(0x01)
	char bEnableMouseOverEvents : 1; // 0x628(0x01)
	char bEnableTouchOverEvents : 1; // 0x628(0x01)
	char bForceFeedbackEnabled : 1; // 0x628(0x01)
	char pad_628_6 : 2; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	struct TArray<struct FKey> ClickEventKeys[0x10]; // 0x630(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x640(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x641(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x642(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x643(0x01)
	float HitResultTraceDistance[0x04]; // 0x644(0x04)
	char pad_648[0x80]; // 0x648(0x80)
	struct U*4aa7f8d102* *3836f05d7e[0x08]; // 0x6c8(0x08)
	char pad_6D0_0 : 3; // 0x6d0(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6d0(0x01)
	char pad_6D0_4 : 4; // 0x6d0(0x01)
	char pad_6D1[0x17]; // 0x6d1(0x17)
	struct UTouchInterface* *8722c902fc[0x08]; // 0x6e8(0x08)
	char pad_6F0[0x40]; // 0x6f0(0x40)
	struct ASpectatorPawn* SpectatorPawn[0x08]; // 0x730(0x08)
	struct FVector SpawnLocation[0x0c]; // 0x738(0x0c)
	char pad_744[0x4]; // 0x744(0x04)
	bool *3375ec9f26; // 0x748(0x01)
	char pad_749[0x1]; // 0x749(0x01)
	uint16 *d9a44bb2ce[0x02]; // 0x74a(0x02)
	uint16 *31f30dbdc2[0x02]; // 0x74c(0x02)
	char pad_74E[0x2]; // 0x74e(0x02)
	struct AActor* *a15f7f3a93[0x08]; // 0x750(0x08)
	struct AActor* *7cf934aa32[0x08]; // 0x758(0x08)
	char pad_760[0x40]; // 0x760(0x40)

	void *b9986a0d77(); // Function Engine.PlayerController.*b9986a0d77 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d7478
	void *ca18aae7b1(); // Function Engine.PlayerController.*ca18aae7b1 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d51cc
	void ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x65c233c
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x65c2d28
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x65c4c48
	void *8828e60900(); // Function Engine.PlayerController.*8828e60900 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0f98
	void *6aa0cf84c3(); // Function Engine.PlayerController.*6aa0cf84c3 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d6be8
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x65d495c
	void *562fffde91(); // Function Engine.PlayerController.*562fffde91 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c15c0
	void ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6db4d4
	void *8b2a8ba05e(); // Function Engine.PlayerController.*8b2a8ba05e // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d6f00
	void *ccea1e8dcd(); // Function Engine.PlayerController.*ccea1e8dcd // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x65bfdac
	void *b9a5b90052(); // Function Engine.PlayerController.*b9a5b90052 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d6f4c
	float *7aff3172b7(); // Function Engine.PlayerController.*7aff3172b7 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x65c1120
	void *f341da3823(); // Function Engine.PlayerController.*f341da3823 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65bfd94
	void Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x65beca0
	enum class ECameraAnimPlaySpace *7efee3e988(); // Function Engine.PlayerController.*7efee3e988 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x60d9fc
	struct FVector2D *64e09ff94c(bool bPlayerViewportRelative); // Function Engine.PlayerController.*64e09ff94c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65d4234
	void *109ed542bf(); // Function Engine.PlayerController.*109ed542bf // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65bfd64
	struct FName *5cb6d00d4d(); // Function Engine.PlayerController.*5cb6d00d4d // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c00ec
	void *09b6a398ff(); // Function Engine.PlayerController.*09b6a398ff // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x65c1784
	void *6cfe3183e5(); // Function Engine.PlayerController.*6cfe3183e5 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xdd86dc
	void *eaa37b6d9f(); // Function Engine.PlayerController.*eaa37b6d9f // Final|Native|Public|BlueprintCallable // @ game+0x65df218
	struct FHitResult *11cd5a1cd2(); // Function Engine.PlayerController.*11cd5a1cd2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8100
	float *3229537f4b(enum class *ab22144e19 BlendFunc); // Function Engine.PlayerController.*3229537f4b // Native|Public|BlueprintCallable // @ game+0x65de048
	void *61ab21bf09(); // Function Engine.PlayerController.*61ab21bf09 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8a78
	struct FHitResult *7d402319f6(); // Function Engine.PlayerController.*7d402319f6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7f90
	void *0b5b086a5a(); // Function Engine.PlayerController.*0b5b086a5a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d75bc
	void ServerUpdateLevelVisibility(struct FName* Param0); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xbf1b4c
	void *aa5dd0a8e7(); // Function Engine.PlayerController.*aa5dd0a8e7 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c12f8
	void *9a1480ca0e(); // Function Engine.PlayerController.*9a1480ca0e // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcbfa28
	struct FHitResult *b891a072c6(); // Function Engine.PlayerController.*b891a072c6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7e20
	void *c6b3360e80(struct FKey* Key); // Function Engine.PlayerController.*c6b3360e80 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9610
	void SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x65df3f0
	float *0c46468f00(); // Function Engine.PlayerController.*0c46468f00 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x65bf3a8
	void *223c7f5c7b(); // Function Engine.PlayerController.*223c7f5c7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xde04d0
	void *22f1694b2b(bool bInCinematicMode, bool bAffectsHUD); // Function Engine.PlayerController.*22f1694b2b // Native|Public|BlueprintCallable // @ game+0x65d990c
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x65cc2c4
	void *ca36ac1db5(); // Function Engine.PlayerController.*ca36ac1db5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c1044
	void *4444f6dc2e(enum class ECollisionChannel TraceChannel, struct FHitResult* HitResult); // Function Engine.PlayerController.*4444f6dc2e // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c82b8
	struct FVector DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c2ed4
	void AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x65be2d0
	void *45a7bb797b(); // Function Engine.PlayerController.*45a7bb797b // Native|Public|BlueprintCallable // @ game+0x65bc640
	void *cff048ac18(); // Function Engine.PlayerController.*cff048ac18 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d4fe4
	struct FVector_NetQuantize ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d734c
	float *4feca51654(); // Function Engine.PlayerController.*4feca51654 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8b6c
	void *a7dc80b0cb(); // Function Engine.PlayerController.*a7dc80b0cb // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65d337c
	void *91e5ce2a61(struct FVector* RotationRate); // Function Engine.PlayerController.*91e5ce2a61 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c908c
	void *f595309bb8(); // Function Engine.PlayerController.*f595309bb8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcd82b4
	void ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x65df580
	void *128ad6584b(); // Function Engine.PlayerController.*128ad6584b // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x65bfd7c
	void *7d9f70de59(); // Function Engine.PlayerController.*7d9f70de59 // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x65d6f98
	void *87d4bd0ed1(); // Function Engine.PlayerController.*87d4bd0ed1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c1830
	void *1bf2c0fa15(); // Function Engine.PlayerController.*1bf2c0fa15 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65bfe2c
	struct FKey *b46560c95f(); // Function Engine.PlayerController.*b46560c95f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8f98
	void *9333fe086e(enum class EControllerHand Hand); // Function Engine.PlayerController.*9333fe086e // Final|Native|Public|BlueprintCallable // @ game+0x65d3ff0
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x5882380
	void *054ae698aa(); // Function Engine.PlayerController.*054ae698aa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5908f20
	void *0a767a728b(); // Function Engine.PlayerController.*0a767a728b // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d7608
	void *527867814b(); // Function Engine.PlayerController.*527867814b // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xcb2ff4
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x65d3414
	float *f42971a4a8(); // Function Engine.PlayerController.*f42971a4a8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c138c
	void *d34ced269f(); // Function Engine.PlayerController.*d34ced269f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d71ec
	void *d32f54be22(); // Function Engine.PlayerController.*d32f54be22 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d7654
	void *488be087b5(struct AActor** Param0); // Function Engine.PlayerController.*488be087b5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65bfe44
	void *bdb5e8e311(); // Function Engine.PlayerController.*bdb5e8e311 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65bff28
	void *3bd9a426f4(); // Function Engine.PlayerController.*3bd9a426f4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c210c
	void ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0fb0
	void *ca6345be4e(); // Function Engine.PlayerController.*ca6345be4e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0054
	void *bcb4c91970(); // Function Engine.PlayerController.*bcb4c91970 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65bffbc
	struct AActor* *bc7ee5fe98(); // Function Engine.PlayerController.*bc7ee5fe98 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c1658
	float *31dade5ead(float* ScreenY, struct FVector* WorldDirection); // Function Engine.PlayerController.*31dade5ead // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c2fdc
	void *3f9771d56c(); // Function Engine.PlayerController.*3f9771d56c // Net|NetReliableNative|Event|Public|NetClient // @ game+0xddfeec
	void *ac56631480(); // Function Engine.PlayerController.*ac56631480 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d6a88
	void LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x65d2a98
	void *a1c104b477(); // Function Engine.PlayerController.*a1c104b477 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d5098
	void *04dcc60588(struct UForceFeedbackEffect** ForceFeedbackEffect); // Function Engine.PlayerController.*04dcc60588 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x65c19a8
	void FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x65c4e68
	void *085d1b29e4(); // Function Engine.PlayerController.*085d1b29e4 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d7570
	float *7ee32fbf1d(); // Function Engine.PlayerController.*7ee32fbf1d // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9e0c
	void *e155e1afc0(float* Frequency, float* Amplitude); // Function Engine.PlayerController.*e155e1afc0 // Final|Native|Public|BlueprintCallable // @ game+0x65db080
	struct APlayerState* *7efa7d97f8(); // Function Engine.PlayerController.*7efa7d97f8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0d3c
	void *121dfd5443(struct FKey* Key); // Function Engine.PlayerController.*121dfd5443 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65df9ac
	void *bd26ba1bdf(struct FKey* Key); // Function Engine.PlayerController.*bd26ba1bdf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65dfaa0
	void *1c6382db08(); // Function Engine.PlayerController.*1c6382db08 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7cf0
	bool *81cd11cd3f(); // Function Engine.PlayerController.*81cd11cd3f // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6a94ac
	void *94bb7e21d2(); // Function Engine.PlayerController.*94bb7e21d2 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d71a0
	void AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x65bde8c
	void *2bffd3dab0(); // Function Engine.PlayerController.*2bffd3dab0 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x65d5180
	struct UClass* *ab766b338c(); // Function Engine.PlayerController.*ab766b338c // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x65c18c4
	void *bbef2bccc4(struct FString* Param0, bool Param2); // Function Engine.PlayerController.*bbef2bccc4 // Final|Native|Public|HasDefaults // @ game+0x65c1c44
	void *81a50ace3a(int32* SizeX); // Function Engine.PlayerController.*81a50ace3a // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbf1c
	void *11160db8c7(); // Function Engine.PlayerController.*11160db8c7 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c1818
	float *b0e0e5c0d2(float* BlendInTime, bool bLoop, enum class ECameraAnimPlaySpace Space); // Function Engine.PlayerController.*b0e0e5c0d2 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x65c0370
	int32 *fd0afdf5cf(); // Function Engine.PlayerController.*fd0afdf5cf // Final|Native|Public|BlueprintCallable // @ game+0x65dc0c8
	float *b8942aeaa0(); // Function Engine.PlayerController.*b8942aeaa0 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9358
	void *50182b7bf6(); // Function Engine.PlayerController.*50182b7bf6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb560
	void SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x65d4f20
	float *bdfb436ed1(); // Function Engine.PlayerController.*bdfb436ed1 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9254
	void AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x65be6f8
	void *dc76996ac2(); // Function Engine.PlayerController.*dc76996ac2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c1ff0
	void SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x65dc318
	void *0a4900b11d(); // Function Engine.PlayerController.*0a4900b11d // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c1108
	void *16e7b3d651(); // Function Engine.PlayerController.*16e7b3d651 // Native|Public|BlueprintCallable // @ game+0x65de210
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x5874fb0
	void *2263f81ded(enum class *ae68ab384e Param1); // Function Engine.PlayerController.*2263f81ded // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x65c1e18
	struct FHitResult *246c55ff62(); // Function Engine.PlayerController.*246c55ff62 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8618
	void *6e76f35baa(); // Function Engine.PlayerController.*6e76f35baa // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x65d70e0
	void *79d2f47e0a(); // Function Engine.PlayerController.*79d2f47e0a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc9a8
	void *1000a8c5db(); // Function Engine.PlayerController.*1000a8c5db // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0f04
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x58af250
	struct FName *e351dac2e0(); // Function Engine.PlayerController.*e351dac2e0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c1a88
	void *5f3e718776(); // Function Engine.PlayerController.*5f3e718776 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65da2a4
	float *bfa37ce532(); // Function Engine.PlayerController.*bfa37ce532 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8cb4
	bool *ccb0abfa15(); // Function Engine.PlayerController.*ccb0abfa15 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0bb0
	void *25613f28fc(struct FName* Param0); // Function Engine.PlayerController.*25613f28fc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0a78
	struct FHitResult *7e6c398dc3(); // Function Engine.PlayerController.*7e6c398dc3 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c8468
	float *83351c4d17(float* Duration, bool bAffectsLeftSmall, bool bAffectsRightSmall); // Function Engine.PlayerController.*83351c4d17 // Final|Native|Public|BlueprintCallable // @ game+0x65d3ce4
	struct FVector *1c20c798e9(); // Function Engine.PlayerController.*1c20c798e9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d836c
	void *61c1973156(); // Function Engine.PlayerController.*61c1973156 // Final|Native|Public|BlueprintCallable // @ game+0x65bf338
	void *d3c7c3f095(bool bLooping); // Function Engine.PlayerController.*d3c7c3f095 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x65c069c
	bool *e1ee59f3bc(); // Function Engine.PlayerController.*e1ee59f3bc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x724908
	void *beec12a508(); // Function Engine.PlayerController.*beec12a508 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0xa36eec
	void *dcb445d84f(struct USoundBase** Param0); // Function Engine.PlayerController.*dcb445d84f // Net|Native|Event|Public|NetClient // @ game+0x65c07d0
	float *370ce3ebac(struct USoundBase** Param0); // Function Engine.PlayerController.*370ce3ebac // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x65c08f4
	void StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x65debec
	void *056bb0b803(); // Function Engine.PlayerController.*056bb0b803 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c21c8
	void *e2fc8aa029(); // Function Engine.PlayerController.*e2fc8aa029 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x65c0254
};

// Class Engine.Info
// Size: 0x3e8 (Inherited: 0x3e8)
struct AInfo : AActor {
};

// Class Engine.GameModeBase
// Size: 0x488 (Inherited: 0x3e8)
struct AGameModeBase : AInfo {
	struct FString OptionsString[0x10]; // 0x3e8(0x10)
	struct UClass* GameSessionClass[0x08]; // 0x3f8(0x08)
	struct UClass* GameStateClass[0x08]; // 0x400(0x08)
	struct UClass* PlayerControllerClass[0x08]; // 0x408(0x08)
	struct UClass* PlayerStateClass[0x08]; // 0x410(0x08)
	struct FStringClassReference HUDClass[0x10]; // 0x418(0x10)
	struct UClass* DefaultPawnClass[0x08]; // 0x428(0x08)
	struct FStringClassReference SpectatorClass[0x10]; // 0x430(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass[0x08]; // 0x440(0x08)
	struct AGameSession* GameSession[0x08]; // 0x448(0x08)
	struct AGameStateBase* GameState[0x08]; // 0x450(0x08)
	struct FText *638604ca81[0x18]; // 0x458(0x18)
	char bUseSeamlessTravel : 1; // 0x470(0x01)
	char bStartPlayersAsSpectators : 1; // 0x470(0x01)
	char bPauseable : 1; // 0x470(0x01)
	char pad_470_3 : 5; // 0x470(0x01)
	char pad_471[0x17]; // 0x471(0x17)

	struct AController* RestartPlayerAtTransform(); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65d4b84
	void *e97d812c21(); // Function Engine.GameModeBase.*e97d812c21 // Native|Public|BlueprintCallable // @ game+0xa94e5c
	void *58faa59de5(); // Function Engine.GameModeBase.*58faa59de5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58ab078
	void SpawnDefaultPawnFor(struct AActor** StartSpot); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xcb17e0
	void K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct FString K2_OnChangeName(); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x65d4a10
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xbce874
	void *1d6a714d9c(); // Function Engine.GameModeBase.*1d6a714d9c // Native|Public|BlueprintCallable // @ game+0x65ca3c0
	struct AController* RestartPlayerAtPlayerStart(); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x65d4aa4
	void FindPlayerStart(struct FString* IncomingName); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xc66768
	void K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	struct APlayerState* CanSpectate(); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x65bee00
	void InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xdb2118
	void *95ac877b57(struct AController** Player); // Function Engine.GameModeBase.*95ac877b57 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65cfae8
	void *8a2f9ba8dd(); // Function Engine.GameModeBase.*8a2f9ba8dd // Native|Public|BlueprintCallable // @ game+0x65ca2dc
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x5911a38
	void HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0xb7bee4
	void ChoosePlayerStart(); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xcb7c88
	void ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x65d4528
	struct APlayerController* MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xca49c0
	struct APlayerController* K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void PlayerCanRestart(struct APlayerController** Player); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0xb7be24
	void InitStartSpot(struct AActor** StartSpot); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xda5024
	struct FString *3577785442(); // Function Engine.GameModeBase.*3577785442 // Native|Public|BlueprintCallable // @ game+0x65bf1d4
	void K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void SpawnDefaultPawnAtTransform(struct AController** NewPlayer); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xd001f0
	struct AController* GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xcd3350
};

// Class Engine.GameMode
// Size: 0x4c8 (Inherited: 0x488)
struct AGameMode : AGameModeBase {
	struct FName *59acc54cb2[0x08]; // 0x488(0x08)
	char bDelayedStart : 1; // 0x490(0x01)
	char pad_490_1 : 7; // 0x490(0x01)
	char pad_491[0x3]; // 0x491(0x03)
	int32 NumSpectators[0x04]; // 0x494(0x04)
	int32 NumPlayers[0x04]; // 0x498(0x04)
	int32 NumBots[0x04]; // 0x49c(0x04)
	float MinRespawnDelay[0x04]; // 0x4a0(0x04)
	int32 NumTravellingPlayers[0x04]; // 0x4a4(0x04)
	struct UClass* *aa08ae227e[0x08]; // 0x4a8(0x08)
	struct TArray<struct APlayerState*> *ea842fe704[0x10]; // 0x4b0(0x10)
	float *40f6dab750[0x04]; // 0x4c0(0x04)
	bool bHandleDedicatedServerReplays; // 0x4c4(0x01)
	char pad_4C5[0x3]; // 0x4c5(0x03)

	void *a7a9250f62(); // Function Engine.GameMode.*a7a9250f62 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc088
	void *73ab7fb69b(); // Function Engine.GameMode.*73ab7fb69b // Native|Public|BlueprintCallable // @ game+0x65c4e3c
	void K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0xb67268
	void *97d9a6b98e(); // Function Engine.GameMode.*97d9a6b98e // Native|Public|BlueprintCallable // @ game+0x65d4944
	void *f826cabf6b(); // Function Engine.GameMode.*f826cabf6b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ccb08
	void ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xd0bab0
	void *d7b5e87aef(); // Function Engine.GameMode.*d7b5e87aef // Native|Public|BlueprintCallable // @ game+0x58aa0dc
	void Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x65d4d48
	void *b8de88dd31(); // Function Engine.GameMode.*b8de88dd31 // Native|Public|BlueprintCallable // @ game+0x65bc5f0
	void *9ecd3b7aa4(); // Function Engine.GameMode.*9ecd3b7aa4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9a3c
	void SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x65d8a30
};

// Class Engine.PlayerState
// Size: 0x478 (Inherited: 0x3e8)
struct APlayerState : AInfo {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	int32 PlayerId[0x04]; // 0x3f0(0x04)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	struct UClass* *aa08ae227e[0x08]; // 0x3f8(0x08)
	struct FString PlayerName[0x10]; // 0x400(0x10)
	bool Ping; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	int32 StartTime[0x04]; // 0x414(0x04)
	struct FUniqueNetIdRepl UniqueId[0x18]; // 0x418(0x18)
	struct FString *fef21e2df7[0x10]; // 0x430(0x10)
	char pad_440[0x4]; // 0x440(0x04)
	char bIsSpectator : 1; // 0x444(0x01)
	char *b94898b1bc : 1; // 0x444(0x01)
	char bIsABot : 1; // 0x444(0x01)
	char pad_444_3 : 1; // 0x444(0x01)
	char *9a7d67065f : 1; // 0x444(0x01)
	char *50f72176d9 : 1; // 0x444(0x01)
	char pad_444_6 : 2; // 0x444(0x01)
	char pad_445[0x13]; // 0x445(0x13)
	float Score[0x04]; // 0x458(0x04)
	char pad_45C[0x18]; // 0x45c(0x18)
	bool *d43bf3f659; // 0x474(0x01)
	char pad_475[0x3]; // 0x475(0x03)

	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x5907f08
	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0x5823324
	void ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x58ce3b4
	void ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x5907f20
};

// Class Engine.SkeletalMeshActor
// Size: 0x470 (Inherited: 0x3e8)
struct ASkeletalMeshActor : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	char bShouldDoAnimNotifies : 1; // 0x3f0(0x01)
	char bWakeOnLevelStart : 1; // 0x3f0(0x01)
	char pad_3F0_2 : 6; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent[0x08]; // 0x3f8(0x08)
	struct USkeletalMesh* *573ace7b5a[0x08]; // 0x400(0x08)
	struct UPhysicsAsset* *12e34c7fa2[0x08]; // 0x408(0x08)
	struct UMaterialInterface* *4da1d1f3fd[0x08]; // 0x410(0x08)
	struct UMaterialInterface* *77466e8dca[0x08]; // 0x418(0x08)
	char pad_420[0x50]; // 0x420(0x50)

	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x58ce3b4
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0x5823324
	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x5907f08
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x5907f20
};

// Class Engine.DestructibleComponent
// Size: 0xd60 (Inherited: 0xca0)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc98(0x01)
	struct TArray<struct F*53a1c74b57> FractureEffects[0x10]; // 0xca0(0x10)
	bool bEnableHardSleeping; // 0xcb0(0x01)
	char pad_CB1_1 : 7; // 0xcb1(0x01)
	char pad_CB2[0x2]; // 0xcb2(0x02)
	float LargeChunkThreshold[0x04]; // 0xcb4(0x04)
	char pad_CB8[0x10]; // 0xcb8(0x10)
	struct FMulticastDelegate OnComponentFracture[0x10]; // 0xcc8(0x10)
	char pad_CD8[0x88]; // 0xcd8(0x88)

	void *89d8555bbf(struct FVector* HurtOrigin, float* ImpulseStrength); // Function Engine.DestructibleComponent.*89d8555bbf // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e71d8
	struct FVector *b96360052d(); // Function Engine.DestructibleComponent.*b96360052d // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e5fdc
	void *247917c7eb(); // Function Engine.DestructibleComponent.*247917c7eb // Final|Native|Public|BlueprintCallable // @ game+0x6625890
	void *efeced8efa(); // Function Engine.DestructibleComponent.*efeced8efa // Final|Native|Public|BlueprintCallable // @ game+0x65fefc4
};

// Class Engine.SaveGame
// Size: 0x28 (Inherited: 0x28)
struct USaveGame : UObject {
};

// Class Engine.*18316965f0
// Size: 0xa20 (Inherited: 0xa00)
struct U*18316965f0 : UPrimitiveComponent {
	struct FColor ShapeColor[0x04]; // 0x9f8(0x04)
	struct UBodySetup* *2847596841[0x08]; // 0xa00(0x08)
	char *2cbfa4e18b : 1; // 0xa08(0x01)
	char *15d93fcb44 : 1; // 0xa08(0x01)
	char *27dd7eb1bd : 1; // 0xa08(0x01)
	char pad_A0C_3 : 5; // 0xa0c(0x01)
	char pad_A0D[0x3]; // 0xa0d(0x03)
	struct UClass* AreaClass[0x08]; // 0xa10(0x08)
	char pad_A18[0x8]; // 0xa18(0x08)
};

// Class Engine.TargetPoint
// Size: 0x3e8 (Inherited: 0x3e8)
struct ATargetPoint : AActor {
};

// Class Engine.GameStateBase
// Size: 0x428 (Inherited: 0x3e8)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass[0x08]; // 0x3e8(0x08)
	struct AGameModeBase* AuthorityGameMode[0x08]; // 0x3f0(0x08)
	struct UClass* SpectatorClass[0x08]; // 0x3f8(0x08)
	struct TArray<struct APlayerState*> PlayerArray[0x10]; // 0x400(0x10)
	bool *8642766d5b; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float *b9ef543610[0x04]; // 0x414(0x04)
	float *9c9ecdea9a[0x04]; // 0x418(0x04)
	float *f4a4fb2240[0x04]; // 0x41c(0x04)
	char pad_420[0x8]; // 0x420(0x08)

	void *6971957481(struct AController** Controller); // Function Engine.GameStateBase.*6971957481 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cafb8
	void *8432ff603b(); // Function Engine.GameStateBase.*8432ff603b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581d400
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0x58d14fc
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0x583cd44
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0xb125a8
	void *880a119fd9(); // Function Engine.GameStateBase.*880a119fd9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9d5c
	void *05f73d26c1(); // Function Engine.GameStateBase.*05f73d26c1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc060
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xbce874
	void *e6ac5dc660(); // Function Engine.GameStateBase.*e6ac5dc660 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58a7ec8
	void *fae00bc477(struct AController** Controller); // Function Engine.GameStateBase.*fae00bc477 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65caf10
	void *58faa59de5(); // Function Engine.GameStateBase.*58faa59de5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc0b0
};

// Class Engine.GameState
// Size: 0x448 (Inherited: 0x428)
struct AGameState : AGameStateBase {
	struct FName MatchState[0x08]; // 0x428(0x08)
	struct FName PreviousMatchState[0x08]; // 0x430(0x08)
	int32 ElapsedTime[0x04]; // 0x438(0x04)
	char pad_43C[0xc]; // 0x43c(0x0c)

	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x5875394
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0xa94e5c
};

// Class Engine.BoxComponent
// Size: 0xa30 (Inherited: 0xa20)
struct UBoxComponent : U*18316965f0 {
	struct FVector BoxExtent[0x0c]; // 0xa18(0x0c)
	char pad_A2C[0x4]; // 0xa2c(0x04)

	void *e2d2b6102b(); // Function Engine.BoxComponent.*e2d2b6102b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66079ec
	void *375f6933d7(); // Function Engine.BoxComponent.*375f6933d7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x660563c
	void *4b28c59cdc(); // Function Engine.BoxComponent.*4b28c59cdc // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66236dc
};

// Class Engine.ProjectileMovementComponent
// Size: 0x300 (Inherited: 0x240)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed[0x04]; // 0x238(0x04)
	float MaxSpeed[0x04]; // 0x23c(0x04)
	char bRotationFollowsVelocity : 1; // 0x240(0x01)
	char bShouldBounce : 1; // 0x240(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x240(0x01)
	char bForceSubStepping : 1; // 0x240(0x01)
	char bSimulationEnabled : 1; // 0x240(0x01)
	char bSweepCollision : 1; // 0x240(0x01)
	char bIsHomingProjectile : 1; // 0x240(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x240(0x01)
	char bIsSliding : 1; // 0x241(0x01)
	char bInterpMovement : 1; // 0x241(0x01)
	char bInterpRotation : 1; // 0x241(0x01)
	float PreviousHitTime[0x04]; // 0x244(0x04)
	struct FVector PreviousHitNormal[0x0c]; // 0x248(0x0c)
	float ProjectileGravityScale[0x04]; // 0x254(0x04)
	float *1aff06e174[0x04]; // 0x258(0x04)
	float Bounciness[0x04]; // 0x25c(0x04)
	float Friction[0x04]; // 0x260(0x04)
	float BounceVelocityStopSimulatingThreshold[0x04]; // 0x264(0x04)
	float MinFrictionFraction[0x04]; // 0x268(0x04)
	struct FMulticastDelegate OnProjectileBounce[0x10]; // 0x270(0x10)
	struct FMulticastDelegate OnProjectileStop[0x10]; // 0x280(0x10)
	float HomingAccelerationMagnitude[0x04]; // 0x290(0x04)
	struct USceneComponent* HomingTargetComponent[0x08]; // 0x294(0x08)
	float MaxSimulationTimeStep[0x04]; // 0x29c(0x04)
	int32 MaxSimulationIterations[0x04]; // 0x2a0(0x04)
	int32 BounceAdditionalIterations[0x04]; // 0x2a4(0x04)
	float InterpLocationTime[0x04]; // 0x2a8(0x04)
	float InterpRotationTime[0x04]; // 0x2ac(0x04)
	float InterpLocationMaxLagDistance[0x04]; // 0x2b0(0x04)
	float InterpLocationSnapToTargetDistance[0x04]; // 0x2b4(0x04)
	char pad_2B9[0x47]; // 0x2b9(0x47)

	void OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x2cd4ac
	void *c41aa9c805(); // Function Engine.ProjectileMovementComponent.*c41aa9c805 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660beb4
	struct FVector *544ce7c588(); // Function Engine.ProjectileMovementComponent.*544ce7c588 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6616f10
	void StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6637390
	void LimitVelocity(struct FVector* NewVelocity); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x660f388
	void *c4dbbca7a5(); // Function Engine.ProjectileMovementComponent.*c4dbbca7a5 // Native|Public|BlueprintCallable // @ game+0x587b83c
	void *65ea89a3fb(); // Function Engine.ProjectileMovementComponent.*65ea89a3fb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660c950
	void *6998c735d5(); // Function Engine.ProjectileMovementComponent.*6998c735d5 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x662f950
	struct FHitResult OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x2cd4ac
	void *fa0688bcbd(); // Function Engine.ProjectileMovementComponent.*fa0688bcbd // Native|Public|BlueprintCallable // @ game+0x6628da0
};

// Class Engine.CurveBase
// Size: 0x30 (Inherited: 0x28)
struct UCurveBase : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	float *b1bcc037e3(); // Function Engine.CurveBase.*b1bcc037e3 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65cbd18
	void *684cbb9b81(float* MinTime); // Function Engine.CurveBase.*684cbb9b81 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb860
};

// Class Engine.GameUserSettings
// Size: 0x110 (Inherited: 0x28)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x28(0x01)
	bool bUseDynamicResolution; // 0x29(0x01)
	char pad_2A[0x4e]; // 0x2a(0x4e)
	uint32 ResolutionSizeX[0x04]; // 0x78(0x04)
	uint32 ResolutionSizeY[0x04]; // 0x7c(0x04)
	uint32 LastUserConfirmedResolutionSizeX[0x04]; // 0x80(0x04)
	uint32 LastUserConfirmedResolutionSizeY[0x04]; // 0x84(0x04)
	int32 WindowPosX[0x04]; // 0x88(0x04)
	int32 WindowPosY[0x04]; // 0x8c(0x04)
	int32 FullscreenMode[0x04]; // 0x90(0x04)
	int32 LastConfirmedFullscreenMode[0x04]; // 0x94(0x04)
	int32 PreferredFullscreenMode[0x04]; // 0x98(0x04)
	uint32 Version[0x04]; // 0x9c(0x04)
	int32 AudioQualityLevel[0x04]; // 0xa0(0x04)
	float FrameRateLimit[0x04]; // 0xa4(0x04)
	char pad_A8[0x4]; // 0xa8(0x04)
	int32 DesiredScreenWidth[0x04]; // 0xac(0x04)
	bool bUseDesiredScreenHeight; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	int32 DesiredScreenHeight[0x04]; // 0xb4(0x04)
	float LastRecommendedScreenWidth[0x04]; // 0xb8(0x04)
	float LastRecommendedScreenHeight[0x04]; // 0xbc(0x04)
	float LastCPUBenchmarkResult[0x04]; // 0xc0(0x04)
	float LastGPUBenchmarkResult[0x04]; // 0xc4(0x04)
	struct TArray<float> LastCPUBenchmarkSteps[0x10]; // 0xc8(0x10)
	struct TArray<float> LastGPUBenchmarkSteps[0x10]; // 0xd8(0x10)
	float LastGPUBenchmarkMultiplier[0x04]; // 0xe8(0x04)
	bool bUseHDRDisplayOutput; // 0xec(0x01)
	char pad_ED[0x3]; // 0xed(0x03)
	int32 HDRDisplayOutputNits[0x04]; // 0xf0(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xf4(0x01)
	bool bGPUDebug; // 0xf5(0x01)
	char pad_F6[0x2]; // 0xf6(0x02)
	struct FDateTime GPUDebugActiveDateTime[0x08]; // 0xf8(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate[0x10]; // 0x100(0x10)

	void LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x6648750
	void *8965889365(); // Function Engine.GameUserSettings.*8965889365 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x664b1d0
	void *35bd157cef(); // Function Engine.GameUserSettings.*35bd157cef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664d150
	void *bcb8f08616(); // Function Engine.GameUserSettings.*bcb8f08616 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x664c654
	void *7a8928fa14(); // Function Engine.GameUserSettings.*7a8928fa14 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x664a6b4
	void *821eaa3a9c(); // Function Engine.GameUserSettings.*821eaa3a9c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664acbc
	void *877cecaacd(); // Function Engine.GameUserSettings.*877cecaacd // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x664a700
	void *b317a49994(); // Function Engine.GameUserSettings.*b317a49994 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664c670
	void *c3c793a1af(); // Function Engine.GameUserSettings.*c3c793a1af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664bc58
	int32 GetResolutionScaleInformation(); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x664c27c
	void *a913e4d760(); // Function Engine.GameUserSettings.*a913e4d760 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664d66c
	void *c1f35611fa(); // Function Engine.GameUserSettings.*c1f35611fa // Final|Native|Public|BlueprintCallable // @ game+0x6654740
	void *1af20eacd3(); // Function Engine.GameUserSettings.*1af20eacd3 // Final|Native|Public|BlueprintCallable // @ game+0x6653a90
	void *83b979d1ed(); // Function Engine.GameUserSettings.*83b979d1ed // Final|Native|Public|BlueprintCallable // @ game+0x6648ad4
	void *0e4dc47720(); // Function Engine.GameUserSettings.*0e4dc47720 // Final|Native|Public|BlueprintCallable // @ game+0x58b340c
	void *a4c56a10e8(); // Function Engine.GameUserSettings.*a4c56a10e8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664a26c
	void *e003595b99(); // Function Engine.GameUserSettings.*e003595b99 // Native|Public|BlueprintCallable // @ game+0x6079ae8
	void *39acf58d60(float* CurrentScaleValue); // Function Engine.GameUserSettings.*39acf58d60 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x664c474
	void *b1719dcbd3(); // Function Engine.GameUserSettings.*b1719dcbd3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6655544
	void *1f9b042806(); // Function Engine.GameUserSettings.*1f9b042806 // Final|Native|Public|BlueprintCallable // @ game+0x6653f5c
	void *70c5a018bc(); // Function Engine.GameUserSettings.*70c5a018bc // Native|Public|BlueprintCallable // @ game+0xb1e1e4
	void *19d9f88411(); // Function Engine.GameUserSettings.*19d9f88411 // Native|Public|BlueprintCallable // @ game+0x6653cf8
	void *c5db66ecf0(); // Function Engine.GameUserSettings.*c5db66ecf0 // Final|Native|Public|BlueprintCallable // @ game+0x6653708
	void *fb3ecc5f8a(); // Function Engine.GameUserSettings.*fb3ecc5f8a // Final|Native|Static|Public|BlueprintCallable // @ game+0xc91d1c
	void *01750178be(); // Function Engine.GameUserSettings.*01750178be // Final|Native|Public|BlueprintCallable // @ game+0x66538d0
	void *253ceb23cd(); // Function Engine.GameUserSettings.*253ceb23cd // Final|Native|Public|BlueprintCallable // @ game+0x6653794
	void *2b0d9d2a79(); // Function Engine.GameUserSettings.*2b0d9d2a79 // Native|Public|BlueprintCallable // @ game+0x664a6d4
	float *2762cf8a23(); // Function Engine.GameUserSettings.*2762cf8a23 // Native|Public|BlueprintCallable // @ game+0x6653598
	void *7c9471f86f(); // Function Engine.GameUserSettings.*7c9471f86f // Native|Public|BlueprintCallable // @ game+0x58b8ff8
	void *462455abf2(); // Function Engine.GameUserSettings.*462455abf2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664a498
	void *8fb8bbfe8c(); // Function Engine.GameUserSettings.*8fb8bbfe8c // Final|Native|Public|BlueprintCallable // @ game+0x6654520
	void SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x6653ec8
	void *18aa570765(); // Function Engine.GameUserSettings.*18aa570765 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6654168
	void *cbbc450a67(); // Function Engine.GameUserSettings.*cbbc450a67 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664d634
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x58dcf7c
	void *98fe66b47d(); // Function Engine.GameUserSettings.*98fe66b47d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664bc44
	void *c2ac335ef2(); // Function Engine.GameUserSettings.*c2ac335ef2 // Native|Public|BlueprintCallable // @ game+0x66545ac
	void *1417bc70d8(); // Function Engine.GameUserSettings.*1417bc70d8 // Final|Native|Public|BlueprintCallable // @ game+0x66545c4
	void *4bfc82e40c(); // Function Engine.GameUserSettings.*4bfc82e40c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664a258
	void *0ea0655862(); // Function Engine.GameUserSettings.*0ea0655862 // Final|Native|Public|BlueprintCallable // @ game+0x66541f4
	void *6f801f756b(); // Function Engine.GameUserSettings.*6f801f756b // Final|Native|Public|BlueprintCallable // @ game+0x6653d8c
	void *96792ea9be(); // Function Engine.GameUserSettings.*96792ea9be // Native|Public|BlueprintCallable // @ game+0x664c16c
	void *30d98f1383(); // Function Engine.GameUserSettings.*30d98f1383 // Native|Public|BlueprintCallable // @ game+0x6641f40
	void *f52b5d8c43(); // Function Engine.GameUserSettings.*f52b5d8c43 // Final|Native|Public|BlueprintCallable // @ game+0x6641f58
	void *f7e8ffca10(); // Function Engine.GameUserSettings.*f7e8ffca10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664d648
	void *9d1ceffc6e(); // Function Engine.GameUserSettings.*9d1ceffc6e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664acd4
	void *09cbb06d9b(); // Function Engine.GameUserSettings.*09cbb06d9b // Native|Public|BlueprintCallable // @ game+0x58b8f48
	void *abd7b80fbb(); // Function Engine.GameUserSettings.*abd7b80fbb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664db98
	void *d9253d9e28(); // Function Engine.GameUserSettings.*d9253d9e28 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x664a718
	void *3a4644ef87(); // Function Engine.GameUserSettings.*3a4644ef87 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664db74
	void *0d786d6dde(); // Function Engine.GameUserSettings.*0d786d6dde // Final|Native|Public|BlueprintCallable // @ game+0x6645a5c
	void *c52ab52f73(); // Function Engine.GameUserSettings.*c52ab52f73 // Final|Native|Static|Public|BlueprintCallable // @ game+0x664add4
	void *04b3937605(); // Function Engine.GameUserSettings.*04b3937605 // Final|Native|Public|BlueprintCallable // @ game+0x6653820
	void *bb4ea235c8(); // Function Engine.GameUserSettings.*bb4ea235c8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664d610
	void *ef9cfc0dd7(); // Function Engine.GameUserSettings.*ef9cfc0dd7 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xaca7dc
	void *e4deeee6a7(); // Function Engine.GameUserSettings.*e4deeee6a7 // Final|Native|Public|BlueprintCallable // @ game+0x6653e18
	void *d3b2ed12c4(); // Function Engine.GameUserSettings.*d3b2ed12c4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664db30
	void *ff43f20d88(); // Function Engine.GameUserSettings.*ff43f20d88 // Final|Native|Public|BlueprintCallable // @ game+0x665395c
	void *948dbc9289(); // Function Engine.GameUserSettings.*948dbc9289 // Final|Native|Public|BlueprintCallable // @ game+0x665302c
	void *e27f582866(); // Function Engine.GameUserSettings.*e27f582866 // Final|Native|Public|BlueprintCallable // @ game+0x66539f8
	void *311788f411(); // Function Engine.GameUserSettings.*311788f411 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664b6d0
	void *44533d5b92(); // Function Engine.GameUserSettings.*44533d5b92 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664d13c
	void *679f5c0b66(); // Function Engine.GameUserSettings.*679f5c0b66 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664b1ac
	void *3e2e37d8ce(); // Function Engine.GameUserSettings.*3e2e37d8ce // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664aca8
	void *25f609df00(); // Function Engine.GameUserSettings.*25f609df00 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58ccc9c
	void *209c135f63(); // Function Engine.GameUserSettings.*209c135f63 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x664cdf8
};

// Class Engine.GameInstance
// Size: 0x1f0 (Inherited: 0x28)
struct UGameInstance : UObject {
	char pad_28[0x18]; // 0x28(0x18)
	struct U*ff4b8fbd53* *ff4b8fbd53[0x08]; // 0x40(0x08)
	char pad_48[0xa8]; // 0x48(0xa8)
	struct U*07115daa65* *07115daa65[0x08]; // 0xf0(0x08)
	char pad_F8[0x8]; // 0xf8(0x08)
	struct FMulticastDelegate OnKillcamLoadingFinished[0x10]; // 0x100(0x10)
	char pad_110[0xe0]; // 0x110(0xe0)

	void DebugCreatePlayer(); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x65f4bf0
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x2cd4ac
	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x65f4c84
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	enum class ENetworkFailure HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class Engine.TriggerBase
// Size: 0x3f0 (Inherited: 0x3e8)
struct ATriggerBase : AActor {
	struct U*18316965f0* CollisionComponent[0x08]; // 0x3e8(0x08)
};

// Class Engine.TriggerBox
// Size: 0x3f0 (Inherited: 0x3f0)
struct ATriggerBox : ATriggerBase {
};

// Class Engine.CapsuleComponent
// Size: 0xa30 (Inherited: 0xa20)
struct UCapsuleComponent : U*18316965f0 {
	float CapsuleHalfHeight[0x04]; // 0xa18(0x04)
	float CapsuleRadius[0x04]; // 0xa1c(0x04)
	float CapsuleHeight[0x04]; // 0xa20(0x04)
	char pad_A2C[0x4]; // 0xa2c(0x04)

	void *8581b57d25(); // Function Engine.CapsuleComponent.*8581b57d25 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6605738
	void *22d813c561(float* Radius); // Function Engine.CapsuleComponent.*22d813c561 // Final|Native|Public|BlueprintCallable // @ game+0x6623a88
	void *9c532adaa0(); // Function Engine.CapsuleComponent.*9c532adaa0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6607a50
	float *31f97e3a3d(); // Function Engine.CapsuleComponent.*31f97e3a3d // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6607b70
	void *0733f827b9(); // Function Engine.CapsuleComponent.*0733f827b9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6607a14
	void *8a4d91c968(); // Function Engine.CapsuleComponent.*8a4d91c968 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6605784
	void *7b5e58ae13(); // Function Engine.CapsuleComponent.*7b5e58ae13 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66056e4
	void *b69a96696e(); // Function Engine.CapsuleComponent.*b69a96696e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6605698
	void *ab5f12a9c7(float* OutRadius); // Function Engine.CapsuleComponent.*ab5f12a9c7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6607a68
	void *980989f2cc(); // Function Engine.CapsuleComponent.*980989f2cc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6605aec
	void *3292c0b7df(); // Function Engine.CapsuleComponent.*3292c0b7df // Native|Public|BlueprintCallable // @ game+0x65d9b94
	void *194972df68(); // Function Engine.CapsuleComponent.*194972df68 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6607a2c
	void *e5ffb56c9a(); // Function Engine.CapsuleComponent.*e5ffb56c9a // Native|Public|BlueprintCallable // @ game+0x65d9c28
	void *21a20b6c62(enum class ECollisionChannel Channel); // Function Engine.CapsuleComponent.*21a20b6c62 // Native|Public|BlueprintCallable // @ game+0x65d9cc0
	float *3b43bcc845(); // Function Engine.CapsuleComponent.*3b43bcc845 // Final|Native|Public|BlueprintCallable // @ game+0x6623b74
	float *39a2e64c25(); // Function Engine.CapsuleComponent.*39a2e64c25 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66058b8
	void *190066363c(float* HalfHeight); // Function Engine.CapsuleComponent.*190066363c // Final|Native|Public|BlueprintCallable // @ game+0x66238f0
};

// Class Engine.PhysicsVolume
// Size: 0x438 (Inherited: 0x420)
struct APhysicsVolume : AVolume {
	float TerminalVelocity[0x04]; // 0x420(0x04)
	int32 Priority[0x04]; // 0x424(0x04)
	float FluidFriction[0x04]; // 0x428(0x04)
	char bWaterVolume : 1; // 0x42c(0x01)
	char bPhysicsOnContact : 1; // 0x42c(0x01)
	char pad_42C_2 : 6; // 0x42c(0x01)
	char pad_42D[0x3]; // 0x42d(0x03)
	bool *1c6bffdd5f; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x7f0 (Inherited: 0x7a0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7a0(0x01)
	char *b3d628f82e : 1; // 0x7a0(0x01)
	char pad_7A0_2 : 6; // 0x7a0(0x01)
	char pad_7A1[0x7]; // 0x7a1(0x07)
	struct U*4d37f15df7* *42bf489806[0x08]; // 0x7a8(0x08)
	char pad_7B0[0x20]; // 0x7b0(0x20)
	float SpeedScale[0x04]; // 0x7d0(0x04)
	float InitialMaxSpeed[0x04]; // 0x7d4(0x04)
	float InitialAccel[0x04]; // 0x7d8(0x04)
	float InitialDecel[0x04]; // 0x7dc(0x04)
	char pad_7E0[0x10]; // 0x7e0(0x10)

	void *662fc7afd6(); // Function Engine.DebugCameraController.*662fc7afd6 // Final|Native|Public|BlueprintCallable // @ game+0x65dc680
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x58844dc
	void *f8260a0915(); // Function Engine.DebugCameraController.*f8260a0915 // Final|Native|Public|BlueprintCallable // @ game+0x65df51c
	void *b3cfc5896b(); // Function Engine.DebugCameraController.*b3cfc5896b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cb170
	void ReceiveOnActorSelected(struct FVector* SelectHitLocation); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
	void ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class Engine.Channel
// Size: 0x68 (Inherited: 0x28)
struct UChannel : UObject {
	struct UNetConnection* Connection[0x08]; // 0x28(0x08)
	char pad_30[0x38]; // 0x30(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x68)
struct UActorChannel : UChannel {
	struct AActor* Actor[0x08]; // 0x68(0x08)
	char pad_70[0x300]; // 0x70(0x300)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	char pad_370[0x20]; // 0x370(0x20)
};

// Class Engine.NavigationObjectBase
// Size: 0x410 (Inherited: 0x3e8)
struct ANavigationObjectBase : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct UCapsuleComponent* CapsuleComponent[0x08]; // 0x3f0(0x08)
	struct UBillboardComponent* *b6f12a9063[0x08]; // 0x3f8(0x08)
	struct UBillboardComponent* *a948621fe9[0x08]; // 0x400(0x08)
	char *e5dc707706 : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
};

// Class Engine.PlayerStart
// Size: 0x418 (Inherited: 0x410)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag[0x08]; // 0x410(0x08)
};

// Class Engine.CheatManager
// Size: 0x78 (Inherited: 0x28)
struct UCheatManager : UObject {
	struct ADebugCameraController* *d00d1e9c98[0x08]; // 0x28(0x08)
	struct UClass* DebugCameraControllerClass[0x08]; // 0x30(0x08)
	char pad_38[0x40]; // 0x38(0x40)

	void DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x5f8e95c
	struct FString BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x6643d54
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x58dcf94
	void ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x6656b90
	void DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x664852c
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x6656c54
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x585eab4
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x6652890
	void DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x66483e0
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x664d5a4
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x6648900
	void *b86a954d75(); // Function Engine.CheatManager.*b86a954d75 // Native|Protected|BlueprintCallable // @ game+0xcbaad4
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x58dcf3c
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x6e6bbc
	void SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x6653c60
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x65df4b4
	void StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x6655130
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0x58b8f48
	void OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6652100
	void DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x66486a4
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x6656330
	void DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x6648494
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x65cf72c
	void FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x664a0c8
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x6652680
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x6648738
	void *94bb7e21d2(); // Function Engine.CheatManager.*94bb7e21d2 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66536bc
	void *2d2ff9b3aa(); // Function Engine.CheatManager.*2d2ff9b3aa // Native|Protected|BlueprintCallable // @ game+0x66489c8
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x6648930
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x6650c78
	void ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x6656afc
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0xbfb42c
	void ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x6645640
	void BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x6643a74
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x66547cc
	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x58dcf7c
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x6656318
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x6653c4c
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x665556c
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x664a0b0
	void Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x6655480
	void CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x66456dc
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x664847c
	void Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x6654b98
	float DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x66485c4
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x58dcefc
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x6648918
	void ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x6656a68
	void StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x66551c4
	float BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x6643b38
};

// Class Engine.*1dc0463579
// Size: 0xa10 (Inherited: 0xa00)
struct U*1dc0463579 : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links[0x10]; // 0xa00(0x10)
};

// Class Engine.NavArea
// Size: 0x40 (Inherited: 0x28)
struct UNavArea : UObject {
	float DefaultCost[0x04]; // 0x28(0x04)
	float FixedAreaEnteringCost[0x04]; // 0x2c(0x04)
	struct FColor DrawColor[0x04]; // 0x30(0x04)
	struct FNavAgentSelector SupportedAgents[0x04]; // 0x34(0x04)
	char bSupportsAgent0 : 1; // 0x38(0x01)
	char bSupportsAgent1 : 1; // 0x38(0x01)
	char bSupportsAgent2 : 1; // 0x38(0x01)
	char bSupportsAgent3 : 1; // 0x38(0x01)
	char bSupportsAgent4 : 1; // 0x38(0x01)
	char bSupportsAgent5 : 1; // 0x38(0x01)
	char bSupportsAgent6 : 1; // 0x38(0x01)
	char bSupportsAgent7 : 1; // 0x38(0x01)
	char bSupportsAgent8 : 1; // 0x39(0x01)
	char bSupportsAgent9 : 1; // 0x39(0x01)
	char bSupportsAgent10 : 1; // 0x39(0x01)
	char bSupportsAgent11 : 1; // 0x39(0x01)
	char bSupportsAgent12 : 1; // 0x39(0x01)
	char bSupportsAgent13 : 1; // 0x39(0x01)
	char bSupportsAgent14 : 1; // 0x39(0x01)
	char bSupportsAgent15 : 1; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x3f0 (Inherited: 0x3e8)
struct ALevelScriptActor : AActor {
	char *73f286284f : 1; // 0x3e8(0x01)
	char pad_3E8_1 : 7; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)

	bool *22f1694b2b(); // Function Engine.LevelScriptActor.*22f1694b2b // Native|Public|BlueprintCallable // @ game+0x7267ac
	struct FName *9b041afb0b(); // Function Engine.LevelScriptActor.*9b041afb0b // Native|Public|BlueprintCallable // @ game+0x58e323c
	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void WorldOriginLocationChanged(struct FIntVector* OldOriginLocation); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
};

// Class Engine.ChildActorComponent
// Size: 0x500 (Inherited: 0x4d0)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass[0x08]; // 0x4d0(0x08)
	struct AActor* ChildActor[0x08]; // 0x4d8(0x08)
	struct AActor* ChildActorTemplate[0x08]; // 0x4e0(0x08)
	char pad_4E8[0x18]; // 0x4e8(0x18)

	void *ce4ff9f46d(); // Function Engine.ChildActorComponent.*ce4ff9f46d // Final|Native|Public|BlueprintCallable // @ game+0x65d987c
};

// Class Engine.CameraComponent
// Size: 0xac0 (Inherited: 0x4d0)
struct UCameraComponent : USceneComponent {
	float FieldOfView[0x04]; // 0x4d0(0x04)
	float OrthoWidth[0x04]; // 0x4d4(0x04)
	float OrthoNearClipPlane[0x04]; // 0x4d8(0x04)
	float OrthoFarClipPlane[0x04]; // 0x4dc(0x04)
	float AspectRatio[0x04]; // 0x4e0(0x04)
	char bConstrainAspectRatio : 1; // 0x4e4(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x4e4(0x01)
	char bLockToHmd : 1; // 0x4e4(0x01)
	char bUsePawnControlRotation : 1; // 0x4e4(0x01)
	char pad_4E4_4 : 4; // 0x4e4(0x01)
	char pad_4E5[0x3]; // 0x4e5(0x03)
	enum class ECameraProjectionMode ProjectionMode; // 0x4e8(0x01)
	char pad_4E9[0x3]; // 0x4e9(0x03)
	float PostProcessBlendWeight[0x04]; // 0x4ec(0x04)
	struct FPostProcessSettings PostProcessSettings[0x570]; // 0x4f0(0x570)
	char pad_A60[0x58]; // 0xa60(0x58)
	char bUseControllerViewRotation : 1; // 0xab8(0x01)
	char pad_AB8_1 : 7; // 0xab8(0x01)
	char pad_AB9[0x7]; // 0xab9(0x07)

	void *51ae0236f3(); // Function Engine.CameraComponent.*51ae0236f3 // Final|Native|Public|BlueprintCallable // @ game+0x6622108
	void *e8609babef(); // Function Engine.CameraComponent.*e8609babef // Final|Native|Public|BlueprintCallable // @ game+0x662b1fc
	void *da2c35fd6a(); // Function Engine.CameraComponent.*da2c35fd6a // Final|Native|Public|BlueprintCallable // @ game+0x662c030
	void *f9e81d2a53(); // Function Engine.CameraComponent.*f9e81d2a53 // Final|Native|Public|BlueprintCallable // @ game+0x662bca4
	void *246cb05f09(); // Function Engine.CameraComponent.*246cb05f09 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x65fda24
	void *cb101c76b1(); // Function Engine.CameraComponent.*cb101c76b1 // Final|Native|Public|BlueprintCallable // @ game+0x662f408
	void *44f5458990(); // Function Engine.CameraComponent.*44f5458990 // Final|Native|Public|BlueprintCallable // @ game+0x662b164
	TScriptInterface<struct UBlendableInterface> *8480288ca6(); // Function Engine.CameraComponent.*8480288ca6 // Final|Native|Public|BlueprintCallable // @ game+0x65e4cfc
	void *f96592d2aa(); // Function Engine.CameraComponent.*f96592d2aa // Final|Native|Public|BlueprintCallable // @ game+0x6626f78
	void *5bc288c41d(); // Function Engine.CameraComponent.*5bc288c41d // Final|Native|Public|BlueprintCallable // @ game+0x6624924
	void *f01ddbe3ef(); // Function Engine.CameraComponent.*f01ddbe3ef // Final|Native|Public|BlueprintCallable // @ game+0x6628be0
};

// Class Engine.Engine
// Size: 0xf50 (Inherited: 0x28)
struct UEngine : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct UFont* TinyFont[0x08]; // 0x30(0x08)
	struct FStringAssetReference TinyFontName[0x10]; // 0x38(0x10)
	struct UFont* SmallFont[0x08]; // 0x48(0x08)
	struct FStringAssetReference SmallFontName[0x10]; // 0x50(0x10)
	struct UFont* *43105ceb99[0x08]; // 0x60(0x08)
	struct FStringAssetReference MediumFontName[0x10]; // 0x68(0x10)
	struct UFont* LargeFont[0x08]; // 0x78(0x08)
	struct FStringAssetReference LargeFontName[0x10]; // 0x80(0x10)
	struct UFont* *529be18812[0x08]; // 0x90(0x08)
	struct FStringAssetReference SubtitleFontName[0x10]; // 0x98(0x10)
	struct TArray<struct UFont*> *df25b95969[0x10]; // 0xa8(0x10)
	struct UTexture2D* *2dbaebc744[0x08]; // 0xb8(0x08)
	struct UClass* *174a7c81db[0x08]; // 0xc0(0x08)
	struct UMaterialInstanceDynamic* *2119402b4a[0x08]; // 0xc8(0x08)
	struct UTexture2D* MiniFontTexture[0x08]; // 0xd0(0x08)
	struct UMaterial* WireframeMaterial[0x08]; // 0xd8(0x08)
	float MinDesiredFrameRate[0x04]; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct FStringClassReference AIControllerClassName[0x10]; // 0xe8(0x10)
	struct FString *5e1c88c287[0x10]; // 0xf8(0x10)
	struct UClass* *86fb8d6a19[0x08]; // 0x108(0x08)
	struct UMaterial* *dd5db1982c[0x08]; // 0x110(0x08)
	struct FStringClassReference GameUserSettingsClassName[0x10]; // 0x118(0x10)
	struct TArray<struct FLinearColor> HLODColorationColors[0x10]; // 0x128(0x10)
	struct UTexture* DefaultDiffuseTexture[0x08]; // 0x138(0x08)
	struct UClass* *6ab1c3b78a[0x08]; // 0x140(0x08)
	struct FColor *30bc7575f3[0x04]; // 0x148(0x04)
	struct FColor *c1f4779d2d[0x04]; // 0x14c(0x04)
	struct UClass* *c79d88195f[0x08]; // 0x150(0x08)
	float *25fcb3b672[0x04]; // 0x158(0x04)
	float FixedFrameRate[0x04]; // 0x15c(0x04)
	struct FStringAssetReference DefaultBloomKernelTextureName[0x10]; // 0x160(0x10)
	struct UTexture2D* *e051d30398[0x08]; // 0x170(0x08)
	struct FStringAssetReference ArrowMaterialName[0x10]; // 0x178(0x10)
	struct FString ShadedLevelColorationUnlitMaterialName[0x10]; // 0x188(0x10)
	struct FStringAssetReference DefaultPhysMaterialName[0x10]; // 0x198(0x10)
	char bRenderLightMapDensityGrayscale : 1; // 0x1a8(0x01)
	char pad_1A8_1 : 7; // 0x1a8(0x01)
	char pad_1A9[0x7]; // 0x1a9(0x07)
	struct TArray<struct F*ce85c43b15> ActivePluginRedirects[0x10]; // 0x1b0(0x10)
	struct FLinearColor LightMapDensitySelectedColor[0x10]; // 0x1c0(0x10)
	char bSubtitlesForcedOff : 1; // 0x1d0(0x01)
	char pad_1D0_1 : 7; // 0x1d0(0x01)
	char pad_1D1[0x7]; // 0x1d1(0x07)
	struct UMaterialInstanceDynamic* *5459d9699e[0x08]; // 0x1d8(0x08)
	struct FColor *8778089533[0x04]; // 0x1e0(0x04)
	struct FFloatRange SmoothedFrameRateRange[0x10]; // 0x1e4(0x10)
	struct FColor *50e4ab95e6[0x04]; // 0x1f4(0x04)
	char bHardwareSurveyEnabled : 1; // 0x1f8(0x01)
	char pad_1F8_1 : 7; // 0x1f8(0x01)
	char pad_1F9[0x7]; // 0x1f9(0x07)
	struct FStringClassReference DefaultBlueprintBaseClassName[0x10]; // 0x200(0x10)
	struct TArray<struct F*a72ab554af> ActiveStructRedirects[0x10]; // 0x210(0x10)
	char bSubtitlesEnabled : 1; // 0x220(0x01)
	char pad_220_1 : 7; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)
	struct FStringClassReference LocalPlayerClassName[0x10]; // 0x228(0x10)
	struct UMaterial* DebugMeshMaterial[0x08]; // 0x238(0x08)
	struct UTexture2D* *16c3f7b8ed[0x08]; // 0x240(0x08)
	struct TArray<struct FLinearColor> StreamingAccuracyColors[0x10]; // 0x248(0x10)
	struct UMaterial* *1f9f176dd8[0x08]; // 0x258(0x08)
	struct FColor *c944d746ad[0x04]; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct FStringClassReference LevelScriptActorClassName[0x10]; // 0x268(0x10)
	float MaxES2PixelShaderAdditiveComplexityCount[0x04]; // 0x278(0x04)
	int32 *1b556eb405[0x04]; // 0x27c(0x04)
	struct FStringAssetReference RemoveSurfaceMaterialName[0x10]; // 0x280(0x10)
	float RenderLightMapDensityColorScale[0x04]; // 0x290(0x04)
	struct FColor *feb2694aca[0x04]; // 0x294(0x04)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName[0x10]; // 0x298(0x10)
	struct TArray<struct FString> *bae10a5147[0x10]; // 0x2a8(0x10)
	char pad_2B8[0x18]; // 0x2b8(0x18)
	struct FStringClassReference AvoidanceManagerClassName[0x10]; // 0x2d0(0x10)
	struct FString LightingTexelDensityName[0x10]; // 0x2e0(0x10)
	struct FString LevelColorationUnlitMaterialName[0x10]; // 0x2f0(0x10)
	struct UMaterial* LevelColorationLitMaterial[0x08]; // 0x300(0x08)
	struct FStringAssetReference DefaultDiffuseTextureName[0x10]; // 0x308(0x10)
	struct FStringClassReference AssetManagerClassName[0x10]; // 0x318(0x10)
	float MaxOcclusionPixelsFraction[0x04]; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct FStringAssetReference HighFrequencyNoiseTextureName[0x10]; // 0x330(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors[0x10]; // 0x340(0x10)
	struct UClass* *fe1481b5c8[0x08]; // 0x350(0x08)
	struct UTexture* WeightMapPlaceholderTexture[0x08]; // 0x358(0x08)
	struct UAssetManager* AssetManager[0x08]; // 0x360(0x08)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x368(0x01)
	char pad_368_1 : 7; // 0x368(0x01)
	char pad_369[0x3]; // 0x369(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame[0x04]; // 0x36c(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x370(0x01)
	char pad_370_1 : 7; // 0x370(0x01)
	char pad_371[0x7]; // 0x371(0x07)
	struct UTexture2D* DefaultTexture[0x08]; // 0x378(0x08)
	struct FLinearColor LightingOnlyBrightness[0x10]; // 0x380(0x10)
	struct FLinearColor LightingOnlySpecular[0x10]; // 0x390(0x10)
	struct UMaterial* *e68fc694c0[0x08]; // 0x3a0(0x08)
	struct FLinearColor LightMapDensityVertexMappedColor[0x10]; // 0x3a8(0x10)
	struct UMaterial* *85c25c83f5[0x08]; // 0x3b8(0x08)
	char bCanBlueprintsTickByDefault : 1; // 0x3c0(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x3c0(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x3c0(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x3c0(0x01)
	char pad_3C0_4 : 1; // 0x3c0(0x01)
	char bSmoothFrameRate : 1; // 0x3c0(0x01)
	char bUseFixedFrameRate : 1; // 0x3c0(0x01)
	char pad_3C0_7 : 1; // 0x3c0(0x01)
	char pad_3C1[0x7]; // 0x3c1(0x07)
	struct FString VertexColorViewModeMaterialName_ColorOnly[0x10]; // 0x3c8(0x10)
	struct UMaterial* VertexColorMaterial[0x08]; // 0x3d8(0x08)
	struct UPhysicalMaterial* DefaultPhysMaterial[0x08]; // 0x3e0(0x08)
	struct FString *89fb77e73a[0x10]; // 0x3e8(0x10)
	struct TArray<struct FString> AdditionalFontNames[0x10]; // 0x3f8(0x10)
	struct FStringClassReference PhysicsCollisionHandlerClassName[0x10]; // 0x408(0x10)
	char bAllowMatureLanguage : 1; // 0x418(0x01)
	char pad_418_1 : 7; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float CameraRotationThreshold[0x04]; // 0x41c(0x04)
	char pad_420[0x50]; // 0x420(0x50)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors[0x10]; // 0x470(0x10)
	struct TArray<struct FLinearColor> LODColorationColors[0x10]; // 0x480(0x10)
	struct FColor *891c4f69de[0x04]; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)
	struct UMaterial* *46fcb09c9b[0x08]; // 0x498(0x08)
	struct FStringAssetReference MiniFontTextureName[0x10]; // 0x4a0(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial[0x08]; // 0x4b0(0x08)
	struct UClass* *36300cd617[0x08]; // 0x4b8(0x08)
	float IdealLightMapDensity[0x04]; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct TArray<struct F*6b88783d53> ActiveGameNameRedirects[0x10]; // 0x4c8(0x10)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName[0x10]; // 0x4d8(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors[0x10]; // 0x4e8(0x10)
	struct UMaterial* *31885943df[0x08]; // 0x4f8(0x08)
	struct FStringAssetReference DefaultBSPVertexTextureName[0x10]; // 0x500(0x10)
	struct FString VertexColorViewModeMaterialName_RedOnly[0x10]; // 0x510(0x10)
	struct FStringAssetReference DebugMeshMaterialName[0x10]; // 0x520(0x10)
	enum class *a483700a66 *3c98a1a7dd; // 0x530(0x01)
	char pad_531[0x7]; // 0x531(0x07)
	struct UTexture2D* *98f6787349[0x08]; // 0x538(0x08)
	struct UClass* *2d50dcfa17[0x08]; // 0x540(0x08)
	struct TArray<struct FLinearColor> ShaderComplexityColors[0x10]; // 0x548(0x10)
	struct UMaterial* LevelColorationUnlitMaterial[0x08]; // 0x558(0x08)
	float NetClientTicksPerSecond[0x04]; // 0x560(0x04)
	int32 *a344514e05[0x04]; // 0x564(0x04)
	struct FStringAssetReference DefaultTextureName[0x10]; // 0x568(0x10)
	struct UGameViewportClient* GameViewport[0x08]; // 0x578(0x08)
	float RenderLightMapDensityGrayscaleScale[0x04]; // 0x580(0x04)
	char pad_584[0x4]; // 0x584(0x04)
	struct FStringClassReference NavigationSystemClassName[0x10]; // 0x588(0x10)
	int32 *83ecc6816b[0x04]; // 0x598(0x04)
	float MeshLODRange[0x04]; // 0x59c(0x04)
	struct UMaterial* *ba4b02b533[0x08]; // 0x5a0(0x08)
	struct FStringClassReference WorldSettingsClassName[0x10]; // 0x5a8(0x10)
	struct FStringAssetReference WeightMapPlaceholderTextureName[0x10]; // 0x5b8(0x10)
	struct FString WireframeMaterialName[0x10]; // 0x5c8(0x10)
	struct UMaterialInstanceDynamic* *498d4ec4e1[0x08]; // 0x5d8(0x08)
	struct UClass* *9cf85956b5[0x08]; // 0x5e0(0x08)
	struct UMaterial* *22bea6dbb2[0x08]; // 0x5e8(0x08)
	struct FStringClassReference GameViewportClientClassName[0x10]; // 0x5f0(0x10)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName[0x10]; // 0x600(0x10)
	struct UGameUserSettings* GameUserSettings[0x08]; // 0x610(0x08)
	struct UTextureCube* *019d032e90[0x08]; // 0x618(0x08)
	float CameraTranslationThreshold[0x04]; // 0x620(0x04)
	char pad_624[0x4]; // 0x624(0x04)
	struct UTexture2D* *6487bfa9fa[0x08]; // 0x628(0x08)
	struct FColor *c7c24b22f6[0x04]; // 0x630(0x04)
	float NearClipPlane[0x04]; // 0x634(0x04)
	struct TArray<struct F*73d1c21239> StatColorMappings[0x10]; // 0x638(0x10)
	struct FString ShadedLevelColorationLitMaterialName[0x10]; // 0x648(0x10)
	struct FStringAssetReference LightMapDensityTextureName[0x10]; // 0x658(0x10)
	struct FColor *192e526923[0x04]; // 0x668(0x04)
	struct FColor *7011171afe[0x04]; // 0x66c(0x04)
	float MinLightMapDensity[0x04]; // 0x670(0x04)
	char pad_674[0x4]; // 0x674(0x04)
	struct UMaterial* RemoveSurfaceMaterial[0x08]; // 0x678(0x08)
	int32 MaxParticleResizeWarn[0x04]; // 0x680(0x04)
	struct F*28687cc503 PhysicErrorCorrection[0x1c]; // 0x684(0x1c)
	struct UMaterial* *62fa611f80[0x08]; // 0x6a0(0x08)
	float MaxLightMapDensity[0x04]; // 0x6a8(0x04)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	struct FStringClassReference ConsoleClassName[0x10]; // 0x6b0(0x10)
	struct TArray<struct F*2f5df3d7dc> ActiveClassRedirects[0x10]; // 0x6c0(0x10)
	struct UObject* *efb601c0d7[0x08]; // 0x6d0(0x08)
	char pad_6D8[0x8]; // 0x6d8(0x08)
	struct FLinearColor DefaultSelectedMaterialColor[0x10]; // 0x6e0(0x10)
	struct FLinearColor *71a3192718[0x10]; // 0x6f0(0x10)
	struct FLinearColor *d45033e7a6[0x10]; // 0x700(0x10)
	struct FLinearColor *ffccd8fd1b[0x10]; // 0x710(0x10)
	struct FLinearColor *ca5c8cbcd4[0x10]; // 0x720(0x10)
	bool *793423ca81; // 0x730(0x01)
	char pad_731[0x3]; // 0x731(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x734(0x01)
	char *ddd8bea2f1 : 1; // 0x734(0x01)
	char bSuppressMapWarnings : 1; // 0x734(0x01)
	char bDisableAILogging : 1; // 0x734(0x01)
	char pad_734_4 : 4; // 0x734(0x01)
	char pad_735[0x3]; // 0x735(0x03)
	uint32 bEnableVisualLogRecordingOnStart[0x04]; // 0x738(0x04)
	struct FBox *fa997dc2ce[0x1c]; // 0x73c(0x1c)
	char pad_758[0x4]; // 0x758(0x04)
	int32 *a4ea644295[0x04]; // 0x75c(0x04)
	char *5f4234ebf6 : 1; // 0x760(0x01)
	char pad_760_1 : 7; // 0x760(0x01)
	char pad_761[0x7]; // 0x761(0x07)
	struct FString ParticleEventManagerClassPath[0x10]; // 0x768(0x10)
	char pad_778[0x28]; // 0x778(0x28)
	float SelectionHighlightIntensity[0x04]; // 0x7a0(0x04)
	float *4ad7031367[0x04]; // 0x7a4(0x04)
	float BSPSelectionHighlightIntensity[0x04]; // 0x7a8(0x04)
	float HoverHighlightIntensity[0x04]; // 0x7ac(0x04)
	float *c96df757a0[0x04]; // 0x7b0(0x04)
	float PrimitiveBaseIntensity[0x04]; // 0x7b4(0x04)
	float PrimitiveSelectedIntensity[0x04]; // 0x7b8(0x04)
	float PrimitiveHoverIntensity[0x04]; // 0x7bc(0x04)
	char pad_7C0[0x290]; // 0x7c0(0x290)
	struct UMaterial* *167d4506be[0x08]; // 0xa50(0x08)
	struct FColor *4709a765b0[0x04]; // 0xa58(0x04)
	char pad_A5C[0x4]; // 0xa5c(0x04)
	struct FString LevelColorationLitMaterialName[0x10]; // 0xa60(0x10)
	struct UMaterial* *c6ef933beb[0x08]; // 0xa70(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor[0x10]; // 0xa78(0x10)
	float PrimitiveProbablyVisibleTime[0x04]; // 0xa88(0x04)
	char pad_A8C[0x4]; // 0xa8c(0x04)
	struct FString VertexColorViewModeMaterialName_BlueOnly[0x10]; // 0xa90(0x10)
	struct FColor *0edfcd2d1b[0x04]; // 0xaa0(0x04)
	char pad_AA4[0x1dc]; // 0xaa4(0x1dc)
	struct TArray<struct F*e13e3afa12> NetDriverDefinitions[0x10]; // 0xc80(0x10)
	struct TArray<struct FString> ServerActors[0x10]; // 0xc90(0x10)
	struct TArray<struct FString> *585229a891[0x10]; // 0xca0(0x10)
	char *07609786a3 : 1; // 0xcb0(0x01)
	char pad_CB0_1 : 7; // 0xcb0(0x01)
	char pad_CB1[0x7]; // 0xcb1(0x07)
	struct UTexture2D* *c594b99558[0x08]; // 0xcb8(0x08)
	struct TArray<struct F*7c4552fed2> *74257aa68c[0x10]; // 0xcc0(0x10)
	int32 MaximumLoopIterationCount[0x04]; // 0xcd0(0x04)
	char pad_CD4[0x4]; // 0xcd4(0x04)
	struct FStringAssetReference DefaultBokehTextureName[0x10]; // 0xcd8(0x10)
	char bPauseOnLossOfFocus : 1; // 0xce8(0x01)
	char pad_CE8_1 : 7; // 0xce8(0x01)
	char pad_CE9[0x3]; // 0xce9(0x03)
	int32 MaxParticleResize[0x04]; // 0xcec(0x04)
	float MaxPixelShaderAdditiveComplexityCount[0x04]; // 0xcf0(0x04)
	char pad_CF4[0x4]; // 0xcf4(0x04)
	struct FString PlayOnConsoleSaveDir[0x10]; // 0xcf8(0x10)
	struct UMaterialInstanceDynamic* *dd5dd57e60[0x08]; // 0xd08(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly[0x10]; // 0xd10(0x10)
	struct FStringClassReference GameSingletonClassName[0x10]; // 0xd20(0x10)
	float DisplayGamma[0x04]; // 0xd30(0x04)
	char pad_D34[0x4]; // 0xd34(0x04)
	struct UMaterialInstanceDynamic* *cba3a24030[0x08]; // 0xd38(0x08)
	struct UMaterialInstanceDynamic* *c546a776e0[0x08]; // 0xd40(0x08)
	struct UClass* *939ce45cf3[0x08]; // 0xd48(0x08)
	struct FStringAssetReference DefaultReflectionCaptureTextureName[0x10]; // 0xd50(0x10)
	char pad_D60[0x8]; // 0xd60(0x08)
	struct UMaterialInstanceDynamic* *d52bb2e916[0x08]; // 0xd68(0x08)
	struct FColor *3a3f396815[0x04]; // 0xd70(0x04)
	char pad_D74[0x4]; // 0xd74(0x04)
	struct FString VertexColorMaterialName[0x10]; // 0xd78(0x10)
	char pad_D88[0x18]; // 0xd88(0x18)
	int32 *7bf7828cff[0x04]; // 0xda0(0x04)
	char pad_DA4[0x1ac]; // 0xda4(0x1ac)
};

// Class Engine.*267b167105
// Size: 0x38 (Inherited: 0x28)
struct U*267b167105 : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x680 (Inherited: 0x38)
struct UGameViewportClient : U*267b167105 {
	char pad_38[0x398]; // 0x38(0x398)
	struct TArray<struct F*943c6d0e82> *7fc15348f4[0x10]; // 0x3d0(0x10)
	char pad_3E0[0x108]; // 0x3e0(0x108)
	struct UGameInstance* GameInstance[0x08]; // 0x4e8(0x08)
	char pad_4F0[0x180]; // 0x4f0(0x180)
	struct UConsole* *0577cd079b[0x08]; // 0x670(0x08)
	char pad_678[0x8]; // 0x678(0x08)

	void SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x6624710
	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0xb1e1e4
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x58d1c6c
};

// Class Engine.Console
// Size: 0x108 (Inherited: 0x28)
struct UConsole : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct ULocalPlayer* *8cb17d72a2[0x08]; // 0x38(0x08)
	struct UTexture2D* *d7075ad4d7[0x08]; // 0x40(0x08)
	struct UTexture2D* *c697d5ef94[0x08]; // 0x48(0x08)
	char pad_50[0x18]; // 0x50(0x18)
	struct TArray<struct FString> HistoryBuffer[0x10]; // 0x68(0x10)
	char pad_78[0x90]; // 0x78(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c0 (Inherited: 0x28)
struct UNetDriver : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FString NetConnectionClassName[0x10]; // 0x30(0x10)
	int32 MaxDownloadSize[0x04]; // 0x40(0x04)
	char bClampListenServerTickRate : 1; // 0x44(0x01)
	char pad_44_1 : 7; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	int32 NetServerMaxTickRate[0x04]; // 0x48(0x04)
	int32 MaxInternetClientRate[0x04]; // 0x4c(0x04)
	int32 MaxClientRate[0x04]; // 0x50(0x04)
	float ServerTravelPause[0x04]; // 0x54(0x04)
	float SpawnPrioritySeconds[0x04]; // 0x58(0x04)
	float RelevantTimeout[0x04]; // 0x5c(0x04)
	float KeepAliveTime[0x04]; // 0x60(0x04)
	float InitialConnectTimeout[0x04]; // 0x64(0x04)
	float ConnectionTimeout[0x04]; // 0x68(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds[0x04]; // 0x6c(0x04)
	bool bNoTimeouts; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UNetConnection* *b95efedb68[0x08]; // 0x78(0x08)
	struct TArray<struct UNetConnection*> *5caadb491a[0x10]; // 0x80(0x10)
	char pad_90[0x28]; // 0x90(0x28)
	struct UWorld* World[0x08]; // 0xb8(0x08)
	struct UPackage* *7ce0584c32[0x08]; // 0xc0(0x08)
	char pad_C8[0x20]; // 0xc8(0x20)
	struct UClass* *6125afc26a[0x08]; // 0xe8(0x08)
	struct UProperty* *08fb2db1ef[0x08]; // 0xf0(0x08)
	struct UProperty* *169c3cf1e7[0x08]; // 0xf8(0x08)
	struct FName NetDriverName[0x08]; // 0x100(0x08)
	char pad_108[0x8]; // 0x108(0x08)
	float Time[0x04]; // 0x110(0x04)
	char pad_114[0x3ac]; // 0x114(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c0)
struct UDemoNetDriver : UNetDriver {
	char pad_4C0[0xf8]; // 0x4c0(0xf8)
	struct TMap<struct FString, struct F*bd2d09f136> *bb20b5ac02[0x50]; // 0x5b8(0x50)
	char pad_608[0x438]; // 0x608(0x438)
	bool *583fbfe7b8; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.GameEngine
// Size: 0xfb0 (Inherited: 0xf50)
struct UGameEngine : UEngine {
	float MaxDeltaTime[0x04]; // 0xf48(0x04)
	float ServerFlushLogInterval[0x04]; // 0xf4c(0x04)
	struct UGameInstance* GameInstance[0x08]; // 0xf50(0x08)
	char pad_F60[0x38]; // 0xf60(0x38)
	struct TArray<struct UWorld*> *30f0e73cd5[0x10]; // 0xf98(0x10)
	char pad_FA8[0x8]; // 0xfa8(0x08)
};

// Class Engine.Player
// Size: 0x48 (Inherited: 0x28)
struct UPlayer : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	int32 *43861e1339[0x04]; // 0x38(0x04)
	int32 ConfiguredInternetSpeed[0x04]; // 0x3c(0x04)
	int32 ConfiguredLanSpeed[0x04]; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.NetConnection
// Size: 0x65848 (Inherited: 0x48)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children[0x10]; // 0x48(0x10)
	struct UNetDriver* Driver[0x08]; // 0x58(0x08)
	struct UClass* *c9a07c0e0e[0x08]; // 0x60(0x08)
	struct UPackageMap* PackageMap[0x08]; // 0x68(0x08)
	struct TArray<struct UChannel*> *969e2f926f[0x10]; // 0x70(0x10)
	struct TArray<struct AActor*> *450acb6ca0[0x10]; // 0x80(0x10)
	struct AActor* ViewTarget[0x08]; // 0x90(0x08)
	struct AActor* *c907380c05[0x08]; // 0x98(0x08)
	int32 *95374739ae[0x04]; // 0xa0(0x04)
	char *9c3073c60b : 1; // 0xa4(0x01)
	char pad_A4_1 : 1; // 0xa4(0x01)
	char *7e187ea680 : 1; // 0xa4(0x01)
	char pad_A4_3 : 5; // 0xa4(0x01)
	char pad_A5[0x8b]; // 0xa5(0x8b)
	struct TArray<struct UChannel*> *15c176d85f[0x10]; // 0x130(0x10)
	char pad_140[0x28]; // 0x140(0x28)
	struct FUniqueNetIdRepl PlayerId[0x18]; // 0x168(0x18)
	char pad_180[0x68]; // 0x180(0x68)
	double *1217438028[0x08]; // 0x1e8(0x08)
	char pad_1F0[0x65538]; // 0x1f0(0x65538)
	struct TArray<struct UChannel*> *8d7214ce79[0x10]; // 0x65728(0x10)
	char pad_65738[0x110]; // 0x65738(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x40 (Inherited: 0x28)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*8172d5eac2> ChannelDetails[0x10]; // 0x28(0x10)
	float Duration[0x04]; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.GameSession
// Size: 0x400 (Inherited: 0x3e8)
struct AGameSession : AInfo {
	int32 MaxSpectators[0x04]; // 0x3e8(0x04)
	int32 MaxPlayers[0x04]; // 0x3ec(0x04)
	int32 *6dce3bcc33[0x04]; // 0x3f0(0x04)
	bool MaxSplitscreensPerConnection; // 0x3f4(0x01)
	bool bRequiresPushToTalk; // 0x3f5(0x01)
	char pad_3F6[0x2]; // 0x3f6(0x02)
	struct FName SessionName[0x08]; // 0x3f8(0x08)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc80 (Inherited: 0xba0)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*4f3c2d44a1> PerInstanceSMData[0x10]; // 0xba0(0x10)
	int32 InstancingRandomSeed[0x04]; // 0xbb0(0x04)
	int32 InstanceStartCullDistance[0x04]; // 0xbb4(0x04)
	int32 InstanceEndCullDistance[0x04]; // 0xbb8(0x04)
	char pad_BBC[0x4]; // 0xbbc(0x04)
	struct TArray<int32> *754184d020[0x10]; // 0xbc0(0x10)
	struct TArray<int32> *c10d91a000[0x10]; // 0xbd0(0x10)
	char pad_BE0[0x78]; // 0xbe0(0x78)
	struct UPhysicsSerializer* PhysicsSerializer[0x08]; // 0xc58(0x08)
	bool *977852e8ca; // 0xc60(0x01)
	char pad_C61[0x3]; // 0xc61(0x03)
	int32 *3cb8f168ab[0x04]; // 0xc64(0x04)
	struct TArray<struct F*707001a8dd> *9da75a2d5b[0x10]; // 0xc68(0x10)
	char pad_C78[0x8]; // 0xc78(0x08)

	void *e5295d5ef3(struct FTransform* OutInstanceTransform); // Function Engine.InstancedStaticMeshComponent.*e5295d5ef3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6601000
	struct FVector4 *67da154cb1(); // Function Engine.InstancedStaticMeshComponent.*67da154cb1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66286f0
	void *552630dc35(); // Function Engine.InstancedStaticMeshComponent.*552630dc35 // Native|Public|BlueprintCallable // @ game+0xcf814c
	int32 *e4e17343d9(); // Function Engine.InstancedStaticMeshComponent.*e4e17343d9 // Final|Native|Public|BlueprintCallable // @ game+0x66252c0
	bool *7459db3257(int32* InstanceIndex, bool bWorldSpace); // Function Engine.InstancedStaticMeshComponent.*7459db3257 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6639420
	struct FVector4 *82167e78cb(); // Function Engine.InstancedStaticMeshComponent.*82167e78cb // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e4b08
	void *1ff5154222(); // Function Engine.InstancedStaticMeshComponent.*1ff5154222 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6600984
	void *7799271b12(struct FVector4* OutPerInstanceCustomData); // Function Engine.InstancedStaticMeshComponent.*7799271b12 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6600b70
	bool *561b0d5362(); // Function Engine.InstancedStaticMeshComponent.*561b0d5362 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x660191c
	void *4981f52ac4(); // Function Engine.InstancedStaticMeshComponent.*4981f52ac4 // Native|Public|BlueprintCallable // @ game+0x661e8a4
	void *01fde74119(struct FTransform* InstanceTransform); // Function Engine.InstancedStaticMeshComponent.*01fde74119 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e46c8
	bool *a409ec8533(); // Function Engine.InstancedStaticMeshComponent.*a409ec8533 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66017b4
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xdb0 (Inherited: 0xc80)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C80[0x68]; // 0xc80(0x68)
	struct TArray<int32> *c35c6933db[0x10]; // 0xce8(0x10)
	int32 *995034b1b2[0x04]; // 0xcf8(0x04)
	char pad_CFC[0x4]; // 0xcfc(0x04)
	struct FBox *9ce4a0f35c[0x1c]; // 0xd00(0x1c)
	struct FBox *eeb6f14d03[0x1c]; // 0xd1c(0x1c)
	struct TArray<struct FBox> *7c7ca05821[0x10]; // 0xd38(0x10)
	char pad_D48[0x20]; // 0xd48(0x20)
	int32 *18bd8b16a3[0x04]; // 0xd68(0x04)
	struct FBoxSphereBounds *d45c6ff2a1[0x1c]; // 0xd6c(0x1c)
	char *09c59fbf3c : 1; // 0xd88(0x01)
	char *dac8477fb6 : 1; // 0xd88(0x01)
	char pad_D88_2 : 6; // 0xd88(0x01)
	char pad_D89[0x27]; // 0xd89(0x27)

	struct TArray<int32> *c4d2b25a72(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*c4d2b25a72 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x661e948
};

// Class Engine.*5d118ed8c5
// Size: 0xdb0 (Inherited: 0xdb0)
struct U*5d118ed8c5 : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid[0x04]; // 0xda8(0x04)
};

// Class Engine.NavLinkProxy
// Size: 0x438 (Inherited: 0x3e8)
struct ANavLinkProxy : AActor {
	char pad_3E8[0x10]; // 0x3e8(0x10)
	struct TArray<struct FNavigationLink> PointLinks[0x10]; // 0x3f8(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks[0x10]; // 0x408(0x10)
	struct UNavLinkCustomComponent* SmartLinkComp[0x08]; // 0x418(0x08)
	bool *c69861c740; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct FMulticastDelegate OnSmartLinkReached[0x10]; // 0x428(0x10)

	void *b60053683c(); // Function Engine.NavLinkProxy.*b60053683c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cd000
	void ReceiveSmartLinkReached(struct AActor** Agent); // Function Engine.NavLinkProxy.ReceiveSmartLinkReached // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
	void *d9d695d546(); // Function Engine.NavLinkProxy.*d9d695d546 // Final|Native|Public // @ game+0xbf00fc
	void *774b5e08a9(); // Function Engine.NavLinkProxy.*774b5e08a9 // Final|Native|Public|BlueprintCallable // @ game+0x65d4cb8
	void *2058e6a129(); // Function Engine.NavLinkProxy.*2058e6a129 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cc0d8
	void *49e92ce488(); // Function Engine.NavLinkProxy.*49e92ce488 // Final|Native|Public|BlueprintCallable // @ game+0x65dd2e8
};

// Class Engine.LocalPlayer
// Size: 0x288 (Inherited: 0x48)
struct ULocalPlayer : UPlayer {
	char pad_48[0x10]; // 0x48(0x10)
	char *9b12f4d6bd : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x17]; // 0x59(0x17)
	struct UClass* *ff1a8deac9[0x08]; // 0x70(0x08)
	char pad_78[0x210]; // 0x78(0x210)
};

// Class Engine.*df0ac3a39d
// Size: 0x28 (Inherited: 0x28)
struct U*df0ac3a39d : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1d00 (Inherited: 0x3e8)
struct APlayerCameraManager : AActor {
	struct APlayerController* *e9fdc891fb[0x08]; // 0x3e8(0x08)
	struct USceneComponent* TransformComponent[0x08]; // 0x3f0(0x08)
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct F*ccdcf600a2 *0c01e7dd74[0x5e0]; // 0x400(0x5e0)
	float FreeCamDistance[0x04]; // 0x9e0(0x04)
	char pad_9E4[0xc]; // 0x9e4(0x0c)
	struct F*6432761ee7 *c63c0ee2d5[0x5d0]; // 0x9f0(0x5d0)
	char pad_FC0[0x4]; // 0xfc0(0x04)
	float DefaultOrthoWidth[0x04]; // 0xfc4(0x04)
	char pad_FC8[0x28]; // 0xfc8(0x28)
	struct F*ccdcf600a2 ViewTarget[0x5e0]; // 0xff0(0x5e0)
	char pad_15D0[0x20]; // 0x15d0(0x20)
	struct F*6432761ee7 *2eaebbc30c[0x5d0]; // 0x15f0(0x5d0)
	float ViewPitchMax[0x04]; // 0x1bc0(0x04)
	float ViewYawMin[0x04]; // 0x1bc4(0x04)
	float ViewRollMin[0x04]; // 0x1bc8(0x04)
	float DefaultFOV[0x04]; // 0x1bcc(0x04)
	char pad_1BD0[0x10]; // 0x1bd0(0x10)
	struct TArray<struct U*d265edd002*> *e5a975db74[0x10]; // 0x1be0(0x10)
	struct FVector ViewTargetOffset[0x0c]; // 0x1bf0(0x0c)
	float ViewRollMax[0x04]; // 0x1bfc(0x04)
	char pad_1C00[0x18]; // 0x1c00(0x18)
	struct FVector FreeCamOffset[0x0c]; // 0x1c18(0x0c)
	char pad_1C24[0x4]; // 0x1c24(0x04)
	struct TArray<struct AEmitterCameraLensEffectBase*> *23527db694[0x10]; // 0x1c28(0x10)
	struct U*50a4472fea* *a616bea493[0x08]; // 0x1c38(0x08)
	struct U*faef588082* *949f36d826[0x08]; // 0x1c40(0x40)
	struct TArray<struct FPostProcessSettings> *129b64c87e[0x10]; // 0x1c80(0x10)
	char pad_1C90[0x10]; // 0x1c90(0x10)
	struct TArray<struct U*faef588082*> *6e10f27828[0x10]; // 0x1ca0(0x10)
	struct TArray<struct U*faef588082*> *08f08cc15c[0x10]; // 0x1cb0(0x10)
	struct ACameraActor* *71a037b5ab[0x08]; // 0x1cc0(0x08)
	char bIsOrthographic : 1; // 0x1cc8(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x1cc8(0x01)
	char pad_1CC8_2 : 5; // 0x1cc8(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1cc8(0x01)
	char pad_1CC9[0x3]; // 0x1cc9(0x03)
	float DefaultAspectRatio[0x04]; // 0x1ccc(0x04)
	float ViewPitchMin[0x04]; // 0x1cd0(0x04)
	float ViewYawMax[0x04]; // 0x1cd4(0x04)
	char pad_1CD8[0x8]; // 0x1cd8(0x08)
	struct TArray<struct UClass*> DefaultModifiers[0x10]; // 0x1ce0(0x10)
	char pad_1CF0[0x10]; // 0x1cf0(0x10)

	bool *4b26d3d746(float* FromAlpha, float* Duration); // Function Engine.PlayerCameraManager.*4b26d3d746 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65de9c0
	struct UClass* *0b6e473a67(); // Function Engine.PlayerCameraManager.*0b6e473a67 // Native|Public|BlueprintCallable // @ game+0x65bdcd0
	void *ddd5440b92(); // Function Engine.PlayerCameraManager.*ddd5440b92 // Native|Public|BlueprintCallable // @ game+0x586e5ec
	void *b9872cbb46(); // Function Engine.PlayerCameraManager.*b9872cbb46 // Native|Public|BlueprintCallable // @ game+0x5909980
	void *f956aeed26(struct UClass** ModifierClass); // Function Engine.PlayerCameraManager.*f956aeed26 // Native|Public|BlueprintCallable // @ game+0x65c50f8
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5823324
	struct UClass* *30c87708fc(); // Function Engine.PlayerCameraManager.*30c87708fc // Native|Public|BlueprintCallable // @ game+0x65deed8
	void *83651ba534(); // Function Engine.PlayerCameraManager.*83651ba534 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xab0e24
	void PhotographyCameraModify(struct FVector* PreviousCameraLocation); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x65d35c0
	void *8b89fd6520(); // Function Engine.PlayerCameraManager.*8b89fd6520 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6cc8
	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5907f20
	void *526e73aebb(); // Function Engine.PlayerCameraManager.*526e73aebb // Native|Public|BlueprintCallable // @ game+0x65decc4
	void BlueprintUpdateCamera(struct AActor** CameraTarget, struct FRotator* NewCameraRotation); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
	struct U*faef588082* *df4de4472e(); // Function Engine.PlayerCameraManager.*df4de4472e // Native|Public|BlueprintCallable // @ game+0x65df050
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5907f08
	void *3d38e01887(float* InFadeAmount); // Function Engine.PlayerCameraManager.*3d38e01887 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65dba8c
	void *6b65651478(); // Function Engine.PlayerCameraManager.*6b65651478 // Native|Public|BlueprintCallable // @ game+0x65ded5c
	void *739422debf(); // Function Engine.PlayerCameraManager.*739422debf // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c7cc4
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x58ce3b4
	void *596dfaadd8(); // Function Engine.PlayerCameraManager.*596dfaadd8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58cb110
	void *16e171ab9f(); // Function Engine.PlayerCameraManager.*16e171ab9f // Native|Public|BlueprintCallable // @ game+0x65d4494
	struct FRotator *0673dfc389(); // Function Engine.PlayerCameraManager.*0673dfc389 // Native|Public|HasDefaults|BlueprintCallable // @ game+0xbcd8f4
	struct UCameraShake* *da8f8503b0(); // Function Engine.PlayerCameraManager.*da8f8503b0 // Native|Public|BlueprintCallable // @ game+0x65df134
	struct FRotator *245befce61(struct UCameraAnim** Anim, float* Scale); // Function Engine.PlayerCameraManager.*245befce61 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d3954
	void *9dc5c269a0(); // Function Engine.PlayerCameraManager.*9dc5c269a0 // Native|Public|BlueprintCallable // @ game+0x65bc8b4
	void *2a6bfee86c(); // Function Engine.PlayerCameraManager.*2a6bfee86c // Native|Public|BlueprintCallable // @ game+0x65dedf4
	struct U*d265edd002* *36ef9f712e(); // Function Engine.PlayerCameraManager.*36ef9f712e // Native|Public|BlueprintCallable // @ game+0x65d4528
};

// Class Engine.PlayerInput
// Size: 0x488 (Inherited: 0x28)
struct UPlayerInput : UObject {
	char pad_28[0xf8]; // 0x28(0xf8)
	struct TArray<struct F*61c810cf0e> DebugExecBindings[0x10]; // 0x120(0x10)
	char pad_130[0x30]; // 0x130(0x30)
	struct TArray<struct FName> InvertedAxis[0x10]; // 0x160(0x10)
	char pad_170[0x318]; // 0x170(0x318)

	void SetGamePadSensitivity(); // Function Engine.PlayerInput.SetGamePadSensitivity // Final|Exec|Native|Public // @ game+0x65dac5c
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // Final|Exec|Native|Public // @ game+0x65bf394
	void SetBind(struct FName* Param0); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x65d9308
	void SetGamePadSensitivityOf(struct FKey* Param0); // Function Engine.PlayerInput.SetGamePadSensitivityOf // Final|Exec|Native|Public // @ game+0x65dacf4
	struct FKey SetGamePadDeadZoneOf(); // Function Engine.PlayerInput.SetGamePadDeadZoneOf // Final|Exec|Native|Public // @ game+0x65dab20
	void InvertAxisKey(); // Function Engine.PlayerInput.InvertAxisKey // Final|Exec|Native|Public // @ game+0x65cc36c
	void SetMouseSensitivity(); // Function Engine.PlayerInput.SetMouseSensitivity // Final|Exec|Native|Public // @ game+0x65dc1a0
	void SetGamePadDeadZone(); // Function Engine.PlayerInput.SetGamePadDeadZone // Final|Exec|Native|Public // @ game+0x65daa88
	void InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x65cc2dc
};

// Class Engine.NavigationData
// Size: 0x590 (Inherited: 0x3e8)
struct ANavigationData : AActor {
	struct UPrimitiveComponent* RenderingComp[0x08]; // 0x3e8(0x08)
	struct F*dbc2be8864 *dbc2be8864[0x50]; // 0x3f0(0x50)
	char *bf6d21a228 : 1; // 0x440(0x01)
	char bForceRebuildOnLoad : 1; // 0x440(0x01)
	char bCanBeMainNavData : 1; // 0x440(0x01)
	char bCanSpawnOnRebuild : 1; // 0x440(0x01)
	char bRebuildAtRuntime : 1; // 0x440(0x01)
	char pad_440_5 : 3; // 0x440(0x01)
	char pad_441[0x3]; // 0x441(0x03)
	enum class ERuntimeGenerationType RuntimeGeneration; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float ObservedPathsTickInterval[0x04]; // 0x448(0x04)
	char *5450a494ed : 1; // 0x44c(0x01)
	char pad_44C_1 : 7; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	uint32 DataVersion[0x04]; // 0x450(0x04)
	char pad_454[0xd4]; // 0x454(0xd4)
	struct TArray<struct F*a098f5a73b> *efbca435e7[0x10]; // 0x528(0x10)
	char pad_538[0x58]; // 0x538(0x58)
};

// Class Engine.RecastNavMesh
// Size: 0x6a0 (Inherited: 0x590)
struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x590(0x01)
	char bDrawPolyEdges : 1; // 0x590(0x01)
	char bDrawFilledPolys : 1; // 0x590(0x01)
	char bDrawNavMeshEdges : 1; // 0x590(0x01)
	char *afbdbd43dd : 1; // 0x590(0x01)
	char *2b90e490d1 : 1; // 0x590(0x01)
	char *5a07d7cafb : 1; // 0x590(0x01)
	char *c82954ac6b : 1; // 0x590(0x01)
	char *9898141409 : 1; // 0x591(0x01)
	char *34275df68e : 1; // 0x591(0x01)
	char *1d0f9691e4 : 1; // 0x591(0x01)
	char *6256b34fc7 : 1; // 0x591(0x01)
	char *484c9504d8 : 1; // 0x591(0x01)
	char *e3d71e5fe2 : 1; // 0x591(0x01)
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x591(0x01)
	char *d60bce4234 : 1; // 0x591(0x01)
	char pad_592[0x2]; // 0x592(0x02)
	float DrawOffset[0x04]; // 0x594(0x04)
	char bFixedTilePoolSize : 1; // 0x598(0x01)
	char pad_598_1 : 7; // 0x598(0x01)
	char pad_599[0x3]; // 0x599(0x03)
	int32 TilePoolSize[0x04]; // 0x59c(0x04)
	float TileSizeUU[0x04]; // 0x5a0(0x04)
	float CellSize[0x04]; // 0x5a4(0x04)
	float CellHeight[0x04]; // 0x5a8(0x04)
	float AgentRadius[0x04]; // 0x5ac(0x04)
	float AgentHeight[0x04]; // 0x5b0(0x04)
	float AgentMaxHeight[0x04]; // 0x5b4(0x04)
	float AgentMaxSlope[0x04]; // 0x5b8(0x04)
	float AgentMaxStepHeight[0x04]; // 0x5bc(0x04)
	float MinRegionArea[0x04]; // 0x5c0(0x04)
	float MergeRegionSize[0x04]; // 0x5c4(0x04)
	float MaxSimplificationError[0x04]; // 0x5c8(0x04)
	int32 MaxSimultaneousTileGenerationJobsCount[0x04]; // 0x5cc(0x04)
	int32 TileNumberHardLimit[0x04]; // 0x5d0(0x04)
	int32 *f0177cc714[0x04]; // 0x5d4(0x04)
	int32 *42bcf443d9[0x04]; // 0x5d8(0x04)
	int32 *a68c5c4820[0x04]; // 0x5dc(0x04)
	float DefaultDrawDistance[0x04]; // 0x5e0(0x04)
	float DefaultMaxSearchNodes[0x04]; // 0x5e4(0x04)
	float DefaultMaxHierarchicalSearchNodes[0x04]; // 0x5e8(0x04)
	enum class ERecastPartitioning RegionPartitioning; // 0x5ec(0x01)
	enum class ERecastPartitioning LayerPartitioning; // 0x5ed(0x01)
	char pad_5EE[0x2]; // 0x5ee(0x02)
	int32 RegionChunkSplits[0x04]; // 0x5f0(0x04)
	int32 LayerChunkSplits[0x04]; // 0x5f4(0x04)
	char bSortNavigationAreasByCost : 1; // 0x5f8(0x01)
	char bPerformVoxelFiltering : 1; // 0x5f8(0x01)
	char bMarkLowHeightAreas : 1; // 0x5f8(0x01)
	char bDoFullyAsyncNavDataGathering : 1; // 0x5f8(0x01)
	char bUseBetterOffsetsFromCorners : 1; // 0x5f8(0x01)
	char bStoreEmptyTileLayers : 1; // 0x5f8(0x01)
	char bUseVirtualFilters : 1; // 0x5f8(0x01)
	char bAllowNavLinkAsPathEnd : 1; // 0x5f8(0x01)
	char pad_5F9[0x3]; // 0x5f9(0x03)
	bool bOnlySavedOnDS; // 0x5fc(0x01)
	char pad_5FD[0x3]; // 0x5fd(0x03)
	char bUseVoxelCache : 1; // 0x600(0x01)
	char pad_600_1 : 7; // 0x600(0x01)
	char pad_601[0x3]; // 0x601(0x03)
	float TileSetUpdateInterval[0x04]; // 0x604(0x04)
	float HeuristicScale[0x04]; // 0x608(0x04)
	float VerticalDeviationFromGroundCompensation[0x04]; // 0x60c(0x04)
	char pad_610[0x90]; // 0x610(0x90)
};

// Class Engine.*ff4b8fbd53
// Size: 0x38 (Inherited: 0x28)
struct U*ff4b8fbd53 : UObject {
	struct TArray<struct F*7f68d80531> *9763e0c01a[0x10]; // 0x28(0x10)
};

// Class Engine.SceneCaptureComponent
// Size: 0x550 (Inherited: 0x4d0)
struct USceneCaptureComponent : USceneComponent {
	struct TArray<struct UPrimitiveComponent*> *181c8efbcd[0x10]; // 0x4d0(0x10)
	struct TArray<struct AActor*> HiddenActors[0x10]; // 0x4e0(0x10)
	struct TArray<struct UPrimitiveComponent*> *276acdd225[0x10]; // 0x4f0(0x10)
	struct TArray<struct AActor*> ShowOnlyActors[0x10]; // 0x500(0x10)
	bool bIsLobbyCapture; // 0x510(0x01)
	bool bCaptureEveryFrame; // 0x511(0x01)
	bool bCaptureOnMovement; // 0x512(0x01)
	char pad_513[0x1]; // 0x513(0x01)
	float LODDistanceFactor[0x04]; // 0x514(0x04)
	float MaxViewDistanceOverride[0x04]; // 0x518(0x04)
	int32 CaptureSortPriority[0x04]; // 0x51c(0x04)
	struct TArray<struct F*2e7d0bf04d> ShowFlagSettings[0x10]; // 0x520(0x10)
	char pad_530[0x20]; // 0x530(0x20)

	void *7e905b4b64(); // Function Engine.SceneCaptureComponent.*7e905b4b64 // Final|Native|Public|BlueprintCallable // @ game+0x6623ca8
	void *8f98e781db(); // Function Engine.SceneCaptureComponent.*8f98e781db // Final|Native|Public|BlueprintCallable // @ game+0x660a57c
	void *4ec409b2bc(); // Function Engine.SceneCaptureComponent.*4ec409b2bc // Final|Native|Public|BlueprintCallable // @ game+0x661eb94
	void *30080cc8fb(); // Function Engine.SceneCaptureComponent.*30080cc8fb // Final|Native|Public|BlueprintCallable // @ game+0x6632090
	void *0106912d1f(); // Function Engine.SceneCaptureComponent.*0106912d1f // Final|Native|Public|BlueprintCallable // @ game+0x661ec24
	void *d263019945(); // Function Engine.SceneCaptureComponent.*d263019945 // Final|Native|Public|BlueprintCallable // @ game+0x660a3dc
	void *43f5e14905(); // Function Engine.SceneCaptureComponent.*43f5e14905 // Final|Native|Public|BlueprintCallable // @ game+0x65f12cc
	void *621d8e09f7(); // Function Engine.SceneCaptureComponent.*621d8e09f7 // Final|Native|Public|BlueprintCallable // @ game+0x6632000
};

// Class Engine.SceneCaptureComponent2D
// Size: 0xb90 (Inherited: 0x550)
struct USceneCaptureComponent2D : USceneCaptureComponent {
	enum class ECameraProjectionMode ProjectionType; // 0x550(0x01)
	char pad_551[0x3]; // 0x551(0x03)
	float FOVAngle[0x04]; // 0x554(0x04)
	bool *53c2030bce; // 0x558(0x01)
	char pad_559[0x3]; // 0x559(0x03)
	float *29ce5cea98[0x04]; // 0x55c(0x04)
	float OrthoWidth[0x04]; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct UTextureRenderTarget2D* TextureTarget[0x08]; // 0x568(0x08)
	enum class *bf5d45bad1 CaptureSource; // 0x570(0x01)
	enum class *1749cfde27 CompositeMode; // 0x571(0x01)
	char pad_572[0x2]; // 0x572(0x02)
	struct FLinearColor LightingOnlyBrightness[0x10]; // 0x574(0x10)
	struct FLinearColor LightingOnlySpecular[0x10]; // 0x584(0x10)
	struct FLinearColor LightingOnlyCustomData[0x10]; // 0x594(0x10)
	float LightingOnlyCustomDataAlpha[0x04]; // 0x5a4(0x04)
	char pad_5A8[0x8]; // 0x5a8(0x08)
	struct FPostProcessSettings PostProcessSettings[0x570]; // 0x5b0(0x570)
	float PostProcessBlendWeight[0x04]; // 0xb20(0x04)
	bool bUseCustomProjectionMatrix; // 0xb24(0x01)
	char pad_B25[0xb]; // 0xb25(0x0b)
	struct FMatrix CustomProjectionMatrix[0x40]; // 0xb30(0x40)
	char *8a9a073e7b : 1; // 0xb70(0x01)
	char pad_B70_1 : 7; // 0xb70(0x01)
	char pad_B71[0x3]; // 0xb71(0x03)
	bool bEnableClipPlane; // 0xb74(0x01)
	char pad_B75[0x3]; // 0xb75(0x03)
	struct FVector ClipPlaneBase[0x0c]; // 0xb78(0x0c)
	struct FVector ClipPlaneNormal[0x0c]; // 0xb84(0x0c)

	void CaptureScene(); // Function Engine.SceneCaptureComponent2D.CaptureScene // Final|Native|Public|BlueprintCallable // @ game+0x65f0bd0
	TScriptInterface<struct UBlendableInterface> *8480288ca6(); // Function Engine.SceneCaptureComponent2D.*8480288ca6 // Final|Native|Public|BlueprintCallable // @ game+0x65e4f24
};

// Class Engine.ArrowComponent
// Size: 0xa10 (Inherited: 0xa00)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor[0x04]; // 0x9f8(0x04)
	float ArrowSize[0x04]; // 0x9fc(0x04)
	bool bIsScreenSizeScaled; // 0xa00(0x01)
	float ScreenSize[0x04]; // 0xa04(0x04)
	char bTreatAsASprite : 1; // 0xa08(0x01)
	char pad_A0D_1 : 7; // 0xa0d(0x01)
	char pad_A0E[0x2]; // 0xa0e(0x02)

	void SetArrowColor(); // Function Engine.ArrowComponent.SetArrowColor // Native|Public|HasDefaults|BlueprintCallable // @ game+0x662206c
};

// Class Engine.NavModifierVolume
// Size: 0x430 (Inherited: 0x420)
struct ANavModifierVolume : AVolume {
	char pad_420[0x8]; // 0x420(0x08)
	struct UClass* AreaClass[0x08]; // 0x428(0x08)

	void *7aaad5527c(); // Function Engine.NavModifierVolume.*7aaad5527c // Final|Native|Public|BlueprintCallable // @ game+0x65d82dc
};

// Class Engine.ParticleSystemComponent
// Size: 0xc60 (Inherited: 0xa00)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template[0x08]; // 0x9f8(0x08)
	struct TArray<struct UMaterialInterface*> *0264e057b3[0x10]; // 0xa00(0x10)
	struct TArray<struct USkeletalMeshComponent*> *d2e13ff94a[0x10]; // 0xa10(0x10)
	char pad_A28_0 : 7; // 0xa28(0x01)
	char bResetOnDetach : 1; // 0xa20(0x01)
	char *b0c579f1b2 : 1; // 0xa21(0x01)
	char bAllowRecycling : 1; // 0xa21(0x01)
	char bAutoManageAttachment : 1; // 0xa21(0x01)
	char *6a0dc6332d : 1; // 0xa21(0x01)
	char bOverrideLODMethod : 1; // 0xa22(0x01)
	char *a9eb83c3f5 : 1; // 0xa22(0x01)
	char *f4ab1f1a19 : 1; // 0xa22(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters[0x10]; // 0xa28(0x10)
	struct FMulticastDelegate OnParticleSpawn[0x10]; // 0xa38(0x10)
	struct FMulticastDelegate OnParticleBurst[0x10]; // 0xa48(0x10)
	struct FMulticastDelegate OnParticleDeath[0x10]; // 0xa58(0x10)
	struct FMulticastDelegate OnParticleCollide[0x10]; // 0xa68(0x10)
	struct FVector *6d3adcbc3b[0x0c]; // 0xa78(0x0c)
	struct FVector *1d968f1f5c[0x0c]; // 0xa84(0x0c)
	float WarmupTime[0x04]; // 0xa90(0x04)
	float *f276ed8749[0x04]; // 0xa94(0x04)
	char pad_A99[0x3]; // 0xa99(0x03)
	float SecondsBeforeInactive[0x04]; // 0xa9c(0x04)
	char pad_AA0[0x4]; // 0xaa0(0x04)
	float *86558fc266[0x04]; // 0xaa4(0x04)
	char pad_AA8[0x8]; // 0xaa8(0x08)
	enum class *4460aee05d LODMethod; // 0xab0(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0xab1(0x01)
	char pad_AB2[0x16]; // 0xab2(0x16)
	struct TArray<struct U*7130a8ded7*> *7f880bcb72[0x10]; // 0xac8(0x10)
	char pad_AD8[0x60]; // 0xad8(0x60)
	float CustomTimeDilation[0x04]; // 0xb38(0x04)
	char pad_B3C[0x4]; // 0xb3c(0x04)
	struct FMulticastDelegate OnSystemFinished[0x10]; // 0xb40(0x10)
	struct USceneComponent* AutoAttachParent[0x08]; // 0xb50(0x08)
	struct FName AutoAttachSocketName[0x08]; // 0xb58(0x08)
	enum class EAttachLocation AutoAttachLocationType; // 0xb60(0x01)
	enum class EAttachmentRule AutoAttachLocationRule; // 0xb61(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0xb62(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0xb63(0x01)
	char pad_B64[0xfc]; // 0xb64(0xfc)

	void *3eb6223e6f(); // Function Engine.ParticleSystemComponent.*3eb6223e6f // Final|Native|Public|BlueprintCallable // @ game+0x65dd5d4
	struct FVector *3967cdee21(); // Function Engine.ParticleSystemComponent.*3967cdee21 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d91cc
	void *1e3c290f5c(struct FName* ParameterName); // Function Engine.ParticleSystemComponent.*1e3c290f5c // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d9f78
	float *ae89bc7fe9(); // Function Engine.ParticleSystemComponent.*ae89bc7fe9 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c68dc
	float *33bad8c16d(); // Function Engine.ParticleSystemComponent.*33bad8c16d // Native|Public|BlueprintCallable // @ game+0x65d90a4
	void SetFloatParameter(struct FName* ParameterName); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0xcdb25c
	void *33a48ef273(); // Function Engine.ParticleSystemComponent.*33a48ef273 // Final|Native|Public|BlueprintCallable // @ game+0x65d7bd0
	void *2f88032a60(); // Function Engine.ParticleSystemComponent.*2f88032a60 // Final|Native|Public|BlueprintCallable // @ game+0x65c4e54
	struct FName *43b5fa91da(); // Function Engine.ParticleSystemComponent.*43b5fa91da // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65ddf58
	void *f78f4b8261(int32* emitterIndex); // Function Engine.ParticleSystemComponent.*f78f4b8261 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c62d8
	void *77b1620434(); // Function Engine.ParticleSystemComponent.*77b1620434 // Final|Native|Public|BlueprintCallable // @ game+0x65dbfec
	struct FVector *2b287676da(); // Function Engine.ParticleSystemComponent.*2b287676da // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d8e2c
	void *803b3191e2(struct UMaterialInterface** SourceMaterial); // Function Engine.ParticleSystemComponent.*803b3191e2 // Native|Public|BlueprintCallable // @ game+0x65c2b6c
	struct FVector *efcfc3e16f(int32* emitterIndex); // Function Engine.ParticleSystemComponent.*efcfc3e16f // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6a1c
	int32 *652895e7b7(); // Function Engine.ParticleSystemComponent.*652895e7b7 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d8acc
	void *35fb56820d(); // Function Engine.ParticleSystemComponent.*35fb56820d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca210
	void *a9b1891267(struct FName* SocketName); // Function Engine.ParticleSystemComponent.*a9b1891267 // Final|Native|Public|BlueprintCallable // @ game+0x65d854c
	struct FVector *93a6d9a36e(); // Function Engine.ParticleSystemComponent.*93a6d9a36e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6654
	void *e6536d8bf2(struct FName* EmitterName); // Function Engine.ParticleSystemComponent.*e6536d8bf2 // Native|Public|BlueprintCallable // @ game+0x65da624
	void *e90585bf5a(); // Function Engine.ParticleSystemComponent.*e90585bf5a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c9fc8
	float *69ad17cf8e(); // Function Engine.ParticleSystemComponent.*69ad17cf8e // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6514
	int32 *4e1843a089(struct FVector* NewTargetPoint); // Function Engine.ParticleSystemComponent.*4e1843a089 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d8f68
	enum class EAttachmentRule *833271b79f(); // Function Engine.ParticleSystemComponent.*833271b79f // Final|Native|Public|BlueprintCallable // @ game+0x65d8694
	void *bbe8833323(struct FName* InFirstSocketName, enum class *a1588812a5 InWidthMode); // Function Engine.ParticleSystemComponent.*bbe8833323 // Final|Native|Public|BlueprintCallable // @ game+0x65dd8ac
	struct FVector *ac3de6ecfd(int32* emitterIndex); // Function Engine.ParticleSystemComponent.*ac3de6ecfd // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6798
	float *f1e9447b17(); // Function Engine.ParticleSystemComponent.*f1e9447b17 // Native|Public|BlueprintCallable // @ game+0x65d8d04
	void *37b5286932(struct FName* InFirstSocketName, enum class *a1588812a5 InWidthMode); // Function Engine.ParticleSystemComponent.*37b5286932 // Final|Native|Public|BlueprintCallable // @ game+0x65be880
	struct FVector *545a9d9058(); // Function Engine.ParticleSystemComponent.*545a9d9058 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c63d0
	float *840fc18676(struct FVector* InLocation); // Function Engine.ParticleSystemComponent.*840fc18676 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65c535c
	void *865335f835(int32* emitterIndex); // Function Engine.ParticleSystemComponent.*865335f835 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65d8bc8
};

// Class Engine.DefaultPawn
// Size: 0x470 (Inherited: 0x448)
struct ADefaultPawn : APawn {
	float BaseTurnRate[0x04]; // 0x448(0x04)
	float BaseLookUpRate[0x04]; // 0x44c(0x04)
	struct UPawnMovementComponent* MovementComponent[0x08]; // 0x450(0x08)
	struct USphereComponent* CollisionComponent[0x08]; // 0x458(0x08)
	struct UStaticMeshComponent* MeshComponent[0x08]; // 0x460(0x08)
	char bAddDefaultMovementBindings : 1; // 0x468(0x01)
	char pad_468_1 : 7; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)

	void *4b0eecc634(); // Function Engine.DefaultPawn.*4b0eecc634 // Native|Public|BlueprintCallable // @ game+0x65d2f88
	void MoveForward(); // Function Engine.DefaultPawn.MoveForward // Native|Public|BlueprintCallable // @ game+0x65d2e50
	void *d93a5f2923(); // Function Engine.DefaultPawn.*d93a5f2923 // Final|Native|Public|BlueprintCallable // @ game+0x65d2b5c
	void *2502c41576(); // Function Engine.DefaultPawn.*2502c41576 // Final|Native|Public|BlueprintCallable // @ game+0x65df6bc
	void MoveRight(); // Function Engine.DefaultPawn.MoveRight // Native|Public|BlueprintCallable // @ game+0x65d2eec
};

// Class Engine.SpectatorPawn
// Size: 0x470 (Inherited: 0x470)
struct ASpectatorPawn : ADefaultPawn {
};

// Class Engine.FloatingPawnMovement
// Size: 0x290 (Inherited: 0x280)
struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed[0x04]; // 0x278(0x04)
	float Acceleration[0x04]; // 0x27c(0x04)
	float Deceleration[0x04]; // 0x280(0x04)
	float TurningBoost[0x04]; // 0x284(0x04)
	char *a96f552028 : 1; // 0x288(0x01)
};

// Class Engine.SpectatorPawnMovement
// Size: 0x2a0 (Inherited: 0x290)
struct USpectatorPawnMovement : UFloatingPawnMovement {
	char *cea07ee5d4 : 1; // 0x290(0x01)
	char pad_290_1 : 7; // 0x290(0x01)
	char pad_291[0xf]; // 0x291(0x0f)
};

// Class Engine.SplineComponent
// Size: 0xaf0 (Inherited: 0xa00)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves *e4855893fe[0x60]; // 0x9f8(0x60)
	struct FInterpCurveVector SplineInfo[0x18]; // 0xa58(0x18)
	struct FInterpCurveQuat SplineRotInfo[0x18]; // 0xa70(0x18)
	struct FInterpCurveVector SplineScaleInfo[0x18]; // 0xa88(0x18)
	struct FInterpCurveFloat SplineReparamTable[0x18]; // 0xaa0(0x18)
	bool bAllowSplineEditingPerInstance; // 0xab8(0x01)
	int32 *b2fc378f11[0x04]; // 0xabc(0x04)
	bool *f0eb9457f6; // 0xac0(0x01)
	bool *d026b2a624; // 0xac1(0x01)
	float *9b43bd053e[0x04]; // 0xac4(0x04)
	float Duration[0x04]; // 0xac8(0x04)
	bool bStationaryEndpoints; // 0xacc(0x01)
	bool *bbd66348f8; // 0xacd(0x01)
	bool *567f48a68a; // 0xace(0x01)
	bool bInputSplinePointsToConstructionScript; // 0xacf(0x01)
	bool bDrawDebug; // 0xad0(0x01)
	bool *46cb7b878f; // 0xad1(0x01)
	bool bLoopPositionOverride; // 0xad2(0x01)
	float *2784a51576[0x04]; // 0xad4(0x04)
	struct FVector DefaultUpVector[0x0c]; // 0xad8(0x0c)
	char pad_AE6[0xa]; // 0xae6(0x0a)

	enum class ESplineCoordinateSpace *7b4c9d031b(); // Function Engine.SplineComponent.*7b4c9d031b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fa734
	int32 *6d1df59408(); // Function Engine.SplineComponent.*6d1df59408 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ff684
	void *976eb1cdf1(float* Distance); // Function Engine.SplineComponent.*976eb1cdf1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6604f48
	void *cdebe3cfc2(bool bInClosedLoop); // Function Engine.SplineComponent.*cdebe3cfc2 // Final|Native|Public|BlueprintCallable // @ game+0x6624320
	enum class ESplineCoordinateSpace *fdbdd3d158(); // Function Engine.SplineComponent.*fdbdd3d158 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fef10
	int32 *c43d5d98a0(); // Function Engine.SplineComponent.*c43d5d98a0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6608880
	void *e319c53179(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*e319c53179 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66048b4
	enum class ESplineCoordinateSpace *caf3ef8e09(); // Function Engine.SplineComponent.*caf3ef8e09 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6601fa0
	struct FSplinePoint *e33656ec55(); // Function Engine.SplineComponent.*e33656ec55 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65e5038
	void *3b676ec63f(int32* PointIndex); // Function Engine.SplineComponent.*3b676ec63f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66049b4
	void *c0b3ba04bb(); // Function Engine.SplineComponent.*c0b3ba04bb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66053ac
	bool *d0306b7540(); // Function Engine.SplineComponent.*d0306b7540 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fb31c
	void *86965b948e(float* Distance); // Function Engine.SplineComponent.*86965b948e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6604c30
	struct FVector *cccfa56147(); // Function Engine.SplineComponent.*cccfa56147 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6625644
	float *444c49960a(); // Function Engine.SplineComponent.*444c49960a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66085f0
	void *89f33ae457(); // Function Engine.SplineComponent.*89f33ae457 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x662d058
	void *7674abbac0(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*7674abbac0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fcc18
	int32 *68eb0ba76e(); // Function Engine.SplineComponent.*68eb0ba76e // Final|Native|Public|BlueprintCallable // @ game+0x661ecc4
	enum class ESplineCoordinateSpace *ed3e2a0190(); // Function Engine.SplineComponent.*ed3e2a0190 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6607e34
	void *8d4fda68ab(struct FVector* WorldLocation); // Function Engine.SplineComponent.*8d4fda68ab // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fb000
	enum class ESplineCoordinateSpace *4a52b59c2e(); // Function Engine.SplineComponent.*4a52b59c2e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65ff14c
	int32 *be88f7346a(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*be88f7346a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6601fa0
	void *2cd2c878c1(); // Function Engine.SplineComponent.*2cd2c878c1 // Final|Native|Public|BlueprintCallable // @ game+0x663969c
	bool *8db1b83179(float* Time); // Function Engine.SplineComponent.*8db1b83179 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6604ae8
	float *ab63d040ff(); // Function Engine.SplineComponent.*ab63d040ff // Final|Native|Public|BlueprintCallable // @ game+0x6624418
	void *62d46629cc(); // Function Engine.SplineComponent.*62d46629cc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65da230
	void SetSplinePointType(enum class ESplinePointType Type); // Function Engine.SplineComponent.SetSplinePointType // Final|Native|Public|BlueprintCallable // @ game+0x662d124
	enum class ESplineCoordinateSpace *302ea2dab2(); // Function Engine.SplineComponent.*302ea2dab2 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x662e3a0
	void *4ea785482c(bool bUseConstantVelocity); // Function Engine.SplineComponent.*4ea785482c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6608938
	enum class ESplineCoordinateSpace *d41700f03e(); // Function Engine.SplineComponent.*d41700f03e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6605048
	enum class ESplineCoordinateSpace *91767e1a30(); // Function Engine.SplineComponent.*91767e1a30 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6607d34
	void *738416c2ad(bool bUseConstantVelocity); // Function Engine.SplineComponent.*738416c2ad // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6608ba8
	enum class ESplineCoordinateSpace *fc9e685ffb(); // Function Engine.SplineComponent.*fc9e685ffb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65ff24c
	enum class ESplineCoordinateSpace *df19cb0db6(); // Function Engine.SplineComponent.*df19cb0db6 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6602588
	void *0f131f0c6d(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*0f131f0c6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6604e10
	struct FVector *32321cedbf(); // Function Engine.SplineComponent.*32321cedbf // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fa858
	enum class ESplineCoordinateSpace *2a39fcaf9d(); // Function Engine.SplineComponent.*2a39fcaf9d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x662a0a0
	void *bccf821cd7(struct FVector* LocalLocation); // Function Engine.SplineComponent.*bccf821cd7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6602290
	bool *d95b6f672a(); // Function Engine.SplineComponent.*d95b6f672a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6607354
	enum class ESplineCoordinateSpace *4f4cd5b2fd(); // Function Engine.SplineComponent.*4f4cd5b2fd // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fadd8
	void *395084cc78(float* Distance); // Function Engine.SplineComponent.*395084cc78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6608ae8
	bool *904cfd2f2e(); // Function Engine.SplineComponent.*904cfd2f2e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6607f68
	enum class ESplineCoordinateSpace *c60d6edf0f(); // Function Engine.SplineComponent.*c60d6edf0f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6606460
	void *5a71db2e37(int32* StartIndex); // Function Engine.SplineComponent.*5a71db2e37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66020c4
	void GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6602dbc
	void *bc154fa11e(); // Function Engine.SplineComponent.*bc154fa11e // Final|Native|Public|BlueprintCallable // @ game+0x65f1634
	void *112769234e(); // Function Engine.SplineComponent.*112769234e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e55f8
	void *14b50377fd(); // Function Engine.SplineComponent.*14b50377fd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66087c0
	enum class ESplineCoordinateSpace *d22dfdbd7c(); // Function Engine.SplineComponent.*d22dfdbd7c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6602688
	float *9f717ab45b(); // Function Engine.SplineComponent.*9f717ab45b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6608cb8
	void *93d0ee66fc(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*93d0ee66fc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fb1f8
	enum class ESplineCoordinateSpace *39bea93356(); // Function Engine.SplineComponent.*39bea93356 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fa904
	enum class ESplineCoordinateSpace *9326e47479(); // Function Engine.SplineComponent.*9326e47479 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e546c
	void *6bd9bbc712(); // Function Engine.SplineComponent.*6bd9bbc712 // Final|Native|Public|BlueprintCallable // @ game+0x6625e30
	void *23f898d882(struct FVector* WorldLocation); // Function Engine.SplineComponent.*23f898d882 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fb4a4
	enum class ESplineCoordinateSpace *fd0c91139e(); // Function Engine.SplineComponent.*fd0c91139e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x662f27c
	void *2aef1bb91c(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*2aef1bb91c // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x662d254
	int32 *a83c9914b5(); // Function Engine.SplineComponent.*a83c9914b5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6605c28
	bool *96dd4d52b9(); // Function Engine.SplineComponent.*96dd4d52b9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66086b0
	void *e55d35b53f(); // Function Engine.SplineComponent.*e55d35b53f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e5284
	void *af9dccd68a(); // Function Engine.SplineComponent.*af9dccd68a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x660bbdc
	enum class ESplineCoordinateSpace *1e7b8c34a0(); // Function Engine.SplineComponent.*1e7b8c34a0 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65faefc
	enum class ESplineCoordinateSpace *1ed04e89f0(bool bUseConstantVelocity); // Function Engine.SplineComponent.*1ed04e89f0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6606560
	void *cf23ea2e13(float* Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.*cf23ea2e13 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6605144
	void *75d675f16c(); // Function Engine.SplineComponent.*75d675f16c // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x662d4bc
	int32 *59903796c9(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*59903796c9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6604d24
	void *e91d19565f(float* Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.*e91d19565f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6602784
	struct TArray<struct FSplinePoint> *5cbd31cdd2(); // Function Engine.SplineComponent.*5cbd31cdd2 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65e5154
	void *36f7fb5f70(int32* PointIndex, bool bUseScale); // Function Engine.SplineComponent.*36f7fb5f70 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66074c8
	bool *2d2944af94(); // Function Engine.SplineComponent.*2d2944af94 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6605538
	struct FVector *68745033d7(); // Function Engine.SplineComponent.*68745033d7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66023e8
	void *2a125ecadf(struct FVector* WorldLocation); // Function Engine.SplineComponent.*2a125ecadf // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65fb130
	enum class ESplineCoordinateSpace AddSplinePoint(); // Function Engine.SplineComponent.AddSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65e5324
	bool *31010fa750(); // Function Engine.SplineComponent.*31010fa750 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65ff348
	void *08e1e9ebdd(); // Function Engine.SplineComponent.*08e1e9ebdd // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65da230
	void *acc78471c0(int32* PointIndex); // Function Engine.SplineComponent.*acc78471c0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6605464
	void *898b520d62(); // Function Engine.SplineComponent.*898b520d62 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6605c00
	struct FVector *c308954174(struct FVector* InLeaveTangent); // Function Engine.SplineComponent.*c308954174 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x662e52c
	void *205c2e17a2(); // Function Engine.SplineComponent.*205c2e17a2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65fffc0
	bool *85f2ef909e(); // Function Engine.SplineComponent.*85f2ef909e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6607674
	void *dfab37a503(); // Function Engine.SplineComponent.*dfab37a503 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6630494
};

// Class Engine.MaterialInterface
// Size: 0x70 (Inherited: 0x28)
struct UMaterialInterface : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct USubsurfaceProfile* SubsurfaceProfile[0x08]; // 0x30(0x08)
	char pad_38[0x8]; // 0x38(0x08)
	struct F*31693f5ae2 LightmassSettings[0x14]; // 0x40(0x14)
	char pad_54[0x4]; // 0x54(0x04)
	struct TArray<struct F*8f67b6e0e6> *f16f190461[0x10]; // 0x58(0x10)
	char pad_68[0x8]; // 0x68(0x08)

	void *47cf8f9bb6(); // Function Engine.MaterialInterface.*47cf8f9bb6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65cac48
	void *c3924ed2b7(); // Function Engine.MaterialInterface.*c3924ed2b7 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x65c6240
};

// Class Engine.MaterialInstance
// Size: 0x1e0 (Inherited: 0x70)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial[0x08]; // 0x70(0x08)
	struct UMaterialInterface* Parent[0x08]; // 0x78(0x08)
	char *b4fdeda5cd : 1; // 0x80(0x01)
	char *6c011e6df7 : 1; // 0x80(0x01)
	char pad_80_2 : 1; // 0x80(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x80(0x01)
	char pad_80_4 : 4; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct TArray<struct F*a7bbc83ffe> FontParameterValues[0x10]; // 0x88(0x10)
	struct TArray<struct F*4ce84ba02f> ScalarParameterValues[0x10]; // 0x98(0x10)
	struct TArray<struct F*8a4a1d286a> TextureParameterValues[0x10]; // 0xa8(0x10)
	struct TArray<struct F*c2d53d1c03> VectorParameterValues[0x10]; // 0xb8(0x10)
	bool bOverrideBaseProperties; // 0xc8(0x01)
	char pad_C9[0x3]; // 0xc9(0x03)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides[0x24]; // 0xcc(0x24)
	char pad_F0[0xf0]; // 0xf0(0xf0)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x1e0 (Inherited: 0x1e0)
struct UMaterialInstanceConstant : UMaterialInstance {
};

// Class Engine.MaterialExpression
// Size: 0x60 (Inherited: 0x28)
struct UMaterialExpression : UObject {
	struct UMaterial* Material[0x08]; // 0x28(0x08)
	struct UMaterialFunction* Function[0x08]; // 0x30(0x08)
	struct FString Desc[0x10]; // 0x38(0x10)
	struct FColor BorderColor[0x04]; // 0x48(0x04)
	char *3a783ccbfb : 1; // 0x4c(0x01)
	char *a5da7c9fbf : 1; // 0x4c(0x01)
	char *46c0074c5d : 1; // 0x4c(0x01)
	char *2ed4c5fd64 : 1; // 0x4c(0x01)
	char *e676174cee : 1; // 0x4c(0x01)
	char *222a5b7244 : 1; // 0x4c(0x01)
	char *6ae63981e1 : 1; // 0x4c(0x01)
	char *d3a59df4e9 : 1; // 0x4c(0x01)
	char *e872c9d323 : 1; // 0x4d(0x01)
	char *9929d6a9bc : 1; // 0x4d(0x01)
	char *e975043135 : 1; // 0x4d(0x01)
	char pad_4D_3 : 5; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	struct TArray<struct FExpressionOutput> Outputs[0x10]; // 0x50(0x10)
};

// Class Engine.*9cae02a0c8
// Size: 0x60 (Inherited: 0x60)
struct U*9cae02a0c8 : UMaterialExpression {
};

// Class Engine.*6a03f15cb4
// Size: 0x60 (Inherited: 0x60)
struct U*6a03f15cb4 : UMaterialExpression {
};

// Class Engine.*0dbf8eac01
// Size: 0x28 (Inherited: 0x28)
struct U*0dbf8eac01 : UObject {

	void Activate(); // Function Engine.*0dbf8eac01.Activate // Native|Public|BlueprintCallable // @ game+0x58d1c6c
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x3b8 (Inherited: 0x2b0)
struct UBlueprintGeneratedClass : UClass {
	int32 NumReplicatedProperties[0x04]; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)
	struct TArray<struct U*3df69eb1ab*> *d50407421b[0x10]; // 0x2b8(0x10)
	struct TArray<struct UActorComponent*> *2618d515c0[0x10]; // 0x2c8(0x10)
	struct TArray<struct U*12776be9f9*> *7a479ec104[0x10]; // 0x2d8(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript[0x08]; // 0x2e8(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler[0x08]; // 0x2f0(0x08)
	struct UStructProperty* *e92387d3dd[0x08]; // 0x2f8(0x08)
	struct UFunction* *33c45f144f[0x08]; // 0x300(0x08)
	struct TArray<struct F*f871fdbfe8> FastCallPairs[0x10]; // 0x308(0x10)
	bool *b1de85ca98; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct TMap<struct FName, struct F*76eff26226> *8d069c690c[0x50]; // 0x320(0x50)
	bool *f13a1e87a4; // 0x370(0x01)
	char pad_371[0x47]; // 0x371(0x47)
};

// Class Engine.CameraActor
// Size: 0x990 (Inherited: 0x3e8)
struct ACameraActor : AActor {
	enum class EAutoReceiveInput *ed863f85b0; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct UCameraComponent* CameraComponent[0x08]; // 0x3f0(0x08)
	struct USceneComponent* SceneComponent[0x08]; // 0x3f8(0x08)
	char pad_400[0x8]; // 0x400(0x08)
	char bConstrainAspectRatio : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	float AspectRatio[0x04]; // 0x40c(0x04)
	float FOVAngle[0x04]; // 0x410(0x04)
	float PostProcessBlendWeight[0x04]; // 0x414(0x04)
	char pad_418[0x8]; // 0x418(0x08)
	struct FPostProcessSettings PostProcessSettings[0x570]; // 0x420(0x570)

	void *f3e4e78431(); // Function Engine.CameraActor.*f3e4e78431 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65c61e8
};

// Class Engine.UserDefinedStruct
// Size: 0x100 (Inherited: 0xf0)
struct UUserDefinedStruct : UScriptStruct {
	struct FGuid Guid[0x10]; // 0xf0(0x10)
};

// Class Engine.AISystemBase
// Size: 0x48 (Inherited: 0x28)
struct UAISystemBase : UObject {
	struct FStringClassReference AISystemClassName[0x10]; // 0x28(0x10)
	struct FName AISystemModuleName[0x08]; // 0x38(0x08)
	bool bInstantiateAISystemOnClient; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Engine.*1a2c4a78a0
// Size: 0x48 (Inherited: 0x28)
struct U*1a2c4a78a0 : UObject {
	struct TArray<struct F*32e4d16215> Areas[0x10]; // 0x28(0x10)
	struct F*85f602d0b9 IncludeFlags[0x04]; // 0x38(0x04)
	struct F*85f602d0b9 ExcludeFlags[0x04]; // 0x3c(0x04)
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Engine.*6c389a598a
// Size: 0x38 (Inherited: 0x28)
struct U*6c389a598a : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.Model
// Size: 0x560 (Inherited: 0x28)
struct UModel : UObject {
	char pad_28[0x538]; // 0x28(0x538)
};

// Class Engine.*cfd78a8c42
// Size: 0x28 (Inherited: 0x28)
struct U*cfd78a8c42 : UObject {
};

// Class Engine.*9e86854228
// Size: 0x28 (Inherited: 0x28)
struct U*9e86854228 : UObject {
};

// Class Engine.EdGraphNode
// Size: 0xa0 (Inherited: 0x28)
struct UEdGraphNode : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins[0x10]; // 0x38(0x10)
	int32 *61c5fd1f45[0x04]; // 0x48(0x04)
	int32 *957dc8ede2[0x04]; // 0x4c(0x04)
	int32 *1bc9527dfd[0x04]; // 0x50(0x04)
	int32 *99c349eabe[0x04]; // 0x54(0x04)
	char *017d7cfcfa : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct FString NodeComment[0x10]; // 0x60(0x10)
	bool *865c9c538c; // 0x70(0x01)
	bool *2ed4c5fd64; // 0x71(0x01)
	bool *310f58853a; // 0x72(0x01)
	char pad_73[0x1]; // 0x73(0x01)
	int32 *fbe5696df8[0x04]; // 0x74(0x04)
	struct FString *7beb49606d[0x10]; // 0x78(0x10)
	struct FGuid NodeGuid[0x10]; // 0x88(0x10)
	enum class ENodeAdvancedPins *2ec0f2d5a5; // 0x98(0x01)
	enum class ENodeEnabledState *1b089cec93; // 0x99(0x01)
	bool *a15c4f5c1f; // 0x9a(0x01)
	bool bIsNodeEnabled; // 0x9b(0x01)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x140 (Inherited: 0x28)
struct UEdGraphPin_Deprecated : UObject {
	struct FString PinName[0x10]; // 0x28(0x10)
	struct FString PinToolTip[0x10]; // 0x38(0x10)
	enum class EEdGraphPinDirection Direction; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct F*4342bfc443 PinType[0x80]; // 0x50(0x80)
	struct FString DefaultValue[0x10]; // 0xd0(0x10)
	struct FString *e7ac6b2bb0[0x10]; // 0xe0(0x10)
	struct UObject* *78be025fbb[0x08]; // 0xf0(0x08)
	struct FText *9f02b52b4e[0x18]; // 0xf8(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> *571292af4d[0x10]; // 0x110(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> *42fc9067df[0x10]; // 0x120(0x10)
	struct UEdGraphPin_Deprecated* *de5ae33e93[0x08]; // 0x130(0x08)
	struct UEdGraphPin_Deprecated* *3af63fd44c[0x08]; // 0x138(0x08)
};

// Class Engine.*44ca1cef30
// Size: 0x28 (Inherited: 0x28)
struct U*44ca1cef30 : UInterface {
};

// Class Engine.Level
// Size: 0x330 (Inherited: 0x28)
struct ULevel : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct U*cfe9bd80c3*> *0545d7fd4e[0x10]; // 0x30(0x10)
	struct TArray<struct FGuid> *2dafba22fe[0x10]; // 0x40(0x10)
	struct ALevelScriptActor* LevelScriptActor[0x08]; // 0x50(0x08)
	float *31c716180a[0x04]; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct UWorld* *654b8d1763[0x08]; // 0x60(0x08)
	struct ANavigationObjectBase* *a2165f48c4[0x08]; // 0x68(0x08)
	char pad_70[0x40]; // 0x70(0x40)
	struct U*33266603e2* ActorCluster[0x08]; // 0xb0(0x08)
	char pad_B8[0x38]; // 0xb8(0x38)
	struct ANavigationObjectBase* *81b2bad029[0x08]; // 0xf0(0x08)
	char pad_F8[0x78]; // 0xf8(0x78)
	struct FGuid *3d8a333984[0x10]; // 0x170(0x10)
	char pad_180[0x8]; // 0x180(0x08)
	struct UMapBuildDataRegistry* *7c9be48b22[0x08]; // 0x188(0x08)
	char pad_190_0 : 2; // 0x190(0x01)
	char *9f59dfe013 : 1; // 0x190(0x01)
	char bIsVisible : 1; // 0x190(0x01)
	char bLocked : 1; // 0x190(0x01)
	char *02e9790014 : 1; // 0x190(0x01)
	char pad_190_6 : 2; // 0x190(0x01)
	char pad_191[0x1f]; // 0x191(0x1f)
	float *c1eaeb8397[0x04]; // 0x1b0(0x04)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct TArray<struct U*b5dde59565*> *575b76f3d9[0x10]; // 0x1b8(0x10)
	char pad_1C8[0x10]; // 0x1c8(0x10)
	int32 *e9b2c9a902[0x04]; // 0x1d8(0x04)
	int32 *ef7f2cdc37[0x04]; // 0x1dc(0x04)
	struct UModel* Model[0x08]; // 0x1e0(0x08)
	char pad_1E8[0x8]; // 0x1e8(0x08)
	bool *11f6bfbd58; // 0x1f0(0x01)
	char pad_1F1[0x3]; // 0x1f1(0x03)
	struct FIntVector *edcaca8239[0x0c]; // 0x1f4(0x0c)
	char pad_200[0x8]; // 0x200(0x08)
	struct TArray<struct FVector> *71279b0e2d[0x10]; // 0x208(0x10)
	char pad_218[0xe8]; // 0x218(0xe8)
	struct AWorldSettings* WorldSettings[0x08]; // 0x300(0x08)
	char pad_308[0x8]; // 0x308(0x08)
	struct TArray<struct UAssetUserData*> AssetUserData[0x10]; // 0x310(0x10)
	char pad_320[0x10]; // 0x320(0x10)
};

// Class Engine.*3a93198c95
// Size: 0x28 (Inherited: 0x28)
struct U*3a93198c95 : UInterface {
};

// Class Engine.AmbientSound
// Size: 0x3f0 (Inherited: 0x3e8)
struct AAmbientSound : AActor {
	struct UAudioComponent* AudioComponent[0x08]; // 0x3e8(0x08)

	float AdjustVolume(); // Function Engine.AmbientSound.AdjustVolume // Final|Native|Public|BlueprintCallable // @ game+0x65be794
	float *a2584d7220(); // Function Engine.AmbientSound.*a2584d7220 // Final|Native|Public|BlueprintCallable // @ game+0x65c4f04
	void Stop(); // Function Engine.AmbientSound.Stop // Final|Native|Public|BlueprintCallable // @ game+0x65dec80
	void Play(); // Function Engine.AmbientSound.Play // Final|Native|Public|BlueprintCallable // @ game+0x65d3784
	float FadeOut(); // Function Engine.AmbientSound.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0x65c4ff4
};

// Class Engine.AutoBenchSettings
// Size: 0x40 (Inherited: 0x28)
struct UAutoBenchSettings : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct F*3fd7aec64b> Settings[0x10]; // 0x30(0x10)
};

// Class Engine.AutoBenchControlActor
// Size: 0x3e8 (Inherited: 0x3e8)
struct AAutoBenchControlActor : AActor {
};

// Class Engine.*d1d2b8698a
// Size: 0x28 (Inherited: 0x28)
struct U*d1d2b8698a : UObject {
};

// Class Engine.*9c3aeb490a
// Size: 0x28 (Inherited: 0x28)
struct U*9c3aeb490a : UInterface {
};

// Class Engine.BillboardComponent
// Size: 0xa20 (Inherited: 0xa00)
struct UBillboardComponent : UPrimitiveComponent {
	struct UTexture2D* Sprite[0x08]; // 0x9f8(0x08)
	char bIsScreenSizeScaled : 1; // 0xa00(0x01)
	float ScreenSize[0x04]; // 0xa04(0x04)
	float U[0x04]; // 0xa08(0x04)
	float UL[0x04]; // 0xa0c(0x04)
	float V[0x04]; // 0xa10(0x04)
	float VL[0x04]; // 0xa14(0x04)
	struct FColor Color[0x04]; // 0xa18(0x04)

	void *fe62714d9b(int32* NewU, int32* NewV); // Function Engine.BillboardComponent.*fe62714d9b // Native|Public|BlueprintCallable // @ game+0x65ddad4
	void *6a7a2b4bb4(); // Function Engine.BillboardComponent.*6a7a2b4bb4 // Native|Public|BlueprintCallable // @ game+0x65dd380
	int32 *26dee22cc2(); // Function Engine.BillboardComponent.*26dee22cc2 // Native|Public|BlueprintCallable // @ game+0x65dd414
	void SetColor(); // Function Engine.BillboardComponent.SetColor // Final|Native|Public|HasDefaults // @ game+0x65d9da0
};

// Class Engine.*8db539420c
// Size: 0x28 (Inherited: 0x28)
struct U*8db539420c : UInterface {
};

// Class Engine.StaticMesh
// Size: 0x170 (Inherited: 0x28)
struct UStaticMesh : UObject {
	char pad_28[0x18]; // 0x28(0x18)
	int32 MinLOD[0x04]; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct UMaterialInterface*> Materials[0x10]; // 0x48(0x10)
	struct TArray<struct F*534d06babb> StaticMaterials[0x10]; // 0x58(0x10)
	float *23cf50e234[0x04]; // 0x68(0x04)
	int32 LightMapResolution[0x04]; // 0x6c(0x04)
	int32 *be31f80f30[0x04]; // 0x70(0x04)
	float *722c540fe9[0x04]; // 0x74(0x04)
	struct UBodySetup* BodySetup[0x08]; // 0x78(0x08)
	int32 *f2ad808c42[0x04]; // 0x80(0x04)
	char *7c9cde204d : 1; // 0x84(0x01)
	char *122eb607ef : 1; // 0x84(0x01)
	char bStripComplexCollisionForConsole : 1; // 0x84(0x01)
	char *33a7a5f335 : 1; // 0x84(0x01)
	char bRequiresAreaWeightedSampling : 1; // 0x84(0x01)
	char pad_84_5 : 3; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	float LpvBiasMultiplier[0x04]; // 0x88(0x04)
	bool *198183bc1f; // 0x8c(0x01)
	char pad_8D[0x33]; // 0x8d(0x33)
	struct TArray<struct U*2ee8b8c92f*> Sockets[0x10]; // 0xc0(0x10)
	char pad_D0[0x10]; // 0xd0(0x10)
	struct FVector *10c1bdc006[0x0c]; // 0xe0(0x0c)
	struct FVector *609721a3eb[0x0c]; // 0xec(0x0c)
	struct FBoxSphereBounds *b31255077e[0x1c]; // 0xf8(0x1c)
	bool *2c12e476e1; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	int32 *618491fca8[0x04]; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct TArray<struct UAssetUserData*> AssetUserData[0x10]; // 0x120(0x10)
	struct UNavCollision* NavCollision[0x08]; // 0x130(0x08)
	struct F*795e425430 *b27fae7125[0x28]; // 0x138(0x28)
	struct TArray<struct UMaterialInstanceConstant*> *1891538393[0x10]; // 0x160(0x10)

	void *c579dd6c1d(); // Function Engine.StaticMesh.*c579dd6c1d // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6c68
	void *db9c4dbc4e(); // Function Engine.StaticMesh.*db9c4dbc4e // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca294
	void *7a6b970ee0(); // Function Engine.StaticMesh.*7a6b970ee0 // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65c6b60
	void *edfa89fbf9(int32* InLOD); // Function Engine.StaticMesh.*edfa89fbf9 // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65ca304
};

// Class Engine.*d152ab6626
// Size: 0x5f0 (Inherited: 0x4d0)
struct U*d152ab6626 : USceneComponent {
	struct FVector Extents[0x0c]; // 0x4d0(0x0c)
	struct FVector FadeExtents_Neg[0x0c]; // 0x4dc(0x0c)
	struct FVector FadeExtents_Pos[0x0c]; // 0x4e8(0x0c)
	bool bOutdoorTransition; // 0x4f4(0x01)
	char pad_4F5[0x3]; // 0x4f5(0x03)
	float VolumeAlpha[0x04]; // 0x4f8(0x04)
	float Brightness[0x04]; // 0x4fc(0x04)
	float SkyIntensity[0x04]; // 0x500(0x04)
	int32 Priority[0x04]; // 0x504(0x04)
	struct F*944fc9bb94 AmbientCube2[0xc8]; // 0x508(0xc8)
	char pad_5D0[0x20]; // 0x5d0(0x20)

	void *fc50369d15(); // Function Engine.*d152ab6626.*fc50369d15 // Final|Native|Public // @ game+0xbf00fc
};

// Class Engine.GIVolumesContainerComponent
// Size: 0x4f0 (Inherited: 0x4d0)
struct UGIVolumesContainerComponent : USceneComponent {
	char pad_4D0[0x20]; // 0x4d0(0x20)
};

// Class Engine.BoxGIVolume
// Size: 0x3f0 (Inherited: 0x3e8)
struct ABoxGIVolume : AActor {
	struct U*d152ab6626* VolumeComponent[0x08]; // 0x3e8(0x08)
};

// Class Engine.BrushShape
// Size: 0x420 (Inherited: 0x420)
struct ABrushShape : ABrush {
};

// Class Engine.AudioVolume
// Size: 0x468 (Inherited: 0x420)
struct AAudioVolume : AVolume {
	float Priority[0x04]; // 0x420(0x04)
	char bEnabled : 1; // 0x424(0x01)
	char pad_424_1 : 7; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	struct FReverbSettings Settings[0x18]; // 0x428(0x18)
	struct F*3e305a18ce AmbientZoneSettings[0x24]; // 0x440(0x24)
	char pad_464[0x4]; // 0x464(0x04)

	void SetReverbSettings(); // Function Engine.AudioVolume.SetReverbSettings // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65dd228
	void SetPriority(); // Function Engine.AudioVolume.SetPriority // Final|Native|Public|BlueprintCallable // @ game+0x65dcd50
	void OnRep_bEnabled(); // Function Engine.AudioVolume.OnRep_bEnabled // Final|Native|Private // @ game+0x58aed64
	void *97d87abcd2(); // Function Engine.AudioVolume.*97d87abcd2 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65db3d8
	void *61153ffc78(); // Function Engine.AudioVolume.*61153ffc78 // Final|Native|Public|BlueprintCallable // @ game+0x65da7a0
};

// Class Engine.BlockingVolume
// Size: 0x420 (Inherited: 0x420)
struct ABlockingVolume : AVolume {
};

// Class Engine.CameraBlockingVolume
// Size: 0x420 (Inherited: 0x420)
struct ACameraBlockingVolume : AVolume {
};

// Class Engine.CullDistanceVolume
// Size: 0x448 (Inherited: 0x420)
struct ACullDistanceVolume : AVolume {
	struct TArray<struct F*1eaa6792c3> CullDistances[0x10]; // 0x420(0x10)
	char bEnabled : 1; // 0x430(0x01)
	char pad_430_1 : 7; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	float CullDistanceForLODActor[0x04]; // 0x434(0x04)
	float CullDistanceForLODActorTooFar[0x04]; // 0x438(0x04)
	bool bUseActorBound; // 0x43c(0x01)
	char pad_43D[0x3]; // 0x43d(0x03)
	float IgnoreActorBoundSize[0x04]; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class Engine.LevelStreamingVolume
// Size: 0x438 (Inherited: 0x420)
struct ALevelStreamingVolume : AVolume {
	struct TArray<struct FName> StreamingLevelNames[0x10]; // 0x420(0x10)
	char bEditorPreVisOnly : 1; // 0x430(0x01)
	char bDisabled : 1; // 0x430(0x01)
	char pad_430_2 : 6; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	enum class *8d2645b9ee StreamingUsage; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
};

// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x420 (Inherited: 0x420)
struct ALightmassCharacterIndirectDetailVolume : AVolume {
};

// Class Engine.LightmassImportanceVolume
// Size: 0x420 (Inherited: 0x420)
struct ALightmassImportanceVolume : AVolume {
};

// Class Engine.MeshMergeCullingVolume
// Size: 0x420 (Inherited: 0x420)
struct AMeshMergeCullingVolume : AVolume {
};

// Class Engine.NavMeshBoundsVolume
// Size: 0x428 (Inherited: 0x420)
struct ANavMeshBoundsVolume : AVolume {
	struct FNavAgentSelector SupportedAgents[0x04]; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
};

// Class Engine.DefaultPhysicsVolume
// Size: 0x438 (Inherited: 0x438)
struct ADefaultPhysicsVolume : APhysicsVolume {
};

// Class Engine.KillZVolume
// Size: 0x438 (Inherited: 0x438)
struct AKillZVolume : APhysicsVolume {
};

// Class Engine.PainCausingVolume
// Size: 0x460 (Inherited: 0x438)
struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x438(0x01)
	char pad_438_1 : 7; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	float DamagePerSec[0x04]; // 0x43c(0x04)
	struct UClass* DamageType[0x08]; // 0x440(0x08)
	float PainInterval[0x04]; // 0x448(0x04)
	char bEntryPain : 1; // 0x44c(0x01)
	char *b3a1603483 : 1; // 0x44c(0x01)
	char pad_44C_2 : 6; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
