// ScriptStruct Foliage.*8088cd7e9b
// Size: 0x0c (Inherited: 0x00)
struct F*8088cd7e9b {
	char *ba73e28f22 : 1; // 0x00(0x01)
	char pad_0_1 : 7; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *6bf6f4e896[0x04]; // 0x04(0x04)
	char *b2102e2e3e : 1; // 0x08(0x01)
	char pad_8_1 : 7; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct Foliage.*25271daf79
// Size: 0x60 (Inherited: 0x00)
struct F*25271daf79 {
	struct FVector Location[0x0c]; // 0x00(0x0c)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FQuat Rotation[0x10]; // 0x10(0x10)
	struct FVector Normal[0x0c]; // 0x20(0x0c)
	float Age[0x04]; // 0x2c(0x04)
	float Scale[0x04]; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct UFoliageType_InstancedStaticMesh* Type[0x08]; // 0x38(0x08)
	char pad_40[0x20]; // 0x40(0x20)
};

// ScriptStruct Foliage.FoliageTypeObject
// Size: 0x20 (Inherited: 0x00)
struct FFoliageTypeObject {
	struct UObject* FoliageTypeObject[0x08]; // 0x00(0x08)
	struct UFoliageType_InstancedStaticMesh* *636f1434f9[0x08]; // 0x08(0x08)
	bool *2dc1fc9151; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct UClass* Type[0x08]; // 0x18(0x08)
};

