// ScriptStruct RoadRuntime.*4c7ad277d8
// Size: 0x20 (Inherited: 0x00)
struct F*4c7ad277d8 {
	struct UStaticMesh* Prototype[0x08]; // 0x00(0x08)
	struct AActor* Owner[0x08]; // 0x08(0x08)
	struct UStaticMeshComponent* SideMesh[0x08]; // 0x10(0x08)
	int32 *67b55bb096[0x04]; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*da3fc6fcb8
// Size: 0x18 (Inherited: 0x00)
struct F*da3fc6fcb8 {
	struct UClass* Prototype[0x08]; // 0x00(0x08)
	struct AActor* *de85641032[0x08]; // 0x08(0x08)
	int32 *67b55bb096[0x04]; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct RoadRuntime.*fc659451b0
// Size: 0x20 (Inherited: 0x00)
struct F*fc659451b0 {
	struct UStaticMesh* Prototype[0x08]; // 0x00(0x08)
	struct AActor* Owner[0x08]; // 0x08(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* *c25964cb6a[0x08]; // 0x10(0x08)
	int32 *67b55bb096[0x04]; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*bad823b6c7
// Size: 0x88 (Inherited: 0x00)
struct F*bad823b6c7 {
	struct AActor* Owner[0x08]; // 0x00(0x08)
	struct UStaticMesh* Prototype[0x08]; // 0x08(0x08)
	struct UStaticMesh* *049352500e[0x08]; // 0x10(0x08)
	struct UStaticMesh* *65e9253149[0x08]; // 0x18(0x08)
	struct TArray<struct USplineMeshComponent*> *e4c767b303[0x10]; // 0x20(0x10)
	struct USplineComponent* Spline[0x08]; // 0x30(0x08)
	int32 *267cd82b80[0x04]; // 0x38(0x04)
	int32 *67b55bb096[0x04]; // 0x3c(0x04)
	int32 *7abec01989[0x04]; // 0x40(0x04)
	int32 *862dc237ba[0x04]; // 0x44(0x04)
	struct FVector Offset[0x0c]; // 0x48(0x0c)
	struct FVector Scale[0x0c]; // 0x54(0x0c)
	bool *84060b5a99; // 0x60(0x01)
	bool StartEnable; // 0x61(0x01)
	bool EndEnable; // 0x62(0x01)
	char pad_63[0x5]; // 0x63(0x05)
	struct FInterpCurveVector *7fbc8dae1b[0x18]; // 0x68(0x18)
	float *f1b60e7c8b[0x04]; // 0x80(0x04)
	float *3ba423e0a3[0x04]; // 0x84(0x04)
};

// ScriptStruct RoadRuntime.*6332d153d5
// Size: 0x20 (Inherited: 0x00)
struct F*6332d153d5 {
	struct UClass* Prototype[0x08]; // 0x00(0x08)
	struct TArray<struct AActor*> *8de59d22d8[0x10]; // 0x08(0x10)
	int32 *67b55bb096[0x04]; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*5a44f122d3
// Size: 0x20 (Inherited: 0x00)
struct F*5a44f122d3 {
	struct FVector Position[0x0c]; // 0x00(0x0c)
	struct FVector Tangent[0x0c]; // 0x0c(0x0c)
	float Scale[0x04]; // 0x18(0x04)
	float Roll[0x04]; // 0x1c(0x04)
};

