// ScriptStruct TslCommon.LogBase
// Size: 0x60 (Inherited: 0x00)
struct FLogBase {
	char pad_0[0x8]; // 0x00(0x08)
	struct FLogCommon Common[0x28]; // 0x08(0x28)
	int32 _V[0x04]; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString _D[0x10]; // 0x38(0x10)
	struct FString _T[0x10]; // 0x48(0x10)
	bool _U; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
};

// ScriptStruct TslCommon.LogCommon
// Size: 0x28 (Inherited: 0x00)
struct FLogCommon {
	struct FString MatchId[0x10]; // 0x00(0x10)
	struct FString MapName[0x10]; // 0x10(0x10)
	float IsGame[0x04]; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslCommon.GameEventBase
// Size: 0x10 (Inherited: 0x00)
struct FGameEventBase {
	int32 _V[0x04]; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FName _T[0x08]; // 0x08(0x08)
};

