// ScriptStruct TslGame.*9838798d84
// Size: 0x40 (Inherited: 0x00)
struct F*9838798d84 {
	enum class EWeaponAttachmentSlotID AttachmentSlotID; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName AttachmentTag; // 0x08(0x08)
	struct UStaticMesh* AttachmentMeshAsset; // 0x10(0x20)
	struct FName AttachmentMeshName; // 0x30(0x08)
	struct UClass* AttachmentTemplate; // 0x38(0x08)
};

// ScriptStruct TslGame.DeathMessage
// Size: 0x108 (Inherited: 0x00)
struct FDeathMessage {
	struct FText KillerName; // 0x00(0x18)
	struct FText VictimName; // 0x18(0x18)
	struct FText KillerUniqueId; // 0x30(0x18)
	struct FUniqueNetIdRepl GroggyCauserUniqueId; // 0x48(0x18)
	struct FText VictimUniqueId; // 0x60(0x18)
	char bKillerIsOwner : 1; // 0x78(0x01)
	char bVictimIsOwner : 1; // 0x78(0x01)
	char bVictimIsPillar : 1; // 0x78(0x01)
	char bVictimIsMonster : 1; // 0x78(0x01)
	char pad_78_4 : 4; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	int32 KillerTeamNum; // 0x7c(0x04)
	int32 VictimTeamNum; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UTslDamageType* DamageType; // 0x88(0x08)
	struct FText InsertMessage; // 0x90(0x18)
	enum class EDamageReason DamageReason; // 0xa8(0x01)
	bool bGroggy; // 0xa9(0x01)
	char pad_AA[0x2]; // 0xaa(0x02)
	int32 AlivePlayerNum; // 0xac(0x04)
	int32 AliveTeamNum; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct FText DamageCauserName; // 0xb8(0x18)
	int32 DamageCauserLevel; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct UTexture* DamageCauserIcon; // 0xd8(0x08)
	float DamageCauserIconRatio; // 0xe0(0x04)
	bool bIsKillerExist; // 0xe4(0x01)
	bool bIsStealKilled; // 0xe5(0x01)
	bool bIsObserver; // 0xe6(0x01)
	bool bIsObserverAndKillerIsSpectated; // 0xe7(0x01)
	bool bIsObserverAndVictimIsSpectated; // 0xe8(0x01)
	bool bIsMidGameBanMessage; // 0xe9(0x01)
	char pad_EA[0x2]; // 0xea(0x02)
	float DistanceFromKillerToVictim; // 0xec(0x04)
	enum class EOutGamePlatformProvider KillerPlatform; // 0xf0(0x01)
	enum class EOutGamePlatformProvider VictimPlatform; // 0xf1(0x01)
	char pad_F2[0x16]; // 0xf2(0x16)
};

// ScriptStruct TslGame.*be1385e6be
// Size: 0x18 (Inherited: 0x00)
struct F*be1385e6be {
	struct F*a71ff1d84f *2eb8acfc28; // 0x00(0x08)
	struct F*a71ff1d84f WeaponPackage; // 0x08(0x08)
	struct F*a71ff1d84f HealingPackage; // 0x10(0x08)
};

// ScriptStruct TslGame.*a71ff1d84f
// Size: 0x08 (Inherited: 0x00)
struct F*a71ff1d84f {
	bool bEnable; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *7b58746405; // 0x04(0x04)
};

// ScriptStruct TslGame.*c89dcd5ffa
// Size: 0x10 (Inherited: 0x00)
struct F*c89dcd5ffa {
	bool Show; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D MarkerPosition; // 0x04(0x08)
	enum class EMarkerType MarkerType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*112524b471
// Size: 0x20 (Inherited: 0x10)
struct F*112524b471 : F*b401aacf4f {
	struct FVector SpawnPosition; // 0x10(0x0c)
	float *54d516b584; // 0x1c(0x04)
};

// ScriptStruct TslGame.*b401aacf4f
// Size: 0x10 (Inherited: 0x00)
struct F*b401aacf4f {
	enum class EPlatoonSupportRequestEventType EventType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 *890157587e; // 0x04(0x04)
	bool *77381f0ba7; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float StartTime; // 0x0c(0x04)
};

// ScriptStruct TslGame.*17c4bf8eb1
// Size: 0x24 (Inherited: 0x10)
struct F*17c4bf8eb1 : F*b401aacf4f {
	enum class EPlatoonCarePackageType CarePackageType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 *761f6a5dd5; // 0x14(0x04)
	struct FVector *79411e3858; // 0x18(0x0c)
};

// ScriptStruct TslGame.*9e2fb1fc29
// Size: 0x58 (Inherited: 0x00)
struct F*9e2fb1fc29 {
	float *7ef561ae65; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UClass* *271a14efcc; // 0x08(0x08)
	struct ATslPlayerState* *f0930cbb3a; // 0x10(0x08)
	struct FVector_NetQuantize *4ca2642646; // 0x18(0x0c)
	struct FVector_NetQuantize *897bbee1fc; // 0x24(0x0c)
	struct FName BoneName; // 0x30(0x08)
	float *1bcc6a9d65; // 0x38(0x04)
	bool *94a417d482; // 0x3c(0x01)
	bool *28fa793cd4; // 0x3d(0x01)
	char *c3bd8e6ffb : 1; // 0x3e(0x01)
	char *8e390e3457 : 1; // 0x3e(0x01)
	char *ea2912f1ee : 1; // 0x3e(0x01)
	char pad_3E_3 : 5; // 0x3e(0x01)
	bool *69722c6426; // 0x3f(0x01)
	struct FName *3891dcaf73; // 0x40(0x08)
	struct FVector AttackerLocation; // 0x48(0x0c)
	char pad_54[0x4]; // 0x54(0x04)
};

// ScriptStruct TslGame.*4373200898
// Size: 0x30 (Inherited: 0x00)
struct F*4373200898 {
	struct FString PartyId; // 0x00(0x10)
	bool IsPartyLeader; // 0x10(0x01)
	enum class ERequestPartyState PartyState; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	int32 *22114d7cfe; // 0x14(0x04)
	bool *546174d557; // 0x18(0x01)
	char pad_19[0x17]; // 0x19(0x17)
};

// ScriptStruct TslGame.*e50dfb6777
// Size: 0x20 (Inherited: 0x00)
struct F*e50dfb6777 {
	char pad_0[0x8]; // 0x00(0x08)
	struct AActor* TargetActor; // 0x08(0x08)
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct TslGame.*65fdb36905
// Size: 0x20 (Inherited: 0x00)
struct F*65fdb36905 {
	int32 *10f1fd67c7; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FText *f13e39dcab; // 0x08(0x18)
};

// ScriptStruct TslGame.*fc2fac7f6e
// Size: 0x28 (Inherited: 0x00)
struct F*fc2fac7f6e {
	int32 *3b9eaefc55; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct ATslCharacter* Rider; // 0x08(0x08)
	char pad_10[0x18]; // 0x10(0x18)
};

// ScriptStruct TslGame.*7ceabb3d87
// Size: 0x10 (Inherited: 0x00)
struct F*7ceabb3d87 {
	float *264706d8ee; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)
};

// ScriptStruct TslGame.*d2abe40071
// Size: 0x10 (Inherited: 0x00)
struct F*d2abe40071 {
	struct FVector2D *653c283cc1; // 0x00(0x08)
	struct FVector2D *9d75f0e5cb; // 0x08(0x08)
};

// ScriptStruct TslGame.*affa79da30
// Size: 0x10 (Inherited: 0x00)
struct F*affa79da30 {
	float DemoTime; // 0x00(0x04)
	float FogFallOff; // 0x04(0x04)
	float FogStartDistance; // 0x08(0x04)
	float FogDensity; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslPlayerStateSummary
// Size: 0x40 (Inherited: 0x00)
struct FTslPlayerStateSummary {
	struct FString UniqueId; // 0x00(0x10)
	struct FString PlayerName; // 0x10(0x10)
	int32 TeamNumber; // 0x20(0x04)
	int32 Ranking; // 0x24(0x04)
	int32 HeadShots; // 0x28(0x04)
	int32 NumKills; // 0x2c(0x04)
	float TotalGivenDamages; // 0x30(0x04)
	float LongestDistanceKill; // 0x34(0x04)
	float TotalMovedDistanceMeter; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct TslGame.TslReplaySummary
// Size: 0x90 (Inherited: 0x00)
struct FTslReplaySummary {
	struct FString MatchId; // 0x00(0x10)
	bool bIsServerRecording; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString RecordUserId; // 0x18(0x10)
	struct FString RecordAccountId; // 0x28(0x10)
	struct FString RecordUserNickName; // 0x38(0x10)
	struct FString MapName; // 0x48(0x10)
	struct FString WeatherName; // 0x58(0x10)
	struct FString RegionName; // 0x68(0x10)
	int32 NumPlayers; // 0x78(0x04)
	int32 NumTeams; // 0x7c(0x04)
	struct TArray<struct FTslPlayerStateSummary> PlayerStateSummaries; // 0x80(0x10)
};

// ScriptStruct TslGame.*e7e9a5bdcb
// Size: 0xe0 (Inherited: 0x00)
struct F*e7e9a5bdcb {
	int32 DataSetNumber; // 0x00(0x04)
	int32 TimeMS; // 0x04(0x04)
	bool IsSkip; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct FString Type; // 0x10(0x10)
	float FOV; // 0x20(0x04)
	float PositionX; // 0x24(0x04)
	float PositionY; // 0x28(0x04)
	float PositionZ; // 0x2c(0x04)
	float RotationX; // 0x30(0x04)
	float RotationY; // 0x34(0x04)
	float RotationZ; // 0x38(0x04)
	float Angle; // 0x3c(0x04)
	struct FString Target; // 0x40(0x10)
	struct FString InterpolationType; // 0x50(0x10)
	struct FString CameraDirection; // 0x60(0x10)
	struct FString ReplaySpeed; // 0x70(0x10)
	bool IsAutoExposureEnable; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct FString DofMethod; // 0x88(0x10)
	float DofFocalRegion; // 0x98(0x04)
	bool IsDofAutoFocus; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float DofFocalDistance; // 0xa0(0x04)
	float DofNearTransitionRegion; // 0xa4(0x04)
	float DofFarTransitionRegion; // 0xa8(0x04)
	float DofBokehScale; // 0xac(0x04)
	float DofBokehMaxSize; // 0xb0(0x04)
	float DofGaussianNearBlurSize; // 0xb4(0x04)
	float DofGaussianFarBlurSize; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct FString ColorGradingLUT; // 0xc0(0x10)
	float ColorGradingLUTIntensity; // 0xd0(0x04)
	float BloomIntensity; // 0xd4(0x04)
	float VignetteIntensity; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
};

// ScriptStruct TslGame.*34790984c7
// Size: 0x38 (Inherited: 0x00)
struct F*34790984c7 {
	float DemoTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString Weather; // 0x08(0x10)
	enum class ETslOvercastAction Action; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float InitElapsedTime; // 0x1c(0x04)
	float SaturateTime; // 0x20(0x04)
	float BlendInTime; // 0x24(0x04)
	float BlendOutTime; // 0x28(0x04)
	float TimeMultiplier; // 0x2c(0x04)
	float ThunderAngle; // 0x30(0x04)
	float ThunderDistance; // 0x34(0x04)
};

// ScriptStruct TslGame.*424f548ed5
// Size: 0x98 (Inherited: 0x00)
struct F*424f548ed5 {
	bool bIsCustomGame; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString MapName; // 0x08(0x10)
	struct FString ModeName; // 0x18(0x10)
	struct FString MatchId; // 0x28(0x10)
	int32 TeamCount; // 0x38(0x04)
	int32 MinPlayerCount; // 0x3c(0x04)
	int32 MaxPlayerCount; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TMap<struct FString, struct FString> StringParameter; // 0x48(0x50)
};

// ScriptStruct TslGame.*9aaec12821
// Size: 0x50 (Inherited: 0x00)
struct F*9aaec12821 {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.TslOutGameLog
// Size: 0x20 (Inherited: 0x00)
struct FTslOutGameLog {
	struct FString Type; // 0x00(0x10)
	struct FString Log; // 0x10(0x10)
};

// ScriptStruct TslGame.*d6b757f916
// Size: 0x10 (Inherited: 0x00)
struct F*d6b757f916 {
	struct UExponentialHeightFogComponent* *87e86f506b; // 0x00(0x08)
	bool *bd099d998a; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct TslGame.*80e578280b
// Size: 0x20 (Inherited: 0x00)
struct F*80e578280b {
	enum class EQualityType QualityType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText DisplayQualityLevelName; // 0x08(0x18)
};

// ScriptStruct TslGame.TslMissionInLobby
// Size: 0x88 (Inherited: 0x00)
struct FTslMissionInLobby {
	struct FString MissionId; // 0x00(0x10)
	bool bAchieved; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString Description; // 0x18(0x10)
	int32 Priority; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FString Type; // 0x30(0x10)
	bool bLocked; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float ProgressRatio; // 0x44(0x04)
	struct FString ProgressText; // 0x48(0x10)
	struct FString MissionIconName; // 0x58(0x10)
	int32 InitialProgress; // 0x68(0x04)
	int32 CurrentProgress; // 0x6c(0x04)
	int32 MaximumProgress; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct TArray<struct FName> TargetGameModeList; // 0x78(0x10)
};

// ScriptStruct TslGame.PointInfo
// Size: 0x08 (Inherited: 0x00)
struct FPointInfo {
	int32 *fdb1eadf19; // 0x00(0x04)
	int32 *1a3b0e6d38; // 0x04(0x04)
};

// ScriptStruct TslGame.TeamInfo
// Size: 0x50 (Inherited: 0x00)
struct FTeamInfo {
	struct FString TeamName; // 0x00(0x10)
	struct FString *bee7c8c473; // 0x10(0x10)
	struct UTexture2D* TeamIcon; // 0x20(0x08)
	struct FLinearColor TeamColor; // 0x28(0x10)
	struct FLinearColor *af74ec4873; // 0x38(0x10)
	struct UTexture2D* TeamMember; // 0x48(0x08)
};

// ScriptStruct TslGame.ReplayItem
// Size: 0x100 (Inherited: 0x00)
struct FReplayItem {
	struct FString FriendlyName; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	bool bIsLive; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FDateTime Date; // 0x28(0x08)
	int32 SizeInBytes; // 0x30(0x04)
	int32 LengthInMS; // 0x34(0x04)
	int32 NumViewers; // 0x38(0x04)
	bool bIncomplete; // 0x3c(0x01)
	bool bIsVersionCompatible; // 0x3d(0x01)
	bool bIsCorrupted; // 0x3e(0x01)
	bool bIsServerRecording; // 0x3f(0x01)
	bool bShouldKeep; // 0x40(0x01)
	bool bArchived; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct FString GameVersion; // 0x48(0x10)
	int32 MK3DReplayVersion; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FString Mode; // 0x60(0x10)
	struct FString RecordUserId; // 0x70(0x10)
	struct FString RecordUserNickName; // 0x80(0x10)
	struct FString MapName; // 0x90(0x10)
	bool bAllDeadOrWin; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	int32 ArchiveSizeInBytes; // 0xa4(0x04)
	bool bIsClip; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	int32 ClipTime; // 0xac(0x04)
	int32 ClipStartTime; // 0xb0(0x04)
	int32 ClipEndTime; // 0xb4(0x04)
	struct FString ClipTargetUserId; // 0xb8(0x10)
	struct FString ClipTargetUserNickName; // 0xc8(0x10)
	struct FString ReportToken; // 0xd8(0x10)
	struct FString RecordAccountId; // 0xe8(0x10)
	bool bHaveCameraEvent; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
};

// ScriptStruct TslGame.*98720d9f9a
// Size: 0xb8 (Inherited: 0x00)
struct F*98720d9f9a {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString KillerName; // 0x38(0x10)
	struct FString KillerNetId; // 0x48(0x10)
	struct FString VictimName; // 0x58(0x10)
	struct FString VictimNetId; // 0x68(0x10)
	struct FString DamageCauseClassName; // 0x78(0x10)
	int32 DamageTypeCategory; // 0x88(0x04)
	int32 DamageReason; // 0x8c(0x04)
	bool bGroggy; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FString KillerPlayerId; // 0x98(0x10)
	struct FString VictimPlayerId; // 0xa8(0x10)
};

// ScriptStruct TslGame.*a8c8c664fc
// Size: 0x138 (Inherited: 0x00)
struct F*a8c8c664fc {
	float LastUpdateTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString KillerUniqueId; // 0x08(0x10)
	struct FString KillerName; // 0x18(0x10)
	struct FString KillerPlayerId; // 0x28(0x10)
	struct FString VictimUniqueId; // 0x38(0x10)
	struct FString VictimName; // 0x48(0x10)
	struct FString VictimPlayerId; // 0x58(0x10)
	char pad_68[0xd0]; // 0x68(0xd0)
};

// ScriptStruct TslGame.*3eb798592d
// Size: 0x58 (Inherited: 0x00)
struct F*3eb798592d {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString RecordTargetName; // 0x38(0x10)
	struct FString RecordTargetNetId; // 0x48(0x10)
};

// ScriptStruct TslGame.*e765429fc9
// Size: 0x68 (Inherited: 0x00)
struct F*e765429fc9 {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString EtceteraEventCode; // 0x38(0x10)
	struct FString TargetNetId; // 0x48(0x10)
	struct FString TargetName; // 0x58(0x10)
};

// ScriptStruct TslGame.*40f7e135b1
// Size: 0xb8 (Inherited: 0x00)
struct F*40f7e135b1 {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString InstigatorName; // 0x38(0x10)
	struct FString InstigatorNetId; // 0x48(0x10)
	struct FString VictimName; // 0x58(0x10)
	struct FString VictimNetId; // 0x68(0x10)
	struct FString DamageCauseClassName; // 0x78(0x10)
	int32 DamageTypeCategory; // 0x88(0x04)
	int32 DamageReason; // 0x8c(0x04)
	bool bGroggy; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FString InstigatorPlayerId; // 0x98(0x10)
	struct FString VictimPlayerId; // 0xa8(0x10)
};

// ScriptStruct TslGame.*d81ea09ca7
// Size: 0x18 (Inherited: 0x00)
struct F*d81ea09ca7 {
	int32 *a2370ef132; // 0x00(0x04)
	int32 *53ca9f22e7; // 0x04(0x04)
	struct TArray<struct F*809cd6de52> *6984441835; // 0x08(0x10)
};

// ScriptStruct TslGame.*809cd6de52
// Size: 0x18 (Inherited: 0x00)
struct F*809cd6de52 {
	struct TArray<struct F*0934dcbc16> *5dbe81c54b; // 0x00(0x10)
	bool bIsLastStage; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 *70b54512d9; // 0x14(0x04)
};

// ScriptStruct TslGame.*0934dcbc16
// Size: 0x60 (Inherited: 0x00)
struct F*0934dcbc16 {
	struct TArray<struct F*06ef2d1f12> *eb63b16136; // 0x00(0x10)
	struct TArray<int32> *318cda6a3e; // 0x10(0x10)
	int32 *c784d5d056; // 0x20(0x04)
	int32 *88d5d1401f; // 0x24(0x04)
	enum class EArenaState *0934dcbc16; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float *d2ee2525da; // 0x2c(0x04)
	float *5c5e91e350; // 0x30(0x04)
	float *5ba4c74e64; // 0x34(0x04)
	float *ce7bb02ff8; // 0x38(0x04)
	int32 *b6ad7407d1; // 0x3c(0x04)
	float *53a9319354; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FString Name; // 0x48(0x10)
	int32 *d02a609731; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct TslGame.*06ef2d1f12
// Size: 0x14 (Inherited: 0x00)
struct F*06ef2d1f12 {
	int32 TeamId; // 0x00(0x04)
	int32 Score; // 0x04(0x04)
	int32 *90af76f5ed; // 0x08(0x04)
	float *f103037004; // 0x0c(0x04)
	bool *0c7a9c99f8; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.*084b9b1d34
// Size: 0x10 (Inherited: 0x00)
struct F*084b9b1d34 {
	struct TArray<struct F*3af535ed29> DynamicTeamsInfo; // 0x00(0x10)
};

// ScriptStruct TslGame.*3af535ed29
// Size: 0x28 (Inherited: 0x00)
struct F*3af535ed29 {
	int32 TeamId; // 0x00(0x04)
	int32 Chances; // 0x04(0x04)
	struct TArray<bool> RoundHistory; // 0x08(0x10)
	struct TArray<struct F*906a7319a1> DynamicPlayersInfo; // 0x18(0x10)
};

// ScriptStruct TslGame.*906a7319a1
// Size: 0x14 (Inherited: 0x00)
struct F*906a7319a1 {
	int32 Kills; // 0x00(0x04)
	int32 Deaths; // 0x04(0x04)
	int32 DamageDealt; // 0x08(0x04)
	int32 money; // 0x0c(0x04)
	int32 MemberIndex; // 0x10(0x04)
};

// ScriptStruct TslGame.*b1a8036439
// Size: 0x08 (Inherited: 0x00)
struct F*b1a8036439 {
	int32 GoalScore; // 0x00(0x04)
	bool bIsTeamElimination; // 0x04(0x01)
	bool bUseWarRoyaleBluezone; // 0x05(0x01)
	bool bUsingTeamXRay; // 0x06(0x01)
	char pad_7[0x1]; // 0x07(0x01)
};

// ScriptStruct TslGame.*ad2e5f60b3
// Size: 0x50 (Inherited: 0x00)
struct F*ad2e5f60b3 {
	float TimeLimitSeconds; // 0x00(0x04)
	float LastRespawnTimeSeconds; // 0x04(0x04)
	struct TArray<int32> TeamIds; // 0x08(0x10)
	struct TArray<int32> TeamIndices; // 0x18(0x10)
	struct TArray<struct FString> TeamLeaderNames; // 0x28(0x10)
	struct TArray<struct FString> TeamLeaderClanNames; // 0x38(0x10)
	int32 TeamCount; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// ScriptStruct TslGame.*9c46af074d
// Size: 0x30 (Inherited: 0x00)
struct F*9c46af074d {
	float TrainingScore; // 0x00(0x04)
	float TrainingPlayTime; // 0x04(0x04)
	bool TrainingStartCountDown; // 0x08(0x01)
	bool HeadShotCount; // 0x09(0x01)
	bool KillCount; // 0x0a(0x01)
	bool AimAccuracy; // 0x0b(0x01)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString WeaponName; // 0x10(0x10)
	float *0716c1d241; // 0x20(0x04)
	bool *26a611d3e2; // 0x24(0x01)
	bool *22b2b75563; // 0x25(0x01)
	bool *8da9209425; // 0x26(0x01)
	bool *d00adc7eea; // 0x27(0x01)
	bool *3e0ca5c823; // 0x28(0x01)
	bool *79cfc54442; // 0x29(0x01)
	bool *8124e2a025; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// ScriptStruct TslGame.TslReportUserInfo
// Size: 0x70 (Inherited: 0x00)
struct FTslReportUserInfo {
	struct FString PlayerName; // 0x00(0x10)
	struct FString ClanId; // 0x10(0x10)
	struct FString ClanTag; // 0x20(0x10)
	int32 ClanLevel; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString StreamerFakeName; // 0x38(0x10)
	struct FString NetId; // 0x48(0x10)
	struct FString AccountId; // 0x58(0x10)
	int32 TeamId; // 0x68(0x04)
	enum class ESubjectToReport SubjectToReport; // 0x6c(0x01)
	enum class EOutGamePlatformProvider PlayerPlatform; // 0x6d(0x01)
	enum class ETslAIPlayerType AIType; // 0x6e(0x01)
	char pad_6F[0x1]; // 0x6f(0x01)
};

// ScriptStruct TslGame.TslInputKey
// Size: 0x20 (Inherited: 0x00)
struct FTslInputKey {
	struct FKey Key; // 0x00(0x18)
	char bShift : 1; // 0x18(0x01)
	char bCtrl : 1; // 0x18(0x01)
	char bAlt : 1; // 0x18(0x01)
	char pad_18_3 : 5; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct TslGame.*c9d790acb1
// Size: 0x08 (Inherited: 0x00)
struct F*c9d790acb1 {
	struct ATslPlayerState* PlayerState; // 0x00(0x08)
};

// ScriptStruct TslGame.*48f0ad4493
// Size: 0x18 (Inherited: 0x00)
struct F*48f0ad4493 {
	struct ATslCharacter* *975ea65fd3; // 0x00(0x08)
	float *4ff5afc07f; // 0x08(0x04)
	float *f7e8173997; // 0x0c(0x04)
	float *b0560ad8a3; // 0x10(0x04)
	bool bIsGroggy; // 0x14(0x01)
	bool *1be70de75f; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
};

// ScriptStruct TslGame.*f16a7f6759
// Size: 0x20 (Inherited: 0x00)
struct F*f16a7f6759 {
	struct FText *bf915fabf6; // 0x00(0x18)
	char pad_18[0x8]; // 0x18(0x08)
};

// ScriptStruct TslGame.*81733b0fce
// Size: 0x50 (Inherited: 0x00)
struct F*81733b0fce {
	struct TMap<enum class EFiremode, struct UTexture2D*> TextureData; // 0x00(0x50)
};

// ScriptStruct TslGame.*f5d14e572c
// Size: 0x50 (Inherited: 0x00)
struct F*f5d14e572c {
	struct TMap<enum class ETraumaBagHealMode, struct UTexture2D*> TextureData; // 0x00(0x50)
};

// ScriptStruct TslGame.*7278704b44
// Size: 0x18 (Inherited: 0x00)
struct F*7278704b44 {
	struct FName ItemID; // 0x00(0x08)
	int32 *e517e6799c; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct U*6c530763b0* *1c3d008d3e; // 0x10(0x08)
};

// ScriptStruct TslGame.*c29e427e5d
// Size: 0x50 (Inherited: 0x00)
struct F*c29e427e5d {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.*bb27a7c784
// Size: 0x10 (Inherited: 0x00)
struct F*bb27a7c784 {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct TslGame.*8c648d55c2
// Size: 0x18 (Inherited: 0x00)
struct F*8c648d55c2 {
	int32 Index; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct U*1bacf66c5c*> Cache; // 0x08(0x10)
};

// ScriptStruct TslGame.*0253b9bc56
// Size: 0x18 (Inherited: 0x00)
struct F*0253b9bc56 {
	enum class ECastableItemType *505b924fe4; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName ItemID; // 0x08(0x08)
	struct UTexture2D* *2b496751ae; // 0x10(0x08)
};

// ScriptStruct TslGame.*f85343fddb
// Size: 0x10 (Inherited: 0x00)
struct F*f85343fddb {
	struct TArray<struct F*8e3bcfe05a> *6c28b954be; // 0x00(0x10)
};

// ScriptStruct TslGame.*8e3bcfe05a
// Size: 0x20 (Inherited: 0x00)
struct F*8e3bcfe05a {
	struct FName ActionName; // 0x00(0x08)
	struct FText Description; // 0x08(0x18)
};

// ScriptStruct TslGame.*9526feaf82
// Size: 0x38 (Inherited: 0x00)
struct F*9526feaf82 {
	enum class ESystemMessageType MessageType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Duration; // 0x04(0x04)
	float *1cdb2a6679; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FText Message; // 0x10(0x18)
	int32 *52e92e9b5a; // 0x28(0x04)
	int32 *bf1382a26e; // 0x2c(0x04)
	bool *ad29c8922a; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*839166cc57
// Size: 0x38 (Inherited: 0x08)
struct F*839166cc57 : FTableRowBase {
	struct FText Message; // 0x08(0x18)
	enum class ETslNotificationMessageColorType *23895f5ad4; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct UTexture2D* *49cabfda5f; // 0x28(0x08)
	enum class ETslNotificationMessageAnimationType *094c3af3b5; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*42f109d935
// Size: 0x08 (Inherited: 0x00)
struct F*42f109d935 {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*1cdbc86075
// Size: 0x08 (Inherited: 0x00)
struct F*1cdbc86075 {
	float Score; // 0x00(0x04)
	int32 *f334edac6b; // 0x04(0x04)
};

// ScriptStruct TslGame.*027a9afaf9
// Size: 0x08 (Inherited: 0x00)
struct F*027a9afaf9 {
	int32 TeamNum; // 0x00(0x04)
	int32 TeamRanking; // 0x04(0x04)
};

// ScriptStruct TslGame.*58aacf8025
// Size: 0x28 (Inherited: 0x00)
struct F*58aacf8025 {
	struct FVector *5409f11196; // 0x00(0x0c)
	float *439aa68e44; // 0x0c(0x04)
	float *2c8fb3a816; // 0x10(0x04)
	struct FVector *0b01006cf6; // 0x14(0x0c)
	float *50698e285f; // 0x20(0x04)
	float *504ccfed71; // 0x24(0x04)
};

// ScriptStruct TslGame.*8ade9120ce
// Size: 0x48 (Inherited: 0x00)
struct F*8ade9120ce {
	struct UClass* Widget; // 0x00(0x20)
	struct UTexture2D* Texture; // 0x20(0x20)
	struct FVector2D Size; // 0x40(0x08)
};

// ScriptStruct TslGame.*d819e297c7
// Size: 0x10 (Inherited: 0x00)
struct F*d819e297c7 {
	struct TArray<struct UUserWidget*> Widgets; // 0x00(0x10)
};

// ScriptStruct TslGame.*c085b1bad3
// Size: 0x60 (Inherited: 0x00)
struct F*c085b1bad3 {
	char pad_0[0x60]; // 0x00(0x60)
};

// ScriptStruct TslGame.*6666022568
// Size: 0x60 (Inherited: 0x00)
struct F*6666022568 {
	struct UTexture2D* IconBackground; // 0x00(0x20)
	struct UTexture2D* MemberIndexBackground; // 0x20(0x20)
	struct UTexture2D* FullWidgetBackground; // 0x40(0x20)
};

// ScriptStruct TslGame.PlayerInfo
// Size: 0x50 (Inherited: 0x00)
struct FPlayerInfo {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.*ad71ef7f84
// Size: 0x10 (Inherited: 0x00)
struct F*ad71ef7f84 {
	struct UTexture2D* Left; // 0x00(0x08)
	struct UTexture2D* Right; // 0x08(0x08)
};

// ScriptStruct TslGame.*f008d18723
// Size: 0x10 (Inherited: 0x00)
struct F*f008d18723 {
	struct TArray<struct U*142c7b8c41*> Items; // 0x00(0x10)
};

// ScriptStruct TslGame.*adac4ccbf5
// Size: 0x14 (Inherited: 0x00)
struct F*adac4ccbf5 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*881d583e63
// Size: 0x10 (Inherited: 0x00)
struct F*881d583e63 {
	struct TArray<struct ATslAIWaypointSegment*> *6ff7e7b7f3; // 0x00(0x10)
};

// ScriptStruct TslGame.*6230156890
// Size: 0xa0 (Inherited: 0x00)
struct F*6230156890 {
	struct TMap<struct F*94ece644dc, bool> *2b74326063; // 0x00(0x50)
	struct TMap<struct F*94ece644dc, struct F*41d865029b> *45a866fe48; // 0x50(0x50)
};

// ScriptStruct TslGame.*94ece644dc
// Size: 0x10 (Inherited: 0x00)
struct F*94ece644dc {
	struct ATslAIWaypointSegment* path; // 0x00(0x08)
	float InputKey; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*41d865029b
// Size: 0x08 (Inherited: 0x00)
struct F*41d865029b {
	float *751b75ea3b; // 0x00(0x04)
	float *0e3bf45781; // 0x04(0x04)
};

// ScriptStruct TslGame.*c8ca5a902a
// Size: 0x48 (Inherited: 0x00)
struct F*c8ca5a902a {
	int32 SpawnCount; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FName VehicleTag; // 0x08(0x08)
	struct FName SpawnTag; // 0x10(0x08)
	bool *a02e42e7d7; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	struct FVector SpawnLocation; // 0x1c(0x0c)
	struct FRotator *80568035e9; // 0x28(0x0c)
	char pad_34[0x4]; // 0x34(0x04)
	struct F*4dcb64ccfa *df7012fcfa; // 0x38(0x10)
};

// ScriptStruct TslGame.*4dcb64ccfa
// Size: 0x10 (Inherited: 0x00)
struct F*4dcb64ccfa {
	struct ATslAIWaypointSegment* *c6b2266a11; // 0x00(0x08)
	float *16a7095781; // 0x08(0x04)
	bool *987b84b70b; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*2964516ae3
// Size: 0x28 (Inherited: 0x00)
struct F*2964516ae3 {
	struct APawn* *05d0f32c49; // 0x00(0x08)
	struct UBehaviorTree* BehaviorTree; // 0x08(0x08)
	struct UBlackboardData* BlackboardData; // 0x10(0x08)
	struct F*4dcb64ccfa *df7012fcfa; // 0x18(0x10)
};

// ScriptStruct TslGame.VehicleSpawn
// Size: 0xc0 (Inherited: 0x08)
struct FVehicleSpawn : FTableRowBase {
	struct FGuid ID; // 0x08(0x10)
	enum class ESpawnType SpawnType; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct FName VehicleTag; // 0x20(0x08)
	struct UClass* VehicleClass; // 0x28(0x20)
	struct UBehaviorTree* BehaviorTreeAsset; // 0x48(0x20)
	struct UBlackboardData* BlackboardDataAsset; // 0x68(0x20)
	float InitialSpawnDelay; // 0x88(0x04)
	float SubsequentSpawnDelay; // 0x8c(0x04)
	int32 MaxTriggers; // 0x90(0x04)
	bool MinToSpawn; // 0x94(0x01)
	bool MaxToSpawn; // 0x95(0x01)
	char pad_96[0x2]; // 0x96(0x02)
	struct F*b31c62debb SpawnFilter; // 0x98(0x28)
};

// ScriptStruct TslGame.*b31c62debb
// Size: 0x28 (Inherited: 0x00)
struct F*b31c62debb {
	bool bLimitSpawnPoints; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FName> ValidSpawnPoints; // 0x08(0x10)
	struct TArray<struct FName> InvalidSpawnPoints; // 0x18(0x10)
};

// ScriptStruct TslGame.*65687b35d4
// Size: 0x20 (Inherited: 0x00)
struct F*65687b35d4 {
	char pad_0[0x20]; // 0x00(0x20)
};

// ScriptStruct TslGame.*7d5cc6e779
// Size: 0x60 (Inherited: 0x00)
struct F*7d5cc6e779 {
	struct FGuid ID; // 0x00(0x10)
	struct FString *606d874e03; // 0x10(0x10)
	struct UClass* VehicleClass; // 0x20(0x08)
	struct UBehaviorTree* BehaviorTree; // 0x28(0x08)
	struct UBlackboardData* BlackboardData; // 0x30(0x08)
	struct F*b31c62debb SpawnSettings; // 0x38(0x28)
};

// ScriptStruct TslGame.*b6ddb72992
// Size: 0x40 (Inherited: 0x00)
struct F*b6ddb72992 {
	float *33adabaae5; // 0x00(0x04)
	float *e230512e72; // 0x04(0x04)
	float *fcc8cb3205; // 0x08(0x04)
	float Damage; // 0x0c(0x04)
	float *d0042136e6; // 0x10(0x04)
	float *63fcc566bd; // 0x14(0x04)
	struct FName *6048869982; // 0x18(0x08)
	struct FVector *e5a1c828aa; // 0x20(0x0c)
	struct FVector *c6c852a915; // 0x2c(0x0c)
	struct UClass* *271a14efcc; // 0x38(0x08)
};

// ScriptStruct TslGame.*5cf0cef062
// Size: 0x30 (Inherited: 0x00)
struct F*5cf0cef062 {
	struct F*792f1b2794 *2e4cde85d7; // 0x00(0x18)
	struct F*792f1b2794 *88c19df12f; // 0x18(0x18)
};

// ScriptStruct TslGame.*792f1b2794
// Size: 0x18 (Inherited: 0x00)
struct F*792f1b2794 {
	float *f1878cb306; // 0x00(0x04)
	float *5bc5b0c173; // 0x04(0x04)
	struct UAkAudioEvent* AkEvent; // 0x08(0x08)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct TslGame.*96dcdde9ae
// Size: 0x18 (Inherited: 0x00)
struct F*96dcdde9ae {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*af4401a33b
// Size: 0x58 (Inherited: 0x00)
struct F*af4401a33b {
	enum class EVehiclePartType *827c31f5b6; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TMap<int32, struct UMaterialInterface*> *01ab4e4110; // 0x08(0x50)
};

// ScriptStruct TslGame.*c18c55d48f
// Size: 0x98 (Inherited: 0x00)
struct F*c18c55d48f {
	bool *136f212acc; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *e4ea21391f; // 0x04(0x04)
	struct FName *ea1b42d380; // 0x08(0x08)
	struct FVector2D *9766f355c4; // 0x10(0x08)
	struct FVector2D *40f1124962; // 0x18(0x08)
	struct FVector *afe83381a0; // 0x20(0x0c)
	struct FVector2D *de662c54a6; // 0x2c(0x08)
	struct FVector2D *a6c3ef138b; // 0x34(0x08)
	float *1e009b5180; // 0x3c(0x04)
	float *65021737d1; // 0x40(0x04)
	float *3f44f68539; // 0x44(0x04)
	struct FVector *2e88d08806; // 0x48(0x0c)
	struct FVector *c0d9b0a601; // 0x54(0x0c)
	struct FVector2D *d84f748ed8; // 0x60(0x08)
	float *b4047daed0; // 0x68(0x04)
	bool *c042d09c00; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	float *387ed0e857; // 0x70(0x04)
	bool *b474bafc4a; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FVector2D *9efa8691a8; // 0x78(0x08)
	struct U*59a0aeaef9* *ce6ceae804; // 0x80(0x08)
	bool *33b0c09b0d; // 0x88(0x01)
	char pad_89[0xf]; // 0x89(0x0f)
};

// ScriptStruct TslGame.*ae29052621
// Size: 0x68 (Inherited: 0x00)
struct F*ae29052621 {
	struct FName *e944fafb01; // 0x00(0x08)
	float *625a89b5ec; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FName *693196083b; // 0x10(0x08)
	float *5dbf6f1af5; // 0x18(0x04)
	float *c9dd8b9b04; // 0x1c(0x04)
	struct UCurveFloat* CurveEngineOn; // 0x20(0x08)
	struct UCurveFloat* CurveEngineOff; // 0x28(0x08)
	float EngineSwitchMaxTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FName HeadLightIntensityParamName; // 0x38(0x08)
	float HeadLightIntensity_Mat; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FName TailLightIntensityParamName; // 0x48(0x08)
	float TailLightIntensity_Mat; // 0x50(0x04)
	bool bTickIndicatorSpeedText; // 0x54(0x01)
	bool bTickIndicatorGearText; // 0x55(0x01)
	bool bTickIndicatorHealth; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct FName TextRenderIntensityParameterName; // 0x58(0x08)
	struct FName HealthStateParameterName; // 0x60(0x08)
};

// ScriptStruct TslGame.*b35c70f02c
// Size: 0x130 (Inherited: 0x00)
struct F*b35c70f02c {
	bool *9cec20fd90; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *24040351ca; // 0x04(0x04)
	float *957a8511e0; // 0x08(0x04)
	float *e200f095df; // 0x0c(0x04)
	float *d036966192; // 0x10(0x04)
	struct FFloatRange *911cf3525d; // 0x14(0x10)
	float *bbb879e1e1; // 0x24(0x04)
	float *87c02f9987; // 0x28(0x04)
	float *e39c13a744; // 0x2c(0x04)
	float *a27f1e5b55; // 0x30(0x04)
	int32 *148a491c14; // 0x34(0x04)
	char pad_38[0x8]; // 0x38(0x08)
	struct TMap<enum class EPhysicalSurface, struct F*b660e75403> *44427063c1; // 0x40(0x50)
	struct TMap<enum class EPhysicalSurface, struct F*b660e75403> *7fe0f43c66; // 0x90(0x50)
	struct TMap<enum class EPhysicalSurface, struct F*a79adf53b8> *b9276dcfc7; // 0xe0(0x50)
};

// ScriptStruct TslGame.*a79adf53b8
// Size: 0x28 (Inherited: 0x00)
struct F*a79adf53b8 {
	char pad_0[0x18]; // 0x00(0x18)
	struct UAkComponent* *cabe1e32c4; // 0x18(0x08)
	struct UParticleSystemComponent* ParticleComp; // 0x20(0x08)
};

// ScriptStruct TslGame.*b660e75403
// Size: 0x10 (Inherited: 0x00)
struct F*b660e75403 {
	struct UParticleSystem* ParticleSystem; // 0x00(0x08)
	struct UAkAudioEvent* AkEvent; // 0x08(0x08)
};

// ScriptStruct TslGame.*62093a0f4c
// Size: 0x28 (Inherited: 0x00)
struct F*62093a0f4c {
	char pad_0[0x18]; // 0x00(0x18)
	struct USceneComponent* *bcea33173e; // 0x18(0x08)
	struct USceneComponent* *d20c153d72; // 0x20(0x08)
};

// ScriptStruct TslGame.*efbcb9eb85
// Size: 0x28 (Inherited: 0x00)
struct F*efbcb9eb85 {
	int32 *e8acde535e; // 0x00(0x04)
	float *c5f08d7ff9; // 0x04(0x04)
	float *89fcc3bb80; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UCurveFloat* *a056c64c90; // 0x10(0x08)
	struct UCurveFloat* *1362d965b5; // 0x18(0x08)
	struct UClass* *271a14efcc; // 0x20(0x08)
};

// ScriptStruct TslGame.*f815e2a686
// Size: 0x10 (Inherited: 0x00)
struct F*f815e2a686 {
	struct FName *8e7c1aef4b; // 0x00(0x08)
	struct FName *c733725cc0; // 0x08(0x08)
};

// ScriptStruct TslGame.*26272c57aa
// Size: 0x70 (Inherited: 0x00)
struct F*26272c57aa {
	struct FTransform PlantingTransform; // 0x00(0x30)
	struct FTransform EffectTransform; // 0x30(0x30)
	struct FLinearColor EffectColor; // 0x60(0x10)
};

// ScriptStruct TslGame.TslWeaponDisplayDataRow
// Size: 0x10 (Inherited: 0x08)
struct FTslWeaponDisplayDataRow : FTableRowBase {
	float DefaultScale; // 0x08(0x04)
	float ZoomScale; // 0x0c(0x04)
};

// ScriptStruct TslGame.*8384429dbb
// Size: 0x20 (Inherited: 0x00)
struct F*8384429dbb {
	struct FString ItemID; // 0x00(0x10)
	struct FString SkinId; // 0x10(0x10)
};

// ScriptStruct TslGame.*c0e99f81d1
// Size: 0x30 (Inherited: 0x00)
struct F*c0e99f81d1 {
	struct APostProcessVolume* PostProcessVolume; // 0x00(0x08)
	struct F*e43fa2c521 LocalWeatherSetting; // 0x08(0x28)
};

// ScriptStruct TslGame.*e43fa2c521
// Size: 0x28 (Inherited: 0x00)
struct F*e43fa2c521 {
	float FogDensity; // 0x00(0x04)
	struct FLinearColor FogColor; // 0x04(0x10)
	float FogStartDistance; // 0x14(0x04)
	float VolFogExtinctionScale; // 0x18(0x04)
	float WeatherParticleSpawnScale; // 0x1c(0x04)
	char bUseWetEffectWithSpawnScale : 1; // 0x20(0x01)
	char pad_20_1 : 7; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float SoundScale; // 0x24(0x04)
};

// ScriptStruct TslGame.*410a4dbf32
// Size: 0x10 (Inherited: 0x00)
struct F*410a4dbf32 {
	float DirectionalLightIntensity; // 0x00(0x04)
	float DirectionalLightTemperature; // 0x04(0x04)
	float DirectionalLightVolumetricScattering; // 0x08(0x04)
	float SkyLightIntensity; // 0x0c(0x04)
};

// ScriptStruct TslGame.*e595d0a912
// Size: 0x68 (Inherited: 0x00)
struct F*e595d0a912 {
	struct FString WeatherName; // 0x00(0x10)
	struct ATslDynamicWeather* DynamicWeather; // 0x10(0x08)
	float Weight; // 0x18(0x04)
	float DirectionalLightIntensity; // 0x1c(0x04)
	float DirectionalLightTemperature; // 0x20(0x04)
	float DirectionalLightVolumetricScattering; // 0x24(0x04)
	float SkyLightIntensity; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UTextureCube* SkyLightCubemap; // 0x30(0x08)
	float SkyLightCubemapAngle; // 0x38(0x04)
	float SkyLightCubemapResolution; // 0x3c(0x04)
	char bUseBlendSkyBox : 1; // 0x40(0x01)
	char bRefreshLightSetting : 1; // 0x40(0x01)
	char bOverrideDurationTime : 1; // 0x40(0x01)
	char pad_40_3 : 5; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float OverrideDurationTimeMin; // 0x44(0x04)
	float OverrideDurationTimeMax; // 0x48(0x04)
	char bUseDistanceDepthBlur : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	float DepthBlurIntensity; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct UCurveFloat* DepthBlurCurveAsset; // 0x58(0x08)
	char bClearFootprints : 1; // 0x60(0x01)
	char pad_60_1 : 7; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
};

// ScriptStruct TslGame.*bec5edb00b
// Size: 0x1c (Inherited: 0x00)
struct F*bec5edb00b {
	bool *8b4ca97c7e; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *8b2784eb92; // 0x04(0x04)
	float *45bf7c18e1; // 0x08(0x04)
	float *386013520b; // 0x0c(0x04)
	float *532d396981; // 0x10(0x04)
	float *79de90eec7; // 0x14(0x04)
	bool *fbc374946b; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
};

// ScriptStruct TslGame.*7eab5f11f7
// Size: 0x30 (Inherited: 0x00)
struct F*7eab5f11f7 {
	struct UAkAudioEvent* *f892ea45b8; // 0x00(0x08)
	struct UAkAudioEvent* *06e935cd1d; // 0x08(0x08)
	float *3c4586f0da; // 0x10(0x04)
	float *b6c76124e7; // 0x14(0x04)
	struct FString *b599926002; // 0x18(0x10)
	float *b34ae8a9e6; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*955a930b07
// Size: 0x30 (Inherited: 0x00)
struct F*955a930b07 {
	float *4d6923fd28; // 0x00(0x04)
	struct FVector2D *02bfaf8d0e; // 0x04(0x08)
	struct FVector2D *61138268bf; // 0x0c(0x08)
	float *38545499f5; // 0x14(0x04)
	float *907c000c0b; // 0x18(0x04)
	float *5f5a492556; // 0x1c(0x04)
	struct FVector2D *3edd3e9ab0; // 0x20(0x08)
	struct FVector2D *95e402752d; // 0x28(0x08)
};

// ScriptStruct TslGame.*171ad77693
// Size: 0x10 (Inherited: 0x00)
struct F*171ad77693 {
	bool *3b7041cce3; // 0x00(0x01)
	char pad_1[0xf]; // 0x01(0x0f)
};

// ScriptStruct TslGame.*52d91117a5
// Size: 0x58 (Inherited: 0x00)
struct F*52d91117a5 {
	float *3b433ba0cb; // 0x00(0x04)
	float *3a8633477e; // 0x04(0x04)
	struct FVector2D *80257f4eb0; // 0x08(0x08)
	struct FVector2D *b6406d2828; // 0x10(0x08)
	struct FVector2D *77f6a7a480; // 0x18(0x08)
	struct FVector2D *f88b31f6b0; // 0x20(0x08)
	struct FVector2D *2eaae1565e; // 0x28(0x08)
	struct FVector2D *1d87a91639; // 0x30(0x08)
	struct FVector2D *1443b9f66f; // 0x38(0x08)
	float *1c7a9d1093; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct UAnimMontage* *07620fc2dd; // 0x48(0x08)
	float *d1860a84b6; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
};

// ScriptStruct TslGame.*fc0a318931
// Size: 0x14 (Inherited: 0x00)
struct F*fc0a318931 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*ed70a30c19
// Size: 0x40 (Inherited: 0x00)
struct F*ed70a30c19 {
	float *ab393db177; // 0x00(0x04)
	float *f673d294fa; // 0x04(0x04)
	float *bc003ffc84; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UCurveFloat* *a5feb54645; // 0x10(0x08)
	float *48974e5709; // 0x18(0x04)
	float *abbe515473; // 0x1c(0x04)
	float *b32492a535; // 0x20(0x04)
	float *d04c9c6208; // 0x24(0x04)
	struct FVector2D *513d302cd7; // 0x28(0x08)
	struct FVector2D *0d9b024ab9; // 0x30(0x08)
	float *60d591047c; // 0x38(0x04)
	float *07311ed676; // 0x3c(0x04)
};

// ScriptStruct TslGame.*433fdde7fb
// Size: 0x14 (Inherited: 0x14)
struct F*433fdde7fb : F*7ef167f7d8 {
};

// ScriptStruct TslGame.*7ef167f7d8
// Size: 0x14 (Inherited: 0x00)
struct F*7ef167f7d8 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*803e4c2351
// Size: 0x14 (Inherited: 0x14)
struct F*803e4c2351 : F*7ef167f7d8 {
};

// ScriptStruct TslGame.*9d4e42b193
// Size: 0x1c (Inherited: 0x14)
struct F*9d4e42b193 : F*7ef167f7d8 {
	char pad_14[0x8]; // 0x14(0x08)
};

// ScriptStruct TslGame.*770b4b4fef
// Size: 0x10 (Inherited: 0x00)
struct F*770b4b4fef {
	struct UAnimSequence* TransitionSequence; // 0x00(0x08)
	float PlayRate; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*40a7b510e4
// Size: 0x30 (Inherited: 0x00)
struct F*40a7b510e4 {
	struct USkeletalMesh* *02c005fcad; // 0x00(0x20)
	struct TArray<struct UMaterialInterface*> *a99d7db976; // 0x20(0x10)
};

// ScriptStruct TslGame.*cb0117729f
// Size: 0x18 (Inherited: 0x00)
struct F*cb0117729f {
	struct USkeletalMesh* *a6236bcf98; // 0x00(0x08)
	struct TArray<struct UMaterialInterface*> *766fedc00f; // 0x08(0x10)
};

// ScriptStruct TslGame.*650b1193a6
// Size: 0x38 (Inherited: 0x00)
struct F*650b1193a6 {
	struct TArray<struct F*3ed1ee1fab> StartParticleList; // 0x00(0x10)
	struct TArray<struct F*3ed1ee1fab> FinishParticleList; // 0x10(0x10)
	struct F*b2adf3900b OverrideMaterial; // 0x20(0x18)
};

// ScriptStruct TslGame.*b2adf3900b
// Size: 0x18 (Inherited: 0x00)
struct F*b2adf3900b {
	enum class *9f440c6493 SkinApplicationType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct F*d2f0faa372> SkinMaterials; // 0x08(0x10)
};

// ScriptStruct TslGame.*d2f0faa372
// Size: 0x30 (Inherited: 0x00)
struct F*d2f0faa372 {
	struct FName MaterialSlotName; // 0x00(0x08)
	int32 MaterialSlotIndex; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UMaterialInstance* MaterialInstance; // 0x10(0x20)
};

// ScriptStruct TslGame.*3ed1ee1fab
// Size: 0x20 (Inherited: 0x00)
struct F*3ed1ee1fab {
	struct TArray<struct FName> AttachSocketCandidates; // 0x00(0x10)
	struct FStringClassReference ParticleClass; // 0x10(0x10)
};

// ScriptStruct TslGame.*91315bec5f
// Size: 0x18 (Inherited: 0x08)
struct F*91315bec5f : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	int32 Weight; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*a0f3166c66
// Size: 0x50 (Inherited: 0x00)
struct F*a0f3166c66 {
	struct TMap<enum class EPhysicalSurface, float> *d843e156ea; // 0x00(0x50)
};

// ScriptStruct TslGame.*d87f830add
// Size: 0x08 (Inherited: 0x00)
struct F*d87f830add {
	float *1fbdd7f124; // 0x00(0x04)
	float *8d30f7ab82; // 0x04(0x04)
};

// ScriptStruct TslGame.*63bf47fa53
// Size: 0x28 (Inherited: 0x00)
struct F*63bf47fa53 {
	bool AtlasIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct UClass*> WheelTypes; // 0x08(0x10)
	struct TArray<struct UClass*> ExemptedWheelTypes; // 0x18(0x10)
};

// ScriptStruct TslGame.*79ed35a09b
// Size: 0x60 (Inherited: 0x00)
struct F*79ed35a09b {
	struct UStaticMesh* StaticMesh; // 0x00(0x20)
	struct UDestructibleMesh* DestructibleMesh; // 0x20(0x20)
	struct UAkAudioEvent* *ec4420276e; // 0x40(0x08)
	struct UPhysicalMaterial* PhysicalMaterial; // 0x48(0x08)
	float *6d75f9a19c; // 0x50(0x04)
	enum class *a6cf5bae1a IndoorOutdoorMask; // 0x54(0x01)
	char LightingChannel1 : 1; // 0x55(0x01)
	char pad_55_1 : 7; // 0x55(0x01)
	enum class ECollisionEnabled CollisionEnabled; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct FName CollisionProfileName; // 0x58(0x08)
};

// ScriptStruct TslGame.*bc6d2a0956
// Size: 0x48 (Inherited: 0x08)
struct F*bc6d2a0956 : FTableRowBase {
	struct UTexture* Icon; // 0x08(0x20)
	struct F*288ddac817 AbilityAttribute; // 0x28(0x0c)
	char pad_34[0x4]; // 0x34(0x04)
	struct FName AbilityID; // 0x38(0x08)
	struct UClass* AbilityClass; // 0x40(0x08)
};

// ScriptStruct TslGame.*288ddac817
// Size: 0x0c (Inherited: 0x00)
struct F*288ddac817 {
	float Distance; // 0x00(0x04)
	float Angle; // 0x04(0x04)
	char UsingDir : 1; // 0x08(0x01)
	char pad_8_1 : 7; // 0x08(0x01)
	bool bStopMove; // 0x09(0x01)
	bool bTrace; // 0x0a(0x01)
	char pad_B[0x1]; // 0x0b(0x01)
};

// ScriptStruct TslGame.AnimNode_LocomotionBSPlayer
// Size: 0x140 (Inherited: 0x58)
struct FAnimNode_LocomotionBSPlayer : FAnimNode_AssetPlayerBase {
	float NodeSpeed; // 0x58(0x04)
	float Dir; // 0x5c(0x04)
	enum class EAnimStance AnimStance; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct U*a645d9893a* AnimDB; // 0x68(0x08)
	bool bIsSprinting; // 0x70(0x01)
	bool bIsRelaxed; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float PlayRate; // 0x74(0x04)
	bool bLoop; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float StartPosition; // 0x7c(0x04)
	struct UBlendSpaceBase* BlendSpace; // 0x80(0x08)
	bool bResetPlayTimeWhenBlendSpaceChanges; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct FBlendFilter BlendFilter; // 0x90(0x90)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x120(0x10)
	struct UBlendSpaceBase* PreviousBlendSpace; // 0x130(0x08)
	float Speed; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
};

// ScriptStruct TslGame.TslAnimNode_AimOffsets
// Size: 0xb0 (Inherited: 0x58)
struct FTslAnimNode_AimOffsets : FAnimNode_AssetPlayerBase {
	struct U*adf90eecbd* AnimDBMap; // 0x58(0x08)
	struct U*adf90eecbd* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslAimOffsetsNodeBlendSpaceData> BlendSpacesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	float X; // 0x90(0x04)
	float Y; // 0x94(0x04)
	float NormalizedTime; // 0x98(0x04)
	char pad_9C[0x8]; // 0x9c(0x08)
	enum class EAnimStance Stance; // 0xa4(0x01)
	bool bRelaxed; // 0xa5(0x01)
	enum class EWeaponClass WeaponClass; // 0xa6(0x01)
	enum class EAnimWeaponSpecificClass AnimWeaponSpecificClass; // 0xa7(0x01)
	enum class EAlphaBlendOption BlendType; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// ScriptStruct TslGame.TslAimOffsetsNodeBlendSpaceData
// Size: 0xc8 (Inherited: 0x00)
struct FTslAimOffsetsNodeBlendSpaceData {
	struct UBlendSpace* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb0]; // 0x18(0xb0)
};

// ScriptStruct TslGame.TslAnimNode_BlendPerBoneBase
// Size: 0x128 (Inherited: 0x30)
struct FTslAnimNode_BlendPerBoneBase : FAnimNode_Base {
	char pad_30[0x4]; // 0x30(0x04)
	enum class EAnimAlphaInputType AlphaInputType; // 0x34(0x01)
	bool bAlphaBoolEnabled; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	float Alpha; // 0x38(0x04)
	struct FInputScaleBias AlphaScaleBias; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
	struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x48(0x50)
	struct FName AlphaCurveName; // 0x98(0x08)
	struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0xa0(0x30)
	int32 LODThreshold; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct TArray<float> PerBoneBlendWeights; // 0xd8(0x10)
	struct FGuid SkeletonGuid; // 0xe8(0x10)
	struct FGuid VirtualBoneGuid; // 0xf8(0x10)
	char pad_108[0x20]; // 0x108(0x20)
};

// ScriptStruct TslGame.BlendBoneSettings
// Size: 0x20 (Inherited: 0x00)
struct FBlendBoneSettings {
	struct FBoneReference Bone; // 0x00(0x18)
	float Weight; // 0x18(0x04)
	bool bPropagateToChildren; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditivePerBone
// Size: 0x168 (Inherited: 0x158)
struct FTslAnimNode_ApplyAdditivePerBone : FTslAnimNode_ApplyAdditivePerBoneBase {
	struct TArray<struct FBlendBoneSettings> OverrideBones; // 0x158(0x10)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditivePerBoneBase
// Size: 0x158 (Inherited: 0x128)
struct FTslAnimNode_ApplyAdditivePerBoneBase : FTslAnimNode_BlendPerBoneBase {
	struct FPoseLink Base; // 0x128(0x18)
	struct FPoseLink Additive; // 0x140(0x18)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditiveExcludeBones
// Size: 0x168 (Inherited: 0x158)
struct FTslAnimNode_ApplyAdditiveExcludeBones : FTslAnimNode_ApplyAdditivePerBoneBase {
	struct TArray<struct FExcludeBoneSettings> ExcludeBones; // 0x158(0x10)
};

// ScriptStruct TslGame.ExcludeBoneSettings
// Size: 0x20 (Inherited: 0x00)
struct FExcludeBoneSettings {
	struct FBoneReference Bone; // 0x00(0x18)
	bool bPropagateToChildren; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct TslGame.TslAnimNode_BlendListBlendSpace
// Size: 0xb8 (Inherited: 0x58)
struct FTslAnimNode_BlendListBlendSpace : FAnimNode_AssetPlayerBase {
	float X; // 0x58(0x04)
	float Y; // 0x5c(0x04)
	struct UCurveFloat* CustomBlendCurve; // 0x60(0x08)
	struct UBlendSpace* LastActiveBlendSpace; // 0x68(0x08)
	struct TArray<struct UBlendSpace*> BlendSpace; // 0x70(0x10)
	struct TArray<float> BlendTime; // 0x80(0x10)
	struct TArray<struct FTslBlendSpaceBlendData> BlendSpaceData; // 0x90(0x10)
	char pad_A0[0x10]; // 0xa0(0x10)
	float PlayRate; // 0xb0(0x04)
	bool bLoop; // 0xb4(0x01)
	enum class EAlphaBlendOption BlendType; // 0xb5(0x01)
	char pad_B6[0x2]; // 0xb6(0x02)
};

// ScriptStruct TslGame.TslBlendSpaceBlendData
// Size: 0xd0 (Inherited: 0x00)
struct FTslBlendSpaceBlendData {
	struct UBlendSpace* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb8]; // 0x18(0xb8)
};

// ScriptStruct TslGame.TslAnimNode_BlendListBlendSpaceByEnum
// Size: 0xd0 (Inherited: 0xb8)
struct FTslAnimNode_BlendListBlendSpaceByEnum : FTslAnimNode_BlendListBlendSpace {
	struct TArray<bool> EnumToPoseIndex; // 0xb8(0x10)
	char pad_C8[0x5]; // 0xc8(0x05)
	bool ActiveEnumValue; // 0xcd(0x01)
	char pad_CE[0x2]; // 0xce(0x02)
};

// ScriptStruct TslGame.TslAnimNode_BlendEvaluatorBlendSpaceByEnum
// Size: 0xd8 (Inherited: 0xd0)
struct FTslAnimNode_BlendEvaluatorBlendSpaceByEnum : FTslAnimNode_BlendListBlendSpaceByEnum {
	float NormalizedTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct TslGame.TslAnimNode_BlendListRandom
// Size: 0x120 (Inherited: 0xc8)
struct FTslAnimNode_BlendListRandom : FAnimNode_BlendListBase {
	int32 ActiveChildIndex; // 0xc8(0x04)
	enum class ERandomType RandomType; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
	struct TArray<struct FBlendPosePlayInfo> PlayChances; // 0xd0(0x10)
	struct TArray<int32> PlayList; // 0xe0(0x10)
	int32 LoopingCounter; // 0xf0(0x04)
	float RandomPlayTime; // 0xf4(0x04)
	float RandomAccumlateTime; // 0xf8(0x04)
	struct FRandomStream RandomStream; // 0xfc(0x08)
	char pad_104[0x4]; // 0x104(0x04)
	struct TArray<float> NormalizedPlayChances; // 0x108(0x10)
	float LastChildAssetTime; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
};

// ScriptStruct TslGame.BlendPosePlayInfo
// Size: 0x24 (Inherited: 0x00)
struct FBlendPosePlayInfo {
	float PlayChance; // 0x00(0x04)
	struct FInt32Range LoopingCounter; // 0x04(0x10)
	struct FFloatRange RandomPlayTime; // 0x14(0x10)
};

// ScriptStruct TslGame.TslAnimNode_BlendPerBone
// Size: 0x188 (Inherited: 0x128)
struct FTslAnimNode_BlendPerBone : FTslAnimNode_BlendPerBoneBase {
	struct TArray<struct FBlendBoneSettings> OverrideBones; // 0x128(0x10)
	struct FPoseLink BasePose; // 0x138(0x18)
	struct FPoseLink BlendPose; // 0x150(0x18)
	struct FBoneReference BlendBone; // 0x168(0x18)
	bool bMeshSpaceRotationBlend; // 0x180(0x01)
	bool bKeepBlendBonePosition; // 0x181(0x01)
	enum class *a20ad39f46 CurveBlendOption; // 0x182(0x01)
	char pad_183[0x5]; // 0x183(0x05)
};

// ScriptStruct TslGame.TslAnimNode_BlendSequencesByBool
// Size: 0xb0 (Inherited: 0x58)
struct FTslAnimNode_BlendSequencesByBool : FAnimNode_AssetPlayerBase {
	bool ActiveValue; // 0x58(0x01)
	enum class EAlphaBlendOption BlendType; // 0x59(0x01)
	bool bLooping; // 0x5a(0x01)
	char pad_5B[0x1]; // 0x5b(0x01)
	enum class EBlendSequenceByBoolStartType StartType; // 0x5c(0x04)
	struct TArray<struct FTslBlendSequencesByBoolAnimationData> SequencesData; // 0x60(0x10)
	struct UAnimSequence* TrueSequence; // 0x70(0x08)
	struct UAnimSequence* FalseSequence; // 0x78(0x08)
	struct UAnimSequence* LastActiveSequence; // 0x80(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x88(0x08)
	char pad_90[0x10]; // 0x90(0x10)
	float TrueBlendTime; // 0xa0(0x04)
	float FalseBlendTime; // 0xa4(0x04)
	float TruePlayRate; // 0xa8(0x04)
	float FalsePlayRate; // 0xac(0x04)
};

// ScriptStruct TslGame.TslBlendSequencesByBoolAnimationData
// Size: 0x30 (Inherited: 0x00)
struct FTslBlendSequencesByBoolAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x28]; // 0x08(0x28)
};

// ScriptStruct TslGame.TslAnimNode_BonesLookAtEachOther
// Size: 0x118 (Inherited: 0xf8)
struct FTslAnimNode_BonesLookAtEachOther : FAnimNode_SkeletalControlBase {
	struct TArray<struct FTslBonesLookAtEachOtherSettings> Bones; // 0xf8(0x10)
	char pad_108[0x10]; // 0x108(0x10)
};

// ScriptStruct TslGame.TslBonesLookAtEachOtherSettings
// Size: 0x58 (Inherited: 0x00)
struct FTslBonesLookAtEachOtherSettings {
	struct FBoneReference Bone1; // 0x00(0x18)
	struct FBoneReference Bone2; // 0x18(0x18)
	struct FAxis LookAt_Axis; // 0x30(0x10)
	struct FAxis LookUp_Axis; // 0x40(0x10)
	bool bUseLookUpAxis; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// ScriptStruct TslGame.TslAnimNode_BranchByBool
// Size: 0x68 (Inherited: 0x30)
struct FTslAnimNode_BranchByBool : FAnimNode_Base {
	bool ActiveValue; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FPoseLink TruePose; // 0x38(0x18)
	struct FPoseLink FalsePose; // 0x50(0x18)
};

// ScriptStruct TslGame.TslAnimNode_CCDIK
// Size: 0x1c0 (Inherited: 0xf8)
struct FTslAnimNode_CCDIK : FAnimNode_SkeletalControlBase {
	struct FVector EffectorLocation; // 0xf8(0x0c)
	enum class *8056b80e80 EffectorLocationSpace; // 0x104(0x01)
	char pad_105[0xb]; // 0x105(0x0b)
	struct FBoneSocketTarget EffectorTarget; // 0x110(0x60)
	struct FBoneReference TipBone; // 0x170(0x18)
	struct FBoneReference RootBone; // 0x188(0x18)
	float Precision; // 0x1a0(0x04)
	int32 MaxIterations; // 0x1a4(0x04)
	bool bStartFromTail; // 0x1a8(0x01)
	bool bEnableRotationLimit; // 0x1a9(0x01)
	char pad_1AA[0x6]; // 0x1aa(0x06)
	struct TArray<struct FCCDIKJointSettings> RotationLimitPerJoints; // 0x1b0(0x10)
};

// ScriptStruct TslGame.CCDIKJointSettings
// Size: 0x1c (Inherited: 0x00)
struct FCCDIKJointSettings {
	float MaxConeAngle; // 0x00(0x04)
	float MaxAngleX; // 0x04(0x04)
	float MinAngleX; // 0x08(0x04)
	float MaxAngleY; // 0x0c(0x04)
	float MinAngleY; // 0x10(0x04)
	float MaxAngleZ; // 0x14(0x04)
	float MinAngleZ; // 0x18(0x04)
};

// ScriptStruct TslGame.TslAnimNode_CopyBones
// Size: 0x118 (Inherited: 0xf8)
struct FTslAnimNode_CopyBones : FAnimNode_SkeletalControlBase {
	struct TArray<struct FTslCopyBoneSettings> Bones; // 0xf8(0x10)
	char pad_108[0x10]; // 0x108(0x10)
};

// ScriptStruct TslGame.TslCopyBoneSettings
// Size: 0x38 (Inherited: 0x00)
struct FTslCopyBoneSettings {
	struct FBoneReference SourceBone; // 0x00(0x18)
	struct FBoneReference TargetBone; // 0x18(0x18)
	bool bCopyTranslation; // 0x30(0x01)
	bool bCopyRotation; // 0x31(0x01)
	bool bCopyScale; // 0x32(0x01)
	enum class *8056b80e80 ControlSpace; // 0x33(0x01)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct TslGame.TslAnimNode_CustomAnimSequence
// Size: 0x90 (Inherited: 0x70)
struct FTslAnimNode_CustomAnimSequence : FAnimNode_SequencePlayer {
	struct U*2a3ca9414e* AnimDataAsset; // 0x70(0x08)
	struct FName AnimName; // 0x78(0x08)
	struct FName AltAnimName; // 0x80(0x08)
	int32 AnimationIndex; // 0x88(0x04)
	enum class ECustomAnimDataType CustomAnimDataType; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
};

// ScriptStruct TslGame.TslAnimNode_FabrikElbow
// Size: 0x1b0 (Inherited: 0xf8)
struct FTslAnimNode_FabrikElbow : FAnimNode_SkeletalControlBase {
	char pad_F8[0x8]; // 0xf8(0x08)
	struct FTransform EffectorTransform; // 0x100(0x30)
	enum class *8056b80e80 EffectorTransformSpace; // 0x130(0x01)
	char pad_131[0x7]; // 0x131(0x07)
	struct FBoneReference EffectorTransformBone; // 0x138(0x18)
	enum class *f8da038c2b EffectorRotationSource; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct FBoneReference TipBone; // 0x158(0x18)
	struct FBoneReference RootBone; // 0x170(0x18)
	struct FBoneReference ElbowBone; // 0x188(0x18)
	float ElbowInterpCoef; // 0x1a0(0x04)
	float Precision; // 0x1a4(0x04)
	int32 MaxIterations; // 0x1a8(0x04)
	bool bEnableDebugDraw; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
};

// ScriptStruct TslGame.TslAnimNode_Falling
// Size: 0xa0 (Inherited: 0x58)
struct FTslAnimNode_Falling : FAnimNode_AssetPlayerBase {
	struct U*adf90eecbd* AnimDBMap; // 0x58(0x08)
	struct U*adf90eecbd* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslFallingNodeAnimationData> BlendSpacesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	float X; // 0x90(0x04)
	float BlendTime; // 0x94(0x04)
	char pad_98[0x4]; // 0x98(0x04)
	enum class EWeaponClass WeaponClass; // 0x9c(0x01)
	enum class EAlphaBlendOption BlendType; // 0x9d(0x01)
	char pad_9E[0x2]; // 0x9e(0x02)
};

// ScriptStruct TslGame.TslFallingNodeAnimationData
// Size: 0xd0 (Inherited: 0x00)
struct FTslFallingNodeAnimationData {
	struct UBlendSpace1D* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb8]; // 0x18(0xb8)
};

// ScriptStruct TslGame.TslAnimNode_Healing
// Size: 0x80 (Inherited: 0x30)
struct FTslAnimNode_Healing : FAnimNode_Base {
	struct U*adf90eecbd* AnimDBMap; // 0x30(0x08)
	struct U*adf90eecbd* PrevAnimDBMap; // 0x38(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x40(0x08)
	struct TArray<struct FTslHealingSequenceData> SequencesData; // 0x48(0x10)
	char pad_58[0x18]; // 0x58(0x18)
	float PlayRate; // 0x70(0x04)
	float BlendTime; // 0x74(0x04)
	enum class EAlphaBlendOption BlendType; // 0x78(0x01)
	enum class ECastAnim CurrentItem; // 0x79(0x01)
	bool IsParentControl; // 0x7a(0x01)
	enum class EAnimStance Stance; // 0x7b(0x01)
	bool IsFPP; // 0x7c(0x01)
	bool Looping; // 0x7d(0x01)
	char pad_7E[0x2]; // 0x7e(0x02)
};

// ScriptStruct TslGame.TslHealingSequenceData
// Size: 0x28 (Inherited: 0x00)
struct FTslHealingSequenceData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x20]; // 0x08(0x20)
};

// ScriptStruct TslGame.TslAnimNode_Idles
// Size: 0xa8 (Inherited: 0x58)
struct FTslAnimNode_Idles : FAnimNode_AssetPlayerBase {
	struct U*adf90eecbd* AnimDBMap; // 0x58(0x08)
	struct U*adf90eecbd* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslIdlesNodeAnimationData> SequencesData; // 0x70(0x10)
	char pad_80[0x18]; // 0x80(0x18)
	float PlayRate; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	enum class EAnimStance Stance; // 0xa0(0x01)
	enum class EWeaponClass WeaponClass; // 0xa1(0x01)
	bool Relaxed; // 0xa2(0x01)
	enum class EAlphaBlendOption BlendType; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.TslIdlesNodeAnimationData
// Size: 0x38 (Inherited: 0x00)
struct FTslIdlesNodeAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x30]; // 0x08(0x30)
};

// ScriptStruct TslGame.TslAnimNode_JumpStart
// Size: 0xb8 (Inherited: 0x58)
struct FTslAnimNode_JumpStart : FAnimNode_AssetPlayerBase {
	struct U*adf90eecbd* AnimDBMap; // 0x58(0x08)
	struct U*adf90eecbd* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslJumpStartNodeAnimationData> SequencesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	struct FVector Velocity; // 0x90(0x0c)
	float Yaw; // 0x9c(0x04)
	float JumpHeight; // 0xa0(0x04)
	float BlendTime; // 0xa4(0x04)
	float BackwardAngleThreshold; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	enum class EWeaponClass WeaponClass; // 0xb0(0x01)
	bool bRelaxed; // 0xb1(0x01)
	bool bIsLocalPlayer; // 0xb2(0x01)
	enum class EAlphaBlendOption BlendType; // 0xb3(0x01)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.TslJumpStartNodeAnimationData
// Size: 0x40 (Inherited: 0x00)
struct FTslJumpStartNodeAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x38]; // 0x08(0x38)
};

// ScriptStruct TslGame.TslAnimNode_LobbyAnimSequence
// Size: 0x100 (Inherited: 0x70)
struct FTslAnimNode_LobbyAnimSequence : FAnimNode_SequencePlayer {
	struct FLobbyCharacterAnimationDataRow CurrentAnimData; // 0x70(0x80)
	struct UAnimSequenceBase* LobbySequence; // 0xf0(0x08)
	int32 LobbyCharacterPosition; // 0xf8(0x04)
	enum class ELobbyCharacterReadyType ReadyType; // 0xfc(0x01)
	enum class EWeaponClass LastLobbyAnimationClass; // 0xfd(0x01)
	bool bPlayingDefaultAnim; // 0xfe(0x01)
	bool bPlayNextAnim; // 0xff(0x01)
};

// ScriptStruct TslGame.LobbyCharacterAnimationDataRow
// Size: 0x80 (Inherited: 0x08)
struct FLobbyCharacterAnimationDataRow : FTableRowBase {
	enum class ELobbyCharacterPosition Poisition; // 0x08(0x01)
	enum class ELobbyCharacterReadyType State; // 0x09(0x01)
	bool bDefaultAnimation; // 0x0a(0x01)
	char pad_B[0x1]; // 0x0b(0x01)
	float CycleTimes; // 0x0c(0x04)
	struct UAnimSequenceBase* UnArmed; // 0x10(0x08)
	struct UAnimSequenceBase* Pistol; // 0x18(0x08)
	struct UAnimSequenceBase* SMG; // 0x20(0x08)
	struct UAnimSequenceBase* Rifle; // 0x28(0x08)
	struct UAnimSequenceBase* Carbine; // 0x30(0x08)
	struct UAnimSequenceBase* Shotgun; // 0x38(0x08)
	struct UAnimSequenceBase* Sniper; // 0x40(0x08)
	struct UAnimSequenceBase* DMR; // 0x48(0x08)
	struct UAnimSequenceBase* LMG; // 0x50(0x08)
	struct UAnimSequenceBase* Melee; // 0x58(0x08)
	struct UAnimSequenceBase* Throwable; // 0x60(0x08)
	struct UAnimSequenceBase* Shield; // 0x68(0x08)
	struct UAnimSequenceBase* crossbow; // 0x70(0x08)
	struct UAnimSequenceBase* Launcher; // 0x78(0x08)
};

// ScriptStruct TslGame.TslAnimNode_PlayIdleSequence
// Size: 0xd0 (Inherited: 0x58)
struct FTslAnimNode_PlayIdleSequence : FAnimNode_AssetPlayerBase {
	struct U*81da793019* ParentInstance; // 0x58(0x08)
	struct U*a645d9893a* AnimDB; // 0x60(0x08)
	float BlendTime; // 0x68(0x04)
	float PlayRate; // 0x6c(0x04)
	float IdleTriggerTimeMin; // 0x70(0x04)
	float IdleTriggerTimeVariation; // 0x74(0x04)
	bool bIsFPP; // 0x78(0x01)
	bool bIsCold; // 0x79(0x01)
	enum class EAnimStance Stance; // 0x7a(0x01)
	char pad_7B[0x5]; // 0x7b(0x05)
	struct FSequenceData ActiveSequence; // 0x80(0x10)
	struct FSequenceData PreviousSequence; // 0x90(0x10)
	char pad_A0[0x30]; // 0xa0(0x30)
};

// ScriptStruct TslGame.SequenceData
// Size: 0x10 (Inherited: 0x00)
struct FSequenceData {
	struct UAnimSequence* Sequence; // 0x00(0x08)
	float AccumulatedTime; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslAnimNode_RotateBones
// Size: 0xd0 (Inherited: 0x30)
struct FTslAnimNode_RotateBones : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x30(0x18)
	struct TArray<struct FName> Bone; // 0x48(0x10)
	struct TArray<enum class ERotateBoneSpace> Space; // 0x58(0x10)
	struct TArray<enum class EAxis> Axis; // 0x68(0x10)
	struct TArray<float> Angle; // 0x78(0x10)
	struct TArray<struct FRotator> Rotator; // 0x88(0x10)
	struct TArray<float> Alpha; // 0x98(0x10)
	char pad_A8[0x20]; // 0xa8(0x20)
	enum class ERotateBoneInputType InputType; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
};

// ScriptStruct TslGame.TslAnimNode_RotateRootBone
// Size: 0x68 (Inherited: 0x30)
struct FTslAnimNode_RotateRootBone : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x30(0x18)
	char pad_48[0x10]; // 0x48(0x10)
	float Yaw; // 0x58(0x04)
	float Pitch; // 0x5c(0x04)
	bool bKeepChildTransforms; // 0x60(0x01)
	bool bInvert; // 0x61(0x01)
	char pad_62[0x6]; // 0x62(0x06)
};

// ScriptStruct TslGame.TslAnimNode_SequenceEvaluatorWithBlending
// Size: 0xa0 (Inherited: 0x58)
struct FTslAnimNode_SequenceEvaluatorWithBlending : FAnimNode_AssetPlayerBase {
	struct UAnimSequence* Sequence; // 0x58(0x08)
	struct UAnimSequence* PrevSequence; // 0x60(0x08)
	struct TArray<struct FTslSequenceBlending> SequencesData; // 0x68(0x10)
	char pad_78[0x10]; // 0x78(0x10)
	float ExplicitTime; // 0x88(0x04)
	float BlendTime; // 0x8c(0x04)
	enum class EAlphaBlendOption BlendType; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct UCurveFloat* CustomBlendCurve; // 0x98(0x08)
};

// ScriptStruct TslGame.TslSequenceBlending
// Size: 0x30 (Inherited: 0x00)
struct FTslSequenceBlending {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x28]; // 0x08(0x28)
};

// ScriptStruct TslGame.TslAnimNode_Slot
// Size: 0x78 (Inherited: 0x70)
struct FTslAnimNode_Slot : FAnimNode_Slot {
	float Alpha; // 0x70(0x04)
	enum class ECustomAnimSlotType SlotType; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// ScriptStruct TslGame.TslAnimNode_SlotByEnum
// Size: 0x1a8 (Inherited: 0x30)
struct FTslAnimNode_SlotByEnum : FAnimNode_Base {
	struct FPoseLink Source; // 0x30(0x18)
	bool ActiveEnumValue; // 0x48(0x01)
	enum class EAlphaBlendOption BlendType; // 0x49(0x01)
	char pad_4A[0x26]; // 0x4a(0x26)
	struct TArray<struct FName> Slot; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	struct TArray<float> BlendTime; // 0x90(0x10)
	struct TArray<int32> EnumToSlotIndex; // 0xa0(0x10)
	struct UCurveFloat* CustomBlendCurve; // 0xb0(0x08)
	char pad_B8[0x4]; // 0xb8(0x04)
	enum class EAnimAlphaInputType AlphaInputType; // 0xbc(0x01)
	bool bAlphaBoolEnabled; // 0xbd(0x01)
	char pad_BE[0x2]; // 0xbe(0x02)
	float Alpha; // 0xc0(0x04)
	struct FInputScaleBias AlphaScaleBias; // 0xc4(0x08)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct FInputAlphaBoolBlend AlphaBoolBlend; // 0xd0(0x50)
	struct FName AlphaCurveName; // 0x120(0x08)
	struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x128(0x30)
	char pad_158[0x50]; // 0x158(0x50)
};

// ScriptStruct TslGame.TslAnimNode_SlotByWeapon
// Size: 0x118 (Inherited: 0x70)
struct FTslAnimNode_SlotByWeapon : FAnimNode_Slot {
	float Alpha; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct TMap<enum class EAnimWeaponType, struct FName> SlotNames; // 0x78(0x50)
	enum class EAnimWeaponType InWeapon; // 0xc8(0x01)
	char pad_C9[0x4f]; // 0xc9(0x4f)
};

// ScriptStruct TslGame.*60f89ce98a
// Size: 0x18 (Inherited: 0x08)
struct F*60f89ce98a : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	struct UClass* *d1d977943a; // 0x10(0x08)
};

// ScriptStruct TslGame.*1306705ad1
// Size: 0x18 (Inherited: 0x08)
struct F*1306705ad1 : FTableRowBase {
	struct TArray<struct FName> ItemIDs; // 0x08(0x10)
};

// ScriptStruct TslGame.*701ab3c48a
// Size: 0x28 (Inherited: 0x08)
struct F*701ab3c48a : FTableRowBase {
	enum class ECoinTakeType CoinTakeType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 BannedRoundAttributes; // 0x0c(0x04)
	int32 TakeValue; // 0x10(0x04)
	bool bOverwrite; // 0x14(0x01)
	bool bUseCustomOverride; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
	struct TArray<struct F*d5ab90bf8d> CustomOverrideValues; // 0x18(0x10)
};

// ScriptStruct TslGame.*d5ab90bf8d
// Size: 0x08 (Inherited: 0x00)
struct F*d5ab90bf8d {
	int32 OverrideIndex; // 0x00(0x04)
	int32 OverrideValue; // 0x04(0x04)
};

// ScriptStruct TslGame.*5ad81470f2
// Size: 0x50 (Inherited: 0x08)
struct F*5ad81470f2 : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	bool bEssential; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 CarryLimit; // 0x14(0x04)
	enum class EBombItemCategory Category; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	int32 SortID; // 0x1c(0x04)
	bool Purchasable; // 0x20(0x01)
	bool bGiveItemAfterRestart; // 0x21(0x01)
	char pad_22[0x2]; // 0x22(0x02)
	int32 Price; // 0x24(0x04)
	struct TArray<struct FName> WeaponAttachments; // 0x28(0x10)
	struct F*86011b4932 WeaponAmmoData; // 0x38(0x10)
	enum class EBombScopeInfo ScopeInfo; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.*86011b4932
// Size: 0x10 (Inherited: 0x10)
struct F*86011b4932 : F*8cc52662e4 {
};

// ScriptStruct TslGame.*8cc52662e4
// Size: 0x10 (Inherited: 0x00)
struct F*8cc52662e4 {
	struct FName ItemID; // 0x00(0x08)
	int32 Stack; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*6841bdbb7b
// Size: 0x20 (Inherited: 0x10)
struct F*6841bdbb7b : F*8cc52662e4 {
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct TslGame.*7899425916
// Size: 0x520 (Inherited: 0x520)
struct F*7899425916 : F*082f93e0ad {
};

// ScriptStruct TslGame.*ac6d1178ff
// Size: 0x178 (Inherited: 0x08)
struct F*ac6d1178ff : FTableRowBase {
	enum class *a4c5e6b1e8 CharacterInteractType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float MaxInteractableDistance; // 0x0c(0x04)
	struct FText InteractionVerb; // 0x10(0x18)
	struct FText InteractiveObjectName; // 0x28(0x18)
	bool bUseTraceCheck; // 0x40(0x01)
	bool bTraceComplexForInteraction; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct F*ee5e6ace1b CastConfig; // 0x48(0x130)
};

// ScriptStruct TslGame.*ee5e6ace1b
// Size: 0x130 (Inherited: 0x00)
struct F*ee5e6ace1b {
	struct FText CastName; // 0x00(0x18)
	float CastTime; // 0x18(0x04)
	enum class ECastPriority CastPriority; // 0x1c(0x01)
	enum class ECastLevel CastLevel; // 0x1d(0x01)
	bool bIgnoreCastDistanceLimitation; // 0x1e(0x01)
	char pad_1F[0x1]; // 0x1f(0x01)
	float CastMaxDistance; // 0x20(0x04)
	float CastMaxDistanceMultiplierOnServer; // 0x24(0x04)
	float CasterAndCastObjectMaxDistance; // 0x28(0x04)
	float CasterAndCastObjectMaxDistanceMultiplierOnServer; // 0x2c(0x04)
	bool bCanCastInsideMovingVehicle; // 0x30(0x01)
	bool bKeepCastWhenVehicleHandling; // 0x31(0x01)
	char pad_32[0x2]; // 0x32(0x02)
	float MaxLinAcceleration; // 0x34(0x04)
	float CastMaxSpeed; // 0x38(0x04)
	float CastWalkSpeedModifier; // 0x3c(0x04)
	bool bNeedUnarm; // 0x40(0x01)
	bool bRecastsOnFinish; // 0x41(0x01)
	bool bLimitViewRotation; // 0x42(0x01)
	bool bForceStance; // 0x43(0x01)
	bool bSkipRestoreCharacterStance; // 0x44(0x01)
	bool bLockRotation; // 0x45(0x01)
	bool bCanCancelCasting; // 0x46(0x01)
	bool bCheckCastableConditionInProgress; // 0x47(0x01)
	bool bCancleWhenSprint; // 0x48(0x01)
	enum class ECastAnim CastAnim; // 0x49(0x01)
	char pad_4A[0x2]; // 0x4a(0x02)
	float CastBlendingTime; // 0x4c(0x04)
	float CancelBlockDuration; // 0x50(0x04)
	float CastAnimPlayRate; // 0x54(0x04)
	bool IsPermanentCasting; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct F*8121b8b50e CustomCastAnim; // 0x60(0xc0)
	enum class EStanceMode Stance; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct FName *32ba4b535a; // 0x128(0x08)
};

// ScriptStruct TslGame.*8121b8b50e
// Size: 0xc0 (Inherited: 0x00)
struct F*8121b8b50e {
	struct F*9a06c472e4 StartAnim; // 0x00(0x40)
	struct F*9a06c472e4 LoopAnim; // 0x40(0x40)
	struct F*9a06c472e4 EndAnim; // 0x80(0x40)
};

// ScriptStruct TslGame.*9a06c472e4
// Size: 0x40 (Inherited: 0x00)
struct F*9a06c472e4 {
	struct F*0cc4c653a2 AnimSequence; // 0x00(0x10)
	struct F*0cc4c653a2 AnimSequenceFPP; // 0x10(0x10)
	struct F*0cc4c653a2 AnimSequenceProne; // 0x20(0x10)
	struct F*0cc4c653a2 AnimSequenceProneFPP; // 0x30(0x10)
};

// ScriptStruct TslGame.*0cc4c653a2
// Size: 0x10 (Inherited: 0x00)
struct F*0cc4c653a2 {
	struct UAnimSequence* Sequence; // 0x00(0x08)
	float PlayRate; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*80d66c49b8
// Size: 0x480 (Inherited: 0x00)
struct F*80d66c49b8 {
	struct F*f772500dfc *f772500dfc; // 0x00(0x290)
	struct F*cd5f95885d *cd5f95885d; // 0x290(0x1b0)
	struct F*3c711692f5 *3c711692f5; // 0x440(0x38)
	char pad_478[0x8]; // 0x478(0x08)
};

// ScriptStruct TslGame.*3c711692f5
// Size: 0x38 (Inherited: 0x08)
struct F*3c711692f5 : F*fb15518f3e {
	int32 *33fabf2312; // 0x08(0x04)
	int32 *1a06ae5061; // 0x0c(0x04)
	float Timestamp; // 0x10(0x04)
	struct FVector *28f603d3e1; // 0x14(0x0c)
	int64 *5bc308e58f; // 0x20(0x08)
	struct FString TextMarker; // 0x28(0x10)
};

// ScriptStruct TslGame.*fb15518f3e
// Size: 0x08 (Inherited: 0x00)
struct F*fb15518f3e {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*cd5f95885d
// Size: 0x1b0 (Inherited: 0x08)
struct F*cd5f95885d : F*fb15518f3e {
	char pad_8[0x8]; // 0x08(0x08)
	struct F*59d7253689 *a2f0e94d1b; // 0x10(0xa0)
	struct F*59d7253689 *e3abca64bb; // 0xb0(0xa0)
	struct FString *dbf5b28b6a; // 0x150(0x10)
	struct FString *1548695e25; // 0x160(0x10)
	struct FString *9b4e2bec94; // 0x170(0x10)
	struct FString *64e0450c3b; // 0x180(0x10)
	char pad_190[0x20]; // 0x190(0x20)
};

// ScriptStruct TslGame.*59d7253689
// Size: 0xa0 (Inherited: 0x00)
struct F*59d7253689 {
	float Min; // 0x00(0x04)
	float Max; // 0x04(0x04)
	float Average; // 0x08(0x04)
	char pad_C[0x94]; // 0x0c(0x94)
};

// ScriptStruct TslGame.*f772500dfc
// Size: 0x290 (Inherited: 0x08)
struct F*f772500dfc : F*fb15518f3e {
	char pad_8[0x8]; // 0x08(0x08)
	struct F*59d7253689 Frame; // 0x10(0xa0)
	struct F*59d7253689 *8989347a0b; // 0xb0(0xa0)
	struct F*59d7253689 *53e4224237; // 0x150(0xa0)
	struct F*59d7253689 *215907856e; // 0x1f0(0xa0)
};

// ScriptStruct TslGame.*ae7cfdc3ba
// Size: 0x40 (Inherited: 0x00)
struct F*ae7cfdc3ba {
	struct FString DeviceName; // 0x00(0x10)
	struct FString ClientVersion; // 0x10(0x10)
	struct FString MapName; // 0x20(0x10)
	struct FString ModeName; // 0x30(0x10)
};

// ScriptStruct TslGame.*dcc9d6b86c
// Size: 0x28 (Inherited: 0x08)
struct F*dcc9d6b86c : FTableRowBase {
	float phase; // 0x08(0x04)
	float killer_x; // 0x0c(0x04)
	float killer_y; // 0x10(0x04)
	float killer_z; // 0x14(0x04)
	float victim_x; // 0x18(0x04)
	float victim_y; // 0x1c(0x04)
	float victim_z; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.HemostasisTableRow
// Size: 0x18 (Inherited: 0x08)
struct FHemostasisTableRow : FTableRowBase {
	int32 Stack; // 0x08(0x04)
	bool bCanHemostasis; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float HemostasisPercent; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*5f0b9a1ca8
// Size: 0x3c8 (Inherited: 0x3b8)
struct F*5f0b9a1ca8 : FItemTableRowCastable {
	struct TArray<struct F*0e5d8f7dd9> SupplyItems; // 0x3b8(0x10)
};

// ScriptStruct TslGame.ItemTableRowCastable
// Size: 0x3b8 (Inherited: 0x268)
struct FItemTableRowCastable : F*7700dab07d {
	bool *fc18185089; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct F*ee5e6ace1b *ee5e6ace1b; // 0x270(0x130)
	enum class ECastableItemType *6e188b0be8; // 0x3a0(0x01)
	bool *607648242f; // 0x3a1(0x01)
	char pad_3A2[0x6]; // 0x3a2(0x06)
	struct TArray<struct UClass*> *accea9dabe; // 0x3a8(0x10)
};

// ScriptStruct TslGame.*7700dab07d
// Size: 0x268 (Inherited: 0x08)
struct F*7700dab07d : FTableRowBase {
	char bStackable : 1; // 0x08(0x01)
	char bUsable : 1; // 0x08(0x01)
	char bIsConsumable : 1; // 0x08(0x01)
	char bSetStackMaterialParameter : 1; // 0x08(0x01)
	char bDisableSpawnInGame : 1; // 0x08(0x01)
	char pad_8_5 : 3; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 StackCount; // 0x0c(0x04)
	int32 DefaultStackCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FText ItemName; // 0x18(0x18)
	struct FText ItemCategory; // 0x30(0x18)
	struct FText ItemDetailedName; // 0x48(0x18)
	struct FText ItemDescription; // 0x60(0x18)
	float ItemMaxInteractableDistance; // 0x78(0x04)
	int32 StackCountMax; // 0x7c(0x04)
	float SpacePerItem; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UStaticMesh* DroppedMesh; // 0x88(0x20)
	float DroppedMeshScale; // 0xa8(0x04)
	bool bDropAsProjectile; // 0xac(0x01)
	bool bThermalScopeInteractive; // 0xad(0x01)
	enum class EThermalItemType ThermalItemType; // 0xae(0x01)
	char pad_AF[0x1]; // 0xaf(0x01)
	struct U*901c357d94* ProjectileConfig; // 0xb0(0x20)
	struct UTexture* Icon; // 0xd0(0x20)
	struct UTexture* ToolTipIcon; // 0xf0(0x20)
	float IconSizeRatio; // 0x110(0x04)
	float ToolTipIconSizeRatio; // 0x114(0x04)
	struct UAkAudioEvent* DropSoundAk; // 0x118(0x20)
	struct FName DropAnimation; // 0x138(0x08)
	struct UAkAudioEvent* PickUpSoundAk; // 0x140(0x20)
	enum class EPickupAnimType PickUpAnimationOverride; // 0x160(0x01)
	char pad_161[0x7]; // 0x161(0x07)
	struct UAkAudioEvent* InventoryPutSoundAk; // 0x168(0x20)
	int32 SortPriority; // 0x188(0x04)
	enum class EItemCategory Category; // 0x18c(0x01)
	char pad_18D[0x3]; // 0x18d(0x03)
	struct FName SubCategory; // 0x190(0x08)
	bool bIsToy; // 0x198(0x01)
	bool bNeedToCheckPopup; // 0x199(0x01)
	bool bIsLobbyItem; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	int32 LobbyItemID; // 0x19c(0x04)
	struct F*e46b9d3dc8 LobbyItemDesc; // 0x1a0(0x60)
	bool bIsLobbyWeapon; // 0x200(0x01)
	char pad_201[0x3]; // 0x201(0x03)
	int32 LobbyWeaponID; // 0x204(0x04)
	struct UClass* LobbyWeaponInstance; // 0x208(0x20)
	bool *f491aa0129; // 0x228(0x01)
	bool *08366c13d7; // 0x229(0x01)
	bool *351d2fe920; // 0x22a(0x01)
	char pad_22B[0x5]; // 0x22b(0x05)
	struct FString Note; // 0x230(0x10)
	int32 AIFullValue; // 0x240(0x04)
	int32 ItemSubType; // 0x244(0x04)
	struct FName ItemID; // 0x248(0x08)
	struct UClass* ItemClass; // 0x250(0x08)
	struct UClass* *c568c632e9; // 0x258(0x08)
	struct U*42ed042876* *2246280445; // 0x260(0x08)
};

// ScriptStruct TslGame.*e46b9d3dc8
// Size: 0x60 (Inherited: 0x00)
struct F*e46b9d3dc8 {
	char *fd90b91fc0 : 1; // 0x00(0x01)
	char bPointSellable : 1; // 0x00(0x01)
	char *8f4074e98b : 1; // 0x00(0x01)
	char bPointRefundable : 1; // 0x00(0x01)
	char pad_0_4 : 4; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString *42b25e4720; // 0x08(0x10)
	enum class ELobbyItemTier Tier; // 0x18(0x01)
	enum class ELobbyItemCategory Category; // 0x19(0x01)
	char pad_1A[0x6]; // 0x1a(0x06)
	struct FText Description; // 0x20(0x18)
	bool *e9ccf92ce9; // 0x38(0x01)
	bool *cb7dff0fa2; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct TArray<enum class ELobbyItemPlatform> Platforms; // 0x40(0x10)
	float *9b15c31f57; // 0x50(0x04)
	enum class ELobbyItemPointSellingType *474059df5b; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	int32 *a41e382934; // 0x58(0x04)
	int32 *8128aaa76c; // 0x5c(0x04)
};

// ScriptStruct TslGame.*0e5d8f7dd9
// Size: 0x10 (Inherited: 0x00)
struct F*0e5d8f7dd9 {
	struct FName SupplyItemID; // 0x00(0x08)
	int32 StackCount; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*f5bf96872b
// Size: 0x280 (Inherited: 0x268)
struct F*f5bf96872b : F*7700dab07d {
	enum class ECustomPartType CustomPart; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct TArray<struct FName> PartTags; // 0x270(0x10)
};

// ScriptStruct TslGame.*900c092874
// Size: 0x280 (Inherited: 0x280)
struct F*900c092874 : F*2d9388c3be {
};

// ScriptStruct TslGame.*2d9388c3be
// Size: 0x280 (Inherited: 0x268)
struct F*2d9388c3be : F*7700dab07d {
	bool bAutoAction; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct F*5226c02a35 SkinParam; // 0x270(0x10)
};

// ScriptStruct TslGame.*5226c02a35
// Size: 0x10 (Inherited: 0x00)
struct F*5226c02a35 {
	enum class ESkinCategory SkinCategory; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName SkinName; // 0x08(0x08)
};

// ScriptStruct TslGame.ItemTableRowVehiclePart
// Size: 0x310 (Inherited: 0x280)
struct FItemTableRowVehiclePart : F*f5bf96872b {
	enum class EVehiclePartType VehiclePart; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct TArray<struct UMaterialInterface*> Materials; // 0x288(0x10)
	struct TMap<int32, struct UMaterialInterface*> OverrideDestroyedMaterial; // 0x298(0x50)
	struct USkeletalMesh* SkeletalMesh; // 0x2e8(0x20)
	int32 WheelSize; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
};

// ScriptStruct TslGame.*26f265dbc6
// Size: 0x38 (Inherited: 0x00)
struct F*26f265dbc6 {
	float *a68c0fc3a9; // 0x00(0x04)
	float *ad5a070f01; // 0x04(0x04)
	int32 *dcb293c7c2; // 0x08(0x04)
	float *d4d1ea97df; // 0x0c(0x04)
	float *c74f8007d8; // 0x10(0x04)
	float *4c04abd9b5; // 0x14(0x04)
	int32 *5c2f50adb9; // 0x18(0x04)
	float *beaf2c881b; // 0x1c(0x04)
	struct TArray<struct F*7ed39951b7> *b8bb2758ef; // 0x20(0x10)
	bool *565b603494; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *5e705bdf4b; // 0x34(0x04)
};

// ScriptStruct TslGame.*7ed39951b7
// Size: 0x30 (Inherited: 0x00)
struct F*7ed39951b7 {
	struct FString MapName; // 0x00(0x10)
	struct FString LocationName; // 0x10(0x10)
	struct FVector Location; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*f52e83d649
// Size: 0x10 (Inherited: 0x00)
struct F*f52e83d649 {
	uint32 *81d4f746f5; // 0x00(0x04)
	float *d4d1ea97df; // 0x04(0x04)
	float *7f49a991da; // 0x08(0x04)
	bool *81a9cff352; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*ca5138991a
// Size: 0x08 (Inherited: 0x00)
struct F*ca5138991a {
	float *a68c0fc3a9; // 0x00(0x04)
	float *69a9988eae; // 0x04(0x04)
};

// ScriptStruct TslGame.*30345b309e
// Size: 0x38 (Inherited: 0x00)
struct F*30345b309e {
	float *a68c0fc3a9; // 0x00(0x04)
	float *ad5a070f01; // 0x04(0x04)
	int32 *dcb293c7c2; // 0x08(0x04)
	float *d4d1ea97df; // 0x0c(0x04)
	float *c74f8007d8; // 0x10(0x04)
	float *4c04abd9b5; // 0x14(0x04)
	int32 *5c2f50adb9; // 0x18(0x04)
	float *beaf2c881b; // 0x1c(0x04)
	struct TArray<struct F*41cffee788> *b8bb2758ef; // 0x20(0x10)
	bool *565b603494; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *5e705bdf4b; // 0x34(0x04)
};

// ScriptStruct TslGame.*41cffee788
// Size: 0x30 (Inherited: 0x00)
struct F*41cffee788 {
	struct FString MapName; // 0x00(0x10)
	struct FString LocationName; // 0x10(0x10)
	struct FVector Location; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*6779da4ec5
// Size: 0x18 (Inherited: 0x08)
struct F*6779da4ec5 : FTableRowBase {
	struct UStaticMesh* OldMesh; // 0x08(0x08)
	struct UStaticMesh* NewMesh; // 0x10(0x08)
};

// ScriptStruct TslGame.*6c2900677b
// Size: 0x10 (Inherited: 0x08)
struct F*6c2900677b : FTableRowBase {
	struct UStaticMesh* Mesh; // 0x08(0x08)
};

// ScriptStruct TslGame.*f68071f0c6
// Size: 0x30 (Inherited: 0x08)
struct F*f68071f0c6 : FTableRowBase {
	enum class *8d98cbd81d DetailMode; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct TArray<struct UStaticMesh*> MeshesToOverride; // 0x10(0x10)
	struct TArray<struct UMaterialInterface*> DecalMaterialsToOverride; // 0x20(0x10)
};

// ScriptStruct TslGame.*1c62949ea7
// Size: 0x10 (Inherited: 0x08)
struct F*1c62949ea7 : FTableRowBase {
	struct UClass* BPClass; // 0x08(0x08)
};

// ScriptStruct TslGame.*7b30cb014c
// Size: 0x70 (Inherited: 0x08)
struct F*7b30cb014c : FTableRowBase {
	struct FStringAssetReference *749e69d29c; // 0x08(0x10)
	struct FStringAssetReference *fd8669b29f; // 0x18(0x10)
	struct FStringAssetReference *8fac0063f5; // 0x28(0x10)
	struct FStringAssetReference *d138a97898; // 0x38(0x10)
	struct FStringAssetReference *8c55f84b1a; // 0x48(0x10)
	struct FStringAssetReference *6eb40aa249; // 0x58(0x10)
	float Ratio; // 0x68(0x04)
	bool *f10d447b0f; // 0x6c(0x01)
	bool *a656f33999; // 0x6d(0x01)
	bool *544142e33c; // 0x6e(0x01)
	bool *aedd510a3d; // 0x6f(0x01)
};

// ScriptStruct TslGame.*06b1316cf5
// Size: 0x18 (Inherited: 0x08)
struct F*06b1316cf5 : FTableRowBase {
	struct FVector BeachPointLocation; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*197b00cf34
// Size: 0x18 (Inherited: 0x08)
struct F*197b00cf34 : FTableRowBase {
	int32 LocationX; // 0x08(0x04)
	int32 LocationY; // 0x0c(0x04)
	int32 LocationZ; // 0x10(0x04)
	int32 SafeScore; // 0x14(0x04)
};

// ScriptStruct TslGame.*bf79b755db
// Size: 0x60 (Inherited: 0x08)
struct F*bf79b755db : FTableRowBase {
	float NormalArea; // 0x08(0x04)
	char pad_C[0x54]; // 0x0c(0x54)
};

// ScriptStruct TslGame.*af5fb27ea0
// Size: 0xc8 (Inherited: 0x60)
struct F*af5fb27ea0 : F*bf79b755db {
	float Farm; // 0x60(0x04)
	float FerryPier; // 0x64(0x04)
	float Gatka; // 0x68(0x04)
	float Georgopol; // 0x6c(0x04)
	float Hospital; // 0x70(0x04)
	float Kameshki; // 0x74(0x04)
	float Lipovka; // 0x78(0x04)
	float Mansion; // 0x7c(0x04)
	float Mylta; // 0x80(0x04)
	float MyltaPower; // 0x84(0x04)
	float Novorepnoye; // 0x88(0x04)
	float Pochinki; // 0x8c(0x04)
	float Primorsk; // 0x90(0x04)
	float Prison; // 0x94(0x04)
	float Quarry; // 0x98(0x04)
	float Rozhok; // 0x9c(0x04)
	float Ruins; // 0xa0(0x04)
	float School; // 0xa4(0x04)
	float Severny; // 0xa8(0x04)
	float Shelter; // 0xac(0x04)
	float ShootingRange; // 0xb0(0x04)
	float SosnovkaMilitaryBase; // 0xb4(0x04)
	float Stalber; // 0xb8(0x04)
	float YasnayaPolyana; // 0xbc(0x04)
	float Zharki; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// ScriptStruct TslGame.*1a4034bba0
// Size: 0x70 (Inherited: 0x60)
struct F*1a4034bba0 : F*bf79b755db {
	float Level_A; // 0x60(0x04)
	float Level_B; // 0x64(0x04)
	float Level_C; // 0x68(0x04)
	float Level_D; // 0x6c(0x04)
};

// ScriptStruct TslGame.*0e7ac4ae67
// Size: 0xd8 (Inherited: 0x60)
struct F*0e7ac4ae67 : F*bf79b755db {
	float Alcantara; // 0x60(0x04)
	float CampoMilitar; // 0x64(0x04)
	float Chumacera; // 0x68(0x04)
	float Craterfields; // 0x6c(0x04)
	float CruzdelValle; // 0x70(0x04)
	float ElAzahar; // 0x74(0x04)
	float ElPozo; // 0x78(0x04)
	float Graveyard; // 0x7c(0x04)
	float HeciendadelPatron; // 0x80(0x04)
	float Junkyard; // 0x84(0x04)
	float LaBendita; // 0x88(0x04)
	float LaCobreria; // 0x8c(0x04)
	float Ladrillera; // 0x90(0x04)
	float Lmpala; // 0x94(0x04)
	float LosHigos; // 0x98(0x04)
	float LosLeones; // 0x9c(0x04)
	float MinasdelSur; // 0xa0(0x04)
	float MinasGenerales; // 0xa4(0x04)
	float MonteNuevo; // 0xa8(0x04)
	float Pecado; // 0xac(0x04)
	float Powergrid; // 0xb0(0x04)
	float Prison; // 0xb4(0x04)
	float PuertoParaiso; // 0xb8(0x04)
	float Ruins; // 0xbc(0x04)
	float SanMartin; // 0xc0(0x04)
	float TierraBronca; // 0xc4(0x04)
	float TorreAhumada; // 0xc8(0x04)
	float TrailerPark; // 0xcc(0x04)
	float ValledelMar; // 0xd0(0x04)
	float WaterTreatment; // 0xd4(0x04)
};

// ScriptStruct TslGame.*a79df8cd37
// Size: 0xa0 (Inherited: 0x60)
struct F*a79df8cd37 : F*bf79b755db {
	float castle; // 0x60(0x04)
	float CoalMine; // 0x64(0x04)
	float Cosmodrome; // 0x68(0x04)
	float DekaMesto; // 0x6c(0x04)
	float Dinoland; // 0x70(0x04)
	float Kranik; // 0x74(0x04)
	float Laveni; // 0x78(0x04)
	float Laznova; // 0x7c(0x04)
	float LumberYard; // 0x80(0x04)
	float Naros; // 0x84(0x04)
	float Observatory; // 0x88(0x04)
	float Pavilka; // 0x8c(0x04)
	float TrainStation; // 0x90(0x04)
	float Trika; // 0x94(0x04)
	float Villa; // 0x98(0x04)
	float Winery; // 0x9c(0x04)
};

// ScriptStruct TslGame.*11b334d117
// Size: 0x78 (Inherited: 0x60)
struct F*11b334d117 : F*bf79b755db {
	float CoalYards; // 0x60(0x04)
	float Docks; // 0x64(0x04)
	float IndustrialPark; // 0x68(0x04)
	float RailYard; // 0x6c(0x04)
	float Steelmill; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.*8d3325af04
// Size: 0xb0 (Inherited: 0x60)
struct F*8d3325af04 : F*bf79b755db {
	float Arena; // 0x60(0x04)
	float Assembly; // 0x64(0x04)
	float Cabana_Town; // 0x68(0x04)
	float Coastal_Towns; // 0x6c(0x04)
	float Concert; // 0x70(0x04)
	float Dam_Town; // 0x74(0x04)
	float downtown; // 0x78(0x04)
	float Fulfillment_Center; // 0x7c(0x04)
	float Hill_Town; // 0x80(0x04)
	float Hydroelectric_Dam; // 0x84(0x04)
	float Little_City; // 0x88(0x04)
	float Lodge; // 0x8c(0x04)
	float Simple_Town; // 0x90(0x04)
	float Solar_Town; // 0x94(0x04)
	float Storage_Town; // 0x98(0x04)
	float Sunken_Town; // 0x9c(0x04)
	float swamp; // 0xa0(0x04)
	float Swamp_Town; // 0xa4(0x04)
	float Trailer_Town; // 0xa8(0x04)
	float Wind_Farms; // 0xac(0x04)
};

// ScriptStruct TslGame.*8f8ba40825
// Size: 0xb0 (Inherited: 0x60)
struct F*8f8ba40825 : F*bf79b755db {
	float AirField; // 0x60(0x04)
	float BanTai; // 0x64(0x04)
	float Bootcamp; // 0x68(0x04)
	float CampAlpha; // 0x6c(0x04)
	float CampBravo; // 0x70(0x04)
	float CampCharlie; // 0x74(0x04)
	float Cave; // 0x78(0x04)
	float Getaway; // 0x7c(0x04)
	float Hatinh; // 0x80(0x04)
	float Kampong; // 0x84(0x04)
	float Khao; // 0x88(0x04)
	float Lawaki; // 0x8c(0x04)
	float NaKham; // 0x90(0x04)
	float Painan; // 0x94(0x04)
	float ParadiseResort; // 0x98(0x04)
	float Quarry; // 0x9c(0x04)
	float Ruins; // 0xa0(0x04)
	float Sahmee; // 0xa4(0x04)
	float Tambang; // 0xa8(0x04)
	float Tatmok; // 0xac(0x04)
};

// ScriptStruct TslGame.*fd6614e6e2
// Size: 0x78 (Inherited: 0x60)
struct F*fd6614e6e2 : F*bf79b755db {
	float AlHabar; // 0x60(0x04)
	float AlHayik; // 0x64(0x04)
	float Bahrsahir; // 0x68(0x04)
	float Bashara; // 0x6c(0x04)
	float Hadiqanemo; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.*3c3e503072
// Size: 0xa8 (Inherited: 0x60)
struct F*3c3e503072 : F*bf79b755db {
	float airport; // 0x60(0x04)
	float ArmyBase; // 0x64(0x04)
	float Buksansa; // 0x68(0x04)
	float FishingCamp; // 0x6c(0x04)
	float Godok; // 0x70(0x04)
	float Haemoosa; // 0x74(0x04)
	float Hapo; // 0x78(0x04)
	float Hosan; // 0x7c(0x04)
	float HosanPrison; // 0x80(0x04)
	float Kangneung; // 0x84(0x04)
	float Ohyang; // 0x88(0x04)
	float Palace; // 0x8c(0x04)
	float School; // 0x90(0x04)
	float ShipYard; // 0x94(0x04)
	float Songam; // 0x98(0x04)
	float Studio; // 0x9c(0x04)
	float Terminal; // 0xa0(0x04)
	float Wolsong; // 0xa4(0x04)
};

// ScriptStruct TslGame.*78c2886813
// Size: 0x20 (Inherited: 0x08)
struct F*78c2886813 : FTableRowBase {
	struct FText *9489ef3f8b; // 0x08(0x18)
};

// ScriptStruct TslGame.*733ab0a24f
// Size: 0x30 (Inherited: 0x00)
struct F*733ab0a24f {
	bool bUseMateriaSlotIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<int32> MaterialSlotIndex; // 0x08(0x10)
	bool bUseMaterialSlotName; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct TArray<struct FName> MaterialSlotName; // 0x20(0x10)
};

// ScriptStruct TslGame.*566871314c
// Size: 0x48 (Inherited: 0x00)
struct F*566871314c {
	struct F*2872c9f825 *2872c9f825; // 0x00(0x40)
	struct UImage* *a839b35a23; // 0x40(0x08)
};

// ScriptStruct TslGame.*2872c9f825
// Size: 0x40 (Inherited: 0x00)
struct F*2872c9f825 {
	struct FGuid IconGUID; // 0x00(0x10)
	struct FVector WorldLocation; // 0x10(0x0c)
	struct FRotator WorldRotation; // 0x1c(0x0c)
	enum class EAuxilaryIconType IconType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FLinearColor IconColor; // 0x2c(0x10)
	bool bIsVisible; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct TslGame.*b9ddbae00a
// Size: 0x60 (Inherited: 0x00)
struct F*b9ddbae00a {
	struct FString *2410e9dcfc; // 0x00(0x10)
	char pad_10[0x50]; // 0x10(0x50)
};

// ScriptStruct TslGame.*5ba4f28f68
// Size: 0x20 (Inherited: 0x00)
struct F*5ba4f28f68 {
	struct FString *46a0814e59; // 0x00(0x10)
	struct FString *a3b41c4e6d; // 0x10(0x10)
};

// ScriptStruct TslGame.*d32f3bb8f0
// Size: 0x28 (Inherited: 0x08)
struct F*d32f3bb8f0 : FTableRowBase {
	enum class EAuxilaryIconType IconType; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct UTexture* IconTexture; // 0x10(0x08)
	struct UCurveFloat* IconRatioCurve; // 0x18(0x08)
	float MinimapIconRatio; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.*8cba90af1f
// Size: 0x28 (Inherited: 0x00)
struct F*8cba90af1f {
	char pad_0[0x18]; // 0x00(0x18)
	struct UCameraShake* *0f1e90f12e; // 0x18(0x08)
	struct UCameraShake* *ba9f8ce871; // 0x20(0x08)
};

// ScriptStruct TslGame.*485b30460a
// Size: 0x28 (Inherited: 0x00)
struct F*485b30460a {
	float *444b05ef7f; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FName *988808573e; // 0x08(0x08)
	bool bShowTrunkMesh; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct F*637d47bfc7> *4e2d279506; // 0x18(0x10)
};

// ScriptStruct TslGame.*637d47bfc7
// Size: 0x28 (Inherited: 0x00)
struct F*637d47bfc7 {
	struct UStaticMesh* TrunkMesh; // 0x00(0x20)
	float MinCapacityPercent; // 0x20(0x04)
	float MaxCapacityPercent; // 0x24(0x04)
};

// ScriptStruct TslGame.*e76986782c
// Size: 0x30 (Inherited: 0x00)
struct F*e76986782c {
	struct F*79dd943e33 Stand; // 0x00(0x10)
	struct F*79dd943e33 Crouch; // 0x10(0x10)
	struct F*79dd943e33 Prone; // 0x20(0x10)
};

// ScriptStruct TslGame.*79dd943e33
// Size: 0x10 (Inherited: 0x00)
struct F*79dd943e33 {
	float *763260d7ec; // 0x00(0x04)
	float *b8e3fb0e10; // 0x04(0x04)
	float *94f1255134; // 0x08(0x04)
	float *216142a400; // 0x0c(0x04)
};

// ScriptStruct TslGame.*5068e85671
// Size: 0x0c (Inherited: 0x00)
struct F*5068e85671 {
	struct FVector Acceleration; // 0x00(0x0c)
};

// ScriptStruct TslGame.*e607880f9c
// Size: 0x20 (Inherited: 0x00)
struct F*e607880f9c {
	struct UBlendSpace1D* BlendSpaceFPP; // 0x00(0x08)
	struct UBlendSpace1D* BlendSpaceTPP; // 0x08(0x08)
	struct FInputBlendPose BlendSettings; // 0x10(0x10)
};

// ScriptStruct TslGame.*6b99728ef2
// Size: 0x10 (Inherited: 0x00)
struct F*6b99728ef2 {
	struct TArray<struct F*9ce968d7fe> IdleAnimations; // 0x00(0x10)
};

// ScriptStruct TslGame.*9ce968d7fe
// Size: 0x20 (Inherited: 0x00)
struct F*9ce968d7fe {
	struct UAnimSequence* AnimAsset; // 0x00(0x08)
	struct FInt32Range LoopingCounter; // 0x08(0x10)
	float ChanceToPlay; // 0x18(0x04)
	float BlendTime; // 0x1c(0x04)
};

// ScriptStruct TslGame.*97d9447c83
// Size: 0x10 (Inherited: 0x00)
struct F*97d9447c83 {
	struct FName Name; // 0x00(0x08)
	bool bIsAxis; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float Scale; // 0x0c(0x04)
};

// ScriptStruct TslGame.*b94ee6cfe3
// Size: 0x10 (Inherited: 0x00)
struct F*b94ee6cfe3 {
	struct FName Name; // 0x00(0x08)
	float Scale; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*1ad794ed32
// Size: 0x10 (Inherited: 0x00)
struct F*1ad794ed32 {
	bool bEnabled; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Health; // 0x04(0x04)
	int32 Count; // 0x08(0x04)
	bool bUseRandomizedWeaponKits; // 0x0c(0x01)
	bool bUseUniqueWeaponKits; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
};

// ScriptStruct TslGame.*3dd1044166
// Size: 0x10 (Inherited: 0x00)
struct F*3dd1044166 {
	struct FName *08db616b8e; // 0x00(0x08)
	int32 Count; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*51761df26e
// Size: 0x20 (Inherited: 0x00)
struct F*51761df26e {
	enum class EAutoSpectatePriority *6bd66ccee5; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 TeamId; // 0x04(0x04)
	struct FString *3fb58ba8ff; // 0x08(0x10)
	float *82606e4f97; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*12af956b8d
// Size: 0x50 (Inherited: 0x00)
struct F*12af956b8d {
	enum class EObserverHudAnimType AnimType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 EliminatorTeamNum; // 0x04(0x04)
	int32 EliminatedTeamNum; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString KillingSpreePlayerName; // 0x10(0x10)
	struct FString KillingSpreeClanName; // 0x20(0x10)
	struct FString KillingSpreeTeamName; // 0x30(0x10)
	int32 KillingSpreeTeamNum; // 0x40(0x04)
	int32 KillingSpreeKillCount; // 0x44(0x04)
	enum class EOutGamePlatformProvider KillingSpreePlayerPlatform; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.*e32357d646
// Size: 0x18 (Inherited: 0x00)
struct F*e32357d646 {
	struct FString UniqueId; // 0x00(0x10)
	bool *e7b62e5d0c; // 0x10(0x01)
	bool *ae06fe6d11; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
};

// ScriptStruct TslGame.CommunicateTargetInfo
// Size: 0x30 (Inherited: 0x00)
struct FCommunicateTargetInfo {
	struct FString UniqueId; // 0x00(0x10)
	struct FString Nickname; // 0x10(0x10)
	enum class EOutGamePlatformProvider PlatformData; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	struct FCommunicationPrivilege CommunicationPrivileges; // 0x24(0x08)
	bool bMyFollower; // 0x2c(0x01)
	bool bIAmFollowing; // 0x2d(0x01)
	char pad_2E[0x2]; // 0x2e(0x02)
};

// ScriptStruct TslGame.CommunicationPrivilege
// Size: 0x08 (Inherited: 0x00)
struct FCommunicationPrivilege {
	int32 CommunicationPrivilege_Multiplay; // 0x00(0x04)
	int32 CommunicationPrivilege_CrossPlay; // 0x04(0x04)
};

// ScriptStruct TslGame.*644c946c08
// Size: 0x20 (Inherited: 0x00)
struct F*644c946c08 {
	struct FString Key; // 0x00(0x10)
	struct TArray<struct F*6a22eb4abf> Logs; // 0x10(0x10)
};

// ScriptStruct TslGame.*6a22eb4abf
// Size: 0x20 (Inherited: 0x00)
struct F*6a22eb4abf {
	struct FString Key; // 0x00(0x10)
	struct FString Value; // 0x10(0x10)
};

// ScriptStruct TslGame.BodyTypeDef
// Size: 0x08 (Inherited: 0x00)
struct FBodyTypeDef {
	int32 *a6591f90b2; // 0x00(0x04)
	int32 *b9d3504e89; // 0x04(0x04)
};

// ScriptStruct TslGame.*6b0721dc00
// Size: 0x98 (Inherited: 0x00)
struct F*6b0721dc00 {
	struct FString PlayerName; // 0x00(0x10)
	uint32 *1fc73a82f4; // 0x10(0x04)
	int32 TeamId; // 0x14(0x04)
	bool *0b891081c0; // 0x18(0x01)
	bool Gender; // 0x19(0x01)
	bool *74b429a01f; // 0x1a(0x01)
	char pad_1B[0x5]; // 0x1b(0x05)
	struct TArray<int32> *9f92ab75c7; // 0x20(0x10)
	struct TArray<int32> *b05cc69e02; // 0x30(0x10)
	struct TArray<int32> *9ca1de0454; // 0x40(0x10)
	struct FString Emotes; // 0x50(0x10)
	struct FName *55c72e3b00; // 0x60(0x08)
	struct FName *dafdbfe226; // 0x68(0x08)
	float *dcfb733bfe; // 0x70(0x04)
	float *f25fb2d78a; // 0x74(0x04)
	float *30ab7d380b; // 0x78(0x04)
	float *d46794cbe5; // 0x7c(0x04)
	bool *966969ed1d; // 0x80(0x01)
	bool *530c33b0a0; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
	struct FString *1b1e820f5c; // 0x88(0x10)
};

// ScriptStruct TslGame.*dc04f541cd
// Size: 0x10 (Inherited: 0x00)
struct F*dc04f541cd {
	struct FVector Location; // 0x00(0x0c)
	bool *63d0d48996; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*b31382c82b
// Size: 0x10 (Inherited: 0x00)
struct F*b31382c82b {
	enum class EMatchStartType Type; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UClass* Class; // 0x08(0x08)
};

// ScriptStruct TslGame.*2d3ecd0e82
// Size: 0x08 (Inherited: 0x00)
struct F*2d3ecd0e82 {
	float *3232f7a6a2; // 0x00(0x04)
	float *e276f57c64; // 0x04(0x04)
};

// ScriptStruct TslGame.*082ab99680
// Size: 0x24 (Inherited: 0x00)
struct F*082ab99680 {
	enum class EInventoryRadioMessageType *dde7e9aaf5; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 *46ff0889f7; // 0x04(0x04)
	int32 *d61bb58780; // 0x08(0x04)
	bool *3055a24dc7; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	int32 *2ff76438b5; // 0x10(0x04)
	int32 *ad57f192f5; // 0x14(0x04)
	struct FVector_NetQuantize *d90f69de94; // 0x18(0x0c)
};

// ScriptStruct TslGame.*475994f224
// Size: 0x30 (Inherited: 0x00)
struct F*475994f224 {
	enum class ERadioMessageCategory Category; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FString> *712517542c; // 0x08(0x10)
	struct TArray<struct FText> *129d5f391b; // 0x18(0x10)
	int32 *f028b4f9c5; // 0x28(0x04)
	enum class ERadioMessageHighlightType *e8baee6de1; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// ScriptStruct TslGame.*fcf08e21a4
// Size: 0x38 (Inherited: 0x28)
struct F*fcf08e21a4 : F*774bbb389e {
	struct TArray<struct FName> SkinnableTagList; // 0x28(0x10)
};

// ScriptStruct TslGame.*774bbb389e
// Size: 0x28 (Inherited: 0x00)
struct F*774bbb389e {
	struct FText ItemName; // 0x00(0x18)
	struct FString BlueprintId; // 0x18(0x10)
};

// ScriptStruct TslGame.*ef930bbbf4
// Size: 0x38 (Inherited: 0x28)
struct F*ef930bbbf4 : F*774bbb389e {
	enum class EWeaponClass WeaponClassEnum; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FName SkinTag; // 0x30(0x08)
};

// ScriptStruct TslGame.*e4eec66a2d
// Size: 0x10 (Inherited: 0x00)
struct F*e4eec66a2d {
	struct FName ItemID; // 0x00(0x08)
	int32 Count; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.RankingInfo
// Size: 0x18 (Inherited: 0x00)
struct FRankingInfo {
	int32 TeamId; // 0x00(0x04)
	int32 *f334edac6b; // 0x04(0x04)
	int32 *21e5644341; // 0x08(0x04)
	int32 Score; // 0x0c(0x04)
	int32 Order; // 0x10(0x04)
	bool *89b4dfed49; // 0x14(0x01)
	bool *27b69ced20; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
};

// ScriptStruct TslGame.*1b4ab4ebac
// Size: 0x08 (Inherited: 0x00)
struct F*1b4ab4ebac {
	struct FName ItemID; // 0x00(0x08)
};

// ScriptStruct TslGame.*dbf31c1c98
// Size: 0x10 (Inherited: 0x00)
struct F*dbf31c1c98 {
	struct FStringClassReference ObjectClass; // 0x00(0x10)
};

// ScriptStruct TslGame.*3b9eade47d
// Size: 0x10 (Inherited: 0x00)
struct F*3b9eade47d {
	struct UTexture* Texture; // 0x00(0x08)
	float Ratio; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*e4da26a3da
// Size: 0x30 (Inherited: 0x00)
struct F*e4da26a3da {
	struct FKey Key; // 0x00(0x18)
	struct UTexture* KeyIcon; // 0x18(0x08)
	struct UTexture* KeyIcon_PS; // 0x20(0x08)
	float IconRatio; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*96db306e1b
// Size: 0x08 (Inherited: 0x00)
struct F*96db306e1b {
	int32 Width; // 0x00(0x04)
	int32 Height; // 0x04(0x04)
};

// ScriptStruct TslGame.*faf4763216
// Size: 0x20 (Inherited: 0x00)
struct F*faf4763216 {
	struct FString ActorName; // 0x00(0x10)
	struct FVector *4a2bdf5731; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*b08de5f7a8
// Size: 0x20 (Inherited: 0x00)
struct F*b08de5f7a8 {
	struct FString MapName; // 0x00(0x10)
	struct TArray<struct FSavedObPos> SavedObPos; // 0x10(0x10)
};

// ScriptStruct TslGame.SavedObPos
// Size: 0x18 (Inherited: 0x00)
struct FSavedObPos {
	struct FVector Loc; // 0x00(0x0c)
	struct FRotator Rot; // 0x0c(0x0c)
};

// ScriptStruct TslGame.*cfbd6b5f8b
// Size: 0x58 (Inherited: 0x00)
struct F*cfbd6b5f8b {
	struct TArray<enum class EGameModeType> GameModeTypeList; // 0x00(0x10)
	struct FString WidgetName; // 0x10(0x10)
	bool bRemoveWidget; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct F*fc02106b82 NewWidgetConfig; // 0x28(0x30)
};

// ScriptStruct TslGame.*fc02106b82
// Size: 0x30 (Inherited: 0x00)
struct F*fc02106b82 {
	struct FStringAssetReference WidgetClassReference; // 0x00(0x10)
	bool bDefaultShow; // 0x10(0x01)
	bool bUseMouse; // 0x11(0x01)
	bool bCloseByEscape; // 0x12(0x01)
	bool bRemovedByHiding; // 0x13(0x01)
	int32 ZOrder; // 0x14(0x04)
	bool bUsePcOnly; // 0x18(0x01)
	bool bUseConsoleOnly; // 0x19(0x01)
	bool bCharacterHudUi; // 0x1a(0x01)
	bool bSpectatorHudUi; // 0x1b(0x01)
	bool bObserverHudUi; // 0x1c(0x01)
	bool bReplayHudUi; // 0x1d(0x01)
	bool bLeagueReplayHudUi; // 0x1e(0x01)
	enum class ETslWidgetCreationMethod WidgetCreationMethod; // 0x1f(0x01)
	struct TArray<struct FString> HideWidgetList; // 0x20(0x10)
};

// ScriptStruct TslGame.*23c9627ce8
// Size: 0x20 (Inherited: 0x00)
struct F*23c9627ce8 {
	struct FString WidgetName; // 0x00(0x10)
	struct TArray<struct F*088afd142d> AlternativeWidgets; // 0x10(0x10)
};

// ScriptStruct TslGame.*088afd142d
// Size: 0x30 (Inherited: 0x00)
struct F*088afd142d {
	struct FName GameModeAlias; // 0x00(0x08)
	struct FStringAssetReference Reference; // 0x08(0x10)
	struct TArray<struct FString> HideWidgetList; // 0x18(0x10)
	int32 ZOrderOverride; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*0751dc5caf
// Size: 0x40 (Inherited: 0x00)
struct F*0751dc5caf {
	struct FString WidgetName; // 0x00(0x10)
	struct F*fc02106b82 WidgetConfig; // 0x10(0x30)
};

// ScriptStruct TslGame.*9ced9e7781
// Size: 0x18 (Inherited: 0x00)
struct F*9ced9e7781 {
	struct FString *613794a624; // 0x00(0x10)
	int32 *b4bedec5c3; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.TslUserProfile
// Size: 0x18 (Inherited: 0x00)
struct FTslUserProfile {
	struct FString PlayerNetId; // 0x00(0x10)
	float TotalPlayTime_Sec; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*e0dfae7140
// Size: 0x0c (Inherited: 0x00)
struct F*e0dfae7140 {
	char pad_0[0x8]; // 0x00(0x08)
	int32 Counter; // 0x08(0x04)
};

// ScriptStruct TslGame.*cbfeb8b1c0
// Size: 0x08 (Inherited: 0x00)
struct F*cbfeb8b1c0 {
	enum class EWeatherChange newWeather; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Weight; // 0x04(0x04)
};

// ScriptStruct TslGame.ChineseLicensingDefaultCustomizeData
// Size: 0x18 (Inherited: 0x00)
struct FChineseLicensingDefaultCustomizeData {
	struct FString CustomizableObjectGroupName; // 0x00(0x10)
	struct FName EquipableItemID; // 0x10(0x08)
};

// ScriptStruct TslGame.*e7dc134e91
// Size: 0x14 (Inherited: 0x00)
struct F*e7dc134e91 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 AircraftCount; // 0x04(0x04)
	float AircraftCooldown; // 0x08(0x04)
	int32 InvalidBeforePhase; // 0x0c(0x04)
	int32 InvalidAfterPhase; // 0x10(0x04)
};

// ScriptStruct TslGame.*13e56ddaa2
// Size: 0x24 (Inherited: 0x00)
struct F*13e56ddaa2 {
	int32 BlueZonePhase; // 0x00(0x04)
	float StartDelay; // 0x04(0x04)
	float WarningDuration; // 0x08(0x04)
	float ReleaseDuration; // 0x0c(0x04)
	float BlueZoneDamagePerSecond; // 0x10(0x04)
	float RadiusRate; // 0x14(0x04)
	float SpreadRatio; // 0x18(0x04)
	float LandRatio; // 0x1c(0x04)
	int32 CircleAlgorithm; // 0x20(0x04)
};

// ScriptStruct TslGame.*06cd49bac6
// Size: 0x40 (Inherited: 0x00)
struct F*06cd49bac6 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float PlayerNearBuildingMaxDamage; // 0x04(0x04)
	float PlayerNearBuildingMaxDistance; // 0x08(0x04)
	float StrikeInnerRadius; // 0x0c(0x04)
	float StrikeMidRadius; // 0x10(0x04)
	float StrikeOuterRadius; // 0x14(0x04)
	float StartDelay; // 0x18(0x04)
	float StandbyDelay; // 0x1c(0x04)
	float RequestedStandbyDelay; // 0x20(0x04)
	float BombingDelay; // 0x24(0x04)
	int32 MaxMidCount; // 0x28(0x04)
	int32 MaxFarCount; // 0x2c(0x04)
	int32 MinimumBuildingsToDestroy; // 0x30(0x04)
	struct FVector2D BombingInterval; // 0x34(0x08)
	bool bUseBlackZoneCurves; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct TslGame.*d47c5cdf76
// Size: 0x1c (Inherited: 0x00)
struct F*d47c5cdf76 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float MultiplierRedZoneExplosionDensity; // 0x04(0x04)
	float MultiplierRedZoneStartTime; // 0x08(0x04)
	float MultiplierRedZoneEndTime; // 0x0c(0x04)
	float MultiplierRedZoneExplosionDelay; // 0x10(0x04)
	float MultiplierRedZoneDuration; // 0x14(0x04)
	float MultiplierRedZoneArea; // 0x18(0x04)
};

// ScriptStruct TslGame.MatchLog
// Size: 0x60 (Inherited: 0x00)
struct FMatchLog {
	char pad_0[0x60]; // 0x00(0x60)
};

// ScriptStruct TslGame.*085e78da7e
// Size: 0x08 (Inherited: 0x00)
struct F*085e78da7e {
	float *09e8cded25; // 0x00(0x04)
	float *37aa6d55dd; // 0x04(0x04)
};

// ScriptStruct TslGame.*e142111690
// Size: 0x10 (Inherited: 0x00)
struct F*e142111690 {
	float *09e8cded25; // 0x00(0x04)
	float *37aa6d55dd; // 0x04(0x04)
	float *1ca8f6c1ef; // 0x08(0x04)
	float *4ea7502619; // 0x0c(0x04)
};

// ScriptStruct TslGame.*4fdf4d660a
// Size: 0x18 (Inherited: 0x00)
struct F*4fdf4d660a {
	float *2b5b7d355e; // 0x00(0x04)
	float *840eb6d046; // 0x04(0x04)
	float *19e416bed3; // 0x08(0x04)
	float *6e1d53ae9a; // 0x0c(0x04)
	float *1ca8f6c1ef; // 0x10(0x04)
	float *ed7a77da46; // 0x14(0x04)
};

// ScriptStruct TslGame.*1eb5f64533
// Size: 0x14 (Inherited: 0x00)
struct F*1eb5f64533 {
	bool *5365637b75; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *58bde33c00; // 0x04(0x04)
	float *a0b1105eed; // 0x08(0x04)
	float *cbe6e4ae32; // 0x0c(0x04)
	float *400b38978b; // 0x10(0x04)
};

// ScriptStruct TslGame.*6986f9f173
// Size: 0x0c (Inherited: 0x00)
struct F*6986f9f173 {
	float *de47a4454c; // 0x00(0x04)
	float BpBoost; // 0x04(0x04)
	float *a6338d7685; // 0x08(0x04)
};

// ScriptStruct TslGame.*88da6fa15a
// Size: 0x10 (Inherited: 0x00)
struct F*88da6fa15a {
	float SurvivalTimeStart; // 0x00(0x04)
	float TeamSpectatingTimeStart; // 0x04(0x04)
	float SurvivalTimeAccumulated; // 0x08(0x04)
	float TeamSpectatingTimeAccumulated; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslLobbyCustomizingData
// Size: 0x58 (Inherited: 0x00)
struct FTslLobbyCustomizingData {
	enum class ELobbyCustomizingSlotType LobbyCustomizingSlotType; // 0x00(0x01)
	bool SlotIndex; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct FTslLobbyItemViewData LobbyItemViewData; // 0x08(0x50)
};

// ScriptStruct TslGame.TslLobbyItemViewData
// Size: 0x50 (Inherited: 0x00)
struct FTslLobbyItemViewData {
	struct FString TargetItemId; // 0x00(0x10)
	struct FString SkinItemId; // 0x10(0x10)
	struct TArray<struct FString> PartIds; // 0x20(0x10)
	struct FString SequenceTag; // 0x30(0x10)
	float InitialScale; // 0x40(0x04)
	float ZoomMultiplier; // 0x44(0x04)
	float ViewModeScaleMin; // 0x48(0x04)
	float ViewModeScaleMax; // 0x4c(0x04)
};

// ScriptStruct TslGame.TslLobbyCharacterCreateType
// Size: 0x50 (Inherited: 0x00)
struct FTslLobbyCharacterCreateType {
	uint32 SlotIndex; // 0x00(0x04)
	bool IsGenderMale; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	struct FString NetId; // 0x08(0x10)
	struct FString Nickname; // 0x18(0x10)
	struct FString ClanTag; // 0x28(0x10)
	struct FString ClanplateId; // 0x38(0x10)
	enum class EOutGamePlatformProvider PlatformProvider; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.TslLobbyEmotePlaySetData
// Size: 0x38 (Inherited: 0x00)
struct FTslLobbyEmotePlaySetData {
	struct FName EmoteName; // 0x00(0x08)
	struct FName SectionName; // 0x08(0x08)
	struct FString PlayType; // 0x10(0x10)
	struct FString EmoteLeaderNetId; // 0x20(0x10)
	bool bIsEmoteFollower; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*ff8e8977aa
// Size: 0x58 (Inherited: 0x08)
struct F*ff8e8977aa : FTableRowBase {
	struct TMap<struct FName, struct F*8ae2d96ff3> TargetStateData; // 0x08(0x50)
};

// ScriptStruct TslGame.*8ae2d96ff3
// Size: 0x20 (Inherited: 0x00)
struct F*8ae2d96ff3 {
	struct UAnimationAsset* StateAnimation; // 0x00(0x20)
};

// ScriptStruct TslGame.*bbc5519537
// Size: 0xa8 (Inherited: 0x00)
struct F*bbc5519537 {
	enum class ETslOutGameCloudRequestType *43b3ff28c1; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText *20dc8ab28d; // 0x08(0x18)
	float *db00e6ce53; // 0x20(0x04)
	float *e10ff236a4; // 0x24(0x04)
	struct FText *8de4761132; // 0x28(0x18)
	struct FText *b8f7525441; // 0x40(0x18)
	struct TMap<enum class ETslOutGameCloudRequestErrorType, struct FText> *0c1a737ce9; // 0x58(0x50)
};

// ScriptStruct TslGame.*1ec3dc64a5
// Size: 0x10 (Inherited: 0x00)
struct F*1ec3dc64a5 {
	struct FName *108298dd71; // 0x00(0x08)
	bool bEnable; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct TslGame.*3f3e1ec04c
// Size: 0x20 (Inherited: 0x00)
struct F*3f3e1ec04c {
	struct FString AccountId; // 0x00(0x10)
	struct FString LoadingState; // 0x10(0x10)
};

// ScriptStruct TslGame.*44085ab898
// Size: 0x18 (Inherited: 0x00)
struct F*44085ab898 {
	struct FString AccountId; // 0x00(0x10)
	float *e48b06de16; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.TslReportedInfo
// Size: 0x108 (Inherited: 0x00)
struct FTslReportedInfo {
	struct FString MatchId; // 0x00(0x10)
	struct FTslReportUserInfo UserInfo; // 0x10(0x70)
	struct FTslReporterInfo ReporterInfo; // 0x80(0x48)
	struct FString Cause; // 0xc8(0x10)
	struct TArray<struct FString> DetailCauseList; // 0xd8(0x10)
	struct FString ReportedSessionType; // 0xe8(0x10)
	float MatchElapsedTimeSec; // 0xf8(0x04)
	bool bIsKilledByReportedUser; // 0xfc(0x01)
	bool bIsDBNOedByReportedUser; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	float DamagedAmountByReportedUser; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.TslReporterInfo
// Size: 0x48 (Inherited: 0x00)
struct FTslReporterInfo {
	struct FString AccountId; // 0x00(0x10)
	struct FString PlayerName; // 0x10(0x10)
	int32 TeamId; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FString ClanId; // 0x28(0x10)
	struct FString ClanTag; // 0x38(0x10)
};

// ScriptStruct TslGame.*f1d4414dd3
// Size: 0x50 (Inherited: 0x00)
struct F*f1d4414dd3 {
	struct FString PlayerName; // 0x00(0x10)
	struct FString FullPlayerName; // 0x10(0x10)
	struct FString ClanName; // 0x20(0x10)
	int32 NumKills; // 0x30(0x04)
	int32 NumAssists; // 0x34(0x04)
	int32 Ranking; // 0x38(0x04)
	int32 TeamId; // 0x3c(0x04)
	int32 NumStartTeamMember; // 0x40(0x04)
	float DamageDealtOnEnemy; // 0x44(0x04)
	bool bIsZombie; // 0x48(0x01)
	enum class EOutGamePlatformProvider PlayerPlatform; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct TslGame.*30c64eb670
// Size: 0x18 (Inherited: 0x00)
struct F*30c64eb670 {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*52e366a107
// Size: 0x20 (Inherited: 0x00)
struct F*52e366a107 {
	enum class EReportDetailCauseType ReportDetailCauseType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText Description; // 0x08(0x18)
};

// ScriptStruct TslGame.*c6637f02d7
// Size: 0x10 (Inherited: 0x00)
struct F*c6637f02d7 {
	int32 PlayerCount; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct ATslPlayerStart* PlayerStart; // 0x08(0x08)
};

// ScriptStruct TslGame.*b92419e688
// Size: 0x0c (Inherited: 0x00)
struct F*b92419e688 {
	int32 TeamId; // 0x00(0x04)
	int32 SquadIndex; // 0x04(0x04)
	int32 *734fd4df73; // 0x08(0x04)
};

// ScriptStruct TslGame.*77e2331a31
// Size: 0x30 (Inherited: 0x00)
struct F*77e2331a31 {
	struct ATslPlayerState* Commander; // 0x00(0x08)
	struct F*c89dcd5ffa *c89dcd5ffa; // 0x08(0x10)
	struct ATslPlatoonFireSupportController* *3f23a3708e; // 0x18(0x08)
	struct U*fda52f0abc* *aad6284738; // 0x20(0x08)
	struct U*fda52f0abc* *413b250ba3; // 0x28(0x08)
};

// ScriptStruct TslGame.*5c04536a55
// Size: 0x18 (Inherited: 0x00)
struct F*5c04536a55 {
	int32 TeamNum; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct ATeam*> Members; // 0x08(0x10)
};

// ScriptStruct TslGame.*c4b43ade97
// Size: 0x18 (Inherited: 0x00)
struct F*c4b43ade97 {
	struct AActor* SpottedActor; // 0x00(0x08)
	float SpottedStartTime; // 0x08(0x04)
	float SpottedEndTime; // 0x0c(0x04)
	bool SpottedDuringThisCycle; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct TslGame.*ba792297d2
// Size: 0x14 (Inherited: 0x00)
struct F*ba792297d2 {
	bool *da0ebb67ed; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector *0ee495c3a7; // 0x04(0x0c)
	bool *468577d091; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.WorldMarker
// Size: 0x68 (Inherited: 0x00)
struct FWorldMarker {
	bool Show; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector_NetQuantize100 MarkerPosition; // 0x04(0x0c)
	struct FVector_NetQuantize100 MarkerOffset; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct AActor* TrackedActor; // 0x20(0x08)
	enum class EMarkerType MarkerType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float MarkerCreationTime; // 0x2c(0x04)
	float MarkerLifetime; // 0x30(0x04)
	struct FGuid MarkerID; // 0x34(0x10)
	struct FLinearColor MarkerColor; // 0x44(0x10)
	bool bUseSquadColor; // 0x54(0x01)
	bool bIsPassiveMarker; // 0x55(0x01)
	int8 *0ca9afc22d; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct TArray<int8> *1e59ebca32; // 0x58(0x10)
};

// ScriptStruct TslGame.*d66d66e025
// Size: 0x20 (Inherited: 0x00)
struct F*d66d66e025 {
	struct AActor* SpottedActor; // 0x00(0x08)
	float SpottingTime; // 0x08(0x04)
	struct FGuid MarkerID; // 0x0c(0x10)
	int8 *0ca9afc22d; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct TslGame.*dfa9979b14
// Size: 0x08 (Inherited: 0x00)
struct F*dfa9979b14 {
	float Z; // 0x00(0x04)
	enum class ENearClippingLevel Level; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct TslGame.*29ce5cea98
// Size: 0x08 (Inherited: 0x00)
struct F*29ce5cea98 {
	enum class ENearClippingLevel Level; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Value; // 0x04(0x04)
};

// ScriptStruct TslGame.LevelLoadingBoostParameters
// Size: 0x10 (Inherited: 0x00)
struct FLevelLoadingBoostParameters {
	float AsyncLoadingTimeLimit; // 0x00(0x04)
	float PriorityAsyncLoadingExtraTime; // 0x04(0x04)
	float LevelStreamingActorsUpdateTimeLimit; // 0x08(0x04)
	int32 LevelStreamingComponentsRegistrationGranularity; // 0x0c(0x04)
};

// ScriptStruct TslGame.*59e081f3af
// Size: 0x0c (Inherited: 0x00)
struct F*59e081f3af {
	bool bRandomSpawn; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float RandomSpawnRadius; // 0x04(0x04)
	float *bf22c248b9; // 0x08(0x04)
};

// ScriptStruct TslGame.*25f999310f
// Size: 0x10 (Inherited: 0x00)
struct F*25f999310f {
	int32 *95d35ff8e1; // 0x00(0x04)
	int32 *f0da04f4db; // 0x04(0x04)
	struct ADroppedItem* *c2d1343406; // 0x08(0x08)
};

// ScriptStruct TslGame.*9b437e6913
// Size: 0x10 (Inherited: 0x00)
struct F*9b437e6913 {
	struct FName *1299107cc3; // 0x00(0x08)
	int32 *6e0a2063ac; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*84dd4e8338
// Size: 0x10 (Inherited: 0x00)
struct F*84dd4e8338 {
	enum class EConstraintSlotType ConstraintSlotType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct F*fe6da746f6 EquipPosition; // 0x04(0x08)
	enum class EEquipableItemSoundType OverrideSoundType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*fe6da746f6
// Size: 0x08 (Inherited: 0x00)
struct F*fe6da746f6 {
	enum class EEquipSlotID SlotID; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 Index; // 0x04(0x04)
};

// ScriptStruct TslGame.*bd7a41970f
// Size: 0x48 (Inherited: 0x00)
struct F*bd7a41970f {
	struct FRotator *524ec8fc28; // 0x00(0x0c)
	struct FVector Location; // 0x0c(0x0c)
	struct FVector Direction; // 0x18(0x0c)
	char pad_24[0x4]; // 0x24(0x04)
	struct U*901c357d94* ThrowableConfig; // 0x28(0x08)
	int32 *96be039582; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct ATslCharacter* *c3d6df06fc; // 0x38(0x08)
	struct UPrimitiveComponent* *22f2d853f1; // 0x40(0x08)
};

// ScriptStruct TslGame.*7990b527cd
// Size: 0x190 (Inherited: 0x00)
struct F*7990b527cd {
	struct TMap<struct UClass*, struct F*1c94054c95> SlotOffset_Primary_PerWeapon; // 0x00(0x50)
	struct TMap<struct UClass*, struct F*1c94054c95> SlotOffset_Secondary_PerWeapon; // 0x50(0x50)
	struct TMap<struct UClass*, struct F*1c94054c95> SlotOffset_SideArm_PerWeapon; // 0xa0(0x50)
	struct TMap<struct UClass*, struct F*1c94054c95> SlotOffset_Melee_PerWeapon; // 0xf0(0x50)
	struct TMap<struct UClass*, struct F*1c94054c95> SlotOffset_Thrown_PerWeapon; // 0x140(0x50)
};

// ScriptStruct TslGame.*1c94054c95
// Size: 0x18 (Inherited: 0x00)
struct F*1c94054c95 {
	struct FVector Location; // 0x00(0x0c)
	struct FRotator Rotation; // 0x0c(0x0c)
};

// ScriptStruct TslGame.*daacb20549
// Size: 0x78 (Inherited: 0x00)
struct F*daacb20549 {
	struct FVector SlotOffset_Primary_Location; // 0x00(0x0c)
	struct FVector SlotOffset_Secondary_Location; // 0x0c(0x0c)
	struct FVector SlotOffset_SideArm_Location; // 0x18(0x0c)
	struct FVector SlotOffset_Melee_Location; // 0x24(0x0c)
	struct FVector SlotOffset_Thrown_Location; // 0x30(0x0c)
	struct FRotator SlotOffset_Primary_Rotation; // 0x3c(0x0c)
	struct FRotator SlotOffset_Secondary_Rotation; // 0x48(0x0c)
	struct FRotator SlotOffset_SideArm_Rotation; // 0x54(0x0c)
	struct FRotator SlotOffset_Melee_Rotation; // 0x60(0x0c)
	struct FRotator SlotOffset_Thrown_Rotation; // 0x6c(0x0c)
};

// ScriptStruct TslGame.*35528c18c3
// Size: 0x08 (Inherited: 0x08)
struct F*35528c18c3 : FTableRowBase {
};

// ScriptStruct TslGame.*a87e164854
// Size: 0xd8 (Inherited: 0x00)
struct F*a87e164854 {
	enum class ECastAnim CastAnim; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float CastAnimPlayRate; // 0x04(0x04)
	struct F*8121b8b50e CustomCastAnim; // 0x08(0xc0)
	float CustomCastTimeRemaining; // 0xc8(0x04)
	bool IsPermanentCasting; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
	float CastBlendingTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct TslGame.*44a850d86c
// Size: 0xb8 (Inherited: 0xb0)
struct F*44a850d86c : F*64f328df7d {
	bool *0fdced5e4e; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
};

// ScriptStruct TslGame.*8d696dc74e
// Size: 0x08 (Inherited: 0x00)
struct F*8d696dc74e {
	float *a481c3bd70; // 0x00(0x04)
	enum class EDamageVictimActorType *81c1a5c99d; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct TslGame.*7ef65296a0
// Size: 0x140 (Inherited: 0x00)
struct F*7ef65296a0 {
	struct UClass* Explosion; // 0x00(0x08)
	float DamagedPercentMax; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UClass* Damaged; // 0x10(0x08)
	struct UClass* Destroyed; // 0x18(0x08)
	struct UAkAudioEvent* EngineSound; // 0x20(0x08)
	struct UAkAudioEvent* EngineSound_Remote; // 0x28(0x08)
	struct UAkAudioEvent* EngineSound_Stop; // 0x30(0x08)
	struct UAkAudioEvent* DelayedExplosion; // 0x38(0x08)
	struct UClass* Muffler; // 0x40(0x08)
	struct UClass* Muffler2; // 0x48(0x08)
	struct UClass* Muffler3; // 0x50(0x08)
	struct UClass* Muffler4; // 0x58(0x08)
	struct UClass* Boost; // 0x60(0x08)
	struct UClass* Boost2; // 0x68(0x08)
	struct UClass* Boost3; // 0x70(0x08)
	struct UClass* Boost4; // 0x78(0x08)
	struct UClass* FrontTrail; // 0x80(0x08)
	struct UClass* RearTrail; // 0x88(0x08)
	struct UClass* Thruster; // 0x90(0x08)
	struct UClass* Thruster2; // 0x98(0x08)
	struct UClass* FrontFoamLeft; // 0xa0(0x08)
	struct UClass* FrontFoamRight; // 0xa8(0x08)
	struct UClass* SpashEffectOverride; // 0xb0(0x08)
	struct UStaticMesh* Rotor; // 0xb8(0x08)
	struct UStaticMesh* RotorDamaged; // 0xc0(0x08)
	struct UClass* ExhaustPopEffect; // 0xc8(0x08)
	struct FFloatRange ImpactNormalForceRange; // 0xd0(0x10)
	struct UClass* ImpactDefault; // 0xe0(0x08)
	int32 MaxImpactCount; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct TMap<enum class EPhysicalSurface, struct UClass*> ImpactEffectMap; // 0xf0(0x50)
};

// ScriptStruct TslGame.*c64689471d
// Size: 0x10 (Inherited: 0x00)
struct F*c64689471d {
	struct UAkAudioEvent* *3629726bc8; // 0x00(0x08)
	struct UAkAudioEvent* *c0105086c5; // 0x08(0x08)
};

// ScriptStruct TslGame.*52983961ec
// Size: 0x10 (Inherited: 0x08)
struct F*52983961ec : FTableRowBase {
	struct FName *1299107cc3; // 0x08(0x08)
};

// ScriptStruct TslGame.*b821d1a101
// Size: 0x70 (Inherited: 0x00)
struct F*b821d1a101 {
	struct ATslPlayerState* *07c464f74f; // 0x00(0x08)
	struct UClass* *47bf7d1814; // 0x08(0x08)
	struct F*1f0042b8e9 *1f0042b8e9; // 0x10(0x20)
	struct FDateTime *e12e238d9c; // 0x30(0x08)
	enum class EDamageReason *c2874f8b34; // 0x38(0x01)
	enum class EDamageTypeCategory *1fe975f39e; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct FName *3dfa4bbe8b; // 0x40(0x08)
	struct TArray<struct FString> *d185b6c910; // 0x48(0x10)
	float Distance; // 0x58(0x04)
	bool *28c09ebdd9; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct TArray<struct ATslPlayerState*> *52500adcbe; // 0x60(0x10)
};

// ScriptStruct TslGame.*1f0042b8e9
// Size: 0x20 (Inherited: 0x00)
struct F*1f0042b8e9 {
	struct FName *1299107cc3; // 0x00(0x08)
	struct F*5226c02a35 SkinParam; // 0x08(0x10)
	int32 *6e0a2063ac; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*3d16159571
// Size: 0x120 (Inherited: 0xf8)
struct F*3d16159571 : F*383418f57b {
	struct FStringClassReference ReplaceVehicle; // 0xf8(0x10)
	enum class EVehicleSkinCategory VehicleSkinCategory; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct TArray<struct F*f56810ecc9> DefaultPartSkinList; // 0x110(0x10)
};

// ScriptStruct TslGame.*383418f57b
// Size: 0xf8 (Inherited: 0x08)
struct F*383418f57b : FTableRowBase {
	struct TMap<struct FName, struct F*b8b155ac41> SkinnedMeshSet; // 0x08(0x50)
	struct TMap<struct FName, struct F*b2adf3900b> SkinnedMaterialSet; // 0x58(0x50)
	struct TArray<struct FName> SkinnableTagList; // 0xa8(0x10)
	struct FRotator DefaultViewModeRotation; // 0xb8(0x0c)
	struct FRotator PivotModifierRotation; // 0xc4(0x0c)
	struct FVector PCViewModeLocation; // 0xd0(0x0c)
	struct FVector ConsoleViewModeLocation; // 0xdc(0x0c)
	struct FVector RecommendArrowOffset; // 0xe8(0x0c)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.*b8b155ac41
// Size: 0x28 (Inherited: 0x00)
struct F*b8b155ac41 {
	enum class ESkinMeshType MeshType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UObject* MeshAsset; // 0x08(0x20)
};

// ScriptStruct TslGame.*f56810ecc9
// Size: 0x10 (Inherited: 0x00)
struct F*f56810ecc9 {
	enum class EVehiclePartType *81916e9634; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName *d0b6fbf96d; // 0x08(0x08)
};

// ScriptStruct TslGame.*6b8e6bc55b
// Size: 0x178 (Inherited: 0x178)
struct F*6b8e6bc55b : F*677e226c74 {
};

// ScriptStruct TslGame.*677e226c74
// Size: 0x178 (Inherited: 0xf8)
struct F*677e226c74 : F*383418f57b {
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForMale; // 0xf8(0x30)
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForFemale; // 0x128(0x30)
	struct F*54424d3e0d CustomizableObjectSkin; // 0x158(0x20)
};

// ScriptStruct TslGame.*58e023919d
// Size: 0x178 (Inherited: 0x178)
struct F*58e023919d : F*677e226c74 {
};

// ScriptStruct TslGame.*b4c4afe334
// Size: 0x178 (Inherited: 0x178)
struct F*b4c4afe334 : F*677e226c74 {
};

// ScriptStruct TslGame.*d8fef44391
// Size: 0x178 (Inherited: 0x178)
struct F*d8fef44391 : F*677e226c74 {
};

// ScriptStruct TslGame.*96e649525c
// Size: 0x170 (Inherited: 0x170)
struct F*96e649525c : F*dd76bd48ca {
};

// ScriptStruct TslGame.*dd76bd48ca
// Size: 0x170 (Inherited: 0xf8)
struct F*dd76bd48ca : F*383418f57b {
	char bStatTrak : 1; // 0xf8(0x01)
	char pad_F8_1 : 7; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
	struct FStringAssetReference StatTrakActorClass; // 0x100(0x10)
	struct UAnimMontage* *a318647c7c; // 0x110(0x08)
	struct FName *3bf6c2da27; // 0x118(0x08)
	struct TMap<struct FName, struct FLinearColor> SkinnedColorSet; // 0x120(0x50)
};

// ScriptStruct TslGame.*102678c5db
// Size: 0x148 (Inherited: 0x08)
struct F*102678c5db : FTableRowBase {
	struct UTexture2D* *fdb8fae188; // 0x08(0x20)
	struct UTexture2D* *cbb24f5446; // 0x28(0x20)
	struct UTexture2D* *e561ef6b51; // 0x48(0x20)
	struct UTexture2D* *7711a8956c; // 0x68(0x20)
	struct FName *b7d90219b9; // 0x88(0x08)
	struct FSlateColor *b3b626eadb; // 0x90(0x28)
	struct FSlateColor *ab1701ab94; // 0xb8(0x28)
	struct UMaterial* *c72af75a21; // 0xe0(0x20)
	struct UTexture2D* *ea103b5ffb; // 0x100(0x20)
	struct UTexture2D* *deeabab056; // 0x120(0x20)
	int32 *30ce5dc434; // 0x140(0x04)
	int32 *9ce0dcf347; // 0x144(0x04)
};

// ScriptStruct TslGame.*10c58d053e
// Size: 0x170 (Inherited: 0x170)
struct F*10c58d053e : F*dd76bd48ca {
};

// ScriptStruct TslGame.*60e92f5235
// Size: 0x08 (Inherited: 0x00)
struct F*60e92f5235 {
	struct USkeletalMesh* SkeletalMesh; // 0x00(0x08)
};

// ScriptStruct TslGame.*9adca58dcb
// Size: 0x10 (Inherited: 0x00)
struct F*9adca58dcb {
	struct FName TargetName; // 0x00(0x08)
	struct UMeshComponent* TargetMesh; // 0x08(0x08)
};

// ScriptStruct TslGame.WuLogPlayerCureDebuff
// Size: 0x190 (Inherited: 0x60)
struct FWuLogPlayerCureDebuff : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogCharacter TargetCharacter; // 0xf0(0x90)
	struct FString DebuffName; // 0x180(0x10)
};

// ScriptStruct TslGame.WuLogCharacter
// Size: 0x90 (Inherited: 0x00)
struct FWuLogCharacter {
	struct FString Name; // 0x00(0x10)
	struct FString NetId; // 0x10(0x10)
	int32 TeamId; // 0x20(0x04)
	float Health; // 0x24(0x04)
	struct FVector Location; // 0x28(0x0c)
	int32 Ranking; // 0x34(0x04)
	int32 IndividualRanking; // 0x38(0x04)
	int32 Platform; // 0x3c(0x04)
	struct FString AccountId; // 0x40(0x10)
	bool IsInBlueZone; // 0x50(0x01)
	bool IsInRedZone; // 0x51(0x01)
	char pad_52[0x6]; // 0x52(0x06)
	struct TArray<struct FString> Zone; // 0x58(0x10)
	struct FString MovementBase; // 0x68(0x10)
	bool IsAI; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FString ParticipatedState; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogPlayerHungryStage
// Size: 0x108 (Inherited: 0x60)
struct FWuLogPlayerHungryStage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 PreviousStage; // 0xf0(0x04)
	int32 CurrentStage; // 0xf4(0x04)
	struct FString DebuffName; // 0xf8(0x10)
};

// ScriptStruct TslGame.WuLogSLBItemTransmit
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSLBItemTransmit : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FWuLogItem> TransmitedItem; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogItem
// Size: 0x50 (Inherited: 0x00)
struct FWuLogItem {
	struct FString ItemID; // 0x00(0x10)
	int32 StackCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString Category; // 0x18(0x10)
	struct FString SubCategory; // 0x28(0x10)
	struct TArray<struct FString> AttachedItems; // 0x38(0x10)
	bool HasRandomAttachments; // 0x48(0x01)
	bool IsUnique; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct TslGame.WuLogSLBItemReward
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSLBItemReward : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FWuLogItem> Item; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogSLBClearResult
// Size: 0x90 (Inherited: 0x60)
struct FWuLogSLBClearResult : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 Stage; // 0x70(0x04)
	bool Clear; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FString Reason; // 0x78(0x10)
	int32 PlayTime; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// ScriptStruct TslGame.WuLogSLBStartStage
// Size: 0x68 (Inherited: 0x60)
struct FWuLogSLBStartStage : FLogBase {
	int32 Stage; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// ScriptStruct TslGame.WuLogAliveCharacterNum
// Size: 0x90 (Inherited: 0x60)
struct FWuLogAliveCharacterNum : FLogBase {
	int32 AliveAINum; // 0x60(0x04)
	int32 AliveAITeamNum; // 0x64(0x04)
	int32 AlivePlayerNum; // 0x68(0x04)
	int32 AlivePlayerTeamNum; // 0x6c(0x04)
	struct TArray<struct FString> VictimCharacterAccountId; // 0x70(0x10)
	struct TArray<struct FString> ReviveOrRespawnCharacterAccountId; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogBombPlayerDefuse
// Size: 0x108 (Inherited: 0x60)
struct FWuLogBombPlayerDefuse : FLogBase {
	struct FWuLogBombMissionInfo Info; // 0x60(0xa8)
};

// ScriptStruct TslGame.WuLogBombMissionInfo
// Size: 0xa8 (Inherited: 0x00)
struct FWuLogBombMissionInfo {
	struct FWuLogCharacter Character; // 0x00(0x90)
	struct FString Action; // 0x90(0x10)
	int32 CurrentRound; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerPlant
// Size: 0x108 (Inherited: 0x60)
struct FWuLogBombPlayerPlant : FLogBase {
	struct FWuLogBombMissionInfo Info; // 0x60(0xa8)
};

// ScriptStruct TslGame.WuLogBombMoneyDonation
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogBombMoneyDonation : FLogBase {
	struct FWuLogBombPlayerCoinInfo Giver; // 0x60(0x28)
	struct FWuLogBombPlayerCoinInfo Taker; // 0x88(0x28)
	int32 Amount; // 0xb0(0x04)
	int32 CurrentRound; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerCoinInfo
// Size: 0x28 (Inherited: 0x00)
struct FWuLogBombPlayerCoinInfo {
	struct FString CharacterName; // 0x00(0x10)
	struct FString AccountId; // 0x10(0x10)
	int32 PresentCurrency; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.WuLogBombItemBuy
// Size: 0x150 (Inherited: 0x60)
struct FWuLogBombItemBuy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 PresentCurrency; // 0xf0(0x04)
	int32 Cost; // 0xf4(0x04)
	int32 CurrentRound; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FWuLogItem Item; // 0x100(0x50)
};

// ScriptStruct TslGame.WuLogBombMatchResult
// Size: 0x98 (Inherited: 0x60)
struct FWuLogBombMatchResult : FLogBase {
	struct FWuLogBombMatchResultTeamInfo VictoryTeam; // 0x60(0x14)
	struct FWuLogBombMatchResultTeamInfo DefeatTeam; // 0x74(0x14)
	struct FString FinishCause; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogBombMatchResultTeamInfo
// Size: 0x14 (Inherited: 0x00)
struct FWuLogBombMatchResultTeamInfo {
	int32 TeamId; // 0x00(0x04)
	int32 TotalKills; // 0x04(0x04)
	int32 TotalAssists; // 0x08(0x04)
	int32 TotalPlantCount; // 0x0c(0x04)
	int32 TotalDefuseCount; // 0x10(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerIncome
// Size: 0x110 (Inherited: 0x60)
struct FWuLogBombPlayerIncome : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 Amount; // 0xf0(0x04)
	int32 CurrentRound; // 0xf4(0x04)
	struct FWuBombRoundSummary RoundSummary; // 0xf8(0x14)
	char pad_10C[0x4]; // 0x10c(0x04)
};

// ScriptStruct TslGame.WuBombRoundSummary
// Size: 0x14 (Inherited: 0x00)
struct FWuBombRoundSummary {
	int32 KillCount; // 0x00(0x04)
	int32 AssistCount; // 0x04(0x04)
	bool PlantOrDefuse; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 DefeatStreak; // 0x0c(0x04)
	bool DeciveRound; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.WuLogBombRoundFinished
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogBombRoundFinished : FLogBase {
	struct FWuLogBombRoundFinishTeamInfo VictoryTeam; // 0x60(0x20)
	struct FWuLogBombRoundFinishTeamInfo DefeatTeam; // 0x80(0x20)
	struct FString FinishCause; // 0xa0(0x10)
	int32 CurrentRound; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogBombRoundFinishTeamInfo
// Size: 0x20 (Inherited: 0x00)
struct FWuLogBombRoundFinishTeamInfo {
	int32 TeamId; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString TeamType; // 0x08(0x10)
	int32 AlivePlayerCount; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.WuLogTireReplaced
// Size: 0x1a0 (Inherited: 0x60)
struct FWuLogTireReplaced : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle ParentVehicle; // 0xf0(0x58)
	struct FWuLogItem Item; // 0x148(0x50)
	float Durability; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
};

// ScriptStruct TslGame.WuLogVehicle
// Size: 0x58 (Inherited: 0x00)
struct FWuLogVehicle {
	struct FString VehicleType; // 0x00(0x10)
	struct FString SpawnId; // 0x10(0x10)
	struct FString VehicleId; // 0x20(0x10)
	int32 VehicleUniqueId; // 0x30(0x04)
	int32 SeatIndex; // 0x34(0x04)
	float HealthPercent; // 0x38(0x04)
	float FeulPercent; // 0x3c(0x04)
	float RotationPitch; // 0x40(0x04)
	float AltitudeAbs; // 0x44(0x04)
	float AltitudeRel; // 0x48(0x04)
	float Velocity; // 0x4c(0x04)
	bool IsWheelsInAir; // 0x50(0x01)
	bool IsInWaterVolume; // 0x51(0x01)
	bool IsEngineOn; // 0x52(0x01)
	char pad_53[0x5]; // 0x53(0x05)
};

// ScriptStruct TslGame.WuLogTirePulledOut
// Size: 0x1a0 (Inherited: 0x60)
struct FWuLogTirePulledOut : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle ParentVehicle; // 0xf0(0x58)
	struct FWuLogItem Item; // 0x148(0x50)
	float Durability; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
};

// ScriptStruct TslGame.WuLogSoftRoleRepairkitUse
// Size: 0x288 (Inherited: 0x60)
struct FWuLogSoftRoleRepairkitUse : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	struct FWuLogItem RepairedItem; // 0x140(0x50)
	struct FWuLogVehicle RepairedVehicle; // 0x190(0x58)
	struct FWuLogCharacter TargetCharacter; // 0x1e8(0x90)
	float PreviousRepairedStatus; // 0x278(0x04)
	float RepairedStatus; // 0x27c(0x04)
	int32 Remainedcount; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
};

// ScriptStruct TslGame.WuLogRevivalAircraft
// Size: 0x78 (Inherited: 0x60)
struct FWuLogRevivalAircraft : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FString> ReviveAccounts; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogSuccessRegisterBluechip
// Size: 0x90 (Inherited: 0x60)
struct FWuLogSuccessRegisterBluechip : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString RegisteredByAccountId; // 0x70(0x10)
	struct FString RegisteringMethod; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogTryRegisterBluechip
// Size: 0x90 (Inherited: 0x60)
struct FWuLogTryRegisterBluechip : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString RegisteredByAccountId; // 0x70(0x10)
	struct FString RegisteringMethod; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogBluechipLooted
// Size: 0x80 (Inherited: 0x60)
struct FWuLogBluechipLooted : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString LootingUserAccountId; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogBluechipRemove
// Size: 0x70 (Inherited: 0x60)
struct FWuLogBluechipRemove : FLogBase {
	struct FString AccountId; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogBluechipCreate
// Size: 0x78 (Inherited: 0x60)
struct FWuLogBluechipCreate : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 phase; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRejectReconnect
// Size: 0x70 (Inherited: 0x60)
struct FWuLogPlayerRejectReconnect : FLogBase {
	struct FString AccountId; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogPlayerDisconnected
// Size: 0x128 (Inherited: 0x60)
struct FWuLogPlayerDisconnected : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	struct FString Reason; // 0x110(0x10)
	bool IsRewardConfirmed; // 0x120(0x01)
	bool IsPenaltyWaived; // 0x121(0x01)
	bool ExitToDesktop; // 0x122(0x01)
	bool WasKicked; // 0x123(0x01)
	char pad_124[0x4]; // 0x124(0x04)
};

// ScriptStruct TslGame.WuGameResultPerPlayer
// Size: 0xb0 (Inherited: 0x00)
struct FWuGameResultPerPlayer {
	struct FString PlayerNetId; // 0x00(0x10)
	int32 Rank; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString GameResult; // 0x18(0x10)
	int32 TeamId; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FWuGameResultStatsPerPlayer Stats; // 0x30(0x68)
	bool IsBpGrinder; // 0x98(0x01)
	bool IsXpGrinder; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
	struct FString AccountId; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuGameResultStatsPerPlayer
// Size: 0x68 (Inherited: 0x00)
struct FWuGameResultStatsPerPlayer {
	int32 KillCount; // 0x00(0x04)
	float Score; // 0x04(0x04)
	float Xp; // 0x08(0x04)
	float DistanceOnFoot; // 0x0c(0x04)
	float DistanceOnSwim; // 0x10(0x04)
	float DistanceOnVehicle; // 0x14(0x04)
	float DistanceOnParachute; // 0x18(0x04)
	float DistanceOnFreefall; // 0x1c(0x04)
	struct FWuLogPlayTimeRecord PlayTime; // 0x20(0x08)
	struct FWuBpRewardDetail BpRewardDetail; // 0x28(0x18)
	struct FWuArcadeRewardDetail ArcadeRewardDetail; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct FWuStatTrakData> StatTrakDataPairs; // 0x48(0x10)
	struct TArray<struct FWuStatTrakData> HeadshotStatTrakDataPairs; // 0x58(0x10)
};

// ScriptStruct TslGame.WuStatTrakData
// Size: 0x18 (Inherited: 0x00)
struct FWuStatTrakData {
	struct FString GameItemId; // 0x00(0x10)
	int32 Value; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuArcadeRewardDetail
// Size: 0x04 (Inherited: 0x00)
struct FWuArcadeRewardDetail {
	int32 ByPlayTime; // 0x00(0x04)
};

// ScriptStruct TslGame.WuBpRewardDetail
// Size: 0x18 (Inherited: 0x00)
struct FWuBpRewardDetail {
	float ByPlayTime; // 0x00(0x04)
	float ByRanking; // 0x04(0x04)
	float ByKills; // 0x08(0x04)
	float ByDamageDealt; // 0x0c(0x04)
	float BoostAmount; // 0x10(0x04)
	float ByModeScore; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogPlayTimeRecord
// Size: 0x08 (Inherited: 0x00)
struct FWuLogPlayTimeRecord {
	int32 SurvivalTime; // 0x00(0x04)
	int32 TeamSpectatingTime; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogPlayerDisconnectedByQuit
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerDisconnectedByQuit : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	bool IsPenaltyWaived; // 0x110(0x01)
	bool ExitToDesktop; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)
};

// ScriptStruct TslGame.WuLogPlayerDisconnectedByTimeout
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerDisconnectedByTimeout : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	bool IsPenaltyWaived; // 0x110(0x01)
	bool ExitToDesktop; // 0x111(0x01)
	bool WasKicked; // 0x112(0x01)
	char pad_113[0x5]; // 0x113(0x05)
};

// ScriptStruct TslGame.WuLogPlayerConnected
// Size: 0x88 (Inherited: 0x60)
struct FWuLogPlayerConnected : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	bool IsReconnect; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FString Reason; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogCrowbarInteraction
// Size: 0x100 (Inherited: 0x60)
struct FWuLogCrowbarInteraction : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString TargetName; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogUsePresetSlotIngame
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogUsePresetSlotIngame : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 SlotIndex; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLog1vs1ArenaMatching
// Size: 0xd8 (Inherited: 0x60)
struct FWuLog1vs1ArenaMatching : FLogBase {
	struct FString SearchStartTime; // 0x60(0x10)
	struct FWuLog1vs1ArenaTimeRecord MatchingTimeRecord; // 0x70(0x20)
	struct TArray<struct FString> SavedItems; // 0x90(0x10)
	struct TArray<int32> Results; // 0xa0(0x10)
	int32 RoundCount; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct FString AccountId; // 0xb8(0x10)
	struct FString NetId; // 0xc8(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaTimeRecord
// Size: 0x20 (Inherited: 0x00)
struct FWuLog1vs1ArenaTimeRecord {
	struct FString StartTime; // 0x00(0x10)
	struct FString EndTime; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaMatchingSearch
// Size: 0xa0 (Inherited: 0x60)
struct FWuLog1vs1ArenaMatchingSearch : FLogBase {
	struct FWuLog1vs1ArenaTimeRecord TimeRecord; // 0x60(0x20)
	struct FString AccountId; // 0x80(0x10)
	struct FString NetId; // 0x90(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaOberserver
// Size: 0x90 (Inherited: 0x60)
struct FWuLog1vs1ArenaOberserver : FLogBase {
	struct TArray<struct FWuLog1vs1ArenaTimeRecord> TimeRecords; // 0x60(0x10)
	struct FString AccountId; // 0x70(0x10)
	struct FString NetId; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogMinimapTeleport
// Size: 0x80 (Inherited: 0x60)
struct FWuLogMinimapTeleport : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct TArray<struct FWuLogMinimapTeleportData> TeleportDatas; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogMinimapTeleportData
// Size: 0x18 (Inherited: 0x00)
struct FWuLogMinimapTeleportData {
	int32 TeleportType; // 0x00(0x04)
	int32 PracticeType; // 0x04(0x04)
	struct FString DestinationActorName; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLogAbilitySummer
// Size: 0x100 (Inherited: 0x60)
struct FWuLogAbilitySummer : FLogBase {
	struct FWuLogCharacter Owner; // 0x60(0x90)
	struct TArray<struct FWuLogAbilityData> AbilityDataArr; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogAbilityData
// Size: 0x20 (Inherited: 0x00)
struct FWuLogAbilityData {
	struct FString AbilityID; // 0x00(0x10)
	int32 TotalActivate; // 0x10(0x04)
	int32 TotalSuccess; // 0x14(0x04)
	int32 TotalCancel; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.WuLogAbilityActivate
// Size: 0x120 (Inherited: 0x60)
struct FWuLogAbilityActivate : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Owner; // 0x68(0x90)
	struct FWuLogAbility Ability; // 0xf8(0x20)
	int32 Index; // 0x118(0x04)
	bool IsSuccess; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
};

// ScriptStruct TslGame.WuLogAbility
// Size: 0x20 (Inherited: 0x00)
struct FWuLogAbility {
	struct FString AbilityID; // 0x00(0x10)
	struct TArray<struct FString> Attributes; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLogItemPickupFromChickenBox
// Size: 0x148 (Inherited: 0x60)
struct FWuLogItemPickupFromChickenBox : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	int32 ChickenBoxId; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
};

// ScriptStruct TslGame.WuLogZDF2StageData
// Size: 0x98 (Inherited: 0x60)
struct FWuLogZDF2StageData : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString Timestamp; // 0x70(0x10)
	int32 StageNumber; // 0x80(0x04)
	bool IsCraftingTime; // 0x84(0x01)
	bool IsStart; // 0x85(0x01)
	bool IsLastStage; // 0x86(0x01)
	char pad_87[0x1]; // 0x87(0x01)
	struct TArray<struct FWuLogZDF2PlayerData> PlayersData; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogZDF2PlayerData
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogZDF2PlayerData : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 HoldingCoinNum; // 0xf0(0x04)
	int32 EarnedCoinNum; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogRacingModeCoursePlayData
// Size: 0x98 (Inherited: 0x60)
struct FWuLogRacingModeCoursePlayData : FLogBase {
	int32 CourseNum; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString AccountId; // 0x68(0x10)
	int32 FinalRanking; // 0x78(0x04)
	int32 DeathCount; // 0x7c(0x04)
	int32 KillCount; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct TArray<struct FWuLogRacingModeCheckPointPlayData> CheckPoinPlayDatas; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogRacingModeCheckPointPlayData
// Size: 0x80 (Inherited: 0x60)
struct FWuLogRacingModeCheckPointPlayData : FLogBase {
	int32 PassedCheckPointNum; // 0x60(0x04)
	float CheckPointPassedTime; // 0x64(0x04)
	int32 IndividualRanking; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FString Passed_Vehicle; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogSandboxItemUsageCount
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSandboxItemUsageCount : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FWuLogSandboxItemDataUsage> ItemsPerCategory; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogSandboxItemDataUsage
// Size: 0x20 (Inherited: 0x00)
struct FWuLogSandboxItemDataUsage {
	struct FString ItemCategory; // 0x00(0x10)
	struct TArray<struct FWuStringIntPair> Items; // 0x10(0x10)
};

// ScriptStruct TslGame.WuStringIntPair
// Size: 0x18 (Inherited: 0x00)
struct FWuStringIntPair {
	struct FString First; // 0x00(0x10)
	int32 second; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogRadioMessage
// Size: 0x100 (Inherited: 0x60)
struct FWuLogRadioMessage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString MessageCategory; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogAtoZTutorialAllMissionClear
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogAtoZTutorialAllMissionClear : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogItemTypeOverrideZone
// Size: 0x78 (Inherited: 0x60)
struct FWuLogItemTypeOverrideZone : FLogBase {
	int32 ItemTypeOverrideZone; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FWuLogItemTypeOverrideZoneData> ItemTypeOverrideZoneDatas; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogItemTypeOverrideZoneData
// Size: 0x80 (Inherited: 0x60)
struct FWuLogItemTypeOverrideZoneData : FLogBase {
	struct FString OverrideType; // 0x60(0x10)
	struct FVector ItemTypeOverrideZonePosition; // 0x70(0x0c)
	float ItemTypeOverrideZoneRadius; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRedeploy
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogPlayerRedeploy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 phase; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRedeployBRStart
// Size: 0x78 (Inherited: 0x60)
struct FWuLogPlayerRedeployBRStart : FLogBase {
	struct TArray<struct FWuLogCharacter> Characters; // 0x60(0x10)
	int32 phase; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogUsedBlueBlockerAndReturnedToSafeZone
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogUsedBlueBlockerAndReturnedToSafeZone : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 NumTimesUsedBlueBlockerAndReturnedToSafeZone; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogBlueBlockerAbsorbBlueZoneDamage
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogBlueBlockerAbsorbBlueZoneDamage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	float DamageAbsorbed; // 0xf0(0x04)
	int32 NumTimesBlueZoneAbsorbed; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogVoiceChatUseage
// Size: 0x90 (Inherited: 0x60)
struct FWuLogVoiceChatUseage : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct TArray<struct FWuStringFloatPair> Option; // 0x70(0x10)
	float PushTime; // 0x80(0x04)
	float TimeSpent; // 0x84(0x04)
	int32 PlatformProvider; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// ScriptStruct TslGame.WuStringFloatPair
// Size: 0x18 (Inherited: 0x00)
struct FWuStringFloatPair {
	struct FString First; // 0x00(0x10)
	float second; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuEventDamage
// Size: 0x68 (Inherited: 0x10)
struct FWuEventDamage : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	bool IsVictimMe; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	float Damage; // 0x14(0x04)
	struct FString DamageTypeCategory; // 0x18(0x10)
	struct FString AttackerName; // 0x28(0x10)
	struct FVector AttackerLocation; // 0x38(0x0c)
	int32 AttackerTeamId; // 0x44(0x04)
	struct FString VictimName; // 0x48(0x10)
	struct FVector VictimLocation; // 0x58(0x0c)
	int32 VictimTeamId; // 0x64(0x04)
};

// ScriptStruct TslGame.WuEventKill
// Size: 0x88 (Inherited: 0x10)
struct FWuEventKill : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	bool IsKillerMe; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	struct FString KillerName; // 0x18(0x10)
	struct FVector KillerLocation; // 0x28(0x0c)
	int32 KillerTeamId; // 0x34(0x04)
	bool IsVictimMe; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString VictimName; // 0x40(0x10)
	struct FVector VictimLocation; // 0x50(0x0c)
	int32 VictimTeamId; // 0x5c(0x04)
	struct FString DamageCauser; // 0x60(0x10)
	struct FString DamageReason; // 0x70(0x10)
	bool IsGroggy; // 0x80(0x01)
	bool IsStealKilled; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
};

// ScriptStruct TslGame.WuEventMatchResult
// Size: 0x38 (Inherited: 0x10)
struct FWuEventMatchResult : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	int32 StartPlayerCount; // 0x20(0x04)
	int32 StartTeamCount; // 0x24(0x04)
	struct TArray<struct FWuEventDataTeamResult> Teams; // 0x28(0x10)
};

// ScriptStruct TslGame.WuEventDataTeamResult
// Size: 0x18 (Inherited: 0x00)
struct FWuEventDataTeamResult {
	int32 TeamId; // 0x00(0x04)
	int32 Ranking; // 0x04(0x04)
	struct TArray<struct FWuEventDataPlayerResult> Members; // 0x08(0x10)
};

// ScriptStruct TslGame.WuEventDataPlayerResult
// Size: 0x18 (Inherited: 0x00)
struct FWuEventDataPlayerResult {
	struct FString PlayerName; // 0x00(0x10)
	int32 KillCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuEventPlayerMatchResult
// Size: 0x48 (Inherited: 0x10)
struct FWuEventPlayerMatchResult : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	int32 StartPlayerCount; // 0x20(0x04)
	int32 StartTeamCount; // 0x24(0x04)
	struct FString PlayerName; // 0x28(0x10)
	int32 Ranking; // 0x38(0x04)
	int32 KillCount; // 0x3c(0x04)
	int32 HeadShotCount; // 0x40(0x04)
	float GivenDamages; // 0x44(0x04)
};

// ScriptStruct TslGame.WuEventMatchStatus
// Size: 0xc8 (Inherited: 0x10)
struct FWuEventMatchStatus : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString MatchId; // 0x18(0x10)
	struct FString TeamMode; // 0x28(0x10)
	struct FString CameraMode; // 0x38(0x10)
	struct FString MatchState; // 0x48(0x10)
	int32 ElapsedTime; // 0x58(0x04)
	int32 BlueZonePhase; // 0x5c(0x04)
	bool IsBlueZoneMoving; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float BluezoneRadius; // 0x64(0x04)
	struct FVector BlueZoneLocation; // 0x68(0x0c)
	float WhiteZoneRadius; // 0x74(0x04)
	struct FVector WhiteZoneLocation; // 0x78(0x0c)
	float RedZoneRadius; // 0x84(0x04)
	struct FVector RedZoneLocation; // 0x88(0x0c)
	float BlackZoneRadius; // 0x94(0x04)
	struct FVector BlackZoneLocation; // 0x98(0x0c)
	int32 StartPlayerCount; // 0xa4(0x04)
	int32 AlivePlayerCount; // 0xa8(0x04)
	int32 StartTeamCount; // 0xac(0x04)
	int32 AliveTeamCount; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct TArray<struct FWuEventDataPlayerInfo> PlayerInfos; // 0xb8(0x10)
};

// ScriptStruct TslGame.WuEventDataPlayerInfo
// Size: 0x50 (Inherited: 0x00)
struct FWuEventDataPlayerInfo {
	struct FString PlayerName; // 0x00(0x10)
	int32 TeamId; // 0x10(0x04)
	struct FVector Location; // 0x14(0x0c)
	float Health; // 0x20(0x04)
	float BoostGauge; // 0x24(0x04)
	struct FString State; // 0x28(0x10)
	struct FString ArmedWeapon; // 0x38(0x10)
	int32 ArmedAmmoCount; // 0x48(0x04)
	int32 InventoryAmmoCount; // 0x4c(0x04)
};

// ScriptStruct TslGame.WuEventPlayerStatus
// Size: 0xa0 (Inherited: 0x10)
struct FWuEventPlayerStatus : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	struct FString MyPlayerName; // 0x20(0x10)
	bool IsSpetating; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FVector SpectatingCameraLocation; // 0x34(0x0c)
	struct FWuEventDataPlayerInfo CurrentPlayerInfo; // 0x40(0x50)
	struct TArray<struct FWuEventDataPlayerInfo> TeamMatesInfo; // 0x90(0x10)
};

// ScriptStruct TslGame.WuEventMatchLeave
// Size: 0x20 (Inherited: 0x10)
struct FWuEventMatchLeave : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
};

// ScriptStruct TslGame.WuEventMatchJoin
// Size: 0x48 (Inherited: 0x10)
struct FWuEventMatchJoin : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	struct FString TeamMode; // 0x20(0x10)
	struct FString CameraMode; // 0x30(0x10)
	bool IsDetailObserver; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// ScriptStruct TslGame.WuLogUseBrokenElectronics
// Size: 0x100 (Inherited: 0x60)
struct FWuLogUseBrokenElectronics : FLogBase {
	struct FString ElectronicsType; // 0x60(0x10)
	struct FWuLogCharacter Character; // 0x70(0x90)
};

// ScriptStruct TslGame.WuLogSpecialZoneSpawn
// Size: 0x80 (Inherited: 0x60)
struct FWuLogSpecialZoneSpawn : FLogBase {
	struct FString ZoneType; // 0x60(0x10)
	struct FVector SpawnedPosition; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogIndoorRangeScore
// Size: 0x90 (Inherited: 0x60)
struct FWuLogIndoorRangeScore : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	struct TArray<struct FWuIntIntPair> Score; // 0x80(0x10)
};

// ScriptStruct TslGame.WuIntIntPair
// Size: 0x08 (Inherited: 0x00)
struct FWuIntIntPair {
	int32 First; // 0x00(0x04)
	int32 second; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogChangeTargetDistance
// Size: 0x88 (Inherited: 0x60)
struct FWuLogChangeTargetDistance : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	int32 Distance; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct TslGame.WuLogEnterIndoorRange
// Size: 0x88 (Inherited: 0x60)
struct FWuLogEnterIndoorRange : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	bool bIsExit; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
};

// ScriptStruct TslGame.WuLogSpray
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSpray : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString SprayName; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogHelmetHide
// Size: 0x68 (Inherited: 0x60)
struct FWuLogHelmetHide : FLogBase {
	bool IsHat; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
};

// ScriptStruct TslGame.WuLogLobbyMusic
// Size: 0x70 (Inherited: 0x60)
struct FWuLogLobbyMusic : FLogBase {
	struct FString MusicEventName; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogArenaRoundEnd
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaRoundEnd : FLogBase {
	int32 Round; // 0x60(0x04)
	bool IsLastRound; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct FWuLogArenaEndData> Arenas; // 0x68(0x10)
	struct TArray<struct FWuLogTeamInfoData> Teams; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogTeamInfoData
// Size: 0x30 (Inherited: 0x00)
struct FWuLogTeamInfoData {
	int32 TeamId; // 0x00(0x04)
	int32 Chances; // 0x04(0x04)
	int32 TotalKills; // 0x08(0x04)
	int32 TotalMoney; // 0x0c(0x04)
	struct FString KeyPlayer; // 0x10(0x10)
	struct TArray<struct FWuLogCharacterWeapons> Characters; // 0x20(0x10)
};

// ScriptStruct TslGame.WuLogCharacterWeapons
// Size: 0xc8 (Inherited: 0x00)
struct FWuLogCharacterWeapons {
	struct FWuLogCharacter Character; // 0x00(0x90)
	struct FString PrimaryWeaponFirst; // 0x90(0x10)
	struct FString PrimaryWeaponSecond; // 0xa0(0x10)
	struct FString SecondaryWeapon; // 0xb0(0x10)
	int32 SpawnKitIndex; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// ScriptStruct TslGame.WuLogArenaEndData
// Size: 0x08 (Inherited: 0x00)
struct FWuLogArenaEndData {
	int32 ArenaID; // 0x00(0x04)
	int32 WinnerTeamId; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogArenaRoundStart
// Size: 0x78 (Inherited: 0x60)
struct FWuLogArenaRoundStart : FLogBase {
	int32 Round; // 0x60(0x04)
	bool IsLastRound; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct FWuLogArenaStartData> Arenas; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogArenaStartData
// Size: 0x18 (Inherited: 0x00)
struct FWuLogArenaStartData {
	int32 ArenaID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FWuLogTeamInfoData> Teams; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLogArenaLoadoutBuy
// Size: 0x98 (Inherited: 0x60)
struct FWuLogArenaLoadoutBuy : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	int32 Sum; // 0x70(0x04)
	int32 ItemsNum; // 0x74(0x04)
	struct FString ItemID; // 0x78(0x10)
	struct FString ReplacedItemId; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogArenaCurrencyChange
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaCurrencyChange : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	int32 CurrencyDif; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FString Source; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogArenaScreenOpen
// Size: 0x80 (Inherited: 0x60)
struct FWuLogArenaScreenOpen : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	struct FString ScreenName; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogArenaGameStatePeriodic
// Size: 0xe8 (Inherited: 0x60)
struct FWuLogArenaGameStatePeriodic : FLogBase {
	struct FWuLogArenaGameState ArenaGameState; // 0x60(0x88)
};

// ScriptStruct TslGame.WuLogArenaGameState
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaGameState : FLogBase {
	int32 ElapsedTime; // 0x60(0x04)
	int32 NumAliveTeams; // 0x64(0x04)
	int32 NumJoinPlayers; // 0x68(0x04)
	int32 NumStartPlayers; // 0x6c(0x04)
	int32 NumAlivePlayers; // 0x70(0x04)
	int32 Round; // 0x74(0x04)
	struct TArray<struct FWuLogArena> Arenas; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogArena
// Size: 0x24 (Inherited: 0x00)
struct FWuLogArena {
	struct FVector SafetyZonePosition; // 0x00(0x0c)
	float SafetyZoneRadius; // 0x0c(0x04)
	struct FVector PoisonGasWarningPosition; // 0x10(0x0c)
	float PoisonGasWarningRadius; // 0x1c(0x04)
	int32 ArenaID; // 0x20(0x04)
};

// ScriptStruct TslGame.WuLogInPacketStat
// Size: 0xa8 (Inherited: 0x60)
struct FWuLogInPacketStat : FLogBase {
	struct FString LeagueType; // 0x60(0x10)
	struct FString ModeName; // 0x70(0x10)
	struct FString Name; // 0x80(0x10)
	struct FString AccountId; // 0x90(0x10)
	float ElapsedTimeSec; // 0xa0(0x04)
	int32 NumOutOfOrder; // 0xa4(0x04)
};

// ScriptStruct TslGame.WuLogOutPacketLoss
// Size: 0xd0 (Inherited: 0x60)
struct FWuLogOutPacketLoss : FLogBase {
	struct FString LeagueType; // 0x60(0x10)
	struct FString ModeName; // 0x70(0x10)
	struct FString Name; // 0x80(0x10)
	struct FString AccountId; // 0x90(0x10)
	float ElapsedTimeSec; // 0xa0(0x04)
	int32 NumOutBunch; // 0xa4(0x04)
	int32 NumOutPacket; // 0xa8(0x04)
	int32 NumOutPacketNaked; // 0xac(0x04)
	struct TArray<struct FWuLostPacketData> NakedPacketDataList; // 0xb0(0x10)
	struct TArray<struct FWuLostBunchData> NakedBunchDataList; // 0xc0(0x10)
};

// ScriptStruct TslGame.WuLostBunchData
// Size: 0x18 (Inherited: 0x00)
struct FWuLostBunchData {
	int32 NumSent; // 0x00(0x04)
	int32 NumLoss; // 0x04(0x04)
	struct FString Content; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLostPacketData
// Size: 0x0c (Inherited: 0x00)
struct FWuLostPacketData {
	int32 NumLoss; // 0x00(0x04)
	int32 SizeBitsPlain; // 0x04(0x04)
	int32 SizeBitsEncryped; // 0x08(0x04)
};

// ScriptStruct TslGame.WuLogParachuteFollowReleaseByHoldKey
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogParachuteFollowReleaseByHoldKey : FLogBase {
	struct FWuLogCharacter UserInfo; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogParachuteFollow
// Size: 0x118 (Inherited: 0x60)
struct FWuLogParachuteFollow : FLogBase {
	struct FWuLogCharacter UserInfo; // 0x60(0x90)
	bool IsFollower; // 0xf0(0x01)
	char pad_F1[0x3]; // 0xf1(0x03)
	int32 FollowerNum; // 0xf4(0x04)
	struct FString TargetName; // 0xf8(0x10)
	struct FString ModeName; // 0x108(0x10)
};

// ScriptStruct TslGame.WuLogPlayerMovementBaseChanged
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerMovementBaseChanged : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString NewMovementBase; // 0xf0(0x10)
	struct FString OldMovementBase; // 0x100(0x10)
	float MovedDistance; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
};

// ScriptStruct TslGame.WuLogPlayerScore
// Size: 0x138 (Inherited: 0x60)
struct FWuLogPlayerScore : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 KillScore; // 0xf0(0x04)
	int32 KillCount; // 0xf4(0x04)
	int32 DeathScore; // 0xf8(0x04)
	int32 DeathCount; // 0xfc(0x04)
	int32 AssistScore; // 0x100(0x04)
	int32 AssistCount; // 0x104(0x04)
	int32 ChainKillScore; // 0x108(0x04)
	int32 ChainKillCount; // 0x10c(0x04)
	int32 WinRoundScore; // 0x110(0x04)
	int32 WinRoundCount; // 0x114(0x04)
	int32 DefeatRoundScore; // 0x118(0x04)
	int32 DefeatRoundCount; // 0x11c(0x04)
	int32 WinMatchScore; // 0x120(0x04)
	int32 WinMatchCount; // 0x124(0x04)
	int32 DefeatMatchScore; // 0x128(0x04)
	int32 DefeatMatchCount; // 0x12c(0x04)
	int32 TotalScore; // 0x130(0x04)
	char pad_134[0x4]; // 0x134(0x04)
};

// ScriptStruct TslGame.WuDevLog
// Size: 0x80 (Inherited: 0x60)
struct FWuDevLog : FLogBase {
	struct FString DevLogKey; // 0x60(0x10)
	struct TArray<struct FWuDevLogElement> DevLogs; // 0x70(0x10)
};

// ScriptStruct TslGame.WuDevLogElement
// Size: 0x20 (Inherited: 0x00)
struct FWuDevLogElement {
	struct FString Key; // 0x00(0x10)
	struct FString Value; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLogPlayerHealed
// Size: 0x1a8 (Inherited: 0x60)
struct FWuLogPlayerHealed : FLogBase {
	struct FWuLogCharacter Healer; // 0x60(0x90)
	struct FWuLogCharacter Target; // 0xf0(0x90)
	int32 HealId; // 0x180(0x04)
	float Healamount; // 0x184(0x04)
	struct FString HealCauserName; // 0x188(0x10)
	struct FString HealTypeCategory; // 0x198(0x10)
};

// ScriptStruct TslGame.WuLogPlayerBuffed
// Size: 0x1a8 (Inherited: 0x60)
struct FWuLogPlayerBuffed : FLogBase {
	struct FWuLogCharacter Buffer; // 0x60(0x90)
	struct FWuLogCharacter Target; // 0xf0(0x90)
	int32 BuffId; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
	struct FString BuffCauserName; // 0x188(0x10)
	struct FString BuffType; // 0x198(0x10)
};

// ScriptStruct TslGame.WuLogItemSkillSpawn
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemSkillSpawn : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogCraftResult
// Size: 0x178 (Inherited: 0x60)
struct FWuLogCraftResult : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	bool SUCCESS; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct FString FailedReason; // 0xf8(0x10)
	struct FString CraftItem; // 0x108(0x10)
	struct FWuLogItem ItemResult; // 0x118(0x50)
	struct TArray<struct FWuLogItem> Materials; // 0x168(0x10)
};

// ScriptStruct TslGame.WuLogConnectionTimeOutError
// Size: 0xa0 (Inherited: 0x60)
struct FWuLogConnectionTimeOutError : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	float DriverTime; // 0x70(0x04)
	float Threshold; // 0x74(0x04)
	struct FString RemoteAddress; // 0x78(0x10)
	bool IsServer; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct FString UniqueId; // 0x90(0x10)
};

// ScriptStruct TslGame.WuLogServerInfo
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogServerInfo : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString InstanceId; // 0x70(0x10)
	struct FString PublicIp; // 0x80(0x10)
	struct FString InstanceType; // 0x90(0x10)
	struct FString GameServerVersion; // 0xa0(0x10)
	struct FString Weather; // 0xb0(0x10)
	struct FString MapName; // 0xc0(0x10)
	struct FString StartTimeStamp; // 0xd0(0x10)
	struct FString EndTimeStamp; // 0xe0(0x10)
};

// ScriptStruct TslGame.WuLogPing
// Size: 0xc8 (Inherited: 0x60)
struct FWuLogPing : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString LeagueType; // 0x70(0x10)
	struct FString ModeName; // 0x80(0x10)
	float MissRate; // 0x90(0x04)
	float ReliableDelay; // 0x94(0x04)
	float UnreliableDelay; // 0x98(0x04)
	float ReliableDelayRange; // 0x9c(0x04)
	float UnreliableDelayRange; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FString Nickname; // 0xa8(0x10)
	struct FString AccountId; // 0xb8(0x10)
};

// ScriptStruct TslGame.WuLogNickname
// Size: 0xb0 (Inherited: 0x60)
struct FWuLogNickname : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString PlayerNetId; // 0x70(0x10)
	struct FString Nickname; // 0x80(0x10)
	struct FString Ip; // 0x90(0x10)
	struct FString ClientVersion; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuLogLocationCorrection
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogLocationCorrection : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString AccountId; // 0x70(0x10)
	struct FString PlayerName; // 0x80(0x10)
	float LocDiff; // 0x90(0x04)
	float AllowedDiff; // 0x94(0x04)
	struct FVector Velocity; // 0x98(0x0c)
	float Speed; // 0xa4(0x04)
	struct FString MovementMode; // 0xa8(0x10)
	struct FString CustomMovementMode; // 0xb8(0x10)
	struct FString ClientMovementMode; // 0xc8(0x10)
	struct FString ClientCustomMovementMode; // 0xd8(0x10)
	float Ping; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// ScriptStruct TslGame.WuLogFps
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogFps : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString LeagueType; // 0x70(0x10)
	struct FString ModeName; // 0x80(0x10)
	int32 ServerFps; // 0x90(0x04)
	int32 AlivePlayers; // 0x94(0x04)
	int32 JoinPlayers; // 0x98(0x04)
	float Duration; // 0x9c(0x04)
	float AvgInBytesPerSecond; // 0xa0(0x04)
	float AvgOutBytesPerSecond; // 0xa4(0x04)
	int32 MaxInBytesPerSecond; // 0xa8(0x04)
	int32 MaxOutBytesPerSecond; // 0xac(0x04)
	float UsedVirtualMemoryMiB; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogVehicleInteraction
// Size: 0x168 (Inherited: 0x60)
struct FWuLogVehicleInteraction : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	struct FString EventType; // 0x148(0x10)
	struct TArray<struct FWuStringIntPair> EventInfo; // 0x158(0x10)
};

// ScriptStruct TslGame.WuLogObjectInteraction
// Size: 0x120 (Inherited: 0x60)
struct FWuLogObjectInteraction : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString ObjectType; // 0xf0(0x10)
	struct FString ObjectTypeStatus; // 0x100(0x10)
	struct TArray<struct FWuStringIntPair> ObjectTypeAdditionalInfo; // 0x110(0x10)
};

// ScriptStruct TslGame.WuLogFlaregunCalled
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogFlaregunCalled : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	bool IsInWhiteZone; // 0xf0(0x01)
	bool IsCalledSuccessfully; // 0xf1(0x01)
	char pad_F2[0x6]; // 0xf2(0x06)
};

// ScriptStruct TslGame.WuLogPlayerDeath
// Size: 0x110 (Inherited: 0x60)
struct FWuLogPlayerDeath : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FString> Weapons; // 0xf0(0x10)
	struct TArray<struct FString> Equips; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogXboxUnautorizedDevice
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogXboxUnautorizedDevice : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 KillCount; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogNetDriverError
// Size: 0x70 (Inherited: 0x60)
struct FWuLogNetDriverError : FLogBase {
	struct TArray<struct FWuDdosInfo> Infos; // 0x60(0x10)
};

// ScriptStruct TslGame.WuDdosInfo
// Size: 0x28 (Inherited: 0x00)
struct FWuDdosInfo {
	struct FString ErrorType; // 0x00(0x10)
	struct FString Ip; // 0x10(0x10)
	int32 Port; // 0x20(0x04)
	int32 Count; // 0x24(0x04)
};

// ScriptStruct TslGame.WuLogMissionListOpen
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogMissionListOpen : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogWeaponFireCount
// Size: 0x108 (Inherited: 0x60)
struct FWuLogWeaponFireCount : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString WeaponId; // 0xf0(0x10)
	int32 FireCount; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogRedZoneEnded
// Size: 0x70 (Inherited: 0x60)
struct FWuLogRedZoneEnded : FLogBase {
	struct TArray<struct FWuLogCharacter> Drivers; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogParachuteLanding
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogParachuteLanding : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	float Distance; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogObjectDestroy
// Size: 0x110 (Inherited: 0x60)
struct FWuLogObjectDestroy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString ObjectType; // 0xf0(0x10)
	struct FVector ObjectLocation; // 0x100(0x0c)
	char pad_10C[0x4]; // 0x10c(0x04)
};

// ScriptStruct TslGame.WuLogEmote
// Size: 0x120 (Inherited: 0x60)
struct FWuLogEmote : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString EmoteName; // 0xf0(0x10)
	struct FString EmoteType; // 0x100(0x10)
	struct TArray<struct FWuStringStringPair> AdditionalParameters; // 0x110(0x10)
};

// ScriptStruct TslGame.WuStringStringPair
// Size: 0x20 (Inherited: 0x00)
struct FWuStringStringPair {
	struct FString First; // 0x00(0x10)
	struct FString second; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLogVaultStart
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogVaultStart : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	bool IsLedgeGrab; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
};

// ScriptStruct TslGame.WuLogSkinUpdate
// Size: 0x170 (Inherited: 0x60)
struct FWuLogSkinUpdate : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	struct FString SkinName; // 0x140(0x10)
	struct FString SkinCategory; // 0x150(0x10)
	struct TArray<struct FWuLogItem> PartItems; // 0x160(0x10)
};

// ScriptStruct TslGame.WuLogMovementSpam
// Size: 0x98 (Inherited: 0x60)
struct FWuLogMovementSpam : FLogBase {
	struct FString AttackerId; // 0x60(0x10)
	struct FString VictimId; // 0x70(0x10)
	int32 AttackerLeftLeans; // 0x80(0x04)
	int32 AttackerRightLeans; // 0x84(0x04)
	int32 AttackerCrouches; // 0x88(0x04)
	int32 VictimLeftLeans; // 0x8c(0x04)
	int32 VictimRightLeans; // 0x90(0x04)
	int32 VictimCrouches; // 0x94(0x04)
};

// ScriptStruct TslGame.WuLogStatAccuracy
// Size: 0x78 (Inherited: 0x60)
struct FWuLogStatAccuracy : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 NumShots; // 0x70(0x04)
	int32 NumHits; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogLoadingFinished
// Size: 0x178 (Inherited: 0x60)
struct FWuLogLoadingFinished : FLogBase {
	struct FString DeviceName; // 0x60(0x10)
	struct FString Timestamp; // 0x70(0x10)
	struct FString MatchId; // 0x80(0x10)
	struct FString ServerName; // 0x90(0x10)
	struct FString ModeName; // 0xa0(0x10)
	struct FString Date; // 0xb0(0x10)
	struct FString State; // 0xc0(0x10)
	int32 LoadingTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct FWuLogCharacter Character; // 0xd8(0x90)
	struct FString ActualHardwareName; // 0x168(0x10)
};

// ScriptStruct TslGame.WuLogFreeMemory
// Size: 0xb0 (Inherited: 0x60)
struct FWuLogFreeMemory : FLogBase {
	struct FString DeviceName; // 0x60(0x10)
	struct FString PlayerNetId; // 0x70(0x10)
	struct FString AccountId; // 0x80(0x10)
	struct TArray<struct FWuMemoryStat> MemoryStats; // 0x90(0x10)
	struct FString ActualHardwareName; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuMemoryStat
// Size: 0x18 (Inherited: 0x00)
struct FWuMemoryStat {
	struct FString Name; // 0x00(0x10)
	float Value; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogMatchSetting
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogMatchSetting : FLogBase {
	bool IsCustomGame; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct FString MapName; // 0x68(0x10)
	struct FString ModeName; // 0x78(0x10)
	struct FString MatchId; // 0x88(0x10)
	int32 TeamCount; // 0x98(0x04)
	int32 MinPlayerCount; // 0x9c(0x04)
	int32 MaxPlayerCount; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct TArray<struct FWuStringStringPair> MatchSettings; // 0xa8(0x10)
};

// ScriptStruct TslGame.WuLogBulletShotDistance
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogBulletShotDistance : FLogBase {
	struct FVector VictimLocation; // 0x60(0x0c)
	struct FVector HitLocation; // 0x6c(0x0c)
	float Distance; // 0x78(0x04)
	bool IsVictimInVehicle; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	float VictimSpeed; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct FString VictimStanceMode; // 0x88(0x10)
	struct FString VictimMovementMode; // 0x98(0x10)
	struct FString AttackerAccountId; // 0xa8(0x10)
	float AttackerPing; // 0xb8(0x04)
	float AttackerRDelay; // 0xbc(0x04)
	float AttackerUDelay; // 0xc0(0x04)
	float AttackerUMissPercent; // 0xc4(0x04)
	struct FString VictimAccountId; // 0xc8(0x10)
	float VictimPing; // 0xd8(0x04)
	float VictimRDelay; // 0xdc(0x04)
	float VictimUDelay; // 0xe0(0x04)
	float VictimUMissPercent; // 0xe4(0x04)
	int32 AttackId; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// ScriptStruct TslGame.WuLogSteamNoNetworkConnection
// Size: 0x88 (Inherited: 0x60)
struct FWuLogSteamNoNetworkConnection : FLogBase {
	int32 DisconnectionCountPerGame; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString SteamKickReason; // 0x68(0x10)
	struct FString AccountId; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogBodyPenetrationDamageInfo
// Size: 0x110 (Inherited: 0x60)
struct FWuLogBodyPenetrationDamageInfo : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	float DamageDiff; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FString DamageZone; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogCheat
// Size: 0x138 (Inherited: 0x60)
struct FWuLogCheat : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString CheatType; // 0xf0(0x10)
	struct FString Description; // 0x100(0x10)
	float ParamFloat1; // 0x110(0x04)
	float ParamFloat2; // 0x114(0x04)
	struct FString ParamString1; // 0x118(0x10)
	struct FString ParamString2; // 0x128(0x10)
};

// ScriptStruct TslGame.WuLogSwimEnd
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogSwimEnd : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	float SwimDistance; // 0xf0(0x04)
	float MaxSwimDepthOfWater; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogSwimStart
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogSwimStart : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogWheelDestroy
// Size: 0x178 (Inherited: 0x60)
struct FWuLogWheelDestroy : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogVehicle Vehicle; // 0xf8(0x58)
	int32 WheelIndex; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct FString DamageTypeCategory; // 0x158(0x10)
	struct FString DamageCauserName; // 0x168(0x10)
};

// ScriptStruct TslGame.WuLogVehicleDestroy
// Size: 0x178 (Inherited: 0x60)
struct FWuLogVehicleDestroy : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogVehicle Vehicle; // 0xf8(0x58)
	struct FString DamageTypeCategory; // 0x150(0x10)
	struct FString DamageCauserName; // 0x160(0x10)
	float Distance; // 0x170(0x04)
	char pad_174[0x4]; // 0x174(0x04)
};

// ScriptStruct TslGame.WuLogVehicleDamage
// Size: 0x178 (Inherited: 0x60)
struct FWuLogVehicleDamage : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogVehicle Vehicle; // 0xf8(0x58)
	struct FString DamageTypeCategory; // 0x150(0x10)
	struct FString DamageCauserName; // 0x160(0x10)
	float Damage; // 0x170(0x04)
	float Distance; // 0x174(0x04)
};

// ScriptStruct TslGame.WuLogVehicleLeave
// Size: 0x168 (Inherited: 0x60)
struct FWuLogVehicleLeave : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	float RideDistance; // 0x148(0x04)
	int32 SeatIndex; // 0x14c(0x04)
	float MaxSpeed; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct TArray<struct FWuLogCharacter> FellowPassengers; // 0x158(0x10)
};

// ScriptStruct TslGame.WuLogVehicleRide
// Size: 0x160 (Inherited: 0x60)
struct FWuLogVehicleRide : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	int32 SeatIndex; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct TArray<struct FWuLogCharacter> FellowPassengers; // 0x150(0x10)
};

// ScriptStruct TslGame.WuLogVehicleSpawn
// Size: 0x80 (Inherited: 0x60)
struct FWuLogVehicleSpawn : FLogBase {
	struct FString VehicleId; // 0x60(0x10)
	struct FVector Location; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogVehicleAISpawn
// Size: 0xc8 (Inherited: 0x60)
struct FWuLogVehicleAISpawn : FLogBase {
	struct FString SpawnId; // 0x60(0x10)
	struct FWuLogVehicle Vehicle; // 0x70(0x58)
};

// ScriptStruct TslGame.WuLogUseRevivalTransmitter
// Size: 0x88 (Inherited: 0x60)
struct FWuLogUseRevivalTransmitter : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString AccountId; // 0x68(0x10)
	struct FVector UsingPosition; // 0x78(0x0c)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct TslGame.WuLogUseRevivalTower
// Size: 0x80 (Inherited: 0x60)
struct FWuLogUseRevivalTower : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString AccountId; // 0x68(0x10)
	bool bIsSuccess; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// ScriptStruct TslGame.WuLogRevivalTowerSpawn
// Size: 0x70 (Inherited: 0x60)
struct FWuLogRevivalTowerSpawn : FLogBase {
	struct FVector SpawnedPosition; // 0x60(0x0c)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// ScriptStruct TslGame.WuLogCarePackageLand
// Size: 0x90 (Inherited: 0x60)
struct FWuLogCarePackageLand : FLogBase {
	struct FWuLogItemPackage ItemPackage; // 0x60(0x30)
};

// ScriptStruct TslGame.WuLogItemPackage
// Size: 0x30 (Inherited: 0x00)
struct FWuLogItemPackage {
	struct FString ItemPackageId; // 0x00(0x10)
	struct FVector Location; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct TArray<struct FWuLogItem> Items; // 0x20(0x10)
};

// ScriptStruct TslGame.WuLogCarePackageSpawn
// Size: 0x90 (Inherited: 0x60)
struct FWuLogCarePackageSpawn : FLogBase {
	struct FWuLogItemPackage ItemPackage; // 0x60(0x30)
};

// ScriptStruct TslGame.WuLogLootTruckPackageSpawn
// Size: 0x178 (Inherited: 0x60)
struct FWuLogLootTruckPackageSpawn : FLogBase {
	struct FWuLogItemPackage ItemPackage; // 0x60(0x30)
	struct FWuLogCharacter Character; // 0x90(0x90)
	struct FWuLogVehicle Vehicle; // 0x120(0x58)
};

// ScriptStruct TslGame.WuLogLanguage
// Size: 0x110 (Inherited: 0x60)
struct FWuLogLanguage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString WindowsLanguage; // 0xf0(0x10)
	struct FString GameLanguage; // 0x100(0x10)
};

// ScriptStruct TslGame.WuSystemInfo
// Size: 0x248 (Inherited: 0x60)
struct FWuSystemInfo : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString OsLanguage; // 0xf0(0x10)
	struct FString GameLanguage; // 0x100(0x10)
	struct FString OsVersion; // 0x110(0x10)
	struct FString CpuName; // 0x120(0x10)
	struct FString GpuName; // 0x130(0x10)
	int32 RamInGB; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct FString BaseBoardSerial; // 0x148(0x10)
	struct TArray<struct FString> MemorySerials; // 0x158(0x10)
	int32 ArpIpCount; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
	struct FString OsUserAccount; // 0x170(0x10)
	struct TArray<struct FString> DiskModelNames; // 0x180(0x10)
	struct TArray<struct FString> DiskSerials; // 0x190(0x10)
	struct TArray<struct FString> MonitorModelNames; // 0x1a0(0x10)
	struct TArray<struct FString> MonitorSerials; // 0x1b0(0x10)
	struct TArray<struct FString> MemoryModelNames; // 0x1c0(0x10)
	struct FString BaseBoardModelName; // 0x1d0(0x10)
	struct TArray<struct FString> GatewayMacAddress; // 0x1e0(0x10)
	bool UsingXenuine; // 0x1f0(0x01)
	char pad_1F1[0x3]; // 0x1f1(0x03)
	struct FWuGraphicSettings GraphicSettings; // 0x1f4(0x40)
	char pad_234[0x4]; // 0x234(0x04)
	struct FString CpuClock; // 0x238(0x10)
};

// ScriptStruct TslGame.WuGraphicSettings
// Size: 0x40 (Inherited: 0x00)
struct FWuGraphicSettings {
	int32 ResolutionWidth; // 0x00(0x04)
	int32 ResolutionHeight; // 0x04(0x04)
	bool VSync; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 DisplayMode; // 0x0c(0x04)
	int32 FOV; // 0x10(0x04)
	int32 ScreenScale; // 0x14(0x04)
	int32 AntiAliasing; // 0x18(0x04)
	int32 PostProcessing; // 0x1c(0x04)
	int32 Shadows; // 0x20(0x04)
	int32 Textures; // 0x24(0x04)
	int32 Effects; // 0x28(0x04)
	int32 Foliage; // 0x2c(0x04)
	int32 ViewDistance; // 0x30(0x04)
	bool MotionBlur; // 0x34(0x01)
	bool MinimapDynamicZoom; // 0x35(0x01)
	bool FreelockInterpolation; // 0x36(0x01)
	bool Replay; // 0x37(0x01)
	bool DeathCam; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	int32 GraphicsAPI; // 0x3c(0x04)
};

// ScriptStruct TslGame.WuLogHeal
// Size: 0x148 (Inherited: 0x60)
struct FWuLogHeal : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	float Healamount; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
};

// ScriptStruct TslGame.WuLogEmPickupLiftOff
// Size: 0x110 (Inherited: 0x60)
struct FWuLogEmPickupLiftOff : FLogBase {
	struct FWuLogCharacter Instigator; // 0x60(0x90)
	struct TArray<struct FWuLogCharacter> Riders; // 0xf0(0x10)
	int32 VehicleUniqueId; // 0x100(0x04)
	int32 BlueZonePhase; // 0x104(0x04)
	float DistanceToBluezone; // 0x108(0x04)
	float DistanceToSafezone; // 0x10c(0x04)
};

// ScriptStruct TslGame.WuLogItemThrow
// Size: 0x1d8 (Inherited: 0x60)
struct FWuLogItemThrow : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogCharacter Target; // 0xf0(0x90)
	struct FWuLogItem Item; // 0x180(0x50)
	float Distance; // 0x1d0(0x04)
	bool IsSuccess; // 0x1d4(0x01)
	char pad_1D5[0x3]; // 0x1d5(0x03)
};

// ScriptStruct TslGame.WuLogItemUse
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemUse : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogItemDetach
// Size: 0x190 (Inherited: 0x60)
struct FWuLogItemDetach : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem ParentItem; // 0xf0(0x50)
	struct FWuLogItem ChildItem; // 0x140(0x50)
};

// ScriptStruct TslGame.WuLogItemAttachedAll
// Size: 0x190 (Inherited: 0x60)
struct FWuLogItemAttachedAll : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem ParentItem; // 0xf0(0x50)
	struct FWuLogItem ChildItem; // 0x140(0x50)
};

// ScriptStruct TslGame.WuLogItemAttach
// Size: 0x190 (Inherited: 0x60)
struct FWuLogItemAttach : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem ParentItem; // 0xf0(0x50)
	struct FWuLogItem ChildItem; // 0x140(0x50)
};

// ScriptStruct TslGame.WuLogItemUnequip
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemUnequip : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogItemEquip
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemEquip : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogItemDrop
// Size: 0x148 (Inherited: 0x60)
struct FWuLogItemDrop : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	bool IsDropVolatility; // 0x140(0x01)
	char pad_141[0x7]; // 0x141(0x07)
};

// ScriptStruct TslGame.WuLogItemPickupFromCustomPackage
// Size: 0x160 (Inherited: 0x60)
struct FWuLogItemPickupFromCustomPackage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	struct FString SourceUniqueId; // 0x140(0x10)
	struct FString CustomPackageUniqueId; // 0x150(0x10)
};

// ScriptStruct TslGame.WuLogItemPickupFromVehicleTrunk
// Size: 0x1a0 (Inherited: 0x60)
struct FWuLogItemPickupFromVehicleTrunk : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	struct FWuLogItem Item; // 0x148(0x50)
	float BeforeTrunkCapacity; // 0x198(0x04)
	float CurrentTrunkCapacity; // 0x19c(0x04)
};

// ScriptStruct TslGame.WuLogItemPutToVehicleTrunk
// Size: 0x1a0 (Inherited: 0x60)
struct FWuLogItemPutToVehicleTrunk : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	struct FWuLogItem Item; // 0x148(0x50)
	float BeforeTrunkCapacity; // 0x198(0x04)
	float CurrentTrunkCapacity; // 0x19c(0x04)
};

// ScriptStruct TslGame.WuLogItemPickupFromRandomBox
// Size: 0x150 (Inherited: 0x60)
struct FWuLogItemPickupFromRandomBox : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Weapon; // 0xf0(0x50)
	struct FString RandomBoxName; // 0x140(0x10)
};

// ScriptStruct TslGame.WuLogItemPickupFromLootBox
// Size: 0x158 (Inherited: 0x60)
struct FWuLogItemPickupFromLootBox : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	int32 OwnerTeamId; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct FString CreatorAccountId; // 0x148(0x10)
};

// ScriptStruct TslGame.WuLogItemPickupFromItemPackage
// Size: 0x150 (Inherited: 0x60)
struct FWuLogItemPickupFromItemPackage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	struct FString PackageName; // 0x140(0x10)
};

// ScriptStruct TslGame.WuLogItemPickupFromCarepackage
// Size: 0x158 (Inherited: 0x60)
struct FWuLogItemPickupFromCarepackage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	int32 CarePackageUniqueId; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct FString CarePackageName; // 0x148(0x10)
};

// ScriptStruct TslGame.WuLogItemPickup
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemPickup : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogItemSpawn
// Size: 0x78 (Inherited: 0x60)
struct FWuLogItemSpawn : FLogBase {
	struct FString ItemID; // 0x60(0x10)
	int32 SpawnCount; // 0x70(0x04)
	int32 StackCount; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogMatchLastDefeat
// Size: 0xc8 (Inherited: 0x60)
struct FWuLogMatchLastDefeat : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString DamageTypeCategory; // 0x70(0x10)
	struct FString VictimAccountId; // 0x80(0x10)
	struct FString DamageCauserName; // 0x90(0x10)
	struct FVector AttackerLocation; // 0xa0(0x0c)
	struct FVector VictimLocation; // 0xac(0x0c)
	bool IsFatal; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DBNOId; // 0xbc(0x04)
	int32 VictimTeamId; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// ScriptStruct TslGame.WuLogMatchFirstDefeat
// Size: 0xc8 (Inherited: 0x60)
struct FWuLogMatchFirstDefeat : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString DamageTypeCategory; // 0x70(0x10)
	struct FString VictimAccountId; // 0x80(0x10)
	struct FString DamageCauserName; // 0x90(0x10)
	struct FVector AttackerLocation; // 0xa0(0x0c)
	struct FVector VictimLocation; // 0xac(0x0c)
	bool IsFatal; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DBNOId; // 0xbc(0x04)
	int32 VictimTeamId; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// ScriptStruct TslGame.WuLogExterminatedFromOutgame
// Size: 0x80 (Inherited: 0x60)
struct FWuLogExterminatedFromOutgame : FLogBase {
	struct TArray<struct FString> TeamAccounts; // 0x60(0x10)
	struct TArray<struct FString> KillerTeamAccounts; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogPlayerMatchFinished
// Size: 0x1c0 (Inherited: 0x60)
struct FWuLogPlayerMatchFinished : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuGameResultPerPlayer GameResult; // 0xf0(0xb0)
	struct FWuPlayerWeaponStats WeaponStats; // 0x1a0(0x20)
};

// ScriptStruct TslGame.WuPlayerWeaponStats
// Size: 0x20 (Inherited: 0x00)
struct FWuPlayerWeaponStats {
	struct FString AccountId; // 0x00(0x10)
	struct TArray<struct FWuWeaponStatsRecord> Stats; // 0x10(0x10)
};

// ScriptStruct TslGame.WuWeaponStatsRecord
// Size: 0x38 (Inherited: 0x00)
struct FWuWeaponStatsRecord {
	struct FString Weapon; // 0x00(0x10)
	int32 Damage; // 0x10(0x04)
	int32 DBNODamage; // 0x14(0x04)
	int32 Shots; // 0x18(0x04)
	int32 Hits; // 0x1c(0x04)
	int32 DBNOHits; // 0x20(0x04)
	int32 HoldingTime; // 0x24(0x04)
	struct TArray<struct FWuWeaponHitDetails> HitDetails; // 0x28(0x10)
};

// ScriptStruct TslGame.WuWeaponHitDetails
// Size: 0x28 (Inherited: 0x00)
struct FWuWeaponHitDetails {
	struct FString BodyPart; // 0x00(0x10)
	int32 Kills; // 0x10(0x04)
	int32 DBNOs; // 0x14(0x04)
	int32 Hits; // 0x18(0x04)
	int32 DBNOHits; // 0x1c(0x04)
	int32 Damage; // 0x20(0x04)
	int32 DBNODamage; // 0x24(0x04)
};

// ScriptStruct TslGame.WuLogPlayerKillV2
// Size: 0x490 (Inherited: 0x60)
struct FWuLogPlayerKillV2 : FLogBase {
	int32 AttackId; // 0x60(0x04)
	int32 DBNOId; // 0x64(0x04)
	struct FWuGameResultPerPlayer VictimGameResult; // 0x68(0xb0)
	struct FWuLogCharacter Victim; // 0x118(0x90)
	struct FString VictimWeapon; // 0x1a8(0x10)
	struct TArray<struct FString> VictimWeaponAdditionalInfo; // 0x1b8(0x10)
	struct FWuLogCharacter DBNOMaker; // 0x1c8(0x90)
	struct FWuLogKillDamageInfo DBNODamageInfo; // 0x258(0x48)
	struct FWuLogCharacter Finisher; // 0x2a0(0x90)
	struct FWuLogKillDamageInfo FinishDamageInfo; // 0x330(0x48)
	struct FWuLogCharacter Killer; // 0x378(0x90)
	struct FWuLogKillDamageInfo KillerDamageInfo; // 0x408(0x48)
	struct TArray<struct FString> Assists_AccountId; // 0x450(0x10)
	struct TArray<struct FString> TeamKillers_AccountId; // 0x460(0x10)
	bool IsSuicide; // 0x470(0x01)
	bool IsKillSteal; // 0x471(0x01)
	char pad_472[0x6]; // 0x472(0x06)
	struct TArray<struct FString> ReloadedWeaponsOfKiller; // 0x478(0x10)
	bool IsVictimIsBlind; // 0x488(0x01)
	char pad_489[0x3]; // 0x489(0x03)
	int32 AmmoInClipOfKiller; // 0x48c(0x04)
};

// ScriptStruct TslGame.WuLogKillDamageInfo
// Size: 0x48 (Inherited: 0x00)
struct FWuLogKillDamageInfo {
	struct FString DamageReason; // 0x00(0x10)
	struct FString DamageTypeCategory; // 0x10(0x10)
	struct FString DamageCauserName; // 0x20(0x10)
	struct TArray<struct FString> AdditionalInfo; // 0x30(0x10)
	float Distance; // 0x40(0x04)
	bool IsThroughPenetrableWall; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// ScriptStruct TslGame.WuLogPlayerKill
// Size: 0x340 (Inherited: 0x60)
struct FWuLogPlayerKill : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Killer; // 0x68(0x90)
	struct FWuLogCharacter Victim; // 0xf8(0x90)
	struct FWuLogCharacter Assistant; // 0x188(0x90)
	int32 DBNOId; // 0x218(0x04)
	char pad_21C[0x4]; // 0x21c(0x04)
	struct FString DamageReason; // 0x220(0x10)
	struct FString DamageTypeCategory; // 0x230(0x10)
	struct FString DamageCauserName; // 0x240(0x10)
	struct TArray<struct FString> DamageCauserAdditionalInfo; // 0x250(0x10)
	struct FString VictimWeapon; // 0x260(0x10)
	struct TArray<struct FString> VictimWeaponAdditionalInfo; // 0x270(0x10)
	float Distance; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct FWuGameResultPerPlayer VictimGameResult; // 0x288(0xb0)
	bool IsThroughPenetrableWall; // 0x338(0x01)
	char pad_339[0x7]; // 0x339(0x07)
};

// ScriptStruct TslGame.WuLogPlayerRevive
// Size: 0x188 (Inherited: 0x60)
struct FWuLogPlayerRevive : FLogBase {
	struct FWuLogCharacter Reviver; // 0x60(0x90)
	struct FWuLogCharacter Victim; // 0xf0(0x90)
	int32 DBNOId; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
};

// ScriptStruct TslGame.WuLogArmorDestroy
// Size: 0x210 (Inherited: 0x60)
struct FWuLogArmorDestroy : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogCharacter Victim; // 0xf8(0x90)
	struct FString DamageTypeCategory; // 0x188(0x10)
	struct FString DamageReason; // 0x198(0x10)
	struct FString DamageCauserName; // 0x1a8(0x10)
	struct FWuLogItem Item; // 0x1b8(0x50)
	float Distance; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
};

// ScriptStruct TslGame.WuLogPlayerMakeGroggy
// Size: 0x1f8 (Inherited: 0x60)
struct FWuLogPlayerMakeGroggy : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogCharacter Victim; // 0xf8(0x90)
	struct FString DamageReason; // 0x188(0x10)
	struct FString DamageTypeCategory; // 0x198(0x10)
	struct FString DamageCauserName; // 0x1a8(0x10)
	struct TArray<struct FString> DamageCauserAdditionalInfo; // 0x1b8(0x10)
	struct FString VictimWeapon; // 0x1c8(0x10)
	struct TArray<struct FString> VictimWeaponAdditionalInfo; // 0x1d8(0x10)
	float Distance; // 0x1e8(0x04)
	bool IsAttackerInVehicle; // 0x1ec(0x01)
	char pad_1ED[0x3]; // 0x1ed(0x03)
	int32 DBNOId; // 0x1f0(0x04)
	bool IsThroughPenetrableWall; // 0x1f4(0x01)
	char pad_1F5[0x3]; // 0x1f5(0x03)
};

// ScriptStruct TslGame.WuLogPlayerTakeDamage
// Size: 0x1c8 (Inherited: 0x60)
struct FWuLogPlayerTakeDamage : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogCharacter Victim; // 0xf8(0x90)
	struct FString DamageTypeCategory; // 0x188(0x10)
	struct FString DamageReason; // 0x198(0x10)
	float Damage; // 0x1a8(0x04)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct FString DamageCauserName; // 0x1b0(0x10)
	bool IsThroughPenetrableWall; // 0x1c0(0x01)
	char pad_1C1[0x7]; // 0x1c1(0x07)
};

// ScriptStruct TslGame.WuLogPlayerUseFlareGun
// Size: 0x158 (Inherited: 0x60)
struct FWuLogPlayerUseFlareGun : FLogBase {
	int32 AttackId; // 0x60(0x04)
	int32 FireWeaponStackCount; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FString AttackType; // 0xf8(0x10)
	struct FWuLogItem Weapon; // 0x108(0x50)
};

// ScriptStruct TslGame.WuLogPlayerDestroyBreachableWall
// Size: 0x140 (Inherited: 0x60)
struct FWuLogPlayerDestroyBreachableWall : FLogBase {
	struct FWuLogCharacter Attacker; // 0x60(0x90)
	struct FWuLogItem Weapon; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogPlayerDestroyProp
// Size: 0x110 (Inherited: 0x60)
struct FWuLogPlayerDestroyProp : FLogBase {
	struct FWuLogCharacter Attacker; // 0x60(0x90)
	struct FString ObjectType; // 0xf0(0x10)
	struct FVector ObjectLocation; // 0x100(0x0c)
	char pad_10C[0x4]; // 0x10c(0x04)
};

// ScriptStruct TslGame.WuLogBlackZoneEnded
// Size: 0x70 (Inherited: 0x60)
struct FWuLogBlackZoneEnded : FLogBase {
	struct TArray<struct FWuLogCharacter> Survivors; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogPlayerSummonBlackZone
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogPlayerSummonBlackZone : FLogBase {
	struct FWuLogCharacter Player; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogPlayerUseProjDecoy
// Size: 0x100 (Inherited: 0x60)
struct FWuLogPlayerUseProjDecoy : FLogBase {
	struct FWuLogCharacter DecoyInstigator; // 0x60(0x90)
	struct FVector Location; // 0xf0(0x0c)
	char pad_FC[0x4]; // 0xfc(0x04)
};

// ScriptStruct TslGame.WuLogPlayerUseWeapDecoy
// Size: 0x100 (Inherited: 0x60)
struct FWuLogPlayerUseWeapDecoy : FLogBase {
	struct FWuLogCharacter DecoyInstigator; // 0x60(0x90)
	struct FVector Location; // 0xf0(0x0c)
	char pad_FC[0x4]; // 0xfc(0x04)
};

// ScriptStruct TslGame.WuLogPlayerUseThrowable
// Size: 0x158 (Inherited: 0x60)
struct FWuLogPlayerUseThrowable : FLogBase {
	int32 AttackId; // 0x60(0x04)
	int32 FireWeaponStackCount; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FString AttackType; // 0xf8(0x10)
	struct FWuLogItem Weapon; // 0x108(0x50)
};

// ScriptStruct TslGame.WuLogPlayerAttack
// Size: 0x1b0 (Inherited: 0x60)
struct FWuLogPlayerAttack : FLogBase {
	int32 AttackId; // 0x60(0x04)
	int32 FireWeaponStackCount; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FString AttackType; // 0xf8(0x10)
	struct FWuLogItem Weapon; // 0x108(0x50)
	struct FWuLogVehicle Vehicle; // 0x158(0x58)
};

// ScriptStruct TslGame.WuLogClientHitch
// Size: 0x140 (Inherited: 0x60)
struct FWuLogClientHitch : FLogBase {
	struct FString GameModeType; // 0x60(0x10)
	struct FString LeagueType; // 0x70(0x10)
	float ElapsedTime; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct FWuLogCharacter CharacterLog; // 0x88(0x90)
	struct FVector CharacterVelocity; // 0x118(0x0c)
	bool IsInAircraft; // 0x124(0x01)
	bool IsFallingWithParachute; // 0x125(0x01)
	bool IsParachuting; // 0x126(0x01)
	bool IsInCar; // 0x127(0x01)
	struct FString RecentShownWidget; // 0x128(0x10)
	int32 AvailableCpuPhysicalMemory; // 0x138(0x04)
	int32 AvailableCpuVirtualMemory; // 0x13c(0x04)
};

// ScriptStruct TslGame.WuLogPlayerPosition
// Size: 0x170 (Inherited: 0x60)
struct FWuLogPlayerPosition : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	float ElapsedTime; // 0x148(0x04)
	int32 NumAlivePlayers; // 0x14c(0x04)
	float ClientFPS; // 0x150(0x04)
	int32 Under10FPS; // 0x154(0x04)
	int32 Under20FPS; // 0x158(0x04)
	int32 Under30FPS; // 0x15c(0x04)
	int32 Under60FPS; // 0x160(0x04)
	int32 MinFPS; // 0x164(0x04)
	int32 MaxFPS; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
};

// ScriptStruct TslGame.WuLogPlayerKicked
// Size: 0x100 (Inherited: 0x60)
struct FWuLogPlayerKicked : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString Reason; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogPlayerLogout
// Size: 0x80 (Inherited: 0x60)
struct FWuLogPlayerLogout : FLogBase {
	struct FString NetId; // 0x60(0x10)
	struct FString AccountId; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogPlayerLogin
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogPlayerLogin : FLogBase {
	struct FString NetId; // 0x60(0x10)
	bool Result; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FString ErrorMessage; // 0x78(0x10)
	struct FString AccountId; // 0x88(0x10)
	struct FString Ip; // 0x98(0x10)
	struct FString ClientVersion; // 0xa8(0x10)
};

// ScriptStruct TslGame.WuLogPlayerCreate
// Size: 0x100 (Inherited: 0x60)
struct FWuLogPlayerCreate : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FString> Equips; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogServerFpsWatchDog
// Size: 0x188 (Inherited: 0x60)
struct FWuLogServerFpsWatchDog : FLogBase {
	struct FString ProfileType; // 0x60(0x10)
	struct FString MatchId; // 0x70(0x10)
	struct FString MapName; // 0x80(0x10)
	struct FString LeagueType; // 0x90(0x10)
	struct FString ModeName; // 0xa0(0x10)
	struct FString CpuName; // 0xb0(0x10)
	int32 RamInGB; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct FString InfraCode; // 0xc8(0x10)
	int32 FrameCount; // 0xd8(0x04)
	int32 SessionElapsedTime; // 0xdc(0x04)
	float MillisecondsPerCycle; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct FWuLogServerFps GameThreadStats; // 0xe8(0xa0)
};

// ScriptStruct TslGame.WuLogServerFps
// Size: 0xa0 (Inherited: 0x00)
struct FWuLogServerFps {
	int64 FrameTime; // 0x00(0x08)
	int64 GameEngineTick; // 0x08(0x08)
	int64 WorldTickTime; // 0x10(0x08)
	int64 TickTime; // 0x18(0x08)
	int64 TG_PrePhysics; // 0x20(0x08)
	int64 TG_EndPhysics; // 0x28(0x08)
	int64 TG_StartPhysics; // 0x30(0x08)
	int64 TG_DuringPhysics; // 0x38(0x08)
	int64 TG_PostPhysics; // 0x40(0x08)
	int64 TG_PostUpdateWork; // 0x48(0x08)
	int64 TG_LastDemotable; // 0x50(0x08)
	int64 NetBroadcastTickTime; // 0x58(0x08)
	int64 NetConnectionTick; // 0x60(0x08)
	int64 NetUpdateUnmappedObjectsTime; // 0x68(0x08)
	int64 QueueTicks; // 0x70(0x08)
	int64 UpdateCameraTime; // 0x78(0x08)
	int64 NetWorldTickTime; // 0x80(0x08)
	int64 GTTickableTime; // 0x88(0x08)
	int64 TickAsyncLoadingGT; // 0x90(0x08)
	int64 DeferredTickTime; // 0x98(0x08)
};

// ScriptStruct TslGame.WuLogServerStat
// Size: 0x90 (Inherited: 0x60)
struct FWuLogServerStat : FLogBase {
	int32 ElapsedTime; // 0x60(0x04)
	int32 NumAliveTeams; // 0x64(0x04)
	int32 NumJoinPlayers; // 0x68(0x04)
	int32 NumStartPlayers; // 0x6c(0x04)
	int32 NumAlivePlayers; // 0x70(0x04)
	float PingMin; // 0x74(0x04)
	float PingMax; // 0x78(0x04)
	float PingAvg; // 0x7c(0x04)
	float FrameRateMin; // 0x80(0x04)
	float FrameRateMax; // 0x84(0x04)
	float FrameRateAvg; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// ScriptStruct TslGame.WuLogGameStatePeriodic
// Size: 0xc0 (Inherited: 0x60)
struct FWuLogGameStatePeriodic : FLogBase {
	struct FWuLogGameState GameState; // 0x60(0x60)
};

// ScriptStruct TslGame.WuLogGameState
// Size: 0x60 (Inherited: 0x00)
struct FWuLogGameState {
	int32 ElapsedTime; // 0x00(0x04)
	int32 NumStartTeams; // 0x04(0x04)
	int32 NumAliveTeams; // 0x08(0x04)
	int32 NumParticipatedTeams; // 0x0c(0x04)
	int32 NumJoinPlayers; // 0x10(0x04)
	int32 NumStartPlayers; // 0x14(0x04)
	int32 NumAlivePlayers; // 0x18(0x04)
	int32 NumParticipatedPlayers; // 0x1c(0x04)
	struct FVector SafetyZonePosition; // 0x20(0x0c)
	float SafetyZoneRadius; // 0x2c(0x04)
	struct FVector PoisonGasWarningPosition; // 0x30(0x0c)
	float PoisonGasWarningRadius; // 0x3c(0x04)
	struct FVector RedZonePosition; // 0x40(0x0c)
	float RedZoneRadius; // 0x4c(0x04)
	struct FVector BlackZonePosition; // 0x50(0x0c)
	float BlackZoneRadius; // 0x5c(0x04)
};

// ScriptStruct TslGame.WuLogMatchRating
// Size: 0x70 (Inherited: 0x60)
struct FWuLogMatchRating : FLogBase {
	struct TArray<struct FWuLogPlayerRating> PlayerRatings; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogPlayerRating
// Size: 0x18 (Inherited: 0x00)
struct FWuLogPlayerRating {
	struct FString AccountId; // 0x00(0x10)
	int32 Rating; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogWeaponAccuracyStats
// Size: 0x70 (Inherited: 0x60)
struct FWuLogWeaponAccuracyStats : FLogBase {
	struct TArray<struct FWuPlayerWeaponStats> Players; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogWeaponChange
// Size: 0x90 (Inherited: 0x60)
struct FWuLogWeaponChange : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString WeaponInHand; // 0x70(0x10)
	struct FString WeaponHolstered; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogMatchEnd
// Size: 0xb0 (Inherited: 0x60)
struct FWuLogMatchEnd : FLogBase {
	struct TArray<struct FWuLogCharacterWeapons> Characters; // 0x60(0x10)
	struct TArray<struct FWuLogRewardDetail> RewardDetail; // 0x70(0x10)
	struct FWuGameFinishedResult GameResultOnFinished; // 0x80(0x10)
	struct TArray<struct FWuWaypointStat> WaypointStats; // 0x90(0x10)
	struct TArray<struct FWuPlayerWeaponStats> AllWeaponStats; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuWaypointStat
// Size: 0x18 (Inherited: 0x00)
struct FWuWaypointStat {
	struct FString UserName; // 0x00(0x10)
	int32 WaypointUsedCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuGameFinishedResult
// Size: 0x10 (Inherited: 0x00)
struct FWuGameFinishedResult {
	struct TArray<struct FWuGameResultPerPlayer> Results; // 0x00(0x10)
};

// ScriptStruct TslGame.WuLogRewardDetail
// Size: 0x38 (Inherited: 0x00)
struct FWuLogRewardDetail {
	struct FString AccountId; // 0x00(0x10)
	struct FWuLogPlayTimeRecord PlayTimeRecord; // 0x10(0x08)
	struct FWuLogBpReward BpReward; // 0x18(0x1c)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct TslGame.WuLogBpReward
// Size: 0x1c (Inherited: 0x00)
struct FWuLogBpReward {
	int32 PlayTime; // 0x00(0x04)
	int32 Ranking; // 0x04(0x04)
	int32 Kill; // 0x08(0x04)
	int32 Damage; // 0x0c(0x04)
	int32 Boosting; // 0x10(0x04)
	int32 RawTotal; // 0x14(0x04)
	int32 BoostedTotal; // 0x18(0x04)
};

// ScriptStruct TslGame.WuLogMatchStart
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogMatchStart : FLogBase {
	struct FString MapName; // 0x60(0x10)
	struct FString WeatherId; // 0x70(0x10)
	struct TArray<struct FWuLogCharacterWeapons> Characters; // 0x80(0x10)
	struct FString CameraViewBehaviour; // 0x90(0x10)
	int32 TeamSize; // 0xa0(0x04)
	bool IsCustomGame; // 0xa4(0x01)
	bool IsEventMode; // 0xa5(0x01)
	bool IsAIMode; // 0xa6(0x01)
	char pad_A7[0x1]; // 0xa7(0x01)
	struct FString BlueZoneCustomOptions; // 0xa8(0x10)
};

// ScriptStruct TslGame.WuLogGasPumpValue
// Size: 0x108 (Inherited: 0x60)
struct FWuLogGasPumpValue : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString Action; // 0xf0(0x10)
	float Value; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogGasPump
// Size: 0x100 (Inherited: 0x60)
struct FWuLogGasPump : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString Action; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogSoftroleBlueChipDetector
// Size: 0x108 (Inherited: 0x60)
struct FWuLogSoftroleBlueChipDetector : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString Action; // 0xf0(0x10)
	float ScanningDistance; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogSoftroleSpotterScopeEnd
// Size: 0x110 (Inherited: 0x60)
struct FWuLogSoftroleSpotterScopeEnd : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString PrimaryWeaponFirst; // 0xf0(0x10)
	struct FString PrimaryWeaponSecond; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogSoftroleSpotterScopeBegin
// Size: 0x110 (Inherited: 0x60)
struct FWuLogSoftroleSpotterScopeBegin : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString PrimaryWeaponFirst; // 0xf0(0x10)
	struct FString PrimaryWeaponSecond; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogSoftroleSpotterScopeMarkDrone
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSoftroleSpotterScopeMarkDrone : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FVector Location; // 0xf0(0x0c)
	float Distance; // 0xfc(0x04)
};

// ScriptStruct TslGame.WuLogSoftroleSpotterScopeMark
// Size: 0x188 (Inherited: 0x60)
struct FWuLogSoftroleSpotterScopeMark : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogCharacter MarkedCharacter; // 0xf0(0x90)
	float Distance; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
};

// ScriptStruct TslGame.WuLogSoftroleTraumaBag
// Size: 0x1d0 (Inherited: 0x60)
struct FWuLogSoftroleTraumaBag : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogCharacter Target; // 0xf0(0x90)
	struct FWuLogItem HealingItem; // 0x180(0x50)
};

// ScriptStruct TslGame.WuLogSoftroleDrone
// Size: 0x158 (Inherited: 0x60)
struct FWuLogSoftroleDrone : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem InventoryItem; // 0xf0(0x50)
	struct FString Action; // 0x140(0x10)
	float FlyingElapsedTime; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
};

// ScriptStruct TslGame.WuLogCharacterCarry
// Size: 0x100 (Inherited: 0x60)
struct FWuLogCharacterCarry : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString CarryState; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogMatchDefinition
// Size: 0x120 (Inherited: 0x60)
struct FWuLogMatchDefinition : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString ModeId; // 0x70(0x10)
	struct FString SubmodeId; // 0x80(0x10)
	struct FString PingQuality; // 0x90(0x10)
	struct FString SeasonState; // 0xa0(0x10)
	struct TArray<struct FWuLogCharacterRating> Ratings; // 0xb0(0x10)
	struct FString DivisionId; // 0xc0(0x10)
	struct FString InstanceId; // 0xd0(0x10)
	struct FString PublicId; // 0xe0(0x10)
	struct FString InstanceType; // 0xf0(0x10)
	struct FString GameServerVersion; // 0x100(0x10)
	struct FString OsPlatform; // 0x110(0x10)
};

// ScriptStruct TslGame.WuLogCharacterRating
// Size: 0x30 (Inherited: 0x00)
struct FWuLogCharacterRating {
	struct FString AccountId; // 0x00(0x10)
	struct FString NetId; // 0x10(0x10)
	int32 MMR; // 0x20(0x04)
	int32 RankPoint; // 0x24(0x04)
	int32 Ping; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.WuLogPhaseChange
// Size: 0x78 (Inherited: 0x60)
struct FWuLogPhaseChange : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FString> PlayersInWhiteCircle; // 0x68(0x10)
};

// ScriptStruct TslGame.WuExitToLobbyData
// Size: 0x18 (Inherited: 0x00)
struct FWuExitToLobbyData {
	struct FString AccountId; // 0x00(0x10)
	bool FromDeathCam; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct TslGame.WuPlayDataResult
// Size: 0x38 (Inherited: 0x00)
struct FWuPlayDataResult {
	struct FString AccountId; // 0x00(0x10)
	bool Result; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString ResultDescription; // 0x18(0x10)
	struct FString PlayData; // 0x28(0x10)
};

// ScriptStruct TslGame.WuChatRestrictStatus
// Size: 0x18 (Inherited: 0x00)
struct FWuChatRestrictStatus {
	bool IsBlocked; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 Reason; // 0x04(0x04)
	struct FString UntilTimeStamp; // 0x08(0x10)
};

// ScriptStruct TslGame.WuDirectMessage
// Size: 0x108 (Inherited: 0x00)
struct FWuDirectMessage {
	int32 Type; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString Message; // 0x08(0x10)
	struct FString LobbyStringKey; // 0x18(0x10)
	struct FWuDirectMessageParameter LobbyMessageParameter; // 0x28(0x10)
	struct FString IngameStringKey; // 0x38(0x10)
	struct TArray<struct FString> IngameMessageParameters; // 0x48(0x10)
	struct FString FromAccountId; // 0x58(0x10)
	struct FString FromNickname; // 0x68(0x10)
	struct FString FromPlatform; // 0x78(0x10)
	struct FString FromClanId; // 0x88(0x10)
	struct FString FromClanTag; // 0x98(0x10)
	int32 FromClanLevel; // 0xa8(0x04)
	bool FromOfflineOrStreamerMode; // 0xac(0x01)
	char pad_AD[0x3]; // 0xad(0x03)
	struct FString ToAccountId; // 0xb0(0x10)
	struct FString ToNickname; // 0xc0(0x10)
	struct FString ToPlatform; // 0xd0(0x10)
	struct FString ToClanId; // 0xe0(0x10)
	struct FString ToClanTag; // 0xf0(0x10)
	int32 ToClanLevel; // 0x100(0x04)
	int32 ToComplimentType; // 0x104(0x04)
};

// ScriptStruct TslGame.WuDirectMessageParameter
// Size: 0x10 (Inherited: 0x00)
struct FWuDirectMessageParameter {
	struct TArray<struct FWuNicknamePlatformData> MatchWinUsers; // 0x00(0x10)
};

// ScriptStruct TslGame.WuNicknamePlatformData
// Size: 0x20 (Inherited: 0x00)
struct FWuNicknamePlatformData {
	struct FString Nickname; // 0x00(0x10)
	struct FString Platform; // 0x10(0x10)
};

// ScriptStruct TslGame.WuMissionProgressUpdateData
// Size: 0x10 (Inherited: 0x00)
struct FWuMissionProgressUpdateData {
	struct TArray<struct FWuStringIntPair> Updates; // 0x00(0x10)
};

// ScriptStruct TslGame.WuPrepareUsersResult
// Size: 0x10 (Inherited: 0x00)
struct FWuPrepareUsersResult {
	struct TArray<struct FString> AccountIds; // 0x00(0x10)
};

// ScriptStruct TslGame.WuGameStartInfo
// Size: 0x10 (Inherited: 0x00)
struct FWuGameStartInfo {
	struct TArray<struct FWuGameStartInfoPerPlayer> Players; // 0x00(0x10)
};

// ScriptStruct TslGame.WuGameStartInfoPerPlayer
// Size: 0x20 (Inherited: 0x00)
struct FWuGameStartInfoPerPlayer {
	struct FString PlayerNetId; // 0x00(0x10)
	struct FString AccountId; // 0x10(0x10)
};

// ScriptStruct TslGame.WuGameInitializedResult
// Size: 0x08 (Inherited: 0x00)
struct FWuGameInitializedResult {
	bool IsSuccess; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 Port; // 0x04(0x04)
};

// ScriptStruct TslGame.WuGameStartRequest
// Size: 0x10 (Inherited: 0x00)
struct FWuGameStartRequest {
	struct TArray<struct FWuStringStringPair> StringParameters; // 0x00(0x10)
};

// ScriptStruct TslGame.WuGameOverrideParameterRequest
// Size: 0x20 (Inherited: 0x00)
struct FWuGameOverrideParameterRequest {
	struct FString MatchId; // 0x00(0x10)
	struct TArray<struct FWuStringStringPair> StringParameters; // 0x10(0x10)
};

// ScriptStruct TslGame.WuGameInitializeRequest
// Size: 0x58 (Inherited: 0x00)
struct FWuGameInitializeRequest {
	bool IsCustomGame; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString MapName; // 0x08(0x10)
	struct FString MatchId; // 0x18(0x10)
	struct FString ModeName; // 0x28(0x10)
	int32 TeamCount; // 0x38(0x04)
	int32 MinPlayerCount; // 0x3c(0x04)
	int32 MaxPlayerCount; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct FWuStringStringPair> StringParameters; // 0x48(0x10)
};

// ScriptStruct TslGame.WuUserAuthInfo
// Size: 0x248 (Inherited: 0x00)
struct FWuUserAuthInfo {
	struct FString PlayerNetId; // 0x00(0x10)
	int32 TeamId; // 0x10(0x04)
	int32 TeamMemberIndex; // 0x14(0x04)
	int32 SquadIndex; // 0x18(0x04)
	struct FWuMatchRating Rating; // 0x1c(0x08)
	bool IsZombie; // 0x24(0x01)
	bool IsMaster; // 0x25(0x01)
	char pad_26[0x2]; // 0x26(0x02)
	struct FWuCharacterInfo CharacterInfo; // 0x28(0x130)
	int32 Platform; // 0x158(0x04)
	bool IsStreamerModeOn; // 0x15c(0x01)
	char pad_15D[0x3]; // 0x15d(0x03)
	struct FString PartnerLevel; // 0x160(0x10)
	int32 ObserverAuthorityType; // 0x170(0x04)
	bool BattlEyeDisabled; // 0x174(0x01)
	bool AceAntibotDisabled; // 0x175(0x01)
	bool IsSuspect; // 0x176(0x01)
	bool DisallowVoiceChat; // 0x177(0x01)
	bool IsBypassAnticheat; // 0x178(0x01)
	bool IsAvatarBanned; // 0x179(0x01)
	char pad_17A[0x2]; // 0x17a(0x02)
	int32 AcVerificationScore; // 0x17c(0x04)
	struct FString AccountId; // 0x180(0x10)
	int32 v1; // 0x190(0x04)
	int32 v2; // 0x194(0x04)
	int32 V3; // 0x198(0x04)
	int32 V4; // 0x19c(0x04)
	struct FWuUdpEncryptionKey UdpEncryptionKey; // 0x1a0(0x30)
	struct TArray<struct FWuStringStringPair> CustomParameters; // 0x1d0(0x10)
	float BpBoost; // 0x1e0(0x04)
	float XpBoost; // 0x1e4(0x04)
	float CurrentDailyXp; // 0x1e8(0x04)
	bool IsMaxLevel; // 0x1ec(0x01)
	bool IsPCCafeUser; // 0x1ed(0x01)
	char pad_1EE[0x2]; // 0x1ee(0x02)
	struct TArray<struct FWuStringIntPair> StatTrakDataPairs; // 0x1f0(0x10)
	struct TArray<struct FWuStringIntPair> HeadshotStatTrakDataPairs; // 0x200(0x10)
	struct FWuLobbyPartyInfo LobbyPartyInfo; // 0x210(0x28)
	struct TArray<struct FString> TdmSpawnKitIds; // 0x238(0x10)
};

// ScriptStruct TslGame.WuLobbyPartyInfo
// Size: 0x28 (Inherited: 0x00)
struct FWuLobbyPartyInfo {
	struct FString PartyId; // 0x00(0x10)
	struct FString PartyLeaderId; // 0x10(0x10)
	int32 PartySize; // 0x20(0x04)
	bool AllowAnyMember; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
};

// ScriptStruct TslGame.WuUdpEncryptionKey
// Size: 0x30 (Inherited: 0x00)
struct FWuUdpEncryptionKey {
	struct FString Key; // 0x00(0x10)
	struct FString ServerIV; // 0x10(0x10)
	struct FString ClientIV; // 0x20(0x10)
};

// ScriptStruct TslGame.WuCharacterInfo
// Size: 0x130 (Inherited: 0x00)
struct FWuCharacterInfo {
	struct FString Nickname; // 0x00(0x10)
	bool Gender; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FWuCharacterCustomizationOptions CustomizationOptions; // 0x18(0x60)
	struct FWuCharacterWeaponMasteryInfo WeaponMasteryInfo; // 0x78(0x10)
	struct FWuCharacterClanInfo ClanInfo; // 0x88(0x38)
	struct FWuPubgIdData PubgIdData; // 0xc0(0x58)
	struct TArray<struct FWuCustomizationPresetInfo> CustomizationPresetInfos; // 0x118(0x10)
	int32 PresetIndex; // 0x128(0x04)
	char pad_12C[0x4]; // 0x12c(0x04)
};

// ScriptStruct TslGame.WuCustomizationPresetInfo
// Size: 0x18 (Inherited: 0x00)
struct FWuCustomizationPresetInfo {
	struct TArray<struct FString> ItemIDs; // 0x00(0x10)
	bool IsUnlocked; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct TslGame.WuPubgIdData
// Size: 0x58 (Inherited: 0x00)
struct FWuPubgIdData {
	int32 SurvivalTier; // 0x00(0x04)
	int32 SurvivalLevel; // 0x04(0x04)
	struct FString NameplateId; // 0x08(0x10)
	struct FString EmblemId; // 0x18(0x10)
	struct FString MedalOne; // 0x28(0x10)
	struct FString MedalTwo; // 0x38(0x10)
	struct FString ClanplateId; // 0x48(0x10)
};

// ScriptStruct TslGame.WuCharacterClanInfo
// Size: 0x38 (Inherited: 0x00)
struct FWuCharacterClanInfo {
	struct FString ClanId; // 0x00(0x10)
	struct FString ClanName; // 0x10(0x10)
	struct FString ClanTag; // 0x20(0x10)
	int32 ClanLevel; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct TslGame.WuCharacterWeaponMasteryInfo
// Size: 0x10 (Inherited: 0x00)
struct FWuCharacterWeaponMasteryInfo {
	struct TArray<struct FWuStringIntPair> WeaponMasteryTiers; // 0x00(0x10)
};

// ScriptStruct TslGame.WuCharacterCustomizationOptions
// Size: 0x60 (Inherited: 0x00)
struct FWuCharacterCustomizationOptions {
	struct TArray<struct FWuStringBoolPair> BoolOptions; // 0x00(0x10)
	struct TArray<struct FWuStringFloatPair> FloatOptions; // 0x10(0x10)
	struct TArray<struct FWuStringStringPair> StringOptions; // 0x20(0x10)
	struct TArray<struct FString> ItemIDs; // 0x30(0x10)
	struct FString ActionSlots; // 0x40(0x10)
	struct TArray<struct FString> IngameEquipableItemIds; // 0x50(0x10)
};

// ScriptStruct TslGame.WuStringBoolPair
// Size: 0x18 (Inherited: 0x00)
struct FWuStringBoolPair {
	struct FString First; // 0x00(0x10)
	bool second; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct TslGame.WuMatchRating
// Size: 0x08 (Inherited: 0x00)
struct FWuMatchRating {
	int32 RankPoint; // 0x00(0x04)
	int32 MMR; // 0x04(0x04)
};

// ScriptStruct TslGame.WuTeamInfo
// Size: 0x38 (Inherited: 0x00)
struct FWuTeamInfo {
	int32 TeamId; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FString> AccountIds; // 0x08(0x10)
	struct TArray<int32> TeamMemberIndices; // 0x18(0x10)
	struct TArray<int32> SquadIndices; // 0x28(0x10)
};

// ScriptStruct TslGame.WuPubgIdClanplateData
// Size: 0x70 (Inherited: 0x00)
struct FWuPubgIdClanplateData {
	struct FString ID; // 0x00(0x10)
	struct FString TopColor; // 0x10(0x10)
	struct FString BottomColor; // 0x20(0x10)
	struct FString IngameImagePath; // 0x30(0x10)
	struct FString IngameImagePathLD; // 0x40(0x10)
	struct FString OutgameImagePath; // 0x50(0x10)
	struct FString OutgameImagePathLD; // 0x60(0x10)
};

// ScriptStruct TslGame.WuPubgIdMedalData
// Size: 0x60 (Inherited: 0x00)
struct FWuPubgIdMedalData {
	struct FString ID; // 0x00(0x10)
	struct FString IngameImagePath; // 0x10(0x10)
	struct FString OutgameImagePathFHD; // 0x20(0x10)
	struct FString OutgameImagePathFHDLarge; // 0x30(0x10)
	struct FString OutgameImagePathUHD; // 0x40(0x10)
	struct FString OutgameImagePathUHDLarge; // 0x50(0x10)
};

// ScriptStruct TslGame.WuPubgIdNameplateData
// Size: 0x80 (Inherited: 0x00)
struct FWuPubgIdNameplateData {
	struct FString ID; // 0x00(0x10)
	bool IsAnim; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float AnimLengthSec; // 0x14(0x04)
	int32 AnimFrameCount; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FString IngameImagePath; // 0x20(0x10)
	struct FString OutgameImagePath; // 0x30(0x10)
	struct FString IngameAnimPathPC; // 0x40(0x10)
	struct FString IngameAnimPathConsole; // 0x50(0x10)
	struct FString IngameAnimPathStadia; // 0x60(0x10)
	struct FString OutgameAnimPath; // 0x70(0x10)
};

// ScriptStruct TslGame.WuPubgIdEmblemData
// Size: 0x78 (Inherited: 0x00)
struct FWuPubgIdEmblemData {
	struct FString ID; // 0x00(0x10)
	bool IsAnim; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float AnimLengthSec; // 0x14(0x04)
	int32 AnimFrameCountX; // 0x18(0x04)
	int32 AnimFrameCountY; // 0x1c(0x04)
	struct FString IngameImagePath; // 0x20(0x10)
	struct FString OutgameImagePath; // 0x30(0x10)
	struct FString OutgameImagePathFHD; // 0x40(0x10)
	struct FString IngameAnimPath; // 0x50(0x10)
	struct FString OutgameAnimPath; // 0x60(0x10)
	float IntervalLengthSec; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuUnrealPlayerCard
// Size: 0x1d8 (Inherited: 0x00)
struct FWuUnrealPlayerCard {
	int32 CurrentLevel; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString PrimaryBackgroundColor; // 0x08(0x10)
	struct FString BackgroundId; // 0x18(0x10)
	struct FString EmblemId; // 0x28(0x10)
	struct FString BannerId; // 0x38(0x10)
	int32 OriginType; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct FString NetId; // 0x50(0x10)
	struct FWuUnrealPlayerCardStat Slot1; // 0x60(0x70)
	struct FWuUnrealPlayerCardStat Slot2; // 0xd0(0x70)
	struct FWuUnrealPlayerCardStat Slot3; // 0x140(0x70)
	struct FWuUnrealPlayerCardRankPointData RankPoint; // 0x1b0(0x28)
};

// ScriptStruct TslGame.WuUnrealPlayerCardRankPointData
// Size: 0x28 (Inherited: 0x00)
struct FWuUnrealPlayerCardRankPointData {
	int32 RankPoints; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString Tier; // 0x08(0x10)
	struct FString SubTier; // 0x18(0x10)
};

// ScriptStruct TslGame.WuUnrealPlayerCardStat
// Size: 0x70 (Inherited: 0x00)
struct FWuUnrealPlayerCardStat {
	struct FString IconId; // 0x00(0x10)
	struct FString Title; // 0x10(0x10)
	struct FString TitleArg; // 0x20(0x10)
	struct FString Subtitle; // 0x30(0x10)
	struct FString SubtitleArg; // 0x40(0x10)
	struct FString Value; // 0x50(0x10)
	struct FString ValueArg; // 0x60(0x10)
};

// ScriptStruct TslGame.WuCustomizableObjectIdPair
// Size: 0x20 (Inherited: 0x00)
struct FWuCustomizableObjectIdPair {
	struct FString CustomizableObjectKey; // 0x00(0x10)
	struct FString CustomizableObjectValue; // 0x10(0x10)
};

// ScriptStruct TslGame.*5f1c1cb261
// Size: 0x78 (Inherited: 0x00)
struct F*5f1c1cb261 {
	struct TArray<struct FString> *a5c2a2e715; // 0x00(0x10)
	struct TArray<struct FString> *50e5c83b9a; // 0x10(0x10)
	struct TArray<struct FString> *08232f8215; // 0x20(0x10)
	struct TArray<bool> *4c8fbe84c2; // 0x30(0x10)
	struct TArray<struct FString> *6804350a7e; // 0x40(0x10)
	struct TArray<float> *3588733267; // 0x50(0x10)
	struct TArray<struct FString> *c8463f7c6e; // 0x60(0x10)
	bool *10211981bb; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// ScriptStruct TslGame.*f33c65a144
// Size: 0x10 (Inherited: 0x00)
struct F*f33c65a144 {
	struct UClass* *3b45d05722; // 0x00(0x08)
	float *f57a5c48f8; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*05fad71403
// Size: 0x410 (Inherited: 0x268)
struct F*05fad71403 : F*7700dab07d {
	enum class EEquipSlotID EquipSlotID; // 0x268(0x01)
	char pad_269[0x3]; // 0x269(0x03)
	float SpaceExtension; // 0x26c(0x04)
	float DamageReductionRate; // 0x270(0x04)
	float DurabilityMax; // 0x274(0x04)
	bool DestroyByDurability; // 0x278(0x01)
	char pad_279[0x3]; // 0x279(0x03)
	float Durability; // 0x27c(0x04)
	enum class *cff03327dd DurabilityConsumeType; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	float DamageTransferRate; // 0x284(0x04)
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForMale; // 0x288(0x30)
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForFemale; // 0x2b8(0x30)
	struct F*54424d3e0d CustomizableObjectOriginalSkin; // 0x2e8(0x20)
	struct UAkAudioEvent* EquipedSoundAk; // 0x308(0x20)
	struct UAkAudioEvent* BlueBlockerEnterBlueZoneSoundAk; // 0x328(0x20)
	struct UAkAudioEvent* BlueBlockerExitBlueZoneSoundAk; // 0x348(0x20)
	struct UAkAudioEvent* BlueBlockerLowHealthSoundAk; // 0x368(0x20)
	struct UAkAudioEvent* BlueBlockerNoHealthSoundAk; // 0x388(0x20)
	float BlueBlockerLowHealthThreshold; // 0x3a8(0x04)
	enum class EEquipableItemSoundGroup SoundGroup; // 0x3ac(0x01)
	enum class EEquipableItemSoundType SoundType; // 0x3ad(0x01)
	bool bCanZombieEquip; // 0x3ae(0x01)
	enum class *6333d4d051 SlotOffsetType; // 0x3af(0x01)
	struct FName SkinTag; // 0x3b0(0x08)
	bool bDisableEquipmentSkinning; // 0x3b8(0x01)
	bool bDisableSkinMessages; // 0x3b9(0x01)
	bool bDisableMasteryMessages; // 0x3ba(0x01)
	enum class EEquipableItemLevelType EquipableItemLevelType; // 0x3bb(0x01)
	bool bIsUnequipable; // 0x3bc(0x01)
	enum class ESpecialEquipmentType SpecialEquipmentType; // 0x3bd(0x01)
	char pad_3BE[0x2]; // 0x3be(0x02)
	struct UTexture* HudDisplayEquipIcon; // 0x3c0(0x20)
	struct TArray<struct F*84dd4e8338> ConstraintSlotConfigs; // 0x3e0(0x10)
	struct TArray<struct F*f33c65a144> *9c6155f0fd; // 0x3f0(0x10)
	struct FName EquipmentOverridableFilter; // 0x400(0x08)
	bool bIsHoody; // 0x408(0x01)
	bool bIsGhillieSuit; // 0x409(0x01)
	bool bIsTacticalGear; // 0x40a(0x01)
	char pad_40B[0x5]; // 0x40b(0x05)
};

// ScriptStruct TslGame.*6c9069fdf6
// Size: 0x08 (Inherited: 0x00)
struct F*6c9069fdf6 {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*69b4ade8ce
// Size: 0xd0 (Inherited: 0x00)
struct F*69b4ade8ce {
	struct FInt32Range RowRange; // 0x00(0x10)
	struct FFloatRange CapsuleRelativeRange; // 0x10(0x10)
	struct FFloatRange SpeedRange; // 0x20(0x10)
	struct FFloatRange ZSpeedRange; // 0x30(0x10)
	struct FInt32Range LedgeRange; // 0x40(0x10)
	struct FInt32Range FreeSpaceRange; // 0x50(0x10)
	enum class *9580d72ff7 IsVault; // 0x60(0x01)
	enum class *9580d72ff7 IsClimb; // 0x61(0x01)
	enum class *9580d72ff7 IsLedgeGrab; // 0x62(0x01)
	enum class *9580d72ff7 IsSlide; // 0x63(0x01)
	enum class *9580d72ff7 IsNarrow; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct F*a64f846500 ExecConfig; // 0x68(0x68)
};

// ScriptStruct TslGame.*a64f846500
// Size: 0x68 (Inherited: 0x00)
struct F*a64f846500 {
	float ExecutionDistance; // 0x00(0x04)
	float AnticipationDistance; // 0x04(0x04)
	struct FVector2D AnticipationMapIn; // 0x08(0x08)
	struct FVector2D AnticipationMapOut; // 0x10(0x08)
	float MinExecutionDOT; // 0x18(0x04)
	bool bUseAnimStartForDistance; // 0x1c(0x01)
	bool bUse3DDistance; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
	struct FFloatRange ExecutionZRange; // 0x20(0x10)
	bool bUseAnticipationAnim; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UAnimSequenceBase* AnticipationAnim; // 0x38(0x08)
	struct UCurveFloat* AnticipationAnimCurve; // 0x40(0x08)
	char pad_48[0x20]; // 0x48(0x20)
};

// ScriptStruct TslGame.*3b7abc98c2
// Size: 0x68 (Inherited: 0x00)
struct F*3b7abc98c2 {
	struct FVector V_Start; // 0x00(0x0c)
	struct FVector V_Apex; // 0x0c(0x0c)
	struct FVector V_ApexAdditive; // 0x18(0x0c)
	struct FVector V_End; // 0x24(0x0c)
	enum class EVaultAnimType InVaultType; // 0x30(0x01)
	bool bEndToFall; // 0x31(0x01)
	bool bForceCrouch; // 0x32(0x01)
	char pad_33[0x1]; // 0x33(0x01)
	float Direction; // 0x34(0x04)
	float PlayerSpeed; // 0x38(0x04)
	float DistanceFromObject; // 0x3c(0x04)
	float AdditiveEndZOffset; // 0x40(0x04)
	struct UPrimitiveComponent* BaseComp; // 0x44(0x08)
	struct FVector BaseWorldLoc; // 0x4c(0x0c)
	struct FRotator BaseWorldDir; // 0x58(0x0c)
	char pad_64[0x4]; // 0x64(0x04)
};

// ScriptStruct TslGame.*cb263fbb34
// Size: 0x40 (Inherited: 0x00)
struct F*cb263fbb34 {
	char pad_0[0x28]; // 0x00(0x28)
	bool *1b4532240e[0x14]; // 0x28(0x14)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct TslGame.*ae59b13808
// Size: 0x18 (Inherited: 0x00)
struct F*ae59b13808 {
	int64 *97f5177191; // 0x00(0x08)
	float *ca832e01ed; // 0x08(0x04)
	float *ff2aefc15b; // 0x0c(0x04)
	enum class EAnimStance *51379cdc22; // 0x10(0x01)
	bool *b176fb8f73; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
};

// ScriptStruct TslGame.*71999aba31
// Size: 0x38 (Inherited: 0x00)
struct F*71999aba31 {
	char pad_0[0x38]; // 0x00(0x38)
};

// ScriptStruct TslGame.*14154ffa9f
// Size: 0x10 (Inherited: 0x00)
struct F*14154ffa9f {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct TslGame.StringArray
// Size: 0x10 (Inherited: 0x00)
struct FStringArray {
	struct TArray<struct FString> StringArray; // 0x00(0x10)
};

// ScriptStruct TslGame.*2ae4908591
// Size: 0x90 (Inherited: 0x38)
struct F*2ae4908591 : F*9e214c1516 {
	struct UAkComponent* *e052a73669; // 0x38(0x08)
	struct TArray<struct F*a2f25b7fb1> *327c60e60f; // 0x40(0x10)
	struct TArray<struct F*74c5e96ef7> AnimNotifyList; // 0x50(0x10)
	struct TArray<struct F*74c5e96ef7> *33400d8447; // 0x60(0x10)
	char pad_70[0x20]; // 0x70(0x20)
};

// ScriptStruct TslGame.*9e214c1516
// Size: 0x38 (Inherited: 0x00)
struct F*9e214c1516 {
	struct ATslCharacter* Character; // 0x00(0x08)
	char pad_8[0x30]; // 0x08(0x30)
};

// ScriptStruct TslGame.*74c5e96ef7
// Size: 0x30 (Inherited: 0x00)
struct F*74c5e96ef7 {
	struct UAnimSequenceBase* *57c6fdf509; // 0x00(0x08)
	char pad_8[0x28]; // 0x08(0x28)
};

// ScriptStruct TslGame.*a2f25b7fb1
// Size: 0x40 (Inherited: 0x00)
struct F*a2f25b7fb1 {
	struct ATslWeapon* Weapon; // 0x00(0x08)
	struct UClass* *4cea20a818; // 0x08(0x08)
	struct UAkComponent* AkComponent; // 0x10(0x08)
	char pad_18[0x28]; // 0x18(0x28)
};

// ScriptStruct TslGame.*8ab237906e
// Size: 0x50 (Inherited: 0x38)
struct F*8ab237906e : F*9e214c1516 {
	struct ATslWeapon* *c4544beb8a; // 0x38(0x08)
	char pad_40[0x10]; // 0x40(0x10)
};

// ScriptStruct TslGame.*0067d234a3
// Size: 0x2c (Inherited: 0x00)
struct F*0067d234a3 {
	char pad_0[0x2c]; // 0x00(0x2c)
};

// ScriptStruct TslGame.*4985d0f82e
// Size: 0x10 (Inherited: 0x00)
struct F*4985d0f82e {
	struct TArray<bool> Data; // 0x00(0x10)
};

// ScriptStruct TslGame.*668d12d313
// Size: 0x30 (Inherited: 0x00)
struct F*668d12d313 {
	float *1d46c446a7; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FVector2D> *9a464e83c7; // 0x08(0x10)
	float *55a036c8ac; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct TArray<struct FVector2D> *40ef888177; // 0x20(0x10)
};

// ScriptStruct TslGame.*edab99c582
// Size: 0x10 (Inherited: 0x00)
struct F*edab99c582 {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct TslGame.*e299e50fad
// Size: 0x308 (Inherited: 0x00)
struct F*e299e50fad {
	char pad_0[0x308]; // 0x00(0x308)
};

// ScriptStruct TslGame.*b26298f6ff
// Size: 0x18 (Inherited: 0x00)
struct F*b26298f6ff {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*fcb171b1f2
// Size: 0x28 (Inherited: 0x00)
struct F*fcb171b1f2 {
	struct TArray<struct F*f7684aee55> *c5d1870bd0; // 0x00(0x10)
	struct TArray<uint16> *3f26a939b5; // 0x10(0x10)
	float *ea0c434750; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.*f7684aee55
// Size: 0x06 (Inherited: 0x00)
struct F*f7684aee55 {
	int16 *336fefe792; // 0x00(0x02)
	int16 *1c005f38a8; // 0x02(0x02)
	uint16 *0369dbad91; // 0x04(0x02)
};

// ScriptStruct TslGame.*0db54e8350
// Size: 0x10 (Inherited: 0x00)
struct F*0db54e8350 {
	struct UObject* Target; // 0x00(0x08)
	char pad_8[0x8]; // 0x08(0x08)
};

// ScriptStruct TslGame.*a994a6f658
// Size: 0x7b0 (Inherited: 0x00)
struct F*a994a6f658 {
	char pad_0[0x7b0]; // 0x00(0x7b0)
};

// ScriptStruct TslGame.*0ec96d8b15
// Size: 0x770 (Inherited: 0x00)
struct F*0ec96d8b15 {
	struct FVector Start; // 0x00(0x0c)
	struct FVector End; // 0x0c(0x0c)
	struct FVector Apex; // 0x18(0x0c)
	struct FVector ApexAdditive; // 0x24(0x0c)
	float Direction; // 0x30(0x04)
	float PlayerSpeed2D; // 0x34(0x04)
	float DistanceFromObject; // 0x38(0x04)
	float AdditiveEndZOffset; // 0x3c(0x04)
	enum class EVaultAnimType VaultType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32 MoveIndex; // 0x44(0x04)
	char bIsPassed : 1; // 0x48(0x01)
	char bIsClimbing : 1; // 0x48(0x01)
	char bIsEndToFall : 1; // 0x48(0x01)
	char bForceCrouch : 1; // 0x48(0x01)
	char pad_48_4 : 4; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct F*a64f846500 ExecConfig; // 0x50(0x68)
	struct F*6cba55a5b1 HitData; // 0xb8(0x6b8)
};

// ScriptStruct TslGame.*6cba55a5b1
// Size: 0x6b8 (Inherited: 0x00)
struct F*6cba55a5b1 {
	char pad_0[0x6b8]; // 0x00(0x6b8)
};

// ScriptStruct TslGame.*ea77c433f3
// Size: 0x68 (Inherited: 0x00)
struct F*ea77c433f3 {
	struct FVector ImpactLocation; // 0x00(0x0c)
	struct FVector CapsulePredictedLocation; // 0x0c(0x0c)
	struct FVector CapsuleImpactLocation; // 0x18(0x0c)
	struct FVector Normal2D; // 0x24(0x0c)
	struct FVector DirectionVector; // 0x30(0x0c)
	float JumpDistance; // 0x3c(0x04)
	char bIsForceVault : 1; // 0x40(0x01)
	char bIsBlockVault : 1; // 0x40(0x01)
	char bIsBlockClimb : 1; // 0x40(0x01)
	char bIsLedgeGrab : 1; // 0x40(0x01)
	char pad_40_4 : 4; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32 FirstRow; // 0x44(0x04)
	struct FVector ImpactVelocity; // 0x48(0x0c)
	int32 RowOffset; // 0x54(0x04)
	float NormalSampleDotThreshold; // 0x58(0x04)
	struct FVector CharacterVelocity; // 0x5c(0x0c)
};

// ScriptStruct TslGame.*7bdc46148f
// Size: 0x48 (Inherited: 0x00)
struct F*7bdc46148f {
	uint16 *213815d2f5; // 0x00(0x02)
	char pad_2[0x2]; // 0x02(0x02)
	struct FVector Position; // 0x04(0x0c)
	struct FRotator Rotation; // 0x10(0x0c)
	struct FVector Velocity; // 0x1c(0x0c)
	struct F*eacd751240 InputData; // 0x28(0x20)
};

// ScriptStruct TslGame.*eacd751240
// Size: 0x20 (Inherited: 0x00)
struct F*eacd751240 {
	float *a3950d9449; // 0x00(0x04)
	float *0ed2474caf; // 0x04(0x04)
	float *e68fe73d74; // 0x08(0x04)
	float *d1e66ab43f; // 0x0c(0x04)
	bool *a97a1c5884; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float *4bcbfa102a; // 0x14(0x04)
	float *9b5d071983; // 0x18(0x04)
	float *8d6d74ee64; // 0x1c(0x04)
};

// ScriptStruct TslGame.*f920ba1621
// Size: 0x28 (Inherited: 0x00)
struct F*f920ba1621 {
	float *3d2edfaf7d; // 0x00(0x04)
	float *e1a3edaa32; // 0x04(0x04)
	float *86e867eff5; // 0x08(0x04)
	struct FVector2D *ce47fefeff; // 0x0c(0x08)
	struct FVector2D *84fae9e3a0; // 0x14(0x08)
	float *4f823cd34d; // 0x1c(0x04)
	float *a4311ad560; // 0x20(0x04)
	float *fb04a80f30; // 0x24(0x04)
};

// ScriptStruct TslGame.*e9996296b5
// Size: 0x24 (Inherited: 0x00)
struct F*e9996296b5 {
	struct FVector LocalOffset; // 0x00(0x0c)
	float *a5743f5f27; // 0x0c(0x04)
	struct F*aa4c0b994c *889d3bcc58; // 0x10(0x14)
};

// ScriptStruct TslGame.*aa4c0b994c
// Size: 0x14 (Inherited: 0x00)
struct F*aa4c0b994c {
	bool *0588136531; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Radius; // 0x04(0x04)
	struct FVector Extent; // 0x08(0x0c)
};

// ScriptStruct TslGame.*af81b12efd
// Size: 0x80 (Inherited: 0x00)
struct F*af81b12efd {
	float *9b19a0ead3; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UAkAudioEvent* *6d32c6acec; // 0x08(0x08)
	struct UAkAudioEvent* *34aae5743e; // 0x10(0x08)
	struct UAkAudioEvent* *a2be4f1b43; // 0x18(0x08)
	struct UAkAudioEvent* *68b01a4dc0; // 0x20(0x08)
	struct FName *4b60d2324e; // 0x28(0x08)
	struct FName *9cc149a1c4; // 0x30(0x08)
	struct FName *bd7e233fbf; // 0x38(0x08)
	struct FName *86b24d9662; // 0x40(0x08)
	struct FName *3889c351b0; // 0x48(0x08)
	struct FName *46feccbcfe; // 0x50(0x08)
	struct FName *2e4058e770; // 0x58(0x08)
	float *3125c969ca; // 0x60(0x04)
	float *6e61e122b4; // 0x64(0x04)
	float *1a2cd35188; // 0x68(0x04)
	float *d667731d72; // 0x6c(0x04)
	float *3f33bcb84a; // 0x70(0x04)
	float *396cf21d3e; // 0x74(0x04)
	float *2661652112; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct TslGame.*0edcff3fd9
// Size: 0x48 (Inherited: 0x00)
struct F*0edcff3fd9 {
	bool *c138e1b617; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D *a0fb860c5e; // 0x04(0x08)
	struct FVector2D *4e5f667ae8; // 0x0c(0x08)
	struct FVector2D *340b2469c9; // 0x14(0x08)
	struct FVector2D *cd3b1882c7; // 0x1c(0x08)
	struct FVector2D *8395fa85f2; // 0x24(0x08)
	struct FVector2D *344788ce61; // 0x2c(0x08)
	char pad_34[0x4]; // 0x34(0x04)
	struct UClass* *271a14efcc; // 0x38(0x08)
	float *4597ae7cf5; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// ScriptStruct TslGame.*de6b26076e
// Size: 0x18 (Inherited: 0x00)
struct F*de6b26076e {
	struct TArray<struct F*fd3d304ef3> *fbff660b4b; // 0x00(0x10)
	struct UAnimMontage* *9482352d47; // 0x10(0x08)
};

// ScriptStruct TslGame.*fd3d304ef3
// Size: 0x30 (Inherited: 0x00)
struct F*fd3d304ef3 {
	enum class *72f4731af1 *6f1cdb8455; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *3fe0c654bf; // 0x04(0x04)
	struct UAnimMontage* *85a81250e1; // 0x08(0x08)
	struct UAnimMontage* *4a4bd3298e; // 0x10(0x08)
	bool *7b4cddab64; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float *7a37a7e061; // 0x1c(0x04)
	struct UAnimMontage* *cb8ff5640c; // 0x20(0x08)
	struct FName *03003b498a; // 0x28(0x08)
};

// ScriptStruct TslGame.*b5fd971557
// Size: 0x50 (Inherited: 0x00)
struct F*b5fd971557 {
	float *51184cafa7; // 0x00(0x04)
	float *d7843644d5; // 0x04(0x04)
	float *f632cbf918; // 0x08(0x04)
	bool *93bb4295fb; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float *4e3be21c15; // 0x10(0x04)
	bool *cebf30103a; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	float *d323371f59; // 0x18(0x04)
	struct FVector *1a46681306; // 0x1c(0x0c)
	float *6c3c1a9828; // 0x28(0x04)
	float *aa94bfa22b; // 0x2c(0x04)
	float *6a9649867f; // 0x30(0x04)
	bool *8e7dc604cd; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct FVector *fc4ce11f23; // 0x38(0x0c)
	bool *adc09e1807; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float *2d64f65b69; // 0x48(0x04)
	float *436965a504; // 0x4c(0x04)
};

// ScriptStruct TslGame.*fb17e4135f
// Size: 0x58 (Inherited: 0x00)
struct F*fb17e4135f {
	struct UParticleSystem* *7ed3cf3a0f; // 0x00(0x08)
	struct UParticleSystem* *bfaa357516; // 0x08(0x08)
	struct FVector2D *5d4ca15786; // 0x10(0x08)
	struct FVector2D *1456c3f6ee; // 0x18(0x08)
	struct FVector2D *3f6cf944c5; // 0x20(0x08)
	struct FVector2D *669afeb3b2; // 0x28(0x08)
	struct FVector2D *29584aa409; // 0x30(0x08)
	struct FVector2D *844daa6a6b; // 0x38(0x08)
	struct UClass* *ee960d73c9; // 0x40(0x08)
	struct UClass* *be87881760; // 0x48(0x08)
	struct U*59a0aeaef9* *5889cd484a; // 0x50(0x08)
};

// ScriptStruct TslGame.ParachuteDeploySettings
// Size: 0x14 (Inherited: 0x00)
struct FParachuteDeploySettings {
	bool bUseAutoDeploy; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float AutoDeployAltitude; // 0x04(0x04)
	bool bUseAbsoluteAutoDeployAltitude; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float StartDeployAltitude; // 0x0c(0x04)
	float *d0608cd7e0; // 0x10(0x04)
};

// ScriptStruct TslGame.*3374b65a68
// Size: 0xc0 (Inherited: 0x00)
struct F*3374b65a68 {
	float *94905f6bfe; // 0x00(0x04)
	struct FVector *e841d39a60; // 0x04(0x0c)
	float *449da725ce; // 0x10(0x04)
	float *8ba9ebf32d; // 0x14(0x04)
	float *1d96331ef1; // 0x18(0x04)
	float *3fd84a37f3; // 0x1c(0x04)
	float *89de360499; // 0x20(0x04)
	float *9d7dc2e43c; // 0x24(0x04)
	float *e66d625bc5; // 0x28(0x04)
	float *b9640a00f1; // 0x2c(0x04)
	float *367b270339; // 0x30(0x04)
	float *f6bad803fa; // 0x34(0x04)
	struct FVector CapsuleOffset; // 0x38(0x0c)
	char pad_44[0x4]; // 0x44(0x04)
	struct USkeletalMesh* ParachuteSK; // 0x48(0x08)
	struct UClass* *8dbe9249eb; // 0x50(0x08)
	struct FRotator *f69678fb42; // 0x58(0x0c)
	char pad_64[0x4]; // 0x64(0x04)
	struct UPhysicsAsset* *e9c8b0c3b9; // 0x68(0x08)
	struct TMap<enum class ESkydiveState, struct F*5a82d58d14> *e932ffe4e2; // 0x70(0x50)
};

// ScriptStruct TslGame.*5a82d58d14
// Size: 0x10 (Inherited: 0x00)
struct F*5a82d58d14 {
	float *4d6467dc71; // 0x00(0x04)
	enum class *ab22144e19 *cb893f7743; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float *4c19e42548; // 0x08(0x04)
	bool *d94eb35291; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*9161670956
// Size: 0x7c (Inherited: 0x00)
struct F*9161670956 {
	float *8f5995008c; // 0x00(0x04)
	float *b371441036; // 0x04(0x04)
	float *0bdd5587e4; // 0x08(0x04)
	float *035c9b8432; // 0x0c(0x04)
	float *4f6fffae24; // 0x10(0x04)
	float *c2fc69b948; // 0x14(0x04)
	float *4956964db4; // 0x18(0x04)
	float *2764721eb2; // 0x1c(0x04)
	float *c1fa19bdc8; // 0x20(0x04)
	float *626241164a; // 0x24(0x04)
	float *56afcda986; // 0x28(0x04)
	float *d3c594603f; // 0x2c(0x04)
	struct FVector2D *543c8ce1ab; // 0x30(0x08)
	struct FVector2D *caf0c23155; // 0x38(0x08)
	float *567b520519; // 0x40(0x04)
	float *11f3e4bb54; // 0x44(0x04)
	float *da7349bbcf; // 0x48(0x04)
	float *c6bea3dfdc; // 0x4c(0x04)
	float *c8a5946fab; // 0x50(0x04)
	float *5d88cf2a3e; // 0x54(0x04)
	float *63910eef98; // 0x58(0x04)
	float *fccc0a6e87; // 0x5c(0x04)
	float *f243a07c2d; // 0x60(0x04)
	float *c04726ddca; // 0x64(0x04)
	float *1fa9f445ef; // 0x68(0x04)
	struct FVector2D *90a2c21d42; // 0x6c(0x08)
	struct FVector2D *c81796c46e; // 0x74(0x08)
};

// ScriptStruct TslGame.*167fac4b46
// Size: 0x30 (Inherited: 0x00)
struct F*167fac4b46 {
	float *dd26eaba35; // 0x00(0x04)
	float *e5ffbd8b17; // 0x04(0x04)
	float *e118c87d74; // 0x08(0x04)
	float *1e028ac882; // 0x0c(0x04)
	float *1226927202; // 0x10(0x04)
	float *7cbcc4ea87; // 0x14(0x04)
	float *2c82970a2b; // 0x18(0x04)
	float *d4c9697614; // 0x1c(0x04)
	float *91e334ae94; // 0x20(0x04)
	float *288d91fd54; // 0x24(0x04)
	float *fdcd31c5cf; // 0x28(0x04)
	float *9cb8c3624d; // 0x2c(0x04)
};

// ScriptStruct TslGame.*cf9d354708
// Size: 0x28 (Inherited: 0x00)
struct F*cf9d354708 {
	float *8902eeacb9; // 0x00(0x04)
	float *b54bcd828e; // 0x04(0x04)
	float *691ee6f33c; // 0x08(0x04)
	float *582ab8404c; // 0x0c(0x04)
	float *1c3054f489; // 0x10(0x04)
	bool *fcfd9f1691; // 0x14(0x01)
	bool *02d9b5d541; // 0x15(0x01)
	bool *5928c8f62c; // 0x16(0x01)
	bool *6c08d008ca; // 0x17(0x01)
	float *5e135b07a8; // 0x18(0x04)
	float *92d73f61a8; // 0x1c(0x04)
	float *6043047ecf; // 0x20(0x04)
	float *01b53a08ae; // 0x24(0x04)
};

// ScriptStruct TslGame.*eeb577c115
// Size: 0x20 (Inherited: 0x00)
struct F*eeb577c115 {
	float *68aabc0284; // 0x00(0x04)
	struct FVector2D *b82394bfa7; // 0x04(0x08)
	struct FVector2D *8a938a9d22; // 0x0c(0x08)
	float *782491f266; // 0x14(0x04)
	struct FVector2D *93ebf0aa5c; // 0x18(0x08)
};

// ScriptStruct TslGame.*f62c688730
// Size: 0x14 (Inherited: 0x00)
struct F*f62c688730 {
	float DragScale; // 0x00(0x04)
	float *98ae343e7e; // 0x04(0x04)
	float *137a92c348; // 0x08(0x04)
	float *93e3468f23; // 0x0c(0x04)
	float *71d7993769; // 0x10(0x04)
};

// ScriptStruct TslGame.*18d1959834
// Size: 0x18 (Inherited: 0x00)
struct F*18d1959834 {
	float *d31fb1565b; // 0x00(0x04)
	float *a1039e2f59; // 0x04(0x04)
	float *85f69309d6; // 0x08(0x04)
	bool *40b6a58d9c; // 0x0c(0x01)
	bool *2a59febbdd; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
	float *f056f7a632; // 0x10(0x04)
	float *c0752332f3; // 0x14(0x04)
};

// ScriptStruct TslGame.FreefallVelocitySettings
// Size: 0x0c (Inherited: 0x00)
struct FFreefallVelocitySettings {
	float SpeedMin; // 0x00(0x04)
	float *8c2d6364cc; // 0x04(0x04)
	float *963c8578fd; // 0x08(0x04)
};

// ScriptStruct TslGame.*452f5853ec
// Size: 0x30 (Inherited: 0x00)
struct F*452f5853ec {
	struct FVector2D *1468e1aed3; // 0x00(0x08)
	struct FVector2D *6d9869ee77; // 0x08(0x08)
	struct FVector2D *ea10b84ef1; // 0x10(0x08)
	float *ef744084d3; // 0x18(0x04)
	struct FVector2D *11d2bcd2b0; // 0x1c(0x08)
	struct FVector2D *910f1013ad; // 0x24(0x08)
	float *6dd0888eed; // 0x2c(0x04)
};

// ScriptStruct TslGame.*8bcc7e1dc2
// Size: 0x78 (Inherited: 0x00)
struct F*8bcc7e1dc2 {
	bool *259cf46360; // 0x00(0x01)
	bool *bf9bccffb3; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct TMap<int32, int32> *198694087b; // 0x08(0x50)
	int32 *8b28bc882e; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct TArray<float> *4443e66182; // 0x60(0x10)
	int32 *4cf0815086; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.*cc8b7e381e
// Size: 0x20 (Inherited: 0x00)
struct F*cc8b7e381e {
	char bIsArmed : 1; // 0x00(0x01)
	char bIsGun : 1; // 0x00(0x01)
	char bIsHipped : 1; // 0x00(0x01)
	char pad_0_3 : 5; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	enum class EWeaponClass WeaponClass; // 0x04(0x01)
	enum class EWeaponClass LobbyAnimationClass; // 0x05(0x01)
	enum class EThrownWeaponType ThrownWeaponClass; // 0x06(0x01)
	enum class EAnimWeaponType AnimWeaponType; // 0x07(0x01)
	struct UBlendSpace1D* GripBlendspace; // 0x08(0x08)
	struct UBlendSpaceBase* LHGripBlendspace; // 0x10(0x08)
	int32 GripTypeIndex; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.AnimMontageData
// Size: 0x10 (Inherited: 0x00)
struct FAnimMontageData {
	struct UAnimMontage* Montage; // 0x00(0x08)
	float PlayRate; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*4cc82af5fc
// Size: 0x20 (Inherited: 0x00)
struct F*4cc82af5fc {
	struct TArray<struct UItem*> *16d5ea9652; // 0x00(0x10)
	struct TArray<struct F*7f75b18e9f> *e807018031; // 0x10(0x10)
};

// ScriptStruct TslGame.*7f75b18e9f
// Size: 0x10 (Inherited: 0x00)
struct F*7f75b18e9f {
	char pad_0[0x8]; // 0x00(0x08)
	struct UEquipableItem* Item; // 0x08(0x08)
};

// ScriptStruct TslGame.*762b66aa5f
// Size: 0x10 (Inherited: 0x00)
struct F*762b66aa5f {
	float *e1e6e36573; // 0x00(0x04)
	float *611dd2fb05; // 0x04(0x04)
	int32 *57e31a6eea; // 0x08(0x04)
	int32 MaxCount; // 0x0c(0x04)
};

// ScriptStruct TslGame.*b5951cb36a
// Size: 0x3c (Inherited: 0x00)
struct F*b5951cb36a {
	float *dfa7e5ee6a; // 0x00(0x04)
	float *5dcd549c5d; // 0x04(0x04)
	float *e62a04eaac; // 0x08(0x04)
	float *8743ed1df4; // 0x0c(0x04)
	float *ae062eb372; // 0x10(0x04)
	float *1cceb9066b; // 0x14(0x04)
	float *e97b030929; // 0x18(0x04)
	struct F*c6b1b1d61e *72bfd0e2ce; // 0x1c(0x1c)
	float *90141b3f67; // 0x38(0x04)
};

// ScriptStruct TslGame.*c6b1b1d61e
// Size: 0x1c (Inherited: 0x00)
struct F*c6b1b1d61e {
	struct FVector *165478efa2; // 0x00(0x0c)
	float *eb3d5ff754; // 0x0c(0x04)
	float *d01002685a; // 0x10(0x04)
	float *e6b1cb23c3; // 0x14(0x04)
	float *9962ae2514; // 0x18(0x04)
};

// ScriptStruct TslGame.*045ed75eef
// Size: 0x18 (Inherited: 0x00)
struct F*045ed75eef {
	struct TArray<struct ATslRedeployRespawnPoint*> *04d47ecd8f; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct TslGame.*8a860faf82
// Size: 0x08 (Inherited: 0x00)
struct F*8a860faf82 {
	struct ATslPlayerState* *5dafae92bf; // 0x00(0x08)
};

// ScriptStruct TslGame.*b52ff0e449
// Size: 0x20 (Inherited: 0x00)
struct F*b52ff0e449 {
	struct TArray<struct ACaptureAreaActor*> *30ea761956; // 0x00(0x10)
	struct TArray<float> *e7c951d943; // 0x10(0x10)
};

// ScriptStruct TslGame.*e64ad6ff58
// Size: 0x68 (Inherited: 0x00)
struct F*e64ad6ff58 {
	struct F*fc02106b82 Config; // 0x00(0x30)
	struct UClass* WidgetClass; // 0x30(0x08)
	char pad_38[0x8]; // 0x38(0x08)
	struct UUserWidget* Widget; // 0x40(0x08)
	char pad_48[0x20]; // 0x48(0x20)
};

// ScriptStruct TslGame.*8354cda1f3
// Size: 0x38 (Inherited: 0x00)
struct F*8354cda1f3 {
	int32 CellSize; // 0x00(0x04)
	int32 *1a563538a6; // 0x04(0x04)
	int32 *ce319df66a; // 0x08(0x04)
	int32 *5f37d82555; // 0x0c(0x04)
	int32 *577018c81d; // 0x10(0x04)
	int32 *26e850ea25; // 0x14(0x04)
	float *6b6d2781a4; // 0x18(0x04)
	int32 *aa7c774afd; // 0x1c(0x04)
	float *6a33826255; // 0x20(0x04)
	float *35606ce7a6; // 0x24(0x04)
	float *8d2a855c64; // 0x28(0x04)
	float *47436b50a2; // 0x2c(0x04)
	float *72ab74f9d0; // 0x30(0x04)
	float *70729157a8; // 0x34(0x04)
};

// ScriptStruct TslGame.*93ca5d0868
// Size: 0x24 (Inherited: 0x00)
struct F*93ca5d0868 {
	float Stand[0x03]; // 0x00(0x0c)
	float Crouch[0x03]; // 0x0c(0x0c)
	float Prone[0x03]; // 0x18(0x0c)
};

// ScriptStruct TslGame.*5e98591d4f
// Size: 0x98 (Inherited: 0x00)
struct F*5e98591d4f {
	struct FString MapName; // 0x00(0x10)
	struct F*fdf430394b *2f38ad6bac; // 0x10(0x88)
};

// ScriptStruct TslGame.*fdf430394b
// Size: 0x88 (Inherited: 0x00)
struct F*fdf430394b {
	struct UClass* AIControllerClass; // 0x00(0x20)
	struct UClass* *f6d046096d; // 0x20(0x20)
	struct U*e1e322e954* *59faff5b40; // 0x40(0x08)
	struct UClass* *ec66148516; // 0x48(0x20)
	struct UDataTable* CharacterCostumeSetDataTable; // 0x68(0x20)
};

// ScriptStruct TslGame.*0af6f1ccbf
// Size: 0x34 (Inherited: 0x00)
struct F*0af6f1ccbf {
	struct FVector AirplaneStartLoc; // 0x00(0x0c)
	struct FVector AirplaneStopLoc; // 0x0c(0x0c)
	struct FVector AirplaneCanJumpLoc; // 0x18(0x0c)
	struct FVector AirplaneForceJumpLoc; // 0x24(0x0c)
	float PlaneSpeed; // 0x30(0x04)
};

// ScriptStruct TslGame.*7bae3aa231
// Size: 0x10 (Inherited: 0x00)
struct F*7bae3aa231 {
	struct FName Tag; // 0x00(0x08)
	struct UAkAudioEvent* AkEvent; // 0x08(0x08)
};

// ScriptStruct TslGame.*e20c77ba0f
// Size: 0x18 (Inherited: 0x00)
struct F*e20c77ba0f {
	enum class ECastAnim CastAnim; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct F*7bae3aa231> DataList; // 0x08(0x10)
};

// ScriptStruct TslGame.*19ebfd3ebe
// Size: 0x20 (Inherited: 0x00)
struct F*19ebfd3ebe {
	struct FName *ebe97e2081; // 0x00(0x08)
	struct FVector Location; // 0x08(0x0c)
	int32 *fd65c5d030; // 0x14(0x04)
	int32 *40170e32f8; // 0x18(0x04)
	int32 *6555fbdbdd; // 0x1c(0x04)
};

// ScriptStruct TslGame.AkVariant
// Size: 0x0c (Inherited: 0x00)
struct FAkVariant {
	float *37295f64b1; // 0x00(0x04)
	float *30e08dfd38; // 0x04(0x04)
	bool *91ddd35066; // 0x08(0x01)
	bool *516ab125eb; // 0x09(0x01)
	bool *1f6ce5b46a; // 0x0a(0x01)
	bool *840c6d460f; // 0x0b(0x01)
};

// ScriptStruct TslGame.*b0d62a1c45
// Size: 0x18 (Inherited: 0x00)
struct F*b0d62a1c45 {
	struct FString EventName; // 0x00(0x10)
	struct UAkAudioEvent* AkAudioEvent; // 0x10(0x08)
};

// ScriptStruct TslGame.*c593899cf4
// Size: 0xa0 (Inherited: 0x98)
struct F*c593899cf4 : F*6408c978a1 {
	struct UBlendSpace* BlendSpaceStop; // 0x98(0x08)
};

// ScriptStruct TslGame.*6408c978a1
// Size: 0x98 (Inherited: 0x00)
struct F*6408c978a1 {
	struct UAnimSequence* BasePose; // 0x00(0x08)
	struct F*6b99728ef2 IdleAnimations; // 0x08(0x10)
	struct UBlendSpace* BlendSpaceAimOffset; // 0x18(0x08)
	struct F*87f29f7786 TurningInPlace; // 0x20(0x20)
	struct UBlendSpace* BlendSpaceLocomotion; // 0x40(0x08)
	struct UBlendSpace* BlendSpaceStart; // 0x48(0x08)
	struct F*7d26189905 AnimSpeed_Walk; // 0x50(0x20)
	struct F*7d26189905 AnimSpeed_Run; // 0x70(0x20)
	float AnimSpeed_Sprint; // 0x90(0x04)
	float AimOffsetBlendTime; // 0x94(0x04)
};

// ScriptStruct TslGame.*7d26189905
// Size: 0x20 (Inherited: 0x00)
struct F*7d26189905 {
	float F; // 0x00(0x04)
	float L; // 0x04(0x04)
	float R; // 0x08(0x04)
	float B; // 0x0c(0x04)
	float FL; // 0x10(0x04)
	float FR; // 0x14(0x04)
	float BL; // 0x18(0x04)
	float BR; // 0x1c(0x04)
};

// ScriptStruct TslGame.*87f29f7786
// Size: 0x20 (Inherited: 0x00)
struct F*87f29f7786 {
	struct UAnimSequence* Left90; // 0x00(0x08)
	struct UAnimSequence* Left180; // 0x08(0x08)
	struct UAnimSequence* Right90; // 0x10(0x08)
	struct UAnimSequence* Right180; // 0x18(0x08)
};

// ScriptStruct TslGame.*a401b3ebd8
// Size: 0xa8 (Inherited: 0x98)
struct F*a401b3ebd8 : F*6408c978a1 {
	struct UBlendSpace* BlendSpaceStopLeft; // 0x98(0x08)
	struct UBlendSpace* BlendSpaceStopRight; // 0xa0(0x08)
};

// ScriptStruct TslGame.*b3eb0f46a5
// Size: 0xf0 (Inherited: 0x98)
struct F*b3eb0f46a5 : F*6408c978a1 {
	struct UAnimSequence* JumpStartForward; // 0x98(0x08)
	struct UAnimSequence* JumpStartBackward; // 0xa0(0x08)
	struct UAnimSequence* JumpStartStationary; // 0xa8(0x08)
	struct UAnimSequence* JumpStartLocalForward; // 0xb0(0x08)
	struct UAnimSequence* JumpStartLocalBackward; // 0xb8(0x08)
	struct UAnimSequence* JumpStartLocalStationary; // 0xc0(0x08)
	struct UBlendSpace* BlendSpaceStopLeft; // 0xc8(0x08)
	struct UBlendSpace* BlendSpaceStopRight; // 0xd0(0x08)
	struct UBlendSpace* BlendSpacePivotLeft; // 0xd8(0x08)
	struct UBlendSpace* BlendSpacePivotRight; // 0xe0(0x08)
	struct UBlendSpace* BlendSpaceFastTurnPivot; // 0xe8(0x08)
};

// ScriptStruct TslGame.AnimInfo
// Size: 0xb8 (Inherited: 0x00)
struct FAnimInfo {
	struct UAnimSequence* IdleBasePose; // 0x00(0x08)
	struct UAnimSequence* IdleBasePoseFPP; // 0x08(0x08)
	struct F*6b99728ef2 IdleAnimations; // 0x10(0x10)
	struct F*6b99728ef2 IdleAnimationsCold; // 0x20(0x10)
	struct F*87f29f7786 TurningInPlace; // 0x30(0x20)
	struct UBlendSpace* LocomotionBlendspace; // 0x50(0x08)
	struct UBlendSpace* LocomotionBlendspaceFPP; // 0x58(0x08)
	struct UBlendSpace* LocomotionStartBlendspace; // 0x60(0x08)
	struct UBlendSpace* LocomotionStopBlendspace; // 0x68(0x08)
	struct F*7d26189905 AnimSpeed_Walk; // 0x70(0x20)
	struct F*7d26189905 AnimSpeed_Run; // 0x90(0x20)
	float AnimSpeed_Sprint; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.*7771a55717
// Size: 0x40 (Inherited: 0x00)
struct F*7771a55717 {
	struct F*67d17e7d0c StandTPP; // 0x00(0x10)
	struct F*67d17e7d0c StandFPP; // 0x10(0x10)
	struct F*67d17e7d0c ProneTPP; // 0x20(0x10)
	struct F*67d17e7d0c ProneFPP; // 0x30(0x10)
};

// ScriptStruct TslGame.*67d17e7d0c
// Size: 0x10 (Inherited: 0x00)
struct F*67d17e7d0c {
	struct UAnimSequence* Default; // 0x00(0x08)
	struct UAnimSequence* ParentControl; // 0x08(0x08)
};

// ScriptStruct TslGame.*d5bd0211fd
// Size: 0x0c (Inherited: 0x00)
struct F*d5bd0211fd {
	float Walk; // 0x00(0x04)
	float Run; // 0x04(0x04)
	float Sprint; // 0x08(0x04)
};

// ScriptStruct TslGame.*efa44fea09
// Size: 0x38 (Inherited: 0x00)
struct F*efa44fea09 {
	enum class ERaycastDirection Direction; // 0x00(0x01)
	bool bUseCustomDirection; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	struct FVector *c7c8f89e6c; // 0x04(0x0c)
	struct FName *9721e250ca; // 0x10(0x08)
	float *7a19851524; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct U*f6f6209d57* *1d8b75a643; // 0x20(0x08)
	struct F*379dbaf15c *1b89926eb1; // 0x28(0x10)
};

// ScriptStruct TslGame.*379dbaf15c
// Size: 0x10 (Inherited: 0x00)
struct F*379dbaf15c {
	struct FVector Offset; // 0x00(0x0c)
	bool *a781e6e5a2; // 0x0c(0x01)
	bool *e4fb232040; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
};

// ScriptStruct TslGame.*5bac932330
// Size: 0x1c (Inherited: 0x00)
struct F*5bac932330 {
	struct FVector InitialActorOffset; // 0x00(0x0c)
	struct FVector TraceVector; // 0x0c(0x0c)
	float SphereRadius; // 0x18(0x04)
};

// ScriptStruct TslGame.*9827885161
// Size: 0xb0 (Inherited: 0x08)
struct F*9827885161 : FTableRowBase {
	int32 EmoteID; // 0x08(0x04)
	enum class EEmotePlayType PlayType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FText EmoteLocalizedName; // 0x10(0x18)
	struct UTexture2D* UITexture; // 0x28(0x08)
	struct UMaterialInterface* UIMaterial; // 0x30(0x08)
	struct UAnimMontage* AnimMogtage_SoftRef; // 0x38(0x20)
	enum class *d20bede27b AnimType; // 0x58(0x01)
	bool bIsBGM_Sound; // 0x59(0x01)
	char pad_5A[0x2]; // 0x5a(0x02)
	int32 EmoteIDforOtherTeammate; // 0x5c(0x04)
	struct F*a7f97ebbdc EmoteIDsForTeammate; // 0x60(0x10)
	bool bRandomTeammateID; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	int32 TeammateAllowedNumber; // 0x74(0x04)
	struct FName StartInteractSectionName; // 0x78(0x08)
	bool bRandomPlayInteractScetion; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	float FollowRestricDistance; // 0x84(0x04)
	struct U*d7dcdd0b5f* TraceDataRef; // 0x88(0x08)
	float FPPEmoteViewPitchMin; // 0x90(0x04)
	float FPPEmoteViewPitchMax; // 0x94(0x04)
	float FPPEmoteViewYawMin; // 0x98(0x04)
	float FPPEmoteViewYawMax; // 0x9c(0x04)
	enum class EEmoteMoveType MoveType; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float MaxMoveSpeed; // 0xa4(0x04)
	float MoveCapsuleRadius; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// ScriptStruct TslGame.*a7f97ebbdc
// Size: 0x10 (Inherited: 0x00)
struct F*a7f97ebbdc {
	struct TArray<int32> EmoteIDs; // 0x00(0x10)
};

// ScriptStruct TslGame.*c6b0976726
// Size: 0x28 (Inherited: 0x00)
struct F*c6b0976726 {
	struct UAnimMontage* *5aec5dc08a; // 0x00(0x20)
	struct UAnimMontage* AnimMontage; // 0x20(0x08)
};

// ScriptStruct TslGame.*f5c1b084bf
// Size: 0x10 (Inherited: 0x00)
struct F*f5c1b084bf {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct TslGame.*2636295495
// Size: 0x10 (Inherited: 0x00)
struct F*2636295495 {
	struct FVector2D *7a2562f2aa; // 0x00(0x08)
	struct ATslSpecialZoneActor* *9e6a0704f2; // 0x08(0x08)
};

// ScriptStruct TslGame.*9560361948
// Size: 0x14 (Inherited: 0x00)
struct F*9560361948 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x13]; // 0x01(0x13)
};

// ScriptStruct TslGame.*f478762b88
// Size: 0x0c (Inherited: 0x00)
struct F*f478762b88 {
	int32 *b20023d79c; // 0x00(0x04)
	int32 *c6b8d6e339; // 0x04(0x04)
	int32 *40118241fa; // 0x08(0x04)
};

// ScriptStruct TslGame.*db46243048
// Size: 0x10 (Inherited: 0x00)
struct F*db46243048 {
	float *82b341893c; // 0x00(0x04)
	float *a8f9781b2f; // 0x04(0x04)
	float *9dd1cc002b; // 0x08(0x04)
	int32 *2e0959d2ee; // 0x0c(0x04)
};

// ScriptStruct TslGame.*983f3f54a2
// Size: 0x160 (Inherited: 0x00)
struct F*983f3f54a2 {
	float *4120cddc7a; // 0x00(0x04)
	float *15aefc2191; // 0x04(0x04)
	float *091868fd5a; // 0x08(0x04)
	float *c1cab2071f; // 0x0c(0x04)
	float *06d084405e; // 0x10(0x04)
	int32 *6d89b84635; // 0x14(0x04)
	int32 *81513322a2; // 0x18(0x04)
	int32 *f40a26e788; // 0x1c(0x04)
	struct TMap<struct FString, struct F*ef43c34115> *82d70b3b31; // 0x20(0x50)
	struct TMap<struct FString, struct F*ef43c34115> *dc9915963c; // 0x70(0x50)
	struct TMap<struct FString, int32> *95d032fb53; // 0xc0(0x50)
	struct TMap<enum class EMovementBaseType, float> *64f0b0eb27; // 0x110(0x50)
};

// ScriptStruct TslGame.*ef43c34115
// Size: 0x58 (Inherited: 0x00)
struct F*ef43c34115 {
	int32 Shots; // 0x00(0x04)
	float *078c9d80f0; // 0x04(0x04)
	struct TMap<enum class EDamageReason, struct F*c7ee162c05> *4a63d6ef0d; // 0x08(0x50)
};

// ScriptStruct TslGame.*c7ee162c05
// Size: 0x18 (Inherited: 0x00)
struct F*c7ee162c05 {
	int32 Hits; // 0x00(0x04)
	int32 *70caabc633; // 0x04(0x04)
	float *1032befa92; // 0x08(0x04)
	float *88c8d3d134; // 0x0c(0x04)
	int32 Kills; // 0x10(0x04)
	int32 *43dc196cbe; // 0x14(0x04)
};

// ScriptStruct TslGame.*efc8d5eb0c
// Size: 0x18 (Inherited: 0x00)
struct F*efc8d5eb0c {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*5345610a54
// Size: 0x08 (Inherited: 0x00)
struct F*5345610a54 {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*1fe8fdc230
// Size: 0x0c (Inherited: 0x00)
struct F*1fe8fdc230 {
	char pad_0[0xc]; // 0x00(0x0c)
};

// ScriptStruct TslGame.*9928cc3b2f
// Size: 0x10 (Inherited: 0x00)
struct F*9928cc3b2f {
	struct UClass* *559b19dd91; // 0x00(0x08)
	float *26078ffe0a; // 0x08(0x04)
	bool *677e28cfd4; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*edc9c17144
// Size: 0xd0 (Inherited: 0x00)
struct F*edc9c17144 {
	char pad_0[0x10]; // 0x00(0x10)
	struct UClass* *2e7f3c463b; // 0x10(0x08)
	struct UClass* *b7bf63dc1d; // 0x18(0x08)
	struct UClass* *ea9b69ba48; // 0x20(0x08)
	struct UClass* *6cf8740e44; // 0x28(0x08)
	struct UClass* *7044e68844; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
	struct F*7f75db2b30 *f78b864df8; // 0x48(0x08)
	struct FVector *a199e026e0; // 0x50(0x0c)
	struct FVector *378fc9a1fe; // 0x5c(0x0c)
	struct FVector *740d0e85f1; // 0x68(0x0c)
	struct FVector *84d0858793; // 0x74(0x0c)
	struct FVector *4d66f615dd; // 0x80(0x0c)
	struct FVector *bb68d8ab3a; // 0x8c(0x0c)
	struct F*7f75db2b30 *15b1e608ba; // 0x98(0x08)
	float *612d1306a9; // 0xa0(0x04)
	char pad_A4[0x2c]; // 0xa4(0x2c)
};

// ScriptStruct TslGame.*7f75db2b30
// Size: 0x08 (Inherited: 0x00)
struct F*7f75db2b30 {
	float *12f0be9a30; // 0x00(0x04)
	float *b716d62d76; // 0x04(0x04)
};

// ScriptStruct TslGame.*d1f4c96261
// Size: 0x78 (Inherited: 0x00)
struct F*d1f4c96261 {
	struct FString ServerURL; // 0x00(0x10)
	struct FString Domain; // 0x10(0x10)
	struct FString Issuer; // 0x20(0x10)
	bool *4428a21b41; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FString GVoiceServerUrl; // 0x38(0x10)
	struct FString GVoiceAppKey; // 0x48(0x10)
	struct FString GVoiceAppId; // 0x58(0x10)
	int32 GVoiceProximalMaxRange; // 0x68(0x04)
	int32 GVoiceDistNear; // 0x6c(0x04)
	int32 GVoiceDistFar; // 0x70(0x04)
	float GVoiceVolPercentage; // 0x74(0x04)
};

// ScriptStruct TslGame.*edc104dbaf
// Size: 0xa8 (Inherited: 0x00)
struct F*edc104dbaf {
	float BlurLevel; // 0x00(0x04)
	float ScopeRadiusNear; // 0x04(0x04)
	float ScopeRadiusFar; // 0x08(0x04)
	struct FVector2D ReticleRect; // 0x0c(0x08)
	float ReticleAngularSize; // 0x14(0x04)
	struct FLinearColor ReticleTint; // 0x18(0x10)
	float ReticleGamma; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UTexture* ReticleTexture; // 0x30(0x08)
	bool bReticleExtendTextureBorder; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct U*90f03bd132* ReticleSettings; // 0x40(0x08)
	float ScopeLensDistortion; // 0x48(0x04)
	float ScopeLensCA; // 0x4c(0x04)
	struct FLinearColor ScopeLensTint; // 0x50(0x10)
	float ScopeOuterBrightness; // 0x60(0x04)
	float DepthBlurPower; // 0x64(0x04)
	float DepthBlurWhitePoint; // 0x68(0x04)
	float DepthBlurBlackPoint; // 0x6c(0x04)
	struct FVector2D RelativeOffsetMap; // 0x70(0x08)
	float ParallaxMovementScale; // 0x78(0x04)
	float ParallaxRadiusScale; // 0x7c(0x04)
	float BloomIntensity; // 0x80(0x04)
	float NearClipStaticOffset; // 0x84(0x04)
	float NearClipMinClamp; // 0x88(0x04)
	struct FVector WeaponCycleCameraOffset; // 0x8c(0x0c)
	struct FReticleBrightSceneVisibility BrightSceneVisibility; // 0x98(0x0c)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.ReticleBrightSceneVisibility
// Size: 0x0c (Inherited: 0x00)
struct FReticleBrightSceneVisibility {
	float LuminanceMultiplier; // 0x00(0x04)
	float OpacityMultiplier; // 0x04(0x04)
	float OpacityMultiplierLowResolution; // 0x08(0x04)
};

// ScriptStruct TslGame.*468382b2f1
// Size: 0x280 (Inherited: 0x00)
struct F*468382b2f1 {
	struct FName WeaponTag; // 0x00(0x08)
	struct UStaticMesh* AttachmentMeshAsset; // 0x08(0x20)
	struct FWeaponAttachmentData AttachmentData; // 0x28(0x250)
	struct UClass* AttachmentTemplate; // 0x278(0x08)
};

// ScriptStruct TslGame.WeaponAttachmentData
// Size: 0x250 (Inherited: 0x00)
struct FWeaponAttachmentData {
	enum class EWeaponAttachmentSlotID AttachmentSlotID; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName AttachmentTag; // 0x08(0x08)
	struct FName Name; // 0x10(0x08)
	struct FName MouseSensitiveName; // 0x18(0x08)
	float MagnificationFOVMaxIncrement; // 0x20(0x04)
	int32 MagnificationFOVSteps; // 0x24(0x04)
	float MagnificationFOV; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct F*4e85a8c2e0 ReticleBrightnessConfig; // 0x30(0x20)
	struct TArray<float> *c6f4191d2e; // 0x50(0x10)
	struct TMap<struct FName, struct UMaterialInstance*> *b368cfd43c; // 0x60(0x50)
	struct TMap<struct FName, struct U*90f03bd132*> *a6c933874d; // 0xb0(0x50)
	struct U*4a170ec375* *2d86e63f08; // 0x100(0x08)
	int32 AmmoPerClip; // 0x108(0x04)
	float ReloadAnimationPlayRate; // 0x10c(0x04)
	float MultipleFiringBulletsSpread; // 0x110(0x04)
	float RecoilMultiplierHorizontal; // 0x114(0x04)
	float RecoilMultiplierVertical; // 0x118(0x04)
	float RecoilRecoveryMultiplier; // 0x11c(0x04)
	float SwayMultiplier; // 0x120(0x04)
	float AnimationKickMultiplier; // 0x124(0x04)
	float DeviationMultiplier; // 0x128(0x04)
	float ADSSpeedMultiplier; // 0x12c(0x04)
	struct FVector FPPSocketOffset; // 0x130(0x0c)
	int32 GripType_MN; // 0x13c(0x04)
	float BarrelLengthAdditive; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct UParticleSystem* MuzzleFx; // 0x148(0x08)
	struct FName MuzzleAttachPoint; // 0x150(0x08)
	enum class *8f7cddd88b WeaponGripLeft; // 0x158(0x01)
	bool bIsSuppressor; // 0x159(0x01)
	char pad_15A[0x6]; // 0x15a(0x06)
	struct FStringAssetReference MuzzleSound; // 0x160(0x10)
	struct UAnimMontage* CharacterReloadTactical; // 0x170(0x08)
	struct UAnimMontage* WeaponReloadTactical; // 0x178(0x08)
	struct UAnimMontage* CharacterReloadCharge; // 0x180(0x08)
	struct UAnimMontage* WeaponReloadCharge; // 0x188(0x08)
	bool bUsePelletGridOverride; // 0x190(0x01)
	char pad_191[0x7]; // 0x191(0x07)
	struct TMap<int32, struct FVector2D> *99f1dc372f; // 0x198(0x50)
	float StabilitySpeedScalar; // 0x1e8(0x04)
	float StabilityMinForceAdditive; // 0x1ec(0x04)
	float RecoilEarlyExitScale; // 0x1f0(0x04)
	float CantedWeaponRotation; // 0x1f4(0x04)
	bool bUseReticleTypeOverride; // 0x1f8(0x01)
	bool bUseDefaultReticleCaching; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)
	struct TArray<struct F*787caa668a> ReticleTextureDataArray; // 0x200(0x10)
	struct F*db11871030 ScopeGlintConfig; // 0x210(0x3c)
	bool bThermalTemperatureInteractive; // 0x24c(0x01)
	bool bBlocksGameplayTracers; // 0x24d(0x01)
	char pad_24E[0x2]; // 0x24e(0x02)
};

// ScriptStruct TslGame.*db11871030
// Size: 0x3c (Inherited: 0x00)
struct F*db11871030 {
	bool GlintEnabled; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D GlintStartFade; // 0x04(0x08)
	struct FVector ScopeEndPositionLS; // 0x0c(0x0c)
	float ScopeRadiusLS; // 0x18(0x04)
	float GlintRadiusScreen; // 0x1c(0x04)
	float ScopeRadiusScreen; // 0x20(0x04)
	struct FLinearColor GlintColor; // 0x24(0x10)
	struct FVector2D GlintVisibilityArcLength; // 0x34(0x08)
};

// ScriptStruct TslGame.*787caa668a
// Size: 0x40 (Inherited: 0x00)
struct F*787caa668a {
	float ReticleAngularSize; // 0x00(0x04)
	struct FVector2D ReticleCenter; // 0x04(0x08)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UTexture2D* ReticleTexture; // 0x10(0x08)
	bool bUseHaloTexture; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float HaloTextureScale; // 0x1c(0x04)
	struct FVector ReticleColor; // 0x20(0x0c)
	float ReticleScale; // 0x2c(0x04)
	float BrightSceneLuminanceMultiplier; // 0x30(0x04)
	float BrightSceneOpacityMultiplier; // 0x34(0x04)
	float BrightSceneOpacityMultiplierLowResolution; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct TslGame.*4e85a8c2e0
// Size: 0x20 (Inherited: 0x00)
struct F*4e85a8c2e0 {
	struct U*59a0aeaef9* ReticleBrightnessSettingsCurve; // 0x00(0x08)
	struct FName ReticleBrightnessParamX; // 0x08(0x08)
	struct FName ReticleBrightnessParamY; // 0x10(0x08)
	struct FName ReticleBrightnessParamZ; // 0x18(0x08)
};

// ScriptStruct TslGame.*73eadbc90e
// Size: 0x28 (Inherited: 0x00)
struct F*73eadbc90e {
	enum class EWeaponAttachmentSlotID Slot; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FName> *beea70248c; // 0x08(0x10)
	struct TArray<struct FName> *43b8b7e18f; // 0x18(0x10)
};

// ScriptStruct TslGame.*f4471b5c0d
// Size: 0x20 (Inherited: 0x00)
struct F*f4471b5c0d {
	enum class EWeaponAttachmentSlotID *df12e194f4; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName *fc0eecc08b; // 0x08(0x08)
	struct TArray<struct F*98b560ae31> *8757a86189; // 0x10(0x10)
};

// ScriptStruct TslGame.*98b560ae31
// Size: 0x10 (Inherited: 0x00)
struct F*98b560ae31 {
	struct FName *65e93ed5d2; // 0x00(0x08)
	struct FName *fc0eecc08b; // 0x08(0x08)
};

// ScriptStruct TslGame.*19d05f50bc
// Size: 0x18 (Inherited: 0x00)
struct F*19d05f50bc {
	enum class EWeaponAttachmentSlotID *df12e194f4; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FName> *28a84febbc; // 0x08(0x10)
};

// ScriptStruct TslGame.*ab84fcde31
// Size: 0x18 (Inherited: 0x00)
struct F*ab84fcde31 {
	struct UAnimMontage* *789dea958b; // 0x00(0x08)
	struct UAnimMontage* *1342cd3a6c; // 0x08(0x08)
	struct UAnimMontage* Pickup; // 0x10(0x08)
};

// ScriptStruct TslGame.*06ddb86218
// Size: 0x10 (Inherited: 0x00)
struct F*06ddb86218 {
	struct UAnimMontage* RollLeft; // 0x00(0x08)
	struct UAnimMontage* RollRight; // 0x08(0x08)
};

// ScriptStruct TslGame.*47ce58a8c5
// Size: 0x10 (Inherited: 0x00)
struct F*47ce58a8c5 {
	struct UAnimMontage* *a92c9906de; // 0x00(0x08)
	struct UAnimMontage* *2db3b9d907; // 0x08(0x08)
};

// ScriptStruct TslGame.*e928921c36
// Size: 0x2b0 (Inherited: 0x00)
struct F*e928921c36 {
	float TargetingFOV; // 0x00(0x04)
	float *2a6b5d64e5; // 0x04(0x04)
	struct TMap<enum class EScopeType, struct FVector2D> *a27ababf0e; // 0x08(0x50)
	struct FName *e7ba9afc01; // 0x58(0x08)
	struct FVector *1814cfd19d; // 0x60(0x0c)
	struct FRotator *f2d5caac0d; // 0x6c(0x0c)
	struct FVector *afa24b0142; // 0x78(0x0c)
	struct FRotator *1f544d279d; // 0x84(0x0c)
	bool *30db9b401f; // 0x90(0x01)
	bool *60b821ee06; // 0x91(0x01)
	bool *a79cf9e284; // 0x92(0x01)
	enum class *8f7cddd88b *86167ed665; // 0x93(0x01)
	enum class EWeaponClass *4cea20a818; // 0x94(0x01)
	enum class EAnimWeaponSpecificClass *5f08a8457f; // 0x95(0x01)
	enum class EWeaponClass *d868a6745a; // 0x96(0x01)
	bool *82e75ac667; // 0x97(0x01)
	bool *4b90412b45; // 0x98(0x01)
	bool *58d1585ac6; // 0x99(0x01)
	char pad_9A[0x2]; // 0x9a(0x02)
	float *f34869a98d; // 0x9c(0x04)
	float *6e7aa96766; // 0xa0(0x04)
	float *9d8f8d61a3; // 0xa4(0x04)
	float *9a756ad7e8; // 0xa8(0x04)
	float *b85f533ecd; // 0xac(0x04)
	float *7873626e58; // 0xb0(0x04)
	float *31fa40b319; // 0xb4(0x04)
	float *cf68a89218; // 0xb8(0x04)
	bool *11e6a23d33; // 0xbc(0x01)
	char pad_BD[0x3]; // 0xbd(0x03)
	struct TArray<float> *dec2fbb569; // 0xc0(0x10)
	float *aea1ffff11; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct UAnimMontage* *3b1ea6f8c5; // 0xd8(0x08)
	bool DestructibleDoor; // 0xe0(0x01)
	enum class EThrownWeaponType *f191d3edc6; // 0xe1(0x01)
	char pad_E2[0x6]; // 0xe2(0x06)
	struct TMap<enum class ECustomGripBlendSpaceType, struct F*e607880f9c> *89826a2f43; // 0xe8(0x50)
	float *f609d3c28a; // 0x138(0x04)
	float *90685c581b; // 0x13c(0x04)
	float *8c97fd021a; // 0x140(0x04)
	float *800e1f43fc; // 0x144(0x04)
	float *ae70786d6c; // 0x148(0x04)
	bool *6088d2cbaa; // 0x14c(0x01)
	char pad_14D[0x3]; // 0x14d(0x03)
	float *061752c3b7; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct FName *2b3572aebc; // 0x158(0x08)
	SetProperty *6b7810dda8; // 0x160(0x50)
	float *ace0658690; // 0x1b0(0x04)
	float *84818c36ce; // 0x1b4(0x04)
	float *71b7ca36b9; // 0x1b8(0x04)
	bool *a4aa94a1d4; // 0x1bc(0x01)
	bool *d2698c5568; // 0x1bd(0x01)
	bool *1c806e762c; // 0x1be(0x01)
	bool *7842dfc216; // 0x1bf(0x01)
	bool *4e88081459; // 0x1c0(0x01)
	bool *91322d0e2d; // 0x1c1(0x01)
	bool *e748a2736f; // 0x1c2(0x01)
	bool *ee31efdfc2; // 0x1c3(0x01)
	float *5203de7b9d; // 0x1c4(0x04)
	struct UStaticMesh* *01b707ad00; // 0x1c8(0x08)
	struct UAkAudioEvent* *f140bce13e; // 0x1d0(0x08)
	char pad_1D8[0x8]; // 0x1d8(0x08)
	struct FTransform *5641f75af8; // 0x1e0(0x30)
	struct FTransform *1532b78965; // 0x210(0x30)
	struct FTransform *22207d0c2d; // 0x240(0x30)
	struct FTransform *9ac6c0d4b6; // 0x270(0x30)
	bool *02618bbde2; // 0x2a0(0x01)
	char pad_2A1[0xf]; // 0x2a1(0x0f)
};

// ScriptStruct TslGame.*df65c74a41
// Size: 0xc0 (Inherited: 0x28)
struct F*df65c74a41 : F*47b7a33ad7 {
	struct UObject* CharmAsset; // 0x28(0x20)
	struct UStaticMesh* CharmAssetStatic; // 0x48(0x20)
	struct UClass* CharmAnimBlueprint; // 0x68(0x08)
	struct TMap<struct FName, struct UMaterialInterface*> MaterialOverrides; // 0x70(0x50)
};

// ScriptStruct TslGame.*47b7a33ad7
// Size: 0x28 (Inherited: 0x08)
struct F*47b7a33ad7 : FTableRowBase {
	struct FText MasteryItemName; // 0x08(0x18)
	char pad_20[0x8]; // 0x20(0x08)
};

// ScriptStruct TslGame.*81f90e8006
// Size: 0x04 (Inherited: 0x00)
struct F*81f90e8006 {
	uint16 *8840ae405c; // 0x00(0x02)
	uint16 *5654939f10; // 0x02(0x02)
};

// ScriptStruct TslGame.*d4574aee50
// Size: 0xa0 (Inherited: 0x00)
struct F*d4574aee50 {
	struct TMap<struct FName, struct UItem*> *80f8b167c5; // 0x00(0x50)
	struct TMap<int32, struct UItem*> *7f2b5edcaf; // 0x50(0x50)
};

// ScriptStruct TslGame.*2cbf3fefcb
// Size: 0x180 (Inherited: 0x00)
struct F*2cbf3fefcb {
	struct FStringAssetReference *447e31189a; // 0x00(0x10)
	struct FStringAssetReference *2c59178af6; // 0x10(0x10)
	struct FStringAssetReference *7736c929f4; // 0x20(0x10)
	struct FStringAssetReference *fbb5f7ca63; // 0x30(0x10)
	struct FStringAssetReference *8339e0feeb; // 0x40(0x10)
	struct FStringAssetReference *964daf1c13; // 0x50(0x10)
	struct FStringAssetReference *9ba95bdbbf; // 0x60(0x10)
	struct FStringAssetReference *113e5ceafe; // 0x70(0x10)
	struct FStringAssetReference *58325d534f; // 0x80(0x10)
	struct FStringAssetReference *143a573cb8; // 0x90(0x10)
	struct FStringAssetReference *6b027ec4d7; // 0xa0(0x10)
	struct FStringAssetReference *114bd7a566; // 0xb0(0x10)
	struct FStringAssetReference *0250088dce; // 0xc0(0x10)
	struct FStringAssetReference *0d60f12d7a; // 0xd0(0x10)
	struct FStringAssetReference *0fa9c73cfc; // 0xe0(0x10)
	struct FStringAssetReference *fd0f857e58; // 0xf0(0x10)
	struct FStringAssetReference *68f0a2101d; // 0x100(0x10)
	struct UDataTable* *02020c63fe; // 0x110(0x20)
	struct FStringAssetReference *b293844224; // 0x130(0x10)
	struct FStringAssetReference *85786378fe; // 0x140(0x10)
	struct FStringAssetReference *be97d19a82; // 0x150(0x10)
	struct FStringAssetReference *3bf7a6cbd4; // 0x160(0x10)
	struct FStringAssetReference *d8336b08eb; // 0x170(0x10)
};

// ScriptStruct TslGame.WeaponSoundConfig
// Size: 0xb0 (Inherited: 0x00)
struct FWeaponSoundConfig {
	struct UAkAudioEvent* *0b19b01e26; // 0x00(0x08)
	struct UAkAudioEvent* *31fcaa2360; // 0x08(0x08)
	struct FVector2D *6f5d8ab3c8; // 0x10(0x08)
	struct UAkAudioEvent* *8af6184e4b; // 0x18(0x08)
	struct UAkAudioEvent* *056b7ea62f; // 0x20(0x08)
	struct UAkAudioEvent* *ecdc20b5d0; // 0x28(0x08)
	struct UAkAudioEvent* *dc34d1dd1b; // 0x30(0x08)
	struct UAkAudioEvent* *35a8adcd3e; // 0x38(0x08)
	struct UAkAudioEvent* *aaa8c74172; // 0x40(0x08)
	struct UAkAudioEvent* *6982073264; // 0x48(0x08)
	struct UAkAudioEvent* *f67a5fde8f; // 0x50(0x08)
	struct UAkAudioEvent* EquipSoundAk_Primary; // 0x58(0x08)
	struct UAkAudioEvent* *4af8246c5e; // 0x60(0x08)
	struct UAkAudioEvent* *fb93ad3a53; // 0x68(0x08)
	struct UAkAudioEvent* *e8624164f2; // 0x70(0x08)
	struct UAkAudioEvent* *b80a55b23d; // 0x78(0x08)
	struct UAkAudioEvent* *3364363148; // 0x80(0x08)
	struct UAkAudioEvent* *5cd982d49d; // 0x88(0x08)
	char *eec5ab680c : 1; // 0x90(0x01)
	char pad_90_1 : 7; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct UAkAudioEvent* DropAllAttachmentsSoundAk; // 0x98(0x08)
	struct UAkAudioEvent* InventoryPutAllAttachmentsSoundAk; // 0xa0(0x08)
	struct UAkAudioEvent* DropAndInventoryPutAttachmentsSoundAk; // 0xa8(0x08)
};

// ScriptStruct TslGame.*1cd84834aa
// Size: 0x18 (Inherited: 0x00)
struct F*1cd84834aa {
	struct FName WeaponMasteryCharmSocket; // 0x00(0x08)
	struct FName WeaponMasteryCharmAttachSocket; // 0x08(0x08)
	int32 CharmWeaponLODVisibility; // 0x10(0x04)
	int32 VariantWeaponLODVisibility; // 0x14(0x04)
};

// ScriptStruct TslGame.*93df1a6d36
// Size: 0x10 (Inherited: 0x00)
struct F*93df1a6d36 {
	enum class EWeaponAttachmentSlotID *261f599b63; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UItem* Item; // 0x08(0x08)
};

// ScriptStruct TslGame.*845db93a9f
// Size: 0x08 (Inherited: 0x00)
struct F*845db93a9f {
	struct UAnimMontage* *f3b7dcfff9; // 0x00(0x08)
};

// ScriptStruct TslGame.*5a5a69efe6
// Size: 0x20 (Inherited: 0x00)
struct F*5a5a69efe6 {
	struct FName AxisName; // 0x00(0x08)
	float Scale; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FName *263029df69; // 0x10(0x08)
	bool *f192c6bfbc; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct TslGame.*b4c4c49562
// Size: 0x18 (Inherited: 0x00)
struct F*b4c4c49562 {
	struct FName ActionName; // 0x00(0x08)
	struct FName *263029df69; // 0x08(0x08)
	bool *f192c6bfbc; // 0x10(0x01)
	enum class *5553c9dea0 *9ffd49d3c3; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
};

// ScriptStruct TslGame.*1e5151c8f2
// Size: 0x20 (Inherited: 0x18)
struct F*1e5151c8f2 : F*1ae451ca29 {
	struct UWidget* *ade0880c90; // 0x18(0x08)
};

// ScriptStruct TslGame.*1ae451ca29
// Size: 0x18 (Inherited: 0x00)
struct F*1ae451ca29 {
	char pad_0[0x8]; // 0x00(0x08)
	struct FName Name; // 0x08(0x08)
	struct UUserWidget* Parent; // 0x10(0x08)
};

// ScriptStruct TslGame.*bbe25dba95
// Size: 0xa0 (Inherited: 0x98)
struct F*bbe25dba95 : F*612c0c9f13 {
	struct U*59a0aeaef9* VectorCurve; // 0x98(0x08)
};

// ScriptStruct TslGame.*612c0c9f13
// Size: 0x98 (Inherited: 0x00)
struct F*612c0c9f13 {
	char pad_0[0x18]; // 0x00(0x18)
	struct UUserWidget* Widget; // 0x18(0x08)
	char pad_20[0x78]; // 0x20(0x78)
};

// ScriptStruct TslGame.*758c91d300
// Size: 0xa0 (Inherited: 0x98)
struct F*758c91d300 : F*612c0c9f13 {
	struct UCurveFloat* FloatCurve; // 0x98(0x08)
};

// ScriptStruct TslGame.*40c6977988
// Size: 0x20 (Inherited: 0x18)
struct F*40c6977988 : F*1ae451ca29 {
	struct USpacer* *73f8d28089; // 0x18(0x08)
};

// ScriptStruct TslGame.*72b0194904
// Size: 0x20 (Inherited: 0x18)
struct F*72b0194904 : F*1ae451ca29 {
	struct U*54cc75d10f* *64a58bf6c2; // 0x18(0x08)
};

// ScriptStruct TslGame.*2410bc4208
// Size: 0x18 (Inherited: 0x00)
struct F*2410bc4208 {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*2c79402f19
// Size: 0x20 (Inherited: 0x18)
struct F*2c79402f19 : F*1ae451ca29 {
	struct UWebBrowser* *b39c1775ca; // 0x18(0x08)
};

// ScriptStruct TslGame.*d19b0bbaa6
// Size: 0x20 (Inherited: 0x18)
struct F*d19b0bbaa6 : F*1ae451ca29 {
	struct UUserWidget* *ade0880c90; // 0x18(0x08)
};

// ScriptStruct TslGame.*5936845b8b
// Size: 0x28 (Inherited: 0x20)
struct F*5936845b8b : F*82698b8317 {
	struct UScrollBox* *a29804c804; // 0x20(0x08)
};

// ScriptStruct TslGame.*82698b8317
// Size: 0x20 (Inherited: 0x18)
struct F*82698b8317 : F*1ae451ca29 {
	struct U*7762a61952* *70842b8b5f; // 0x18(0x08)
};

// ScriptStruct TslGame.*ec6454139a
// Size: 0x28 (Inherited: 0x20)
struct F*ec6454139a : F*82698b8317 {
	struct UScaleBox* *139506ea3a; // 0x20(0x08)
};

// ScriptStruct TslGame.*938b8814f5
// Size: 0x28 (Inherited: 0x20)
struct F*938b8814f5 : F*82698b8317 {
	struct UInvalidationBox* *ddc0ee91d7; // 0x20(0x08)
};

// ScriptStruct TslGame.*bcb63b7cc0
// Size: 0x28 (Inherited: 0x20)
struct F*bcb63b7cc0 : F*82698b8317 {
	struct URetainerBox* *a84e3e5fa1; // 0x20(0x08)
};

// ScriptStruct TslGame.*ab7fc46cfb
// Size: 0x28 (Inherited: 0x20)
struct F*ab7fc46cfb : F*82698b8317 {
	struct UWrapBox* *9154fabee9; // 0x20(0x08)
};

// ScriptStruct TslGame.*aad5c0ee0d
// Size: 0x28 (Inherited: 0x20)
struct F*aad5c0ee0d : F*82698b8317 {
	struct USizeBox* *b40d14d86f; // 0x20(0x08)
};

// ScriptStruct TslGame.*7c50600f8f
// Size: 0x30 (Inherited: 0x20)
struct F*7c50600f8f : F*82698b8317 {
	struct UBorder* *5524df6cf4; // 0x20(0x08)
	struct UMaterialInstanceDynamic* *5c8c594906; // 0x28(0x08)
};

// ScriptStruct TslGame.*39f1fd3231
// Size: 0x20 (Inherited: 0x18)
struct F*39f1fd3231 : F*1ae451ca29 {
	struct UEditableText* *d88ecbcbde; // 0x18(0x08)
};

// ScriptStruct TslGame.*8c7bdcaa93
// Size: 0x20 (Inherited: 0x18)
struct F*8c7bdcaa93 : F*1ae451ca29 {
	struct UTextBlock* *bd433350af; // 0x18(0x08)
};

// ScriptStruct TslGame.*06751c9d06
// Size: 0x28 (Inherited: 0x20)
struct F*06751c9d06 : F*82698b8317 {
	struct UWidgetSwitcher* *c01aa0509f; // 0x20(0x08)
};

// ScriptStruct TslGame.*f90b3e2b9a
// Size: 0x28 (Inherited: 0x20)
struct F*f90b3e2b9a : F*82698b8317 {
	struct UHorizontalBox* *50b09721a1; // 0x20(0x08)
};

// ScriptStruct TslGame.*be81a602d7
// Size: 0x28 (Inherited: 0x20)
struct F*be81a602d7 : F*82698b8317 {
	struct UVerticalBox* *d2ef9da378; // 0x20(0x08)
};

// ScriptStruct TslGame.*519e1635dd
// Size: 0x28 (Inherited: 0x20)
struct F*519e1635dd : F*82698b8317 {
	struct UOverlay* *658be10375; // 0x20(0x08)
};

// ScriptStruct TslGame.*c1cf1c46a8
// Size: 0x28 (Inherited: 0x20)
struct F*c1cf1c46a8 : F*82698b8317 {
	struct UCanvasPanel* *46136d46fe; // 0x20(0x08)
};

// ScriptStruct TslGame.*b1a0bce7e4
// Size: 0x28 (Inherited: 0x18)
struct F*b1a0bce7e4 : F*1ae451ca29 {
	struct UImage* *88812c7e34; // 0x18(0x08)
	struct UMaterialInstanceDynamic* *5c8c594906; // 0x20(0x08)
};

// ScriptStruct TslGame.*4c33a013bb
// Size: 0x60 (Inherited: 0x00)
struct F*4c33a013bb {
	struct F*8c7bdcaa93 *f8e420ae70; // 0x00(0x20)
	struct F*8c7bdcaa93 *6406830787; // 0x20(0x20)
	char pad_40[0x20]; // 0x40(0x20)
};

// ScriptStruct TslGame.*77b3d3d434
// Size: 0x40 (Inherited: 0x00)
struct F*77b3d3d434 {
	struct F*8c7bdcaa93 *f8e420ae70; // 0x00(0x20)
	enum class *329ef2ca91 *d1c71ce1d1; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float *d027a41616; // 0x24(0x04)
	bool *f37b95631b; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FString *0beea0c611; // 0x30(0x10)
};

// ScriptStruct TslGame.*73da1792c9
// Size: 0x30 (Inherited: 0x00)
struct F*73da1792c9 {
	struct FText *18934bf396; // 0x00(0x18)
	struct FText *c73ca7dfd2; // 0x18(0x18)
};

// ScriptStruct TslGame.*b3ed65a258
// Size: 0x18 (Inherited: 0x00)
struct F*b3ed65a258 {
	enum class ESandboxGroypType *02301bb883; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct F*fb87ada7de> Categories; // 0x08(0x10)
};

// ScriptStruct TslGame.*fb87ada7de
// Size: 0x18 (Inherited: 0x00)
struct F*fb87ada7de {
	int32 *a44b2afd62; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct F*b630e4adda> Items; // 0x08(0x10)
};

// ScriptStruct TslGame.*b630e4adda
// Size: 0x08 (Inherited: 0x00)
struct F*b630e4adda {
	int32 *46ff0889f7; // 0x00(0x04)
	int32 *60d7f23cfc; // 0x04(0x04)
};

// ScriptStruct TslGame.*9c38f0c819
// Size: 0x10 (Inherited: 0x00)
struct F*9c38f0c819 {
	enum class ESandboxPowerType Type; // 0x00(0x04)
	bool *1b3f50fe9a; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	struct UParticleSystemComponent* *f82debdfbd; // 0x08(0x08)
};

// ScriptStruct TslGame.SandboxItemDataTable
// Size: 0x68 (Inherited: 0x10)
struct FSandboxItemDataTable : FBaseSandboxItemDataTable {
	struct FName CategoryName; // 0x10(0x08)
	struct FStringClassReference *e1189fbad3; // 0x18(0x10)
	struct FName ItemID; // 0x28(0x08)
	struct FString *c906a08470; // 0x30(0x10)
	struct FString *019d436c88; // 0x40(0x10)
	struct FString *a2b75efd5f; // 0x50(0x10)
	int32 Index; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// ScriptStruct TslGame.BaseSandboxItemDataTable
// Size: 0x10 (Inherited: 0x08)
struct FBaseSandboxItemDataTable : FTableRowBase {
	struct FName *9e0ebf6317; // 0x08(0x08)
};

// ScriptStruct TslGame.SandboxL10NDataTable
// Size: 0x48 (Inherited: 0x10)
struct FSandboxL10NDataTable : FBaseSandboxItemDataTable {
	struct FString NameSpace; // 0x10(0x10)
	struct FString Key; // 0x20(0x10)
	struct FString MsgId; // 0x30(0x10)
	int32 Index; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// ScriptStruct TslGame.*c2e1cf8b14
// Size: 0x78 (Inherited: 0x10)
struct F*c2e1cf8b14 : FBaseSandboxItemDataTable {
	struct FName ItemName; // 0x10(0x08)
	struct FText *20dc8ab28d; // 0x18(0x18)
	struct FText DescriptionText; // 0x30(0x18)
	bool *64e0e6192e; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	struct FVector2D SliderRange; // 0x4c(0x08)
	char pad_54[0x4]; // 0x54(0x04)
	struct TArray<struct F*73da1792c9> *752a7cf2ae; // 0x58(0x10)
	struct UClass* ItemWidgetClass; // 0x68(0x08)
	struct UClass* *7880f114b8; // 0x70(0x08)
};

// ScriptStruct TslGame.*ebfe0272ac
// Size: 0x38 (Inherited: 0x00)
struct F*ebfe0272ac {
	char pad_0[0x20]; // 0x00(0x20)
	enum class EStanceMode *308a8a5935; // 0x20(0x01)
	char pad_21[0x17]; // 0x21(0x17)
};

// ScriptStruct TslGame.*ee4654d473
// Size: 0x18 (Inherited: 0x00)
struct F*ee4654d473 {
	struct UCurveFloat* *87f2dc67e8; // 0x00(0x08)
	float *7b9511345b; // 0x08(0x04)
	float MaxSpeed; // 0x0c(0x04)
	float *05d61fba84; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*39b56bd642
// Size: 0x18 (Inherited: 0x00)
struct F*39b56bd642 {
	bool *9d170dc856; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *8be264cfec; // 0x04(0x04)
	bool *538b35fc9a; // 0x08(0x01)
	bool bUseAbsoluteAutoDeployAltitude; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	float AutoDeployAltitude; // 0x0c(0x04)
	float StartDeployAltitude; // 0x10(0x04)
	float *cf30d556a4; // 0x14(0x04)
};

// ScriptStruct TslGame.*6d8ea2f88f
// Size: 0x10 (Inherited: 0x00)
struct F*6d8ea2f88f {
	float *30cd26f29f; // 0x00(0x04)
	float *80f79d0943; // 0x04(0x04)
	float *57caeece0b; // 0x08(0x04)
	float *f9bc63096e; // 0x0c(0x04)
};

// ScriptStruct TslGame.AscenderMovementSettings
// Size: 0x20 (Inherited: 0x00)
struct FAscenderMovementSettings {
	float UpwardAcceleration; // 0x00(0x04)
	float DownwardAcceleration; // 0x04(0x04)
	float DownwardAccelerationSprinting; // 0x08(0x04)
	float Friction; // 0x0c(0x04)
	float BrakingFriction; // 0x10(0x04)
	float MaxVelocityUp; // 0x14(0x04)
	float MaxVelocityDown; // 0x18(0x04)
	float MaxVelocityDownSprint; // 0x1c(0x04)
};

// ScriptStruct TslGame.*7382e0731f
// Size: 0x2c (Inherited: 0x00)
struct F*7382e0731f {
	float Height; // 0x00(0x04)
	float *30cd26f29f; // 0x04(0x04)
	float *80f79d0943; // 0x08(0x04)
	float *57caeece0b; // 0x0c(0x04)
	float *f9bc63096e; // 0x10(0x04)
	bool *9d170dc856; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	float *8be264cfec; // 0x18(0x04)
	bool *538b35fc9a; // 0x1c(0x01)
	bool bUseAbsoluteAutoDeployAltitude; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
	float AutoDeployAltitude; // 0x20(0x04)
	float StartDeployAltitude; // 0x24(0x04)
	float *cf30d556a4; // 0x28(0x04)
};

// ScriptStruct TslGame.*36d732cdad
// Size: 0x10 (Inherited: 0x00)
struct F*36d732cdad {
	struct FName *8acc411310; // 0x00(0x08)
	enum class EEmotePlayType *3e66ef72e1; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float *103738f682; // 0x0c(0x04)
};

// ScriptStruct TslGame.*0274cc7bea
// Size: 0x28 (Inherited: 0x00)
struct F*0274cc7bea {
	struct FString StringOptionKey; // 0x00(0x10)
	enum class EGender Gender; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct FString> ZombieOptionValues; // 0x18(0x10)
};

// ScriptStruct TslGame.*1609266660
// Size: 0x18 (Inherited: 0x00)
struct F*1609266660 {
	float BoostGauge; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UClass* Buff; // 0x08(0x08)
	struct FName OverlapId; // 0x10(0x08)
};

// ScriptStruct TslGame.*b31c041b47
// Size: 0x10 (Inherited: 0x00)
struct F*b31c041b47 {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct TslGame.*46842bd19e
// Size: 0x10 (Inherited: 0x00)
struct F*46842bd19e {
	struct UAnimMontage* *6dce130fb0; // 0x00(0x08)
	struct UAnimMontage* *48b2488969; // 0x08(0x08)
};

// ScriptStruct TslGame.*7bf3ddc16b
// Size: 0x20 (Inherited: 0x00)
struct F*7bf3ddc16b {
	struct FString RecordTargetNetId; // 0x00(0x10)
	struct FString RecordTargetName; // 0x10(0x10)
};

// ScriptStruct TslGame.*9f3011d122
// Size: 0x30 (Inherited: 0x00)
struct F*9f3011d122 {
	struct FString EtceteraEventCode; // 0x00(0x10)
	struct FString TargetNetId; // 0x10(0x10)
	struct FString TargetName; // 0x20(0x10)
};

// ScriptStruct TslGame.*159f087644
// Size: 0xa0 (Inherited: 0x00)
struct F*159f087644 {
	struct FString *dc4c0735dc; // 0x00(0x10)
	struct FString *ce7983b0b2; // 0x10(0x10)
	struct FString VictimNetId; // 0x20(0x10)
	struct FString VictimName; // 0x30(0x10)
	struct FString *e0324be508; // 0x40(0x10)
	struct FString *1fe975f39e; // 0x50(0x10)
	struct FString *c2874f8b34; // 0x60(0x10)
	bool *165a53b806; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FString *fa5b163eaf; // 0x78(0x10)
	struct FString *6238bbc9c1; // 0x88(0x10)
	char pad_98[0x8]; // 0x98(0x08)
};

// ScriptStruct TslGame.*eb65f0fdbb
// Size: 0x38 (Inherited: 0x00)
struct F*eb65f0fdbb {
	char pad_0[0x38]; // 0x00(0x38)
};

// ScriptStruct TslGame.*81e0f2c280
// Size: 0x18 (Inherited: 0x00)
struct F*81e0f2c280 {
	struct FName EmoteName; // 0x00(0x08)
	struct FName SectionName; // 0x08(0x08)
	int32 *df3f8aff46; // 0x10(0x04)
	enum class EEmotePlayType *3e482a52f0; // 0x14(0x01)
	bool *7b729a6e1b; // 0x15(0x01)
	bool *82d4eb1d5b; // 0x16(0x01)
	char pad_17[0x1]; // 0x17(0x01)
};

// ScriptStruct TslGame.*c46e097269
// Size: 0xf0 (Inherited: 0x00)
struct F*c46e097269 {
	struct TMap<enum class EMovingState, struct UAnimSequenceBase*> *847eb5c362; // 0x00(0x50)
	struct TMap<enum class EMovingState, struct UAnimSequenceBase*> *91b92d29fc; // 0x50(0x50)
	struct TMap<enum class EMovingState, struct UAnimSequenceBase*> *a6ff4a60ad; // 0xa0(0x50)
};

// ScriptStruct TslGame.*c99ac095a2
// Size: 0x50 (Inherited: 0x00)
struct F*c99ac095a2 {
	struct TMap<enum class EThrowableState, struct FStringArray> *310da13160; // 0x00(0x50)
};

// ScriptStruct TslGame.*805b341d27
// Size: 0x50 (Inherited: 0x00)
struct F*805b341d27 {
	struct TMap<struct FName, struct FString> *3829d39bca; // 0x00(0x50)
};

// ScriptStruct TslGame.*3fd8faa2f0
// Size: 0x01 (Inherited: 0x00)
struct F*3fd8faa2f0 {
	char pad_0[0x1]; // 0x00(0x01)
};

// ScriptStruct TslGame.*1878dd6c15
// Size: 0x01 (Inherited: 0x00)
struct F*1878dd6c15 {
	char pad_0[0x1]; // 0x00(0x01)
};

// ScriptStruct TslGame.*f0b4182e51
// Size: 0x01 (Inherited: 0x00)
struct F*f0b4182e51 {
	char pad_0[0x1]; // 0x00(0x01)
};

// ScriptStruct TslGame.*40278cee41
// Size: 0x10 (Inherited: 0x00)
struct F*40278cee41 {
	struct TArray<enum class *67c9942ec7> *6f8d605de4; // 0x00(0x10)
};

// ScriptStruct TslGame.*0f4918c7c8
// Size: 0x02 (Inherited: 0x00)
struct F*0f4918c7c8 {
	enum class *67c9942ec7 *99481c20ac; // 0x00(0x01)
	char pad_1[0x1]; // 0x01(0x01)
};

// ScriptStruct TslGame.AttackMode
// Size: 0x20 (Inherited: 0x00)
struct FAttackMode {
	float *5143457395; // 0x00(0x04)
	int32 AttackId; // 0x04(0x04)
	float *537dd60d24; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<enum class EWeaponClass> *de727ebc5c; // 0x10(0x10)
};

// ScriptStruct TslGame.*94f6550138
// Size: 0x10 (Inherited: 0x00)
struct F*94f6550138 {
	int32 *6d7d4b6825; // 0x00(0x04)
	float *3992220de9; // 0x04(0x04)
	int32 *38c9d07251; // 0x08(0x04)
	int32 *f52700a959; // 0x0c(0x04)
};

// ScriptStruct TslGame.*e53b4b7b69
// Size: 0x14 (Inherited: 0x00)
struct F*e53b4b7b69 {
	struct FVector Center; // 0x00(0x0c)
	float Radius; // 0x0c(0x04)
	char pad_10[0x4]; // 0x10(0x04)
};

// ScriptStruct TslGame.*316d6c5de5
// Size: 0x18 (Inherited: 0x00)
struct F*316d6c5de5 {
	enum class EGender Gender; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FString> *639bbf9531; // 0x08(0x10)
};

// ScriptStruct TslGame.*841e4e1d05
// Size: 0x18 (Inherited: 0x00)
struct F*841e4e1d05 {
	struct FName *08db616b8e; // 0x00(0x08)
	int32 *d59512dc51; // 0x08(0x04)
	int32 *8185a7230f; // 0x0c(0x04)
	int32 *e67c6c7fa5; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*0563f0c570
// Size: 0x08 (Inherited: 0x00)
struct F*0563f0c570 {
	float Distance; // 0x00(0x04)
	enum class ETargetingType TargetingMode; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct TslGame.*aebe4abbdd
// Size: 0x18 (Inherited: 0x00)
struct F*aebe4abbdd {
	int32 *fae3d0713e; // 0x00(0x04)
	float *a7e23d2bf3; // 0x04(0x04)
	struct TArray<struct F*0d0994de4f> *57633d1895; // 0x08(0x10)
};

// ScriptStruct TslGame.*0d0994de4f
// Size: 0x18 (Inherited: 0x00)
struct F*0d0994de4f {
	int32 *b16334f3be; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct F*a7b1b1b613> Item; // 0x08(0x10)
};

// ScriptStruct TslGame.*a7b1b1b613
// Size: 0x18 (Inherited: 0x00)
struct F*a7b1b1b613 {
	enum class EAIEquipSpawnItemType *505b924fe4; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName Item; // 0x08(0x08)
	int32 Count; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*2a328b12be
// Size: 0x08 (Inherited: 0x00)
struct F*2a328b12be {
	enum class EAITriggerAttrType *8306953f94; // 0x00(0x01)
	enum class EAIAttrCompareType CompareType; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	int32 *d1bb1c2a3c; // 0x04(0x04)
};

// ScriptStruct TslGame.*2fb357946d
// Size: 0x08 (Inherited: 0x00)
struct F*2fb357946d {
	int32 Probability; // 0x00(0x04)
	int32 *8a25344cfa; // 0x04(0x04)
};

// ScriptStruct TslGame.*e255185e6f
// Size: 0x02 (Inherited: 0x00)
struct F*e255185e6f {
	enum class ECollisionChannel Channel; // 0x00(0x01)
	enum class ECollisionResponse Response; // 0x01(0x01)
};

// ScriptStruct TslGame.*9924d69359
// Size: 0x28 (Inherited: 0x08)
struct F*9924d69359 : FTableRowBase {
	bool bUseCharacterHitFeedback; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FLinearColor PartsColor; // 0x0c(0x10)
	float DamageReduceMultiplier; // 0x1c(0x04)
	enum class EDamageZoneType PartsDamageZoneType; // 0x20(0x01)
	enum class EDamageReason PartsDamageReason; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
};

// ScriptStruct TslGame.*83f3fd111a
// Size: 0x18 (Inherited: 0x00)
struct F*83f3fd111a {
	struct FLinearColor *4c3c5eeffe; // 0x00(0x10)
	enum class EDamageReason *c2874f8b34; // 0x10(0x01)
	enum class EDamageZoneType *821319c698; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	float *7ccb14a3f1; // 0x14(0x04)
};

// ScriptStruct TslGame.*418624bc68
// Size: 0x20 (Inherited: 0x00)
struct F*418624bc68 {
	struct UTexture2D* PartsTargetImage; // 0x00(0x08)
	struct FString *536a33049b; // 0x08(0x10)
	bool bUsingCharacterHitFeedback; // 0x18(0x01)
	bool bUsingDamageIndicator; // 0x19(0x01)
	char pad_1A[0x6]; // 0x1a(0x06)
};

// ScriptStruct TslGame.*2ef28fbee3
// Size: 0x200 (Inherited: 0x08)
struct F*2ef28fbee3 : FTableRowBase {
	struct F*19b9117a17 *1f8da2445d; // 0x08(0x88)
	struct F*19b9117a17 *6378e4cd64; // 0x90(0x88)
	struct TArray<struct FText> *0a57afe7e7; // 0x118(0x10)
	struct TArray<struct FText> *3326e60431; // 0x128(0x10)
	struct TArray<struct FText> *fdfc1b4e4e; // 0x138(0x10)
	struct TArray<struct FText> *bfaa9fff78; // 0x148(0x10)
	struct TArray<struct F*0a7f75eeea> *24c8029191; // 0x158(0x10)
	struct TArray<struct F*0a7f75eeea> *7b839650ca; // 0x168(0x10)
	struct F*0a7f75eeea *7b1298e1df; // 0x178(0x38)
	struct F*0a7f75eeea *67a094acfc; // 0x1b0(0x38)
	struct TArray<struct F*214d2a89ad> *8b008920a0; // 0x1e8(0x10)
	struct FName *57b6dd4a05; // 0x1f8(0x08)
};

// ScriptStruct TslGame.*214d2a89ad
// Size: 0x48 (Inherited: 0x00)
struct F*214d2a89ad {
	struct F*eded1f3571 *d9145b9245; // 0x00(0x20)
	struct F*eded1f3571 *10682e18fd; // 0x20(0x20)
	float *1bf4622e26; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// ScriptStruct TslGame.*eded1f3571
// Size: 0x20 (Inherited: 0x00)
struct F*eded1f3571 {
	struct FString *bbd4c493bd; // 0x00(0x10)
	struct FString *1ed1efd3cf; // 0x10(0x10)
};

// ScriptStruct TslGame.*0a7f75eeea
// Size: 0x38 (Inherited: 0x00)
struct F*0a7f75eeea {
	struct FText *c5fddece52; // 0x00(0x18)
	struct FText *fbb2aba1aa; // 0x18(0x18)
	bool *48c35fdb26; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*19b9117a17
// Size: 0x88 (Inherited: 0x00)
struct F*19b9117a17 {
	struct FText *93b5595f8b; // 0x00(0x18)
	struct UPlatformMediaSource* *e5589784b8; // 0x18(0x08)
	struct UAkAudioEvent* *c463cfd3e4; // 0x20(0x08)
	struct FText *0d31bf8c90; // 0x28(0x18)
	struct FText *11cb9eeba1; // 0x40(0x18)
	struct FText *cf269939d6; // 0x58(0x18)
	struct FText *1e03aa97bf; // 0x70(0x18)
};

// ScriptStruct TslGame.*57d9d15df4
// Size: 0xa8 (Inherited: 0x00)
struct F*57d9d15df4 {
	bool bUseBurstRecoilMap; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D BurstRecoilInMap; // 0x04(0x08)
	struct FVector2D BurstRecoilOutMap; // 0x0c(0x08)
	float RecoilKickADS; // 0x14(0x04)
	float RecoilKick_MovementSpeedMax; // 0x18(0x04)
	float RecoilKick_MovementMaxMultiplier; // 0x1c(0x04)
	struct FVector RecoilADSSocketOffsetScale; // 0x20(0x0c)
	float DeviationRecoilGain; // 0x2c(0x04)
	float DeviationRecoilGainAim; // 0x30(0x04)
	float DeviationRecoilGainADS; // 0x34(0x04)
	float VerticalRecoilMin; // 0x38(0x04)
	float VerticalRecoilMax; // 0x3c(0x04)
	float VerticalRecoilRecoveryMin; // 0x40(0x04)
	float VerticalRecoilVariation; // 0x44(0x04)
	float VerticalRecoveryModifier; // 0x48(0x04)
	float VerticalRecoveryClamp; // 0x4c(0x04)
	float VerticalRecoveryMax; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct U*59a0aeaef9* RecoilCurve; // 0x58(0x08)
	float RecoilSpeed_Vertical; // 0x60(0x04)
	float RecoilSpeed_Horizontal; // 0x64(0x04)
	float RecoverySpeed_Vertical; // 0x68(0x04)
	float RecoilValue_Climb; // 0x6c(0x04)
	float RecoilValue_Fall; // 0x70(0x04)
	float RecoilModifier_Stand; // 0x74(0x04)
	float RecoilModifier_Crouch; // 0x78(0x04)
	float RecoilModifier_Prone; // 0x7c(0x04)
	float RecoilHorizontalMinScalar; // 0x80(0x04)
	struct FVector2D RecoilStartTimeInMap; // 0x84(0x08)
	struct FVector2D RecoilStartTimeOutMap; // 0x8c(0x08)
	struct FVector2D RecoilBlendInInMap; // 0x94(0x08)
	struct FVector2D RecoilBlendInOutMap; // 0x9c(0x08)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.WeaponAnimConfig
// Size: 0x1c0 (Inherited: 0x00)
struct FWeaponAnimConfig {
	char *d0a932a0f1 : 1; // 0x00(0x01)
	char pad_0_1 : 7; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UBlendSpace1D* *5306202f49; // 0x08(0x08)
	struct UBlendSpaceBase* *47b490521f; // 0x10(0x08)
	struct UAnimMontage* *334b1bdd3a; // 0x18(0x08)
	struct UAnimMontage* *0e1ba8c77f; // 0x20(0x08)
	struct UAnimMontage* *3f74fd213f; // 0x28(0x08)
	struct UAnimMontage* *23ef5fc053; // 0x30(0x08)
	struct UAnimMontage* *4416daad5d; // 0x38(0x08)
	struct UAnimMontage* *46a389204a; // 0x40(0x08)
	struct UAnimMontage* *3d1dc29e5e; // 0x48(0x08)
	struct UAnimMontage* *7475428885; // 0x50(0x08)
	struct UAnimMontage* *2ced9c2fa1; // 0x58(0x08)
	struct UAnimMontage* *aa22d7ca47; // 0x60(0x08)
	struct UAnimMontage* *f3b7dcfff9; // 0x68(0x08)
	enum class EWeaponClass *4e9423fead; // 0x70(0x01)
	bool *629925f4e7; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float *2464c506a5; // 0x74(0x04)
	float *24b8256a45; // 0x78(0x04)
	float *4076794d5d; // 0x7c(0x04)
	float *3000f18c91; // 0x80(0x04)
	float *038d68e305; // 0x84(0x04)
	bool *88b582f232; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	float *871e81db9a; // 0x8c(0x04)
	float *7162419703; // 0x90(0x04)
	float *7e62a3786b; // 0x94(0x04)
	bool *066acb56eb; // 0x98(0x01)
	bool *73dc799e90; // 0x99(0x01)
	char pad_9A[0x2]; // 0x9a(0x02)
	int32 *45605ce1ac; // 0x9c(0x04)
	struct UClass* *feb3d89748; // 0xa0(0x08)
	struct UClass* *0f438b7f5a; // 0xa8(0x08)
	struct UClass* *7221190341; // 0xb0(0x08)
	struct UClass* *fc411c0d71; // 0xb8(0x08)
	struct UCameraAnim* *bbace9018d; // 0xc0(0x08)
	float RecoilKickADS; // 0xc8(0x04)
	float RecoilKick_MovementSpeedMax; // 0xcc(0x04)
	float RecoilKick_MovementMaxMultiplier; // 0xd0(0x04)
	struct FVector RecoilADSSocketOffsetScale; // 0xd4(0x0c)
	struct FVector *5941229a80; // 0xe0(0x0c)
	struct FVector *08e12b500a; // 0xec(0x0c)
	float *d03cfbcb90; // 0xf8(0x04)
	float *a690580d13; // 0xfc(0x04)
	bool bUseBurstRecoilMap; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	struct FVector2D BurstRecoilInMap; // 0x104(0x08)
	struct FVector2D BurstRecoilOutMap; // 0x10c(0x08)
	float *193cbac887; // 0x114(0x04)
	struct TMap<enum class EAnimStance, float> *20936882b7; // 0x118(0x50)
	struct TMap<enum class EAnimStance, float> *14dd352447; // 0x168(0x50)
	float *a42dd79fad; // 0x1b8(0x04)
	char pad_1BC[0x4]; // 0x1bc(0x04)
};

// ScriptStruct TslGame.WeaponDeviationConfig
// Size: 0x6c (Inherited: 0x00)
struct FWeaponDeviationConfig {
	float *0a3fe9d0e8; // 0x00(0x04)
	float *79127c195f; // 0x04(0x04)
	float MOA; // 0x08(0x04)
	float DeviationRecoilGain; // 0x0c(0x04)
	float DeviationRecoilGainAim; // 0x10(0x04)
	float DeviationRecoilGainADS; // 0x14(0x04)
	float *115bdfc36c; // 0x18(0x04)
	float *69c88f7481; // 0x1c(0x04)
	float *452046de1d; // 0x20(0x04)
	float *ed89b7e7fb; // 0x24(0x04)
	float *3e2344e67b; // 0x28(0x04)
	float *23ff3de337; // 0x2c(0x04)
	float *a3dcae4ed5; // 0x30(0x04)
	float *dc563ed116; // 0x34(0x04)
	float *864ba35316; // 0x38(0x04)
	float *d8b0e9dcaf; // 0x3c(0x04)
	float *f46abf2b87; // 0x40(0x04)
	float *230eac726a; // 0x44(0x04)
	float *66c79cd5c4; // 0x48(0x04)
	float *c4ec78de85; // 0x4c(0x04)
	float *ace743ad08; // 0x50(0x04)
	float *67aafb7d1c; // 0x54(0x04)
	float *c744a02fe1; // 0x58(0x04)
	float *ed4d6e3052; // 0x5c(0x04)
	float *16398b470a; // 0x60(0x04)
	float *9630c14220; // 0x64(0x04)
	float *5e1e221f0b; // 0x68(0x04)
};

// ScriptStruct TslGame.*1b1e33cc93
// Size: 0x2c0 (Inherited: 0x00)
struct F*1b1e33cc93 {
	struct FName *08db616b8e; // 0x00(0x08)
	struct UParticleSystem* *883bd075f7; // 0x08(0x08)
	int32 *0cbf8a6500; // 0x10(0x04)
	int32 *bca951e4af; // 0x14(0x04)
	bool bUseGameplayTracers; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct UClass* GameplayTracerClassOverride; // 0x20(0x08)
	int32 GameplayTracerAmmoModOverride; // 0x28(0x04)
	int32 GameplayTracerAmmoMinOverride; // 0x2c(0x04)
	int32 *74f3fd9761; // 0x30(0x04)
	float TimeBetweenShots; // 0x34(0x04)
	struct TArray<struct F*19d05f50bc> AttachmentTagData; // 0x38(0x10)
	int32 RPM; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
