// WidgetBlueprintGeneratedClass UI_TeamManagement.UI_TeamManagement_C
// Size: 0x568 (Inherited: 0x528)
struct UUI_TeamManagement_C : U*5dd8e6c560 {
	struct U*54cc75d10f* GuideRankedMode[0x08]; // 0x528(0x08)
	struct UHorizontalBox* RankedMode_HorizontalBox[0x08]; // 0x530(0x08)
	struct UWrapBox* TeamList_WrapBox[0x08]; // 0x538(0x08)
	struct UScrollBox* TeamScrollBox[0x08]; // 0x540(0x08)
	struct UUI_TeamManagementInfo_C* UI_TeamManagementInfo[0x08]; // 0x548(0x08)
	struct UUI_TeamManagementInfo_C* UI_TeamManagementInfo_C_1[0x08]; // 0x550(0x08)
	struct UUI_TeamManagementInfo_C* UI_TeamManagementInfo_C_2[0x08]; // 0x558(0x08)
	struct UUI_TeamManagementInfo_C* UI_TeamManagementInfo_C_3[0x08]; // 0x560(0x08)
};

