// WidgetBlueprintGeneratedClass UI_TeamManagementInfo.UI_TeamManagementInfo_C
// Size: 0xbb8 (Inherited: 0xb00)
struct UUI_TeamManagementInfo_C : U*ae14e47ff3 {
	struct U*54cc75d10f* OnSpeak; // 0xb00(0x08)
	struct U*54cc75d10f* GuideDimmed; // 0xb08(0x08)
	struct U*54cc75d10f* GuideRankedMode; // 0xb10(0x08)
	struct U*54cc75d10f* GuideConsoleFocus; // 0xb18(0x08)
	struct U*54cc75d10f* GuideConsoleNormal; // 0xb20(0x08)
	struct U*54cc75d10f* GuidePCHover; // 0xb28(0x08)
	struct U*54cc75d10f* GuidePCNormalMySelf; // 0xb30(0x08)
	struct U*54cc75d10f* GuidePCNormalOthers; // 0xb38(0x08)
	struct UWidgetSwitcher* AudioSwitcher; // 0xb40(0x08)
	struct UImage* CoverFocusImage; // 0xb48(0x08)
	struct UImage* CoverHoverImage; // 0xb50(0x08)
	struct UImage* FocusImage; // 0xb58(0x08)
	struct UWidgetSwitcher* MicButtonSwitcher; // 0xb60(0x08)
	struct UButton* MicOffButton; // 0xb68(0x08)
	struct UButton* MicOnButton; // 0xb70(0x08)
	struct UHorizontalBox* RankedMode_HorizontalBox; // 0xb78(0x08)
	struct UButton* ReportButton; // 0xb80(0x08)
	struct UWidgetSwitcher* SpeakerButtonSwitcher; // 0xb88(0x08)
	struct UButton* SpeakerOffButton; // 0xb90(0x08)
	struct UButton* SpeakerOnButton; // 0xb98(0x08)
	struct UTextBlock* ValueText; // 0xba0(0x08)
	struct UImage* VolumeGauge; // 0xba8(0x08)
	struct USlider* VolumeSlider; // 0xbb0(0x08)
};

