// WidgetBlueprintGeneratedClass UserPlatformImageWidget.UserPlatformImageWidget_C
// Size: 0x4d0 (Inherited: 0x468)
struct UUserPlatformImageWidget_C : U*24809ef0d2 {
	struct F*abc8f374e0 UberGraphFrame; // 0x468(0x08)
	struct USizeBox* PlatformSizebox; // 0x470(0x08)
	struct UImage* Ps4Controller; // 0x478(0x08)
	struct UImage* QuailController; // 0x480(0x08)
	struct UImage* UserCommon; // 0x488(0x08)
	struct UImage* UserPs4; // 0x490(0x08)
	struct UImage* UserQuail; // 0x498(0x08)
	struct UWidgetSwitcher* UserType; // 0x4a0(0x08)
	struct UImage* UserXbox; // 0x4a8(0x08)
	struct UImage* XboxController; // 0x4b0(0x08)
	struct FLinearColor IconColor; // 0x4b8(0x10)
	struct FVector2D IconSize; // 0x4c8(0x08)

	void PreConstruct(); // Function UserPlatformImageWidget.UserPlatformImageWidget_C.PreConstruct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x2cd4ac
	int32 ExecuteUbergraph_UserPlatformImageWidget(float CallFunc_BreakVector2D_X); // Function UserPlatformImageWidget.UserPlatformImageWidget_C.ExecuteUbergraph_UserPlatformImageWidget //  // @ game+0x2cd4ac
};

