// ScriptStruct EngineMessages.*3139cafb71
// Size: 0x18 (Inherited: 0x00)
struct F*3139cafb71 {
	struct FString Text; // 0x00(0x10)
	double TimeSeconds; // 0x10(0x08)
};

// ScriptStruct EngineMessages.*8b04955b9e
// Size: 0x10 (Inherited: 0x00)
struct F*8b04955b9e {
	struct FString UserName; // 0x00(0x10)
};

// ScriptStruct EngineMessages.*054cd2a07f
// Size: 0x20 (Inherited: 0x00)
struct F*054cd2a07f {
	struct FString Command; // 0x00(0x10)
	struct FString UserName; // 0x10(0x10)
};

// ScriptStruct EngineMessages.*ac5f737ae8
// Size: 0x20 (Inherited: 0x00)
struct F*ac5f737ae8 {
	struct FString UserName; // 0x00(0x10)
	struct FString *4de7d4e36b; // 0x10(0x10)
};

// ScriptStruct EngineMessages.*55ac0b37ce
// Size: 0x20 (Inherited: 0x00)
struct F*55ac0b37ce {
	struct FString UserName; // 0x00(0x10)
	struct FString *0823ff956a; // 0x10(0x10)
};

// ScriptStruct EngineMessages.*6dbf6337a2
// Size: 0x50 (Inherited: 0x00)
struct F*6dbf6337a2 {
	struct FString CurrentLevel; // 0x00(0x10)
	int32 EngineVersion; // 0x10(0x04)
	bool *9816c4a151; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	struct FGuid InstanceId; // 0x18(0x10)
	struct FString InstanceType; // 0x28(0x10)
	struct FGuid SessionId; // 0x38(0x10)
	float *5a274d5130; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// ScriptStruct EngineMessages.*bc0b2cf6f8
// Size: 0x01 (Inherited: 0x00)
struct F*bc0b2cf6f8 {
	char pad_0[0x1]; // 0x00(0x01)
};

