// BlueprintGeneratedClass P_Environment_Smoke_03_BP_Lobby.P_Environment_Smoke_03_BP_Lobby_C
// Size: 0x594 (Inherited: 0x520)
struct AP_Environment_Smoke_03_BP_Lobby_C : ATslParticleEnvironment {
	struct FVector SpawnBoxMax; // 0x520(0x0c)
	struct FVector SpawnBoxMin; // 0x52c(0x0c)
	struct FVector Color; // 0x538(0x0c)
	float SpawnRate; // 0x544(0x04)
	struct FVector SizeMax; // 0x548(0x0c)
	struct FVector SizeMin; // 0x554(0x0c)
	struct FVector VelocityMax; // 0x560(0x0c)
	struct FVector VelocityMin; // 0x56c(0x0c)
	float LifeTime; // 0x578(0x04)
	float LifeTimeLow; // 0x57c(0x04)
	float PannerTime; // 0x580(0x04)
	float PannerTimeLow; // 0x584(0x04)
	float Alpha; // 0x588(0x04)
	float RotationRateMax; // 0x58c(0x04)
	float RotationRateMin; // 0x590(0x04)

	struct TArray<struct FParticleSysParam> UserConstructionScript(); // Function P_Environment_Smoke_03_BP_Lobby.P_Environment_Smoke_03_BP_Lobby_C.UserConstructionScript // Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent // @ game+0x22c9a0
};

