// ScriptStruct RoadRuntime.*c75887bab4
// Size: 0x20 (Inherited: 0x00)
struct F*c75887bab4 {
	struct UStaticMesh* Prototype; // 0x00(0x08)
	struct AActor* Owner; // 0x08(0x08)
	struct UStaticMeshComponent* SideMesh; // 0x10(0x08)
	int32 *5b5e060625; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*d270fe3eca
// Size: 0x18 (Inherited: 0x00)
struct F*d270fe3eca {
	struct UClass* Prototype; // 0x00(0x08)
	struct AActor* *0a92c99ae5; // 0x08(0x08)
	int32 *5b5e060625; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct RoadRuntime.*14d6a803f5
// Size: 0x20 (Inherited: 0x00)
struct F*14d6a803f5 {
	struct UStaticMesh* Prototype; // 0x00(0x08)
	struct AActor* Owner; // 0x08(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* *c2a1582b25; // 0x10(0x08)
	int32 *5b5e060625; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*983225c887
// Size: 0x88 (Inherited: 0x00)
struct F*983225c887 {
	struct AActor* Owner; // 0x00(0x08)
	struct UStaticMesh* Prototype; // 0x08(0x08)
	struct UStaticMesh* *896c12aeb9; // 0x10(0x08)
	struct UStaticMesh* *5224356d04; // 0x18(0x08)
	struct TArray<struct USplineMeshComponent*> *c657dd1e78; // 0x20(0x10)
	struct USplineComponent* Spline; // 0x30(0x08)
	int32 *7c5ffc06cd; // 0x38(0x04)
	int32 *5b5e060625; // 0x3c(0x04)
	int32 *804d95d65d; // 0x40(0x04)
	int32 *d804bf5b88; // 0x44(0x04)
	struct FVector Offset; // 0x48(0x0c)
	struct FVector Scale; // 0x54(0x0c)
	bool *4adda85c45; // 0x60(0x01)
	bool StartEnable; // 0x61(0x01)
	bool EndEnable; // 0x62(0x01)
	char pad_63[0x5]; // 0x63(0x05)
	struct FInterpCurveVector *54b9075731; // 0x68(0x18)
	float *32cf77023b; // 0x80(0x04)
	float *be8a13b7bc; // 0x84(0x04)
};

// ScriptStruct RoadRuntime.*cf969401df
// Size: 0x20 (Inherited: 0x00)
struct F*cf969401df {
	struct UClass* Prototype; // 0x00(0x08)
	struct TArray<struct AActor*> *aaf20daa29; // 0x08(0x10)
	int32 *5b5e060625; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*a7b10627df
// Size: 0x20 (Inherited: 0x00)
struct F*a7b10627df {
	struct FVector Position; // 0x00(0x0c)
	struct FVector Tangent; // 0x0c(0x0c)
	float Scale; // 0x18(0x04)
	float Roll; // 0x1c(0x04)
};

