// Class TslGame.AbstractRespawnProcessor
// Size: 0x480 (Inherited: 0x3f8)
struct AAbstractRespawnProcessor : AActor {
	float *79332c8c7b; // 0x3f8(0x04)
	float *0e13568b57; // 0x3fc(0x04)
	bool *3d0dff7103; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct TArray<struct UClass*> *f6c97c1540; // 0x408(0x10)
	struct FMulticastDelegate OnRespawnStarted; // 0x418(0x10)
	struct FMulticastDelegate OnRespawnEnded; // 0x428(0x10)
	struct FMulticastDelegate OnRespawned; // 0x438(0x10)
	struct FMulticastDelegate OnCharacterDead; // 0x448(0x10)
	struct FMulticastDelegate OnRespawnedByRound; // 0x458(0x10)
	struct TArray<struct F*77e367dd3f> *b916390b42; // 0x468(0x10)
	char pad_478[0x8]; // 0x478(0x08)

	void OnCharactersRespawnedImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharactersRespawnedImpl // Native|Protected // @ game+0x58db6b0
	int32 OnRoundUpdatedImpl(); // Function TslGame.AbstractRespawnProcessor.OnRoundUpdatedImpl // Native|Protected // @ game+0x58db6c8
	struct ATslCharacter* *c40694675d(); // Function TslGame.AbstractRespawnProcessor.*c40694675d // Native|Protected // @ game+0x58db5d0
	struct ATslPlayerState* OnCharacterDeadImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharacterDeadImpl // Native|Protected // @ game+0x58db53c
};

// Class TslGame.*3d79f69595
// Size: 0x600 (Inherited: 0x3a8)
struct U*3d79f69595 : UAnimInstance {
	struct ATslCharacter* *955dd12067; // 0x3a8(0x08)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct FRotator ParachuteRotation_CP; // 0x3b8(0x0c)
	float ParaTurn_CP; // 0x3c4(0x04)
	float ParaPitch_CP; // 0x3c8(0x04)
	bool bIsReleased_CP; // 0x3cc(0x01)
	bool bIsReplayJumping_CP; // 0x3cd(0x01)
	char pad_3CE[0x2]; // 0x3ce(0x02)
	struct FTransform IK_L_CP; // 0x3d0(0x30)
	struct FTransform IK_R_CP; // 0x400(0x30)
	struct FVector IK_L_Location_CP; // 0x430(0x0c)
	struct FRotator IK_L_Rotation_CP; // 0x43c(0x0c)
	struct FVector IK_R_Location_CP; // 0x448(0x0c)
	struct FRotator IK_R_Rotation_CP; // 0x454(0x0c)
	float EnableIKAlpha_CP; // 0x460(0x04)
	float RigidbodyAlpha; // 0x464(0x04)
	float PhysicsBlendAlpha; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct FTransform IK_L_Handle_CP; // 0x470(0x30)
	struct FTransform IK_R_Handle_CP; // 0x4a0(0x30)
	struct FTransform IK_L_Strap_CP; // 0x4d0(0x30)
	struct FTransform IK_R_Strap_CP; // 0x500(0x30)
	float IK_L_Handle_Alpha_CP; // 0x530(0x04)
	float IK_R_Handle_Alpha_CP; // 0x534(0x04)
	float RollTendency; // 0x538(0x04)
	float PitchTendency; // 0x53c(0x04)
	float TendencyFrame; // 0x540(0x04)
	bool bIsLanding_CP; // 0x544(0x01)
	char pad_545[0x3]; // 0x545(0x03)
	float LandingAlpha_CP; // 0x548(0x04)
	bool bIsMoving_CP; // 0x54c(0x01)
	bool bIsCollapsed_CP; // 0x54d(0x01)
	bool bIsManualCutoff_CP; // 0x54e(0x01)
	bool bIsAutoCutoff_CP; // 0x54f(0x01)
	float ParaAnimTimeFromStart_CP; // 0x550(0x04)
	float ClientRotYawScale; // 0x554(0x04)
	bool bUseNewParachuteAnims; // 0x558(0x01)
	char pad_559[0x7]; // 0x559(0x07)
	struct FName LeftItemBoneName; // 0x560(0x08)
	struct FName RightItemBoneName; // 0x568(0x08)
	struct FName LeftHandleBoneName; // 0x570(0x08)
	struct FName RightHandleBoneName; // 0x578(0x08)
	struct FName LeftStrapBoneName; // 0x580(0x08)
	struct FName RightStrapBoneName; // 0x588(0x08)
	float LandingCheckVelocityScalar; // 0x590(0x04)
	float LandingCheckStartAltitude; // 0x594(0x04)
	float LandingCheckTickTime; // 0x598(0x04)
	struct FVector TerminalVelocity_CP; // 0x59c(0x0c)
	float *43a5bd48d1; // 0x5a8(0x04)
	float *df18905161; // 0x5ac(0x04)
	struct FVector *e9d0be147b; // 0x5b0(0x0c)
	float *c3d67cdb74; // 0x5bc(0x04)
	struct TArray<struct FName> *d1fc1ce941; // 0x5c0(0x10)
	bool *58fc94e5b9; // 0x5d0(0x01)
	char pad_5D1[0x3]; // 0x5d1(0x03)
	struct FVector *a166b39d73; // 0x5d4(0x0c)
	int32 *45a75ab133; // 0x5e0(0x04)
	char pad_5E4[0x1c]; // 0x5e4(0x1c)

	void *4f82ee2edc(); // Function TslGame.*3d79f69595.*4f82ee2edc // Final|Native|Public|BlueprintCallable // @ game+0xb45ccc
	void DetachPara_BP(); // Function TslGame.*3d79f69595.DetachPara_BP // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void *d0883ceaf9(); // Function TslGame.*3d79f69595.*d0883ceaf9 // Final|Native|Public|BlueprintCallable // @ game+0x58db528
	void *cbbafe78e5(); // Function TslGame.*3d79f69595.*cbbafe78e5 // Final|Native|Public|BlueprintCallable // @ game+0x58db510
};

// Class TslGame.*6caef458b0
// Size: 0x318 (Inherited: 0x258)
struct U*6caef458b0 : UUserWidget {
	struct U*89f9a84286* *d2f0949483; // 0x258(0x08)
	char pad_260[0x48]; // 0x260(0x48)
	struct FMulticastDelegate WidgetDestroyEventDelegate; // 0x2a8(0x10)
	char pad_2B8[0x60]; // 0x2b8(0x60)

	void SetupInputForBlueprint(); // Function TslGame.*6caef458b0.SetupInputForBlueprint // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	bool IsSpectating(); // Function TslGame.*6caef458b0.IsSpectating // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592e6f0
	void StopListeningForAllInputAxises(); // Function TslGame.*6caef458b0.StopListeningForAllInputAxises // Final|Native|Public|BlueprintCallable // @ game+0x5935bf4
	bool *6ea1441c28(); // Function TslGame.*6caef458b0.*6ea1441c28 // Final|Native|Private // @ game+0x5930788
	struct ATslCharacter* GetCachedCharacter(); // Function TslGame.*6caef458b0.GetCachedCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59280a8
	DelegateProperty ListenForInputAxis(); // Function TslGame.*6caef458b0.ListenForInputAxis // Final|Native|Public|BlueprintCallable // @ game+0x592f2e4
	struct ATslGameState* GetCachedGameState(); // Function TslGame.*6caef458b0.GetCachedGameState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59280cc
	float GetAxisMultiplier(); // Function TslGame.*6caef458b0.GetAxisMultiplier // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5927ed4
	bool IsInLobby(); // Function TslGame.*6caef458b0.IsInLobby // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592d238
	bool IsReplaying(); // Function TslGame.*6caef458b0.IsReplaying // Final|Native|Public|BlueprintCallable // @ game+0x592e1f8
	bool ContainOwnerUserFocus(); // Function TslGame.*6caef458b0.ContainOwnerUserFocus // Final|Native|Public|BlueprintCallable // @ game+0x5925f48
	void TslUserWidgetDestroyEvent__DelegateSignature(); // DelegateFunction TslGame.*6caef458b0.TslUserWidgetDestroyEvent__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x22c9a0
	bool NavigateUserFocus(); // Function TslGame.*6caef458b0.NavigateUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x592fa78
	struct FName *a8c4793475(); // Function TslGame.*6caef458b0.*a8c4793475 // Final|Native|Public // @ game+0x5935c08
	bool ContainUserFocus(); // Function TslGame.*6caef458b0.ContainUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x5925f84
	float GetRawKeyValue(); // Function TslGame.*6caef458b0.GetRawKeyValue // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x592a560
	struct ATslCharacter* GetCachedViewTargetTslCharacter(); // Function TslGame.*6caef458b0.GetCachedViewTargetTslCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59280f0
	struct FEventReply TransferUserFocusThroughReply(); // Function TslGame.*6caef458b0.TransferUserFocusThroughReply // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0x5936430
	struct ATslPlayerState* GetDemoPlayerState(); // Function TslGame.*6caef458b0.GetDemoPlayerState // Final|Native|Public|BlueprintCallable // @ game+0x5928a8c
	bool IsObserving(); // Function TslGame.*6caef458b0.IsObserving // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592df14
	struct UTslGameUserSettings* GetTslGameUserSettings(); // Function TslGame.*6caef458b0.GetTslGameUserSettings // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592b5d0
	struct ULocalPlayer* ClearUserFocus(); // Function TslGame.*6caef458b0.ClearUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x5925034
	bool IsParticipatedInRedeploy(); // Function TslGame.*6caef458b0.IsParticipatedInRedeploy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592dfc0
};

// Class TslGame.*4bb82286ac
// Size: 0x418 (Inherited: 0x318)
struct U*4bb82286ac : U*6caef458b0 {
	char pad_318[0x10]; // 0x318(0x10)
	char bUseEmergingAnimation : 1; // 0x328(0x01)
	char bUseVanishingAnimation : 1; // 0x328(0x01)
	char pad_328_2 : 6; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct F*a2a8693a5f EmergingAnimationBinder; // 0x330(0x20)
	struct F*a2a8693a5f VanishingAnimationBinder; // 0x350(0x20)
	struct U*9c8bfa0aee* Emerging; // 0x370(0x08)
	struct U*9c8bfa0aee* Vanishing; // 0x378(0x08)
	char pad_380[0x18]; // 0x380(0x18)
	enum class ESlateVisibility *e1131b8205; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	float *4f71fadf9c; // 0x39c(0x04)
	char pad_3A0[0x4]; // 0x3a0(0x04)
	int32 phase; // 0x3a4(0x04)
	int32 *914ba3595b; // 0x3a8(0x04)
	bool bUseFakeCursor; // 0x3ac(0x01)
	char pad_3AD[0x3]; // 0x3ad(0x03)
	struct F*a159aaccd9 *40cb1a123a; // 0x3b0(0x28)
	struct F*54c30817ee *fdee1041a0; // 0x3d8(0x20)
	struct TArray<struct F*f741935488> *4abe9efb43; // 0x3f8(0x10)
	struct TArray<struct F*76770e8ff8> *3ab7346d46; // 0x408(0x10)

	bool IsMouseOn(); // Function TslGame.*4bb82286ac.IsMouseOn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592dd50
	void OnFakeCursorDown(); // Function TslGame.*4bb82286ac.OnFakeCursorDown // Native|Protected // @ game+0x3bfd9c
	void OnFakeCursorUp(); // Function TslGame.*4bb82286ac.OnFakeCursorUp // Native|Protected // @ game+0x592fd50
	void UnBindFakeCursor(); // Function TslGame.*4bb82286ac.UnBindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x5936664
	bool SetFakeMouseMouseButtonDown(); // Function TslGame.*4bb82286ac.SetFakeMouseMouseButtonDown // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x5934074
	bool CheckWantRequestRender(); // Function TslGame.*4bb82286ac.CheckWantRequestRender // Native|Public|BlueprintCallable|BlueprintPure // @ game+0x58e2bac
	float OnFakeCursorY(); // Function TslGame.*4bb82286ac.OnFakeCursorY // Native|Protected // @ game+0x592fe04
	void BindFakeCursor(); // Function TslGame.*4bb82286ac.BindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x59248dc
	void RuntimeInitBP(); // Function TslGame.*4bb82286ac.RuntimeInitBP // BlueprintCosmetic|Event|Protected|BlueprintEvent // @ game+0x22c9a0
	struct UWidget* HandleMainPrepass(); // Function TslGame.*4bb82286ac.HandleMainPrepass // Native|Public // @ game+0x6624c8
	bool SetFakeMouseMouseButtonUp(); // Function TslGame.*4bb82286ac.SetFakeMouseMouseButtonUp // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x593411c
	float OnFakeCursorX(); // Function TslGame.*4bb82286ac.OnFakeCursorX // Native|Protected // @ game+0x592fd68
};

// Class TslGame.RandomBRSubtitleWidget
// Size: 0x4b0 (Inherited: 0x418)
struct URandomBRSubtitleWidget : U*4bb82286ac {
	struct UWidget* RandomBRMarkWidget; // 0x418(0x08)
	struct UWidget* SubtitleWidget; // 0x420(0x08)
	struct UWidget* BlueZoneSubtitleWidget; // 0x428(0x08)
	struct UWidget* ItemSpawnSubtitleWidget; // 0x430(0x08)
	struct UWidget* VehicleSpawnSubtitleWidget; // 0x438(0x08)
	struct UTextBlock* SubtitleText; // 0x440(0x08)
	struct UTextBlock* BlueZoneSubtitleText; // 0x448(0x08)
	struct UTextBlock* ItemSpawnSubtitleText; // 0x450(0x08)
	struct UTextBlock* VehicleSpawnSubtitleText; // 0x458(0x08)
	struct UStringTable* *1bc82ab0b6; // 0x460(0x20)
	struct UDataTable* *e82fc61d8d; // 0x480(0x20)
	char pad_4A0[0x8]; // 0x4a0(0x08)
	float *e7eaf41f2b; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)

	struct FString OnRandomBRKeySetUp(); // Function TslGame.RandomBRSubtitleWidget.OnRandomBRKeySetUp // Final|Native|Private // @ game+0x58eeb0c
	void *762c1d08ef(); // Function TslGame.RandomBRSubtitleWidget.*762c1d08ef // Final|Native|Private // @ game+0x58eb784
};

// Class TslGame.*6fc28110e4
// Size: 0x498 (Inherited: 0x418)
struct U*6fc28110e4 : U*4bb82286ac {
	int32 CheckElapsedTime; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct F*a2a8693a5f IconBlinkingAnimBinder; // 0x420(0x20)
	struct F*62d95f3263 DisplayTextBlock; // 0x440(0x20)
	struct FText DefaultFailureText; // 0x460(0x18)
	struct FText KillcamUnusualMovementText; // 0x478(0x18)
	char pad_490[0x8]; // 0x490(0x08)
};

// Class TslGame.*6f7b809384
// Size: 0x4e8 (Inherited: 0x418)
struct U*6f7b809384 : U*4bb82286ac {
	float *6b89c79405; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct TMap<enum class MatchResultTypeEnum, struct FStringClassReference> MatchResultWidgetSoftRefs; // 0x420(0x50)
	struct UWidgetSwitcher* RootSwitcher; // 0x470(0x08)
	struct TMap<enum class MatchResultTypeEnum, struct UClass*> *1b7a364259; // 0x478(0x50)
	struct UBaseResultWidget* *212a957fcb; // 0x4c8(0x08)
	char pad_4D0[0x18]; // 0x4d0(0x18)

	struct FName UpdateMatchResultWidget(); // Function TslGame.*6f7b809384.UpdateMatchResultWidget // Final|Native|Private // @ game+0x58fa9e8
	void OnReplayJump(); // Function TslGame.*6f7b809384.OnReplayJump // Final|Native|Private // @ game+0x58ef0f4
	void OnPressed_B(); // Function TslGame.*6f7b809384.OnPressed_B // Final|Native|Private // @ game+0x58eeaf8
	void OnReleased_B(); // Function TslGame.*6f7b809384.OnReleased_B // Final|Native|Private // @ game+0x58eed40
	void OnClicked_ButtonLobby(); // Function TslGame.*6f7b809384.OnClicked_ButtonLobby // Final|Native|Private // @ game+0x58e9b38
};

// Class TslGame.*c9a3c1f54b
// Size: 0x560 (Inherited: 0x418)
struct U*c9a3c1f54b : U*4bb82286ac {
	struct UTextBlock* PlayerName_Text; // 0x418(0x08)
	struct F*a2a8693a5f *bf23d7d6ac; // 0x420(0x20)
	struct F*a8249d5e73 *915c9b2805; // 0x440(0x30)
	struct F*62d95f3263 *d6ff39c400; // 0x470(0x20)
	struct F*7b33ced057 *f040dc768d; // 0x490(0x28)
	struct FLinearColor *305c5758d6; // 0x4b8(0x10)
	struct FLinearColor *05f2153927; // 0x4c8(0x10)
	struct FLinearColor *949ab7a2a1; // 0x4d8(0x10)
	struct FLinearColor *53c3f47875; // 0x4e8(0x10)
	struct FLinearColor *277de64064; // 0x4f8(0x10)
	struct FLinearColor *7bd9a1fc2d; // 0x508(0x10)
	struct UTexture2D* *d4a07408a9; // 0x518(0x08)
	struct FText *2509b2b8b8; // 0x520(0x18)
	struct FText *df3b1b377c; // 0x538(0x18)
	struct UAkAudioEvent* *387e493013; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)
};

// Class TslGame.*a4acf5c8ce
// Size: 0x440 (Inherited: 0x418)
struct U*a4acf5c8ce : U*4bb82286ac {
	struct F*aecf96cb1e *4bbb849319; // 0x418(0x28)
};

// Class TslGame.ScreenIndicatorBaseWidget
// Size: 0x440 (Inherited: 0x418)
struct UScreenIndicatorBaseWidget : U*4bb82286ac {
	struct FVector2D ScreenEdgeSize; // 0x418(0x08)
	struct FVector2D IndicatorWidgetSize; // 0x420(0x08)
	char pad_428[0x18]; // 0x428(0x18)
};

// Class TslGame.CaptureObjectIndicatorWidget
// Size: 0x550 (Inherited: 0x440)
struct UCaptureObjectIndicatorWidget : UScreenIndicatorBaseWidget {
	struct F*4cacb53fe6 *4cacb53fe6; // 0x440(0x108)
	struct ACaptureAreaActor* *e2a8e2269b; // 0x548(0x08)
};

// Class TslGame.*415178aac9
// Size: 0x4b0 (Inherited: 0x440)
struct U*415178aac9 : UScreenIndicatorBaseWidget {
	struct UBorder* MarkerBorder; // 0x440(0x08)
	struct UBorder* MapMarkerBorder; // 0x448(0x08)
	struct UWidgetSwitcher* TacticalSwitcher; // 0x450(0x08)
	struct UWidgetSwitcher* MarkerBackgroundSwitcher; // 0x458(0x08)
	struct UCurveFloat* *c435367ffc; // 0x460(0x08)
	struct UCurveFloat* *2eb6e657bf; // 0x468(0x08)
	struct UCurveFloat* *20b1ce0038; // 0x470(0x08)
	struct UCurveFloat* *969e60b9db; // 0x478(0x08)
	float *25e335bdfd; // 0x480(0x04)
	float *08eb937c4d; // 0x484(0x04)
	float *d8c5114379; // 0x488(0x04)
	float *a557a99f0e; // 0x48c(0x04)
	char pad_490[0x20]; // 0x490(0x20)
};

// Class TslGame.*8344ee1230
// Size: 0x530 (Inherited: 0x440)
struct U*8344ee1230 : UScreenIndicatorBaseWidget {
	struct ATslPlayerController* PlayerController; // 0x440(0x08)
	float RemainTime; // 0x448(0x04)
	char pad_44C[0x8]; // 0x44c(0x08)
	float BlinkGaugeRate; // 0x454(0x04)
	float ShowRemainTime; // 0x458(0x04)
	float ShowDistance; // 0x45c(0x04)
	char pad_460[0x8]; // 0x460(0x08)
	struct UCurveFloat* SmokeRemainCurve; // 0x468(0x08)
	struct UCurveFloat* SmokeScaleByDistance; // 0x470(0x08)
	struct UCurveFloat* SmokeAlphaByDistance; // 0x478(0x08)
	struct F*aecf96cb1e *d3d0f267fa; // 0x480(0x28)
	struct F*cfff343e46 *c6317d3438; // 0x4a8(0x28)
	struct F*7691cca8dc *ffccebf655; // 0x4d0(0x28)
	struct F*a8249d5e73 *705f97ad65; // 0x4f8(0x30)
	struct U*395e1535aa* *cc538bf5be; // 0x528(0x08)

	void PlayToNearlyEmptyAnimation(); // Function TslGame.*8344ee1230.PlayToNearlyEmptyAnimation // Event|Protected|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.TeamMarkWidget
// Size: 0x828 (Inherited: 0x440)
struct UTeamMarkWidget : UScreenIndicatorBaseWidget {
	float OffsetZ; // 0x440(0x04)
	float ParachutingOffsetZ; // 0x444(0x04)
	float DeadMarkInvisibleTime; // 0x448(0x04)
	float DeadMarkInvisibleDistance; // 0x44c(0x04)
	float AnimationMaxPercent; // 0x450(0x04)
	float AnimationMaxDistance; // 0x454(0x04)
	float PlatoonOtherSquadInTeamScale; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct F*54c30817ee *9824a148dd; // 0x460(0x20)
	struct F*62d95f3263 *d3684af406; // 0x480(0x20)
	struct F*aecf96cb1e *28084c0bcb; // 0x4a0(0x28)
	struct F*aecf96cb1e *a768a606a3; // 0x4c8(0x28)
	struct F*aecf96cb1e *f444e6ff10; // 0x4f0(0x28)
	struct F*aecf96cb1e *cecc1c8fa2; // 0x518(0x28)
	struct F*aecf96cb1e *7755521826; // 0x540(0x28)
	struct F*aecf96cb1e *6bd31914c3; // 0x568(0x28)
	struct F*aecf96cb1e *26c60c58b0; // 0x590(0x28)
	struct F*aecf96cb1e *90c257fd73; // 0x5b8(0x28)
	struct F*aecf96cb1e *6971b6f943; // 0x5e0(0x28)
	struct F*aecf96cb1e *11b66e6053; // 0x608(0x28)
	struct F*aecf96cb1e *1b2e9f8520; // 0x630(0x28)
	struct F*aecf96cb1e *c00e6a5931; // 0x658(0x28)
	struct F*a8249d5e73 *1cb14881a8; // 0x680(0x30)
	struct F*7691cca8dc *4f2ccffba4; // 0x6b0(0x28)
	struct F*45518ccbeb *c96bf1d865; // 0x6d8(0x20)
	struct F*a2a8693a5f *b296412ec5; // 0x6f8(0x20)
	struct ATeam* TeamMember; // 0x718(0x08)
	float AmingImageAlpha; // 0x720(0x04)
	float ScopingImageAlpha; // 0x724(0x04)
	float AmingTextAlpha; // 0x728(0x04)
	float ScopingTextAlpha; // 0x72c(0x04)
	struct TMap<enum class EGameModeType, struct F*db31a9dd2f> *a29818535b; // 0x730(0x50)
	struct UTexture* *add28c6aa4; // 0x780(0x08)
	struct UTexture* *c600853ea0; // 0x788(0x08)
	struct UTexture* *13363e4696; // 0x790(0x08)
	struct UTexture* *d62c48cb3b; // 0x798(0x08)
	struct UTexture* *87ea73b4a1; // 0x7a0(0x08)
	struct UTexture* *b6404bdf1d; // 0x7a8(0x08)
	struct UTexture* *7d71370afd; // 0x7b0(0x08)
	struct FStringAssetReference *77d87574e4; // 0x7b8(0x10)
	struct UCurveFloat* *c435367ffc; // 0x7c8(0x08)
	struct UCurveFloat* *6c50666a43; // 0x7d0(0x08)
	struct UCurveFloat* *969e60b9db; // 0x7d8(0x08)
	struct UCurveFloat* *aa51601cda; // 0x7e0(0x08)
	char pad_7E8[0x30]; // 0x7e8(0x30)
	struct ATslPlayerState* *be1d393737; // 0x818(0x08)
	char pad_820[0x8]; // 0x820(0x08)

	enum class EDamageTypeCategory NotifyEngageAttacked(); // Function TslGame.TeamMarkWidget.NotifyEngageAttacked // Final|Native|Protected // @ game+0xc22638
};

// Class TslGame.*41a028f244
// Size: 0x830 (Inherited: 0x828)
struct U*41a028f244 : UTeamMarkWidget {
	struct ATslCharacter* *8713609adf; // 0x828(0x08)
};

// Class TslGame.*e9882b7be1
// Size: 0x6a0 (Inherited: 0x440)
struct U*e9882b7be1 : UScreenIndicatorBaseWidget {
	float OffsetZ; // 0x440(0x04)
	float ParachutingOffsetZ; // 0x444(0x04)
	float DeadMarkInvisibleTime; // 0x448(0x04)
	float DeadMarkInvisibleDistance; // 0x44c(0x04)
	float AnimationMaxPercent; // 0x450(0x04)
	float AnimationMaxDistance; // 0x454(0x04)
	float PlatoonOtherSquadInTeamScale; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct F*54c30817ee *9824a148dd; // 0x460(0x20)
	struct F*62d95f3263 *d3684af406; // 0x480(0x20)
	struct F*aecf96cb1e *28084c0bcb; // 0x4a0(0x28)
	struct F*aecf96cb1e *a768a606a3; // 0x4c8(0x28)
	struct F*aecf96cb1e *f444e6ff10; // 0x4f0(0x28)
	struct F*aecf96cb1e *cecc1c8fa2; // 0x518(0x28)
	struct F*aecf96cb1e *7755521826; // 0x540(0x28)
	struct F*aecf96cb1e *6bd31914c3; // 0x568(0x28)
	struct F*aecf96cb1e *26c60c58b0; // 0x590(0x28)
	struct F*aecf96cb1e *90c257fd73; // 0x5b8(0x28)
	struct F*a8249d5e73 *1cb14881a8; // 0x5e0(0x30)
	struct F*7691cca8dc *4f2ccffba4; // 0x610(0x28)
	struct ATslCharacter* DetectionCharacter; // 0x638(0x08)
	float AmingImageAlpha; // 0x640(0x04)
	float ScopingImageAlpha; // 0x644(0x04)
	float AmingTextAlpha; // 0x648(0x04)
	float ScopingTextAlpha; // 0x64c(0x04)
	struct UTexture* *add28c6aa4; // 0x650(0x08)
	struct UTexture* *c600853ea0; // 0x658(0x08)
	struct UTexture* *13363e4696; // 0x660(0x08)
	struct UCurveFloat* *c435367ffc; // 0x668(0x08)
	struct UCurveFloat* *6c50666a43; // 0x670(0x08)
	struct UCurveFloat* *969e60b9db; // 0x678(0x08)
	struct UCurveFloat* *aa51601cda; // 0x680(0x08)
	char pad_688[0x18]; // 0x688(0x18)
};

// Class TslGame.*30db0d8bfa
// Size: 0x488 (Inherited: 0x440)
struct U*30db0d8bfa : UScreenIndicatorBaseWidget {
	struct F*62d95f3263 DistanceTextBlock_Binder; // 0x440(0x20)
	struct F*62d95f3263 CheckPointTextBlock_Binder; // 0x460(0x20)
	struct ATslRacingPlayerController* *c1bb27b59b; // 0x480(0x08)
};

// Class TslGame.*3400f78a13
// Size: 0x480 (Inherited: 0x440)
struct U*3400f78a13 : UScreenIndicatorBaseWidget {
	float RadiusMaxPercent; // 0x440(0x04)
	float MaxDistance; // 0x444(0x04)
	float AimingImageAlpha; // 0x448(0x04)
	float ScopingImageAlpha; // 0x44c(0x04)
	float OffsetZ; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)
	struct UBorder* BorderRoot; // 0x458(0x08)
	struct UScaleBox* ScaleBoxRoot; // 0x460(0x08)
	struct UBorder* BorderDirection; // 0x468(0x08)
	struct UCurveFloat* *c435367ffc; // 0x470(0x08)
	struct UCurveFloat* *969e60b9db; // 0x478(0x08)
};

// Class TslGame.*f58b1820a1
// Size: 0x4b8 (Inherited: 0x440)
struct U*f58b1820a1 : UScreenIndicatorBaseWidget {
	float OffsetZ; // 0x440(0x04)
	float MinDistance; // 0x444(0x04)
	float MaxDistance; // 0x448(0x04)
	float MaxScale; // 0x44c(0x04)
	struct F*7691cca8dc *4f2ccffba4; // 0x450(0x28)
	struct F*a2a8693a5f *b2b4c1c42d; // 0x478(0x20)
	struct FVector *a53edf6234; // 0x498(0x0c)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct ATslCharacter* *405a1c10b9; // 0x4a8(0x08)
	char pad_4B0[0x8]; // 0x4b0(0x08)
};

// Class TslGame.*dacb76be56
// Size: 0x4d0 (Inherited: 0x418)
struct U*dacb76be56 : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	struct FName *2cb6425994; // 0x428(0x08)
	struct FName *b44c87dd63; // 0x430(0x08)
	struct F*aecf96cb1e *2f9f009905; // 0x438(0x28)
	struct TArray<struct F*5acf3b5ce3> *f244c8f1bd; // 0x460(0x10)
	struct TArray<struct F*36aa7d38cb> *b642f2f30c; // 0x470(0x10)
	struct F*aecf96cb1e *47807a76b9; // 0x480(0x28)
	struct TArray<struct F*5acf3b5ce3> *a705eaf1ac; // 0x4a8(0x10)
	struct TArray<struct F*36aa7d38cb> *7e07e02ef2; // 0x4b8(0x10)
	bool *0279ac45e3; // 0x4c8(0x01)
	char pad_4C9[0x7]; // 0x4c9(0x07)
};

// Class TslGame.*c8a5006a61
// Size: 0x5b8 (Inherited: 0x418)
struct U*c8a5006a61 : U*4bb82286ac {
	bool bIsParachuting; // 0x418(0x01)
	bool bMainVisibility; // 0x419(0x01)
	char pad_41A[0x2]; // 0x41a(0x02)
	float VerticalVelocity; // 0x41c(0x04)
	float HorizontalVelocity; // 0x420(0x04)
	float AltitudeOffsetInPX; // 0x424(0x04)
	float ParaOpenAltitudeInPX; // 0x428(0x04)
	float AltitudeGaugeScaleInPx; // 0x42c(0x04)
	float MaxAltitudeInMeters; // 0x430(0x04)
	float RenderOffsetPerTeammate; // 0x434(0x04)
	float RenderOffsetInSquadStatic; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct UTslSkydiveComponent* *208d5348ce; // 0x440(0x08)
	char pad_448[0x8]; // 0x448(0x08)
	struct F*a8249d5e73 *5b131ee9b2; // 0x450(0x30)
	struct F*a159aaccd9 *9a431a5d3d; // 0x480(0x28)
	struct F*a159aaccd9 *4aeb63a58c; // 0x4a8(0x28)
	struct F*aecf96cb1e *2f16662c99; // 0x4d0(0x28)
	struct F*3cdda95245 *83667ae8e2; // 0x4f8(0x28)
	struct F*3cdda95245 *99e6e94b46; // 0x520(0x28)
	struct F*62d95f3263 *0d48c7026a; // 0x548(0x20)
	struct F*62d95f3263 *eef734cf68; // 0x568(0x20)
	struct F*0c033c3537 *f91da87a99; // 0x588(0x28)
	float *db1cd407b1; // 0x5b0(0x04)
	char pad_5B4[0x4]; // 0x5b4(0x04)

	void TickStateCheck(); // Function TslGame.*c8a5006a61.TickStateCheck // Final|Native|Public|BlueprintCallable // @ game+0x58f9894
	void HandleSettingsChanged(); // Function TslGame.*c8a5006a61.HandleSettingsChanged // Final|Native|Public // @ game+0xbdd69c
};

// Class TslGame.*63cfdc18da
// Size: 0x420 (Inherited: 0x418)
struct U*63cfdc18da : U*4bb82286ac {
	struct UAkAudioEvent* *8a82be289e; // 0x418(0x08)
};

// Class TslGame.*7f9dfe0c4e
// Size: 0x440 (Inherited: 0x420)
struct U*7f9dfe0c4e : U*63cfdc18da {
	char pad_420[0x8]; // 0x420(0x08)
	struct UTextBlock* SlotName; // 0x428(0x08)
	struct UTextBlock* StackCountText; // 0x430(0x08)
	struct UImage* UseInfo_bg; // 0x438(0x08)
};

// Class TslGame.*c8bfd06682
// Size: 0x420 (Inherited: 0x418)
struct U*c8bfd06682 : U*4bb82286ac {
	struct UImage* CapacityImage; // 0x418(0x08)
};

// Class TslGame.*30b4a3fb7a
// Size: 0x428 (Inherited: 0x418)
struct U*30b4a3fb7a : U*4bb82286ac {
	struct UImage* IconImage; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void OnAsyncLoadIconFinished(); // Function TslGame.*30b4a3fb7a.OnAsyncLoadIconFinished // Final|Native|Public // @ game+0x58e872c
};

// Class TslGame.*1b404846b6
// Size: 0x440 (Inherited: 0x418)
struct U*1b404846b6 : U*4bb82286ac {
	struct U*c8bfd06682* InventoryCapacityWidget; // 0x418(0x08)
	struct U*30b4a3fb7a* HeadSlotWidget; // 0x420(0x08)
	struct U*30b4a3fb7a* ArmorSlotWidget; // 0x428(0x08)
	struct U*30b4a3fb7a* BagSlotWidget; // 0x430(0x08)
	struct UTdmSpawnKit* *c835984b52; // 0x438(0x08)

	void RefreshWidget(); // Function TslGame.*1b404846b6.RefreshWidget // Final|Native|Public // @ game+0x58f4100
};

// Class TslGame.*356a5bf963
// Size: 0x430 (Inherited: 0x418)
struct U*356a5bf963 : U*4bb82286ac {
	struct U*9274fed23e* SpawnKitListWidget; // 0x418(0x08)
	struct U*74255e170b* WeaponListWidget; // 0x420(0x08)
	struct UTextBlock* TdmCustomizeKitTitleText; // 0x428(0x08)
};

// Class TslGame.*9274fed23e
// Size: 0x498 (Inherited: 0x418)
struct U*9274fed23e : U*4bb82286ac {
	struct U*8a3e027fc0* ShotgunTab; // 0x418(0x08)
	struct U*8a3e027fc0* SmgTab; // 0x420(0x08)
	struct U*8a3e027fc0* ArTab; // 0x428(0x08)
	struct U*8a3e027fc0* DmrTab; // 0x430(0x08)
	struct U*8a3e027fc0* SrTab; // 0x438(0x08)
	struct U*8a3e027fc0* EtcTab; // 0x440(0x08)
	struct UWrapBox* ItemContainer; // 0x448(0x08)
	struct UClass* *66b84dab77; // 0x450(0x08)
	int32 *2a327353b2; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct TArray<struct U*bfc88dadbe*> *60e2dee0e9; // 0x460(0x10)
	enum class ETdmSpawnKit *6a9ac0cf00; // 0x470(0x04)
	char pad_474[0x4]; // 0x474(0x04)
	struct UTdmSpawnKit* *c835984b52; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)
	struct TArray<struct U*bfc88dadbe*> *5e898e8708; // 0x488(0x10)

	void OnSlotRight(); // Function TslGame.*9274fed23e.OnSlotRight // Final|Native|Public // @ game+0x58f00f0
	void RefreshWidget(); // Function TslGame.*9274fed23e.RefreshWidget // Final|Native|Public // @ game+0x58f4114
	void OnSlotSelect(); // Function TslGame.*9274fed23e.OnSlotSelect // Final|Native|Public // @ game+0x58f0104
	void OnSlotLeft(); // Function TslGame.*9274fed23e.OnSlotLeft // Final|Native|Public // @ game+0x58f00dc
	void OnSlotDown(); // Function TslGame.*9274fed23e.OnSlotDown // Final|Native|Public // @ game+0x58efca4
	void OnCategoryPrev(); // Function TslGame.*9274fed23e.OnCategoryPrev // Final|Native|Public // @ game+0x58e9578
	void OnCategoryNext(); // Function TslGame.*9274fed23e.OnCategoryNext // Final|Native|Public // @ game+0x58e9564
	void OnSlotUp(); // Function TslGame.*9274fed23e.OnSlotUp // Final|Native|Public // @ game+0x58f0118
};

// Class TslGame.*bfc88dadbe
// Size: 0x4c0 (Inherited: 0x418)
struct U*bfc88dadbe : U*4bb82286ac {
	struct FSlateColor *120c948583; // 0x418(0x28)
	struct FSlateColor *cb624faca0; // 0x440(0x28)
	struct UWidgetSwitcher* ItemBGSwitcher; // 0x468(0x08)
	struct UImage* IconImage; // 0x470(0x08)
	struct UWidgetSwitcher* ScopeSwitcher; // 0x478(0x08)
	struct UTextBlock* ItemNameText; // 0x480(0x08)
	struct UTextBlock* AmmoName; // 0x488(0x08)
	struct UTextBlock* AmmoCountText; // 0x490(0x08)
	struct USizeBox* EquippedTagSizeBox; // 0x498(0x08)
	char pad_4A0[0x20]; // 0x4a0(0x20)

	void OnAsyncLoadIconFinished(); // Function TslGame.*bfc88dadbe.OnAsyncLoadIconFinished // Final|Native|Public // @ game+0x58e8740
};

// Class TslGame.*8a3e027fc0
// Size: 0x458 (Inherited: 0x418)
struct U*8a3e027fc0 : U*4bb82286ac {
	struct FText TabText; // 0x418(0x18)
	struct UButton* Button; // 0x430(0x08)
	struct UImage* LineImage; // 0x438(0x08)
	struct U*9274fed23e* *b415592ade; // 0x440(0x08)
	struct U*191926b023* TabNameFlowText; // 0x448(0x08)
	char pad_450[0x8]; // 0x450(0x08)

	void OnClickButton(); // Function TslGame.*8a3e027fc0.OnClickButton // Final|Native|Public // @ game+0x58e9994
};

// Class TslGame.*a85f1e4944
// Size: 0x428 (Inherited: 0x418)
struct U*a85f1e4944 : U*4bb82286ac {
	struct UImage* AttachmentIcon; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void OnAsyncLoadIconFinished(); // Function TslGame.*a85f1e4944.OnAsyncLoadIconFinished // Final|Native|Public // @ game+0x58e8754
};

// Class TslGame.*682569b73f
// Size: 0x4a8 (Inherited: 0x418)
struct U*682569b73f : U*4bb82286ac {
	struct U*81d8a95929* WeaponBodySlotWidget; // 0x418(0x08)
	struct U*a85f1e4944* Muzzle; // 0x420(0x08)
	struct U*a85f1e4944* LowerRail; // 0x428(0x08)
	struct U*a85f1e4944* Magazine; // 0x430(0x08)
	struct U*a85f1e4944* UpperRail; // 0x438(0x08)
	struct U*a85f1e4944* CantedSight; // 0x440(0x08)
	struct U*a85f1e4944* Stock; // 0x448(0x08)
	struct TMap<enum class EWeaponAttachmentSlotID, struct U*a85f1e4944*> *8aa7948e3d; // 0x450(0x50)
	struct UTextureRenderTarget2D* *9ec2e160f6; // 0x4a0(0x08)
};

// Class TslGame.*74255e170b
// Size: 0x430 (Inherited: 0x418)
struct U*74255e170b : U*4bb82286ac {
	struct U*682569b73f* Weapon001; // 0x418(0x08)
	struct U*682569b73f* Weapon003; // 0x420(0x08)
	struct U*682569b73f* Weapon004; // 0x428(0x08)

	void RefreshWidget(); // Function TslGame.*74255e170b.RefreshWidget // Final|Native|Public // @ game+0x58f4128
};

// Class TslGame.*be81ef49a7
// Size: 0x430 (Inherited: 0x418)
struct U*be81ef49a7 : U*4bb82286ac {
	struct U*e262ebab7e* ScoreTableLeft; // 0x418(0x08)
	struct U*e262ebab7e* ScoreTableRight; // 0x420(0x08)
	struct USizeBox* SizeBox_Map; // 0x428(0x08)

	void UpdateData_Internal(); // Function TslGame.*be81ef49a7.UpdateData_Internal // Final|Native|Private // @ game+0x58fa4d0
};

// Class TslGame.*e262ebab7e
// Size: 0x4d8 (Inherited: 0x418)
struct U*e262ebab7e : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_BG; // 0x420(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Banner; // 0x428(0x08)
	struct UTextBlock* TextBlock_HomeTeamName; // 0x430(0x08)
	struct UTextBlock* TextBlock_AwayTeamName; // 0x438(0x08)
	struct UVerticalBox* VerticalBox_PersonalScoreList; // 0x440(0x08)
	struct UTextBlock* TextBlock_ListTitle_Name; // 0x448(0x08)
	struct UTextBlock* TextBlock_ListTitle_Kill; // 0x450(0x08)
	struct UTextBlock* TextBlock_ListTitle_Assist; // 0x458(0x08)
	struct UTextBlock* TextBlock_ListTitle_Death; // 0x460(0x08)
	struct UTextBlock* TextBlock_ListTitle_Score; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)
	struct TArray<struct U*277344fd66*> *90f57fa26a; // 0x478(0x10)
	char pad_488[0x50]; // 0x488(0x50)
};

// Class TslGame.*277344fd66
// Size: 0x5f0 (Inherited: 0x418)
struct U*277344fd66 : U*4bb82286ac {
	char pad_418[0x158]; // 0x418(0x158)
	struct FLinearColor HighlightedColor; // 0x570(0x10)
	struct FLinearColor NormalColor; // 0x580(0x10)
	char pad_590[0x8]; // 0x590(0x08)
	struct U*7d732dfd2f* *33d3448e00; // 0x598(0x08)
	struct UTextBlock* TextBlock_Name; // 0x5a0(0x08)
	struct UTextBlock* TextBlock_Kill; // 0x5a8(0x08)
	struct UTextBlock* TextBlock_Assist; // 0x5b0(0x08)
	struct UTextBlock* TextBlock_Death; // 0x5b8(0x08)
	struct UTextBlock* TextBlock_Score; // 0x5c0(0x08)
	struct UBorder* TDMScoreBoardPlayerBorder; // 0x5c8(0x08)
	struct FLinearColor *710571d7ee; // 0x5d0(0x10)
	struct U*c0c5b25d31* PlatformImage; // 0x5e0(0x08)
	char pad_5E8[0x8]; // 0x5e8(0x08)

	void UpdateDesign_Focused(); // Function TslGame.*277344fd66.UpdateDesign_Focused // Native|Event|Public|BlueprintEvent // @ game+0x58e9478
	void UpdateDesign_Normal(); // Function TslGame.*277344fd66.UpdateDesign_Normal // Native|Event|Public|BlueprintEvent // @ game+0x58ebe40
};

// Class TslGame.*3038ad2b3f
// Size: 0x528 (Inherited: 0x418)
struct U*3038ad2b3f : U*4bb82286ac {
	struct F*62d95f3263 TeamOverallKillCountTextBinder; // 0x418(0x20)
	struct F*62d95f3263 TotalKillTextBinder; // 0x438(0x20)
	struct F*aecf96cb1e TeamIconImageBinder; // 0x458(0x28)
	struct F*7691cca8dc TeamIconScaleBoxBinder; // 0x480(0x28)
	struct F*7b33ced057 TeamIconWidgetSwitcher; // 0x4a8(0x28)
	struct F*62d95f3263 TeamShortNameBinder; // 0x4d0(0x20)
	int32 TotalKillTextIndex; // 0x4f0(0x04)
	int32 TeamIconImageIndex; // 0x4f4(0x04)
	float DesiredXStart; // 0x4f8(0x04)
	float DesiredXEnd; // 0x4fc(0x04)
	float DesiredYStart; // 0x500(0x04)
	float DesiredYEnd; // 0x504(0x04)
	int32 *1772c832c9; // 0x508(0x04)
	int32 *1a40fa548f; // 0x50c(0x04)
	struct FString *3fca1505f5; // 0x510(0x10)
	bool *5008410e28; // 0x520(0x01)
	char pad_521[0x7]; // 0x521(0x07)

	int32 GetLastTeamOverallKillCount(); // Function TslGame.*3038ad2b3f.GetLastTeamOverallKillCount // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58e5af0
};

// Class TslGame.*f52ccbf327
// Size: 0x590 (Inherited: 0x418)
struct U*f52ccbf327 : U*4bb82286ac {
	enum class ETeenageInfoType *e0c92fdc03; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct F*5dab5acde7 BorderBrushForSeason; // 0x420(0xa0)
	struct F*5dab5acde7 BorderBrushForNormal; // 0x4c0(0xa0)
	struct F*a8249d5e73 *9033ff9236; // 0x560(0x30)

	void SetBorderBrushForNormal(); // Function TslGame.*f52ccbf327.SetBorderBrushForNormal // Final|Native|Public|BlueprintCallable // @ game+0x58f73a8
	void SetBorderBrushForSeason(); // Function TslGame.*f52ccbf327.SetBorderBrushForSeason // Final|Native|Public|BlueprintCallable // @ game+0x58f742c
};

// Class TslGame.TestParachuting
// Size: 0x5d8 (Inherited: 0x418)
struct UTestParachuting : U*4bb82286ac {
	struct TArray<struct FTestSpot> TestSpots; // 0x418(0x10)
	struct ATslCharacter* Character; // 0x428(0x08)
	struct ATslPlayerController* Controller; // 0x430(0x08)
	struct UClass* *ec90ab60a1; // 0x438(0x08)
	struct ALevelAttribute* LevelAttribute; // 0x440(0x08)
	struct UMaterialInstanceDynamic* *eeb60d8149; // 0x448(0x08)
	struct F*54c30817ee MapImageContainerBinder; // 0x450(0x20)
	struct F*aecf96cb1e MapImageBinder; // 0x470(0x28)
	struct F*62d95f3263 MessageBinder; // 0x498(0x20)
	struct F*54c30817ee RunTestButton; // 0x4b8(0x20)
	struct F*54c30817ee StopTestButton; // 0x4d8(0x20)
	struct F*54c30817ee ClearSpotsButton; // 0x4f8(0x20)
	struct F*54c30817ee CloseButton; // 0x518(0x20)
	struct F*54c30817ee LoadDefaultButton; // 0x538(0x20)
	struct F*54c30817ee SaveButton; // 0x558(0x20)
	struct F*54c30817ee EnableButton; // 0x578(0x20)
	struct F*54c30817ee DisableButton; // 0x598(0x20)
	struct F*62d95f3263 StatusTextBlock; // 0x5b8(0x20)

	struct FVector2D UiToRealCoord(); // Function TslGame.TestParachuting.UiToRealCoord // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x58f3ea4
	void OnRunTestButtonClicked(); // Function TslGame.TestParachuting.OnRunTestButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbdd69c
	void OnSaveButtonClicked(); // Function TslGame.TestParachuting.OnSaveButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbdd69c
	bool IsRunning(); // Function TslGame.TestParachuting.IsRunning // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xa85bb0
	struct FVector2D MoveTestSpot(); // Function TslGame.TestParachuting.MoveTestSpot // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22c9a0
	struct TArray<int32> DisableTestSpots(); // Function TslGame.TestParachuting.DisableTestSpots // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22c9a0
	void OnInitialized(); // Function TslGame.TestParachuting.OnInitialized // Native|Event|Public|BlueprintEvent // @ game+0x58e9478
	int32 SwapTestSpots(); // Function TslGame.TestParachuting.SwapTestSpots // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnCloseButtonClicked(); // Function TslGame.TestParachuting.OnCloseButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbdd69c
	struct TArray<int32> EnableTestSpots(); // Function TslGame.TestParachuting.EnableTestSpots // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22c9a0
	struct TArray<int32> RemoveTestSpots(); // Function TslGame.TestParachuting.RemoveTestSpots // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22c9a0
	bool OnLoadDefaultButtonClicked(); // Function TslGame.TestParachuting.OnLoadDefaultButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xa85bb0
	bool AddTestSpot(); // Function TslGame.TestParachuting.AddTestSpot // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22c9a0
	void OnStopTestButtonClicked(); // Function TslGame.TestParachuting.OnStopTestButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbdd69c
	void OnClearSpotsButtonClicked(); // Function TslGame.TestParachuting.OnClearSpotsButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbdd69c
	struct FVector2D RealToUiCoord(); // Function TslGame.TestParachuting.RealToUiCoord // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x58f3ea4
};

// Class TslGame.*aa8f38be7d
// Size: 0x420 (Inherited: 0x418)
struct U*aa8f38be7d : U*4bb82286ac {
	struct U*a59bd773e3* TutorialMessageWidget; // 0x418(0x08)
};

// Class TslGame.*0566760b99
// Size: 0x460 (Inherited: 0x418)
struct U*0566760b99 : U*4bb82286ac {
	int32 Number; // 0x418(0x04)
	bool *37789dceb0; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	struct UTexture2D* *3c2e8d9ef0; // 0x420(0x08)
	struct UTexture2D* *54c9b590d0; // 0x428(0x08)
	struct FLinearColor *d602ecf29e; // 0x430(0x10)
	struct FLinearColor *db949f2300; // 0x440(0x10)
	struct UBorder* Number_Border; // 0x450(0x08)
	struct UTextBlock* Number_Text; // 0x458(0x08)
};

// Class TslGame.*882f71ee10
// Size: 0x950 (Inherited: 0x418)
struct U*882f71ee10 : U*4bb82286ac {
	enum class EWeaponClass *fa592782bc; // 0x418(0x01)
	bool *9eb0cd0e1c; // 0x419(0x01)
	char pad_41A[0x6]; // 0x41a(0x06)
	struct F*9f07f2774c *35d02f6519; // 0x420(0x10)
	struct F*aecf96cb1e *73d12c8fb7; // 0x430(0x28)
	struct F*a159aaccd9 *d8275df00d; // 0x458(0x28)
	struct F*a159aaccd9 *d629a0e792; // 0x480(0x28)
	struct F*a159aaccd9 *4ded784f0e; // 0x4a8(0x28)
	struct F*a159aaccd9 *15848f6c52; // 0x4d0(0x28)
	struct F*aecf96cb1e *919814d7c3; // 0x4f8(0x28)
	struct F*a159aaccd9 *54acc721e0; // 0x520(0x28)
	struct F*a159aaccd9 *d85a0f5486; // 0x548(0x28)
	struct F*a159aaccd9 *904fa81da4; // 0x570(0x28)
	struct F*aecf96cb1e *c0e8ed4013; // 0x598(0x28)
	struct F*aecf96cb1e *6b267ccaf5; // 0x5c0(0x28)
	struct F*aecf96cb1e *504b8b6d7e; // 0x5e8(0x28)
	struct F*aecf96cb1e *bcd0b3ee24; // 0x610(0x28)
	struct F*aecf96cb1e *b789754c6b; // 0x638(0x28)
	struct F*aecf96cb1e *ab88505271; // 0x660(0x28)
	struct F*aecf96cb1e *b0f01d1f33; // 0x688(0x28)
	struct F*aecf96cb1e *03d3a370f6; // 0x6b0(0x28)
	struct F*aecf96cb1e *63b424bb4c; // 0x6d8(0x28)
	struct F*aecf96cb1e *95c3ada2b5; // 0x700(0x28)
	struct F*aecf96cb1e *c973574237; // 0x728(0x28)
	struct F*aecf96cb1e *e98d03bcf6; // 0x750(0x28)
	struct F*aecf96cb1e *f5588afd97; // 0x778(0x28)
	struct F*aecf96cb1e *961ad95894; // 0x7a0(0x28)
	struct F*aecf96cb1e *0ec7ba6c4d; // 0x7c8(0x28)
	struct F*aecf96cb1e *3643aa104e; // 0x7f0(0x28)
	struct F*aecf96cb1e *4ad980b387; // 0x818(0x28)
	struct F*aecf96cb1e *084a8d18ca; // 0x840(0x28)
	struct F*aecf96cb1e *784fffd290; // 0x868(0x28)
	struct F*aecf96cb1e *1f3297e709; // 0x890(0x28)
	struct TArray<struct FName> *2ec58a8a53; // 0x8b8(0x10)
	struct UImage* Flaregun_circle; // 0x8c8(0x08)
	struct UCanvasPanel* ThrowableCrosshair; // 0x8d0(0x08)
	struct UImage* ThrowableCrosshairImage; // 0x8d8(0x08)
	struct F*a2a8693a5f *803303f3e5; // 0x8e0(0x20)
	struct F*a2a8693a5f *f8e9445528; // 0x900(0x20)
	struct U*9c8bfa0aee* Crosshair_Transition_Flaregun; // 0x920(0x08)
	struct U*9c8bfa0aee* CrosshairTransitionThrowableHigh; // 0x928(0x08)
	float *82511f0335; // 0x930(0x04)
	float *e91005df4e; // 0x934(0x04)
	char pad_938[0x4]; // 0x938(0x04)
	float *b9d5855391; // 0x93c(0x04)
	bool *efaf5ab37f; // 0x940(0x01)
	bool *d8b726b1f4; // 0x941(0x01)
	bool *bfde9505ff; // 0x942(0x01)
	bool *674a342c94; // 0x943(0x01)
	bool *30fdf17590; // 0x944(0x01)
	char pad_945[0xb]; // 0x945(0x0b)

	bool SetCenterCrosshairHoldAngled(); // Function TslGame.*882f71ee10.SetCenterCrosshairHoldAngled // Final|Native|Public|BlueprintCallable // @ game+0x58f755c
	bool SetCenterCrosshairVisibility(); // Function TslGame.*882f71ee10.SetCenterCrosshairVisibility // Final|Native|Public|BlueprintCallable // @ game+0x58f75f0
	void SetCenterCrosshairClass(); // Function TslGame.*882f71ee10.SetCenterCrosshairClass // Final|Native|Public|BlueprintCallable // @ game+0x58f74b0
	bool SetShowCrosshairWidget(); // Function TslGame.*882f71ee10.SetShowCrosshairWidget // Final|Native|Public|BlueprintCallable // @ game+0x58f8a1c
	void HandleGameUserSettingApplied(); // Function TslGame.*882f71ee10.HandleGameUserSettingApplied // Final|Native|Public // @ game+0x58e6470
	bool SetAdaptiveCrosshairPosition(); // Function TslGame.*882f71ee10.SetAdaptiveCrosshairPosition // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x58f6fe8
	bool UpdateFlaregunCrosshair(); // Function TslGame.*882f71ee10.UpdateFlaregunCrosshair // Final|Native|Public|BlueprintCallable // @ game+0x58fa578
	bool IsFlareReady(); // Function TslGame.*882f71ee10.IsFlareReady // Final|Native|Public|BlueprintCallable // @ game+0x58e77b0
	float SetCenterCrosshairDeviation(); // Function TslGame.*882f71ee10.SetCenterCrosshairDeviation // Final|Native|Public|BlueprintCallable // @ game+0x58f74c4
	bool SetAdaptiveCrosshairVisibility(); // Function TslGame.*882f71ee10.SetAdaptiveCrosshairVisibility // Final|Native|Public|BlueprintCallable // @ game+0x58f71dc
	void DecideAdaptiveCrosshairColor(); // Function TslGame.*882f71ee10.DecideAdaptiveCrosshairColor // Final|Native|Public|BlueprintCallable // @ game+0x58e47f0
};

// Class TslGame.*7f8785a4e4
// Size: 0x460 (Inherited: 0x418)
struct U*7f8785a4e4 : U*4bb82286ac {
	struct UImage* AirSpeedMeterImage; // 0x418(0x08)
	struct UTextBlock* SpeedText; // 0x420(0x08)
	struct FName *5b7686a5f3; // 0x428(0x08)
	struct FFloatInterval *645092c0ab; // 0x430(0x08)
	float *e601d41755; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct UMaterialInstanceDynamic* *c1b5ab7044; // 0x440(0x08)
	struct ATslCharacter* ViewTargetCharacter; // 0x448(0x08)
	int32 *1fa8d05fe2; // 0x450(0x04)
	float *aeb3621a69; // 0x454(0x04)
	bool *864e1e636e; // 0x458(0x01)
	char pad_459[0x3]; // 0x459(0x03)
	float Speed; // 0x45c(0x04)

	struct AActor* UpdateViewTarget(); // Function TslGame.*7f8785a4e4.UpdateViewTarget // Native|Public // @ game+0x58fb140
};

// Class TslGame.*65fe85154f
// Size: 0x468 (Inherited: 0x460)
struct U*65fe85154f : U*7f8785a4e4 {
	enum class ESkydiveState *ccac8de21f; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)

	enum class ESkydiveState SetSkydiveState(); // Function TslGame.*65fe85154f.SetSkydiveState // Final|Native|Public // @ game+0x4a7ea8
	struct AActor* UpdateViewTarget(); // Function TslGame.*65fe85154f.UpdateViewTarget // Final|Native|Public // @ game+0x4a80d0
};

// Class TslGame.*ef14a287d0
// Size: 0x520 (Inherited: 0x418)
struct U*ef14a287d0 : U*4bb82286ac {
	struct ATslGameState* *2e331f8294; // 0x418(0x08)
	struct F*a8249d5e73 *82e0e50067; // 0x420(0x30)
	struct F*a2a8693a5f *823b92707d; // 0x450(0x20)
	struct F*a2a8693a5f *0a65b52240; // 0x470(0x20)
	struct F*a2a8693a5f *626d19a74f; // 0x490(0x20)
	struct F*a2a8693a5f *b7a0f1d628; // 0x4b0(0x20)
	struct F*62d95f3263 *f4295ecb5b; // 0x4d0(0x20)
	struct F*62d95f3263 *182334fc23; // 0x4f0(0x20)
	bool bIsReplaying; // 0x510(0x01)
	bool bIsHidden; // 0x511(0x01)
	char pad_512[0x2]; // 0x512(0x02)
	int32 CurrentCount; // 0x514(0x04)
	int32 LastCount; // 0x518(0x04)
	char pad_51C[0x4]; // 0x51c(0x04)

	bool OnMatchStarted(); // Function TslGame.*ef14a287d0.OnMatchStarted // Final|Native|Public // @ game+0x58ecccc
	int32 *a57d669dbd(); // Function TslGame.*ef14a287d0.*a57d669dbd // Final|Native|Public // @ game+0x58e83d8
};

// Class TslGame.*a636352a45
// Size: 0x520 (Inherited: 0x520)
struct U*a636352a45 : U*ef14a287d0 {
};

// Class TslGame.*e72db990d4
// Size: 0x520 (Inherited: 0x520)
struct U*e72db990d4 : U*ef14a287d0 {
};

// Class TslGame.*a272958e1a
// Size: 0x520 (Inherited: 0x520)
struct U*a272958e1a : U*ef14a287d0 {
};

// Class TslGame.*130f92df3d
// Size: 0x448 (Inherited: 0x418)
struct U*130f92df3d : U*4bb82286ac {
	struct FName *c6d68be46c; // 0x418(0x08)
	struct UImage* AltitudeMeterImage; // 0x420(0x08)
	struct UTextBlock* AltitudeText; // 0x428(0x08)
	struct UMaterialInstanceDynamic* *401ab87682; // 0x430(0x08)
	struct ATslCharacter* ViewTargetCharacter; // 0x438(0x08)
	char pad_440[0x8]; // 0x440(0x08)

	struct AActor* UpdateViewTarget(); // Function TslGame.*130f92df3d.UpdateViewTarget // Final|Native|Public // @ game+0x58fb1d4
};

// Class TslGame.*f6bba57c46
// Size: 0x488 (Inherited: 0x418)
struct U*f6bba57c46 : U*4bb82286ac {
	struct F*a2a8693a5f *77f9822908; // 0x418(0x20)
	struct UTextBlock* LabelText; // 0x438(0x08)
	enum class ETslArenaLoadoutItemCategory Category; // 0x440(0x01)
	char pad_441[0x3]; // 0x441(0x03)
	struct FLinearColor LabelNameNormalColor; // 0x444(0x10)
	struct FLinearColor LabelNameSelectedColor; // 0x454(0x10)
	struct FLinearColor LabelNameHoveredColor; // 0x464(0x10)
	char pad_474[0x4]; // 0x474(0x04)
	struct U*aa23c11442* *303ffbf272; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)

	void OnLoadoutTabChanged(); // Function TslGame.*f6bba57c46.OnLoadoutTabChanged // Final|Native|Private // @ game+0x58ec80c
};

// Class TslGame.*82fadfa2e7
// Size: 0x418 (Inherited: 0x418)
struct U*82fadfa2e7 : U*4bb82286ac {
};

// Class TslGame.*568c0081d2
// Size: 0x438 (Inherited: 0x418)
struct U*568c0081d2 : U*4bb82286ac {
	struct USizeBox* GamepadKeyIconNextSizeBox; // 0x418(0x08)
	struct USizeBox* GamepadKeyIconPrevSizeBox; // 0x420(0x08)
	char pad_428[0x10]; // 0x428(0x10)

	void PlayTabChangeSound(); // Function TslGame.*568c0081d2.PlayTabChangeSound // Final|Native|Public|BlueprintCallable // @ game+0x58f3a94
	void OnObserveStateChanged(); // Function TslGame.*568c0081d2.OnObserveStateChanged // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void CheckShowPrevScreen(); // Function TslGame.*568c0081d2.CheckShowPrevScreen // Final|Native|Public // @ game+0x58e2b98
	void CheckShowNextScreen(); // Function TslGame.*568c0081d2.CheckShowNextScreen // Final|Native|Public // @ game+0x58e2b84
	void ArenaPlayerStateReplicated(); // Function TslGame.*568c0081d2.ArenaPlayerStateReplicated // Final|Native|Public // @ game+0x58e26ec
	void OnShowNextScreen(); // Function TslGame.*568c0081d2.OnShowNextScreen // Event|Public|BlueprintEvent // @ game+0x22c9a0
	bool *49b0eec8e6(); // Function TslGame.*568c0081d2.*49b0eec8e6 // Final|Native|Protected // @ game+0x58f275c
	void OnNavigationShow(); // Function TslGame.*568c0081d2.OnNavigationShow // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnShowPrevScreen(); // Function TslGame.*568c0081d2.OnShowPrevScreen // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*9fcee1872a
// Size: 0x458 (Inherited: 0x418)
struct U*9fcee1872a : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct FMulticastDelegate OnButtonClickedEvent; // 0x420(0x10)
	struct U*36cff032b6* TargetButton; // 0x430(0x08)
	struct U*7d732dfd2f* *33d3448e00; // 0x438(0x08)
	struct F*91b0fceaa0 *83f63c323d; // 0x440(0x14)
	char pad_454[0x4]; // 0x454(0x04)

	bool UpdateDesign_Pressed(); // Function TslGame.*9fcee1872a.UpdateDesign_Pressed // Event|Public|BlueprintEvent // @ game+0x22c9a0
	bool UpdateDesign_Normal(); // Function TslGame.*9fcee1872a.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnButtonUnhovered(); // Function TslGame.*9fcee1872a.OnButtonUnhovered // Native|Public // @ game+0x58ebe40
	void OnButtonClicked(); // Function TslGame.*9fcee1872a.OnButtonClicked // Native|Public // @ game+0x58e7fb0
	bool UpdateDesign_Hovered(); // Function TslGame.*9fcee1872a.UpdateDesign_Hovered // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnButtonHovered(); // Function TslGame.*9fcee1872a.OnButtonHovered // Native|Public // @ game+0x58e9478
	struct UButton* GetTargetButton(); // Function TslGame.*9fcee1872a.GetTargetButton // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5a12794
	void OnButtonReleased(); // Function TslGame.*9fcee1872a.OnButtonReleased // Native|Public // @ game+0x58e99a8
	void OnButtonPressed(); // Function TslGame.*9fcee1872a.OnButtonPressed // Native|Public // @ game+0xda3b3c
};

// Class TslGame.*42c9bbd7dd
// Size: 0x4c8 (Inherited: 0x458)
struct U*42c9bbd7dd : U*9fcee1872a {
	struct F*62d95f3263 NameTextBlock_Binder; // 0x458(0x20)
	struct F*54c30817ee InternalButton_Binder; // 0x478(0x20)
	struct FText ButtonNameText; // 0x498(0x18)
	enum class ESystemMenuButtonType ButtonEnumType; // 0x4b0(0x01)
	char pad_4B1[0x7]; // 0x4b1(0x07)
	struct FName ButtonName; // 0x4b8(0x08)
	bool bIsShowInLobby; // 0x4c0(0x01)
	bool bIsShowInMatch; // 0x4c1(0x01)
	char pad_4C2[0x6]; // 0x4c2(0x06)

	void OnButtonHovered(); // Function TslGame.*42c9bbd7dd.OnButtonHovered // Native|Protected // @ game+0x58e9478
	void OnButtonClicked(); // Function TslGame.*42c9bbd7dd.OnButtonClicked // Native|Protected // @ game+0x58e7fb0
	struct FText UpdateButtonText(); // Function TslGame.*42c9bbd7dd.UpdateButtonText // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58f9ed8
	enum class ESystemMenuButtonType *7e1a10db80(); // Function TslGame.*42c9bbd7dd.*7e1a10db80 // Final|Native|Public|Const // @ game+0x58e5664
};

// Class TslGame.*1bcd358957
// Size: 0x418 (Inherited: 0x418)
struct U*1bcd358957 : U*4bb82286ac {
};

// Class TslGame.*c9d06c049a
// Size: 0x4e0 (Inherited: 0x418)
struct U*c9d06c049a : U*4bb82286ac {
	struct FName OptionName; // 0x418(0x08)
	char pad_420[0xc0]; // 0x420(0xc0)

	void OnApply(); // Function TslGame.*c9d06c049a.OnApply // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x58e9478
	void OnReset(); // Function TslGame.*c9d06c049a.OnReset // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0xda3b3c
	void OnDefault(); // Function TslGame.*c9d06c049a.OnDefault // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x58ebe40
	bool IsChanged(); // Function TslGame.*c9d06c049a.IsChanged // Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const // @ game+0x59fa810
	bool IsEnableApply(); // Function TslGame.*c9d06c049a.IsEnableApply // Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const // @ game+0x59fa91c
	bool IsKeyUp(); // Function TslGame.*c9d06c049a.IsKeyUp // Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const // @ game+0x58e7764
};

// Class TslGame.*0669300da1
// Size: 0x550 (Inherited: 0x4e0)
struct U*0669300da1 : U*c9d06c049a {
	char pad_4E0[0x8]; // 0x4e0(0x08)
	struct FText TitleText; // 0x4e8(0x18)
	struct FText DescText; // 0x500(0x18)
	struct U*51a141c587* *1ef2a94cec; // 0x518(0x08)
	struct U*7d732dfd2f* *33d3448e00; // 0x520(0x08)
	struct F*91b0fceaa0 *a0c9180073; // 0x528(0x14)
	struct F*91b0fceaa0 *83f63c323d; // 0x53c(0x14)

	void UpdateDesign_Focused(); // Function TslGame.*0669300da1.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void UpdateDesign_Normal(); // Function TslGame.*0669300da1.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*0b9449cadf
// Size: 0x5d0 (Inherited: 0x550)
struct U*0b9449cadf : U*0669300da1 {
	float MinValue; // 0x550(0x04)
	float MaxValue; // 0x554(0x04)
	float DefaultValue; // 0x558(0x04)
	float *c5dd51ddab; // 0x55c(0x04)
	float *65ad102725; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct F*62d95f3263 *9171acf7b2; // 0x568(0x20)
	struct F*62d95f3263 *edb5a4eca4; // 0x588(0x20)
	struct F*54c30817ee *1557c06f21; // 0x5a8(0x20)
	char pad_5C8[0x8]; // 0x5c8(0x08)
};

// Class TslGame.*89729ce1fb
// Size: 0x5d0 (Inherited: 0x5d0)
struct U*89729ce1fb : U*0b9449cadf {
};

// Class TslGame.*699024b4c0
// Size: 0x540 (Inherited: 0x4e0)
struct U*699024b4c0 : U*c9d06c049a {
	struct FMulticastDelegate OnKeyInputed; // 0x4e0(0x10)
	struct TArray<struct U*5830ab9600*> *2600386259; // 0x4f0(0x10)
	struct TArray<struct F*45518ccbeb> *9955fdfa8b; // 0x500(0x10)
	struct FName InputName; // 0x510(0x08)
	struct FName CategoryName; // 0x518(0x08)
	struct FText DisplayText; // 0x520(0x18)
	bool bGamepad; // 0x538(0x01)
	bool bAxisInput; // 0x539(0x01)
	char pad_53A[0x2]; // 0x53a(0x02)
	float AxisScale; // 0x53c(0x04)

	void ApplyKey(); // Function TslGame.*699024b4c0.ApplyKey // Final|Native|Public|BlueprintCallable // @ game+0x58e26d8
	struct FTslInputKey TransferInputEvent(); // Function TslGame.*699024b4c0.TransferInputEvent // Final|Native|Public // @ game+0x58f98a8
	bool SetupKeyDisplayWidget(); // Function TslGame.*699024b4c0.SetupKeyDisplayWidget // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58f90cc
	bool InitializeKeyDisplayWidget(); // Function TslGame.*699024b4c0.InitializeKeyDisplayWidget // Final|Native|Public|BlueprintCallable // @ game+0x58e75bc
};

// Class TslGame.*fe08180875
// Size: 0x550 (Inherited: 0x4e0)
struct U*fe08180875 : U*c9d06c049a {
	struct F*54c30817ee *b05e909471; // 0x4e0(0x20)
	struct TArray<struct U*70b0e9daa5*> KeySettingWidgets; // 0x500(0x10)
	struct UClass* *eb93ea4320; // 0x510(0x08)
	struct U*c9d06c049a* MouseSettingWidget; // 0x518(0x08)
	struct UClass* *e5c7918f40; // 0x520(0x08)
	struct UClass* *13f105ff6e; // 0x528(0x08)
	struct U*c9d06c049a* GamePadSettingWidget; // 0x530(0x08)
	struct TArray<struct FName> *19b94156cf; // 0x538(0x10)
	char pad_548[0x8]; // 0x548(0x08)

	struct FTslInputKey OnKeyChanged(); // Function TslGame.*fe08180875.OnKeyChanged // Final|Native|Private // @ game+0x58ebfd8
	void *74614ff693(); // Function TslGame.*fe08180875.*74614ff693 // Final|Native|Public // @ game+0x58e75a8
};

// Class TslGame.*70b0e9daa5
// Size: 0x550 (Inherited: 0x4e0)
struct U*70b0e9daa5 : U*c9d06c049a {
	struct FMulticastDelegate OnKeyChanged; // 0x4e0(0x10)
	struct UClass* *8e3a640813; // 0x4f0(0x08)
	struct F*54c30817ee *0755db716b; // 0x4f8(0x20)
	struct TArray<struct U*699024b4c0*> KeyDisplayWidgets; // 0x518(0x10)
	struct FText DisplayText; // 0x528(0x18)
	struct FName CategoryName; // 0x540(0x08)
	char pad_548[0x8]; // 0x548(0x08)

	struct FText StartupKeySettingWidget(); // Function TslGame.*70b0e9daa5.StartupKeySettingWidget // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58f9644
	struct FTslInputKey TransferInputEvent(); // Function TslGame.*70b0e9daa5.TransferInputEvent // Final|Native|Public // @ game+0x58f9994
	void SetToDefault(); // Function TslGame.*70b0e9daa5.SetToDefault // Final|Native|Public|BlueprintCallable // @ game+0x58f8e80
	void InitializeKeySettingWidget(); // Function TslGame.*70b0e9daa5.InitializeKeySettingWidget // Final|Native|Public|BlueprintCallable // @ game+0x58e7650
};

// Class TslGame.*59661d2d3d
// Size: 0x4f0 (Inherited: 0x418)
struct U*59661d2d3d : U*4bb82286ac {
	char pad_418[0x78]; // 0x418(0x78)
	struct UImage* BindImageIcon; // 0x490(0x08)
	struct UTextBlock* BindTextItemName; // 0x498(0x08)
	struct UBorder* BindBorderSelect; // 0x4a0(0x08)
	struct FLinearColor *22edafe360; // 0x4a8(0x10)
	struct FLinearColor *3bf99597c3; // 0x4b8(0x10)
	char pad_4C8[0x28]; // 0x4c8(0x28)

	void OnAsyncLoadIconFinished(); // Function TslGame.*59661d2d3d.OnAsyncLoadIconFinished // Final|Native|Protected // @ game+0x58e877c
};

// Class TslGame.*4aecdeaf3d
// Size: 0x4f0 (Inherited: 0x4f0)
struct U*4aecdeaf3d : U*59661d2d3d {
	struct UButton* BindButtonSelect; // 0x4e8(0x08)

	void OnClickedSelectButton(); // Function TslGame.*4aecdeaf3d.OnClickedSelectButton // Final|Native|Protected // @ game+0x58e9ac4
};

// Class TslGame.*57371dfa3a
// Size: 0x500 (Inherited: 0x4f0)
struct U*57371dfa3a : U*59661d2d3d {
	struct U*4bb82286ac* BindWidgetOutline; // 0x4e8(0x08)
	char pad_4F8[0x8]; // 0x4f8(0x08)
};

// Class TslGame.*691f142162
// Size: 0x448 (Inherited: 0x418)
struct U*691f142162 : U*4bb82286ac {
	struct UImage* BloodSpotImage; // 0x418(0x08)
	struct U*9c8bfa0aee* FadeOutAnim; // 0x420(0x08)
	struct FLinearColor *c17d4bdda3; // 0x428(0x10)
	char pad_438[0x10]; // 0x438(0x10)
};

// Class TslGame.*93d0379050
// Size: 0x428 (Inherited: 0x418)
struct U*93d0379050 : U*4bb82286ac {
	struct UTextBlock* TimeTextBlock; // 0x418(0x08)
	struct U*153e035a86* WidgetKeyboardIcon; // 0x420(0x08)
};

// Class TslGame.*3d20df122e
// Size: 0x4a0 (Inherited: 0x418)
struct U*3d20df122e : U*4bb82286ac {
	struct U*151dcf36b0* StatusBoard; // 0x418(0x08)
	struct U*4e4e0115a8* HUDRoundcount; // 0x420(0x08)
	struct U*de7370aff1* HUDCoin; // 0x428(0x08)
	struct U*93d0379050* StoreTimer; // 0x430(0x08)
	struct U*87ff2ea80c* StartEffect; // 0x438(0x08)
	struct U*793ec86546* RoundResultEffect; // 0x440(0x08)
	char pad_448[0x58]; // 0x448(0x58)

	int32 *da99d0cde2(); // Function TslGame.*3d20df122e.*da99d0cde2 // Final|Native|Private // @ game+0x58e9680
	void UpdateMarketKeyboardIcon(); // Function TslGame.*3d20df122e.UpdateMarketKeyboardIcon // Final|Native|Private // @ game+0x58fa9d4
	bool SetAllChildWidgetVisiblity(); // Function TslGame.*3d20df122e.SetAllChildWidgetVisiblity // Final|Native|Private // @ game+0x58f726c
	void *c4a784a66b(); // Function TslGame.*3d20df122e.*c4a784a66b // Final|Native|Private // @ game+0x58f141c
	void *16bec7f5d9(); // Function TslGame.*3d20df122e.*16bec7f5d9 // Final|Native|Private // @ game+0x58f1a6c
	void *da02ae6995(); // Function TslGame.*3d20df122e.*da02ae6995 // Final|Native|Private // @ game+0x58f18fc
	enum class ETslBombPlantedState *4243243cbd(); // Function TslGame.*3d20df122e.*4243243cbd // Final|Native|Private // @ game+0x58f1430
	struct F*953bffc24c *5b44fa6745(); // Function TslGame.*3d20df122e.*5b44fa6745 // Final|Native|Private|HasOutParms // @ game+0x58f150c
};

// Class TslGame.*e0cdc18e0b
// Size: 0x468 (Inherited: 0x418)
struct U*e0cdc18e0b : U*4bb82286ac {
	char pad_418[0x28]; // 0x418(0x28)
	struct UClass* WeaponEntryClass; // 0x440(0x08)
	char pad_448[0x8]; // 0x448(0x08)
	struct TArray<struct U*bb93d63eab*> *21cb00fcf1; // 0x450(0x10)
	struct UWrapBox* ContainerBox; // 0x460(0x08)

	struct F*ff80ea7857 HandleOnHover(); // Function TslGame.*e0cdc18e0b.HandleOnHover // Final|Native|Private|HasOutParms // @ game+0x58e6958
	struct FName HandleOnClick(); // Function TslGame.*e0cdc18e0b.HandleOnClick // Final|Native|Private // @ game+0x58e6614
};

// Class TslGame.*5227a5d2bb
// Size: 0x528 (Inherited: 0x418)
struct U*5227a5d2bb : U*4bb82286ac {
	struct UMaterialInstanceDynamic* *7b4bc8e7ea; // 0x418(0x08)
	struct UMaterialInstanceDynamic* *0b1cbc22c5; // 0x420(0x08)
	struct UMaterialInstanceDynamic* *c3339cb31f; // 0x428(0x08)
	struct UMaterialInstanceDynamic* *85b2d2f566; // 0x430(0x08)
	struct F*a2a8693a5f *0ed31d1466; // 0x438(0x20)
	struct F*a2a8693a5f *7070713b44; // 0x458(0x20)
	struct F*a2a8693a5f *2c8ee3072c; // 0x478(0x20)
	struct F*54c30817ee *d06902fb6b; // 0x498(0x20)
	struct F*54c30817ee *87775d9509; // 0x4b8(0x20)
	struct F*54c30817ee *2210d4a1b6; // 0x4d8(0x20)
	struct F*54c30817ee *6dbfb9abaf; // 0x4f8(0x20)
	float *8e76c624fa; // 0x518(0x04)
	bool *09e1f58c1b; // 0x51c(0x01)
	bool *8862397186; // 0x51d(0x01)
	char pad_51E[0x2]; // 0x51e(0x02)
	float *22d2a9f864; // 0x520(0x04)
	float *f06c3ce664; // 0x524(0x04)
};

// Class TslGame.*455fc6d094
// Size: 0x418 (Inherited: 0x418)
struct U*455fc6d094 : U*4bb82286ac {
};

// Class TslGame.*56e9aaaf2d
// Size: 0x540 (Inherited: 0x418)
struct U*56e9aaaf2d : U*4bb82286ac {
	char pad_418[0x18]; // 0x418(0x18)
	int32 *5c694c8893; // 0x430(0x04)
	enum class ECastableItemType *dfd8aa801b; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	struct UTexture* *83a669756a; // 0x438(0x08)
	float *03ea71fd56; // 0x440(0x04)
	struct FLinearColor NormalColor; // 0x444(0x10)
	struct FLinearColor *c78ee216ad; // 0x454(0x10)
	char pad_464[0x4]; // 0x464(0x04)
	struct F*54c30817ee *b3ede13613; // 0x468(0x20)
	struct F*62d95f3263 *0859cacc64; // 0x488(0x20)
	struct F*a8249d5e73 *3cbdc8d58f; // 0x4a8(0x30)
	struct F*3cdda95245 *b8d1271c82; // 0x4d8(0x28)
	struct F*a2a8693a5f *ce9d858cef; // 0x500(0x20)
	struct F*a2a8693a5f *b144b6ccc3; // 0x520(0x20)

	void UsedAnimationPlay(); // Function TslGame.*56e9aaaf2d.UsedAnimationPlay // Final|Native|Private // @ game+0x58fb81c
	int32 GetCastableItemCount(); // Function TslGame.*56e9aaaf2d.GetCastableItemCount // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58e56a0
};

// Class TslGame.*711aeebb7f
// Size: 0x448 (Inherited: 0x418)
struct U*711aeebb7f : U*4bb82286ac {
	struct U*9c8bfa0aee* AnimCelebrateEmerging; // 0x418(0x08)
	struct U*9c8bfa0aee* AnimCelebrateVanishing; // 0x420(0x08)
	struct USizeBox* SizeboxTextArea; // 0x428(0x08)
	float *fe818ab54f; // 0x430(0x04)
	char pad_434[0x14]; // 0x434(0x14)

	void *96b389201e(); // Function TslGame.*711aeebb7f.*96b389201e // Final|Native|Private // @ game+0x58f0678
};

// Class TslGame.*28f5c60af5
// Size: 0x530 (Inherited: 0x418)
struct U*28f5c60af5 : U*4bb82286ac {
	struct FVector2D *305b107d91; // 0x418(0x08)
	struct FVector2D *0116c8543b; // 0x420(0x08)
	struct FVector2D *36ef11b5d8; // 0x428(0x08)
	struct F*a8249d5e73 CharacterBorder_Binder; // 0x430(0x30)
	struct F*aecf96cb1e CharacterSceneCapturedImage_Binder; // 0x460(0x28)
	struct F*54c30817ee CharacterCaptureCheckBox_Binder; // 0x488(0x20)
	struct F*54c30817ee HelmetHideCheckBox_Binder; // 0x4a8(0x20)
	struct UClass* *b1a294d6b6; // 0x4c8(0x08)
	char pad_4D0[0x20]; // 0x4d0(0x20)
	struct UHorizontalBox* HideSettings_HorizontalBox; // 0x4f0(0x08)
	struct UButton* HideSettings_Button; // 0x4f8(0x08)
	struct UBorder* HideItems_Border; // 0x500(0x08)
	struct UBorder* CharacterCapture_Border; // 0x508(0x08)
	struct UCheckBox* BeltHide_CheckBox; // 0x510(0x08)
	struct UCheckBox* ArmorHide_CheckBox; // 0x518(0x08)
	struct UCheckBox* HideSettingsExpand_CheckBox; // 0x520(0x08)
	char pad_528[0x8]; // 0x528(0x08)

	struct F*20816e90ed *8a1a01e303(); // Function TslGame.*28f5c60af5.*8a1a01e303 // Final|Native|Protected|HasOutParms // @ game+0x58eb3c4
	void *7e6d2ea2f3(); // Function TslGame.*28f5c60af5.*7e6d2ea2f3 // Final|Native|Protected // @ game+0x58e4e14
	bool OnHelmetHideCheckStatChanged(); // Function TslGame.*28f5c60af5.OnHelmetHideCheckStatChanged // Final|Native|Protected // @ game+0x58eb330
	bool OnHideSettingsCheckStatChanged(); // Function TslGame.*28f5c60af5.OnHideSettingsCheckStatChanged // Final|Native|Protected // @ game+0x58eb550
	bool OnArmorHideCheckStatChanged(); // Function TslGame.*28f5c60af5.OnArmorHideCheckStatChanged // Final|Native|Protected // @ game+0x58e850c
	bool SetHideCharacterLayer(); // Function TslGame.*28f5c60af5.SetHideCharacterLayer // Final|Native|Public|BlueprintCallable // @ game+0x58f798c
	struct F*20816e90ed *27131c849b(); // Function TslGame.*28f5c60af5.*27131c849b // Final|Native|Protected|HasOutParms // @ game+0x58eb5f8
	struct UCheckBox* *a1fb79d519(); // Function TslGame.*28f5c60af5.*a1fb79d519 // Final|Native|Protected // @ game+0x58e4acc
	void *a9c9630e61(); // Function TslGame.*28f5c60af5.*a9c9630e61 // Final|Native|Protected // @ game+0x58e4dec
	struct F*20816e90ed *2f18436799(); // Function TslGame.*28f5c60af5.*2f18436799 // Final|Native|Protected|HasOutParms // @ game+0x58e9748
	void OnHideSettingsClick(); // Function TslGame.*28f5c60af5.OnHideSettingsClick // Final|Native|Protected // @ game+0x58eb5e4
	bool OnCheckStatChanged(); // Function TslGame.*28f5c60af5.OnCheckStatChanged // Final|Native|Protected // @ game+0x58e98e8
	void *2355b27555(); // Function TslGame.*28f5c60af5.*2355b27555 // Final|Native|Protected // @ game+0x58e4e00
	void InitCharacterCapture(); // Function TslGame.*28f5c60af5.InitCharacterCapture // Final|Native|Protected // @ game+0x58e72dc
	struct AActor* OnSpawnedSceneCaptureWorld(); // Function TslGame.*28f5c60af5.OnSpawnedSceneCaptureWorld // Final|Native|Protected // @ game+0x58f0270
	struct F*20816e90ed *bb05598254(); // Function TslGame.*28f5c60af5.*bb05598254 // Final|Native|Protected|HasOutParms // @ game+0x58f11fc
	struct F*20816e90ed *cc1492ad4c(); // Function TslGame.*28f5c60af5.*cc1492ad4c // Final|Native|Protected|HasOutParms // @ game+0x58e85a0
	struct F*20816e90ed *ae3df3c255(); // Function TslGame.*28f5c60af5.*ae3df3c255 // Final|Native|Protected|HasOutParms // @ game+0x58e8d4c
	bool *49b0eec8e6(); // Function TslGame.*28f5c60af5.*49b0eec8e6 // Final|Native|Protected // @ game+0x58f2960
	void *1df7756661(); // Function TslGame.*28f5c60af5.*1df7756661 // Final|Native|Protected // @ game+0x58e4ab8
	void PlayCharacterFadeInAnimation(); // Function TslGame.*28f5c60af5.PlayCharacterFadeInAnimation // Event|Public|BlueprintEvent // @ game+0x22c9a0
	bool OnBeltHideCheckStatChanged(); // Function TslGame.*28f5c60af5.OnBeltHideCheckStatChanged // Final|Native|Protected // @ game+0x58e8cb8
	void *9c4031554a(); // Function TslGame.*28f5c60af5.*9c4031554a // Final|Native|Protected // @ game+0x58e4dd8
	struct FSlateBrush GetCharacterSceneCapturedImageBrush(); // Function TslGame.*28f5c60af5.GetCharacterSceneCapturedImageBrush // Event|Protected|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*17f281c716
// Size: 0x478 (Inherited: 0x418)
struct U*17f281c716 : U*4bb82286ac {
	bool *6d17e899b5; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	int32 *ec9ecf3cc6; // 0x41c(0x04)
	float *f326fc9f10; // 0x420(0x04)
	float *a87b27342c; // 0x424(0x04)
	struct FLinearColor *277de64064; // 0x428(0x10)
	struct FLinearColor *6d2c4dce6a; // 0x438(0x10)
	struct FLinearColor *ce8e963485; // 0x448(0x10)
	struct UMaterial* FontMaterial; // 0x458(0x08)
	struct UMaterialInstanceDynamic* *4fe459056f; // 0x460(0x08)
	struct UImage* BindImageClan; // 0x468(0x08)
	struct UTextBlock* BindTextClan; // 0x470(0x08)

	struct FString UpdateData(); // Function TslGame.*17f281c716.UpdateData // Final|Native|Public|BlueprintCallable // @ game+0x58fa388
};

// Class TslGame.*59e1d5e8b9
// Size: 0x418 (Inherited: 0x418)
struct U*59e1d5e8b9 : U*4bb82286ac {
};

// Class TslGame.*b7029b276d
// Size: 0x440 (Inherited: 0x418)
struct U*b7029b276d : U*4bb82286ac {
	struct UImage* CompassMarkerImage; // 0x418(0x08)
	char pad_420[0x20]; // 0x420(0x20)
};

// Class TslGame.*cde26f91a7
// Size: 0x5c8 (Inherited: 0x418)
struct U*cde26f91a7 : U*4bb82286ac {
	struct UImage* CompassImage; // 0x418(0x08)
	struct UImage* Compass_Marker; // 0x420(0x08)
	struct UOverlay* Team; // 0x428(0x08)
	struct UOverlay* TeamPingLayer; // 0x430(0x08)
	struct UTextBlock* DirectionTextBlock; // 0x438(0x08)
	struct UBorder* Compass; // 0x440(0x08)
	struct UMaterialInterface* *0b34a16aa3; // 0x448(0x08)
	struct UClass* *3a7a0fbadf; // 0x450(0x08)
	struct UClass* *4d7180b298; // 0x458(0x08)
	float *31dabcfc01; // 0x460(0x04)
	float Offset; // 0x464(0x04)
	bool *7d24111ed5; // 0x468(0x01)
	char pad_469[0x3]; // 0x469(0x03)
	float *db16bb7d68; // 0x46c(0x04)
	struct TMap<int32, struct F*10859ab837> *cd516e886b; // 0x470(0x50)
	struct FLinearColor *96eadd7ac3; // 0x4c0(0x10)
	int32 *ff2a641582; // 0x4d0(0x04)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	struct UMaterialInstanceDynamic* *ea5f76c4ae; // 0x4d8(0x08)
	struct U*b7029b276d* *30ba573f68; // 0x4e0(0x08)
	struct TArray<struct U*b7029b276d*> *21dd87d6e6; // 0x4e8(0x10)
	struct TMap<int32, struct F*9eeafa1e6a> *6f46b2374b; // 0x4f8(0x50)
	struct TMap<int32, struct F*9eeafa1e6a> *570b45a8ee; // 0x548(0x50)
	struct U*b7029b276d* *6eacc8e734; // 0x598(0x08)
	struct TArray<struct U*b7029b276d*> *d070a26e41; // 0x5a0(0x10)
	struct ATslPlayerController* *2088afdbe8; // 0x5b0(0x08)
	struct ATslCharacter* *fec127b3ac; // 0x5b8(0x08)
	char pad_5C0[0x8]; // 0x5c0(0x08)

	void OnUpdateViewTargetCameraActivate(); // Function TslGame.*cde26f91a7.OnUpdateViewTargetCameraActivate // Final|Native|Private // @ game+0x58f1c40
	void OnCompassShadeOptionChanged(); // Function TslGame.*cde26f91a7.OnCompassShadeOptionChanged // Final|Native|Private // @ game+0x58e9d28
	struct AActor* OnUpdateViewTarget(); // Function TslGame.*cde26f91a7.OnUpdateViewTarget // Final|Native|Private // @ game+0xc9a780
	struct U*b7029b276d* *9a504f2067(); // Function TslGame.*cde26f91a7.*9a504f2067 // Final|Native|Private // @ game+0x58e467c
	struct U*b7029b276d* *d6f29a5348(); // Function TslGame.*cde26f91a7.*d6f29a5348 // Final|Native|Private // @ game+0x58e472c
};

// Class TslGame.*c6f388bac3
// Size: 0x500 (Inherited: 0x418)
struct U*c6f388bac3 : U*4bb82286ac {
	char pad_418[0xe8]; // 0x418(0xe8)

	enum class *62cdf2ca7f OnButtonClick(); // Function TslGame.*c6f388bac3.OnButtonClick // Final|Native|Public // @ game+0x58e9234
};

// Class TslGame.*f93362347f
// Size: 0x448 (Inherited: 0x418)
struct U*f93362347f : U*4bb82286ac {
	struct U*3d4b50d105* InventoryGuideLineWidget_Lower; // 0x418(0x08)
	struct U*3d4b50d105* InventoryGuideLineWidget_Upper; // 0x420(0x08)
	struct U*3d4b50d105* InventoryGuideLineWidget_Middle; // 0x428(0x08)
	struct U*e04a683c46* TooltipKeyIconWidget; // 0x430(0x08)
	TScriptInterface<struct U*58dd07ca93> SlotContainer; // 0x438(0x10)
};

// Class TslGame.*3d4b50d105
// Size: 0x4a8 (Inherited: 0x418)
struct U*3d4b50d105 : U*4bb82286ac {
	struct UDataTable* DataTable; // 0x418(0x08)
	struct TMap<enum class EGuideKeyType, struct F*13de65a409> *a8a6ab404f; // 0x420(0x50)
	struct U*e04a683c46* KeyIconWidget1; // 0x470(0x08)
	struct U*e04a683c46* KeyIconWidget2; // 0x478(0x08)
	struct U*e04a683c46* KeyIconWidget3; // 0x480(0x08)
	struct TArray<struct U*e04a683c46*> *c613c1d468; // 0x488(0x10)
	struct TArray<enum class EGuideKeyType> *f95ba779f0; // 0x498(0x10)

	struct TArray<enum class EGuideKeyType> SwitchForm(); // Function TslGame.*3d4b50d105.SwitchForm // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58f97cc
};

// Class TslGame.*b5f49ce0ee
// Size: 0x5a0 (Inherited: 0x418)
struct U*b5f49ce0ee : U*4bb82286ac {
	struct FText Title; // 0x418(0x18)
	char pad_430[0xe0]; // 0x430(0xe0)
	struct UTextBlock* TitleText; // 0x510(0x08)
	struct UTextBlock* CountText; // 0x518(0x08)
	struct TMap<enum class ECountInfoAnimType, struct U*9c8bfa0aee*> *0e85d0196d; // 0x520(0x50)
	struct U*9c8bfa0aee* Default; // 0x570(0x08)
	struct U*9c8bfa0aee* Decreasing; // 0x578(0x08)
	struct U*9c8bfa0aee* Increasing; // 0x580(0x08)
	struct U*9c8bfa0aee* Warning; // 0x588(0x08)
	struct U*c2c6cd8a86* *5664865586; // 0x590(0x08)
	struct UClass* *fafb6a58c8; // 0x598(0x08)
};

// Class TslGame.*3350fee038
// Size: 0x5b0 (Inherited: 0x5a0)
struct U*3350fee038 : U*b5f49ce0ee {
	enum class ETrainingScoreType *ba9e5193a1; // 0x5a0(0x01)
	char pad_5A1[0xf]; // 0x5a1(0x0f)
};

// Class TslGame.*fbb84e5644
// Size: 0x420 (Inherited: 0x418)
struct U*fbb84e5644 : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
};

// Class TslGame.*6f57fc617a
// Size: 0x440 (Inherited: 0x420)
struct U*6f57fc617a : U*fbb84e5644 {
	struct F*45518ccbeb BlueBallIcon_Binder; // 0x420(0x20)
};

// Class TslGame.*52ac0d78a1
// Size: 0x458 (Inherited: 0x420)
struct U*52ac0d78a1 : U*fbb84e5644 {
	char pad_420[0x4]; // 0x420(0x04)
	float *c1f287c8eb; // 0x424(0x04)
	float *0b1f970c6d; // 0x428(0x04)
	float *e1c0a468f1; // 0x42c(0x04)
	struct FVector2D *4a9b7911fc; // 0x430(0x08)
	int32 *638e4ff3d5; // 0x438(0x04)
	float *69f50070e5; // 0x43c(0x04)
	struct USizeBox* ChickenIcon; // 0x440(0x08)
	struct UImage* FeatherZone; // 0x448(0x08)
	struct ATslMonsterChicken* Chicken; // 0x450(0x08)
};

// Class TslGame.*2af6b5c45f
// Size: 0x5b8 (Inherited: 0x418)
struct U*2af6b5c45f : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct UTextBlock* TextTitleBind; // 0x420(0x08)
	struct UTextBlock* WeaponNameBind; // 0x428(0x08)
	struct UImage* ImagePersonHeadBind; // 0x430(0x08)
	struct UImage* ImagePersonTorsoBind; // 0x438(0x08)
	struct UImage* ImagePersonArmBind; // 0x440(0x08)
	struct UImage* ImagePersonPelvisBind; // 0x448(0x08)
	struct UImage* ImagePersonLegBind; // 0x450(0x08)
	struct UTextBlock* CalcTextBind; // 0x458(0x08)
	struct UTextBlock* WeaponClassTextBind; // 0x460(0x08)
	struct UTextBlock* WeaponMultiplierTextBind; // 0x468(0x08)
	struct UTextBlock* DamageReasonTextBind; // 0x470(0x08)
	struct UTextBlock* HitBoneBind; // 0x478(0x08)
	struct UTextBlock* WeaponHeadMultiplierBind; // 0x480(0x08)
	struct UTextBlock* BoneBind1; // 0x488(0x08)
	struct UTextBlock* BoneBind2; // 0x490(0x08)
	struct UTextBlock* BoneBind3; // 0x498(0x08)
	struct UTextBlock* BoneBind4; // 0x4a0(0x08)
	struct UTextBlock* BoneBind5; // 0x4a8(0x08)
	struct UTextBlock* BoneBind6; // 0x4b0(0x08)
	struct UTextBlock* MultiplierBind1; // 0x4b8(0x08)
	struct UTextBlock* MultiplierBind2; // 0x4c0(0x08)
	struct UTextBlock* MultiplierBind3; // 0x4c8(0x08)
	struct UTextBlock* MultiplierBind4; // 0x4d0(0x08)
	struct UTextBlock* MultiplierBind5; // 0x4d8(0x08)
	struct UTextBlock* MultiplierBind6; // 0x4e0(0x08)
	struct U*9c8bfa0aee* AnimHead; // 0x4e8(0x08)
	struct U*9c8bfa0aee* AnimTorso; // 0x4f0(0x08)
	struct U*9c8bfa0aee* AnimArm; // 0x4f8(0x08)
	struct U*9c8bfa0aee* AnimPelvis; // 0x500(0x08)
	struct U*9c8bfa0aee* AnimLeg; // 0x508(0x08)
	struct UButton* Lv0Btn; // 0x510(0x08)
	struct UButton* Lv1Btn; // 0x518(0x08)
	struct UButton* Lv2Btn; // 0x520(0x08)
	struct UButton* Lv3Btn; // 0x528(0x08)
	struct UButton* DBNOBtn; // 0x530(0x08)
	struct UButton* StandBtn; // 0x538(0x08)
	struct TArray<struct UTextBlock*> BoneNames; // 0x540(0x10)
	struct TArray<struct UTextBlock*> *401baa9aa0; // 0x550(0x10)
	struct TArray<struct FLinearColor> *9556abcbfa; // 0x560(0x10)
	struct UTextBlock* HelmetNameTextBind; // 0x570(0x08)
	struct UTextBlock* HelmetDamageReductionRateTextBind; // 0x578(0x08)
	struct UTextBlock* ArmorNameTextBind; // 0x580(0x08)
	struct UTextBlock* ArmorDamageReductionRateTextBind; // 0x588(0x08)
	struct UTextBlock* FinalDamageFormulaBind; // 0x590(0x08)
	struct UTextBlock* DBNOFormulaTextBind; // 0x598(0x08)
	struct UTextBlock* DamageAfterDBNOResistanceBind; // 0x5a0(0x08)
	struct UTextBlock* LastMinOperationBind; // 0x5a8(0x08)
	struct UTextBlock* LowerClampMaxOpBind; // 0x5b0(0x08)

	void OnLv3BtnClicked(); // Function TslGame.*2af6b5c45f.OnLv3BtnClicked // Final|Native|Protected // @ game+0x58ec9f8
	float OnTargetCharacterTakeDamage(); // Function TslGame.*2af6b5c45f.OnTargetCharacterTakeDamage // Final|Native|Public // @ game+0x58f07cc
	void OnLv0BtnClicked(); // Function TslGame.*2af6b5c45f.OnLv0BtnClicked // Final|Native|Protected // @ game+0x58ec9bc
	void OnLv1BtnClicked(); // Function TslGame.*2af6b5c45f.OnLv1BtnClicked // Final|Native|Protected // @ game+0x58ec9d0
	void OnLv2BtnClicked(); // Function TslGame.*2af6b5c45f.OnLv2BtnClicked // Final|Native|Protected // @ game+0x58ec9e4
	void OnStandBtnClicked(); // Function TslGame.*2af6b5c45f.OnStandBtnClicked // Final|Native|Protected // @ game+0x58f0580
	void OnDBNOBtnClicked(); // Function TslGame.*2af6b5c45f.OnDBNOBtnClicked // Final|Native|Protected // @ game+0x58e9e74
};

// Class TslGame.*9a3bd90636
// Size: 0x468 (Inherited: 0x418)
struct U*9a3bd90636 : U*4bb82286ac {
	char pad_418[0x18]; // 0x418(0x18)
	struct UTextBlock* TextDescription; // 0x430(0x08)
	struct UCheckBox* CheckBox; // 0x438(0x08)
	struct UButton* ButtonCheckArea; // 0x440(0x08)
	char pad_448[0x20]; // 0x448(0x20)

	void HandleOnClickStateChanged(); // Function TslGame.*9a3bd90636.HandleOnClickStateChanged // Final|Native|Private // @ game+0x58e67d0
	bool HandleOnCheckStateChanged(); // Function TslGame.*9a3bd90636.HandleOnCheckStateChanged // Final|Native|Private // @ game+0x58e6498
};

// Class TslGame.*fd5437079a
// Size: 0x440 (Inherited: 0x418)
struct U*fd5437079a : U*4bb82286ac {
	struct U*5a9f2ac0d1* ReportRadioBox; // 0x418(0x08)
	struct UTextBlock* TextGuide; // 0x420(0x08)
	struct USizeBox* SizeboxCheatingDetail; // 0x428(0x08)
	struct UMultiLineEditableTextBox* TextboxCheatingDetail; // 0x430(0x08)
	int32 *4f444c0819; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)

	struct FText HandleOnTextChanged(); // Function TslGame.*fd5437079a.HandleOnTextChanged // Final|Native|Private|HasOutParms // @ game+0x58e6e0c
	struct U*9a3bd90636* HandleOnOptionToggled(); // Function TslGame.*fd5437079a.HandleOnOptionToggled // Final|Native|Private // @ game+0x58e6ce4
};

// Class TslGame.*5a9f2ac0d1
// Size: 0x450 (Inherited: 0x418)
struct U*5a9f2ac0d1 : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	struct UClass* *f6428b268c; // 0x428(0x08)
	struct UVerticalBox* RadioButtonContainer; // 0x430(0x08)
	struct TArray<struct U*9a3bd90636*> *0218a67aae; // 0x438(0x10)
	char pad_448[0x8]; // 0x448(0x08)

	bool HandleOnCheckStateChanged(); // Function TslGame.*5a9f2ac0d1.HandleOnCheckStateChanged // Final|Native|Private // @ game+0x58e653c
};

// Class TslGame.*e82f6cac7e
// Size: 0x4b8 (Inherited: 0x418)
struct U*e82f6cac7e : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	struct FLinearColor NormalColor; // 0x428(0x10)
	struct F*aecf96cb1e CheckImage_Binder; // 0x438(0x28)
	bool *9a5c83905e; // 0x460(0x01)
	bool *4dd00955db; // 0x461(0x01)
	bool *6544e32c58; // 0x462(0x01)
	char pad_463[0x5]; // 0x463(0x05)
	struct U*4bb82286ac* Owner; // 0x468(0x08)
	struct F*62d95f3263 DisplayText_Binder; // 0x470(0x20)
	struct FLinearColor HighlightColor; // 0x490(0x10)
	struct FLinearColor SelectedColor; // 0x4a0(0x10)
	char pad_4B0[0x8]; // 0x4b0(0x08)
};

// Class TslGame.*79cfaa038b
// Size: 0x530 (Inherited: 0x4b8)
struct U*79cfaa038b : U*e82f6cac7e {
	struct USizeBox* CheckNormal_SizeBox; // 0x4b8(0x08)
	struct USizeBox* CheckFocused_SizeBox; // 0x4c0(0x08)
	struct UWidgetSwitcher* Dropdown_Switcher; // 0x4c8(0x08)
	struct FString *e0a02b5c60; // 0x4d0(0x10)
	struct FString *bd30b73a65; // 0x4e0(0x10)
	char pad_4F0[0x40]; // 0x4f0(0x40)
};

// Class TslGame.*50cfb8139b
// Size: 0x4b8 (Inherited: 0x418)
struct U*50cfb8139b : U*4bb82286ac {
	char pad_418[0x60]; // 0x418(0x60)
	struct U*9c8bfa0aee* Anim_MatchingSuccess; // 0x478(0x08)
	struct U*9c8bfa0aee* Anim_MatchingFail; // 0x480(0x08)
	char pad_488[0x10]; // 0x488(0x10)
	struct UTextBlock* Minute_Text; // 0x498(0x08)
	struct UTextBlock* Seconds_Text; // 0x4a0(0x08)
	struct UTextBlock* Result_Title_Text; // 0x4a8(0x08)
	struct UTextBlock* Result_Desc_Text; // 0x4b0(0x08)
};

// Class TslGame.*7a7aa65679
// Size: 0x4d0 (Inherited: 0x418)
struct U*7a7aa65679 : U*4bb82286ac {
	struct UBorder* ParticipateEmoteOutlineBorder; // 0x418(0x08)
	struct UBorder* ParticipateEmoteBorder; // 0x420(0x08)
	struct UBorder* ParticipateEmoteContentsBorder; // 0x428(0x08)
	struct UTextBlock* EmoteContentsText; // 0x430(0x08)
	struct FLinearColor *d900c8d498; // 0x438(0x10)
	struct FLinearColor *a794f49047; // 0x448(0x10)
	struct FLinearColor *6be3eb6f39; // 0x458(0x10)
	struct FLinearColor *14d2f47c54; // 0x468(0x10)
	struct FLinearColor *5436e6a4bf; // 0x478(0x10)
	struct FLinearColor *431fd302a9; // 0x488(0x10)
	struct FText *3074155b40; // 0x498(0x18)
	struct FText *7f1cb89cf9; // 0x4b0(0x18)
	char pad_4C8[0x8]; // 0x4c8(0x08)
};

// Class TslGame.*273db85dd3
// Size: 0x518 (Inherited: 0x418)
struct U*273db85dd3 : U*4bb82286ac {
	char pad_418[0x58]; // 0x418(0x58)
	float *b20b9523b8; // 0x470(0x04)
	char pad_474[0x94]; // 0x474(0x94)
	struct UUserWidget* *addb307b8a; // 0x508(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x510(0x08)

	bool OnEnterSlotEvent(); // Function TslGame.*273db85dd3.OnEnterSlotEvent // Final|Native|Protected // @ game+0x58ea6a0
	void UpdateSpecialSlotVisibility(); // Function TslGame.*273db85dd3.UpdateSpecialSlotVisibility // Final|Native|Protected // @ game+0xbd9bec
	enum class EEquipSlotID SaveFocusSlotId(); // Function TslGame.*273db85dd3.SaveFocusSlotId // Final|Native|Protected // @ game+0x58f4848
	void OnRefreshFocus(); // Function TslGame.*273db85dd3.OnRefreshFocus // Final|Native|Protected // @ game+0x58eeccc
	void *092d2cbff8(); // Function TslGame.*273db85dd3.*092d2cbff8 // Final|Native|Protected // @ game+0x58eece0
	void OnDoSlotActionEvent(); // Function TslGame.*273db85dd3.OnDoSlotActionEvent // Final|Native|Protected // @ game+0x58ea4b4
	bool OnLeaveSlotEvent(); // Function TslGame.*273db85dd3.OnLeaveSlotEvent // Final|Native|Protected // @ game+0x58ec324
};

// Class TslGame.*065292a11c
// Size: 0x530 (Inherited: 0x518)
struct U*065292a11c : U*273db85dd3 {
	char pad_518[0x18]; // 0x518(0x18)

	struct U*11628b8ff5* SetInventoryWidget(); // Function TslGame.*065292a11c.SetInventoryWidget // Final|Native|Public // @ game+0x58f7b10
	float OnLookup(); // Function TslGame.*065292a11c.OnLookup // Final|Native|Protected // @ game+0x58ec940
	void OnPressedCaptureCharacterRotateOn(); // Function TslGame.*065292a11c.OnPressedCaptureCharacterRotateOn // Final|Native|Protected // @ game+0x58eeab8
	void OnReleasedCaptureCharacterRotateOn(); // Function TslGame.*065292a11c.OnReleasedCaptureCharacterRotateOn // Final|Native|Protected // @ game+0x58eed14
	float OnTurn(); // Function TslGame.*065292a11c.OnTurn // Final|Native|Protected // @ game+0x58f1314
};

// Class TslGame.*af502249b2
// Size: 0x548 (Inherited: 0x518)
struct U*af502249b2 : U*273db85dd3 {
	struct F*c0b2c1bc8a *b425620e8d; // 0x518(0x28)
	char pad_540[0x8]; // 0x540(0x08)
};

// Class TslGame.*a5e93a32ad
// Size: 0x438 (Inherited: 0x418)
struct U*a5e93a32ad : U*4bb82286ac {
	struct ATslCharacter* *d16bed275a; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)

	bool *b0c1a7304a(); // Function TslGame.*a5e93a32ad.*b0c1a7304a // Final|Native|Protected // @ game+0x58f0394
	bool OnMatchStarted(); // Function TslGame.*a5e93a32ad.OnMatchStarted // Final|Native|Protected // @ game+0xa11490
	struct AActor* OnUpdateViewTarget(); // Function TslGame.*a5e93a32ad.OnUpdateViewTarget // Final|Native|Protected // @ game+0xa12e24
};

// Class TslGame.*85965ef387
// Size: 0x468 (Inherited: 0x438)
struct U*85965ef387 : U*a5e93a32ad {
	struct U*9c8bfa0aee* AnimAppear; // 0x438(0x08)
	struct U*9c8bfa0aee* AnimDisappear; // 0x440(0x08)
	struct UImage* ImageIcon; // 0x448(0x08)
	struct UMaterial* *c0e6a7051f; // 0x450(0x08)
	struct UMaterial* *ed1b332366; // 0x458(0x08)
	enum class EBlueBlockerStateUIType *9e0debafac; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
};

// Class TslGame.*c6ef9403ee
// Size: 0x460 (Inherited: 0x438)
struct U*c6ef9403ee : U*a5e93a32ad {
	struct UImage* BoostGaugeImage; // 0x438(0x08)
	struct USizeBox* BoostGaugeSizeBox; // 0x440(0x08)
	char pad_448[0x18]; // 0x448(0x18)

	void UpdateGauge(); // Function TslGame.*c6ef9403ee.UpdateGauge // Final|Native|Protected // @ game+0x58fa620
};

// Class TslGame.*2d619ff5a9
// Size: 0x468 (Inherited: 0x438)
struct U*2d619ff5a9 : U*a5e93a32ad {
	struct UImage* BreathGaugeBG; // 0x438(0x08)
	enum class EBreathType *d3074d03f7; // 0x440(0x01)
	char pad_441[0x1f]; // 0x441(0x1f)
	float *e228f6a1e5; // 0x460(0x04)
	bool *6b744ebcbe; // 0x464(0x01)
	bool *bcca7174a9; // 0x465(0x01)
	char pad_466[0x2]; // 0x466(0x02)

	bool OnStartBuff(); // Function TslGame.*2d619ff5a9.OnStartBuff // Final|Native|Protected // @ game+0x58f0594
	void OnUpdateBreathGauge(); // Function TslGame.*2d619ff5a9.OnUpdateBreathGauge // Final|Native|Protected // @ game+0x58e997c
};

// Class TslGame.*f21c4eed93
// Size: 0x470 (Inherited: 0x468)
struct U*f21c4eed93 : U*2d619ff5a9 {
	struct U*9c8bfa0aee* OutOfBreath; // 0x468(0x08)
};

// Class TslGame.*85276e3260
// Size: 0x4b0 (Inherited: 0x468)
struct U*85276e3260 : U*2d619ff5a9 {
	struct U*9c8bfa0aee* Breathing; // 0x468(0x08)
	struct U*9c8bfa0aee* Drowning; // 0x470(0x08)
	struct U*9c8bfa0aee* Cooldown; // 0x478(0x08)
	struct FLinearColor *e64f020202; // 0x480(0x10)
	struct FLinearColor *e10f46066d; // 0x490(0x10)
	struct FLinearColor *f75f396193; // 0x4a0(0x10)
};

// Class TslGame.*63b5f20eb6
// Size: 0x4b0 (Inherited: 0x438)
struct U*63b5f20eb6 : U*a5e93a32ad {
	struct UMaterialInterface* BuffIconBrush; // 0x438(0x08)
	struct UMaterialInstanceDynamic* *8eb1111991; // 0x440(0x08)
	struct UImage* BuffIcon; // 0x448(0x08)
	float *038236c118; // 0x450(0x04)
	float *0dccaaf531; // 0x454(0x04)
	struct TMap<float, float> *efa6af9712; // 0x458(0x50)
	char pad_4A8[0x8]; // 0x4a8(0x08)

	void UpdateBuffIcon(); // Function TslGame.*63b5f20eb6.UpdateBuffIcon // Final|Native|Protected // @ game+0x58f9ec4
};

// Class TslGame.*584ea2ddf3
// Size: 0x460 (Inherited: 0x438)
struct U*584ea2ddf3 : U*a5e93a32ad {
	struct UTslHpAndBoostGaugeHudWidget* HpAndBoostGaugeHudWidget; // 0x438(0x08)
	struct U*000248f19b* CharacterStanceWidget; // 0x440(0x08)
	struct URetainerBox* CharacterStanceRetainerBoxWidget; // 0x448(0x08)
	struct U*fc41603468* VolumeReducerIconWidget; // 0x450(0x08)
	struct U*f6d85fd3d4* VoiceChatMicWidget; // 0x458(0x08)
};

// Class TslGame.*0c509dc52d
// Size: 0x460 (Inherited: 0x460)
struct U*0c509dc52d : U*584ea2ddf3 {
};

// Class TslGame.*52755705ca
// Size: 0x4b0 (Inherited: 0x438)
struct U*52755705ca : U*a5e93a32ad {
	struct UImage* Hp_Image; // 0x438(0x08)
	struct UImage* HitImage; // 0x440(0x08)
	struct UTextBlock* Hp_Text; // 0x448(0x08)
	struct U*9c8bfa0aee* HitAnim; // 0x450(0x08)
	struct U*9c8bfa0aee* MyHitAnim; // 0x458(0x08)
	struct UStringTable* *6462730e55; // 0x460(0x08)
	int32 DecimalPlacesNum; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct U*45b9c64cec* LifeGaugeColorData; // 0x470(0x08)
	bool *da2d06f224; // 0x478(0x01)
	char pad_479[0x37]; // 0x479(0x37)

	void OnInitChickenWidget(); // Function TslGame.*52755705ca.OnInitChickenWidget // Final|Native|Public // @ game+0x58ebec8
	void *ba11d938fb(); // Function TslGame.*52755705ca.*ba11d938fb // Final|Native|Public // @ game+0x58e72f0
	bool OnUpdateHP(); // Function TslGame.*52755705ca.OnUpdateHP // Final|Native|Public // @ game+0x58f160c
};

// Class TslGame.*884bb78011
// Size: 0x498 (Inherited: 0x438)
struct U*884bb78011 : U*a5e93a32ad {
	enum class EEquipSlotID EquipSlotID; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct UMaterial* EquipableIconMaterial; // 0x440(0x08)
	float *6df531e69a; // 0x448(0x04)
	float *5ac42a3ce2; // 0x44c(0x04)
	struct UImage* EquipableItemIconImage; // 0x450(0x08)
	struct UEquipableItem* *15fd006d28; // 0x458(0x08)
	char pad_460[0x18]; // 0x460(0x18)
	struct AInventoryFacade* InventoryFacade; // 0x478(0x08)
	struct AEquipment* Equipment; // 0x480(0x08)
	char pad_488[0x10]; // 0x488(0x10)

	void OnUpdateIconGauge(); // Function TslGame.*884bb78011.OnUpdateIconGauge // Final|Native|Protected // @ game+0xa15478
	void OnUpdateEquipment(); // Function TslGame.*884bb78011.OnUpdateEquipment // Final|Native|Protected // @ game+0xa154cc
	void OnUpdateIcon(); // Function TslGame.*884bb78011.OnUpdateIcon // Final|Native|Protected // @ game+0xa15f78
};

// Class TslGame.*a68e978435
// Size: 0x4a8 (Inherited: 0x498)
struct U*a68e978435 : U*884bb78011 {
	struct AInventory* Inventory; // 0x498(0x08)
	struct U*9c8bfa0aee* CapacityFullWarning; // 0x4a0(0x08)

	int32 OnUpdateSpaceGague(); // Function TslGame.*a68e978435.OnUpdateSpaceGague // Final|Native|Protected|HasOutParms // @ game+0xc9f814
	void OnNoBagSpaceEvent(); // Function TslGame.*a68e978435.OnNoBagSpaceEvent // Final|Native|Protected // @ game+0x58edee0
};

// Class TslGame.*9df689c74f
// Size: 0x498 (Inherited: 0x498)
struct U*9df689c74f : U*884bb78011 {
};

// Class TslGame.TslHpAndBoostGaugeHudWidget
// Size: 0x460 (Inherited: 0x438)
struct UTslHpAndBoostGaugeHudWidget : U*a5e93a32ad {
	struct F*54f580ef4d *b37aba5e78; // 0x438(0x18)
	struct U*c6ef9403ee* BoostGaugeWidget; // 0x450(0x08)
	struct U*6551c3bde5* HpGaugeWidget; // 0x458(0x08)

	void OnReset(); // Function TslGame.TslHpAndBoostGaugeHudWidget.OnReset // Final|Native|Protected // @ game+0x58ef22c
};

// Class TslGame.*6551c3bde5
// Size: 0x588 (Inherited: 0x438)
struct U*6551c3bde5 : U*a5e93a32ad {
	struct U*45b9c64cec* LifeGaugeColorData; // 0x438(0x08)
	struct TMap<int32, struct FLinearColor> *4159f246b6; // 0x440(0x50)
	char pad_490[0x8]; // 0x490(0x08)
	struct UImage* HpBar; // 0x498(0x08)
	struct UProgressBar* BluezoneBlocker_ProgressBar; // 0x4a0(0x08)
	struct UOverlay* EffectLayerBinder; // 0x4a8(0x08)
	struct UBorder* InnerBg; // 0x4b0(0x08)
	struct UWidgetSwitcher* HpBgSwitcher; // 0x4b8(0x08)
	struct UTextBlock* HpText; // 0x4c0(0x08)
	struct UTextBlock* MaxHpText; // 0x4c8(0x08)
	struct U*9c8bfa0aee* Warning; // 0x4d0(0x08)
	struct U*9c8bfa0aee* ZombieVirus; // 0x4d8(0x08)
	struct U*9c8bfa0aee* ZombieDBNO; // 0x4e0(0x08)
	bool bUseEffect; // 0x4e8(0x01)
	char pad_4E9[0x7]; // 0x4e9(0x07)
	struct UClass* DamageEffectClass; // 0x4f0(0x08)
	struct UClass* HealEffectClass; // 0x4f8(0x08)
	struct UClass* HealAmountEffectClass; // 0x500(0x08)
	int32 DamageEffectMax; // 0x508(0x04)
	int32 HealEffectMax; // 0x50c(0x04)
	bool *e856c18e8f; // 0x510(0x01)
	bool *da2d06f224; // 0x511(0x01)
	char pad_512[0x2]; // 0x512(0x02)
	struct FLinearColor *f3d8a37662; // 0x514(0x10)
	struct FLinearColor *4d58100a29; // 0x524(0x10)
	char pad_534[0x14]; // 0x534(0x14)
	struct U*80788d272a* *4ec33d3dbd; // 0x548(0x08)
	struct TArray<struct U*80788d272a*> *3053eca3c4; // 0x550(0x10)
	struct TArray<struct U*80788d272a*> *b9c251b778; // 0x560(0x10)
	char pad_570[0x18]; // 0x570(0x18)

	struct U*80788d272a* OnDestoryDamageEffect(); // Function TslGame.*6551c3bde5.OnDestoryDamageEffect // Final|Native|Protected // @ game+0xc3a0d0
	void OnUpdateHP(); // Function TslGame.*6551c3bde5.OnUpdateHP // Final|Native|Protected // @ game+0x8d8160
	struct U*80788d272a* OnDestoryHealEffect(); // Function TslGame.*6551c3bde5.OnDestoryHealEffect // Final|Native|Protected // @ game+0x58ea174
	bool OnUsingCastObject(); // Function TslGame.*6551c3bde5.OnUsingCastObject // Final|Native|Protected // @ game+0x8d81e4
	struct FString OnCharacterDeath(); // Function TslGame.*6551c3bde5.OnCharacterDeath // Final|Native|Protected // @ game+0x8d80cc
	void *70f05263c8(); // Function TslGame.*6551c3bde5.*70f05263c8 // Final|Native|Protected // @ game+0x58ef570
};

// Class TslGame.*fc41603468
// Size: 0x448 (Inherited: 0x438)
struct U*fc41603468 : U*a5e93a32ad {
	struct UImage* VolumeDuckingImage; // 0x438(0x08)
	struct UInvalidationBox* VolumeDuckingInvalidationBox; // 0x440(0x08)

	bool UpdateDuckingState(); // Function TslGame.*fc41603468.UpdateDuckingState // Final|Native|Public // @ game+0x58fa4e4
};

// Class TslGame.*08e695849a
// Size: 0x4d0 (Inherited: 0x438)
struct U*08e695849a : U*a5e93a32ad {
	struct U*9c8bfa0aee* Timer_FadeIn; // 0x438(0x08)
	struct U*9c8bfa0aee* Timer_FadeOut; // 0x440(0x08)
	struct U*9c8bfa0aee* Notification_FadeIn; // 0x448(0x08)
	struct U*9c8bfa0aee* Notification_FadeOut; // 0x450(0x08)
	struct U*9c8bfa0aee* Message_FadeIn; // 0x458(0x08)
	struct U*9c8bfa0aee* Message_FadeOut; // 0x460(0x08)
	struct U*9c8bfa0aee* Message_Active; // 0x468(0x08)
	struct U*9c8bfa0aee* Top5_FadeIn; // 0x470(0x08)
	struct U*9c8bfa0aee* Top5_FadeOut; // 0x478(0x08)
	struct UUserWidget* SignalNotificationWidget; // 0x480(0x08)
	struct U*8a35160386* SignalTop5NotificationWidget; // 0x488(0x08)
	struct U*132ca67206* SignalTimerWidget; // 0x490(0x08)
	struct UImage* Top5GlowImage; // 0x498(0x08)
	struct UOverlay* SignalMessageParticleOverlay; // 0x4a0(0x08)
	struct UTextBlock* SignalMessageText; // 0x4a8(0x08)
	struct UTextBlock* Top5MessageText; // 0x4b0(0x08)
	int32 CPPResultShowTime; // 0x4b8(0x04)
	bool *e2f8c5d18d; // 0x4bc(0x01)
	char pad_4BD[0x3]; // 0x4bd(0x03)
	float *481a310364; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct F*2ef3a887d0 *e467d92b77; // 0x4c8(0x08)

	void OnUpdateSignalZone(); // Function TslGame.*08e695849a.OnUpdateSignalZone // Final|Native|Protected // @ game+0x58f19b4
	bool OnNotifyCPPWinResult(); // Function TslGame.*08e695849a.OnNotifyCPPWinResult // Final|Native|Protected // @ game+0x58edef4
	void OnUpdateGroggy(); // Function TslGame.*08e695849a.OnUpdateGroggy // Final|Native|Protected // @ game+0x58f15f8
	bool OnNotifyCPPWinShow(); // Function TslGame.*08e695849a.OnNotifyCPPWinShow // Final|Native|Protected // @ game+0x58edf88
	void OnPlayMessageActiveAnimation(); // Function TslGame.*08e695849a.OnPlayMessageActiveAnimation // Final|Native|Private // @ game+0x58ee834
	void *723260bf78(); // Function TslGame.*08e695849a.*723260bf78 // Final|Native|Private // @ game+0x58e715c
};

// Class TslGame.*ebd66a56df
// Size: 0x4a0 (Inherited: 0x438)
struct U*ebd66a56df : U*a5e93a32ad {
	struct UImage* SignalGaugeBarImage; // 0x438(0x08)
	struct UOverlay* EffectLayerBinder; // 0x440(0x08)
	struct UClass* DecreaseSignalEffectClass; // 0x448(0x08)
	struct UClass* IncreaseSignalEffectClass; // 0x450(0x08)
	struct UClass* SignalAmountEffectClass; // 0x458(0x08)
	int32 DecreaseSignalEffectMax; // 0x460(0x04)
	int32 IncreaseSignalEffectMax; // 0x464(0x04)
	struct U*dacb76be56* *a92faa7bf9; // 0x468(0x08)
	struct TArray<struct U*dacb76be56*> *8884bf94d2; // 0x470(0x10)
	struct TArray<struct U*dacb76be56*> *24d54488dc; // 0x480(0x10)
	float SignalAmount; // 0x490(0x04)
	float Signal; // 0x494(0x04)
	float *94f1fce6c7; // 0x498(0x04)
	float *3769c16811; // 0x49c(0x04)

	bool OnUsingCastObject(); // Function TslGame.*ebd66a56df.OnUsingCastObject // Final|Native|Protected // @ game+0x58f1d0c
	float *566999f89d(); // Function TslGame.*ebd66a56df.*566999f89d // Final|Native|Protected // @ game+0x58e5f9c
	void OnUpdateSignal(); // Function TslGame.*ebd66a56df.OnUpdateSignal // Final|Native|Protected|BlueprintCallable // @ game+0x58f19a0
	struct U*dacb76be56* OnDestoryDecreaseEffect(); // Function TslGame.*ebd66a56df.OnDestoryDecreaseEffect // Final|Native|Protected // @ game+0x58ea0d8
	struct U*dacb76be56* OnDestoryIncreaseEffect(); // Function TslGame.*ebd66a56df.OnDestoryIncreaseEffect // Final|Native|Protected // @ game+0x58ea204
	void UpdateGauge(); // Function TslGame.*ebd66a56df.UpdateGauge // Final|Native|Protected // @ game+0x58fa634
	void *05a6546a79(); // Function TslGame.*ebd66a56df.*05a6546a79 // Final|Native|Protected // @ game+0x58ebeb4
	void *2845ac5130(); // Function TslGame.*ebd66a56df.*2845ac5130 // Final|Native|Protected // @ game+0x58ea09c
	void UpdateWidget(); // Function TslGame.*ebd66a56df.UpdateWidget // Final|Native|Protected // @ game+0x58fa634
	float *c60b5cef19(); // Function TslGame.*ebd66a56df.*c60b5cef19 // Final|Native|Protected // @ game+0x58fad0c
};

// Class TslGame.*132ca67206
// Size: 0x458 (Inherited: 0x438)
struct U*132ca67206 : U*a5e93a32ad {
	struct UImage* SignalGaugeImage; // 0x438(0x08)
	struct UTextBlock* SignalCounterText; // 0x440(0x08)
	int32 Countdown; // 0x448(0x04)
	int32 *5529fae01a; // 0x44c(0x04)
	struct F*2ef3a887d0 *db99764b04; // 0x450(0x08)

	void *9c5d7b350e(); // Function TslGame.*132ca67206.*9c5d7b350e // Final|Native|Private // @ game+0x58e5360
	void UpdateWidget(); // Function TslGame.*132ca67206.UpdateWidget // Final|Native|Private // @ game+0x58e5360
	void *9442174129(); // Function TslGame.*132ca67206.*9442174129 // Final|Native|Public // @ game+0x58e7cc4
	void *75e6b5a3aa(); // Function TslGame.*132ca67206.*75e6b5a3aa // Final|Native|Public // @ game+0x58e63b4
};

// Class TslGame.*1720316e28
// Size: 0x518 (Inherited: 0x438)
struct U*1720316e28 : U*a5e93a32ad {
	struct U*bc0c84b5b8* StageInfoWidget; // 0x438(0x08)
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x440(0x08)
	struct U*480ac9b9e6* TutorialMissionListWidget; // 0x448(0x08)
	struct UTextBlock* TextKillBind; // 0x450(0x08)
	struct U*8ac1663b75* HungerGaugeWidget; // 0x458(0x08)
	struct U*a93c16f324* AdditionalIcon; // 0x460(0x08)
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x468(0x08)
	struct U*153e035a86* KeyHintPcIconCrafting; // 0x470(0x08)
	struct U*153e035a86* KeyHintPcIconScoreBoard; // 0x478(0x08)
	struct U*153e035a86* KeyHintPcIconRules; // 0x480(0x08)
	struct F*ba667e36c6 *15788962c6; // 0x488(0x20)
	struct F*ba667e36c6 *eb1d383c76; // 0x4a8(0x20)
	struct FText *6d6af9851d; // 0x4c8(0x18)
	struct UClass* *ea54d48e58; // 0x4e0(0x08)
	struct ATslSLBPlayerState* *090f81381e; // 0x4e8(0x08)
	struct U*25488f9f87* *37d7e8a056; // 0x4f0(0x08)
	char pad_4F8[0x20]; // 0x4f8(0x20)

	struct ATslSLBPlayerState* *98573b6ba1(); // Function TslGame.*1720316e28.*98573b6ba1 // Final|Native|Protected // @ game+0x58f1910
	void *2766fb5d72(); // Function TslGame.*1720316e28.*2766fb5d72 // Final|Native|Protected // @ game+0x58f9e88
	struct ATslSLBPlayerState* *3eb68821a6(); // Function TslGame.*1720316e28.*3eb68821a6 // Final|Native|Protected // @ game+0x58ef5b4
	struct ATslPlayerController* *434705be5c(); // Function TslGame.*1720316e28.*434705be5c // Final|Native|Protected // @ game+0x58ec8b0
	void UpdateOpenLastGateMission(); // Function TslGame.*1720316e28.UpdateOpenLastGateMission // Final|Native|Protected // @ game+0x58fab1c
	void OnReset(); // Function TslGame.*1720316e28.OnReset // Final|Native|Protected // @ game+0x58ef22c
	bool *49b0eec8e6(); // Function TslGame.*1720316e28.*49b0eec8e6 // Final|Native|Protected // @ game+0x58f3174
	struct ATslPlayerController* *89279082fd(); // Function TslGame.*1720316e28.*89279082fd // Final|Native|Protected // @ game+0x58ec820
	struct ATslCharacterBase* OnSLBModeMonsterAttacked(); // Function TslGame.*1720316e28.OnSLBModeMonsterAttacked // Final|Native|Protected // @ game+0x58ef644
	void OnChangeMissionCount(); // Function TslGame.*1720316e28.OnChangeMissionCount // Final|Native|Protected // @ game+0x58e966c
	void OnGameUserSettingApplied(); // Function TslGame.*1720316e28.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x58eaf04
};

// Class TslGame.*8ac1663b75
// Size: 0x4c0 (Inherited: 0x438)
struct U*8ac1663b75 : U*a5e93a32ad {
	char pad_438[0x8]; // 0x438(0x08)
	struct FVector4 SplitPoint; // 0x440(0x10)
	struct UImage* ImageIcon; // 0x450(0x08)
	struct UOverlay* PanelGauge; // 0x458(0x08)
	struct UImage* ImageGauge; // 0x460(0x08)
	struct UMaterialInstanceDynamic* *e6af53a983; // 0x468(0x08)
	struct UMaterialInstanceDynamic* *4753501bc2; // 0x470(0x08)
	char pad_478[0x48]; // 0x478(0x48)

	void *307fba7860(); // Function TslGame.*8ac1663b75.*307fba7860 // Final|Native|Protected // @ game+0x58e2b70
	float *fb3dc19cad(); // Function TslGame.*8ac1663b75.*fb3dc19cad // Final|Native|Protected // @ game+0x58e958c
};

// Class TslGame.*f6d85fd3d4
// Size: 0x440 (Inherited: 0x438)
struct U*f6d85fd3d4 : U*a5e93a32ad {
	struct UImage* MicIcon; // 0x438(0x08)

	enum class EVoiceInputMode OnSetCurrVoiceInputMode(); // Function TslGame.*f6d85fd3d4.OnSetCurrVoiceInputMode // Final|Native|Protected // @ game+0x58ef918
	bool OnMuteVoiceFromMe(); // Function TslGame.*f6d85fd3d4.OnMuteVoiceFromMe // Final|Native|Protected // @ game+0x58ed7f4
};

// Class TslGame.*b63428ca86
// Size: 0x468 (Inherited: 0x438)
struct U*b63428ca86 : U*a5e93a32ad {
	struct UTslWeaponHudWidget* WeaponHudWidget; // 0x438(0x08)
	struct UWidgetSwitcher* WeaponIconSwitcherWidget; // 0x440(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x448(0x08)
	float *9da57fa83c; // 0x450(0x04)
	float *414e23a95e; // 0x454(0x04)
	float *963ecf1059; // 0x458(0x04)
	float *3c59ba9b66; // 0x45c(0x04)
	char pad_460[0x8]; // 0x460(0x08)

	void OnReset(); // Function TslGame.*b63428ca86.OnReset // Final|Native|Protected // @ game+0x58ef22c
};

// Class TslGame.TslWeaponHudWidget
// Size: 0x458 (Inherited: 0x438)
struct UTslWeaponHudWidget : U*a5e93a32ad {
	struct UBackgroundBlur* WeaponHudBackgroundBlur; // 0x438(0x08)
	struct UBorder* WeaponHudBorder; // 0x440(0x08)
	struct USizeBox* BreathIconSizeBox; // 0x448(0x08)
	float *10ae986c85; // 0x450(0x04)
	float *7b06e62bf7; // 0x454(0x04)
};

// Class TslGame.*34b4d184fc
// Size: 0x488 (Inherited: 0x438)
struct U*34b4d184fc : U*a5e93a32ad {
	struct FLinearColor *86ea5200e0; // 0x438(0x10)
	struct FLinearColor *3c7247a6f8; // 0x448(0x10)
	struct FLinearColor *6f15943ea2; // 0x458(0x10)
	float *d53aa4fdfb; // 0x468(0x04)
	char pad_46C[0x14]; // 0x46c(0x14)
	struct AEquipment* *f2d4238711; // 0x480(0x08)

	float OnChangedWeapon(); // Function TslGame.*34b4d184fc.OnChangedWeapon // Final|Native|Protected // @ game+0xa0b8a0
	void OnUpdateWeapon(); // Function TslGame.*34b4d184fc.OnUpdateWeapon // Final|Native|Protected // @ game+0xa0f1b8
};

// Class TslGame.*9ca7d5632d
// Size: 0x4a8 (Inherited: 0x488)
struct U*9ca7d5632d : U*34b4d184fc {
	struct UImage* DoubleBarrelLeft; // 0x488(0x08)
	struct UImage* DoubleBarrelRight; // 0x490(0x08)
	struct UTexture2D* *364748e48a; // 0x498(0x08)
	struct UTexture2D* *4933344a6a; // 0x4a0(0x08)
};

// Class TslGame.*6c90f77119
// Size: 0x550 (Inherited: 0x488)
struct U*6c90f77119 : U*34b4d184fc {
	struct UWidgetSwitcher* CurrentFiremodeSwitcher; // 0x488(0x08)
	struct UWidgetSwitcher* NextFiremodeSwitcher; // 0x490(0x08)
	struct UBorder* NextFiremodeBorder; // 0x498(0x08)
	struct U*9c8bfa0aee* FiremodeIconChange; // 0x4a0(0x08)
	struct F*8de05442ca *a83b1b533d; // 0x4a8(0x50)
	struct TMap<struct FName, struct F*8de05442ca> *d4a6e43012; // 0x4f8(0x50)
	char pad_548[0x8]; // 0x548(0x08)
};

// Class TslGame.*998b96cd66
// Size: 0x4c8 (Inherited: 0x488)
struct U*998b96cd66 : U*34b4d184fc {
	struct UTextBlock* CurrentWeaponLoadedAmmoText; // 0x488(0x08)
	struct UTextBlock* NextWeaponLoadedAmmoText; // 0x490(0x08)
	struct U*9c8bfa0aee* LoadedAmmoDecreasing; // 0x498(0x08)
	struct U*9c8bfa0aee* LoadedAmmoIncreasing; // 0x4a0(0x08)
	struct F*9f07f2774c *6f828b15eb; // 0x4a8(0x10)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct ATslWeapon_Gun* *70c335f68e; // 0x4c0(0x08)

	void OnGameUserSettingApplied(); // Function TslGame.*998b96cd66.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x58eaf18
	int32 OnUpdatedInventory(); // Function TslGame.*998b96cd66.OnUpdatedInventory // Final|Native|Protected|HasOutParms // @ game+0xcc908c
};

// Class TslGame.*5ffada70b1
// Size: 0x4d0 (Inherited: 0x488)
struct U*5ffada70b1 : U*34b4d184fc {
	struct UTextBlock* CurrentWeaponReserveAmmoText; // 0x488(0x08)
	struct UTextBlock* NextWeaponReserveAmmoText; // 0x490(0x08)
	struct UWidgetSwitcher* SwitcherNext; // 0x498(0x08)
	struct UWidgetSwitcher* SwitcherCurrent; // 0x4a0(0x08)
	struct U*9c8bfa0aee* ReserveAmmoDecreasing; // 0x4a8(0x08)
	struct U*9c8bfa0aee* ReserveAmmoIncreasing; // 0x4b0(0x08)
	struct F*9f07f2774c *6f828b15eb; // 0x4b8(0x10)
	char pad_4C8[0x8]; // 0x4c8(0x08)
};

// Class TslGame.*8d41ad02c2
// Size: 0x510 (Inherited: 0x488)
struct U*8d41ad02c2 : U*34b4d184fc {
	struct UBorder* BorderHealmodeBind; // 0x488(0x08)
	struct UWidgetSwitcher* SwitcherHealmodeBind; // 0x490(0x08)
	struct UTextBlock* TextHealItemCountBind; // 0x498(0x08)
	struct U*9c8bfa0aee* AnimIconChangeBind; // 0x4a0(0x08)
	struct F*0ef180dfbe *e330d6fa7d; // 0x4a8(0x50)
	struct F*9f07f2774c *6f828b15eb; // 0x4f8(0x10)
	char pad_508[0x8]; // 0x508(0x08)

	int32 OnUpdateInventoryItem(); // Function TslGame.*8d41ad02c2.OnUpdateInventoryItem // Final|Native|Protected|HasOutParms // @ game+0xcd5c54
};

// Class TslGame.*78fa8706b8
// Size: 0x490 (Inherited: 0x418)
struct U*78fa8706b8 : U*4bb82286ac {
	struct UBorder* FrameBorder; // 0x418(0x08)
	struct UImage* ItemImage; // 0x420(0x08)
	struct UTextBlock* ItemCountText; // 0x428(0x08)
	struct UItem* *9b8a4d048d; // 0x430(0x08)
	struct UItem* *3c2f45b4a4; // 0x438(0x08)
	struct FName IconTextureParamName; // 0x440(0x08)
	struct FName BlinkFrameParamName; // 0x448(0x08)
	struct UCurveFloat* BlinkCurve; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
	struct UTexture* *84e09a908a; // 0x460(0x20)
	char pad_480[0x10]; // 0x480(0x10)

	struct UItem* GetCachedItem(); // Function TslGame.*78fa8706b8.GetCachedItem // Final|Native|Public|BlueprintCallable // @ game+0x58e567c
};

// Class TslGame.*d4f21bcce0
// Size: 0x4a8 (Inherited: 0x418)
struct U*d4f21bcce0 : U*4bb82286ac {
	struct TArray<struct F*54c30817ee> Slots; // 0x418(0x10)
	struct TMap<struct FName, struct F*8104398e70> *03c38602f7; // 0x428(0x50)
	struct UDataTable* *6223fa1df6; // 0x478(0x20)
	char pad_498[0x10]; // 0x498(0x10)

	struct FString LoadDataTable(); // Function TslGame.*d4f21bcce0.LoadDataTable // Final|Native|Private // @ game+0x58e7cd8
	void OnInventoryUpdated(); // Function TslGame.*d4f21bcce0.OnInventoryUpdated // Final|Native|Protected // @ game+0x58ebfa4
};

// Class TslGame.*4bb1980008
// Size: 0x458 (Inherited: 0x418)
struct U*4bb1980008 : U*4bb82286ac {
	struct UInvalidationBox* CachedInvalidationBox; // 0x418(0x08)
	int32 IconIndex; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct UMaterialInterface* MI_ProgressBar; // 0x428(0x08)
	struct FName ProgressBarMaterialParam; // 0x430(0x08)
	struct UMaterialInstanceDynamic* *29cd0a306d; // 0x438(0x08)
	char pad_440[0x8]; // 0x440(0x08)
	struct FName *13d23f6265; // 0x448(0x08)
	bool bHideCountText; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class TslGame.*8a0b35b5e3
// Size: 0x570 (Inherited: 0x458)
struct U*8a0b35b5e3 : U*4bb1980008 {
	struct UImage* SkillIconImage; // 0x458(0x08)
	struct UImage* SkillProgressBar_Image; // 0x460(0x08)
	struct UTextBlock* SkillCountText; // 0x468(0x08)
	struct UTextBlock* SkillIndexText; // 0x470(0x08)
	struct UBorder* SkillIcon_Border; // 0x478(0x08)
	struct UGridPanel* SkillCountGridPanel; // 0x480(0x08)
	struct U*400a0fbc3d* GamepadKeyIcon; // 0x488(0x08)
	struct FLinearColor SkillIconImage_ActivatedColor; // 0x490(0x10)
	struct FLinearColor SkillIconImage_DeactivatedColor; // 0x4a0(0x10)
	struct FLinearColor SkillIconBorder_ActivatedColor; // 0x4b0(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedColor; // 0x4c0(0x10)
	struct FLinearColor SkillIconBorder_ActivatedBrushColor; // 0x4d0(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedBrushColor; // 0x4e0(0x10)
	struct FSlateColor SkillCountText_ActivatedColor; // 0x4f0(0x28)
	struct FSlateColor SkillCountText_DeactivatedColor; // 0x518(0x28)
	char pad_540[0x30]; // 0x540(0x30)

	bool OnUpdateIconColor(); // Function TslGame.*8a0b35b5e3.OnUpdateIconColor // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*d999dcc544
// Size: 0x568 (Inherited: 0x458)
struct U*d999dcc544 : U*4bb1980008 {
	struct UImage* SkillIconImage; // 0x458(0x08)
	struct UImage* SkillProgressBar_Image; // 0x460(0x08)
	struct UTextBlock* SkillCountText; // 0x468(0x08)
	struct UTextBlock* SkillIndexText; // 0x470(0x08)
	struct UBorder* SkillIcon_Border; // 0x478(0x08)
	struct U*400a0fbc3d* GamepadKeyIcon; // 0x480(0x08)
	struct FLinearColor SkillIconImage_ActivatedColor; // 0x488(0x10)
	struct FLinearColor SkillIconImage_DeactivatedColor; // 0x498(0x10)
	struct FLinearColor SkillIconBorder_ActivatedColor; // 0x4a8(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedColor; // 0x4b8(0x10)
	struct FLinearColor SkillIconBorder_ActivatedBrushColor; // 0x4c8(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedBrushColor; // 0x4d8(0x10)
	struct FSlateColor SkillCountText_ActivatedColor; // 0x4e8(0x28)
	struct FSlateColor SkillCountText_DeactivatedColor; // 0x510(0x28)
	char pad_538[0x30]; // 0x538(0x30)

	bool OnUpdateIconColor(); // Function TslGame.*d999dcc544.OnUpdateIconColor // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*33e2e7dc66
// Size: 0x520 (Inherited: 0x418)
struct U*33e2e7dc66 : U*4bb82286ac {
	struct UHorizontalBox* IconHorizontalBox; // 0x418(0x08)
	struct USpacer* IconSpacer; // 0x420(0x08)
	struct U*bf0820de94* BuffIconDataAsset; // 0x428(0x08)
	struct FStringClassReference SpawnKitClass; // 0x430(0x10)
	struct TArray<struct U*4bb1980008*> *842f8c0afa; // 0x440(0x10)
	struct U*4bb1980008* *0c9a43c129; // 0x450(0x08)
	struct USpawnKit* SpawnKit; // 0x458(0x08)
	struct TArray<struct F*a514910062> *a514910062; // 0x460(0x10)
	struct F*7f9f9a678b *73190efc99; // 0x470(0x68)
	enum class EFBRClass *8a53f35920; // 0x4d8(0x01)
	char pad_4D9[0x7]; // 0x4d9(0x07)
	struct TArray<struct U*4bb82286ac*> *f78fe7f3b9; // 0x4e0(0x10)
	char pad_4F0[0x10]; // 0x4f0(0x10)
	bool bCollapseEmptyIconWidget; // 0x500(0x01)
	char pad_501[0x1f]; // 0x501(0x1f)

	bool OnWeaponUnArmed(); // Function TslGame.*33e2e7dc66.OnWeaponUnArmed // Final|Native|Protected // @ game+0x58f25e8
	struct FString OnSelectableSpawnKit(); // Function TslGame.*33e2e7dc66.OnSelectableSpawnKit // Final|Native|Protected // @ game+0x58ef7c8
	struct FName OnMatchStateChanged(); // Function TslGame.*33e2e7dc66.OnMatchStateChanged // Final|Native|Protected // @ game+0x58ecfa0
	int32 OnUpdateSpawnKit(); // Function TslGame.*33e2e7dc66.OnUpdateSpawnKit // Final|Native|Protected // @ game+0x58f19c8
	void OnWeaponArmed(); // Function TslGame.*33e2e7dc66.OnWeaponArmed // Final|Native|Protected // @ game+0x58f25c0
	struct AActor* OnUpdateViewTargetSpawnKit(); // Function TslGame.*33e2e7dc66.OnUpdateViewTargetSpawnKit // Final|Native|Protected // @ game+0x58f1c54
	struct AActor* OnUpdateViewTarget(); // Function TslGame.*33e2e7dc66.OnUpdateViewTarget // Final|Native|Protected // @ game+0x58f1a94
};

// Class TslGame.TslWeapon
// Size: 0xa70 (Inherited: 0x3f8)
struct ATslWeapon : AActor {
	char pad_3F8[0x38]; // 0x3f8(0x38)
	struct UTexture* WeaponIcon; // 0x430(0x08)
	float WeaponIconRatio; // 0x438(0x04)
	int32 LogWeaponFirePerFireCount; // 0x43c(0x04)
	struct TArray<struct FName> *5e7e0a5eb8; // 0x440(0x10)
	struct TArray<struct F*3626b7c685> *7611a505c4; // 0x450(0x10)
	bool *a5bd6bd2bf; // 0x460(0x01)
	char pad_461[0x27]; // 0x461(0x27)
	struct FMulticastDelegate OnUpdatedAttachment; // 0x488(0x10)
	struct FMulticastDelegate OnUpdatedSkinData; // 0x498(0x10)
	struct FMulticastDelegate OnUpdatedMasteryItem; // 0x4a8(0x10)
	struct FMulticastDelegate OnUpdatedAttachmentOnServer; // 0x4b8(0x10)
	struct FMulticastDelegate OnUpdatedCharacterEvent; // 0x4c8(0x10)
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct F*a4d1f576dd WeaponConfig; // 0x4e0(0x2b0)
	enum class EWeaponHand *fbd84be964; // 0x790(0x01)
	char pad_791[0x7]; // 0x791(0x07)
	struct TArray<enum class EWeaponClass> *0ae03b1185; // 0x798(0x10)
	bool *6659ce349a; // 0x7a8(0x01)
	bool *633f7d183f; // 0x7a9(0x01)
	char pad_7AA[0x6]; // 0x7aa(0x06)
	struct U*b389c20ca0* *29a2bd251a; // 0x7b0(0x08)
	struct USceneComponent* RootScene; // 0x7b8(0x08)
	int8 *2c783cbe08; // 0x7c0(0x01)
	char pad_7C1[0x1]; // 0x7c1(0x01)
	enum class EAttachmentCalculateType *db4d3076e9; // 0x7c2(0x01)
	char pad_7C3[0x5]; // 0x7c3(0x05)
	struct TArray<struct F*d161af1057> *c8917e63a9; // 0x7c8(0x10)
	struct TArray<struct F*ffb09d99ff> *3c89109d12; // 0x7d8(0x10)
	struct TArray<int32> *b794003a53; // 0x7e8(0x10)
	struct TArray<struct U*95bb1b4186*> *89fb84dd22; // 0x7f8(0x10)
	struct FName *46b0d686e3; // 0x808(0x08)
	int32 *f2b252fb59; // 0x810(0x04)
	char pad_814[0x4]; // 0x814(0x04)
	struct FText ItemName; // 0x818(0x18)
	enum class EAccessorySlot *dfc42c892a; // 0x830(0x01)
	enum class EAllowedThrowMode *023d668f20; // 0x831(0x01)
	char pad_832[0x6]; // 0x832(0x06)
	struct UAkComponent* AkComponent; // 0x838(0x08)
	char pad_840[0x8]; // 0x840(0x08)
	struct FName *d4ce15638a; // 0x848(0x08)
	struct FName *64d41113df; // 0x850(0x08)
	struct UParticleSystem* *322a7b7ae0; // 0x858(0x08)
	struct FName *f377b909d0; // 0x860(0x08)
	struct UClass* *e459d9204e; // 0x868(0x08)
	struct UParticleSystemComponent* *7f2993a66f; // 0x870(0x08)
	struct UParticleSystemComponent* *783215796c; // 0x878(0x08)
	struct UForceFeedbackEffect* *03cf88d097; // 0x880(0x08)
	enum class EAnimWeaponType *20bec18e3d; // 0x888(0x01)
	char pad_889[0x7]; // 0x889(0x07)
	struct F*3f997e2928 *bf37a5acec; // 0x890(0x18)
	struct F*824f8a65a1 *ebd18f5a8e; // 0x8a8(0x10)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *d4717afcd8; // 0x8b8(0x50)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *fe61af1a0b; // 0x908(0x50)
	float *02fb724e71; // 0x958(0x04)
	bool *e9d4ece3e6; // 0x95c(0x01)
	char pad_95D[0x3]; // 0x95d(0x03)
	char *23e69c3e0f : 1; // 0x960(0x01)
	char pad_960_1 : 7; // 0x960(0x01)
	char pad_961[0x2f]; // 0x961(0x2f)
	bool *5e83edba55; // 0x990(0x01)
	bool *dbbc291d15; // 0x991(0x01)
	bool *fb13faba9c; // 0x992(0x01)
	char pad_993[0x1d]; // 0x993(0x1d)
	struct F*5df1f08743 *5df1f08743; // 0x9b0(0x20)
	struct F*b63a766ace *b63a766ace; // 0x9d0(0x04)
	struct F*b63a766ace *b9ca6c8f19; // 0x9d4(0x04)
	struct FName WeaponMeshName; // 0x9d8(0x08)
	struct U*803e2f2033* *803e2f2033; // 0x9e0(0x08)
	char pad_9E8[0x18]; // 0x9e8(0x18)
	struct UMeshComponent* *e5ca8e2e02; // 0xa00(0x08)
	bool *69e8cd41ce; // 0xa08(0x01)
	char pad_A09[0x67]; // 0xa09(0x67)

	struct FText *af607d7cee(); // Function TslGame.TslWeapon.*af607d7cee // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59292c0
	void OnRep_ReplicatedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedMasteryItem // Final|Native|Private // @ game+0x5930444
	struct TArray<struct F*ffb09d99ff> *0323e8d669(); // Function TslGame.TslWeapon.*0323e8d669 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5927690
	struct FVector *d9c278a4be(); // Function TslGame.TslWeapon.*d9c278a4be // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5929858
	struct TArray<struct FWeaponAttachmentData> *4430ec58e7(); // Function TslGame.TslWeapon.*4430ec58e7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59276e4
	bool *9c61ccf357(); // Function TslGame.TslWeapon.*9c61ccf357 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x4ef65c
	enum class EAnimWeaponType *7c96fc9ffc(); // Function TslGame.TslWeapon.*7c96fc9ffc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59278b8
	void *00384018b4(); // Function TslGame.TslWeapon.*00384018b4 // Final|Native|Public|BlueprintCallable // @ game+0x5936ca4
	float *087163f7f1(); // Function TslGame.TslWeapon.*087163f7f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c24c
	float *543c9488c5(); // Function TslGame.TslWeapon.*543c9488c5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592aff0
	float *d0d6a4edfa(); // Function TslGame.TslWeapon.*d0d6a4edfa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c430
	void *c6aef8ed19(); // Function TslGame.TslWeapon.*c6aef8ed19 // Final|Native|Private // @ game+0x5936a78
	struct FName *d902597127(); // Function TslGame.TslWeapon.*d902597127 // Final|Native|Public|Const // @ game+0x592c32c
	enum class EWeaponClass *af7e0bae99(); // Function TslGame.TslWeapon.*af7e0bae99 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592beb8
	struct F*ffb09d99ff *559a433a8b(); // Function TslGame.TslWeapon.*559a433a8b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592bef8
	bool *30704ecf02(); // Function TslGame.TslWeapon.*30704ecf02 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5928acc
	enum class EWeaponArmState *57fca8fe18(); // Function TslGame.TslWeapon.*57fca8fe18 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb9d99c
	struct FAttackId *6c87a740d3(); // Function TslGame.TslWeapon.*6c87a740d3 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5932acc
	struct TArray<struct F*ffb09d99ff> *3810b6d7b4(); // Function TslGame.TslWeapon.*3810b6d7b4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592bfcc
	struct FName *6b7535889c(); // Function TslGame.TslWeapon.*6b7535889c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c0cc
	struct TMap<enum class EWeaponAttachmentSlotID, struct UAsyncStaticMeshComponent*> *ad88fd3b0c(); // Function TslGame.TslWeapon.*ad88fd3b0c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5927cc8
	enum class *7db39c4871 *5db0d08de3(); // Function TslGame.TslWeapon.*5db0d08de3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c264
	struct UEquipableItem* *4b8d243e51(); // Function TslGame.TslWeapon.*4b8d243e51 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c308
	enum class EThrownWeaponType *9a016f028a(); // Function TslGame.TslWeapon.*9a016f028a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592b19c
	bool *cf97adb712(); // Function TslGame.TslWeapon.*cf97adb712 // Final|Native|Public|BlueprintCallable // @ game+0x59368ac
	float *47d2f13727(); // Function TslGame.TslWeapon.*47d2f13727 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5929b2c
	void OnRep_ReplicatedSkinParam(); // Function TslGame.TslWeapon.OnRep_ReplicatedSkinParam // Final|Native|Private // @ game+0x59304c4
	struct UAnimMontage* *39f7e1aaba(); // Function TslGame.TslWeapon.*39f7e1aaba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592a724
	struct ATslCharacter* *2d3b0c617b(); // Function TslGame.TslWeapon.*2d3b0c617b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc67078
	enum class EWeaponClass *d93479b4a0(); // Function TslGame.TslWeapon.*d93479b4a0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c218
	struct FWeaponAttachmentData *0576b2c0ca(); // Function TslGame.TslWeapon.*0576b2c0ca // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c024
	bool *a86bae69cb(); // Function TslGame.TslWeapon.*a86bae69cb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592eb44
	bool *5db981c587(); // Function TslGame.TslWeapon.*5db981c587 // Native|Public|BlueprintCallable // @ game+0x5934a84
	struct TArray<int32> OnRep_AttachedItemIndexes(); // Function TslGame.TslWeapon.OnRep_AttachedItemIndexes // Final|Native|Protected|HasOutParms // @ game+0x7fb950
	struct FVector *b50cede0e0(); // Function TslGame.TslWeapon.*b50cede0e0 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x59244e0
	float *a0bb37d999(); // Function TslGame.TslWeapon.*a0bb37d999 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5907974
	float *9379d05c6f(); // Function TslGame.TslWeapon.*9379d05c6f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c2f0
	float *1685ed1daa(); // Function TslGame.TslWeapon.*1685ed1daa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592bee0
	void Weapon_AttachShoulder(); // Function TslGame.TslWeapon.Weapon_AttachShoulder // Final|Native|Public|BlueprintCallable // @ game+0x5936cb8
	int32 *6f5516e6d0(); // Function TslGame.TslWeapon.*6f5516e6d0 // Final|Native|Public|BlueprintCallable // @ game+0x5927cb0
	float *e5f8ca3db8(); // Function TslGame.TslWeapon.*e5f8ca3db8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5929b14
	struct F*a4d1f576dd *722be5550a(); // Function TslGame.TslWeapon.*722be5550a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c230
	struct FVector *c8586ff147(); // Function TslGame.TslWeapon.*c8586ff147 // Final|Native|Protected|HasOutParms|HasDefaults // @ game+0x5935218
	struct FVector *c14de3e50e(); // Function TslGame.TslWeapon.*c14de3e50e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x592b0c0
	struct FName *803bb20271(); // Function TslGame.TslWeapon.*803bb20271 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x592fc28
	struct TArray<struct F*ffb09d99ff> OnLoadedAttachmentAssetDatas(); // Function TslGame.TslWeapon.OnLoadedAttachmentAssetDatas // Native|Public|HasOutParms // @ game+0x4f5f78
	void OnAttachmentChanged(); // Function TslGame.TslWeapon.OnAttachmentChanged // Final|Native|Public // @ game+0x592fd14
	struct FName *04c42888e7(); // Function TslGame.TslWeapon.*04c42888e7 // Final|Native|Public|Const // @ game+0x59076e0
	void OnRep_ItemIndex(); // Function TslGame.TslWeapon.OnRep_ItemIndex // Final|Native|Protected // @ game+0x8bdd58
	struct U*b389c20ca0* GetWeaponMesh(); // Function TslGame.TslWeapon.GetWeaponMesh // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x592c344
	struct FVector *6cef1f6e64(); // Function TslGame.TslWeapon.*6cef1f6e64 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x5924584
	void OnRep_ReplicatedAssignedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedAssignedMasteryItem // Final|Native|Private // @ game+0xbdd69c
	float *cde32c3b5a(); // Function TslGame.TslWeapon.*cde32c3b5a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5929b44
};

// Class TslGame.TslWeapon_Gun
// Size: 0xf80 (Inherited: 0xa70)
struct ATslWeapon_Gun : ATslWeapon {
	bool *fdd220be5b; // 0xa68(0x01)
	enum class EWeaponState CurrentState; // 0xa69(0x01)
	int32 *644f3c2a7c; // 0xa6c(0x04)
	int32 *c5ac3ebc8e; // 0xa70(0x04)
	int32 *9309b43aca; // 0xa74(0x04)
	int32 *379d8611fc; // 0xa78(0x04)
	char *d0d6c5c740 : 1; // 0xa7c(0x01)
	char *38b3fa4bb3 : 1; // 0xa7c(0x01)
	char *770428f79c : 1; // 0xa7c(0x01)
	char pad_A82_3 : 5; // 0xa82(0x01)
	char pad_A83[0x29]; // 0xa83(0x29)
	int32 *249e0d3963; // 0xaac(0x04)
	char pad_AB0[0x78]; // 0xab0(0x78)
	struct F*2ef3a887d0 *321dab0975; // 0xb28(0x08)
	char pad_B30[0x58]; // 0xb30(0x58)
	struct F*7a1322e5ac *4f99bd5979; // 0xb88(0xa8)
	struct U*7a7b9ffde9* *7a7b9ffde9; // 0xc30(0x08)
	struct F*c6ee9e4aff *08b808ede5; // 0xc38(0x20)
	struct FName ScopingAttachPoint; // 0xc58(0x08)
	struct FName *9c27d3552d; // 0xc60(0x08)
	struct FName *93d763da48; // 0xc68(0x08)
	char pad_C70[0x210]; // 0xc70(0x210)
	int32 GripTypeIndexOverride; // 0xe80(0x04)
	char pad_E84[0x14]; // 0xe84(0x14)
	float *e1ec4970d1; // 0xe98(0x04)
	char pad_E9C[0xc]; // 0xe9c(0x0c)
	struct U*388bbf1f6b* WeaponGunData; // 0xea8(0x08)
	char pad_EB0[0x20]; // 0xeb0(0x20)
	struct UAkAudioEvent* *f9534ff492; // 0xed0(0x08)
	struct F*15e0dc8019 *15e0dc8019; // 0xed8(0x28)
	struct UStaticMeshComponent* *cf04ef269b; // 0xf00(0x08)
	struct FName *a938b5dd3c; // 0xf08(0x08)
	struct U*c01a41c06c* *af1c9670d7; // 0xf10(0x08)
	char pad_F18[0x4]; // 0xf18(0x04)
	struct FVector ShootTargetLoc; // 0xf1c(0x0c)
	char pad_F28[0x58]; // 0xf28(0x58)

	int32 *a4d035b70e(); // Function TslGame.TslWeapon_Gun.*a4d035b70e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594aa60
	void OnRep_FiringModeIndex(); // Function TslGame.TslWeapon_Gun.OnRep_FiringModeIndex // Final|Native|Public // @ game+0x563260
	void *478121bea0(); // Function TslGame.TslWeapon_Gun.*478121bea0 // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x81db2c
	bool *448bb0a076(); // Function TslGame.TslWeapon_Gun.*448bb0a076 // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x5963dec
	struct U*c01a41c06c* *62668017ca(); // Function TslGame.TslWeapon_Gun.*62668017ca // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5949fe4
	float *ebc7c83c75(); // Function TslGame.TslWeapon_Gun.*ebc7c83c75 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594b458
	void *04ff2b6b1f(); // Function TslGame.TslWeapon_Gun.*04ff2b6b1f // Net|Native|Event|NetMulticast|Protected // @ game+0x76d63c
	int32 *d6b1566980(); // Function TslGame.TslWeapon_Gun.*d6b1566980 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949c18
	int32 *f8f1b48421(); // Function TslGame.TslWeapon_Gun.*f8f1b48421 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949bf4
	int32 OnRep_AmmoCount(); // Function TslGame.TslWeapon_Gun.OnRep_AmmoCount // Final|Native|Protected // @ game+0xb4208c
	bool *0b9618c6f3(); // Function TslGame.TslWeapon_Gun.*0b9618c6f3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594e7cc
	struct UAnimMontage* *f51708f5c5(); // Function TslGame.TslWeapon_Gun.*f51708f5c5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594dc84
	float *d41a7494b9(); // Function TslGame.TslWeapon_Gun.*d41a7494b9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d60c
	int32 *f2bfa57e02(); // Function TslGame.TslWeapon_Gun.*f2bfa57e02 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcd5420
	void *35912357f3(); // Function TslGame.TslWeapon_Gun.*35912357f3 // Final|Native|Protected // @ game+0x59562d0
	struct UAnimMontage* *ae590e08ec(); // Function TslGame.TslWeapon_Gun.*ae590e08ec // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59495d4
	enum class EWeaponReloadAnimExec *ef24d0cef9(); // Function TslGame.TslWeapon_Gun.*ef24d0cef9 // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0x93ad60
	struct FVector *a6b0e97b53(); // Function TslGame.TslWeapon_Gun.*a6b0e97b53 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594b2f4
	struct TArray<struct F*59be4d852f> *37860bd42c(); // Function TslGame.TslWeapon_Gun.*37860bd42c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949188
	bool *12ddd40cfb(); // Function TslGame.TslWeapon_Gun.*12ddd40cfb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5950688
	struct F*7a1322e5ac *b6c6a1d266(); // Function TslGame.TslWeapon_Gun.*b6c6a1d266 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594daa8
	bool *ebe7488123(); // Function TslGame.TslWeapon_Gun.*ebe7488123 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc11c78
	struct UAnimMontage* *04bb25ce0b(); // Function TslGame.TslWeapon_Gun.*04bb25ce0b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc4623c
	void *503fb3a4f3(); // Function TslGame.TslWeapon_Gun.*503fb3a4f3 // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0x939440
	float *c66bda480c(); // Function TslGame.TslWeapon_Gun.*c66bda480c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc1c390
	struct USkeletalMeshComponent* *fe47ca18fb(); // Function TslGame.TslWeapon_Gun.*fe47ca18fb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c60c
	struct FVector *ca12555311(); // Function TslGame.TslWeapon_Gun.*ca12555311 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594c480
	bool *530926d59f(); // Function TslGame.TslWeapon_Gun.*530926d59f // Final|Native|Public|BlueprintCallable // @ game+0x5967aa0
	struct UAnimMontage* *f0b5e5e872(); // Function TslGame.TslWeapon_Gun.*f0b5e5e872 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbd9b0c
	struct UAnimMontage* *01811342ca(); // Function TslGame.TslWeapon_Gun.*01811342ca // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb650f4
	int32 *043bf5a063(); // Function TslGame.TslWeapon_Gun.*043bf5a063 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x7c0f7c
	bool *0082c27274(); // Function TslGame.TslWeapon_Gun.*0082c27274 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59506a8
	float *465a955b77(); // Function TslGame.TslWeapon_Gun.*465a955b77 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949c40
	float *e60651930f(); // Function TslGame.TslWeapon_Gun.*e60651930f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5948b84
	bool *808c0f4851(); // Function TslGame.TslWeapon_Gun.*808c0f4851 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5950688
	enum class EFiringMode *86d1537ec8(); // Function TslGame.TslWeapon_Gun.*86d1537ec8 // Final|Native|Public|BlueprintCallable // @ game+0x59667ac
	float *23b9bbe082(); // Function TslGame.TslWeapon_Gun.*23b9bbe082 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c088
	int32 *cb1df55c7c(); // Function TslGame.TslWeapon_Gun.*cb1df55c7c // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x595e440
	struct UAnimMontage* *da73331d10(); // Function TslGame.TslWeapon_Gun.*da73331d10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949730
	void *fe1b7448b1(); // Function TslGame.TslWeapon_Gun.*fe1b7448b1 // Net|NetReliableNative|Event|NetMulticast|Protected|NetClient|NetValidate // @ game+0x5942474
	void *5a88206172(); // Function TslGame.TslWeapon_Gun.*5a88206172 // Final|Native|Public|BlueprintCallable // @ game+0x593e6c4
	bool *dc759143fd(); // Function TslGame.TslWeapon_Gun.*dc759143fd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xda4058
	void *7692861ffe(); // Function TslGame.TslWeapon_Gun.*7692861ffe // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5964b9c
	bool *93a2854a0f(); // Function TslGame.TslWeapon_Gun.*93a2854a0f // Net|NetReliableNative|Event|Protected|NetClient // @ game+0xc1242c
	struct F*7a1322e5ac *d4ba222256(); // Function TslGame.TslWeapon_Gun.*d4ba222256 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d998
	void *fabb5fb4ac(); // Function TslGame.TslWeapon_Gun.*fabb5fb4ac // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0x93941c
	struct UBlendSpaceBase* *7a95805c95(); // Function TslGame.TslWeapon_Gun.*7a95805c95 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949634
	enum class EWeaponReloadCancelReason *2a5a8565e9(); // Function TslGame.TslWeapon_Gun.*2a5a8565e9 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x5958440
	struct UAnimMontage* *14bb6cba23(); // Function TslGame.TslWeapon_Gun.*14bb6cba23 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd67a10
	struct FVector *30c45f4f4d(); // Function TslGame.TslWeapon_Gun.*30c45f4f4d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594b2c8
	struct TArray<enum class EFiringMode> *c0e122b191(); // Function TslGame.TslWeapon_Gun.*c0e122b191 // Final|Native|Public|BlueprintCallable // @ game+0x594a88c
	int32 *635c3d39c3(); // Function TslGame.TslWeapon_Gun.*635c3d39c3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594b3b4
	void *62e395a17c(); // Function TslGame.TslWeapon_Gun.*62e395a17c // Final|Native|Public|BlueprintCallable // @ game+0x593e6d8
	void *501897210f(); // Function TslGame.TslWeapon_Gun.*501897210f // Final|Native|Public // @ game+0x593e794
	void OnGameUserSettingApplied(); // Function TslGame.TslWeapon_Gun.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x5952c3c
	int32 *fcc11ce421(); // Function TslGame.TslWeapon_Gun.*fcc11ce421 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x595e5a0
	void *668cb4ba61(); // Function TslGame.TslWeapon_Gun.*668cb4ba61 // Final|Native|Public|BlueprintCallable // @ game+0x593e6b0
	struct FName *43f1607768(); // Function TslGame.TslWeapon_Gun.*43f1607768 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5948f8c
	uint16 *598e188aa1(); // Function TslGame.TslWeapon_Gun.*598e188aa1 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x595fcd4
	enum class EScopeType *84521dddcd(); // Function TslGame.TslWeapon_Gun.*84521dddcd // Final|Native|Protected // @ game+0x593e098
	int32 *9a06316fee(); // Function TslGame.TslWeapon_Gun.*9a06316fee // Final|Native|Protected // @ game+0x5969d78
	void OnAttachmentMainScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentMainScopeLoaded // Final|Native|Protected // @ game+0xdae578
	void *5bbeede174(); // Function TslGame.TslWeapon_Gun.*5bbeede174 // Native|Protected // @ game+0x5907c1c
	struct FName *803bb20271(); // Function TslGame.TslWeapon_Gun.*803bb20271 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x592fc28
	void *4f56f1c900(); // Function TslGame.TslWeapon_Gun.*4f56f1c900 // Final|Native|Public|BlueprintCallable // @ game+0x593e69c
	float *bdedd854b7(); // Function TslGame.TslWeapon_Gun.*bdedd854b7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x93b384
	void *d3ce3f257a(); // Function TslGame.TslWeapon_Gun.*d3ce3f257a // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x595fbb4
	struct TArray<bool> *f929637f9c(); // Function TslGame.TslWeapon_Gun.*f929637f9c // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x596343c
	bool *31dc83f09f(); // Function TslGame.TslWeapon_Gun.*31dc83f09f // Final|Native|Protected // @ game+0x5956448
	void *3abf996122(); // Function TslGame.TslWeapon_Gun.*3abf996122 // Final|Native|Public|BlueprintCallable // @ game+0x593e6ec
	int32 *b282663583(); // Function TslGame.TslWeapon_Gun.*b282663583 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594907c
	void OnAttachmentAngledScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentAngledScopeLoaded // Final|Native|Protected // @ game+0x595207c
	struct FVector *5d0a67f930(); // Function TslGame.TslWeapon_Gun.*5d0a67f930 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594d698
	struct UAnimMontage* *b8a10d5dc3(); // Function TslGame.TslWeapon_Gun.*b8a10d5dc3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59495f4
	void *640892c767(); // Function TslGame.TslWeapon_Gun.*640892c767 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59600c8
	void *5e4ae60203(); // Function TslGame.TslWeapon_Gun.*5e4ae60203 // Native|Protected // @ game+0x590dfc8
	enum class EFiringMode *32020e24e3(); // Function TslGame.TslWeapon_Gun.*32020e24e3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xce5ae8
	void *e36790f3d3(); // Function TslGame.TslWeapon_Gun.*e36790f3d3 // Final|Native|Public // @ game+0x593fea8
	float *5018f5015e(); // Function TslGame.TslWeapon_Gun.*5018f5015e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c0a8
	void OnInventoryUpdated(); // Function TslGame.TslWeapon_Gun.OnInventoryUpdated // Final|Native|Protected // @ game+0xda0224
	enum class EWeaponReloadCancelReason *f55bde4359(); // Function TslGame.TslWeapon_Gun.*f55bde4359 // Final|Native|Public // @ game+0x593f45c
	void *a3d9eefce8(); // Function TslGame.TslWeapon_Gun.*a3d9eefce8 // Final|Native|Public|BlueprintCallable // @ game+0xd6d94c
	bool IsReloading(); // Function TslGame.TslWeapon_Gun.IsReloading // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594fd78
	void *5dda016523(); // Function TslGame.TslWeapon_Gun.*5dda016523 // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0xbf96c0
	enum class EFiringMode *9daa200e98(); // Function TslGame.TslWeapon_Gun.*9daa200e98 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x9a2c38
	bool *4d05e0bb2f(); // Function TslGame.TslWeapon_Gun.*4d05e0bb2f // Final|Native|Public|BlueprintCallable // @ game+0x5967310
	bool *967939a145(); // Function TslGame.TslWeapon_Gun.*967939a145 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x595e724
	void *7aeb279293(); // Function TslGame.TslWeapon_Gun.*7aeb279293 // Net|Native|Event|NetMulticast|Protected // @ game+0x93a5e4
	struct UAnimMontage* *18982a10f2(); // Function TslGame.TslWeapon_Gun.*18982a10f2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcb6b10
	struct FVector *5eb7b861a9(); // Function TslGame.TslWeapon_Gun.*5eb7b861a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594d66c
	int32 OnRep_CurrentCantedZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentCantedZeroLevel // Final|Native|Protected // @ game+0x5954270
	bool *d4468757d8(); // Function TslGame.TslWeapon_Gun.*d4468757d8 // Final|Native|Public // @ game+0x593fd98
	struct UAnimMontage* *77d8852fbc(); // Function TslGame.TslWeapon_Gun.*77d8852fbc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc84880
	int32 OnRep_CurrentZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentZeroLevel // Final|Native|Protected // @ game+0x5954314
	struct FWeaponAttachmentData *c48ec99cdb(); // Function TslGame.TslWeapon_Gun.*c48ec99cdb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d52c
	struct UAnimMontage* *15cce017ff(); // Function TslGame.TslWeapon_Gun.*15cce017ff // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949710
	int32 *ca4aa1eefd(); // Function TslGame.TslWeapon_Gun.*ca4aa1eefd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949e60
	enum class EScopeType *ec6bb9421d(); // Function TslGame.TslWeapon_Gun.*ec6bb9421d // Final|Native|Protected // @ game+0x593e098
	enum class EWeaponReloadCancelReason *686e5fd66f(); // Function TslGame.TslWeapon_Gun.*686e5fd66f // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0x93939c
	enum class EWeaponClass *d4fda3c382(); // Function TslGame.TslWeapon_Gun.*d4fda3c382 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594b208
	struct UAnimMontage* *b9b8f61dac(); // Function TslGame.TslWeapon_Gun.*b9b8f61dac // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59495b0
	struct F*ac88811cc8 *fc66b873c2(); // Function TslGame.TslWeapon_Gun.*fc66b873c2 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5959694
	float *1b65ac6739(); // Function TslGame.TslWeapon_Gun.*1b65ac6739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d5dc
	struct FVector *9dfa44dcae(); // Function TslGame.TslWeapon_Gun.*9dfa44dcae // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594d4f8
	float *53b5c3e9c5(); // Function TslGame.TslWeapon_Gun.*53b5c3e9c5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594b478
	float *51c73b2f72(); // Function TslGame.TslWeapon_Gun.*51c73b2f72 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d5f4
	void *efdb1fc196(); // Function TslGame.TslWeapon_Gun.*efdb1fc196 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x593eee8
	void *ad5986c5d1(); // Function TslGame.TslWeapon_Gun.*ad5986c5d1 // Final|Native|Protected // @ game+0x59562f0
	float *7dc169a0cd(); // Function TslGame.TslWeapon_Gun.*7dc169a0cd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d634
	struct UBlendSpace1D* *e95341ec63(); // Function TslGame.TslWeapon_Gun.*e95341ec63 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949614
};

// Class TslGame.TslWeapon_Trajectory
// Size: 0x1080 (Inherited: 0xf80)
struct ATslWeapon_Trajectory : ATslWeapon_Gun {
	struct FMulticastDelegate OnWeaponRecoil; // 0xf60(0x10)
	struct FName *9ed922e5aa; // 0xf70(0x08)
	struct UParticleSystem* *da32db4b42; // 0xf78(0x08)
	float TrajectoryGravityZ; // 0xf9c(0x04)
	char pad_FA4[0x15]; // 0xfa4(0x15)
	bool *cacfecc15a; // 0xfb9(0x01)
	char pad_FBA[0x6]; // 0xfba(0x06)
	struct UClass* *220ee606ae; // 0xfc0(0x08)
	struct UClass* *2a8465bfef; // 0xfc8(0x08)
	struct TMap<float, struct UClass*> *d027e00feb; // 0xfd0(0x50)
	char pad_1020[0x10]; // 0x1020(0x10)
	float *d6b6bf7e4a; // 0x1030(0x04)
	char pad_1034[0x4]; // 0x1034(0x04)
	struct UWeaponTrajectoryData* WeaponTrajectoryData; // 0x1038(0x08)
	char pad_1040[0x40]; // 0x1040(0x40)

	float *8ed81e2211(); // Function TslGame.TslWeapon_Trajectory.*8ed81e2211 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x597a018
	float *543c9488c5(); // Function TslGame.TslWeapon_Trajectory.*543c9488c5 // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x592aff0
	struct FVector *e8dba45f36(); // Function TslGame.TslWeapon_Trajectory.*e8dba45f36 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x598c600
	float *519ad89da6(); // Function TslGame.TslWeapon_Trajectory.*519ad89da6 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x598c6e4
	float OnRep_WeaponSpread(); // Function TslGame.TslWeapon_Trajectory.OnRep_WeaponSpread // Final|Native|Protected // @ game+0xda2c34
	bool *fa2428d214(); // Function TslGame.TslWeapon_Trajectory.*fa2428d214 // Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x5983c80
	struct F*83215e03d0 *2e97c608d8(); // Function TslGame.TslWeapon_Trajectory.*2e97c608d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x597c34c
	struct FVector *da23286fad(); // Function TslGame.TslWeapon_Trajectory.*da23286fad // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x5986994
	struct FVector *8780c893fd(); // Function TslGame.TslWeapon_Trajectory.*8780c893fd // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x59860a4
	struct AActor* *719810178c(); // Function TslGame.TslWeapon_Trajectory.*719810178c // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x5985270
	bool *863609e119(); // Function TslGame.TslWeapon_Trajectory.*863609e119 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xa85bb0
	struct FVector *ea6ab9daa9(); // Function TslGame.TslWeapon_Trajectory.*ea6ab9daa9 // Net|NetReliableNative|Event|Protected|HasDefaults|NetClient|Const // @ game+0x5977bac
	float *21387c75e3(); // Function TslGame.TslWeapon_Trajectory.*21387c75e3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d5f4
	struct FAttackId *f05fb0a57b(); // Function TslGame.TslWeapon_Trajectory.*f05fb0a57b // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x598c820
	struct ATslCharacter* *645227d558(); // Function TslGame.TslWeapon_Trajectory.*645227d558 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x59853e4
	bool *0d1deb946f(); // Function TslGame.TslWeapon_Trajectory.*0d1deb946f // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0xbbbbe4
	struct ATslPlayerState* *6f942f65f0(); // Function TslGame.TslWeapon_Trajectory.*6f942f65f0 // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x5977a00
	int32 *7f796a7aed(); // Function TslGame.TslWeapon_Trajectory.*7f796a7aed // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5985f98
	float *3b2e254f77(); // Function TslGame.TslWeapon_Trajectory.*3b2e254f77 // Net|Native|Event|Protected|NetServer|NetValidate // @ game+0x5983b0c
	bool *b1225afff9(); // Function TslGame.TslWeapon_Trajectory.*b1225afff9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x597deec
	struct FVector2D *151ae6b0b3(); // Function TslGame.TslWeapon_Trajectory.*151ae6b0b3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5979ff0
	struct F*92441717b3 *91686ae310(); // Function TslGame.TslWeapon_Trajectory.*91686ae310 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x597c314
	float *e2cf38fe0c(); // Function TslGame.TslWeapon_Trajectory.*e2cf38fe0c // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x598380c
	struct FRotator *5bcb481f5e(); // Function TslGame.TslWeapon_Trajectory.*5bcb481f5e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5979920
	int32 *50f5e1cc98(); // Function TslGame.TslWeapon_Trajectory.*50f5e1cc98 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x597c334
	float *bfb59881b8(); // Function TslGame.TslWeapon_Trajectory.*bfb59881b8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x597a05c
	struct FAttackId *a534a0a1d9(); // Function TslGame.TslWeapon_Trajectory.*a534a0a1d9 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x59839b4
	struct FVector *e049f0f08d(); // Function TslGame.TslWeapon_Trajectory.*e049f0f08d // Final|Native|Private|HasDefaults // @ game+0x5982aec
	struct FVector *51a4c4a58a(); // Function TslGame.TslWeapon_Trajectory.*51a4c4a58a // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x5985ce8
	struct FVector *3a8533bdaf(); // Function TslGame.TslWeapon_Trajectory.*3a8533bdaf // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x597a298
	bool *689292ea86(); // Function TslGame.TslWeapon_Trajectory.*689292ea86 // Net|Native|Event|NetMulticast|Protected|HasDefaults // @ game+0x749018
	struct FVector *b2d1829b71(); // Function TslGame.TslWeapon_Trajectory.*b2d1829b71 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x59798ec
};

// Class TslGame.TslFBRWeapon_GatlingGun
// Size: 0x1100 (Inherited: 0x1080)
struct ATslFBRWeapon_GatlingGun : ATslWeapon_Trajectory {
	char pad_1080[0x40]; // 0x1080(0x40)
	float *8e8beb728e; // 0x10c0(0x04)
	float *9efd00caa3; // 0x10c4(0x04)
	enum class EHeatState *f9e12db338; // 0x10c8(0x01)
	char pad_10C9[0x37]; // 0x10c9(0x37)

	enum class EHeatState *b9437847d0(); // Function TslGame.TslFBRWeapon_GatlingGun.*b9437847d0 // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x58e370c
	enum class EHeatState OnRep_HeatState(); // Function TslGame.TslFBRWeapon_GatlingGun.OnRep_HeatState // Final|Native|Protected // @ game+0x58eeda4
};

// Class TslGame.*ca5ce2a886
// Size: 0x458 (Inherited: 0x418)
struct U*ca5ce2a886 : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct UImage* GatlingGauge_Image; // 0x420(0x08)
	struct UMaterialInstanceDynamic* *f938ce3a2f; // 0x428(0x08)
	char pad_430[0x28]; // 0x430(0x28)

	enum class EHeatState *af59a49027(); // Function TslGame.*ca5ce2a886.*af59a49027 // Final|Native|Protected // @ game+0x58eb2a0
};

// Class TslGame.*e9b2d456ed
// Size: 0x440 (Inherited: 0x418)
struct U*e9b2d456ed : U*4bb82286ac {
	struct UTextBlock* MVP_PlayerName_Text; // 0x418(0x08)
	struct UWidgetSwitcher* Result_Switcher; // 0x420(0x08)
	struct U*9c8bfa0aee* Anim_End; // 0x428(0x08)
	char pad_430[0x10]; // 0x430(0x10)
};

// Class TslGame.*3905f35786
// Size: 0x430 (Inherited: 0x418)
struct U*3905f35786 : U*4bb82286ac {
	struct UTextBlock* PlayerName_Text; // 0x418(0x08)
	struct U*9c8bfa0aee* Anim_GoalNotify; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*42435f926a
// Size: 0x498 (Inherited: 0x418)
struct U*42435f926a : U*4bb82286ac {
	struct UTextBlock* HomeGoalCount_Text; // 0x418(0x08)
	struct UTextBlock* AwayGoalCount_Text; // 0x420(0x08)
	struct UTextBlock* Home_Text; // 0x428(0x08)
	struct UTextBlock* Away_Text; // 0x430(0x08)
	struct UImage* HomeBar_Image; // 0x438(0x08)
	struct UImage* AwayBar_Image; // 0x440(0x08)
	struct FLinearColor *69e277baa5; // 0x448(0x10)
	struct FLinearColor *9d891fbea4; // 0x458(0x10)
	struct FText *fd201707f1; // 0x468(0x18)
	struct FText *9e68e31296; // 0x480(0x18)
};

// Class TslGame.*f3692725df
// Size: 0x430 (Inherited: 0x418)
struct U*f3692725df : U*4bb82286ac {
	struct UWidgetSwitcher* Round_Switcher; // 0x418(0x08)
	struct UTextBlock* Min_Text; // 0x420(0x08)
	struct UTextBlock* Sec_Text; // 0x428(0x08)
};

// Class TslGame.*0ea245cee2
// Size: 0x430 (Inherited: 0x418)
struct U*0ea245cee2 : U*4bb82286ac {
	struct U*f3692725df* TimeInfo; // 0x418(0x08)
	struct U*42435f926a* Score; // 0x420(0x08)
	struct U*3905f35786* GoalNotify; // 0x428(0x08)

	int32 NotifyStartCountdown(); // Function TslGame.*0ea245cee2.NotifyStartCountdown // Native|Event|Public|BlueprintEvent // @ game+0x58e7fdc
	enum class EFutsalGamePhase NotifyPhaseStart(); // Function TslGame.*0ea245cee2.NotifyPhaseStart // Native|Event|Public|BlueprintEvent // @ game+0x58e7f1c
	void NotifyPlayerReconnect(); // Function TslGame.*0ea245cee2.NotifyPlayerReconnect // Native|Event|Public|BlueprintEvent // @ game+0x58e7fb0
	bool OnMatchStarted(); // Function TslGame.*0ea245cee2.OnMatchStarted // Final|Native|Public // @ game+0x58ecd5c
};

// Class TslGame.*0049470af5
// Size: 0x440 (Inherited: 0x418)
struct U*0049470af5 : U*4bb82286ac {
	struct UTextBlock* Goal_Text; // 0x418(0x08)
	struct UTextBlock* Kill_Text; // 0x420(0x08)
	struct UTextBlock* PlayerName_Text; // 0x428(0x08)
	struct UBorder* Info_Border; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class TslGame.*ad80b17021
// Size: 0x490 (Inherited: 0x418)
struct U*ad80b17021 : U*4bb82286ac {
	struct UButton* TopbarButton; // 0x418(0x08)
	struct U*9c8bfa0aee* Anim_In; // 0x420(0x08)
	struct U*9c8bfa0aee* Anim_Out; // 0x428(0x08)
	struct UButton* UploadButton; // 0x430(0x08)
	struct UButton* DownloadButton; // 0x438(0x08)
	struct UTextBlock* TitleText; // 0x440(0x08)
	struct UTextBlock* DescriptionText; // 0x448(0x08)
	struct UTextBlock* UploadText; // 0x450(0x08)
	struct UTextBlock* DownloadText; // 0x458(0x08)
	DelegateProperty OnSavePopupButtonPressEvent; // 0x460(0x10)
	DelegateProperty OnLoadPopupButtonPressEvent; // 0x470(0x10)
	struct U*8bb837196a* *d610e596b4; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)

	void OnUploadButtonHovered(); // Function TslGame.*ad80b17021.OnUploadButtonHovered // Final|Native|Public // @ game+0x58ea4e4
	void OnTopbarButtonClicked(); // Function TslGame.*ad80b17021.OnTopbarButtonClicked // Final|Native|Public // @ game+0x58f12ec
	void OnTopbarButtonHovered(); // Function TslGame.*ad80b17021.OnTopbarButtonHovered // Final|Native|Public // @ game+0x58ea4e4
	void OnUploadButtonClicked(); // Function TslGame.*ad80b17021.OnUploadButtonClicked // Final|Native|Public // @ game+0x58f1ce4
	void OnDownloadButtonHovered(); // Function TslGame.*ad80b17021.OnDownloadButtonHovered // Final|Native|Public // @ game+0x58ea4e4
	enum class *62cdf2ca7f OnSavePopupButtonPressed(); // Function TslGame.*ad80b17021.OnSavePopupButtonPressed // Final|Native|Public // @ game+0x58ef6e8
	enum class *62cdf2ca7f OnLoadPopupButtonPressed(); // Function TslGame.*ad80b17021.OnLoadPopupButtonPressed // Final|Native|Public // @ game+0x58ec6bc
	void OnDownloadButtonClicked(); // Function TslGame.*ad80b17021.OnDownloadButtonClicked // Final|Native|Public // @ game+0x58ea4d0
};

// Class TslGame.*ec5ad8348b
// Size: 0x5b8 (Inherited: 0x418)
struct U*ec5ad8348b : U*4bb82286ac {
	struct F*f583840709 *4ae7698be3; // 0x418(0xd0)
	struct F*62d95f3263 DisplayNameText_Binder; // 0x4e8(0x20)
	struct F*54c30817ee SupplementaryWidgetSizeBox_Binder; // 0x508(0x20)
	struct F*54c30817ee SupplementaryWidgetSwitcher_Binder; // 0x528(0x20)
	struct TMap<enum class ETslGameOptionSupplementaryType, struct UClass*> SupplementaryWidgetClasses; // 0x548(0x50)
	struct U*36cff032b6* LinkButton; // 0x598(0x08)
	struct UTextBlock* LinkButtonText; // 0x5a0(0x08)
	char pad_5A8[0x10]; // 0x5a8(0x10)

	void OnClicked_LinkButton(); // Function TslGame.*ec5ad8348b.OnClicked_LinkButton // Final|Native|Private // @ game+0x58e9b78
};

// Class TslGame.*5b03f23e1b
// Size: 0x468 (Inherited: 0x418)
struct U*5b03f23e1b : U*4bb82286ac {
	struct F*a2a8693a5f EnterHover; // 0x418(0x20)
	struct F*a2a8693a5f LeaveHover; // 0x438(0x20)
	struct UImage* ConsolImage; // 0x458(0x08)
	struct UImage* PcImage; // 0x460(0x08)
};

// Class TslGame.*42c901fa00
// Size: 0x528 (Inherited: 0x418)
struct U*42c901fa00 : U*4bb82286ac {
	struct TArray<struct FKey> *5970a1089a; // 0x418(0x10)
	struct U*e43b170799* Owner; // 0x428(0x08)
	int32 SlotIndex; // 0x430(0x04)
	bool *260258136b; // 0x434(0x01)
	bool *6e0192cc60; // 0x435(0x01)
	bool *cfb20153d9; // 0x436(0x01)
	bool *cc23b79b0a; // 0x437(0x01)
	struct TArray<struct FKey> *833244cddb; // 0x438(0x10)
	struct FTslInputKey *278ad31c77; // 0x448(0x20)
	struct FTslInputKey *98966d6235; // 0x468(0x20)
	bool bForceToUseLeftModifierKeys; // 0x488(0x01)
	char pad_489[0x7]; // 0x489(0x07)
	struct F*a8249d5e73 InputKeyDisplayBorder_Binder; // 0x490(0x30)
	struct F*54c30817ee InputKeyIconizer_Binder; // 0x4c0(0x20)
	struct F*54c30817ee Highlighter_Binder; // 0x4e0(0x20)
	struct UTexture2D* BackgroundTextureNormal; // 0x500(0x08)
	struct UTexture2D* BackgroundTextureHighlighted; // 0x508(0x08)
	struct UTexture2D* BackgroundTextureInput; // 0x510(0x08)
	struct FMulticastDelegate OnKeyBinderSlotValueChangeEvent; // 0x518(0x10)
};

// Class TslGame.*07d1b7fbb9
// Size: 0x4c0 (Inherited: 0x418)
struct U*07d1b7fbb9 : U*4bb82286ac {
	struct U*c4b0d19521* Owner; // 0x418(0x08)
	int32 Index; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct F*3cdda95245 SizeBox_Binder; // 0x428(0x28)
	struct F*54c30817ee Button_Binder; // 0x450(0x20)
	struct F*a8249d5e73 InnerBorder_Binder; // 0x470(0x30)
	struct FLinearColor ColorNormal; // 0x4a0(0x10)
	struct FLinearColor ColorHighlighted; // 0x4b0(0x10)

	void OnClicked(); // Function TslGame.*07d1b7fbb9.OnClicked // Final|Native|Public // @ game+0x58e9a58
};

// Class TslGame.*0ffbc48786
// Size: 0x458 (Inherited: 0x418)
struct U*0ffbc48786 : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct U*7d732dfd2f* *33d3448e00; // 0x420(0x08)
	struct F*91b0fceaa0 *a0c9180073; // 0x428(0x14)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct F*91b0fceaa0 *83f63c323d; // 0x440(0x14)
	char pad_454[0x4]; // 0x454(0x04)
};

// Class TslGame.*7b609752b4
// Size: 0x7d8 (Inherited: 0x458)
struct U*7b609752b4 : U*0ffbc48786 {
	char pad_458[0x1b0]; // 0x458(0x1b0)
	struct F*f583840709 *e7eafee3b6; // 0x608(0xd0)
	struct FName *b23feec699; // 0x6d8(0x08)
	struct FName *6fdc6928dd; // 0x6e0(0x08)
	struct FName *21ab1de5a3; // 0x6e8(0x08)
	struct FName ItemName; // 0x6f0(0x08)
	int32 *a7d2d1ff25; // 0x6f8(0x04)
	char pad_6FC[0x4]; // 0x6fc(0x04)
	struct FText DescriptionText; // 0x700(0x18)
	bool *d35247796a; // 0x718(0x01)
	bool *719bc1b8be; // 0x719(0x01)
	bool *4ddbbbb64e; // 0x71a(0x01)
	bool *260258136b; // 0x71b(0x01)
	char pad_71C[0x4]; // 0x71c(0x04)
	struct U*d5fb869d06* *20a9abe5e6; // 0x720(0x08)
	struct U*8bb837196a* *d610e596b4; // 0x728(0x08)
	struct UBorder* IndentationBorder; // 0x730(0x08)
	struct U*191926b023* DisplayNameFlowText; // 0x738(0x08)
	struct UButton* HoverHighlightButton; // 0x740(0x08)
	struct UImage* TooltipIconImage; // 0x748(0x08)
	struct F*54c30817ee Highlit_Binder; // 0x750(0x20)
	struct FLinearColor ColorNormal; // 0x770(0x10)
	struct FLinearColor ColorHighlighted; // 0x780(0x10)
	struct FLinearColor ColorTooltipIconHighlighted; // 0x790(0x10)
	struct FLinearColor ColorEnabled; // 0x7a0(0x10)
	struct FLinearColor ColorDisabled; // 0x7b0(0x10)
	float IndentationSize; // 0x7c0(0x04)
	char pad_7C4[0x4]; // 0x7c4(0x04)
	struct FMulticastDelegate OnGamepadYEvent; // 0x7c8(0x10)

	struct U*7b609752b4* UpdateWidget(); // Function TslGame.*7b609752b4.UpdateWidget // Final|Native|Public // @ game+0x59eb404
	int32 UpdateWidgetByDependentStepper(); // Function TslGame.*7b609752b4.UpdateWidgetByDependentStepper // Final|Native|Public // @ game+0x59eb490
	float UpdateWidgetOnDependentSlider(); // Function TslGame.*7b609752b4.UpdateWidgetOnDependentSlider // Final|Native|Public // @ game+0x59eb620
	int32 *2de791dad1(); // Function TslGame.*7b609752b4.*2de791dad1 // Final|Native|Public // @ game+0x59eb9b8
	float UpdateWidgetOnSlider(); // Function TslGame.*7b609752b4.UpdateWidgetOnSlider // Final|Native|Public // @ game+0x59eb7bc
	void OnCloudOptionTooltipDeactivated(); // Function TslGame.*7b609752b4.OnCloudOptionTooltipDeactivated // Final|Native|Public // @ game+0x59e27e0
	void OnCloudOptionTooltipActivated(); // Function TslGame.*7b609752b4.OnCloudOptionTooltipActivated // Final|Native|Public // @ game+0x59e27cc
};

// Class TslGame.*1ad0224fdd
// Size: 0x870 (Inherited: 0x7d8)
struct U*1ad0224fdd : U*7b609752b4 {
	float *351c7dedcb; // 0x7d8(0x04)
	char pad_7DC[0x4]; // 0x7dc(0x04)
	struct UButton* OptionButton; // 0x7e0(0x08)
	struct UTextBlock* OptionButtonText; // 0x7e8(0x08)
	char pad_7F0[0x70]; // 0x7f0(0x70)
	bool *90288d9c4b; // 0x860(0x01)
	char pad_861[0x7]; // 0x861(0x07)
	struct F*2ef3a887d0 *3e38e5a92e; // 0x868(0x08)

	enum class *62cdf2ca7f OnPopupButtonPressedEvent(); // Function TslGame.*1ad0224fdd.OnPopupButtonPressedEvent // Final|Native|Protected // @ game+0x58eea28
	void ShowPopupDialogEx(); // Function TslGame.*1ad0224fdd.ShowPopupDialogEx // Final|Native|Protected // @ game+0x58f95c4
};

// Class TslGame.*ae38e70818
// Size: 0x898 (Inherited: 0x7d8)
struct U*ae38e70818 : U*7b609752b4 {
	bool *55217c68f9; // 0x7d8(0x01)
	char pad_7D9[0x3]; // 0x7d9(0x03)
	int32 *4c1ae0d6ca; // 0x7dc(0x04)
	int32 *68b71c1cc1; // 0x7e0(0x04)
	char pad_7E4[0x4]; // 0x7e4(0x04)
	struct TArray<struct F*41b3939942> *fe0598e193; // 0x7e8(0x10)
	struct U*4223ef0d56* *4c03dd4e73; // 0x7f8(0x08)
	struct TArray<struct U*4223ef0d56*> *e69b43e6f6; // 0x800(0x10)
	int32 *1ba3270ce1; // 0x810(0x04)
	bool *a39f73bdcd; // 0x814(0x01)
	char pad_815[0x3]; // 0x815(0x03)
	struct UStringTable* DropDownListStringTable; // 0x818(0x08)
	struct UStringTable* DropDownListDetailedStringTable; // 0x820(0x08)
	struct F*54c30817ee DropDownList_Binder; // 0x828(0x20)
	struct F*aecf96cb1e DownArrowImage_Binder; // 0x848(0x28)
	struct UClass* DropDownListSelectableWidgetClass; // 0x870(0x08)
	enum class EHorizontalAlignment *20a03261e1; // 0x878(0x01)
	char pad_879[0x7]; // 0x879(0x07)
	struct FMulticastDelegate OnDropDownListSelectionChangeEvent; // 0x880(0x10)
	int32 *53c07512eb; // 0x890(0x04)
	char pad_894[0x4]; // 0x894(0x04)

	struct UWidget* OnGenerateWidget(); // Function TslGame.*ae38e70818.OnGenerateWidget // Final|Native|Public // @ game+0x58eaf2c
	void *8073804c4b(); // Function TslGame.*ae38e70818.*8073804c4b // Final|Native|Public // @ game+0x58e9bb8
	void OnAfterGenerateWidget(); // Function TslGame.*ae38e70818.OnAfterGenerateWidget // Final|Native|Public // @ game+0x58e83a8
	enum class ESelectInfo OnComboBoxSelectionChanged(); // Function TslGame.*ae38e70818.OnComboBoxSelectionChanged // Final|Native|Public // @ game+0x58e9be0
	void OnComboBoxOpening(); // Function TslGame.*ae38e70818.OnComboBoxOpening // Final|Native|Public // @ game+0x58e9bcc
};

// Class TslGame.*b0d4a91d47
// Size: 0x8a8 (Inherited: 0x898)
struct U*b0d4a91d47 : U*ae38e70818 {
	struct TArray<struct FName> *d2280baa85; // 0x898(0x10)

	enum class ESelectInfo OnMusicSelectionChanged(); // Function TslGame.*b0d4a91d47.OnMusicSelectionChanged // Final|Native|Public // @ game+0x58ed61c
};

// Class TslGame.*daab4b5a17
// Size: 0x870 (Inherited: 0x7d8)
struct U*daab4b5a17 : U*7b609752b4 {
	float *8a4343e86f; // 0x7d8(0x04)
	char pad_7DC[0x4]; // 0x7dc(0x04)
	struct FText DetailedDescriptionText; // 0x7e0(0x18)
	struct FVector2D *c49a6adfde; // 0x7f8(0x08)
	int32 *b3916a31b7; // 0x800(0x04)
	float *c733103008; // 0x804(0x04)
	bool *18c2da40db; // 0x808(0x01)
	bool *9d58bb661d; // 0x809(0x01)
	char pad_80A[0x6]; // 0x80a(0x06)
	struct F*54c30817ee Slider_Binder; // 0x810(0x20)
	struct F*54c30817ee SliderEditableValueText_Binder; // 0x830(0x20)
	struct FMulticastDelegate OnSliderValueChangeEvent; // 0x850(0x10)
	float *f627d93de2; // 0x860(0x04)
	char pad_864[0x4]; // 0x864(0x04)
	float *401f953230; // 0x868(0x04)
	float *8e9628834f; // 0x86c(0x04)

	void OnSliderAdjustmentBegin(); // Function TslGame.*daab4b5a17.OnSliderAdjustmentBegin // Final|Native|Public // @ game+0x58ef9bc
	struct FText OnSliderValueTextChanged(); // Function TslGame.*daab4b5a17.OnSliderValueTextChanged // Final|Native|Public|HasOutParms // @ game+0x58efa84
	void OnSliderAdjustmentEnd(); // Function TslGame.*daab4b5a17.OnSliderAdjustmentEnd // Final|Native|Public // @ game+0x58ef9d4
	float OnSliderValueChanged(); // Function TslGame.*daab4b5a17.OnSliderValueChanged // Native|Public // @ game+0x58ef9e8
	enum class ETextCommit OnSliderValueTextCommitted(); // Function TslGame.*daab4b5a17.OnSliderValueTextCommitted // Final|Native|Public|HasOutParms // @ game+0x58efb60
	void *469b29e3c3(); // Function TslGame.*daab4b5a17.*469b29e3c3 // Final|Native|Private // @ game+0x58f4428
};

// Class TslGame.*509f520fb6
// Size: 0x8b8 (Inherited: 0x870)
struct U*509f520fb6 : U*daab4b5a17 {
	struct UWidgetSwitcher* VolumePreviewButtonSwitcher; // 0x870(0x08)
	struct UButton* VolumePreviewButtonPlay; // 0x878(0x08)
	struct UButton* VolumePreviewButtonStop; // 0x880(0x08)
	struct UAkComponent* *cdb04c634a; // 0x888(0x08)
	struct UAkAudioEvent* *1fbe5e3791; // 0x890(0x08)
	struct UAkAudioEvent* *8e5b39582c; // 0x898(0x08)
	bool *2e44ab1b7e; // 0x8a0(0x01)
	char pad_8A1[0x3]; // 0x8a1(0x03)
	float *36383fd6e0; // 0x8a4(0x04)
	struct FName RTPC_Name; // 0x8a8(0x08)
	char pad_8B0[0x8]; // 0x8b0(0x08)

	struct UAkComponent* *b36a2ef211(); // Function TslGame.*509f520fb6.*b36a2ef211 // Final|Native|Protected // @ game+0x58e62f0
	void *f8d50ef459(); // Function TslGame.*509f520fb6.*f8d50ef459 // Final|Native|Protected // @ game+0x58e2b5c
	void StopGuideAkEvent(); // Function TslGame.*509f520fb6.StopGuideAkEvent // Final|Native|Public|BlueprintCallable // @ game+0x58f97b8
	void StartGuideAkEvent(); // Function TslGame.*509f520fb6.StartGuideAkEvent // Final|Native|Public|BlueprintCallable // @ game+0x58f961c
};

// Class TslGame.*c4b0d19521
// Size: 0x8e0 (Inherited: 0x7d8)
struct U*c4b0d19521 : U*7b609752b4 {
	bool *f03b9eb7d7; // 0x7d8(0x01)
	bool *0dde884b7c; // 0x7d9(0x01)
	char pad_7DA[0x2]; // 0x7da(0x02)
	int32 *c9d5fdfc40; // 0x7dc(0x04)
	int32 *68b71c1cc1; // 0x7e0(0x04)
	char pad_7E4[0x4]; // 0x7e4(0x04)
	struct TArray<struct F*41b3939942> *d984967cbd; // 0x7e8(0x10)
	struct UStringTable* StepperStringTable; // 0x7f8(0x08)
	struct UStringTable* StepperDetailedStringTable; // 0x800(0x08)
	struct U*191926b023* StepperFlowText; // 0x808(0x08)
	struct F*0c033c3537 StepperIndicatorHorizontalBox_Binder; // 0x810(0x28)
	struct UClass* StepperIndicatorWidgetClass; // 0x838(0x08)
	struct F*54c30817ee LeftArrowButton_Binder; // 0x840(0x20)
	struct F*54c30817ee RightArrowButton_Binder; // 0x860(0x20)
	struct FMulticastDelegate OnStepperValueChangeEvent; // 0x880(0x10)
	struct TArray<struct F*b133ec61f5> *15bf9e2838; // 0x890(0x10)
	char pad_8A0[0x40]; // 0x8a0(0x40)

	void OnRightArrowButtonClicked(); // Function TslGame.*c4b0d19521.OnRightArrowButtonClicked // Final|Native|Public // @ game+0x58ef5a0
	void OnLeftArrowButtonClicked(); // Function TslGame.*c4b0d19521.OnLeftArrowButtonClicked // Final|Native|Public // @ game+0x58ec5ec
};

// Class TslGame.*992be3904a
// Size: 0x8f0 (Inherited: 0x8e0)
struct U*992be3904a : U*c4b0d19521 {
	struct TArray<struct FName> *d2280baa85; // 0x8e0(0x10)

	void OnRightButtonClicked(); // Function TslGame.*992be3904a.OnRightButtonClicked // Final|Native|Private // @ game+0x58ec600
	int32 OnMusicSelectionChanged(); // Function TslGame.*992be3904a.OnMusicSelectionChanged // Final|Native|Public // @ game+0x58ed764
	void OnLeftButtonClicked(); // Function TslGame.*992be3904a.OnLeftButtonClicked // Final|Native|Private // @ game+0x58ec600
};

// Class TslGame.*1812c91a80
// Size: 0x430 (Inherited: 0x418)
struct U*1812c91a80 : U*4bb82286ac {
	struct UClass* SubTabLabelWidgetClass; // 0x418(0x08)
	struct UHorizontalBox* TabLabels; // 0x420(0x08)
	float LabelIntervalWidth; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
};

// Class TslGame.*d348473109
// Size: 0x418 (Inherited: 0x418)
struct U*d348473109 : U*4bb82286ac {
};

// Class TslGame.*89807c1339
// Size: 0x440 (Inherited: 0x418)
struct U*89807c1339 : U*d348473109 {
	struct F*aecf96cb1e Image_Binder; // 0x418(0x28)
};

// Class TslGame.*2015dda7f0
// Size: 0x4a0 (Inherited: 0x418)
struct U*2015dda7f0 : U*d348473109 {
	struct F*aecf96cb1e Image_Binder; // 0x418(0x28)
	struct TMap<struct FString, struct F*6bbbcece6a> *0228c2029d; // 0x440(0x50)
	struct FString *893c795c0d; // 0x490(0x10)
};

// Class TslGame.*67494f26b1
// Size: 0x440 (Inherited: 0x418)
struct U*67494f26b1 : U*d348473109 {
	struct F*aecf96cb1e Crosshair_Binder; // 0x418(0x28)
};

// Class TslGame.*5080b32fca
// Size: 0x418 (Inherited: 0x418)
struct U*5080b32fca : U*d348473109 {

	float UpdateVolumeUnitMeter(); // Function TslGame.*5080b32fca.UpdateVolumeUnitMeter // Event|Public|BlueprintEvent // @ game+0x22c9a0
	float OnMicVuMeterUpdated(); // Function TslGame.*5080b32fca.OnMicVuMeterUpdated // Final|Native|Public // @ game+0x58ed0c0
};

// Class TslGame.*e8086f4904
// Size: 0x4c0 (Inherited: 0x418)
struct U*e8086f4904 : U*4bb82286ac {
	struct FName *f6572737d1; // 0x418(0x08)
	struct F*54c30817ee LabelButton_Binder; // 0x420(0x20)
	struct F*62d95f3263 LabelText_Binder; // 0x440(0x20)
	struct F*0c033c3537 HighlightDecoration_Binder; // 0x460(0x28)
	struct FLinearColor LabelTextNormalColor; // 0x488(0x10)
	struct FLinearColor LabelTextHighlightColor; // 0x498(0x10)
	struct UBorder* Active_Border; // 0x4a8(0x08)
	char pad_4B0[0x10]; // 0x4b0(0x10)

	void OnLabelButtonClicked(); // Function TslGame.*e8086f4904.OnLabelButtonClicked // Final|Native|Private // @ game+0x58ec1b8
};

// Class TslGame.*80932d8934
// Size: 0x450 (Inherited: 0x418)
struct U*80932d8934 : U*4bb82286ac {
	struct UClass* TabLabelWidgetClass; // 0x418(0x08)
	struct F*0c033c3537 TabLabelWidgetsBox_Binder; // 0x420(0x28)
	float LabelIntervalWidth; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
};

// Class TslGame.*6cc8ecdca8
// Size: 0x438 (Inherited: 0x418)
struct U*6cc8ecdca8 : U*4bb82286ac {
	struct UTextBlock* OptionTooltipText; // 0x418(0x08)
	struct FVector2D PositionOffset; // 0x420(0x08)
	struct UWidget* *08bf10c409; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*b34640befb
// Size: 0x4d0 (Inherited: 0x418)
struct U*b34640befb : U*4bb82286ac {
	struct F*54c30817ee *f24f05dc14; // 0x418(0x20)
	struct F*0d9cd423a7 *31d4b78938; // 0x438(0x28)
	struct F*0d9cd423a7 *d8b8c49e08; // 0x460(0x28)
	struct F*45518ccbeb *25621eedb0; // 0x488(0x20)
	struct F*45518ccbeb *b5c6a9cfa9; // 0x4a8(0x20)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void RuntimeInit_Implementation(); // Function TslGame.*b34640befb.RuntimeInit_Implementation // Event|Public|BlueprintEvent // @ game+0x22c9a0
	enum class EStanceMode OnStanceChanged(); // Function TslGame.*b34640befb.OnStanceChanged // Final|Native|Private // @ game+0xc894ec
	void NotifyReloadingNeed(); // Function TslGame.*b34640befb.NotifyReloadingNeed // Final|Native|Private // @ game+0x93fe24
	bool NotifyWeaponUnarmed(); // Function TslGame.*b34640befb.NotifyWeaponUnarmed // Final|Native|Private // @ game+0x58e8130
	void OnPossessPawnChanged(); // Function TslGame.*b34640befb.OnPossessPawnChanged // Final|Native|Private // @ game+0xbdd69c
};

// Class TslGame.*1e5fbe222a
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*1e5fbe222a : U*b34640befb {
	struct USizeBox* KeyHint_SizeBox; // 0x4d0(0x08)
	float *660d56bcf0; // 0x4d8(0x04)
	float *154c5d7810; // 0x4dc(0x04)
	char pad_4E0[0x8]; // 0x4e0(0x08)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*1e5fbe222a.UpdatePositionOnMinimapExtended // Final|Native|Private // @ game+0x58fac10
};

// Class TslGame.*5f9a79d176
// Size: 0x440 (Inherited: 0x418)
struct U*5f9a79d176 : U*4bb82286ac {
	struct F*7b33ced057 *b1f84111c7; // 0x418(0x28)
};

// Class TslGame.*6726504afb
// Size: 0x458 (Inherited: 0x418)
struct U*6726504afb : U*4bb82286ac {
	struct F*62d95f3263 *9171acf7b2; // 0x418(0x20)
	struct F*62d95f3263 *0b7cabf7f9; // 0x438(0x20)
};

// Class TslGame.*a0001df9f6
// Size: 0x450 (Inherited: 0x418)
struct U*a0001df9f6 : U*4bb82286ac {
	char pad_418[0x18]; // 0x418(0x18)
	struct F*62d95f3263 *9171acf7b2; // 0x430(0x20)
};

// Class TslGame.*31ea2927f7
// Size: 0x478 (Inherited: 0x418)
struct U*31ea2927f7 : U*4bb82286ac {
	struct UMaterialInstanceDynamic* *2d33642c01; // 0x418(0x08)
	struct UMaterialInterface* *65a36dc878; // 0x420(0x08)
	struct F*aecf96cb1e *037a2c2371; // 0x428(0x28)
	struct F*aecf96cb1e *d1128c231b; // 0x450(0x28)
};

// Class TslGame.*c2e06c448b
// Size: 0x4a8 (Inherited: 0x418)
struct U*c2e06c448b : U*4bb82286ac {
	struct F*c0b2c1bc8a *bb21341d47; // 0x418(0x28)
	struct F*c0b2c1bc8a *9545a07fba; // 0x440(0x28)
	bool *1e458577d7; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct UClass* ItemSlotClass; // 0x470(0x08)
	int32 WidgetReserveCount; // 0x478(0x04)
	bool bCacheFirstInnerSlot; // 0x47c(0x01)
	char pad_47D[0x3]; // 0x47d(0x03)
	int32 InnerSlotReserveCount; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct F*83629ae584 *e1e94368b4; // 0x488(0x18)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	struct UWidget* *584ff1616d(); // Function TslGame.*c2e06c448b.*584ff1616d // Final|Native|Protected // @ game+0x58ec618
};

// Class TslGame.*14ee8108e3
// Size: 0x478 (Inherited: 0x418)
struct U*14ee8108e3 : U*4bb82286ac {
	struct U*2359f18d17* KillerDebuff_Widget; // 0x418(0x08)
	struct U*2359f18d17* SurvivorExhausted_Widget; // 0x420(0x08)
	struct UImage* Bleeding_Image; // 0x428(0x08)
	struct U*0b067598b6* EndGameGauge; // 0x430(0x08)
	struct U*720502de66* Interaction_Widget; // 0x438(0x08)
	struct U*5a43af665e* HASQTEWidget; // 0x440(0x08)
	struct U*70d3624d57* Indicator_Widget0; // 0x448(0x08)
	struct U*70d3624d57* Indicator_Widget1; // 0x450(0x08)
	struct U*70d3624d57* Indicator_Widget2; // 0x458(0x08)
	struct TArray<struct U*70d3624d57*> *c0ad18b8be; // 0x460(0x10)
	char pad_470[0x8]; // 0x470(0x08)
};

// Class TslGame.*70d3624d57
// Size: 0x428 (Inherited: 0x418)
struct U*70d3624d57 : U*4bb82286ac {
	struct AActor* *d1153df2bb; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
};

// Class TslGame.*e1d96b45f6
// Size: 0x448 (Inherited: 0x418)
struct U*e1d96b45f6 : U*4bb82286ac {
	struct UImage* KeyImage; // 0x418(0x08)
	struct FKey Key; // 0x420(0x18)
	float DesiredWidgetHeight; // 0x438(0x04)
	bool bForceKeyboardIcon; // 0x43c(0x01)
	char pad_43D[0xb]; // 0x43d(0x0b)

	struct FTslInputKey UpdateByInputKey(); // Function TslGame.*e1d96b45f6.UpdateByInputKey // Native|Public|HasOutParms|BlueprintCallable // @ game+0x5a27a54
};

// Class TslGame.*153e035a86
// Size: 0x470 (Inherited: 0x448)
struct U*153e035a86 : U*e1d96b45f6 {
	bool bShift; // 0x448(0x01)
	bool bCtrl; // 0x449(0x01)
	bool bAlt; // 0x44a(0x01)
	char pad_44B[0x5]; // 0x44b(0x05)
	struct U*d519ef66f2* ModifierPanel; // 0x450(0x08)
	struct UImage* ModifierKeyImage; // 0x458(0x08)
	struct UTextBlock* PlusTextBlock; // 0x460(0x08)
	int32 DesiredPlusTextFontSize; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
};

// Class TslGame.*6c72c8fd80
// Size: 0x4d0 (Inherited: 0x470)
struct U*6c72c8fd80 : U*153e035a86 {
	struct UImage* KeyboardHoldSpinner; // 0x470(0x08)
	struct U*d519ef66f2* KeyboardHoldSpinnerPanel; // 0x478(0x08)
	struct UImage* MouseHoldSpinner; // 0x480(0x08)
	struct U*d519ef66f2* MouseHoldSpinnerPanel; // 0x488(0x08)
	struct UImage* DoubleTapImage; // 0x490(0x08)
	struct UImage* HoldTriangleImage; // 0x498(0x08)
	struct U*9c8bfa0aee* HoldAnimation; // 0x4a0(0x08)
	struct UMaterialParameterCollection* InteractionHoldMPC; // 0x4a8(0x08)
	float HoldDuration; // 0x4b0(0x04)
	float *ce46de861d; // 0x4b4(0x04)
	bool *b77fa48714; // 0x4b8(0x01)
	bool *1b77394d6a; // 0x4b9(0x01)
	bool *06fea4f588; // 0x4ba(0x01)
	enum class EKeyboardKeyIconDisplayType DisplayType; // 0x4bb(0x01)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct FName ActionName; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	bool HoldKeyboard(); // Function TslGame.*6c72c8fd80.HoldKeyboard // Final|Native|Protected // @ game+0x58e7190
};

// Class TslGame.*720502de66
// Size: 0x608 (Inherited: 0x418)
struct U*720502de66 : U*4bb82286ac {
	struct TMap<enum class ETslHASInteractionMethod, struct UTexture2D*> InteractionTextureMap; // 0x418(0x50)
	struct TMap<enum class ETslHASInteractionType, struct FText> InteractionTextMap; // 0x468(0x50)
	struct UMaterialInstanceDynamic* *a3dff5cf1f; // 0x4b8(0x08)
	struct FName CancelPcKeyName; // 0x4c0(0x08)
	struct FName SelfHealPcKeyName; // 0x4c8(0x08)
	struct FName FirePcKeyName; // 0x4d0(0x08)
	struct FText CancelPcKeyText; // 0x4d8(0x18)
	struct FText SelfHealPcKeyText; // 0x4f0(0x18)
	struct FText FirePcKeyText; // 0x508(0x18)
	struct F*13de65a409 CancelPadKeyInfo; // 0x520(0x30)
	struct F*13de65a409 SelfHealPadKeyInfo; // 0x550(0x30)
	struct F*13de65a409 FirePadKeyInfo; // 0x580(0x30)
	struct UHorizontalBox* Interaction_HBox; // 0x5b0(0x08)
	struct UTextBlock* Interaction_TextBlock; // 0x5b8(0x08)
	struct UImage* Interaction_Image; // 0x5c0(0x08)
	struct UImage* InteractionGauge_Image; // 0x5c8(0x08)
	struct UImage* BuffIcon_Image; // 0x5d0(0x08)
	struct UImage* SelfHealLimit_Image; // 0x5d8(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x5e0(0x08)
	struct U*0eba8c881f* UniversalInputVisibilitySwitcher; // 0x5e8(0x08)
	struct U*6c72c8fd80* PCKeyGuideIcon; // 0x5f0(0x08)
	struct UTextBlock* PCGuideText; // 0x5f8(0x08)
	struct U*e04a683c46* PadKeyGuideIcon; // 0x600(0x08)
};

// Class TslGame.*dc0e3f98da
// Size: 0x538 (Inherited: 0x418)
struct U*dc0e3f98da : U*4bb82286ac {
	struct TMap<struct FName, struct UTexture2D*> KillerWeaponIconMap; // 0x418(0x50)
	struct TMap<enum class EHASSurvivorItemLevel, struct UTexture2D*> SurvivorItemBackgroundMap; // 0x468(0x50)
	struct TMap<enum class EHASSurvivorItemType, struct UTexture2D*> SurvivorItemIconMap; // 0x4b8(0x50)
	struct UImage* Bg_Image; // 0x508(0x08)
	struct UImage* ItemGauge_Image; // 0x510(0x08)
	struct UImage* Item_Image; // 0x518(0x08)
	struct UTextBlock* Count_Text; // 0x520(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x528(0x08)
	struct USizeBox* FireSizeBox; // 0x530(0x08)
};

// Class TslGame.*0b067598b6
// Size: 0x490 (Inherited: 0x418)
struct U*0b067598b6 : U*4bb82286ac {
	struct UImage* LastGauge_Image; // 0x418(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x420(0x08)
	struct UMaterialInstanceDynamic* *e836f32680; // 0x428(0x08)
	struct FName *5fdd2ad942; // 0x430(0x08)
	struct FName *76510a8ed8; // 0x438(0x08)
	struct FName *aae14de77b; // 0x440(0x08)
	struct U*9c8bfa0aee* HAS_Alarm_Final_Collapse_Lv1; // 0x448(0x08)
	struct U*9c8bfa0aee* HAS_Alarm_Final_Collapse_Lv2; // 0x450(0x08)
	struct U*9c8bfa0aee* HAS_Alarm_Final_Collapse_Lv3; // 0x458(0x08)
	struct U*9c8bfa0aee* HAS_Alarm_Final_Collapse_Lv4; // 0x460(0x08)
	char pad_468[0x1]; // 0x468(0x01)
	bool bDBNOCharacterInEndGame; // 0x469(0x01)
	char pad_46A[0x26]; // 0x46a(0x26)
};

// Class TslGame.*6882bb364b
// Size: 0x530 (Inherited: 0x418)
struct U*6882bb364b : U*4bb82286ac {
	char pad_418[0x18]; // 0x418(0x18)
	struct TMap<enum class EHASSurvivorItemType, struct UTexture2D*> SurvivorItemTextureMap; // 0x430(0x50)
	struct TMap<enum class EHASSurvivorState, struct UTexture2D*> SurvivorStateTextureMap; // 0x480(0x50)
	float NameTextOpacityWhenAlive; // 0x4d0(0x04)
	float NameTextOpacityWhenDead; // 0x4d4(0x04)
	struct UMaterialInstanceDynamic* *78ed13e357; // 0x4d8(0x08)
	struct UImage* SquadBg_Image; // 0x4e0(0x08)
	struct UImage* Role_Image; // 0x4e8(0x08)
	struct UImage* Warning_Image; // 0x4f0(0x08)
	struct UImage* State_Image; // 0x4f8(0x08)
	struct U*c0c5b25d31* PlatformImage; // 0x500(0x08)
	struct UTextBlock* Name_TextBlock; // 0x508(0x08)
	struct UImage* Gauge_Image; // 0x510(0x08)
	struct UImage* Cabinet1_Image; // 0x518(0x08)
	struct UImage* Cabinet2_Image; // 0x520(0x08)
	struct UImage* Cabinet3_Image; // 0x528(0x08)
};

// Class TslGame.*6b3440532d
// Size: 0x438 (Inherited: 0x418)
struct U*6b3440532d : U*4bb82286ac {
	struct UClass* *122af9b8cc; // 0x418(0x08)
	struct TArray<struct U*6882bb364b*> *c0fed6e94f; // 0x420(0x10)
	struct UVerticalBox* Squard_VBox; // 0x430(0x08)
};

// Class TslGame.*a0360e1379
// Size: 0x440 (Inherited: 0x418)
struct U*a0360e1379 : U*4bb82286ac {
	struct UImage* Phase_Image; // 0x418(0x08)
	struct UTextBlock* Engine_TextBlock; // 0x420(0x08)
	struct UTexture2D* *8dacf29ed5; // 0x428(0x08)
	struct UTexture2D* *8b92b2f0ab; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class TslGame.*375c5f6f72
// Size: 0x428 (Inherited: 0x418)
struct U*375c5f6f72 : U*4bb82286ac {
	struct UImage* SkillIcon_Image; // 0x418(0x08)
	struct UTextBlock* SkillDesc_Text; // 0x420(0x08)
};

// Class TslGame.*8952cfe26a
// Size: 0x4a0 (Inherited: 0x418)
struct U*8952cfe26a : U*4bb82286ac {
	enum class *d012928124 WeaponType; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UTexture2D* *73669f3ecc; // 0x420(0x08)
	bool *9bd0921230; // 0x428(0x01)
	bool *d94bc31de7; // 0x429(0x01)
	bool *b99a9848b8; // 0x42a(0x01)
	bool *a2b214dd9b; // 0x42b(0x01)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UMaterialInstanceDynamic* *cbe9ccbb7b; // 0x430(0x08)
	struct UImage* Item_Image; // 0x438(0x08)
	struct UImage* CoolTimeGraphImage; // 0x440(0x08)
	struct UTextBlock* Count_Text; // 0x448(0x08)
	struct UImage* FireDarkBg; // 0x450(0x08)
	struct USizeBox* FireSizeBox; // 0x458(0x08)
	struct U*6c72c8fd80* FirePcIcon; // 0x460(0x08)
	struct U*400a0fbc3d* FirePadIcon; // 0x468(0x08)
	struct UBorder* ExplosionBorder; // 0x470(0x08)
	struct U*6c72c8fd80* EquipPcIcon; // 0x478(0x08)
	struct U*400a0fbc3d* EquipConsoleIcon; // 0x480(0x08)
	struct U*9c8bfa0aee* SelectAni; // 0x488(0x08)
	struct U*9c8bfa0aee* UnSelectAni; // 0x490(0x08)
	struct U*9c8bfa0aee* ExplosionHighlightAni; // 0x498(0x08)
};

// Class TslGame.*0409472458
// Size: 0x438 (Inherited: 0x418)
struct U*0409472458 : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct U*8952cfe26a* KillerItemSlot_1; // 0x420(0x08)
	struct U*8952cfe26a* KillerItemSlot_2; // 0x428(0x08)
	struct U*8952cfe26a* KillerItemSlot_3; // 0x430(0x08)
};

// Class TslGame.*870a154e17
// Size: 0x430 (Inherited: 0x418)
struct U*870a154e17 : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct U*9c8bfa0aee* Anim_Emerge; // 0x420(0x08)
	struct U*9c8bfa0aee* Anim_Vanish; // 0x428(0x08)
};

// Class TslGame.*2359f18d17
// Size: 0x428 (Inherited: 0x418)
struct U*2359f18d17 : U*4bb82286ac {
	struct UMaterialInstanceDynamic* *2189f72678; // 0x418(0x08)
	struct UImage* Gauge_Image; // 0x420(0x08)
};

// Class TslGame.*d578909a29
// Size: 0x448 (Inherited: 0x418)
struct U*d578909a29 : U*4bb82286ac {
	struct U*ac965a4dde* RadioMessageLogWidget; // 0x418(0x08)
	struct U*6b3440532d* SurvivorList_Widget; // 0x420(0x08)
	struct U*a0360e1379* RemainGeneratorWidget; // 0x428(0x08)
	struct UWidgetSwitcher* KillerSurvivorSwitcher; // 0x430(0x08)
	struct U*dc0e3f98da* ItemSlot_Widget; // 0x438(0x08)
	struct U*0409472458* KillerItemSlot_Widget; // 0x440(0x08)
};

// Class TslGame.*812f9ac0b7
// Size: 0x480 (Inherited: 0x418)
struct U*812f9ac0b7 : U*4bb82286ac {
	struct AInventory* *5017343c1e; // 0x418(0x08)
	struct F*2ef3a887d0 *691e09c871; // 0x420(0x08)
	struct F*2ef3a887d0 *aba41950d4; // 0x428(0x08)
	enum class ECastableItemType *731392072b; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct TArray<struct F*7bc9699131> *ea846d4a1b; // 0x438(0x10)
	struct F*aecf96cb1e *67c9599b7d; // 0x448(0x28)
	struct FVector2D *801daa0da2; // 0x470(0x08)
	struct FVector2D *561b4eb6f5; // 0x478(0x08)

	void *199d10305c(); // Function TslGame.*812f9ac0b7.*199d10305c // Final|Native|Public // @ game+0x58ef7b4
	void *f47faaad99(); // Function TslGame.*812f9ac0b7.*f47faaad99 // Final|Native|Public // @ game+0x58eb798
	void *5eda379213(); // Function TslGame.*812f9ac0b7.*5eda379213 // Final|Native|Public // @ game+0x58f1cf8
	void *b5f0b4d163(); // Function TslGame.*812f9ac0b7.*b5f0b4d163 // Final|Native|Public // @ game+0x58e7e70
};

// Class TslGame.*1ff0c205f5
// Size: 0x448 (Inherited: 0x418)
struct U*1ff0c205f5 : U*4bb82286ac {
	struct UImage* GaugeImage; // 0x418(0x08)
	bool *0af478b936; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct U*45b9c64cec* *99adb86644; // 0x428(0x08)
	char pad_430[0x18]; // 0x430(0x18)
};

// Class TslGame.*a23d7e6bb4
// Size: 0x468 (Inherited: 0x448)
struct U*a23d7e6bb4 : U*1ff0c205f5 {
	struct FLinearColor *2aa9b162ae; // 0x448(0x10)
	struct UBorder* GuageBody; // 0x458(0x08)
	struct U*9c8bfa0aee* WarningAnim; // 0x460(0x08)
};

// Class TslGame.*3f8127ea67
// Size: 0x480 (Inherited: 0x418)
struct U*3f8127ea67 : U*4bb82286ac {
	struct ATslCharacter* *67732f25cb; // 0x418(0x08)
	struct F*a2a8693a5f *85b1ee5247; // 0x420(0x20)
	struct F*a2a8693a5f *3d9ccb3532; // 0x440(0x20)
	struct F*a2a8693a5f *5e84c1a753; // 0x460(0x20)

	struct F*fa099ca0b4 NotifyHit(); // Function TslGame.*3f8127ea67.NotifyHit // Final|Native|Public // @ game+0x58e7e84
};

// Class TslGame.*5cf9d840e9
// Size: 0x478 (Inherited: 0x418)
struct U*5cf9d840e9 : U*4bb82286ac {
	struct UCanvasPanel* CanvasPanel; // 0x418(0x08)
	struct UImage* HitImage; // 0x420(0x08)
	struct U*9c8bfa0aee* FadeOutAnim; // 0x428(0x08)
	int32 *f18b767959; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UClass* *d846fdd83d; // 0x438(0x08)
	struct UMaterialInterface* *933fab4dc3; // 0x440(0x08)
	struct UAkAudioEvent* *5907baf94e; // 0x448(0x08)
	struct UAkAudioEvent* *4b01a9bc02; // 0x450(0x08)
	struct TArray<struct UUserWidget*> *c3d6ee175c; // 0x458(0x10)
	struct AActor* *a57f1ca412; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)

	enum class EDamageTypeCategory OnHitNotify(); // Function TslGame.*5cf9d840e9.OnHitNotify // Final|Native|Public|BlueprintCallable // @ game+0x8ef0a4
};

// Class TslGame.*ed6db9f6a6
// Size: 0x430 (Inherited: 0x418)
struct U*ed6db9f6a6 : U*4bb82286ac {
	struct F*91b0fceaa0 *4ffeecafeb; // 0x418(0x14)
	char pad_42C[0x4]; // 0x42c(0x04)

	void NotifyOnGamepadUp(); // Function TslGame.*ed6db9f6a6.NotifyOnGamepadUp // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void NotifyOnFocusReceived(); // Function TslGame.*ed6db9f6a6.NotifyOnFocusReceived // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void NotifyOnGamepadDown(); // Function TslGame.*ed6db9f6a6.NotifyOnGamepadDown // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void NotifyOnGamepadA(); // Function TslGame.*ed6db9f6a6.NotifyOnGamepadA // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void NotifyOnGamepadB(); // Function TslGame.*ed6db9f6a6.NotifyOnGamepadB // Event|Protected|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*f4989623de
// Size: 0x418 (Inherited: 0x418)
struct U*f4989623de : U*4bb82286ac {

	struct ATslHUD* SetHUD(); // Function TslGame.*f4989623de.SetHUD // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*eb34248a56
// Size: 0x498 (Inherited: 0x418)
struct U*eb34248a56 : U*4bb82286ac {
	char pad_418[0x38]; // 0x418(0x38)
	TScriptInterface<struct U*58dd07ca93> SlotContainer; // 0x450(0x10)
	char pad_460[0x10]; // 0x460(0x10)
	struct TArray<struct U*f6a731ef02*> *48b58ea52e; // 0x470(0x10)
	struct UVerticalBox* ItemList; // 0x480(0x08)
	struct UClass* ItemSlotClass; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)

	bool OnSlotLeave(); // Function TslGame.*eb34248a56.OnSlotLeave // Final|Native|Protected // @ game+0x58eff84
	TScriptInterface<struct U*14090ed9d2> OnSlotFocus(); // Function TslGame.*eb34248a56.OnSlotFocus // Final|Native|Protected // @ game+0x58efe10
	bool OnSlotEnter(); // Function TslGame.*eb34248a56.OnSlotEnter // Final|Native|Protected // @ game+0x58efcb8
};

// Class TslGame.*90f6064ab3
// Size: 0x550 (Inherited: 0x418)
struct U*90f6064ab3 : U*4bb82286ac {
	struct F*62d95f3263 *eb4b1fd298; // 0x418(0x20)
	struct F*62d95f3263 *166568d5d7; // 0x438(0x20)
	struct F*a8249d5e73 *b9983bbf98; // 0x458(0x30)
	struct F*0c033c3537 *23b9fe1ab0; // 0x488(0x28)
	struct F*a2a8693a5f *78efa3c934; // 0x4b0(0x20)
	struct UWidgetSwitcher* InteractKeySwitcher; // 0x4d0(0x08)
	struct U*e1d96b45f6* PC_KeyIcon; // 0x4d8(0x08)
	struct U*e04a683c46* Console_KeyIcon; // 0x4e0(0x08)
	struct F*a8249d5e73 *a1422a68c3; // 0x4e8(0x30)
	struct FText InteractNameText; // 0x518(0x18)
	bool bBlinkInteractName; // 0x530(0x01)
	char pad_531[0x1f]; // 0x531(0x1f)
};

// Class TslGame.*f0162db2e3
// Size: 0x440 (Inherited: 0x418)
struct U*f0162db2e3 : U*4bb82286ac {
	struct U*9c8bfa0aee* InfoBlink; // 0x418(0x08)
	struct U*9c8bfa0aee* InfoEmerging; // 0x420(0x08)
	struct U*9c8bfa0aee* InfoVanishing; // 0x428(0x08)
	struct UTextBlock* EmoteMessageText; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)

	void OnInteract(); // Function TslGame.*f0162db2e3.OnInteract // Final|Native|Public // @ game+0x58ebf90
};

// Class TslGame.*052e2440a6
// Size: 0x480 (Inherited: 0x418)
struct U*052e2440a6 : U*4bb82286ac {
	struct F*aecf96cb1e *0a0206c5ed; // 0x418(0x28)
	struct F*aecf96cb1e *57cf749536; // 0x440(0x28)
	float GameMaxSpace; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct AInventory* *5017343c1e; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)

	void OnInventoryUpdateEvent(); // Function TslGame.*052e2440a6.OnInventoryUpdateEvent // Final|Native|Public // @ game+0xc24368
	int32 OnStackCountChanged(); // Function TslGame.*052e2440a6.OnStackCountChanged // Final|Native|Public // @ game+0x58f042c
};

// Class TslGame.*a7161b16fc
// Size: 0x418 (Inherited: 0x418)
struct U*a7161b16fc : U*4bb82286ac {
};

// Class TslGame.*7394f91ebc
// Size: 0x440 (Inherited: 0x418)
struct U*7394f91ebc : U*4bb82286ac {
	struct F*aecf96cb1e *b3ede13613; // 0x418(0x28)
};

// Class TslGame.*d175c11ec4
// Size: 0x560 (Inherited: 0x418)
struct U*d175c11ec4 : U*4bb82286ac {
	struct F*62d95f3263 *c81ee49952; // 0x418(0x20)
	struct F*62d95f3263 *9f0e547314; // 0x438(0x20)
	struct F*62d95f3263 *e9c45ae40d; // 0x458(0x20)
	struct F*62d95f3263 *41e5afd3e8; // 0x478(0x20)
	struct F*62d95f3263 *7a13b54c6a; // 0x498(0x20)
	struct F*62d95f3263 *b6195e557d; // 0x4b8(0x20)
	struct F*62d95f3263 *4548ccef31; // 0x4d8(0x20)
	struct F*7b33ced057 *aaf8e267bb; // 0x4f8(0x28)
	struct F*54c30817ee *afd3e834ae; // 0x520(0x20)
	struct UButton* *5ff87ba21b; // 0x540(0x08)
	struct U*8b242c2a59* *434713d4c7; // 0x548(0x08)
	int32 SlotIndex; // 0x550(0x04)
	char pad_554[0xc]; // 0x554(0x0c)

	void OnClicked(); // Function TslGame.*d175c11ec4.OnClicked // Final|Native|Public // @ game+0x58e9a6c
};

// Class TslGame.*c45865bc05
// Size: 0x430 (Inherited: 0x418)
struct U*c45865bc05 : U*4bb82286ac {
	struct U*9c8bfa0aee* Show_Anim; // 0x418(0x08)
	struct UImage* Bg_Image; // 0x420(0x08)
	struct UImage* Icon_Image; // 0x428(0x08)
};

// Class TslGame.*169c52d405
// Size: 0x518 (Inherited: 0x418)
struct U*169c52d405 : U*4bb82286ac {
	char pad_418[0x58]; // 0x418(0x58)
	enum class EEquipSlotID EquipSlotID; // 0x470(0x01)
	char pad_471[0x3]; // 0x471(0x03)
	int32 WeaponSlotIndex; // 0x474(0x04)
	struct UTexture* SlotBackground_NormalEmpty; // 0x478(0x08)
	struct UTexture* SlotBackground_Normal; // 0x480(0x08)
	struct UTexture* SlotBackground_On; // 0x488(0x08)
	struct UTexture* SlotBackGround_SubOn; // 0x490(0x08)
	struct UTexture* SlotBackground_Over; // 0x498(0x08)
	struct FName TexParm; // 0x4a0(0x08)
	struct UClass* *578807af84; // 0x4a8(0x08)
	float IconSize; // 0x4b0(0x04)
	float ToolTipShowDelaytime; // 0x4b4(0x04)
	struct UImage* ItemIcon; // 0x4b8(0x08)
	struct UAkAudioEvent* *8a82be289e; // 0x4c0(0x08)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x4c8(0x08)
	struct UMaterialInstanceDynamic* SlotDynamicMaterial; // 0x4d0(0x08)
	struct AEquipment* Equipment; // 0x4d8(0x08)
	struct UItem* Item; // 0x4e0(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x4e8(0x08)
	struct U*79e4fe9303* InventoryWidget; // 0x4f0(0x08)
	struct UItemToolTipWidget* *472b5853d5; // 0x4f8(0x08)
	struct ATslCharacter* *d245c92081; // 0x500(0x08)
	struct UImage* TuningTag; // 0x508(0x08)
	char pad_510[0x8]; // 0x510(0x08)

	void OnPressedWidgetInputB(); // Function TslGame.*169c52d405.OnPressedWidgetInputB // Final|Native|Public // @ game+0xbdd69c
	void OnEquipmentUpdated(); // Function TslGame.*169c52d405.OnEquipmentUpdated // Final|Native|Private // @ game+0xbf1cb8
	void OnPressedUIWidgetInputY(); // Function TslGame.*169c52d405.OnPressedUIWidgetInputY // Native|Public // @ game+0x58eeae0
	bool IsCharacterCasting(); // Function TslGame.*169c52d405.IsCharacterCasting // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a15730
};

// Class TslGame.*ab3b040f07
// Size: 0x6e0 (Inherited: 0x518)
struct U*ab3b040f07 : U*169c52d405 {
	char pad_518[0x20]; // 0x518(0x20)
	struct F*a159aaccd9 CanvasPanel_Binder; // 0x538(0x28)
	struct F*a8249d5e73 BackgroundSlot_Binder; // 0x560(0x30)
	struct F*54c30817ee IconBlock_Binder; // 0x590(0x20)
	struct F*aecf96cb1e Icon_Bidner; // 0x5b0(0x28)
	struct F*c0b2c1bc8a DurabilityGaugeBlock_Binder; // 0x5d8(0x28)
	struct F*54c30817ee DurabilityIconBlock_Binder; // 0x600(0x20)
	struct F*aecf96cb1e DestroyedItemTint_Binder; // 0x620(0x28)
	struct F*62d95f3263 DurabilityNumber_Binder; // 0x648(0x20)
	struct F*7b33ced057 DurabilityIconSwitcher_Binder; // 0x668(0x28)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x690(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x6a0(0x10)
	struct FLinearColor BlockedIconColor; // 0x6b0(0x10)
	struct UMaterialInstanceDynamic* *17f8ebe1ba; // 0x6c0(0x08)
	struct UEquipableItem* EquipableItem; // 0x6c8(0x08)
	char pad_6D0[0x8]; // 0x6d0(0x08)
	struct U*c45865bc05* RadioMessage; // 0x6d8(0x08)
};

// Class TslGame.*def2c78608
// Size: 0x728 (Inherited: 0x6e0)
struct U*def2c78608 : U*ab3b040f07 {
	struct F*aecf96cb1e DurabilityGauge_Binder; // 0x6e0(0x28)
	struct F*54c30817ee ItemIconLayer_Binder; // 0x708(0x20)
};

// Class TslGame.*8a2f1241e9
// Size: 0x6f8 (Inherited: 0x6e0)
struct U*8a2f1241e9 : U*ab3b040f07 {
	struct UProgressBar* Pgb_Durability; // 0x6e0(0x08)
	float *5c4ed57091; // 0x6e8(0x04)
	char pad_6EC[0xc]; // 0x6ec(0x0c)

	void OnReleasedX(); // Function TslGame.*8a2f1241e9.OnReleasedX // Final|Native|Protected // @ game+0xc6e074
	void FocusState(); // Function TslGame.*8a2f1241e9.FocusState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void NormalState(); // Function TslGame.*8a2f1241e9.NormalState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void LinkState(); // Function TslGame.*8a2f1241e9.LinkState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnPressedX(); // Function TslGame.*8a2f1241e9.OnPressedX // Final|Native|Protected // @ game+0xc39dec
	void OnReleasedLThumb(); // Function TslGame.*8a2f1241e9.OnReleasedLThumb // Final|Native|Protected // @ game+0x58eed28
	void OnPressedLThumb(); // Function TslGame.*8a2f1241e9.OnPressedLThumb // Final|Native|Protected // @ game+0x58eeacc
};

// Class TslGame.*2f2f433875
// Size: 0x7e8 (Inherited: 0x728)
struct U*2f2f433875 : U*def2c78608 {
	struct TArray<struct FName> Items; // 0x728(0x10)
	struct F*62d95f3263 ItemCountTextBinder; // 0x738(0x20)
	struct F*aecf96cb1e ItemIconImageBinder; // 0x758(0x28)
	struct F*3cdda95245 ItemIconImageSizeBoxBinder; // 0x780(0x28)
	struct FName ItemIconTextureParamName; // 0x7a8(0x08)
	float ItemIconImageSizeBoxHeight; // 0x7b0(0x04)
	char pad_7B4[0x4]; // 0x7b4(0x04)
	struct UTexture* IconTexture; // 0x7b8(0x08)
	float NoItemOpacity; // 0x7c0(0x04)
	float DragItemOpacity; // 0x7c4(0x04)
	float HasItemOpacity; // 0x7c8(0x04)
	float DragBackgroundState; // 0x7cc(0x04)
	float ItemPresentBackgroundState; // 0x7d0(0x04)
	char pad_7D4[0x4]; // 0x7d4(0x04)
	struct UClass* LoadoutToolTipClass; // 0x7d8(0x08)
	int32 ItemsCount; // 0x7e0(0x04)
	char pad_7E4[0x4]; // 0x7e4(0x04)

	void OnEquipmentUpdated(); // Function TslGame.*2f2f433875.OnEquipmentUpdated // Final|Native|Public // @ game+0x58ea950
	void OnStackCountChanged(); // Function TslGame.*2f2f433875.OnStackCountChanged // Final|Native|Public // @ game+0x58ea950
	void OnInventoryUpdated(); // Function TslGame.*2f2f433875.OnInventoryUpdated // Final|Native|Public // @ game+0x58ea950
	void OnUpdateItemBlueprint(); // Function TslGame.*2f2f433875.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*37c1e400e8
// Size: 0x728 (Inherited: 0x728)
struct U*37c1e400e8 : U*def2c78608 {

	void OnUpdateItemBlueprint(); // Function TslGame.*37c1e400e8.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*7dc0cff4f3
// Size: 0x680 (Inherited: 0x518)
struct U*7dc0cff4f3 : U*169c52d405 {
	char pad_518[0x98]; // 0x518(0x98)
	struct U*0248edeefc* *530b94b564; // 0x5b0(0x08)
	struct UWeaponItem* WeaponItem; // 0x5b8(0x08)
	char pad_5C0[0x10]; // 0x5c0(0x10)
	struct F*c0b2c1bc8a AttachmentIconBlock_Binder; // 0x5d0(0x28)
	struct F*aecf96cb1e AttachmentIcon_Binder; // 0x5f8(0x28)
	struct F*a8249d5e73 AttachmentSlotBackground_Binder; // 0x620(0x30)
	enum class EWeaponAttachmentSlotID *bc7294b32c; // 0x650(0x01)
	char pad_651[0x7]; // 0x651(0x07)
	struct U*c45865bc05* RadioMessage; // 0x658(0x08)
	struct AInventory* Inventory; // 0x660(0x08)
	struct U*79e4fe9303* *78f8952782; // 0x668(0x08)
	struct U*c2c78a4d50* NotifyItem; // 0x670(0x08)
	char pad_678[0x8]; // 0x678(0x08)
};

// Class TslGame.*69642b101e
// Size: 0x6b0 (Inherited: 0x680)
struct U*69642b101e : U*7dc0cff4f3 {
	struct F*a159aaccd9 CanvasPanel_Binder; // 0x678(0x28)
	struct UImage* Recommend_Image; // 0x6a0(0x08)
	struct UImage* RecommendBG_Image; // 0x6a8(0x08)
};

// Class TslGame.*5ed0ae50ad
// Size: 0x6d0 (Inherited: 0x680)
struct U*5ed0ae50ad : U*7dc0cff4f3 {
	struct F*c0b2c1bc8a SizeBox_Binder; // 0x678(0x28)
	struct UImage* Img_Arrow; // 0x6a0(0x08)
	struct UImage* ImgBG; // 0x6a8(0x08)
	struct U*9c8bfa0aee* Anim_Arrow; // 0x6b0(0x08)
	float HoldDuration; // 0x6b8(0x04)
	char pad_6C4[0xc]; // 0x6c4(0x0c)

	void DisableState(); // Function TslGame.*5ed0ae50ad.DisableState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void FocusState(); // Function TslGame.*5ed0ae50ad.FocusState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void NormalState(); // Function TslGame.*5ed0ae50ad.NormalState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void LinkState(); // Function TslGame.*5ed0ae50ad.LinkState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void PlayArrowAnimation(); // Function TslGame.*5ed0ae50ad.PlayArrowAnimation // Final|Native|Public|BlueprintCallable // @ game+0xbe6b74
	void OnInputLThumbPressed(); // Function TslGame.*5ed0ae50ad.OnInputLThumbPressed // Final|Native|Protected // @ game+0x58ebf04
	void OnInputLThumbReleased(); // Function TslGame.*5ed0ae50ad.OnInputLThumbReleased // Final|Native|Protected // @ game+0x58ebf30
	void SelfPutState(); // Function TslGame.*5ed0ae50ad.SelfPutState // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*098c6ef928
// Size: 0x6c0 (Inherited: 0x6b0)
struct U*098c6ef928 : U*69642b101e {
	struct UImage* DisabledImage; // 0x6b0(0x08)
	char pad_6B8[0x8]; // 0x6b8(0x08)
};

// Class TslGame.TslWeapon_SoftRole
// Size: 0xaa0 (Inherited: 0xa70)
struct ATslWeapon_SoftRole : ATslWeapon {
	struct FName AnimNotifyNameCloseSoftRole; // 0xa68(0x08)
	struct FName AnimNotifyNameOpenSoftRole; // 0xa70(0x08)
	struct FName AnimNotifyNameInspectSoftRole; // 0xa78(0x08)
	enum class ESoftRoleState *b18630e067; // 0xa80(0x01)
	struct FVector VehicleFppOffset; // 0xa84(0x0c)
	struct U*795f7342b3* *795f7342b3; // 0xa90(0x08)
	char pad_A9D[0x3]; // 0xa9d(0x03)

	struct FVector *5d0a67f930(); // Function TslGame.TslWeapon_SoftRole.*5d0a67f930 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x592c2bc
	struct FVector *5eb7b861a9(); // Function TslGame.TslWeapon_SoftRole.*5eb7b861a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x592c288
};

// Class TslGame.TslWeapon_TacPack
// Size: 0xab0 (Inherited: 0xaa0)
struct ATslWeapon_TacPack : ATslWeapon_SoftRole {
	float *8be28e7a4d; // 0xaa0(0x04)
	bool *bbbcaff302; // 0xaa4(0x01)
	char pad_AA5[0xb]; // 0xaa5(0x0b)

	struct FName UpdatedCharacterEvent(); // Function TslGame.TslWeapon_TacPack.UpdatedCharacterEvent // Final|Native|Protected|HasOutParms // @ game+0x58fb77c
	void *b3e51f1dc6(); // Function TslGame.TslWeapon_TacPack.*b3e51f1dc6 // Final|Native|Protected // @ game+0x58f1a80
};

// Class TslGame.*a484c2dc13
// Size: 0x7f0 (Inherited: 0x6b0)
struct U*a484c2dc13 : U*69642b101e {
	struct F*aecf96cb1e *0a0206c5ed; // 0x6b0(0x28)
	struct F*aecf96cb1e *57cf749536; // 0x6d8(0x28)
	struct F*aecf96cb1e *5730018917; // 0x700(0x28)
	struct F*aecf96cb1e *05899a6cd4; // 0x728(0x28)
	struct F*7b33ced057 *89f1140ae0; // 0x750(0x28)
	struct F*54c30817ee *d7cd965941; // 0x778(0x20)
	struct F*62d95f3263 *4f7a71c9c1; // 0x798(0x20)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x7b8(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x7c8(0x10)
	struct UTextBlock* TextStackCount; // 0x7d8(0x08)
	struct UMaterialInstanceDynamic* *7e456c0bd9; // 0x7e0(0x08)
	char pad_7E8[0x8]; // 0x7e8(0x08)
};

// Class TslGame.*c107f01955
// Size: 0x800 (Inherited: 0x6d0)
struct U*c107f01955 : U*5ed0ae50ad {
	struct F*aecf96cb1e *0a0206c5ed; // 0x6c8(0x28)
	struct F*aecf96cb1e *57cf749536; // 0x6f0(0x28)
	struct F*aecf96cb1e *05899a6cd4; // 0x718(0x28)
	struct F*7b33ced057 *89f1140ae0; // 0x740(0x28)
	struct F*54c30817ee *d7cd965941; // 0x768(0x20)
	struct F*62d95f3263 *4f7a71c9c1; // 0x788(0x20)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x7a8(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x7b8(0x10)
	struct UMaterialInstanceDynamic* *7e456c0bd9; // 0x7c8(0x08)
	struct F*54c30817ee *fefbc32ab3; // 0x7d0(0x20)
	struct UTextBlock* TextStackCount; // 0x7f0(0x08)
	struct UProgressBar* Pgb_Durability; // 0x7f8(0x08)
};

// Class TslGame.ViewModeStudio
// Size: 0x460 (Inherited: 0x3f8)
struct AViewModeStudio : AActor {
	struct UCameraComponent* CameraComponent; // 0x3f8(0x08)
	struct USceneCaptureComponent2D* SceneCaptureComponent; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)
	struct FTransform *f7679313c5; // 0x410(0x30)
	struct UTextureRenderTarget2D* TextureTarget; // 0x440(0x08)
	struct FName CameraSocketName; // 0x448(0x08)
	float MaxViewDistance; // 0x450(0x04)
	float ViewSlaveLocationDuration; // 0x454(0x04)
	float *54a40985e4; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)

	float AddRoll(); // Function TslGame.ViewModeStudio.AddRoll // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59b67a4
	struct AActor* SetViewModeAbleActor(); // Function TslGame.ViewModeStudio.SetViewModeAbleActor // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59ccf78
	float AddPitch(); // Function TslGame.ViewModeStudio.AddPitch // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59b6708
	float AddYaw(); // Function TslGame.ViewModeStudio.AddYaw // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59b68d8
	struct UTextureRenderTarget2D* *c3e50a4e87(); // Function TslGame.ViewModeStudio.*c3e50a4e87 // Final|Native|Public|BlueprintCallable // @ game+0x59ccb68
	float *d21f05fa0b(); // Function TslGame.ViewModeStudio.*d21f05fa0b // Final|Native|Public|BlueprintCallable // @ game+0x59b6840
	struct FName *e6707591d5(); // Function TslGame.ViewModeStudio.*e6707591d5 // Final|Native|Public|BlueprintCallable // @ game+0x59cabfc
	float AddViewDistance(); // Function TslGame.ViewModeStudio.AddViewDistance // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x5908a98
};

// Class TslGame.ItemStudio
// Size: 0x460 (Inherited: 0x460)
struct AItemStudio : AViewModeStudio {

	struct UMeshComponent* SetMeshTransform(); // Function TslGame.ItemStudio.SetMeshTransform // Native|Event|Public|BlueprintEvent // @ game+0xb9750c
	struct UItem* SetItem(); // Function TslGame.ItemStudio.SetItem // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x5eb69c
	struct UMeshComponent* UpdateComponentToWorld(); // Function TslGame.ItemStudio.UpdateComponentToWorld // Native|Public|BlueprintCallable // @ game+0x58fa2c8
};

// Class TslGame.*a31c6b425e
// Size: 0x740 (Inherited: 0x518)
struct U*a31c6b425e : U*169c52d405 {
	struct UTextureRenderTarget2D* RenderTargetTexture; // 0x518(0x08)
	struct UClass* ItemStudioClass; // 0x520(0x08)
	int32 MaxWeaponNameLength; // 0x528(0x04)
	char pad_52C[0x4]; // 0x52c(0x04)
	struct F*a8249d5e73 BackgroundBorder_Binder; // 0x530(0x30)
	struct F*54c30817ee WeaponInfoText_Bidner; // 0x560(0x20)
	struct F*62d95f3263 WeaponHandsOnLoadedAmmoCount_Binder; // 0x580(0x20)
	struct F*aecf96cb1e AmmoIcon_Binder; // 0x5a0(0x28)
	struct F*62d95f3263 WeaponHandsOnUnloadedAmmoCount_Binder; // 0x5c8(0x20)
	struct F*62d95f3263 WeaponName_Binder; // 0x5e8(0x20)
	struct F*62d95f3263 KeyName_Binder; // 0x608(0x20)
	struct F*62d95f3263 AmmoName_Bidner; // 0x628(0x20)
	struct UHorizontalBox* Ammo_HorizontalBox; // 0x648(0x08)
	struct F*aecf96cb1e AmmoBg_Binder; // 0x650(0x28)
	struct F*aecf96cb1e WeaponCaptureImage_Binder; // 0x678(0x28)
	struct F*aecf96cb1e LockIcon_Binder; // 0x6a0(0x28)
	struct FSlateColor ImageDisabledColor; // 0x6c8(0x28)
	struct UWidgetSwitcher* UnloadedSwitcher; // 0x6f0(0x08)
	char pad_6F8[0x8]; // 0x6f8(0x08)
	struct UEquipableItem* EquipableItem; // 0x700(0x08)
	struct ATslWeapon* Weapon; // 0x708(0x08)
	struct ATslWeapon_Gun* *6a44216879; // 0x710(0x08)
	struct UMaterialInstanceDynamic* *2652e07fb7; // 0x718(0x08)
	struct UMaterialInstanceDynamic* *e8fd643533; // 0x720(0x08)
	struct UUserWidget* *779f7a901e; // 0x728(0x08)
	struct AInventory* *5017343c1e; // 0x730(0x08)
	char pad_738[0x8]; // 0x738(0x08)

	struct AActor* OnSpawnActorInSceneCaptureWorld(); // Function TslGame.*a31c6b425e.OnSpawnActorInSceneCaptureWorld // Native|Protected // @ game+0xbfeb68
	void DestroyItemStudio(); // Function TslGame.*a31c6b425e.DestroyItemStudio // Final|Native|Public // @ game+0x58e4aa4
	void InitBody(); // Function TslGame.*a31c6b425e.InitBody // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*e5739652bc
// Size: 0x740 (Inherited: 0x740)
struct U*e5739652bc : U*a31c6b425e {
};

// Class TslGame.*8c28e9aa7d
// Size: 0x740 (Inherited: 0x740)
struct U*8c28e9aa7d : U*a31c6b425e {

	void FocusState(); // Function TslGame.*8c28e9aa7d.FocusState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnPressedUIWidgetInputY(); // Function TslGame.*8c28e9aa7d.OnPressedUIWidgetInputY // Native|Protected // @ game+0x58eeae0
	void NormalState(); // Function TslGame.*8c28e9aa7d.NormalState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void SelfPutState(); // Function TslGame.*8c28e9aa7d.SelfPutState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void LinkState(); // Function TslGame.*8c28e9aa7d.LinkState // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*81d8a95929
// Size: 0x778 (Inherited: 0x740)
struct U*81d8a95929 : U*e5739652bc {
	char pad_740[0x8]; // 0x740(0x08)
	struct TArray<struct F*ffb09d99ff> *c5bbaf472b; // 0x748(0x10)
	struct UHorizontalBox* AmmoHorizontalBox; // 0x758(0x08)
	char pad_760[0x18]; // 0x760(0x18)

	struct AActor* OnSpawnActorInSceneCaptureWorld(); // Function TslGame.*81d8a95929.OnSpawnActorInSceneCaptureWorld // Native|Public // @ game+0x58f01dc
};

// Class TslGame.*0248edeefc
// Size: 0x770 (Inherited: 0x518)
struct U*0248edeefc : U*169c52d405 {
	char pad_518[0x10]; // 0x518(0x10)
	int32 SlotIndex; // 0x528(0x04)
	char pad_52C[0xa4]; // 0x52c(0xa4)
	struct U*cf25eb7d29* *6ef87ab895; // 0x5d0(0x08)
	struct TArray<struct U*7dc0cff4f3*> *49ab5370ad; // 0x5d8(0x10)
	char pad_5E8[0x50]; // 0x5e8(0x50)
	struct F*0c033c3537 AttachmentSlotHorizontalBox_Binder; // 0x638(0x28)
	struct F*0c033c3537 TacPackAttachmentSlotHorizontalBox_Binder; // 0x660(0x28)
	struct F*a159aaccd9 AttachmentSlotPanel_Binder; // 0x688(0x28)
	struct F*a8249d5e73 BackgroundSlot_Binder; // 0x6b0(0x30)
	struct UTextureRenderTarget2D* RenderTargetTexture; // 0x6e0(0x08)
	struct UClass* ItemStudioClass; // 0x6e8(0x08)
	int32 MaxWeaponNameLength; // 0x6f0(0x04)
	char pad_6F4[0x4]; // 0x6f4(0x04)
	struct UMaterialInterface* *ee5d6d9435; // 0x6f8(0x08)
	struct UMaterialInterface* *b92333e1dc; // 0x700(0x08)
	struct UMaterialInterface* *9ed6bb3875; // 0x708(0x08)
	struct U*c45865bc05* RadioMessage; // 0x710(0x08)
	struct UUserWidget* *779f7a901e; // 0x718(0x08)
	struct AInventory* Inventory; // 0x720(0x08)
	struct AItemStudio* WeaponStudio; // 0x728(0x08)
	struct UMaterialInstanceDynamic* *2652e07fb7; // 0x730(0x08)
	struct UEquipableItem* EquipableItem; // 0x738(0x08)
	struct UWeaponItem* WeaponItem; // 0x740(0x08)
	struct UThrowableItem* ThrowableItem; // 0x748(0x08)
	struct ATslWeapon_Gun* *6a44216879; // 0x750(0x08)
	struct UEquipableItem* *411ded1506; // 0x758(0x08)
	struct UWeaponItem* *a173c3e6f8; // 0x760(0x08)
	struct UThrowableItem* *4ad60d9ac9; // 0x768(0x08)

	void OnPressedUIWidgetInputY(); // Function TslGame.*0248edeefc.OnPressedUIWidgetInputY // Native|Public // @ game+0x58eeae0
	bool OnEnterSlotFunction(); // Function TslGame.*0248edeefc.OnEnterSlotFunction // Final|Native|Protected // @ game+0x58ea7f8
	TScriptInterface<struct U*14090ed9d2> OnAttachmentFocusedEvent(); // Function TslGame.*0248edeefc.OnAttachmentFocusedEvent // Final|Native|Protected // @ game+0x58e8b00
	TScriptInterface<struct U*14090ed9d2> *1dc76f6c85(); // Function TslGame.*0248edeefc.*1dc76f6c85 // Final|Native|Protected // @ game+0x58e8790
	bool OnLeaveSlotFunction(); // Function TslGame.*0248edeefc.OnLeaveSlotFunction // Final|Native|Protected // @ game+0x58ec47c
};

// Class TslGame.*845e83c45f
// Size: 0x770 (Inherited: 0x770)
struct U*845e83c45f : U*0248edeefc {
};

// Class TslGame.*b1a2f2729d
// Size: 0x790 (Inherited: 0x770)
struct U*b1a2f2729d : U*0248edeefc {
	float *a68366c3b8; // 0x770(0x04)
	float *c85d6f9b5c; // 0x774(0x04)
	float *acdca458b7; // 0x778(0x04)
	char pad_77C[0x14]; // 0x77c(0x14)

	void SetSizeToTacticalGearWidget(); // Function TslGame.*b1a2f2729d.SetSizeToTacticalGearWidget // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	struct FKey *d1a9058b5d(); // Function TslGame.*b1a2f2729d.*d1a9058b5d // Final|Native|Protected // @ game+0x58f3b68
	void OnWidgetInputAReleased(); // Function TslGame.*b1a2f2729d.OnWidgetInputAReleased // Final|Native|Protected // @ game+0x8f1150
	void OnWidgetInputR3Released(); // Function TslGame.*b1a2f2729d.OnWidgetInputR3Released // Final|Native|Protected // @ game+0x58f2748
	void NormalState(); // Function TslGame.*b1a2f2729d.NormalState // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void SetSizeToGunWeaponWidget(); // Function TslGame.*b1a2f2729d.SetSizeToGunWeaponWidget // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void OnWidgetInputAPressed(); // Function TslGame.*b1a2f2729d.OnWidgetInputAPressed // Final|Native|Protected // @ game+0x8f11e4
	void PressedDropInput(); // Function TslGame.*b1a2f2729d.PressedDropInput // Final|Native|Protected // @ game+0x58f3b54
	void OnWidgetInputL3Pressed(); // Function TslGame.*b1a2f2729d.OnWidgetInputL3Pressed // Final|Native|Protected // @ game+0x58f2708
	void LinkState(); // Function TslGame.*b1a2f2729d.LinkState // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void SetSizeToThrowableWeaponWidget(); // Function TslGame.*b1a2f2729d.SetSizeToThrowableWeaponWidget // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	void OnWidgetInputR3Pressed(); // Function TslGame.*b1a2f2729d.OnWidgetInputR3Pressed // Final|Native|Protected // @ game+0x58f2734
	void ReleaseDetachInput(); // Function TslGame.*b1a2f2729d.ReleaseDetachInput // Final|Native|Protected // @ game+0x8f10a0
	void ReleasedDropInput(); // Function TslGame.*b1a2f2729d.ReleasedDropInput // Final|Native|Protected // @ game+0x58f4220
	void PressedDetachInput(); // Function TslGame.*b1a2f2729d.PressedDetachInput // Final|Native|Protected // @ game+0x8f110c
	void FocusState(); // Function TslGame.*b1a2f2729d.FocusState // Event|Protected|BlueprintEvent // @ game+0x22c9a0
	struct FKey *e98ae11425(); // Function TslGame.*b1a2f2729d.*e98ae11425 // Final|Native|Protected // @ game+0x58f413c
	void OnWidgetInputL3Released(); // Function TslGame.*b1a2f2729d.OnWidgetInputL3Released // Final|Native|Protected // @ game+0x58f271c
};

// Class TslGame.*d80a3b5d0b
// Size: 0x790 (Inherited: 0x770)
struct U*d80a3b5d0b : U*845e83c45f {
	DelegateProperty *81a5e78651; // 0x770(0x10)
	struct U*f4ab4bf6b2* *52bcffb0cf; // 0x780(0x08)
	char pad_788[0x8]; // 0x788(0x08)

	enum class *62cdf2ca7f ProcessBuy(); // Function TslGame.*d80a3b5d0b.ProcessBuy // Final|Native|Private // @ game+0x58f3c68
	void OnUpdateItemBlueprint(); // Function TslGame.*d80a3b5d0b.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.TslItemDragWidget
// Size: 0x540 (Inherited: 0x418)
struct UTslItemDragWidget : U*4bb82286ac {
	struct F*aecf96cb1e *7d8abfbb79; // 0x418(0x28)
	struct F*aecf96cb1e *d75432dfbf; // 0x440(0x28)
	struct F*aecf96cb1e *67c9599b7d; // 0x468(0x28)
	struct F*c0b2c1bc8a *1750282429; // 0x490(0x28)
	struct F*62d95f3263 *10297580f0; // 0x4b8(0x20)
	struct UItem* *d9545b754a; // 0x4d8(0x08)
	TScriptInterface<struct U*2c0574111f> *9aafc483e0; // 0x4e0(0x10)
	char pad_4F0[0x20]; // 0x4f0(0x20)
	struct UTexture* *3ffbdbe2a4; // 0x510(0x08)
	struct UTexture* *1ae8eaa864; // 0x518(0x08)
	struct UTexture* *b3a579e99a; // 0x520(0x08)
	struct ATslPlayerController* ShooterPlayerController; // 0x528(0x08)
	struct AInventory* Inventory; // 0x530(0x08)
	struct UMaterialInstanceDynamic* *8f683b7205; // 0x538(0x08)

	struct UWidget* *4fc8a020e2(); // Function TslGame.TslItemDragWidget.*4fc8a020e2 // Final|Native|Public // @ game+0x58ea964
};

// Class TslGame.*2dd70133b6
// Size: 0x730 (Inherited: 0x418)
struct U*2dd70133b6 : U*4bb82286ac {
	char pad_418[0x68]; // 0x418(0x68)
	struct TArray<enum class EItemCategory> *613d0be9a5; // 0x480(0x10)
	struct UClass* *bfde26d546; // 0x490(0x08)
	bool *52db1d9a45; // 0x498(0x01)
	bool *9467a8b713; // 0x499(0x01)
	char pad_49A[0xa6]; // 0x49a(0xa6)
	float *b20b9523b8; // 0x540(0x04)
	char pad_544[0x10]; // 0x544(0x10)
	float *2d020b9a4c; // 0x554(0x04)
	struct F*3cdda95245 *f07db7cc4e; // 0x558(0x28)
	struct F*32077c819e *2bccff8959; // 0x580(0x28)
	struct F*a8249d5e73 *aa3660ec01; // 0x5a8(0x30)
	struct F*c0b2c1bc8a *618eeae185; // 0x5d8(0x28)
	struct F*54c30817ee *711638914c; // 0x600(0x20)
	struct F*54c30817ee *699c58b6e6; // 0x620(0x20)
	struct F*62d95f3263 *eaf1e28277; // 0x640(0x20)
	struct F*62d95f3263 *82314253ba; // 0x660(0x20)
	struct UClass* *dbef353e59; // 0x680(0x08)
	struct FSlateColor *202b6353c5; // 0x688(0x28)
	struct FSlateColor *126558b02e; // 0x6b0(0x28)
	float *da00e4cdc3; // 0x6d8(0x04)
	float *595a3c17e0; // 0x6dc(0x04)
	int32 *e79f8eb749; // 0x6e0(0x04)
	char pad_6E4[0x4]; // 0x6e4(0x04)
	struct TArray<struct U*f6a731ef02*> *6663f9205e; // 0x6e8(0x10)
	struct ANearbyInteractiveItemExplorer* ItemExplorer; // 0x6f8(0x08)
	TScriptInterface<struct U*58dd07ca93> Container; // 0x700(0x10)
	struct TArray<TScriptInterface<struct U*2c0574111f>> *ccf8920a3f; // 0x710(0x10)
	TScriptInterface<struct U*2c0574111f> *a91bf7b120; // 0x720(0x10)

	void OnClickBtn_Time(); // Function TslGame.*2dd70133b6.OnClickBtn_Time // Native|Protected // @ game+0xa0f1b8
	bool HandleOnLeaveChildSlot(); // Function TslGame.*2dd70133b6.HandleOnLeaveChildSlot // Final|Native|Public // @ game+0x58e6a34
	void RefreshList(); // Function TslGame.*2dd70133b6.RefreshList // Final|Native|Public // @ game+0xd78d18
	bool HandleOnEnterChildSlot(); // Function TslGame.*2dd70133b6.HandleOnEnterChildSlot // Final|Native|Public // @ game+0x58e6800
	void OnEquipmentUpdated(); // Function TslGame.*2dd70133b6.OnEquipmentUpdated // Final|Native|Private // @ game+0xbc625c
	TScriptInterface<struct U*14090ed9d2> OnSlotFocus(); // Function TslGame.*2dd70133b6.OnSlotFocus // Native|Public // @ game+0x8ec694
	bool IsEmptyList(); // Function TslGame.*2dd70133b6.IsEmptyList // Final|Native|Public|BlueprintCallable // @ game+0x58e778c
	void *381aae4916(); // Function TslGame.*2dd70133b6.*381aae4916 // Native|Protected // @ game+0xda3b3c
	void HandleOnDoSlotAction(); // Function TslGame.*2dd70133b6.HandleOnDoSlotAction // Final|Native|Public // @ game+0x58e67e4
	void OnInventoryUpdated(); // Function TslGame.*2dd70133b6.OnInventoryUpdated // Final|Native|Private // @ game+0x58ebfb8
	void OnClickBtn_Type(); // Function TslGame.*2dd70133b6.OnClickBtn_Type // Native|Protected // @ game+0x58e997c
	bool HandleOnLeaveSlot(); // Function TslGame.*2dd70133b6.HandleOnLeaveSlot // Final|Native|Public // @ game+0x58e6b8c
	void OnChangedStackCount(); // Function TslGame.*2dd70133b6.OnChangedStackCount // Final|Native|Protected // @ game+0x58e9710
	void OnRefreshFocus(); // Function TslGame.*2dd70133b6.OnRefreshFocus // Native|Public // @ game+0x58e99a8
	void *1295c6ed0d(); // Function TslGame.*2dd70133b6.*1295c6ed0d // Final|Native|Public // @ game+0x58e4844
	void OnRepCharacterInventory(); // Function TslGame.*2dd70133b6.OnRepCharacterInventory // Final|Native|Private // @ game+0x58eed54
	struct UWidget* *4ce22fd56d(); // Function TslGame.*2dd70133b6.*4ce22fd56d // Final|Native|Public // @ game+0x58eaaa8
	bool HandleOnEnterSlot(); // Function TslGame.*2dd70133b6.HandleOnEnterSlot // Final|Native|Public // @ game+0xc49fa0
};

// Class TslGame.*b83238e389
// Size: 0x730 (Inherited: 0x730)
struct U*b83238e389 : U*2dd70133b6 {
};

// Class TslGame.*5b5ad0e216
// Size: 0x738 (Inherited: 0x730)
struct U*5b5ad0e216 : U*2dd70133b6 {
	char pad_730[0x8]; // 0x730(0x08)
};

// Class TslGame.*f6a731ef02
// Size: 0xac0 (Inherited: 0x418)
struct U*f6a731ef02 : U*4bb82286ac {
	char pad_418[0x30]; // 0x418(0x30)
	TScriptInterface<struct U*2c0574111f> *7f2bdaeff6; // 0x448(0x10)
	TScriptInterface<struct U*58dd07ca93> SlotContainer; // 0x458(0x10)
	char pad_468[0x98]; // 0x468(0x98)
	struct FLinearColor DefaultSlotNameColor; // 0x500(0x10)
	struct FLinearColor DisabledSlotNameColor; // 0x510(0x10)
	char pad_520[0x50]; // 0x520(0x50)
	struct F*54c30817ee *792fa9d519; // 0x570(0x20)
	struct F*54c30817ee *26bddc1c1c; // 0x590(0x20)
	struct F*aecf96cb1e *e6705c399c; // 0x5b0(0x28)
	struct F*a8249d5e73 *12945a90a8; // 0x5d8(0x30)
	struct F*aecf96cb1e *afc1f2fe6c; // 0x608(0x28)
	struct F*62d95f3263 *2a09761b74; // 0x630(0x20)
	struct F*54c30817ee *78b0db5494; // 0x650(0x20)
	struct F*aecf96cb1e *7d8abfbb79; // 0x670(0x28)
	struct F*aecf96cb1e *b3ede13613; // 0x698(0x28)
	struct F*54c30817ee *fefbc32ab3; // 0x6c0(0x20)
	struct F*aecf96cb1e *5730018917; // 0x6e0(0x28)
	struct F*aecf96cb1e *05899a6cd4; // 0x708(0x28)
	struct F*7b33ced057 *89f1140ae0; // 0x730(0x28)
	struct F*54c30817ee *d7cd965941; // 0x758(0x20)
	struct F*62d95f3263 *4f7a71c9c1; // 0x778(0x20)
	struct F*62d95f3263 *931dc47501; // 0x798(0x20)
	struct F*62d95f3263 *a628c04ccd; // 0x7b8(0x20)
	struct F*3cdda95245 *1750282429; // 0x7d8(0x28)
	struct F*62d95f3263 *10297580f0; // 0x800(0x20)
	struct F*a8249d5e73 *135789e8ab; // 0x820(0x30)
	struct F*aecf96cb1e *e858b14785; // 0x850(0x28)
	struct F*62d95f3263 *e86224883c; // 0x878(0x20)
	struct F*c0b2c1bc8a *f710333f5f; // 0x898(0x28)
	struct F*c0b2c1bc8a *150eef3dfb; // 0x8c0(0x28)
	struct F*3cdda95245 *b8d1271c82; // 0x8e8(0x28)
	struct F*54c30817ee *6fc3d5bb55; // 0x910(0x20)
	struct F*aecf96cb1e *5d85549e58; // 0x930(0x28)
	struct F*62d95f3263 *98f7092dd6; // 0x958(0x20)
	struct UClass* *542c204bdb; // 0x978(0x08)
	struct UTexture2D* SelectTexture; // 0x980(0x08)
	struct UTexture2D* FocusTexture; // 0x988(0x08)
	struct UTexture2D* LinkTexture; // 0x990(0x08)
	struct UTexture2D* NormalTexture; // 0x998(0x08)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x9a0(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x9b0(0x10)
	bool *4dd874eae9; // 0x9c0(0x01)
	bool *1292870dc7; // 0x9c1(0x01)
	bool *d2859fe40f; // 0x9c2(0x01)
	char pad_9C3[0x5]; // 0x9c3(0x05)
	struct UEquipableItem* EquipableItem; // 0x9c8(0x08)
	struct UMaterialInstanceDynamic* *8f683b7205; // 0x9d0(0x08)
	struct UItem* *ac92103267; // 0x9d8(0x08)
	struct UMaterialInstanceDynamic* *9062e51fbf; // 0x9e0(0x08)
	struct UProgressBar* CastingProgressBar; // 0x9e8(0x08)
	struct AInventory* *c69a5f6019; // 0x9f0(0x08)
	struct UCastComponent* *7771a3cc7b; // 0x9f8(0x08)
	struct UMaterialInstanceDynamic* *7e456c0bd9; // 0xa00(0x08)
	struct UMaterialInstanceDynamic* *c37f79b89c; // 0xa08(0x08)
	struct ATslCharacter* TslCharacter; // 0xa10(0x08)
	struct UTexture* Tex; // 0xa18(0x08)
	struct UImage* *83a669756a; // 0xa20(0x08)
	struct U*79e4fe9303* *78f8952782; // 0xa28(0x08)
	struct UItemToolTipWidget* *472b5853d5; // 0xa30(0x08)
	struct F*20816e90ed *99befe6701; // 0xa38(0x78)
	struct UImage* TuningTag; // 0xab0(0x08)
	struct UImage* SellableTag; // 0xab8(0x08)

	void OnChangedStackCount(); // Function TslGame.*f6a731ef02.OnChangedStackCount // Final|Native|Protected // @ game+0x58e972c
	bool BroadCastSlotLeave(); // Function TslGame.*f6a731ef02.BroadCastSlotLeave // Final|Native|Protected // @ game+0x58e29e0
	void DispatchRefreshInnerList(); // Function TslGame.*f6a731ef02.DispatchRefreshInnerList // Final|Native|Protected // @ game+0x58e4b4c
	TScriptInterface<struct U*14090ed9d2> BroadCastSlotFocus(); // Function TslGame.*f6a731ef02.BroadCastSlotFocus // Final|Native|Protected // @ game+0x58e286c
	bool BroadCastSlotEnter(); // Function TslGame.*f6a731ef02.BroadCastSlotEnter // Final|Native|Protected // @ game+0x58e2714
};

// Class TslGame.*caa140c2d7
// Size: 0xac8 (Inherited: 0xac0)
struct U*caa140c2d7 : U*f6a731ef02 {
	struct U*c45865bc05* RadioMessage; // 0xac0(0x08)
};

// Class TslGame.*a3ea698835
// Size: 0xb30 (Inherited: 0xac0)
struct U*a3ea698835 : U*f6a731ef02 {
	struct U*c0c5b25d31* UserNickNamePlatformImageWidget; // 0xac0(0x08)
	struct F*0c033c3537 *b7895977cb; // 0xac8(0x28)
	float *c85d6f9b5c; // 0xaf0(0x04)
	float *a68366c3b8; // 0xaf4(0x04)
	float *b41122ffbd; // 0xaf8(0x04)
	char pad_AFC[0x2c]; // 0xafc(0x2c)
	struct UProgressBar* Pgb_Durability; // 0xb28(0x08)

	void OnInputXPressed(); // Function TslGame.*a3ea698835.OnInputXPressed // Final|Native|Protected // @ game+0x8f0af4
	void OnInputBPressed(); // Function TslGame.*a3ea698835.OnInputBPressed // Final|Native|Protected // @ game+0x8f0a48
	void OnInputAReleased(); // Function TslGame.*a3ea698835.OnInputAReleased // Final|Native|Protected // @ game+0x8f0c28
	void SelfPutState(); // Function TslGame.*a3ea698835.SelfPutState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void LinkState(); // Function TslGame.*a3ea698835.LinkState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void FocusState(); // Function TslGame.*a3ea698835.FocusState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnInputYPressed(); // Function TslGame.*a3ea698835.OnInputYPressed // Final|Native|Protected // @ game+0x58ebf68
	void OnInputYReleased(); // Function TslGame.*a3ea698835.OnInputYReleased // Final|Native|Protected // @ game+0x58ebf7c
	void NormalState(); // Function TslGame.*a3ea698835.NormalState // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnInputLThumbReleased(); // Function TslGame.*a3ea698835.OnInputLThumbReleased // Final|Native|Protected // @ game+0x58ebf18
	void OnInputLThumbPressed(); // Function TslGame.*a3ea698835.OnInputLThumbPressed // Final|Native|Protected // @ game+0x58ebef0
	void OnInputAPressed(); // Function TslGame.*a3ea698835.OnInputAPressed // Final|Native|Protected // @ game+0x8f0bd0
	void *bc94d5b901(); // Function TslGame.*a3ea698835.*bc94d5b901 // Final|Native|Protected // @ game+0x58ebf48
	void OnInputXReleased(); // Function TslGame.*a3ea698835.OnInputXReleased // Final|Native|Protected // @ game+0x8f0b58
};

// Class TslGame.*66c1c1b33c
// Size: 0xae0 (Inherited: 0xac8)
struct U*66c1c1b33c : U*caa140c2d7 {
	struct UImage* ImageNotifyMarker; // 0xac8(0x08)
	struct UButton* ButtonSale; // 0xad0(0x08)
	struct U*c2c78a4d50* NotifyItem; // 0xad8(0x08)

	void OnSaleButtonClicked(); // Function TslGame.*66c1c1b33c.OnSaleButtonClicked // Final|Native|Protected // @ game+0x58ef6d4
};

// Class TslGame.*4dfb1814cc
// Size: 0xb40 (Inherited: 0xb30)
struct U*4dfb1814cc : U*a3ea698835 {
	struct UImage* ImageNotifyMarker; // 0xb30(0x08)
	struct U*c2c78a4d50* NotifyItem; // 0xb38(0x08)
};

// Class TslGame.*ce4c1b46e4
// Size: 0xb28 (Inherited: 0xac8)
struct U*ce4c1b46e4 : U*caa140c2d7 {
	struct UBorder* HoverBorder; // 0xac8(0x08)
	struct UWidget* CapacityLayer; // 0xad0(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xad8(0x08)
	struct UTextBlock* MaxCapacityText; // 0xae0(0x08)
	struct FLinearColor TrunkDragEnterColor; // 0xae8(0x10)
	struct FLinearColor TrunkDragLeaveColor; // 0xaf8(0x10)
	struct FLinearColor TrunkEmptyTextColor; // 0xb08(0x10)
	struct UTexture2D* emptytexture; // 0xb18(0x08)
	char pad_B20[0x8]; // 0xb20(0x08)
};

// Class TslGame.*54f9fd9395
// Size: 0xb70 (Inherited: 0xb30)
struct U*54f9fd9395 : U*a3ea698835 {
	struct UVerticalBox* CategoryAndCapacityBox; // 0xb30(0x08)
	struct UImage* Img_IconBg; // 0xb38(0x08)
	struct UGridPanel* IconGrp; // 0xb40(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xb48(0x08)
	struct UTextBlock* MaxCapacityText; // 0xb50(0x08)
	struct FLinearColor TrunkEmptyTextColor; // 0xb58(0x10)
	char pad_B68[0x8]; // 0xb68(0x08)
};

// Class TslGame.*166ccbf7ba
// Size: 0x490 (Inherited: 0x418)
struct U*166ccbf7ba : U*4bb82286ac {
	struct F*13fd1d29ec KeysPanel_Binder; // 0x418(0x20)
	struct FKey CtrlUnrealKey; // 0x438(0x18)
	struct FKey AltUnrealKey; // 0x450(0x18)
	struct FKey ShiftUnrealKey; // 0x468(0x18)
	struct TArray<struct U*fe18134728*> *e5da26ab7a; // 0x480(0x10)
};

// Class TslGame.*e50532558a
// Size: 0x480 (Inherited: 0x418)
struct U*e50532558a : U*4bb82286ac {
	struct F*62d95f3263 DescriptionTextBlock_Binder; // 0x418(0x20)
	struct F*0c033c3537 KeyImageHorizontalBox; // 0x438(0x28)
	struct F*62d95f3263 DebugTextBlock_Binder; // 0x460(0x20)
};

// Class TslGame.TslKeyHintContentWidget
// Size: 0x528 (Inherited: 0x418)
struct UTslKeyHintContentWidget : U*4bb82286ac {
	struct UClass* KeyImageWidgetClass; // 0x418(0x08)
	struct FMargin KeyIconPadding; // 0x420(0x10)
	float KeyIconDesiredHeight; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UHorizontalBox* KeyImagePanel; // 0x438(0x08)
	struct UTextBlock* InputModeText; // 0x440(0x08)
	struct U*191926b023* DisplayNameFlowText; // 0x448(0x08)
	struct TArray<struct U*e1d96b45f6*> *b81928534e; // 0x450(0x10)
	struct F*1ef0b369f2 *1ff68193bc; // 0x460(0xb0)
	char pad_510[0x18]; // 0x510(0x18)
};

// Class TslGame.*d71df75c49
// Size: 0x560 (Inherited: 0x528)
struct U*d71df75c49 : UTslKeyHintContentWidget {
	struct UTexture2D* *8f8463913d; // 0x528(0x08)
	struct FText *fc36759cfe; // 0x530(0x18)
	struct FText *322cf90937; // 0x548(0x18)
};

// Class TslGame.*fa45ca4d1e
// Size: 0x560 (Inherited: 0x528)
struct U*fa45ca4d1e : UTslKeyHintContentWidget {
	struct FName DummyActionName_Aim; // 0x528(0x08)
	struct FName DummyActionName_ADS; // 0x530(0x08)
	struct FName ActionName_Targeting; // 0x538(0x08)
	struct FName ActionName_Aim; // 0x540(0x08)
	struct FText HoldText; // 0x548(0x18)
};

// Class TslGame.*a7b1c1a597
// Size: 0x528 (Inherited: 0x528)
struct U*a7b1c1a597 : UTslKeyHintContentWidget {
};

// Class TslGame.*6071beb07a
// Size: 0x468 (Inherited: 0x418)
struct U*6071beb07a : U*4bb82286ac {
	enum class EKeyHintType KeyHintType; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UClass* *a72a5b6f2c; // 0x420(0x08)
	struct F*54c30817ee *32208fda55; // 0x428(0x20)
	struct F*a2a8693a5f *8d23f5e581; // 0x448(0x20)
};

// Class TslGame.*a4d9fdad9a
// Size: 0x4c0 (Inherited: 0x418)
struct U*a4d9fdad9a : U*4bb82286ac {
	struct UDataTable* KeyHintDataTable; // 0x418(0x08)
	struct UDataTable* KeyHintInfoDataTable; // 0x420(0x08)
	struct UDataTable* KeyHintTableCheckerSetDataTable; // 0x428(0x08)
	struct UClass* ContentWidgetClass; // 0x430(0x08)
	struct FMargin KeyHintContentPadding; // 0x438(0x10)
	struct TArray<struct FName> DisabledGameModes; // 0x448(0x10)
	struct UVerticalBox* PanelA; // 0x458(0x08)
	struct UVerticalBox* PanelB; // 0x460(0x08)
	struct UInvalidationBox* InvalidationBox; // 0x468(0x08)
	struct U*9c8bfa0aee* AnimationOnChangeHint; // 0x470(0x08)
	struct TArray<struct F*4b37494377> *651f7ea184; // 0x478(0x10)
	char pad_488[0x10]; // 0x488(0x10)
	struct TArray<struct UTslKeyHintContentWidget*> *2e2b843622; // 0x498(0x10)
	char pad_4A8[0x18]; // 0x4a8(0x18)

	void OnNotifyUpdateKeyHint(); // Function TslGame.*a4d9fdad9a.OnNotifyUpdateKeyHint // Final|Native|Private // @ game+0xbff21c
	void OnGameUserSettingApplied(); // Function TslGame.*a4d9fdad9a.OnGameUserSettingApplied // Native|Protected // @ game+0x58e9478
	void UpdateSelfPosition(); // Function TslGame.*a4d9fdad9a.UpdateSelfPosition // Final|Native|Protected // @ game+0x9266ec
};

// Class TslGame.*2ee8494057
// Size: 0x4c0 (Inherited: 0x4c0)
struct U*2ee8494057 : U*a4d9fdad9a {
};

// Class TslGame.*7d51e02db2
// Size: 0x4c0 (Inherited: 0x4c0)
struct U*7d51e02db2 : U*a4d9fdad9a {
};

// Class TslGame.*71e09cc609
// Size: 0x440 (Inherited: 0x418)
struct U*71e09cc609 : U*4bb82286ac {
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x418(0x08)
	struct USizeBox* KeyHint_SizeBox; // 0x420(0x08)
	float *660d56bcf0; // 0x428(0x04)
	float *154c5d7810; // 0x42c(0x04)
	float *b132d2ab4f; // 0x430(0x04)
	char pad_434[0xc]; // 0x434(0x0c)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*71e09cc609.UpdatePositionOnMinimapExtended // Final|Native|Protected // @ game+0x58fac24
};

// Class TslGame.*38b633fc41
// Size: 0x450 (Inherited: 0x440)
struct U*38b633fc41 : U*71e09cc609 {
	struct FName ActionName; // 0x440(0x08)
	struct U*153e035a86* KeyImage; // 0x448(0x08)

	void UpdateKeyImage(); // Function TslGame.*38b633fc41.UpdateKeyImage // Final|Native|Protected // @ game+0x58fa8dc
};

// Class TslGame.*8fd33d198d
// Size: 0x498 (Inherited: 0x440)
struct U*8fd33d198d : U*71e09cc609 {
	struct UVerticalBox* KeyHint_VerticalBox_Console; // 0x440(0x08)
	struct UVerticalBox* KeyHint_VerticalBox_Pc; // 0x448(0x08)
	struct TArray<struct F*eaa1013eb6> *21608576bc; // 0x450(0x10)
	struct TArray<struct F*eaa1013eb6> *06385f5646; // 0x460(0x10)
	char pad_470[0x28]; // 0x470(0x28)
};

// Class TslGame.*46bbfa4c1d
// Size: 0x4a8 (Inherited: 0x498)
struct U*46bbfa4c1d : U*8fd33d198d {
	char pad_498[0x10]; // 0x498(0x10)
};

// Class TslGame.*b34ffd125f
// Size: 0x450 (Inherited: 0x450)
struct U*b34ffd125f : U*38b633fc41 {
};

// Class TslGame.*5830ab9600
// Size: 0x4b8 (Inherited: 0x418)
struct U*5830ab9600 : U*4bb82286ac {
	struct FMulticastDelegate OnKeyReceived; // 0x418(0x10)
	struct FTslInputKey OriginKey; // 0x428(0x20)
	struct FKey FirstDownKey; // 0x448(0x18)
	struct FTslInputKey CurrentDownKey; // 0x460(0x20)
	struct FTslInputKey LastDownedKey; // 0x480(0x20)
	bool bFocused; // 0x4a0(0x01)
	bool bEnableInput; // 0x4a1(0x01)
	bool bIsKeyUp; // 0x4a2(0x01)
	bool bAxisInput; // 0x4a3(0x01)
	float AxisScale; // 0x4a4(0x04)
	struct TArray<struct FKey> MouseButtons; // 0x4a8(0x10)

	bool IsInputKeyDown(); // Function TslGame.*5830ab9600.IsInputKeyDown // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x58e77f4
	struct FKey UpdateKeyDown(); // Function TslGame.*5830ab9600.UpdateKeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x58fa7f8
	struct FKey KeyDown(); // Function TslGame.*5830ab9600.KeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x58e7888
	struct FKey KeyUp(); // Function TslGame.*5830ab9600.KeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x58e796c
	struct FKey UpdateKeyUp(); // Function TslGame.*5830ab9600.UpdateKeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x58fa8f0
	struct FText GetLastDownedKeyName(); // Function TslGame.*5830ab9600.GetLastDownedKeyName // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x58e59ac
};

// Class TslGame.*fe18134728
// Size: 0x550 (Inherited: 0x418)
struct U*fe18134728 : U*4bb82286ac {
	struct FString KeyName; // 0x418(0x10)
	struct FKey MatchingUnrealKey; // 0x428(0x18)
	struct FSlateFontInfo KeyNameFont; // 0x440(0x68)
	enum class EVerticalAlignment KeyNameVerticalAlignment; // 0x4a8(0x01)
	enum class EHorizontalAlignment KeyNameHorizontalAlignment; // 0x4a9(0x01)
	enum class ETextJustify KeyNameJustification; // 0x4aa(0x01)
	char pad_4AB[0x1]; // 0x4ab(0x01)
	float KeyNameWrapTextAt; // 0x4ac(0x04)
	struct FLinearColor NonSelectedBorderColor; // 0x4b0(0x10)
	struct FLinearColor SelectedBorderColor; // 0x4c0(0x10)
	struct FLinearColor NonSelectedTextColor; // 0x4d0(0x10)
	struct FLinearColor SelectedTextColor; // 0x4e0(0x10)
	struct UTexture2D* SelectedKeyBorderImage; // 0x4f0(0x08)
	struct UTexture2D* NonSelectedKeyBorderImage; // 0x4f8(0x08)
	bool bSelected; // 0x500(0x01)
	char pad_501[0x7]; // 0x501(0x07)
	struct F*62d95f3263 KeyNameTextBlock_Binder; // 0x508(0x20)
	struct F*aecf96cb1e BorderImage_Binder; // 0x528(0x28)

	bool IsSelected(); // Function TslGame.*fe18134728.IsSelected // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58e7830
	bool SetSelected(); // Function TslGame.*fe18134728.SetSelected // Final|Native|Public|BlueprintCallable // @ game+0x58f8988
};

// Class TslGame.*1d3b2e2283
// Size: 0x488 (Inherited: 0x418)
struct U*1d3b2e2283 : U*4bb82286ac {
	struct F*54c30817ee *12fbb421ff; // 0x418(0x20)
	struct F*54c30817ee *4fa378fc9d; // 0x438(0x20)
	struct F*62d95f3263 *9b0f39c2d3; // 0x458(0x20)
	DelegateProperty PopupButtonEvent; // 0x478(0x10)

	DelegateProperty SetPopupWidget(); // Function TslGame.*1d3b2e2283.SetPopupWidget // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58f8440
	void OnClickedYesButton(); // Function TslGame.*1d3b2e2283.OnClickedYesButton // Final|Native|Private // @ game+0x58e9b1c
	void OnClickedNoButtion(); // Function TslGame.*1d3b2e2283.OnClickedNoButtion // Final|Native|Private // @ game+0x58e9a94
};

// Class TslGame.*07d0a8b0ec
// Size: 0x438 (Inherited: 0x418)
struct U*07d0a8b0ec : U*4bb82286ac {
	struct F*a2a8693a5f *9eb1320316; // 0x418(0x20)
};

// Class TslGame.*48ca7fe482
// Size: 0x430 (Inherited: 0x418)
struct U*48ca7fe482 : U*4bb82286ac {
	float *e086a17eaa; // 0x418(0x04)
	float *22e2dc35fc; // 0x41c(0x04)
	struct U*8fc238d518* UI_KillMessageTextBorderWidget; // 0x420(0x08)
	struct U*824467a3d5* UI_KillMessageCounterWidget; // 0x428(0x08)
};

// Class TslGame.*824467a3d5
// Size: 0x4f0 (Inherited: 0x418)
struct U*824467a3d5 : U*4bb82286ac {
	struct UBorder* TeamKillBorder; // 0x418(0x08)
	struct UBorder* KillCounterBorder; // 0x420(0x08)
	struct UBorder* AssistCounterBorder; // 0x428(0x08)
	struct UScaleBox* AssistCounterScaleBox; // 0x430(0x08)
	struct UTextBlock* KillCurrentCount; // 0x438(0x08)
	struct UTextBlock* KillNextCount; // 0x440(0x08)
	struct UTextBlock* AssistCurrentCount; // 0x448(0x08)
	struct UTextBlock* AssistNextCount; // 0x450(0x08)
	struct UWidgetSwitcher* KillTextSwitcher; // 0x458(0x08)
	struct UWidgetSwitcher* AssistTextSwitcher; // 0x460(0x08)
	struct U*9c8bfa0aee* KillCountUpEffect; // 0x468(0x08)
	struct U*9c8bfa0aee* KillCountUpNoEffect; // 0x470(0x08)
	struct U*9c8bfa0aee* AssistCountUp; // 0x478(0x08)
	struct U*9c8bfa0aee* KillFadeInEffect; // 0x480(0x08)
	struct U*9c8bfa0aee* KillFadeInNoEffect; // 0x488(0x08)
	struct U*9c8bfa0aee* KillFadeInEffectWithoutAssistAnim; // 0x490(0x08)
	struct U*9c8bfa0aee* KillFadeInNoEffectWithoutAssistAnim; // 0x498(0x08)
	struct U*9c8bfa0aee* AssistFadeIn; // 0x4a0(0x08)
	struct U*9c8bfa0aee* FadeInit; // 0x4a8(0x08)
	struct U*9c8bfa0aee* CountInit; // 0x4b0(0x08)
	struct U*9c8bfa0aee* FadeOutAnim; // 0x4b8(0x08)
	float *5adddcd123; // 0x4c0(0x04)
	struct FVector2D *1728d986f6; // 0x4c4(0x08)
	float *fff19fc6e8; // 0x4cc(0x04)
	struct FVector2D *351fb3b5da; // 0x4d0(0x08)
	char pad_4D8[0x18]; // 0x4d8(0x18)
};

// Class TslGame.*f4f9b1bc9b
// Size: 0x498 (Inherited: 0x418)
struct U*f4f9b1bc9b : U*4bb82286ac {
	struct UClass* *0eff228407; // 0x418(0x08)
	struct UClass* *874ee99be8; // 0x420(0x08)
	struct F*45518ccbeb *f9a6a6cec1; // 0x428(0x20)
	struct U*86314f4349* IconOtherKillMessage; // 0x448(0x08)
	struct F*45518ccbeb *50761cc16f; // 0x450(0x20)
	struct U*48ca7fe482* *9cd01bc4ef; // 0x470(0x08)
	float *5f2fbb8259; // 0x478(0x04)
	float *81b4ab6391; // 0x47c(0x04)
	struct TArray<struct FDeathMessage> *b7089edafe; // 0x480(0x10)
	char pad_490[0x8]; // 0x490(0x08)

	struct FDeathMessage PushAssistMessage(); // Function TslGame.*f4f9b1bc9b.PushAssistMessage // Final|Native|Private|HasOutParms // @ game+0x58f3dd0
	struct FDeathMessage OnDisplayKilledMessage(); // Function TslGame.*f4f9b1bc9b.OnDisplayKilledMessage // Final|Native|Private|HasOutParms // @ game+0x5d6950
};

// Class TslGame.*86314f4349
// Size: 0x468 (Inherited: 0x418)
struct U*86314f4349 : U*4bb82286ac {
	struct UClass* *ca3b001880; // 0x418(0x08)
	struct F*c0b2c1bc8a *6f152b1748; // 0x420(0x28)
	struct TArray<struct U*2c00af5318*> FreeMessageWidgets; // 0x448(0x10)
	float *b44acc60fa; // 0x458(0x04)
	bool *cbb3f6f780; // 0x45c(0x01)
	bool *26c58d7c27; // 0x45d(0x01)
	char pad_45E[0x2]; // 0x45e(0x02)
	float *e377eb8f07; // 0x460(0x04)
	int32 *e6b3b013b8; // 0x464(0x04)

	struct FDeathMessage EnqueueDeathMessage(); // Function TslGame.*86314f4349.EnqueueDeathMessage // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58e5290
	int32 TrimKillMessageWidgetArrayByNumLimit(); // Function TslGame.*86314f4349.TrimKillMessageWidgetArrayByNumLimit // Final|Native|Public|BlueprintCallable // @ game+0x58f9ad0
	struct UWidget* OnVanishFinished(); // Function TslGame.*86314f4349.OnVanishFinished // Final|Native|Public // @ game+0xba8bb0
	struct UClass* SetKillMessageWidgetClass(); // Function TslGame.*86314f4349.SetKillMessageWidgetClass // Final|Native|Public|BlueprintCallable // @ game+0x58f7ba0
	int32 ReserveMessageWidgetPool(); // Function TslGame.*86314f4349.ReserveMessageWidgetPool // Final|Native|Public|BlueprintCallable // @ game+0x58f4398
	void OnListSizeLimitChange(); // Function TslGame.*86314f4349.OnListSizeLimitChange // Final|Native|Private // @ game+0x58ec6a8
};

// Class TslGame.*8fc238d518
// Size: 0x438 (Inherited: 0x418)
struct U*8fc238d518 : U*4bb82286ac {
	struct UGridPanel* KillMessageGrid; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)
};

// Class TslGame.*fbaa8d76ff
// Size: 0x4f0 (Inherited: 0x418)
struct U*fbaa8d76ff : U*4bb82286ac {
	struct U*9c8bfa0aee* FadeInAnim; // 0x418(0x08)
	struct U*9c8bfa0aee* Transition1to2; // 0x420(0x08)
	struct U*9c8bfa0aee* Transition2to3; // 0x428(0x08)
	struct U*9c8bfa0aee* Transition3to4; // 0x430(0x08)
	struct U*9c8bfa0aee* Transition4to5; // 0x438(0x08)
	struct U*9c8bfa0aee* FadeOutAnim; // 0x440(0x08)
	struct U*9c8bfa0aee* InitAnim; // 0x448(0x08)
	struct U*c0c5b25d31* Player1Platform; // 0x450(0x08)
	struct UTslRichTextBlock* KillMsgBlock; // 0x458(0x08)
	struct U*c0c5b25d31* Player2Platform; // 0x460(0x08)
	struct UTslRichTextBlock* KillMsgBlock2; // 0x468(0x08)
	struct TMap<struct FName, struct FLinearColor> *7c8f2cf682; // 0x470(0x50)
	char pad_4C0[0x30]; // 0x4c0(0x30)
};

// Class TslGame.*2c00af5318
// Size: 0x510 (Inherited: 0x418)
struct U*2c00af5318 : U*4bb82286ac {
	struct FMulticastDelegate OnVanishFinished; // 0x418(0x10)
	struct TArray<struct F*3ae64ecf1d> *18aedd3c73; // 0x428(0x10)
	struct TArray<struct F*6f26a7cb89> *881e524a83; // 0x438(0x10)
	struct TArray<struct UTexture*> WeaponMasteryLevelIcons; // 0x448(0x10)
	struct F*45518ccbeb *3502233198; // 0x458(0x20)
	struct F*45518ccbeb *c23c5f5c92; // 0x478(0x20)
	struct USizeBox* KillMessageSizebox; // 0x498(0x08)
	struct FText PlayZoneText; // 0x4a0(0x18)
	struct FText RedZoneText; // 0x4b8(0x18)
	struct FText *d65731ba46; // 0x4d0(0x18)
	struct FText *ec87457168; // 0x4e8(0x18)
	char pad_500[0x10]; // 0x500(0x10)

	float SetVanishTimer(); // Function TslGame.*2c00af5318.SetVanishTimer // Final|Native|Public // @ game+0x5a25e04
	int32 SetFontStyleAndSize(); // Function TslGame.*2c00af5318.SetFontStyleAndSize // Final|Native|Protected // @ game+0x5a24bfc
	void *cfd35815d0(); // Function TslGame.*2c00af5318.*cfd35815d0 // Final|Native|Protected // @ game+0x5a2746c
	void *2a79574a02(); // Function TslGame.*2c00af5318.*2a79574a02 // Final|Native|Protected // @ game+0x58ed5c8
	struct FName GetTextureFromDamageTypeCategory(); // Function TslGame.*2c00af5318.GetTextureFromDamageTypeCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5a13958
	float GetTextureFromConditionOfDeathCategory(); // Function TslGame.*2c00af5318.GetTextureFromConditionOfDeathCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5a13678
};

// Class TslGame.*02d754e93e
// Size: 0x630 (Inherited: 0x510)
struct U*02d754e93e : U*2c00af5318 {
	struct FLinearColor NormalColor; // 0x510(0x10)
	struct FLinearColor *bcb7a55efa; // 0x520(0x10)
	struct FLinearColor *65e8061d10; // 0x530(0x10)
	struct FLinearColor *8917e306ee; // 0x540(0x10)
	struct FLinearColor *b71af2e56d; // 0x550(0x10)
	struct FLinearColor *d625a49b75; // 0x560(0x10)
	float *f6c0f9dd13; // 0x570(0x04)
	char pad_574[0x4]; // 0x574(0x04)
	struct F*3ae64ecf1d *0ad7daaf00; // 0x578(0x20)
	struct UWidgetSwitcher* BgSwitcher; // 0x598(0x08)
	struct UImage* SkinBgLeft; // 0x5a0(0x08)
	struct UImage* SkinBgRight; // 0x5a8(0x08)
	struct UTextBlock* KillerNameText; // 0x5b0(0x08)
	struct UTextBlock* VictimNameText; // 0x5b8(0x08)
	struct UImage* CauserImage; // 0x5c0(0x08)
	struct USizeBox* CauserSizeBox; // 0x5c8(0x08)
	struct UImage* WeaponMasteryImage; // 0x5d0(0x08)
	struct USizeBox* WeaponMasterySizeBox; // 0x5d8(0x08)
	struct UImage* HeadShotImage; // 0x5e0(0x08)
	struct USizeBox* HeadShotSizeBox; // 0x5e8(0x08)
	struct UImage* ConditionImage; // 0x5f0(0x08)
	struct USizeBox* ConditionSizeBox; // 0x5f8(0x08)
	struct UImage* SkinBgTint; // 0x600(0x08)
	struct TArray<struct UImage*> EffectImages; // 0x608(0x10)
	struct UImage* AdditionalEffect; // 0x618(0x08)
	struct U*5af8770302* KillerIcon; // 0x620(0x08)
	struct U*5af8770302* VictimIcon; // 0x628(0x08)

	struct UTexture2D* *58f418111a(); // Function TslGame.*02d754e93e.*58f418111a // Final|Native|Protected // @ game+0x58e6314
	bool SetLayoutTo(); // Function TslGame.*02d754e93e.SetLayoutTo // Final|Native|Protected // @ game+0x58f7e4c
	struct FLinearColor SetMessageColorAndOpacity(); // Function TslGame.*02d754e93e.SetMessageColorAndOpacity // Final|Native|Protected|HasDefaults // @ game+0x58f800c
};

// Class TslGame.*0c421f281e
// Size: 0x890 (Inherited: 0x510)
struct U*0c421f281e : U*2c00af5318 {
	struct UTexture* *d4743d75b9; // 0x510(0x08)
	struct UTexture* *a595d399db; // 0x518(0x08)
	struct UTexture* *acc7c380b9; // 0x520(0x08)
	struct UTexture* *409bc843d4; // 0x528(0x08)
	struct FLinearColor *2a827192fb; // 0x530(0x10)
	struct FLinearColor *0ce2d5c048; // 0x540(0x10)
	struct F*62d95f3263 *caa7900166; // 0x550(0x20)
	struct F*62d95f3263 *5be036dc1d; // 0x570(0x20)
	struct F*62d95f3263 *0b0f6d3310; // 0x590(0x20)
	struct F*62d95f3263 *bdbc1781c6; // 0x5b0(0x20)
	struct F*62d95f3263 *69646f9ab9; // 0x5d0(0x20)
	struct F*62d95f3263 *a76755ac09; // 0x5f0(0x20)
	struct F*7b33ced057 *b75985d081; // 0x610(0x28)
	struct F*aecf96cb1e *0ef3077eef; // 0x638(0x28)
	struct F*aecf96cb1e *56044fe361; // 0x660(0x28)
	struct F*aecf96cb1e *8e553254ef; // 0x688(0x28)
	struct F*7b33ced057 *d38de68c8b; // 0x6b0(0x28)
	struct F*aecf96cb1e *1251b4b57f; // 0x6d8(0x28)
	struct F*aecf96cb1e *8d12ebd8b7; // 0x700(0x28)
	struct F*aecf96cb1e *a10af76c7c; // 0x728(0x28)
	struct F*aecf96cb1e *451409ad60; // 0x750(0x28)
	struct F*3cdda95245 *bf35c4ccc7; // 0x778(0x28)
	struct F*3cdda95245 *fe8ffff538; // 0x7a0(0x28)
	struct F*3cdda95245 *f1746da98a; // 0x7c8(0x28)
	struct F*aecf96cb1e *9713dc330e; // 0x7f0(0x28)
	struct F*a8249d5e73 *ebc8ebb1c6; // 0x818(0x30)
	struct F*0c033c3537 *7e92272044; // 0x848(0x28)
	struct F*a2a8693a5f *8ea9fe46bb; // 0x870(0x20)

	struct UTexture* *8ebc3dc802(); // Function TslGame.*0c421f281e.*8ebc3dc802 // Final|Native|Private // @ game+0x58e6024
	bool SetLayoutTo(); // Function TslGame.*0c421f281e.SetLayoutTo // Final|Native|Private // @ game+0x58f7ee0
	struct FLinearColor SetVictimMessageColorAndOpacity(); // Function TslGame.*0c421f281e.SetVictimMessageColorAndOpacity // Final|Native|Private|HasDefaults // @ game+0x58f8fa0
};

// Class TslGame.*5d017a6412
// Size: 0x490 (Inherited: 0x418)
struct U*5d017a6412 : U*4bb82286ac {
	struct TMap<enum class ELoadingScreenType, struct UTexture2D*> DefaultBackgroundsByType; // 0x418(0x50)
	struct UDataTable* LoadingScreenImageDataTable; // 0x468(0x08)
	struct UTexture2D* *5bc0759b3b; // 0x470(0x20)

	struct FLinearColor OnUpdate(); // Function TslGame.*5d017a6412.OnUpdate // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*306a4b8d9e
// Size: 0x428 (Inherited: 0x418)
struct U*306a4b8d9e : U*4bb82286ac {
	struct USizeBox* LoadingSpinnerSizeBox; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void ShowSpinner(); // Function TslGame.*306a4b8d9e.ShowSpinner // Final|Native|Protected // @ game+0x58f95d8
};

// Class TslGame.*6ce4df5995
// Size: 0x460 (Inherited: 0x418)
struct U*6ce4df5995 : U*4bb82286ac {
	struct UClass* LobbyNameNameTagWidgetClass; // 0x418(0x08)
	struct F*a159aaccd9 *ad914d8ba7; // 0x420(0x28)
	bool bUseNameTagOffsetTranslations; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
	struct TArray<struct FVector> NameTagOffsetTranslations; // 0x450(0x10)

	int32 ResetNameTagWidget_Internal(); // Function TslGame.*6ce4df5995.ResetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x58f461c
	struct U*dbd5d5e4b4* GetNameTagWidget_Internal(); // Function TslGame.*6ce4df5995.GetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x58e5bd0
	int32 UpdateNameTagWidget_Internal(); // Function TslGame.*6ce4df5995.UpdateNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x58faa78
	int32 SetNameTagWidget_Internal(); // Function TslGame.*6ce4df5995.SetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x58f80b8
};

// Class TslGame.*dbd5d5e4b4
// Size: 0x4c8 (Inherited: 0x418)
struct U*dbd5d5e4b4 : U*4bb82286ac {
	struct UTextBlock* NickNameText; // 0x418(0x08)
	struct U*c0c5b25d31* UserPlatformImageWidget; // 0x420(0x08)
	struct U*1575e3d436* RankEmblemWidget; // 0x428(0x08)
	struct UWidgetSwitcher* VoiceSwitcher; // 0x430(0x08)
	struct USizeBox* VoiceSizeBox; // 0x438(0x08)
	struct USizeBox* HostSizeBox; // 0x440(0x08)
	struct USizeBox* SizeBoxForStatus; // 0x448(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x450(0x08)
	struct USizeBox* SizeBoxForMiddle; // 0x458(0x08)
	struct U*17f281c716* Clanplate; // 0x460(0x08)
	bool *fc68e5c583; // 0x468(0x01)
	bool bHideIfAlone; // 0x469(0x01)
	bool bHideStateIconIfAlone; // 0x46a(0x01)
	bool bHideIdleStateIcon; // 0x46b(0x01)
	struct FVector RankNameTagOffsetTranslations; // 0x46c(0x0c)
	char pad_478[0x4]; // 0x478(0x04)
	int32 SlotIndex; // 0x47c(0x04)
	struct FName NameTagSocketName; // 0x480(0x08)
	struct FVector NameTagOffsetTranslation; // 0x488(0x0c)
	bool bIsHost; // 0x494(0x01)
	bool bIsReady; // 0x495(0x01)
	bool bIsSpeaking; // 0x496(0x01)
	bool bIsLogout; // 0x497(0x01)
	struct FString Nickname; // 0x498(0x10)
	struct FString ClanTag; // 0x4a8(0x10)
	struct FString ClanplateId; // 0x4b8(0x10)

	bool SetSpeaking(); // Function TslGame.*dbd5d5e4b4.SetSpeaking // Final|Native|Private // @ game+0x58f8cc4
	struct FString SetNickNameAndClanTag(); // Function TslGame.*dbd5d5e4b4.SetNickNameAndClanTag // Final|Native|Public|BlueprintCallable // @ game+0x58f8148
	enum class EOutGamePlatformProvider InitWidget(); // Function TslGame.*dbd5d5e4b4.InitWidget // Final|Native|Public|BlueprintCallable // @ game+0x58e7304
	struct FVector SetOffsetTranslation(); // Function TslGame.*dbd5d5e4b4.SetOffsetTranslation // Final|Native|Public|HasOutParms|HasDefaults // @ game+0x58f8308
	void OnTeamVoiceChannelLeave(); // Function TslGame.*dbd5d5e4b4.OnTeamVoiceChannelLeave // Final|Native|Public // @ game+0x58f0bc0
	bool SetHost(); // Function TslGame.*dbd5d5e4b4.SetHost // Final|Native|Private // @ game+0xd98b94
	int32 SetRankEmblem(); // Function TslGame.*dbd5d5e4b4.SetRankEmblem // Final|Native|Private // @ game+0x58f8740
	bool SetReady(); // Function TslGame.*dbd5d5e4b4.SetReady // Final|Native|Private // @ game+0xce5a34
	void UpdateWidgetsVisibilities(); // Function TslGame.*dbd5d5e4b4.UpdateWidgetsVisibilities // Final|Native|Public|BlueprintCallable // @ game+0x58fb768
	bool *50b49d91f4(); // Function TslGame.*dbd5d5e4b4.*50b49d91f4 // Final|Native|Private|Const // @ game+0x58e7708
	enum class EOutGamePlatformProvider SetPlatformIcon(); // Function TslGame.*dbd5d5e4b4.SetPlatformIcon // Final|Native|Private // @ game+0x58f83b0
	void UpdateNickNameAndClanName(); // Function TslGame.*dbd5d5e4b4.UpdateNickNameAndClanName // Final|Native|Public|BlueprintCallable // @ game+0x58fab08
	void SetBinding(); // Function TslGame.*dbd5d5e4b4.SetBinding // Final|Native|Private // @ game+0x58f7300
	bool OnParticipantMuteChanged(); // Function TslGame.*dbd5d5e4b4.OnParticipantMuteChanged // Final|Native|Protected // @ game+0x58ee468
	float OnVoiceChatUpdated(); // Function TslGame.*dbd5d5e4b4.OnVoiceChatUpdated // Final|Native|Protected // @ game+0x58f23c4
	void UpdateWidgetSwitchers(); // Function TslGame.*dbd5d5e4b4.UpdateWidgetSwitchers // Final|Native|Public|BlueprintCallable // @ game+0x58fb754
	void SetNameTagProps(); // Function TslGame.*dbd5d5e4b4.SetNameTagProps // Final|Native|Public // @ game+0x58f80a4
};

// Class TslGame.*e795036569
// Size: 0x430 (Inherited: 0x418)
struct U*e795036569 : U*4bb82286ac {
	struct UImage* ImageBind; // 0x418(0x08)
	bool *15b4af4ce8; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct UMaterialInstanceDynamic* *132e455eaa; // 0x428(0x08)
};

// Class TslGame.*2029fbd814
// Size: 0x490 (Inherited: 0x430)
struct U*2029fbd814 : U*e795036569 {
	enum class EMarketLevel *db3659ed80; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct TMap<enum class EMarketLevel, struct UTexture2D*> *3d263a5c96; // 0x438(0x50)
	float *d109e625a4; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)
};

// Class TslGame.*4e50a61662
// Size: 0x438 (Inherited: 0x430)
struct U*4e50a61662 : U*e795036569 {
	enum class ETslMapMarkerTowerState *cde672415a; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
};

// Class TslGame.*30e57ac617
// Size: 0x450 (Inherited: 0x418)
struct U*30e57ac617 : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	struct FName *c1b0a666cd; // 0x428(0x08)
	struct U*9c8bfa0aee* AnimIncrease; // 0x430(0x08)
	struct U*9c8bfa0aee* AnimDecrease; // 0x438(0x08)
	struct UTextBlock* TextCoin; // 0x440(0x08)
	struct UTextBlock* TextValueChange; // 0x448(0x08)

	int32 UpdateCoinStackCount(); // Function TslGame.*30e57ac617.UpdateCoinStackCount // Final|Native|Public|HasOutParms // @ game+0x58fa0d8
	void UpdateCoin(); // Function TslGame.*30e57ac617.UpdateCoin // Final|Native|Public // @ game+0x58fa094
};

// Class TslGame.*8e357640ff
// Size: 0x428 (Inherited: 0x418)
struct U*8e357640ff : U*4bb82286ac {
	struct UTextBlock* TextMessage; // 0x418(0x08)
	struct U*9c8bfa0aee* AnimMessage; // 0x420(0x08)
};

// Class TslGame.*c2c78a4d50
// Size: 0x4a0 (Inherited: 0x418)
struct U*c2c78a4d50 : U*4bb82286ac {
	struct FVector2D *e72a93b8dd; // 0x418(0x08)
	struct FText *0ae636d893; // 0x420(0x18)
	struct FLinearColor *43ba830b36; // 0x438(0x10)
	struct UTexture2D* *8cd0299078; // 0x448(0x08)
	struct FText *cfc490fc18; // 0x450(0x18)
	struct FLinearColor *e445baa892; // 0x468(0x10)
	struct UTexture2D* *3813b03e8e; // 0x478(0x08)
	struct UTexture2D* *3b00ec7c88; // 0x480(0x08)
	struct UImage* ImageNotify; // 0x488(0x08)
	struct UTextBlock* TextNotify; // 0x490(0x08)
	struct U*9c8bfa0aee* AnimNotify; // 0x498(0x08)
};

// Class TslGame.*b2b396661a
// Size: 0x580 (Inherited: 0x418)
struct U*b2b396661a : U*4bb82286ac {
	char pad_418[0xd0]; // 0x418(0xd0)
	struct UTexture2D* DeactivatedIconTexture; // 0x4e8(0x08)
	struct UTexture2D* ConsoleBgTexture; // 0x4f0(0x08)
	struct FText SoldOutText; // 0x4f8(0x18)
	struct FText NotYetOpenedText; // 0x510(0x18)
	struct UTextBlock* TextTitle; // 0x528(0x08)
	struct UTextBlock* TextButtonLabel; // 0x530(0x08)
	struct U*36cff032b6* Button; // 0x538(0x08)
	struct UImage* ImageDeacvtivatedShopIcon; // 0x540(0x08)
	struct UTextBlock* TextIUnavailable; // 0x548(0x08)
	struct UHorizontalBox* HorizontalBoxNotEnoughCoin; // 0x550(0x08)
	struct UImage* ImageShopIcon; // 0x558(0x08)
	struct UTexture2D* *7170e53cba; // 0x560(0x08)
	struct UWidgetSwitcher* SwitcherForBg; // 0x568(0x08)
	struct UWidgetSwitcher* SwitcherForContents; // 0x570(0x08)
	struct U*9c8bfa0aee* AnimOpen; // 0x578(0x08)

	void OnUnhoverHandler(); // Function TslGame.*b2b396661a.OnUnhoverHandler // Final|Native|Protected // @ game+0x58f13f4
	void OnClickHandler(); // Function TslGame.*b2b396661a.OnClickHandler // Native|Protected // @ game+0x58e99a8
	void OnHoverHandler(); // Function TslGame.*b2b396661a.OnHoverHandler // Final|Native|Protected // @ game+0x58ebe18
};

// Class TslGame.*5b4c4b4436
// Size: 0x590 (Inherited: 0x580)
struct U*5b4c4b4436 : U*b2b396661a {
	struct UImage* ImageShopLevelTag; // 0x580(0x08)
	struct UTextBlock* TextDescription; // 0x588(0x08)
};

// Class TslGame.*e9f8b778f6
// Size: 0x668 (Inherited: 0x580)
struct U*e9f8b778f6 : U*b2b396661a {
	char pad_580[0x20]; // 0x580(0x20)
	struct UImage* ImageCoin; // 0x5a0(0x08)
	struct UImage* ImageFakeCoin; // 0x5a8(0x08)
	struct UTexture2D* NotEnoughCoinBgTexture; // 0x5b0(0x08)
	bool *8a6aa26f1f; // 0x5b8(0x01)
	char pad_5B9[0x7]; // 0x5b9(0x07)
	struct FSlateColor *2de4609cb5; // 0x5c0(0x28)
	struct FText *2be600abc3; // 0x5e8(0x18)
	struct FSlateColor *40d9b5e15c; // 0x600(0x28)
	struct FText *fee20cbcd0; // 0x628(0x18)
	char pad_640[0x8]; // 0x640(0x08)
	struct UTexture2D* *70aafd9580; // 0x648(0x08)
	struct UTextBlock* TextNotEnoughCoin; // 0x650(0x08)
	struct UTextBlock* TextDeactivated; // 0x658(0x08)
	struct UImage* ImageCommingSoonBox; // 0x660(0x08)

	void OnUnhoverHandler(); // Function TslGame.*e9f8b778f6.OnUnhoverHandler // Final|Native|Private // @ game+0x58f1408
	void OnHoverHandler(); // Function TslGame.*e9f8b778f6.OnHoverHandler // Final|Native|Private // @ game+0x58ebe2c
};

// Class TslGame.*299b0c596d
// Size: 0x7e0 (Inherited: 0x668)
struct U*299b0c596d : U*e9f8b778f6 {
	char pad_668[0x10]; // 0x668(0x10)
	struct FText *cb39f62ef4; // 0x678(0x18)
	char pad_690[0x8]; // 0x690(0x08)
	struct UTexture2D* *83a669756a; // 0x698(0x08)
	struct UImage* ImageItemIcon; // 0x6a0(0x08)
	struct UImage* ImageAmmoIcon; // 0x6a8(0x08)
	struct U*191926b023* TextItemName; // 0x6b0(0x08)
	struct UTextBlock* TextAmmoName; // 0x6b8(0x08)
	struct UTextBlock* TextAmmoNum; // 0x6c0(0x08)
	struct UImage* ImageIconBg; // 0x6c8(0x08)
	struct UGridPanel* GridAmmo; // 0x6d0(0x08)
	struct U*9c8bfa0aee* AnimRandomStart; // 0x6d8(0x08)
	struct F*7d19aa3720 *51dfda84ad; // 0x6e0(0x80)
	struct F*7d19aa3720 *930bf2d796; // 0x760(0x80)

	void OnClickHandler(); // Function TslGame.*299b0c596d.OnClickHandler // Native|Protected // @ game+0x58e99a8
	void *782dcdb91c(); // Function TslGame.*299b0c596d.*782dcdb91c // Final|Native|Private // @ game+0x58e84f8
	void OnFinishAnimHandler(); // Function TslGame.*299b0c596d.OnFinishAnimHandler // Final|Native|Private // @ game+0x58ea9f4
	void *f2705107d2(); // Function TslGame.*299b0c596d.*f2705107d2 // Final|Native|Private // @ game+0x58f46ac
	void OnIconLoaded(); // Function TslGame.*299b0c596d.OnIconLoaded // Final|Native|Private // @ game+0x58ebea0
};

// Class TslGame.*85e12bb717
// Size: 0x580 (Inherited: 0x418)
struct U*85e12bb717 : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	enum class EMarketUIEquipCategory Category; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct FText CategoryName; // 0x430(0x18)
	struct FText Description; // 0x448(0x18)
	struct FText *f75d696f62; // 0x460(0x18)
	struct UTexture2D* *d68c0b821c; // 0x478(0x08)
	struct FSlateColor *14d02aba0b; // 0x480(0x28)
	char pad_4A8[0x58]; // 0x4a8(0x58)
	struct UTextBlock* TextTitle; // 0x500(0x08)
	struct UTextBlock* TextName; // 0x508(0x08)
	struct UTextBlock* TextDescription; // 0x510(0x08)
	struct UTextBlock* TextDurability; // 0x518(0x08)
	struct UTextBlock* TextNotEnoughCoin; // 0x520(0x08)
	struct UTextBlock* TextButtonLabel; // 0x528(0x08)
	struct UWidgetSwitcher* SwitcherBg; // 0x530(0x08)
	struct UImage* ImageIcon; // 0x538(0x08)
	struct UImage* ImageReinforcedArrow; // 0x540(0x08)
	struct UImage* ImageIconBg; // 0x548(0x08)
	struct UImage* ImageActiveLight; // 0x550(0x08)
	struct UImage* ImageCoin; // 0x558(0x08)
	struct U*36cff032b6* Button; // 0x560(0x08)
	struct USizeBox* SizeBoxDurability; // 0x568(0x08)
	struct U*9c8bfa0aee* AnimTunningStart; // 0x570(0x08)
	struct U*9c8bfa0aee* AnimOpen; // 0x578(0x08)

	void OnClickHandler(); // Function TslGame.*85e12bb717.OnClickHandler // Final|Native|Private // @ game+0x58e99c0
};

// Class TslGame.*62ba9e5f3f
// Size: 0x610 (Inherited: 0x418)
struct U*62ba9e5f3f : U*4bb82286ac {
	struct FSlateColor *c58bca44d9; // 0x418(0x28)
	struct FSlateFontInfo *fe1411dce7; // 0x440(0x68)
	struct FSlateColor *4572cff712; // 0x4a8(0x28)
	struct FSlateColor *4cdd38bfd6; // 0x4d0(0x28)
	struct FSlateFontInfo *63eed4846d; // 0x4f8(0x68)
	struct FSlateColor *58e600e88d; // 0x560(0x28)
	struct FSlateColor *9773be8299; // 0x588(0x28)
	struct FSlateColor *efb234f045; // 0x5b0(0x28)
	struct UTextBlock* TimestampTextBlock; // 0x5d8(0x08)
	struct U*c0c5b25d31* PlatformImageWidget; // 0x5e0(0x08)
	struct UTslRichTextBlock* MessageTextBlock; // 0x5e8(0x08)
	struct U*c0c5b25d31* PlatformImageWidget2; // 0x5f0(0x08)
	struct UTslRichTextBlock* MessageTextBlock2; // 0x5f8(0x08)
	struct UImage* HighlightImage; // 0x600(0x08)
	struct USizeBox* MatchLogContentSizeBox; // 0x608(0x08)

	bool Update(); // Function TslGame.*62ba9e5f3f.Update // Final|Native|Public|HasOutParms // @ game+0x58f9d54
};

// Class TslGame.*cc6ae50ed0
// Size: 0x4a8 (Inherited: 0x418)
struct U*cc6ae50ed0 : U*4bb82286ac {
	struct UClass* *23ed0de342; // 0x418(0x08)
	float *b3e5d8c14b; // 0x420(0x04)
	int32 *ec6bb221dd; // 0x424(0x04)
	struct U*bce710e41d* TabSelectorWidget; // 0x428(0x08)
	struct UScrollBox* ContentsScrollBox; // 0x430(0x08)
	struct U*400a0fbc3d* GamepadScrollGuideKeyIcon; // 0x438(0x08)
	struct UButton* BackButton; // 0x440(0x08)
	struct USpacer* TopSpacer; // 0x448(0x08)
	struct USpacer* BottomSpacer; // 0x450(0x08)
	struct UVerticalBox* LogVerticalBox; // 0x458(0x08)
	struct UTextBlock* NoMatchLogTextBlock; // 0x460(0x08)
	struct TArray<struct FMatchLog> *0bc2e0468b; // 0x468(0x10)
	enum class EMatchLogTab CurrentTab; // 0x478(0x01)
	bool *e5e09171fe; // 0x479(0x01)
	bool *b3baee104f; // 0x47a(0x01)
	char pad_47B[0x5]; // 0x47b(0x05)
	struct TArray<struct U*62ba9e5f3f*> *8d32007545; // 0x480(0x10)
	struct TArray<bool> *283391f83d; // 0x490(0x10)
	float *f690825b11; // 0x4a0(0x04)
	float *2fcb55d975; // 0x4a4(0x04)

	float HandleScroll(); // Function TslGame.*cc6ae50ed0.HandleScroll // Final|Native|Protected // @ game+0x58e7014
	int32 HandleTabRotated(); // Function TslGame.*cc6ae50ed0.HandleTabRotated // Final|Native|Protected // @ game+0x58e70ac
	void HandleRotateTabLeft(); // Function TslGame.*cc6ae50ed0.HandleRotateTabLeft // Final|Native|Protected // @ game+0x58e6fec
	void HandleRotateTabRight(); // Function TslGame.*cc6ae50ed0.HandleRotateTabRight // Final|Native|Protected // @ game+0x58e7000
	void HandleNewMatchLogAdded(); // Function TslGame.*cc6ae50ed0.HandleNewMatchLogAdded // Final|Native|Protected // @ game+0x58e6484
	void HandleQuickScrollingUp(); // Function TslGame.*cc6ae50ed0.HandleQuickScrollingUp // Final|Native|Protected // @ game+0x58e6fd8
	void HandleQuickScrollingDown(); // Function TslGame.*cc6ae50ed0.HandleQuickScrollingDown // Final|Native|Protected // @ game+0x58e6fc4
	void HandleBackButtonClicked(); // Function TslGame.*cc6ae50ed0.HandleBackButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x58e63c8
};

// Class TslGame.*5049f20f17
// Size: 0x470 (Inherited: 0x418)
struct U*5049f20f17 : U*4bb82286ac {
	char pad_418[0x18]; // 0x418(0x18)
	struct F*62d95f3263 *ad38c99b1e; // 0x430(0x20)
	struct F*62d95f3263 *f750c19ee2; // 0x450(0x20)
};

// Class TslGame.*492a5a3ad1
// Size: 0x548 (Inherited: 0x418)
struct U*492a5a3ad1 : U*4bb82286ac {
	struct UClass* PlayerInfoWidgetTemplate; // 0x418(0x08)
	struct F*c0b2c1bc8a *47791751cb; // 0x420(0x28)
	struct F*62d95f3263 *dd4f7f8b45; // 0x448(0x20)
	struct F*62d95f3263 *a7c8658003; // 0x468(0x20)
	struct F*62d95f3263 *9fbb0ad3da; // 0x488(0x20)
	struct F*62d95f3263 *dbf22b8aa2; // 0x4a8(0x20)
	struct F*45518ccbeb *6e1ac737a4; // 0x4c8(0x20)
	struct F*a2a8693a5f *4c15d672fc; // 0x4e8(0x20)
	struct F*a2a8693a5f *c77231a147; // 0x508(0x20)
	char pad_528[0x8]; // 0x528(0x08)
	struct TArray<struct U*5049f20f17*> *07612ef917; // 0x530(0x10)
	char pad_540[0x8]; // 0x540(0x08)

	void *c2e5b919a4(); // Function TslGame.*492a5a3ad1.*c2e5b919a4 // Final|Native|Protected // @ game+0x58f0a44
};

// Class TslGame.TslMediaPlayerWidget
// Size: 0x460 (Inherited: 0x418)
struct UTslMediaPlayerWidget : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct UMediaPlayer* MediaPlayer; // 0x420(0x08)
	struct UPlatformMediaSource* *4ac95d13e1; // 0x428(0x08)
	struct UAkAudioEvent* *3bcd48a772; // 0x430(0x08)
	struct UAkAudioEvent* *ad501c8a0b; // 0x438(0x08)
	bool *844e91a987; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct USizeBox* VideoSizeBox; // 0x448(0x08)
	struct UAkComponent* *ca14232635; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)

	void OnSkipVideoPressed(); // Function TslGame.TslMediaPlayerWidget.OnSkipVideoPressed // Final|Native|Protected // @ game+0x58ef9a8
	void OnVideoEnded(); // Function TslGame.TslMediaPlayerWidget.OnVideoEnded // Final|Native|Public // @ game+0x58f2118
};

// Class TslGame.*cedc7205c6
// Size: 0x568 (Inherited: 0x418)
struct U*cedc7205c6 : U*4bb82286ac {
	struct TArray<struct F*1419545823> *d43d9e90ba; // 0x418(0x10)
	struct F*54c30817ee *2a85a65947; // 0x428(0x20)
	struct F*54c30817ee *788e4dc33e; // 0x448(0x20)
	struct F*54c30817ee *baa99d9bc5; // 0x468(0x20)
	struct F*54c30817ee *26fd4f4535; // 0x488(0x20)
	struct F*54c30817ee *cf312e3be0; // 0x4a8(0x20)
	struct F*54c30817ee *98bff81b04; // 0x4c8(0x20)
	struct F*54c30817ee *c88ef8feda; // 0x4e8(0x20)
	struct F*54c30817ee *6f5793d93c; // 0x508(0x20)
	struct F*54c30817ee *f9b26ed41f; // 0x528(0x20)
	struct U*48db345949* PubgIdWidget; // 0x548(0x08)
	float PubgIdLifeTime; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	struct UStringTable* UIStringTable; // 0x558(0x08)
	char pad_560[0x8]; // 0x560(0x08)

	int32 *61ed8a2aec(); // Function TslGame.*cedc7205c6.*61ed8a2aec // Final|Native|Private // @ game+0x58e49c8
	int32 *8500143f1b(); // Function TslGame.*cedc7205c6.*8500143f1b // Final|Native|Private // @ game+0x58ea32c
	float *c8635d4a53(); // Function TslGame.*cedc7205c6.*c8635d4a53 // Final|Native|Private|HasOutParms // @ game+0x58e4b68
	void HidePubgIdWidget(); // Function TslGame.*cedc7205c6.HidePubgIdWidget // Final|Native|Public // @ game+0x58e717c
	void OnDisplayVoiceChannelStateMessage(); // Function TslGame.*cedc7205c6.OnDisplayVoiceChannelStateMessage // Final|Native|Private // @ game+0x58ea4a0
	struct URetainerBox* *cfdfcbd331(); // Function TslGame.*cedc7205c6.*cfdfcbd331 // Final|Native|Private // @ game+0x58f3cf8
	struct FText *ee018d6bb3(); // Function TslGame.*cedc7205c6.*ee018d6bb3 // Final|Native|Private|HasOutParms // @ game+0x58f4234
	struct UAkAudioEvent* OnDisplayMessage(); // Function TslGame.*cedc7205c6.OnDisplayMessage // Final|Native|Private // @ game+0xaee41c
	struct U*96d27f6744* CreateVoiceChannelStateMessage(); // Function TslGame.*cedc7205c6.CreateVoiceChannelStateMessage // Event|Public|BlueprintEvent // @ game+0x22c9a0
	struct ATslPlayerState* UpdatePubgIdWidgetWithKiller(); // Function TslGame.*cedc7205c6.UpdatePubgIdWidgetWithKiller // Final|Native|Private // @ game+0xc36970
	struct U*96d27f6744* CreateGamePlayMessage(); // Function TslGame.*cedc7205c6.CreateGamePlayMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22c9a0
	void *1bc8a3a8f5(); // Function TslGame.*cedc7205c6.*1bc8a3a8f5 // Final|Native|Private // @ game+0x58eca0c
	struct FText *c62adfba27(); // Function TslGame.*cedc7205c6.*c62adfba27 // Final|Native|Private // @ game+0x58e60c4
	struct U*96d27f6744* CreateSystemMessage(); // Function TslGame.*cedc7205c6.CreateSystemMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22c9a0
	void *976936d186(); // Function TslGame.*cedc7205c6.*976936d186 // Final|Native|Private // @ game+0x58e7664
};

// Class TslGame.*06c6ffde8b
// Size: 0x458 (Inherited: 0x418)
struct U*06c6ffde8b : U*4bb82286ac {
	struct FString Name; // 0x418(0x10)
	int32 Level; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FString EmblemId; // 0x430(0x10)
	struct FString NameplateId; // 0x440(0x10)
	enum class EOutGamePlatformProvider Platform; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class TslGame.*32c3717703
// Size: 0x5b0 (Inherited: 0x418)
struct U*32c3717703 : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*c0b2c1bc8a MissionItemVerticalBox_Binder; // 0x420(0x28)
	struct F*62d95f3263 MissionGroupText_Binder; // 0x448(0x20)
	struct F*aecf96cb1e ProgressImage_Binder; // 0x468(0x28)
	struct F*62d95f3263 ProgressText_Binder; // 0x490(0x20)
	struct F*a2a8693a5f LockWidgetAnimation_Binder; // 0x4b0(0x20)
	struct F*a8249d5e73 LockBorder_Binder; // 0x4d0(0x30)
	struct F*a8249d5e73 ButtonBorder_Binder; // 0x500(0x30)
	struct F*aecf96cb1e ExpandImage_Binder; // 0x530(0x28)
	struct F*cfff343e46 WidgetBody_Binder; // 0x558(0x28)
	struct UTexture2D* ExpandTexture; // 0x580(0x08)
	struct UTexture2D* CollapsTexture; // 0x588(0x08)
	char pad_590[0x8]; // 0x590(0x08)
	struct U*7d732dfd2f* *7c191fa783; // 0x598(0x08)
	struct FMulticastDelegate OnExpanded; // 0x5a0(0x10)

	struct FEventReply OnButtonDown(); // Function TslGame.*32c3717703.OnButtonDown // Final|Native|Private|HasOutParms // @ game+0x58e92d8
	void UpdateDesign_Normal(); // Function TslGame.*32c3717703.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x22c9a0
	struct TArray<struct U*94ff3c9178*> *dc12f553b4(); // Function TslGame.*32c3717703.*dc12f553b4 // Final|Native|Public // @ game+0x58e5b34
	struct U*d519ef66f2* *8951635ef8(); // Function TslGame.*32c3717703.*8951635ef8 // Final|Native|Public // @ game+0x58e5b08
	void UpdateDesign_Focused(); // Function TslGame.*32c3717703.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void NotifyWidgetInputA(); // Function TslGame.*32c3717703.NotifyWidgetInputA // Final|Native|Public|BlueprintCallable // @ game+0x58e81c4
};

// Class TslGame.*94ff3c9178
// Size: 0x568 (Inherited: 0x418)
struct U*94ff3c9178 : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	struct UTextBlock* DescriptionText; // 0x428(0x08)
	struct UTextBlock* ProgressText; // 0x430(0x08)
	struct UImage* IconImage; // 0x438(0x08)
	struct UImage* StateImage; // 0x440(0x08)
	struct UImage* ProgressBarImage; // 0x448(0x08)
	struct UBorder* InfoBorder; // 0x450(0x08)
	struct UBorder* ProgressBarBorder; // 0x458(0x08)
	struct UBorder* MissionListBorder; // 0x460(0x08)
	struct TMap<struct FString, struct UTexture2D*> MissionIcons; // 0x468(0x50)
	struct UTexture2D* DefaultMissionIcon; // 0x4b8(0x08)
	struct UTexture2D* LockTexture; // 0x4c0(0x08)
	struct UTexture2D* CompleteTexture; // 0x4c8(0x08)
	float InactiveIconAlpha; // 0x4d0(0x04)
	float ActiveIconAlpha; // 0x4d4(0x04)
	float InactiveTextAlpha; // 0x4d8(0x04)
	float InactiveProgressBarBorderAlpha; // 0x4dc(0x04)
	int32 FontSizeForPC; // 0x4e0(0x04)
	int32 FontSizeForConsole; // 0x4e4(0x04)
	struct FLinearColor ActiveInfoBorderColor; // 0x4e8(0x10)
	struct FLinearColor AchievedInfoBorderColor; // 0x4f8(0x10)
	struct FLinearColor ActiveMissionBorderColor; // 0x508(0x10)
	struct FLinearColor AchievedMissionBorderColor; // 0x518(0x10)
	struct FName ScalarParamNameFirstEnd; // 0x528(0x08)
	struct FName ScalarParamNameSecondEnd; // 0x530(0x08)
	struct FString MissionId; // 0x538(0x10)
	struct FString MissionType; // 0x548(0x10)
	char pad_558[0x8]; // 0x558(0x08)
	struct U*7d732dfd2f* *7c191fa783; // 0x560(0x08)

	void UpdateDesign_Focused(); // Function TslGame.*94ff3c9178.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void UpdateDesign_Normal(); // Function TslGame.*94ff3c9178.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*fdec98178d
// Size: 0x450 (Inherited: 0x418)
struct U*fdec98178d : U*4bb82286ac {
	char pad_418[0x20]; // 0x418(0x20)
	struct UMaterialInstanceDynamic* *7c8bef026f; // 0x438(0x08)
	struct UImage* HpImage; // 0x440(0x08)
	float *987936d363; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
};

// Class TslGame.*818d99d7da
// Size: 0x470 (Inherited: 0x418)
struct U*818d99d7da : U*4bb82286ac {
	struct F*13fd1d29ec KeysPanel_Binder; // 0x418(0x20)
	struct F*aecf96cb1e MiddleMouseButton_Binder; // 0x438(0x28)
	struct TArray<struct FString> MiddleMouseButtonActionsOrAxies; // 0x460(0x10)
};

// Class TslGame.*84a032da95
// Size: 0x4b0 (Inherited: 0x418)
struct U*84a032da95 : U*4bb82286ac {
	struct F*aecf96cb1e *2834386b0b; // 0x418(0x28)
	struct F*62d95f3263 *25dc1bca77; // 0x440(0x20)
	struct F*a159aaccd9 *716650873e; // 0x460(0x28)
	struct FVector2D *d51f2a537e; // 0x488(0x08)
	struct UMaterialInstanceDynamic* *ec0e083836; // 0x490(0x08)
	struct U*90f6064ab3* CastingBarInfoText; // 0x498(0x08)
	char pad_4A0[0x10]; // 0x4a0(0x10)
};

// Class TslGame.*4f12dce2b4
// Size: 0x4f8 (Inherited: 0x418)
struct U*4f12dce2b4 : U*4bb82286ac {
	enum class EVerticalAlignment *f5ed8c1713; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	int32 *8af8ec90d2; // 0x41c(0x04)
	bool *132fc1e8e2; // 0x420(0x01)
	bool *423371df62; // 0x421(0x01)
	char pad_422[0x6]; // 0x422(0x06)
	struct UCurveFloat* *5ff3707f11; // 0x428(0x08)
	struct FVector2D BorderSize; // 0x430(0x08)
	bool *e0a78701d0; // 0x438(0x01)
	bool *6a04df7c95; // 0x439(0x01)
	char pad_43A[0x6]; // 0x43a(0x06)
	struct TArray<struct U*96d27f6744*> *88324ece75; // 0x440(0x10)
	struct U*96d27f6744* *5728aab275; // 0x450(0x08)
	struct F*54c30817ee *e0ad545058; // 0x458(0x20)
	struct F*54c30817ee *2859064429; // 0x478(0x20)
	struct F*54c30817ee *170e30d323; // 0x498(0x20)
	struct FVector2D *618723e640; // 0x4b8(0x08)
	struct TArray<struct FVector2D> *01ad0b2138; // 0x4c0(0x10)
	float *06ebd8e707; // 0x4d0(0x04)
	struct FVector2D *e1a0f8dbf0; // 0x4d4(0x08)
	struct FVector2D *e3b4c20cb4; // 0x4dc(0x08)
	struct FVector2D *a649475ad3; // 0x4e4(0x08)
	float *1dd7cac90b; // 0x4ec(0x04)
	int32 Count; // 0x4f0(0x04)
	bool *d3b52f8334; // 0x4f4(0x01)
	char pad_4F5[0x3]; // 0x4f5(0x03)

	bool *44e8a390ce(); // Function TslGame.*4f12dce2b4.*44e8a390ce // Final|Native|Protected // @ game+0x58e77d4
	enum class ESlateSizeRule SetSizeRule(); // Function TslGame.*4f12dce2b4.SetSizeRule // Final|Native|Protected // @ game+0x58f8ab0
	bool *f5ee09fd6e(); // Function TslGame.*4f12dce2b4.*f5ee09fd6e // Final|Native|Public // @ game+0x58e2bac
	struct U*96d27f6744* OnRemoveMessage(); // Function TslGame.*4f12dce2b4.OnRemoveMessage // Final|Native|Public // @ game+0xc382e8
	float *812fe7b1ab(); // Function TslGame.*4f12dce2b4.*812fe7b1ab // Final|Native|Protected // @ game+0x58e7dc0
	bool *9cb06a0e33(); // Function TslGame.*4f12dce2b4.*9cb06a0e33 // Final|Native|Public // @ game+0x58e713c
	struct U*96d27f6744* *2787a2aa8f(); // Function TslGame.*4f12dce2b4.*2787a2aa8f // Final|Native|Protected // @ game+0x58e5acc
	void *1c4c074b25(); // Function TslGame.*4f12dce2b4.*1c4c074b25 // Final|Native|Protected // @ game+0x58fae34
	void *7a06f17fac(); // Function TslGame.*4f12dce2b4.*7a06f17fac // Final|Native|Public // @ game+0x58fabfc
};

// Class TslGame.*cfa5213de7
// Size: 0x4f8 (Inherited: 0x4f8)
struct U*cfa5213de7 : U*4f12dce2b4 {
};

// Class TslGame.*96d27f6744
// Size: 0x478 (Inherited: 0x418)
struct U*96d27f6744 : U*4bb82286ac {
	struct FText Message; // 0x418(0x18)
	float Duration; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UAkAudioEvent* Sound; // 0x438(0x08)
	struct FMulticastDelegate EndMessage; // 0x440(0x10)
	bool bUsed; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
	struct F*2ef3a887d0 *f8e3c91485; // 0x458(0x08)
	struct UTextBlock* MessageTextBlock; // 0x460(0x08)
	struct U*9c8bfa0aee* Anim_FadeIn; // 0x468(0x08)
	struct U*9c8bfa0aee* Anim_FadeOut; // 0x470(0x08)

	void OnFadeOutFinished(); // Function TslGame.*96d27f6744.OnFadeOutFinished // Final|Native|Public // @ game+0xce1594
	void StartFadeOut(); // Function TslGame.*96d27f6744.StartFadeOut // Final|Native|Public // @ game+0xc564a4
	void OnFadeInFinished(); // Function TslGame.*96d27f6744.OnFadeInFinished // Final|Native|Public // @ game+0xaa8f54
};

// Class TslGame.*44b94112b4
// Size: 0x470 (Inherited: 0x418)
struct U*44b94112b4 : U*4bb82286ac {
	struct U*af958699db* TeamManagement; // 0x418(0x08)
	struct U*6eb1a330e0* TeamManagementPopup; // 0x420(0x08)
	struct U*a3d102c587* SystemMenu; // 0x428(0x08)
	struct U*55d8f761b9* ReportPlayerWidget; // 0x430(0x08)
	struct TArray<struct ATeam*> *dabc664808; // 0x438(0x10)
	char pad_448[0x18]; // 0x448(0x18)
	struct U*3fd333ecb6* MissionList; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	void InitBinding(); // Function TslGame.*44b94112b4.InitBinding // Final|Native|Public|BlueprintCallable // @ game+0x58e72c8
	struct U*00964e18e9* *84c826f5ca(); // Function TslGame.*44b94112b4.*84c826f5ca // Final|Native|Protected // @ game+0x58e590c
	struct FString OnSuccessfullyReportPlayer(); // Function TslGame.*44b94112b4.OnSuccessfullyReportPlayer // Final|Native|Public // @ game+0x58f06d0
	struct FTslReportUserInfo OnReport(); // Function TslGame.*44b94112b4.OnReport // Final|Native|Public // @ game+0x58ef108
	void OnNotifyReportTeamMember(); // Function TslGame.*44b94112b4.OnNotifyReportTeamMember // Event|Protected|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*fbf7f13899
// Size: 0x500 (Inherited: 0x418)
struct U*fbf7f13899 : U*4bb82286ac {
	struct UBorder* BorderNotificationMessage; // 0x418(0x08)
	struct UImage* ImageIcon; // 0x420(0x08)
	struct UWidgetSwitcher* SwitcherMessage; // 0x428(0x08)
	struct UTextBlock* TextMessage; // 0x430(0x08)
	struct UTslRichTextBlock* RichTextMessage; // 0x438(0x08)
	struct U*9c8bfa0aee* AnimAppear; // 0x440(0x08)
	struct U*9c8bfa0aee* AnimAppearLoop; // 0x448(0x08)
	struct U*9c8bfa0aee* AnimDisappear; // 0x450(0x08)
	struct UDataTable* NotificationMessageTable; // 0x458(0x08)
	struct TMap<enum class ETslNotificationMessageColorType, struct FSlateColor> *16eee48200; // 0x460(0x50)
	struct F*a7b2a4017a *2cccae97f3; // 0x4b0(0x38)
	char pad_4E8[0x18]; // 0x4e8(0x18)
};

// Class TslGame.*750d6bfbdd
// Size: 0x500 (Inherited: 0x418)
struct U*750d6bfbdd : U*4bb82286ac {
	struct F*a2a8693a5f LastTeamsAnimBinder; // 0x418(0x20)
	struct F*a2a8693a5f LastTeamsSkipAnimBinder; // 0x438(0x20)
	struct F*a2a8693a5f LastTeamsInitAnimBinder; // 0x458(0x20)
	struct TArray<struct F*45518ccbeb> PlayerIconWidgetBinders; // 0x478(0x10)
	struct TArray<struct F*45518ccbeb> LastTeamInfoWidgetBinders; // 0x488(0x10)
	struct TMap<int32, struct U*471666bc8d*> *059f894301; // 0x498(0x50)
	struct U*18ef54005e* *61663db61e; // 0x4e8(0x08)
	char pad_4F0[0x10]; // 0x4f0(0x10)

	void OnInitLastTeams(); // Function TslGame.*750d6bfbdd.OnInitLastTeams // Final|Native|Public // @ game+0x58ebedc
	void UpdateCurrentAliveCount(); // Function TslGame.*750d6bfbdd.UpdateCurrentAliveCount // Final|Native|Public // @ game+0x58fa35c
};

// Class TslGame.*471666bc8d
// Size: 0x5a8 (Inherited: 0x418)
struct U*471666bc8d : U*4bb82286ac {
	struct TArray<struct F*aecf96cb1e> PlayerImageWidgetBinders; // 0x418(0x10)
	struct F*aecf96cb1e BGImageWidgetBinder; // 0x428(0x28)
	struct F*aecf96cb1e PatternImageWidgetBinder; // 0x450(0x28)
	struct F*62d95f3263 NameTextWidgetBinder; // 0x478(0x20)
	struct F*a8249d5e73 LogoBorderWidgetBinder; // 0x498(0x30)
	struct F*7b33ced057 LogoSwitcherWidgetBinder; // 0x4c8(0x28)
	struct F*aecf96cb1e TeamIconImageWidgetBinder; // 0x4f0(0x28)
	struct F*a2a8693a5f EndAnimBinder; // 0x518(0x20)
	struct FLinearColor BGImageDimColor; // 0x538(0x10)
	struct FLinearColor NameTextNormalColor; // 0x548(0x10)
	struct FLinearColor NameTextDimColor; // 0x558(0x10)
	struct FLinearColor PlayerNormalColor; // 0x568(0x10)
	struct FLinearColor PlayerGroggyColor; // 0x578(0x10)
	struct FLinearColor PlayerDieColor; // 0x588(0x10)
	char pad_598[0x10]; // 0x598(0x10)
};

// Class TslGame.*1d6b255b8a
// Size: 0x440 (Inherited: 0x418)
struct U*1d6b255b8a : U*4bb82286ac {
	struct F*7b33ced057 PlayerStateIconsSwitcherBinder; // 0x418(0x28)
};

// Class TslGame.*7e48997ac3
// Size: 0x4b0 (Inherited: 0x418)
struct U*7e48997ac3 : U*4bb82286ac {
	struct F*a8249d5e73 LogoBorderWidgetBinder; // 0x418(0x30)
	struct F*13fd1d29ec LogoPanelWidgetBinder; // 0x448(0x20)
	struct F*aecf96cb1e LastTeamPatternWidgetBinder; // 0x468(0x28)
	struct F*62d95f3263 LastTeamTextWidgetBinder; // 0x490(0x20)
};

// Class TslGame.*e4d345c9dc
// Size: 0x428 (Inherited: 0x418)
struct U*e4d345c9dc : U*4bb82286ac {
	struct U*18ef54005e* Manager; // 0x418(0x08)
	struct U*c0c5b25d31* PlatformImage; // 0x420(0x08)
};

// Class TslGame.*734efaf75a
// Size: 0x630 (Inherited: 0x428)
struct U*734efaf75a : U*e4d345c9dc {
	struct F*7b33ced057 *674875e7a1; // 0x428(0x28)
	struct F*7b33ced057 *cd1e13f76f; // 0x450(0x28)
	struct F*a2a8693a5f *32c3e964ae; // 0x478(0x20)
	struct F*45518ccbeb *65f8228c61; // 0x498(0x20)
	struct F*45518ccbeb *2e31a0cd9d; // 0x4b8(0x20)
	struct F*62d95f3263 *7f8614236b; // 0x4d8(0x20)
	struct F*62d95f3263 *d3684af406; // 0x4f8(0x20)
	struct F*a2a8693a5f *72b74b3e4b; // 0x518(0x20)
	struct F*45518ccbeb *7358b5a331; // 0x538(0x20)
	struct F*45518ccbeb *f200dc6680; // 0x558(0x20)
	struct F*45518ccbeb *6af1b9ef8d; // 0x578(0x20)
	struct F*45518ccbeb *01d54069d4; // 0x598(0x20)
	struct F*62d95f3263 *f60dc68af0; // 0x5b8(0x20)
	struct F*62d95f3263 *0cc14b678d; // 0x5d8(0x20)
	struct F*62d95f3263 *b41425b5f8; // 0x5f8(0x20)
	struct UAkAudioEvent* *d6c164ecca; // 0x618(0x08)
	char pad_620[0x10]; // 0x620(0x10)

	void *e86f35d78d(); // Function TslGame.*734efaf75a.*e86f35d78d // Final|Native|Private // @ game+0x58e7c9c
};

// Class TslGame.*18ef54005e
// Size: 0x478 (Inherited: 0x418)
struct U*18ef54005e : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	struct F*a8249d5e73 *5072a6e25e; // 0x428(0x30)
	struct UClass* *b911c160fb; // 0x458(0x08)
	struct UClass* *7a4867737b; // 0x460(0x08)
	struct U*e4d345c9dc* CurrAnimWidget; // 0x468(0x08)
	struct U*750d6bfbdd* *750d6bfbdd; // 0x470(0x08)

	bool Enqueue(); // Function TslGame.*18ef54005e.Enqueue // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58e4e28
	bool IsEmpty(); // Function TslGame.*18ef54005e.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58e7748
	bool Peek(); // Function TslGame.*18ef54005e.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x58f3794
	int32 OnTeamWipeOut(); // Function TslGame.*18ef54005e.OnTeamWipeOut // Final|Native|Protected // @ game+0x58f0bd8
	enum class EOutGamePlatformProvider OnPersonalKillingSpree(); // Function TslGame.*18ef54005e.OnPersonalKillingSpree // Final|Native|Protected // @ game+0x58ee600
	bool Dequeue(); // Function TslGame.*18ef54005e.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x58e4918
	bool IsBusy(); // Function TslGame.*18ef54005e.IsBusy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58e772c
	void OnCurrAnimFinish(); // Function TslGame.*18ef54005e.OnCurrAnimFinish // Final|Native|Public|BlueprintCallable // @ game+0x58e9e60
	int32 NumElems(); // Function TslGame.*18ef54005e.NumElems // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58e8210
	void Clear(); // Function TslGame.*18ef54005e.Clear // Final|Native|Public|BlueprintCallable // @ game+0x58e2bd4
	int32 OnTeamKillingSpree(); // Function TslGame.*18ef54005e.OnTeamKillingSpree // Final|Native|Protected // @ game+0x58f0a58
	bool ProcData(); // Function TslGame.*18ef54005e.ProcData // Final|Native|Public|BlueprintCallable // @ game+0x58f3c30
};

// Class TslGame.*3535a72ba8
// Size: 0x518 (Inherited: 0x428)
struct U*3535a72ba8 : U*e4d345c9dc {
	struct F*45518ccbeb *c62de8d260; // 0x428(0x20)
	struct F*45518ccbeb *1a59fa3553; // 0x448(0x20)
	struct F*45518ccbeb *adb870b402; // 0x468(0x20)
	struct F*45518ccbeb *aebed8d411; // 0x488(0x20)
	struct F*62d95f3263 *f5302b4202; // 0x4a8(0x20)
	struct F*62d95f3263 *41a7c99366; // 0x4c8(0x20)
	struct F*a2a8693a5f *e8074b25d9; // 0x4e8(0x20)
	struct UAkAudioEvent* *c1d060d892; // 0x508(0x08)
	char pad_510[0x8]; // 0x510(0x08)

	void *54ff2ac69e(); // Function TslGame.*3535a72ba8.*54ff2ac69e // Final|Native|Protected // @ game+0x58e7c9c
};

// Class TslGame.*b96ba6e7b0
// Size: 0x620 (Inherited: 0x428)
struct U*b96ba6e7b0 : U*e4d345c9dc {
	struct F*62d95f3263 *d3684af406; // 0x428(0x20)
	struct F*62d95f3263 *0cc14b678d; // 0x448(0x20)
	struct F*7b33ced057 *f4b690e806; // 0x468(0x28)
	struct F*45518ccbeb *568b175581; // 0x490(0x20)
	struct F*aecf96cb1e *62f3f76efa; // 0x4b0(0x28)
	struct F*62d95f3263 *ef9d6320fb; // 0x4d8(0x20)
	struct F*aecf96cb1e *6b15231e69; // 0x4f8(0x28)
	struct F*62d95f3263 *a13b072808; // 0x520(0x20)
	struct F*aecf96cb1e *efef52d729; // 0x540(0x28)
	struct UTexture2D* KillingSpreeTexture; // 0x568(0x08)
	struct UTexture2D* DominatingTexture; // 0x570(0x08)
	struct F*a2a8693a5f AssistAnimBinder; // 0x578(0x20)
	struct F*a2a8693a5f FirstKillAnimBinder; // 0x598(0x20)
	struct F*a2a8693a5f ThirdKillAnimBinder; // 0x5b8(0x20)
	struct F*a2a8693a5f FifthKillAnimBinder; // 0x5d8(0x20)
	struct F*a2a8693a5f OverKillAnimBinder; // 0x5f8(0x20)
	struct UAkAudioEvent* ObserverTotalKillSound; // 0x618(0x08)
};

// Class TslGame.*0444487ece
// Size: 0x460 (Inherited: 0x418)
struct U*0444487ece : U*4bb82286ac {
	struct UClass* TeamInfoWidgetTemplate; // 0x418(0x08)
	struct TArray<struct U*492a5a3ad1*> *59f10fc503; // 0x420(0x10)
	float *b446a4ad34; // 0x430(0x04)
	float *213771acdd; // 0x434(0x04)
	struct F*78acf214e2 *55a4640145; // 0x438(0x28)
};

// Class TslGame.*aa091b2cab
// Size: 0x498 (Inherited: 0x418)
struct U*aa091b2cab : U*4bb82286ac {
	struct F*45518ccbeb *1d32e06709; // 0x418(0x20)
	struct F*45518ccbeb *4a247aaed1; // 0x438(0x20)
	struct F*45518ccbeb *bd6d74d8c9; // 0x458(0x20)
	struct F*a2a8693a5f *4ed6676d5a; // 0x478(0x20)
};

// Class TslGame.*66c654d068
// Size: 0x4f0 (Inherited: 0x418)
struct U*66c654d068 : U*4bb82286ac {
	struct F*62d95f3263 *438e168d49; // 0x418(0x20)
	struct F*62d95f3263 *8792f2b239; // 0x438(0x20)
	struct F*62d95f3263 *34562abb58; // 0x458(0x20)
	struct F*aecf96cb1e *3e92e060a7; // 0x478(0x28)
	struct F*45518ccbeb *01d54069d4; // 0x4a0(0x20)
	struct F*a2a8693a5f *09586b40d4; // 0x4c0(0x20)
	enum class ELeagueMatchStatistic *f8eae75d5b; // 0x4e0(0x01)
	char pad_4E1[0x3]; // 0x4e1(0x03)
	float *70cc35f02e; // 0x4e4(0x04)
	char pad_4E8[0x8]; // 0x4e8(0x08)

	void *aa4d991ccd(); // Function TslGame.*66c654d068.*aa4d991ccd // Final|Native|Private // @ game+0x58f0694
};

// Class TslGame.*5af8770302
// Size: 0x460 (Inherited: 0x418)
struct U*5af8770302 : U*4bb82286ac {
	struct FVector2D *c2709fdcf6; // 0x418(0x08)
	struct FVector2D *e16d5a1fc6; // 0x420(0x08)
	struct UWidgetSwitcher* SwitcherPlayerIcon; // 0x428(0x08)
	struct USizeBox* SizeboxPlayerIcon; // 0x430(0x08)
	struct UImage* ImagePlayerIcon; // 0x438(0x08)
	struct USizeBox* SizeboxPlayerNumber; // 0x440(0x08)
	struct UBorder* BorderPlayerNumber; // 0x448(0x08)
	struct UImage* ImagePattern; // 0x450(0x08)
	struct UTextBlock* TextNumber; // 0x458(0x08)

	int32 UpdatePlayerIcon(); // Function TslGame.*5af8770302.UpdatePlayerIcon // Final|Native|Public|BlueprintCallable // @ game+0x58fab44
};

// Class TslGame.*a4e8eb6411
// Size: 0x9e0 (Inherited: 0x418)
struct U*a4e8eb6411 : U*4bb82286ac {
	struct UTexture* UnArmedIcon; // 0x418(0x08)
	float UnArmedIconRatio; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct ATslCharacter* *67732f25cb; // 0x428(0x08)
	int32 *e96c6ee7cf; // 0x430(0x04)
	int32 *2e258e9aa8; // 0x434(0x04)
	int32 *5f462c62ad; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct F*a2a8693a5f AmmoIncreasingAnimBinder; // 0x440(0x20)
	struct F*a2a8693a5f AmmoDecreasingAnimBinder; // 0x460(0x20)
	struct F*62d95f3263 *1994f00699; // 0x480(0x20)
	struct F*62d95f3263 *9915a5d79a; // 0x4a0(0x20)
	struct F*a8249d5e73 *7fca5a6f85; // 0x4c0(0x30)
	struct F*62d95f3263 *a7c8658003; // 0x4f0(0x20)
	struct F*a8249d5e73 *f31c3d23e6; // 0x510(0x30)
	struct F*7b33ced057 PatternSwitcherBinder; // 0x540(0x28)
	struct F*aecf96cb1e *ef19d43bfc; // 0x568(0x28)
	struct F*0c033c3537 *3fc5a35d2c; // 0x590(0x28)
	struct F*62d95f3263 *6324f43a14; // 0x5b8(0x20)
	struct F*62d95f3263 *ace2b5b4ae; // 0x5d8(0x20)
	struct F*62d95f3263 *600fde23c4; // 0x5f8(0x20)
	struct F*62d95f3263 *9fbb0ad3da; // 0x618(0x20)
	struct F*45518ccbeb *7ee3b362c0; // 0x638(0x20)
	struct F*45518ccbeb *63b04e1429; // 0x658(0x20)
	struct F*45518ccbeb *adf9042883; // 0x678(0x20)
	struct F*45518ccbeb *3173dd468b; // 0x698(0x20)
	struct F*45518ccbeb *1697780c9d; // 0x6b8(0x20)
	struct F*45518ccbeb *fa41a77a8b; // 0x6d8(0x20)
	struct F*45518ccbeb *5a8af87464; // 0x6f8(0x20)
	struct F*45518ccbeb *4f4a53b9ed; // 0x718(0x20)
	struct F*45518ccbeb *8208a139d4; // 0x738(0x20)
	struct F*aecf96cb1e *d789a25783; // 0x758(0x28)
	struct UTexture2D* DriverTexture; // 0x780(0x08)
	struct F*aecf96cb1e WeaponIconImageBinder; // 0x788(0x28)
	struct F*3cdda95245 WeaponIconImageSizeBoxBinder; // 0x7b0(0x28)
	struct F*aecf96cb1e SecondWeaponIconImageBinder; // 0x7d8(0x28)
	struct F*3cdda95245 SecondWeaponIconImageSizeBoxBinder; // 0x800(0x28)
	struct F*62d95f3263 MainWeaponName_Binder; // 0x828(0x20)
	struct F*62d95f3263 MainWeaponEmpty_Binder; // 0x848(0x20)
	struct F*62d95f3263 SecondWeaponEmpty_Binder; // 0x868(0x20)
	struct FName WeaponIconTextureParmName; // 0x888(0x08)
	struct FName WeaponIconColorParmName; // 0x890(0x08)
	struct FLinearColor WeaponColor_Armed; // 0x898(0x10)
	struct FLinearColor WeaponColor_Normal; // 0x8a8(0x10)
	struct FLinearColor SecondWeaponColor_Normal; // 0x8b8(0x10)
	struct F*9f07f2774c WeaponColorSet_NoReload; // 0x8c8(0x10)
	struct F*9f07f2774c SecondWeaponColorSet_NoReload; // 0x8d8(0x10)
	struct TMap<struct FName, struct UTexture2D*> WeaponAttachableTextureMap; // 0x8e8(0x50)
	struct TMap<enum class ECastAnim, struct UTexture2D*> CastableItemTextureMap; // 0x938(0x50)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x988(0x10)
	struct U*c0c5b25d31* UserPlatformImageWidget; // 0x998(0x08)
	struct FLinearColor *1f89270172; // 0x9a0(0x10)
	struct FLinearColor *be189c8dbf; // 0x9b0(0x10)
	struct UTexture2D* *f6e6d5c84c; // 0x9c0(0x08)
	struct UTexture2D* *fc67cfa0b7; // 0x9c8(0x08)
	struct UTexture2D* *90aac3a6f1; // 0x9d0(0x08)
	char pad_9D8[0x8]; // 0x9d8(0x08)
};

// Class TslGame.TslObserverPlayerListTileInfoWidget
// Size: 0x658 (Inherited: 0x418)
struct UTslObserverPlayerListTileInfoWidget : U*4bb82286ac {
	char pad_418[0x40]; // 0x418(0x40)
	struct ATslCharacter* Character; // 0x458(0x08)
	struct ATslPlayerState* *0fc4965e48; // 0x460(0x08)
	struct FLinearColor HighlightedColor; // 0x468(0x10)
	struct FLinearColor ActivatedColor; // 0x478(0x10)
	struct FLinearColor DeactivatedColor; // 0x488(0x10)
	struct U*191926b023* PlayerNameFlowText; // 0x498(0x08)
	struct F*62d95f3263 TeamName; // 0x4a0(0x20)
	struct F*62d95f3263 PlayerKillCount; // 0x4c0(0x20)
	struct F*45518ccbeb LifeGaugeWidgetBinder; // 0x4e0(0x20)
	struct F*54c30817ee BtnPlayer; // 0x500(0x20)
	struct F*54c30817ee KickButton_Binder; // 0x520(0x20)
	struct F*54c30817ee ReportButton_Binder; // 0x540(0x20)
	struct F*3cdda95245 TeamTagSizeBox_Binder; // 0x560(0x28)
	struct F*aecf96cb1e TeamTagBG_Binder; // 0x588(0x28)
	struct F*aecf96cb1e TeamTagColor_Binder; // 0x5b0(0x28)
	struct U*db8c7eb7ae* *2c4cef9b8e; // 0x5d8(0x08)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x5e0(0x10)
	struct U*c0c5b25d31* UserPlatformImageWidget; // 0x5f0(0x08)
	struct FString *fdd96c8abc; // 0x5f8(0x10)
	struct FString PlayerName; // 0x608(0x10)
	struct FString *ab1662853a; // 0x618(0x10)
	struct FText *941bf813a2; // 0x628(0x18)
	char pad_640[0x18]; // 0x640(0x18)

	void OnKickButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnKickButtonClicked // Final|Native|Private // @ game+0x58ec114
	enum class *62cdf2ca7f KickPlayer(); // Function TslGame.TslObserverPlayerListTileInfoWidget.KickPlayer // Final|Native|Private // @ game+0x58e7a50
	void OnMouseClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnMouseClicked // Final|Native|Private // @ game+0x58ed5c8
	void OnReportButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnReportButtonClicked // Final|Native|Public // @ game+0x58ef218
};

// Class TslGame.TslObserverPlayerListTileWidget
// Size: 0x588 (Inherited: 0x418)
struct UTslObserverPlayerListTileWidget : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*13fd1d29ec InforPanel; // 0x420(0x20)
	struct F*54c30817ee TeamRank; // 0x440(0x20)
	struct F*62d95f3263 TeamRankText; // 0x460(0x20)
	struct F*7b33ced057 SwitcherTeamLogo; // 0x480(0x28)
	struct F*aecf96cb1e TeamImage; // 0x4a8(0x28)
	struct F*aecf96cb1e TeamColor; // 0x4d0(0x28)
	struct F*aecf96cb1e TeamListColor; // 0x4f8(0x28)
	struct F*62d95f3263 TeamNum; // 0x520(0x20)
	struct F*62d95f3263 TeamInfoKill; // 0x540(0x20)
	struct UTexture2D* *8a226dfd00; // 0x560(0x08)
	char pad_568[0x20]; // 0x568(0x20)

	int32 UpdateStripeTexture(); // Function TslGame.TslObserverPlayerListTileWidget.UpdateStripeTexture // Event|Protected|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*15af126757
// Size: 0x428 (Inherited: 0x418)
struct U*15af126757 : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)

	bool Enqueue(); // Function TslGame.*15af126757.Enqueue // Final|Native|Public|BlueprintCallable // @ game+0x58e5164
	void Clear(); // Function TslGame.*15af126757.Clear // Final|Native|Public|BlueprintCallable // @ game+0x58e2bf0
	bool Dequeue(); // Function TslGame.*15af126757.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x58e493c
	bool Find(); // Function TslGame.*15af126757.Find // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x58e542c
	bool IsEmpty(); // Function TslGame.*15af126757.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58e7748
	bool Peek(); // Function TslGame.*15af126757.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x58f3880
};

// Class TslGame.*67959495a3
// Size: 0x440 (Inherited: 0x418)
struct U*67959495a3 : U*4bb82286ac {
	char pad_418[0x10]; // 0x418(0x10)
	struct UCurveFloat* *9433be2ba8; // 0x428(0x08)
	struct UCurveFloat* *3a0cbed725; // 0x430(0x08)
	float *f49b5fa255; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class TslGame.*c1bf209890
// Size: 0x500 (Inherited: 0x440)
struct U*c1bf209890 : U*67959495a3 {
	char pad_440[0x8]; // 0x440(0x08)
	struct TArray<struct U*5d2b331e47*> Icons; // 0x448(0x10)
	struct TMap<int32, struct UTexture2D*> *2013149521; // 0x458(0x50)
	struct UHorizontalBox* IconHorizontalBox; // 0x4a8(0x08)
	struct TMap<int32, struct ATslOPBuff*> *81ab1905b0; // 0x4b0(0x50)
};

// Class TslGame.*c7aea00ea4
// Size: 0x478 (Inherited: 0x440)
struct U*c7aea00ea4 : U*67959495a3 {
	struct TArray<struct FLinearColor> *8c4d0b6e53; // 0x440(0x10)
	char pad_450[0x10]; // 0x450(0x10)
	struct UImage* Icon1; // 0x460(0x08)
	struct UImage* Icon2; // 0x468(0x08)
	struct UImage* Icon3; // 0x470(0x08)
};

// Class TslGame.*665aa2b397
// Size: 0x4f0 (Inherited: 0x418)
struct U*665aa2b397 : U*4bb82286ac {
	struct F*2ef3a887d0 *07fafb44e1; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
	struct U*c1bf209890* MyBuffWidget; // 0x428(0x08)
	struct UCanvasPanel* BuffHeadManagerCanvasPanel; // 0x430(0x08)
	struct UScaleBox* TPP_Box; // 0x438(0x08)
	struct UScaleBox* FPP_Box; // 0x440(0x08)
	struct UScaleBox* FPPWithMonsterHp_Box; // 0x448(0x08)
	struct UScaleBox* IconBox; // 0x450(0x08)
	struct UClass* *3d613f1099; // 0x458(0x08)
	struct UClass* *465468c173; // 0x460(0x08)
	struct TMap<struct ATslCharacter*, struct U*67959495a3*> *36e9adf88f; // 0x468(0x50)
	struct TArray<struct U*c1bf209890*> *295a63644c; // 0x4b8(0x10)
	struct TArray<struct U*c7aea00ea4*> *ac73fbb041; // 0x4c8(0x10)
	float *87bf2b1955; // 0x4d8(0x04)
	float *3ecff59cae; // 0x4dc(0x04)
	char pad_4E0[0x10]; // 0x4e0(0x10)

	void *72345d8cb9(); // Function TslGame.*665aa2b397.*72345d8cb9 // Final|Native|Protected // @ game+0x58fab30
	struct AActor* OnUpdateViewTarget(); // Function TslGame.*665aa2b397.OnUpdateViewTarget // Final|Native|Protected // @ game+0x58f1b24
};

// Class TslGame.*941fabb013
// Size: 0x468 (Inherited: 0x418)
struct U*941fabb013 : U*4bb82286ac {
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x418(0x08)
	struct U*0cc224a1f2* PointWidget; // 0x420(0x08)
	struct U*0cc224a1f2* KillWidget; // 0x428(0x08)
	struct U*0cc224a1f2* AliveWidget; // 0x430(0x08)
	struct U*bf8220a9e7* MonsterHpWidget; // 0x438(0x08)
	struct FName *c1b0a666cd; // 0x440(0x08)
	struct UClass* *ea54d48e58; // 0x448(0x08)
	struct U*25488f9f87* *37d7e8a056; // 0x450(0x08)
	char pad_458[0x10]; // 0x458(0x10)

	int32 OnKillCountChanged(); // Function TslGame.*941fabb013.OnKillCountChanged // Final|Native|Protected // @ game+0x58ec128
	struct AActor* OnViewTargetUpdate(); // Function TslGame.*941fabb013.OnViewTargetUpdate // Final|Native|Protected // @ game+0x58f21bc
	void UpdateCoin(); // Function TslGame.*941fabb013.UpdateCoin // Final|Native|Protected // @ game+0x58fa0b0
	int32 UpdateCoinStackCount(); // Function TslGame.*941fabb013.UpdateCoinStackCount // Final|Native|Protected|HasOutParms // @ game+0x58fa1d0
	int32 *a57d669dbd(); // Function TslGame.*941fabb013.*a57d669dbd // Final|Native|Protected // @ game+0x58e8468
	bool OnMatchStarted(); // Function TslGame.*941fabb013.OnMatchStarted // Final|Native|Protected // @ game+0x58ecde8
	enum class EOPUIMonsterType OnOPModeMonsterAttacked(); // Function TslGame.*941fabb013.OnOPModeMonsterAttacked // Final|Native|Protected // @ game+0x58ee298
};

// Class TslGame.*802e9207fa
// Size: 0x418 (Inherited: 0x418)
struct U*802e9207fa : U*4bb82286ac {
};

// Class TslGame.*e6484d9bf5
// Size: 0x428 (Inherited: 0x418)
struct U*e6484d9bf5 : U*4bb82286ac {
	struct U*f24c7da8ee* ParachuteGaugeWidget; // 0x418(0x08)
	struct U*65fe85154f* ParachuteAirSpeedWidget; // 0x420(0x08)
};

// Class TslGame.*8423c172ed
// Size: 0x430 (Inherited: 0x418)
struct U*8423c172ed : U*4bb82286ac {
	struct USizeBox* FollowGuideSizeBox; // 0x418(0x08)
	struct UWidgetSwitcher* FollowGuideSwitcher; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*f24c7da8ee
// Size: 0x468 (Inherited: 0x418)
struct U*f24c7da8ee : U*4bb82286ac {
	struct USizeBox* FreeFallBar; // 0x418(0x08)
	struct USizeBox* ParachuteFallBar; // 0x420(0x08)
	struct USizeBox* GroundHeightBar; // 0x428(0x08)
	struct UTextBlock* AltitudeText; // 0x430(0x08)
	struct U*9c8bfa0aee* PositionByPlayerAltitude; // 0x438(0x08)
	float *d827fdef12; // 0x440(0x04)
	struct ATslCharacter* ViewTargetCharacter; // 0x444(0x08)
	char pad_44C[0x1c]; // 0x44c(0x1c)

	enum class ESkydiveState SetSkydiveState(); // Function TslGame.*f24c7da8ee.SetSkydiveState // Final|Native|Public // @ game+0x4a7e0c
	struct AActor* UpdateViewTarget(); // Function TslGame.*f24c7da8ee.UpdateViewTarget // Final|Native|Public // @ game+0x4a7f48
};

// Class TslGame.TslPlaneStanceWidget
// Size: 0x458 (Inherited: 0x418)
struct UTslPlaneStanceWidget : U*4bb82286ac {
	struct ATslCharacter* ViewTargetCharacter; // 0x418(0x08)
	struct UImage* PlaneImage; // 0x420(0x08)
	struct UGridPanel* SeatPanel; // 0x428(0x08)
	struct FName StateParamName; // 0x430(0x08)
	struct UTextBlock* RiderCountText; // 0x438(0x08)
	struct TArray<struct UImage*> *c80d727f7a; // 0x440(0x10)
	char pad_450[0x8]; // 0x450(0x08)

	struct AActor* UpdateViewTarget(); // Function TslGame.TslPlaneStanceWidget.UpdateViewTarget // Final|Native|Public // @ game+0xc3a010
};

// Class TslGame.TslPlatoonCarePackageDropIndicatorWidget
// Size: 0x420 (Inherited: 0x418)
struct UTslPlatoonCarePackageDropIndicatorWidget : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)

	enum class EPlatoonSupportRequestEventType BP_UpdateIconImage(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconImage // Event|Public|BlueprintEvent // @ game+0x22c9a0
	enum class EPlatoonCarePackageType BP_UpdateIconType(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconType // Event|Public|BlueprintEvent // @ game+0x22c9a0
};

// Class TslGame.*5a351c5e25
// Size: 0x470 (Inherited: 0x418)
struct U*5a351c5e25 : U*4bb82286ac {
	struct UButton* CommandButton; // 0x418(0x08)
	struct UTslPlatoonCommandWidget* *74d2a67712; // 0x420(0x08)
	struct ATslGameState* *662f0170ce; // 0x428(0x08)
	struct U*e04a683c46* MultipleKeyIconWidget; // 0x430(0x08)
	struct F*0c033c3537 *7a6ee64f6d; // 0x438(0x28)
	enum class *8efa41bcb0 *ba0b49d026; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	float *9efd00caa3; // 0x464(0x04)
	float *3979ee624f; // 0x468(0x04)
	bool *4b41063894; // 0x46c(0x01)
	bool *4a60a0428d; // 0x46d(0x01)
	bool *68e59dbd0a; // 0x46e(0x01)
	char pad_46F[0x1]; // 0x46f(0x01)

	bool BP_UpdateClickability(); // Function TslGame.*5a351c5e25.BP_UpdateClickability // Event|Public|BlueprintEvent // @ game+0x22c9a0
	float BP_UpdateProgress(); // Function TslGame.*5a351c5e25.BP_UpdateProgress // Event|Public|BlueprintEvent // @ game+0x22c9a0
	struct FName OnMatchStateChanged(); // Function TslGame.*5a351c5e25.OnMatchStateChanged // Final|Native|Public // @ game+0x58ed030
	struct F*98fbf2194a OnUpdatePlatoonFireSupportState(); // Function TslGame.*5a351c5e25.OnUpdatePlatoonFireSupportState // Final|Native|Public|HasOutParms // @ game+0x58f1848
	bool BP_UpdateEnablity(); // Function TslGame.*5a351c5e25.BP_UpdateEnablity // Event|Public|BlueprintEvent // @ game+0x22c9a0
	void OnButtonClicked(); // Function TslGame.*5a351c5e25.OnButtonClicked // Final|Native|Public // @ game+0x58e92c4
	bool BP_UpdateHighlight(); // Function TslGame.*5a351c5e25.BP_UpdateHighlight // Event|Public|BlueprintEvent // @ game+0x22c9a0
	struct FText BP_UpdateCommandType(); // Function TslGame.*5a351c5e25.BP_UpdateCommandType // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22c9a0
	struct F*a7198b60ca OnUpdatePlatoonCarePackageState(); // Function TslGame.*5a351c5e25.OnUpdatePlatoonCarePackageState // Final|Native|Public|HasOutParms // @ game+0x58f1794
};

// Class TslGame.TslPlatoonCommandWidget
// Size: 0x490 (Inherited: 0x418)
struct UTslPlatoonCommandWidget : U*4bb82286ac {
	struct UClass* *d4ae7d2613; // 0x418(0x08)
	struct U*b10fd16d88* *e3d40387f2; // 0x420(0x08)
	struct U*d519ef66f2* ButtonPanel; // 0x428(0x08)
	bool *5d2cc1f6b1; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct TMap<enum class *8efa41bcb0, struct U*5a351c5e25*> *8f6633aab4; // 0x438(0x50)
	struct U*5a351c5e25* *05aa95e56c; // 0x488(0x08)

	struct F*4cf7537d4a UpdateButtonsByManifest(); // Function TslGame.TslPlatoonCommandWidget.UpdateButtonsByManifest // Final|Native|Public|HasOutParms // @ game+0x58f9fe0
};

// Class TslGame.*b7a24ef0f5
// Size: 0x420 (Inherited: 0x418)
struct U*b7a24ef0f5 : U*4bb82286ac {
	struct UTextBlock* BindTextDescription; // 0x418(0x08)
};

// Class TslGame.*a43c3e3519
// Size: 0x500 (Inherited: 0x418)
struct U*a43c3e3519 : U*4bb82286ac {
	struct UBorder* BindBorderNumberBg; // 0x418(0x08)
	struct UTextBlock* BindTextNumber; // 0x420(0x08)
	struct U*48db345949* BindWidgetPubgId; // 0x428(0x08)
	struct UWidget* BindWidgetDisable; // 0x430(0x08)
	struct UTextBlock* BindTextDisableText; // 0x438(0x08)
	struct UWidget* BindWidgetSelected; // 0x440(0x08)
	char pad_448[0xb8]; // 0x448(0xb8)
};

// Class TslGame.*2ba121e39d
// Size: 0x500 (Inherited: 0x500)
struct U*2ba121e39d : U*a43c3e3519 {
};

// Class TslGame.*c911e38abf
// Size: 0x500 (Inherited: 0x500)
struct U*c911e38abf : U*a43c3e3519 {
};

// Class TslGame.*7da164536d
// Size: 0x468 (Inherited: 0x418)
struct U*7da164536d : U*4bb82286ac {
	float *7cd813c40c; // 0x418(0x04)
	char pad_41C[0xc]; // 0x41c(0x0c)
	struct F*a2a8693a5f FadeInAnimation_Binder; // 0x428(0x20)
	struct F*a2a8693a5f FadeOutAnimation_Binder; // 0x448(0x20)
};

// Class TslGame.*6f9f882ed0
// Size: 0x4d0 (Inherited: 0x418)
struct U*6f9f882ed0 : U*4bb82286ac {
	struct F*a2a8693a5f CountDownAnim_Ready; // 0x418(0x20)
	struct F*a2a8693a5f CountDownAnim_4; // 0x438(0x20)
	struct F*a2a8693a5f CountDownAnim_3; // 0x458(0x20)
	struct F*a2a8693a5f CountDownAnim_2; // 0x478(0x20)
	struct F*a2a8693a5f CountDownAnim_Go; // 0x498(0x20)
	struct UAkAudioEvent* *8de5598d14; // 0x4b8(0x08)
	struct UAkAudioEvent* *51fd327bce; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	int32 CountAnimPlay(); // Function TslGame.*6f9f882ed0.CountAnimPlay // Final|Native|Protected // @ game+0x58e45ec
};

// Class TslGame.*da56e8773e
// Size: 0x460 (Inherited: 0x418)
struct U*da56e8773e : U*4bb82286ac {
	struct F*62d95f3263 *ec070bb06d; // 0x418(0x20)
	struct F*aecf96cb1e *ec791d5af5; // 0x438(0x28)
};

// Class TslGame.*319baa1a20
// Size: 0x4d0 (Inherited: 0x460)
struct U*319baa1a20 : U*da56e8773e {
	struct F*45518ccbeb UserPlatformImageWidget; // 0x460(0x20)
	struct F*62d95f3263 *a4d616be58; // 0x480(0x20)
	struct F*62d95f3263 *f8635bee0b; // 0x4a0(0x20)
	struct FString *c1897f0c10; // 0x4c0(0x10)

	struct ATslRacingPlayerState* SetUserRankingInformation(); // Function TslGame.*319baa1a20.SetUserRankingInformation // Final|Native|Public|BlueprintCallable // @ game+0x58f8efc
};

// Class TslGame.*8ad806a35e
// Size: 0x4d8 (Inherited: 0x418)
struct U*8ad806a35e : U*4bb82286ac {
	struct TArray<struct U*319baa1a20*> *e35d36e5fb; // 0x418(0x10)
	struct UClass* *0d8a2404eb; // 0x428(0x08)
	struct F*0c033c3537 *921be58687; // 0x430(0x28)
	struct F*0c033c3537 *c43b11a7cb; // 0x458(0x28)
	struct F*62d95f3263 *fd452fa58c; // 0x480(0x20)
	struct F*62d95f3263 *a6f90952fb; // 0x4a0(0x20)
	int32 *75b790833a; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct ATslRacingPlayerState* *0659acd91d; // 0x4c8(0x08)
	char pad_4D0[0x8]; // 0x4d0(0x08)

	void UpdateRankingList(); // Function TslGame.*8ad806a35e.UpdateRankingList // Final|Native|Public|BlueprintCallable // @ game+0x58facf8
	struct AActor* OnUpdateViewTarget(); // Function TslGame.*8ad806a35e.OnUpdateViewTarget // Final|Native|Public // @ game+0x58f1bb4
};

// Class TslGame.*3f3a5820a9
// Size: 0x4f8 (Inherited: 0x418)
struct U*3f3a5820a9 : U*4bb82286ac {
	struct F*62d95f3263 *3d0f1071c9; // 0x418(0x20)
	struct F*62d95f3263 *421bf218ec; // 0x438(0x20)
	struct F*62d95f3263 *aac8389186; // 0x458(0x20)
	char pad_478[0x8]; // 0x478(0x08)
	struct F*aecf96cb1e *a794e350d8; // 0x480(0x28)
	int32 *0336cf1d2c; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)
	struct F*a2a8693a5f CheckPointReachAnim; // 0x4b0(0x20)
	struct F*c0b2c1bc8a *a943b49c2f; // 0x4d0(0x28)
};

// Class TslGame.*58cb7d1fe9
// Size: 0x570 (Inherited: 0x418)
struct U*58cb7d1fe9 : U*4bb82286ac {
	char pad_418[0x8]; // 0x418(0x08)
	struct UTexture2D* *e22991da7d; // 0x420(0x08)
	struct UTexture2D* *fb778d2ae0; // 0x428(0x08)
	float *c5c94f7861; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct F*a8249d5e73 *4bb291225e; // 0x438(0x30)
