// ScriptStruct RoadRuntime.*f506fe5f2e
// Size: 0x20 (Inherited: 0x00)
struct F*f506fe5f2e {
	struct UStaticMesh* Prototype; // 0x00(0x08)
	struct AActor* Owner; // 0x08(0x08)
	struct UStaticMeshComponent* SideMesh; // 0x10(0x08)
	int32 *be4c9213d1; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*7263eaa3e8
// Size: 0x18 (Inherited: 0x00)
struct F*7263eaa3e8 {
	struct UClass* Prototype; // 0x00(0x08)
	struct AActor* *4baed63902; // 0x08(0x08)
	int32 *be4c9213d1; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct RoadRuntime.*96ad294bdd
// Size: 0x20 (Inherited: 0x00)
struct F*96ad294bdd {
	struct UStaticMesh* Prototype; // 0x00(0x08)
	struct AActor* Owner; // 0x08(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* *a5fff62a89; // 0x10(0x08)
	int32 *be4c9213d1; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*9c292078c3
// Size: 0x88 (Inherited: 0x00)
struct F*9c292078c3 {
	struct AActor* Owner; // 0x00(0x08)
	struct UStaticMesh* Prototype; // 0x08(0x08)
	struct UStaticMesh* *bdb7ae00d4; // 0x10(0x08)
	struct UStaticMesh* *e352647b2d; // 0x18(0x08)
	struct TArray<struct USplineMeshComponent*> *46f12f20fb; // 0x20(0x10)
	struct USplineComponent* Spline; // 0x30(0x08)
	int32 *3d0fc0215d; // 0x38(0x04)
	int32 *be4c9213d1; // 0x3c(0x04)
	int32 *25eea45ca0; // 0x40(0x04)
	int32 *dfe2620da0; // 0x44(0x04)
	struct FVector Offset; // 0x48(0x0c)
	struct FVector Scale; // 0x54(0x0c)
	bool *278406df02; // 0x60(0x01)
	bool StartEnable; // 0x61(0x01)
	bool EndEnable; // 0x62(0x01)
	char pad_63[0x5]; // 0x63(0x05)
	struct FInterpCurveVector *5a751077c8; // 0x68(0x18)
	float *a4683f2aca; // 0x80(0x04)
	float *67d13022de; // 0x84(0x04)
};

// ScriptStruct RoadRuntime.*a6b3620a40
// Size: 0x20 (Inherited: 0x00)
struct F*a6b3620a40 {
	struct UClass* Prototype; // 0x00(0x08)
	struct TArray<struct AActor*> *5a328fc7cf; // 0x08(0x10)
	int32 *be4c9213d1; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct RoadRuntime.*77c6bd330f
// Size: 0x20 (Inherited: 0x00)
struct F*77c6bd330f {
	struct FVector Position; // 0x00(0x0c)
	struct FVector Tangent; // 0x0c(0x0c)
	float Scale; // 0x18(0x04)
	float Roll; // 0x1c(0x04)
};

