// Class Slate.*5cffd0ec28
// Size: 0x2d8 (Inherited: 0x30)
struct U*5cffd0ec28 : USlateWidgetStyleContainerBase {
	struct F*9ec348ba05 ButtonStyle; // 0x30(0x2a8)
};

// Class Slate.*15cb5eab22
// Size: 0x610 (Inherited: 0x30)
struct U*15cb5eab22 : USlateWidgetStyleContainerBase {
	struct F*1a5b392735 *1a5b392735; // 0x30(0x5e0)
};

// Class Slate.*72c64b66d1
// Size: 0x458 (Inherited: 0x30)
struct U*72c64b66d1 : USlateWidgetStyleContainerBase {
	struct F*bd10a39d4e *bd10a39d4e; // 0x30(0x428)
};

// Class Slate.*3f11785778
// Size: 0x410 (Inherited: 0x30)
struct U*3f11785778 : USlateWidgetStyleContainerBase {
	struct F*9d51d380eb *9d51d380eb; // 0x30(0x3e0)
};

// Class Slate.*c47121f9a2
// Size: 0x8a0 (Inherited: 0x30)
struct U*c47121f9a2 : USlateWidgetStyleContainerBase {
	struct F*fcc5c4062b *fcc5c4062b; // 0x30(0x870)
};

// Class Slate.*87a88cac2f
// Size: 0x278 (Inherited: 0x30)
struct U*87a88cac2f : USlateWidgetStyleContainerBase {
	struct F*05b420497f *05b420497f; // 0x30(0x248)
};

// Class Slate.*17e2a4548a
// Size: 0x1e8 (Inherited: 0x30)
struct U*17e2a4548a : USlateWidgetStyleContainerBase {
	struct F*3de0585264 ProgressBarStyle; // 0x30(0x1b8)
};

// Class Slate.*35a9314e37
// Size: 0x548 (Inherited: 0x30)
struct U*35a9314e37 : USlateWidgetStyleContainerBase {
	struct F*c846317fd2 *c846317fd2; // 0x30(0x518)
};

// Class Slate.*b8318391aa
// Size: 0x278 (Inherited: 0x30)
struct U*b8318391aa : USlateWidgetStyleContainerBase {
	struct F*8d916b2b30 *8d916b2b30; // 0x30(0x248)
};

// Class Slate.SlateSettings
// Size: 0x30 (Inherited: 0x28)
struct USlateSettings : UObject {
	bool bVirtualKeyboardSendsTextChanged; // 0x28(0x01)
	bool bVirtualKeyboardDisplayOnFocus; // 0x29(0x01)
	bool bExplicitCanvasChildZOrder; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// Class Slate.*553f36d19c
// Size: 0x340 (Inherited: 0x30)
struct U*553f36d19c : USlateWidgetStyleContainerBase {
	struct F*abe8d1c913 *abe8d1c913; // 0x30(0x310)
};

// Class Slate.*23a8c5cbbf
// Size: 0x238 (Inherited: 0x30)
struct U*23a8c5cbbf : USlateWidgetStyleContainerBase {
	struct F*e84d4b475c *e84d4b475c; // 0x30(0x208)
};

