// BlueprintGeneratedClass AnimNotify_AkEvent.AnimNotify_AkEvent_C
// Size: 0x68 (Inherited: 0x68)
struct UAnimNotify_AkEvent_C : UAnimNotify_AkEvent {
	struct UAkAudioEvent* AkEvent; // 0x40(0x08)
	struct U*9953ce0aaa* EventData; // 0x48(0x08)
	struct FName EventDataTag; // 0x50(0x08)
	bool bFollowOwner; // 0x58(0x01)
	float MaxPlayRange; // 0x5c(0x04)
	bool bMuteOnPlayingEmote; // 0x60(0x01)
	bool bMuteOnPlayingMoveEmote; // 0x61(0x01)
	bool bIsLocalPlayerTypeInPreview; // 0x62(0x01)
};

