// BlueprintGeneratedClass BP_ItemRequestManager.BP_ItemRequestManager_C
// Size: 0x500 (Inherited: 0x500)
struct UBP_ItemRequestManager_C : U*be1d2a49bc {
	struct U*af5a42646d* *9d8e3a5cd8; // 0x30(0x08)
	float *6a4c2275c7; // 0x38(0x04)
	float *7a40d826e6; // 0x3c(0x04)
	float *b6fb57569b; // 0x40(0x04)
	float *6b5612b9ab; // 0x44(0x04)
	float *a0584a9c74; // 0x48(0x04)
	float *df6093734b; // 0x4c(0x04)
	float *e1cf0335a7; // 0x50(0x04)
	float *d23fc723b1; // 0x54(0x04)
	float *44f774c622; // 0x58(0x04)
	bool *794cd4d3d6; // 0x5c(0x01)
	bool *267443acc4; // 0x5d(0x01)
	struct FName *9998419eca; // 0x60(0x08)
	struct FName *161ed427fd; // 0x68(0x08)
	struct TMap<struct FName, int32> *0ac7cad9c5; // 0x70(0x50)
	struct TMap<enum class ERadioMessageCategory, struct FName> *e60cac965c; // 0xc0(0x50)
	struct TArray<struct FName> *9ce4358e8d; // 0x110(0x10)
	struct FString *f78ee433b4; // 0x120(0x10)
	struct FText *4f978f41fb; // 0x130(0x18)
	struct FText *527b665cc2; // 0x148(0x18)
	struct FName *391a953d71; // 0x160(0x08)

	void OnInputPressed(); // Function TslGame.*be1d2a49bc.OnInputPressed // Final|Native|Public // @ game+0x5e9b140
	void *437c5b30d9(struct ATslPlayerState* Param0, int32 Param1); // Function TslGame.*be1d2a49bc.*437c5b30d9 // Final|Native|Private // @ game+0x5e9bec0
	void OnInputReleased(); // Function TslGame.*be1d2a49bc.OnInputReleased // Final|Native|Public // @ game+0x5e9b154
	void *f38ea44167(); // Function TslGame.*be1d2a49bc.*f38ea44167 // Final|Native|Public|HasOutParms // @ game+0x5e9ab38
	void *eb8d12c0fb(struct FName Param2); // Function TslGame.*be1d2a49bc.*eb8d12c0fb // Final|Native|Private|HasOutParms // @ game+0x5e9bf9c
};

