// BlueprintGeneratedClass BP_ItemRecommendManager.BP_ItemRecommendManager_C
// Size: 0x120 (Inherited: 0x120)
struct UBP_ItemRecommendManager_C : U*c0ae19946a {
	struct TMap<struct UObject*, struct AActor*> *843d45bb3f; // 0x48(0x50)
	struct TArray<struct AActor*> *56f4c43b9c; // 0x98(0x10)
	float *c5ba80a4dd; // 0xbc(0x04)
	float *323ac7e71b; // 0xc0(0x04)
	float *0e637d33de; // 0xc4(0x04)
	struct UClass* *e5ffc7ce2c; // 0xc8(0x08)
	float *dea4045070; // 0xd0(0x04)
	int32 *9412b87e82; // 0xd4(0x04)
};

