// WidgetBlueprintGeneratedClass BP_PcOptionCloudSavingCoverWidget.BP_PcOptionCloudSavingCoverWidget_C
// Size: 0x568 (Inherited: 0x568)
struct UBP_PcOptionCloudSavingCoverWidget_C : U*f9bad00600 {
	struct U*9c8bfa0aee* Cover_Fade_In; // 0x468(0x08)
	struct U*9c8bfa0aee* Cover_Fade_Out; // 0x470(0x08)
	struct U*9c8bfa0aee* Warning_Fade_In; // 0x478(0x08)
	struct U*9c8bfa0aee* Warning_Fade_Out; // 0x480(0x08)
	struct UTextBlock* Waiting_Text; // 0x488(0x08)
	struct USizeBox* Warning_SizeBox; // 0x490(0x08)
	struct UTextBlock* Warning_Text; // 0x498(0x08)
	struct U*8bb837196a* *d610e596b4; // 0x4a0(0x08)

	void *b088976c54(); // Function TslGame.*f9bad00600.*b088976c54 // Final|Native|Public // @ game+0x5eb7d50
	void *6e545f8a1e(); // Function TslGame.*f9bad00600.*6e545f8a1e // Final|Native|Public // @ game+0x5ebdcf4
};

