// WidgetBlueprintGeneratedClass BP_PcOptionKeyBinderSlotWidget.BP_PcOptionKeyBinderSlotWidget_C
// Size: 0x528 (Inherited: 0x528)
struct UBP_PcOptionKeyBinderSlotWidget_C : U*42c901fa00 {
	struct TArray<struct FKey> *5970a1089a; // 0x418(0x10)
	struct U*e43b170799* Owner; // 0x428(0x08)
	int32 SlotIndex; // 0x430(0x04)
	bool *260258136b; // 0x434(0x01)
	bool *6e0192cc60; // 0x435(0x01)
	bool *cfb20153d9; // 0x436(0x01)
	bool *cc23b79b0a; // 0x437(0x01)
	struct TArray<struct FKey> *833244cddb; // 0x438(0x10)
	struct FTslInputKey *278ad31c77; // 0x448(0x20)
	struct FTslInputKey *98966d6235; // 0x468(0x20)
	bool bForceToUseLeftModifierKeys; // 0x488(0x01)
	struct F*a8249d5e73 InputKeyDisplayBorder_Binder; // 0x490(0x30)
	struct F*54c30817ee InputKeyIconizer_Binder; // 0x4c0(0x20)
	struct F*54c30817ee Highlighter_Binder; // 0x4e0(0x20)
	struct UTexture2D* BackgroundTextureNormal; // 0x500(0x08)
	struct UTexture2D* BackgroundTextureHighlighted; // 0x508(0x08)
	struct UTexture2D* BackgroundTextureInput; // 0x510(0x08)
	struct FMulticastDelegate OnKeyBinderSlotValueChangeEvent; // 0x518(0x10)
};

