// BlueprintGeneratedClass BP_RadioMessageManager.BP_RadioMessageManager_C
// Size: 0x620 (Inherited: 0x620)
struct UBP_RadioMessageManager_C : U*3e31e83ce5 {
	bool *9a31c9f4ce; // 0x500(0x01)
	struct UStringTable* *a6118baf04; // 0x508(0x08)
	struct UDataTable* *3a90b1b2e5; // 0x510(0x08)
	struct UDataTable* *e9f54840d8; // 0x518(0x08)
	float *7ed1638dd5; // 0x520(0x04)
	float *991e8b284f; // 0x524(0x04)
	int32 *934ee6c685; // 0x528(0x04)
	float *d82d8d609f; // 0x52c(0x04)
	int32 *ff49ff312e; // 0x530(0x04)
	float *e99b25a3ab; // 0x534(0x04)
	float *2c7067b291; // 0x538(0x04)
	float *c8d2d34076; // 0x53c(0x04)
	float *cc20e38364; // 0x540(0x04)
	struct TArray<float> *b2ad26c24e; // 0x548(0x10)
	SetProperty *48fc9b3b15; // 0x5a0(0x50)
	struct UStringTable* *1c19dea930; // 0x608(0x08)
	struct TArray<enum class EGameModeType> *0e2e3681fd; // 0x610(0x10)
};

