// BlueprintGeneratedClass ItemDataTableManager.ItemDataTableManager_C
// Size: 0x510 (Inherited: 0x510)
struct UItemDataTableManager_C : U*e3490ef9b0 {
	struct F*2b618139e4 *713e0a920c; // 0x70(0x190)
	struct TArray<struct UDataTable*> Tables; // 0x208(0x10)
	struct F*cc544727c4 *cc544727c4; // 0x308(0xa0)
	struct TArray<struct FName> *7ef4c79de4; // 0x408(0x10)
	struct TArray<struct FName> *6eca8daa25; // 0x418(0x10)
	struct TArray<struct FName> *94a2858007; // 0x428(0x10)
	struct TArray<struct FName> *e307ae250e; // 0x438(0x10)
	struct TArray<struct FName> *c5f3c1cdb6; // 0x448(0x10)
	struct TArray<struct FName> *6f8907266f; // 0x458(0x10)
	struct TArray<struct FName> *7728dcf861; // 0x468(0x10)
	struct TArray<struct FName> *18d8267bff; // 0x478(0x10)
	struct TArray<struct FName> *3784f807f8; // 0x488(0x10)
	struct TArray<struct FName> *68410ce80d; // 0x498(0x10)
	struct TArray<struct FName> *189c7acf6b; // 0x4a8(0x10)
	struct TArray<struct FName> *779a903b91; // 0x4b8(0x10)
	struct TArray<struct FName> *823197347d; // 0x4c8(0x10)
	struct TArray<struct FName> *1663008bf5; // 0x4d8(0x10)
	struct TArray<struct FName> *f6a13c81a2; // 0x4e8(0x10)
	struct TArray<struct FName> *4927443904; // 0x4f8(0x10)
};

