// ScriptStruct LevelSequence.*ca88314d44
// Size: 0x38 (Inherited: 0x00)
struct F*ca88314d44 {
	struct UObject* *67320f8129; // 0x00(0x1c)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FString ComponentName; // 0x20(0x10)
	struct UObject* *3d7bc952af; // 0x30(0x08)
};

// ScriptStruct LevelSequence.*dd4f27231a
// Size: 0x50 (Inherited: 0x00)
struct F*dd4f27231a {
	struct TMap<struct FGuid, struct F*99b8acabcf> *2ca8877a56; // 0x00(0x50)
};

// ScriptStruct LevelSequence.*99b8acabcf
// Size: 0x10 (Inherited: 0x00)
struct F*99b8acabcf {
	struct TArray<struct F*9928b19bde> References; // 0x00(0x10)
};

// ScriptStruct LevelSequence.*9928b19bde
// Size: 0x20 (Inherited: 0x00)
struct F*9928b19bde {
	struct FString PackageName; // 0x00(0x10)
	struct FString ObjectPath; // 0x10(0x10)
};

// ScriptStruct LevelSequence.*62e13bb56e
// Size: 0x50 (Inherited: 0x00)
struct F*62e13bb56e {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct LevelSequence.*9c76f3bd74
// Size: 0x20 (Inherited: 0x00)
struct F*9c76f3bd74 {
	char pad_0[0x20]; // 0x00(0x20)
};

// ScriptStruct LevelSequence.*c11ee53966
// Size: 0x50 (Inherited: 0x00)
struct F*c11ee53966 {
	struct FText MasterName; // 0x00(0x18)
	float MasterTime; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FText CurrentShotName; // 0x20(0x18)
	float CurrentShotLocalTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UCameraComponent* CameraComponent; // 0x40(0x08)
	struct F*2e3d6fa719 Settings; // 0x48(0x08)
};

// ScriptStruct LevelSequence.*2e3d6fa719
// Size: 0x08 (Inherited: 0x00)
struct F*2e3d6fa719 {
	bool ZeroPadAmount; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float FrameRate; // 0x04(0x04)
};

// ScriptStruct LevelSequence.*130cbb6fd6
// Size: 0x01 (Inherited: 0x00)
struct F*130cbb6fd6 {
	char pad_0[0x1]; // 0x00(0x01)
};

