// ScriptStruct MapStatCollector.*52ea8d2f8b
// Size: 0x48 (Inherited: 0x00)
struct F*52ea8d2f8b {
	struct FName Name; // 0x00(0x08)
	struct FBox2D SamplingArea; // 0x08(0x14)
	char pad_1C[0x4]; // 0x1c(0x04)
	double GroundHeight; // 0x20(0x08)
	double PointInterval; // 0x28(0x08)
	double RayDistance; // 0x30(0x08)
	double HeightOffset; // 0x38(0x08)
	double SearchRadius; // 0x40(0x08)
};

// ScriptStruct MapStatCollector.*ea5510da75
// Size: 0x20 (Inherited: 0x00)
struct F*ea5510da75 {
	struct FString MapName; // 0x00(0x10)
	struct FString *004719a261; // 0x10(0x10)
};

// ScriptStruct MapStatCollector.*3cd4840a8d
// Size: 0x20 (Inherited: 0x00)
struct F*3cd4840a8d {
	struct FString StatName; // 0x00(0x10)
	struct FString *15083cfc31; // 0x10(0x10)
};

