// BlueprintGeneratedClass ProjMolotov_Fragment.ProjMolotov_Fragment_C
// Size: 0x960 (Inherited: 0x960)
struct AProjMolotov_Fragment_C : ATslProjectileMolotov {
	enum class *68550269ed *5e6ea6e067; // 0x8c8(0x01)
	struct UParticleSystemComponent* *b63c8e7932; // 0x8d0(0x08)
	struct UClass* *df7aa1513d; // 0x8d8(0x08)
	struct FName *1fe0f7de84; // 0x8e0(0x08)
	float *dc2986f4e8; // 0x8e8(0x04)
	struct UClass* *410b125fa7; // 0x8f0(0x08)
	struct UClass* *ba4ff9a27f; // 0x8f8(0x08)
	struct UClass* *ff50f7c4fa; // 0x900(0x08)
	struct UClass* *09fe048bad; // 0x908(0x08)
	struct UClass* *8f2132552b; // 0x910(0x08)
	float *953bd05931; // 0x918(0x04)
	struct UClass* *b71588a39a; // 0x920(0x08)
	struct UClass* *5a52ac582a; // 0x928(0x08)
	struct ATslParticle* *d43c72a561; // 0x930(0x08)
	int32 *6763f0d0aa; // 0x938(0x04)

	void *23e5f2b15b(); // Function TslGame.TslProjectileMolotov.*23e5f2b15b // Final|Native|Public // @ game+0x5ea1048
	void SimulationVolumetricSpreadTick_BP(); // Function TslGame.TslProjectileMolotov.SimulationVolumetricSpreadTick_BP // Native|Event|Public|BlueprintEvent // @ game+0xc06800
};

