// BlueprintGeneratedClass TslCaptureLobby.TslCaptureLobby_C
// Size: 0x486 (Inherited: 0x400)
struct ATslCaptureLobby_C : ALevelScriptActor {
	struct F*a6c93df757 UberGraphFrame; // 0x400(0x08)
	struct ALobbyViewMode_C* ViewModeStudio; // 0x408(0x08)
	struct ATslWeapon* TslWeapon; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct FTransform UiCameraTM; // 0x420(0x30)
	struct FTransform ViewModeTM; // 0x450(0x30)
	bool bLeft; // 0x480(0x01)
	bool bright; // 0x481(0x01)
	bool bUp; // 0x482(0x01)
	bool bDown; // 0x483(0x01)
	bool AddView; // 0x484(0x01)
	bool MinusView; // 0x485(0x01)

	struct FKey InpActEvt_Backslash_*bcd26d28fe_26(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Backslash_*bcd26d28fe_26 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Left_*bcd26d28fe_25(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*bcd26d28fe_25 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Left_*bcd26d28fe_24(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*bcd26d28fe_24 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Right_*bcd26d28fe_23(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*bcd26d28fe_23 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Right_*bcd26d28fe_22(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*bcd26d28fe_22 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Up_*bcd26d28fe_21(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*bcd26d28fe_21 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Up_*bcd26d28fe_20(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*bcd26d28fe_20 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Down_*bcd26d28fe_19(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*bcd26d28fe_19 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_Down_*bcd26d28fe_18(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*bcd26d28fe_18 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_LeftBracket_*bcd26d28fe_17(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*bcd26d28fe_17 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_LeftBracket_*bcd26d28fe_16(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*bcd26d28fe_16 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_RightBracket_*bcd26d28fe_15(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*bcd26d28fe_15 // BlueprintEvent // @ game+0x370fbc
	struct FKey InpActEvt_RightBracket_*bcd26d28fe_14(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*bcd26d28fe_14 // BlueprintEvent // @ game+0x370fbc
	void ReceiveTick(float DeltaSeconds); // Function TslCaptureLobby.TslCaptureLobby_C.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x370fbc
	bool ExecuteUbergraph_TslCaptureLobby(int32 EntryPoint, struct FKey _bcd26d28fe_Key11, struct FKey _bcd26d28fe_Key8, struct FKey _bcd26d28fe_Key7, struct FKey ___struct_Variable3, struct FKey _bcd26d28fe_Key6, struct FKey ___struct_Variable5, struct FKey _bcd26d28fe_Key2, struct FKey _bcd26d28fe_Key, struct FKey ___struct_Variable6, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue2, struct FKey _bcd26d28fe_Key13, bool CallFunc_IsValid_ReturnValue3, float CallFunc__c6a9c866fe_ReturnValue5, float CallFunc__c6a9c866fe_ReturnValue6, float CallFunc__ace9454687_ReturnValue5, float CallFunc__ace9454687_ReturnValue6); // Function TslCaptureLobby.TslCaptureLobby_C.ExecuteUbergraph_TslCaptureLobby // HasDefaults // @ game+0x370fbc
};

