// WidgetBlueprintGeneratedClass UI_ActionWheelNumber.UI_ActionWheelNumber_C
// Size: 0x460 (Inherited: 0x460)
struct UUI_ActionWheelNumber_C : U*0566760b99 {
	int32 Number; // 0x418(0x04)
	bool *37789dceb0; // 0x41c(0x01)
	struct UTexture2D* *3c2e8d9ef0; // 0x420(0x08)
	struct UTexture2D* *54c9b590d0; // 0x428(0x08)
	struct FLinearColor *d602ecf29e; // 0x430(0x10)
	struct FLinearColor *db949f2300; // 0x440(0x10)
	struct UBorder* Number_Border; // 0x450(0x08)
	struct UTextBlock* Number_Text; // 0x458(0x08)
};

