// WidgetBlueprintGeneratedClass W_RecoilRotation_Row.W_RecoilRotation_Row_C
// Size: 0x2a4 (Inherited: 0x258)
struct UW_RecoilRotation_Row_C : UUserWidget {
	struct F*a6c93df757 UberGraphFrame; // 0x258(0x08)
	struct UImage* Image_1; // 0x260(0x08)
	struct UTextBlock* TextBlock_ID; // 0x268(0x08)
	struct UTextBlock* TextBlock_RH; // 0x270(0x08)
	struct UTextBlock* TextBlock_RTV; // 0x278(0x08)
	struct UTextBlock* TextBlock_RV; // 0x280(0x08)
	struct UTextBlock* TextBlock_RVal; // 0x288(0x08)
	int32 ID; // 0x290(0x04)
	float CharX; // 0x294(0x04)
	float CharY; // 0x298(0x04)
	float WeapX; // 0x29c(0x04)
	float WeapY; // 0x2a0(0x04)

	void Construct(); // Function W_RecoilRotation_Row.W_RecoilRotation_Row_C.Construct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x370fbc
	void ExecuteUbergraph_W_RecoilRotation_Row(int32 EntryPoint, struct FText CallFunc__62eaa5d275_ReturnValue, struct FText CallFunc__e9b297bd26_ReturnValue, struct FText CallFunc__62eaa5d275_ReturnValue2); // Function W_RecoilRotation_Row.W_RecoilRotation_Row_C.ExecuteUbergraph_W_RecoilRotation_Row // HasDefaults // @ game+0x370fbc
};

