// Enum TslGame.*1d74716a1b
enum class *1d74716a1b : uint8 {
	*a8586366f2,
	*dd5e190745,
	*ac2fdaefd5,
	*1d74716a1b_MAX,
};

// Enum TslGame.ECastCancelReason
enum class ECastCancelReason : uint8 {
	Invalid,
	CasterAiming,
	CasterArming,
	CasterApnea,
	CasterSprinting,
	CasterJumping,
	CasterFallingLong,
	CasterFiring,
	CasterGroggy,
	CasterGroggyOnZeroTimeCast,
	CasterHipped,
	CasterInvalid,
	CasterNotAlive,
	CasterPickedUpDroppedItem,
	CasterPickedUpItemFromPackage,
	CasterReloading,
	CasterRolling,
	CasterTargeting,
	CasterUnarmAttacking,
	CasterVault,
	CasterStanceInvalid,
	CasterFreefalling,
	CastObjectInvalid,
	CastObjectNotExecutable,
	FailedCasterMovementDistCheckOnClient,
	FailedCasterMovementDistCheckOnServer,
	FailedCasterAndCastObjDistCheckOnClient,
	FailedCasterAndCastObjDistCheckOnServer,
	CharacterBeingRevivedDead,
	ManualCancel,
	NewCastOnClient,
	NewCastOnServer,
	VehicleLanding,
	VehicleSeatChanged,
	VehicleMoving,
	VehicleUpsideDown,
	StuntEmoteOnVehicle,
	VehicleJumping,
	EmergencyPickupAircraft,
	CasterAttackByZombieAI,
	BodyCarry,
	CasterStunned,
	VehicleFuelFull,
	CharacterBehaviorNotFound,
	TeamsPlantedBomb,
	ECastCancelReason_MAX,
};

// Enum TslGame.ETargetingType
enum class ETargetingType : uint8 {
	Targeting_None,
	Targeting_Aiming,
	Targeting_Scoping,
	Targeting_MAX,
};

// Enum TslGame.EWeaponAttachmentSlotID
enum class EWeaponAttachmentSlotID : uint8 {
	None,
	Muzzle,
	LowerRail,
	UpperRail,
	Magazine,
	Stock,
	Angled,
	TacPack1,
	TacPack2,
	TacPack3,
	TacPack4,
	DronePackage,
	EWeaponAttachmentSlotID_MAX,
};

// Enum TslGame.ESystemMessageType
enum class ESystemMessageType : uint8 {
	Debug,
	Notify,
	Warning,
	Error,
	Important,
	NotifyCommand,
	ESystemMessageType_MAX,
};

// Enum TslGame.EOutGamePlatformProvider
enum class EOutGamePlatformProvider : uint8 {
	Unknown,
	Bro,
	PcSteam,
	PcDmm,
	PcMailRu,
	PcKakao,
	PcTencent,
	ConsoleXbox,
	ConsolePsn,
	PcLiteGarena,
	PcLiteGlobalAccount,
	PcLiteGlobalAccountJp,
	ConsoleStadia,
	PcEpic,
	AI,
	Max,
	EOutGamePlatformProvider_MAX,
};

// Enum TslGame.EDamageReason
enum class EDamageReason : uint8 {
	None,
	HeadShot,
	TorsoShot,
	PelvisShot,
	ArmShot,
	LegShot,
	NonSpecific,
	Blocked,
	EDamageReason_MAX,
};

// Enum TslGame.EDamageTypeCategory
enum class EDamageTypeCategory : uint8 {
	Damage_None,
	Damage_Instant,
	Damage_Gun,
	Damage_Melee,
	Damage_Punch,
	Damage_ZombiePunch,
	Damage_Groggy,
	Damage_BlueZone,
	Damage_VehicleHit,
	Damage_VehicleCrashHit,
	Damage_Molotov,
	Damage_Explosion,
	Damage_Explosion_Grenade,
	Damage_Explosion_RedZone,
	Damage_Explosion_Vehicle,
	Damage_Explosion_PlantedTimeBomb,
	Damage_Instant_Fall,
	Damage_Drown,
	Damage_BleedOut,
	Damage_Explosion_JerryCan,
	Damage_ZombieBuff,
	Damage_CPPWinExit,
	Damage_MeleeThrow,
	Damage_Explosion_C4,
	Damage_Explosion_StickyBomb,
	Damage_Explosion_Breach,
	Damage_Explosion_PanzerFaustWarhead,
	Damage_Explosion_PanzerFaustWarheadVehicleArmorPenetration,
	Damage_Explosion_PanzerFaustBackBlast,
	Damage_Explosion_Mortar,
	Damage_Explosion_BlackZone,
	Damage_Explosion_Meteor,
	Damage_TrainHit,
	Damage_Explosion_PropaneTank,
	Damage_LootTruckHit,
	Damage_Explosion_LootTruck,
	Damage_ShipHit,
	Damage_Lava,
	Damage_KillTruckHit,
	Damage_KillTruckTurret,
	Damage_HelicopterHit,
	Damage_Explosion_Aircraft,
	Damage_BlueZoneGrenade,
	Damage_FBRMolotov,
	Damage_DronePackage,
	Damage_Monster,
	Damage_Ability,
	Damage_Ability_ChickAttack,
	Damage_Ability_ChickAttack_Wave,
	Damage_Ability_Jump_Wave,
	Damage_Ability_FireBreath,
	Damage_Ability_FeathZone,
	Damage_Rotor,
	Damage_MotorGlider,
	Damage_Gun_Penetrate_BRDM,
	Damage_Explosion_GasPump,
	Damage_Blizzard,
	Damage_SandStorm,
	Damage_CableCarHit,
	Damage_Poision,
	Damage_ZombieDash,
	Damage_MAX,
};

// Enum TslGame.*4f97cb1588
enum class *4f97cb1588 : uint8 {
	*ea877ab8cf,
	*833375ac81,
	*855e36f2ed,
	*4f97cb1588_MAX,
};

// Enum TslGame.ESkydiveState
enum class ESkydiveState : uint8 {
	Skydive_None,
	Skydive_Freefall,
	Skydive_ParachuteDeploying,
	Skydive_ParachuteDeployed,
	Skydive_ParachuteCollapsing,
	Skydive_MAX,
};

// Enum TslGame.EMarkerType
enum class EMarkerType : uint8 {
	Normal,
	Attack,
	Danger,
	Defend,
	Loot,
	Regroup,
	Vehicle,
	EMarkerType_MAX,
};

// Enum TslGame.EPlatoonSupportRequestEventType
enum class EPlatoonSupportRequestEventType : uint8 {
	Start,
	Interactible,
	Finish,
	EPlatoonSupportRequestEventType_MAX,
};

// Enum TslGame.EPlatoonCarePackageType
enum class EPlatoonCarePackageType : uint8 {
	NotDesignated,
	WeaponPackage,
	HealingPackage,
	EPlatoonCarePackageType_MAX,
};

// Enum TslGame.EOPUIMonsterType
enum class EOPUIMonsterType : uint8 {
	None,
	Chicken,
	ZombieTanker,
	ZombieC4,
	MAX,
	EOPUIMonsterType_MAX,
};

// Enum TslGame.EEquipSlotID
enum class EEquipSlotID : uint8 {
	Head,
	Hat,
	Eyes,
	Mask,
	Torso,
	TorsoArmor,
	Outer,
	Backpack,
	Hands,
	Legs,
	Feet,
	Belt,
	Special01,
	Special02,
	WeaponPrimary,
	WeaponSecondary,
	WeaponMelee,
	WeaponThrowable,
	WeaponTacticalGear,
	Bluechip,
	MaxOrNone,
	EEquipSlotID_MAX,
};

// Enum TslGame.EBreathType
enum class EBreathType : uint8 {
	Apnea,
	ADS,
	EBreathType_MAX,
};

// Enum TslGame.ERequestPartyState
enum class ERequestPartyState : uint8 {
	Wait,
	Accept,
	Decline,
	ERequestPartyState_MAX,
};

// Enum TslGame.EBlueBlockerState
enum class EBlueBlockerState : uint8 {
	Show,
	Looping,
	Hide,
	Hidden,
	EBlueBlockerState_MAX,
};

// Enum TslGame.EThrownWeaponType
enum class EThrownWeaponType : uint8 {
	Thrown_Grenade,
	Thrown_Molotov,
	Thrown_Melee,
	Thrown_Trap,
	Thrown_StickyBomb,
	Thrown_C4,
	Thrown_JerryCan,
	Thrown_BZ_Grenade,
	Thrown_TacPack,
	Thrown_TraumaBag,
	Thrown_SpotterScope,
	Thrown_Drone,
	Thrown_BlueChipDetector,
	Thrown_Toolbox,
	Thrown_CanBomb,
	Thrown_SpareTire,
	Thrown_IntegratedRepairKit,
	Thrown_PlantedBombKit,
	Thrown_DefusingBombKit,
	Thrown_Other,
	Thrown_MAX,
};

// Enum TslGame.EPickupAnimType
enum class EPickupAnimType : uint8 {
	None,
	EPickupAnimType_MAX,
};

// Enum TslGame.EHitDirection
enum class EHitDirection : uint8 {
	Hit_Front,
	Hit_Back,
	Hit_Left,
	Hit_Right,
	Hit_MAX,
};

// Enum TslGame.*63c17b6b9e
enum class *63c17b6b9e : uint8 {
	*56e3b69adf,
	*d342a05cfa,
	*7a3b4f75d7,
	*714105863f,
	*fc1888c538,
	*5fd992910f,
	*f12fb390c6,
	*1b231a9b6c,
	*63c17b6b9e_MAX,
};

// Enum TslGame.ECastAnim
enum class ECastAnim : uint8 {
	None,
	Bandage,
	FirstAid,
	Medkit,
	EnergyDrink,
	Painkiller,
	Adrenaline,
	Door,
	Battery,
	Crafting,
	SuperDrink,
	Key,
	EmergencyPickup,
	SelfRevive,
	MortarInstall,
	BicycleDeploy,
	BulletproofShield,
	VehicleSkin,
	UnlockDoor,
	Custom,
	VehicleRepair,
	ArmorRepair,
	BlueChipTower,
	RevivalTransmitter,
	OpenBox,
	PlantedBomb,
	DefusingBomb,
	ECastAnim_MAX,
};

// Enum TslGame.ECharacterNegativeEffects
enum class ECharacterNegativeEffects : uint8 {
	Blind,
	Burning,
	Stun,
	Total,
	ECharacterNegativeEffects_MAX,
};

// Enum TslGame.ETirePunctureReason
enum class ETirePunctureReason : uint8 {
	Shot,
	Environment,
	Explosion,
	PanzerFaustExplosion,
	SkipFX,
	ManualRemoval,
	Other,
	ETirePunctureReason_MAX,
};

// Enum TslGame.ETslSLBStageDifficulty
enum class ETslSLBStageDifficulty : uint8 {
	Easy,
	Normal,
	Hard,
	Max,
	ETslSLBStageDifficulty_MAX,
};

// Enum TslGame.ETslSLBStage
enum class ETslSLBStage : uint8 {
	Stage1,
	Stage2,
	Stage3,
	Stage4,
	Stage5,
	Stage6,
	Max,
	ETslSLBStage_MAX,
};

// Enum TslGame.ETslTrainingType
enum class ETslTrainingType : uint8 {
	Aim_Sound_Lab,
	Grenades,
	FiringRange,
	VehicleSpot,
	GunItemSpot,
	CarShootingRange,
	JumpSchool,
	PracticeRange,
	OneOnOneArena,
	NONE,
	ETslTrainingType_MAX,
};

// Enum TslGame.EVoiceInputMode
enum class EVoiceInputMode : uint8 {
	OpenMic,
	PushToTalk,
	Toggle,
	Disable,
	MAX,
	EVoiceInputMode_MAX,
};

// Enum TslGame.*0d98f68974
enum class *0d98f68974 : uint8 {
	*06c40cb04f,
	*979af9e5f7,
	*b821d6e975,
	*1a3541f7bc,
	*9ea76e9a35,
	*1eae44bf9a,
	*c912ad5320,
	*78606172cb,
	*0d98f68974_MAX,
};

// Enum TslGame.ETslOvercastAction
enum class ETslOvercastAction : uint8 {
	Initialized,
	Prolonged,
	CreateThunder,
	ETslOvercastAction_MAX,
};

// Enum TslGame.EBeginningState
enum class EBeginningState : uint8 {
	Invalid,
	Normal,
	StartIsland,
	Airplane,
	Skydiving,
	Parachuting,
	EBeginningState_MAX,
};

// Enum TslGame.EServerStatType
enum class EServerStatType : uint8 {
	UE,
	NET,
	FRAMEPRO,
	EServerStatType_MAX,
};

// Enum TslGame.EPartnerLevel
enum class EPartnerLevel : uint8 {
	None,
	Normal,
	Lead,
	EPartnerLevel_MAX,
};

// Enum TslGame.EQualityType
enum class EQualityType : uint8 {
	EMainQuality,
	EViewDistanceQuality,
	EShadowQuality,
	EAntiAliasingQuality,
	ETextureQuality,
	EVisualEffectQuality,
	EPostProcessingQuality,
	EFoliageQuality,
	EQualityType_MAX,
};

// Enum TslGame.EReadyToPlayState
enum class EReadyToPlayState : uint8 {
	AllFinished,
	OnPreLoadMap,
	OnPostLoadMap,
	CheckMapLoadFinished,
	NotMapFullyLoaded,
	CheckPreloadingMap,
	LoadMapRequested,
	EReadyToPlayState_MAX,
};

// Enum TslGame.EDistanceBasedEvent
enum class EDistanceBasedEvent : uint8 {
	Undefined,
	Bullet_Hitted_LivingThings,
	Bullet_Hitted_Others,
	Weapon_Gun_Firing,
	Weapon_Grenade_Bounce,
	Weapon_Grenade_Explosion,
	Weapon_Grenade_ExplosionSound,
	Vehicle_Exhausting,
	Vehicle_Crash,
	Character_FootStep,
	Character_Landing,
	MAX,
	EDistanceBasedEvent_MAX,
};

// Enum TslGame.*d1030f7587
enum class *d1030f7587 : uint8 {
	*f167b8c330,
	*01ffeda55d,
	*6117a2c107,
	*09f44dba5c,
	*41652b0b95,
	*53ac0bd9ae,
	*aee42d62ee,
	*d1030f7587_MAX,
};

// Enum TslGame.EArenaState
enum class EArenaState : uint8 {
	Idle,
	Active,
	Finished,
	EArenaState_MAX,
};

// Enum TslGame.ERevivalMethod
enum class ERevivalMethod : uint8 {
	None,
	BluechipTower,
	RevivalTransmitter,
	Cheat,
	ERevivalMethod_MAX,
};

// Enum TslGame.ERankType
enum class ERankType : uint8 {
	None,
	InvalidSMS,
	Penalty,
	Restricted,
	Unranked,
	Bronze,
	Silver,
	Gold,
	Platinum,
	Diamond,
	Master,
	ERankType_MAX,
};

// Enum TslGame.ETslAIPlayerType
enum class ETslAIPlayerType : uint8 {
	HumanPlayer,
	AITypeNone,
	CommonAI,
	PillarAI,
	DummyAI,
	ZombieAI,
	MonsterAI,
	UltronAI,
	ETslAIPlayerType_MAX,
};

// Enum TslGame.ESubjectToReport
enum class ESubjectToReport : uint8 {
	None,
	Killer,
	Spectating_Player,
	Replay_Player,
	Team_Member,
	OtherTeam_Members,
	Assistant,
	GroggyCauser,
	ESubjectToReport_MAX,
};

// Enum TslGame.*e34ddd3361
enum class *e34ddd3361 : uint8 {
	*b2481de319,
	*599a264d98,
	*06325c348d,
	*3922bca4f4,
	*e34ddd3361_MAX,
};

// Enum TslGame.EAliveNumChangeType
enum class EAliveNumChangeType : uint8 {
	None,
	Die,
	ReviveOrRespawn,
	EAliveNumChangeType_MAX,
};

// Enum TslGame.ETslMapName
enum class ETslMapName : uint8 {
	Other,
	Baltic,
	Desert,
	Sanhok,
	DihorOtok,
	Summerland,
	Paramo,
	Tiger,
	Chimera,
	Heaven,
	Kiki,
	ETslMapName_MAX,
};

// Enum TslGame.FTslHASModeAuraType
enum class FTslHASModeAuraType : uint8 {
	None,
	Prop,
	Generator,
	Character,
	FTslHASModeAuraType_MAX,
};

// Enum TslGame.EAscenderSettlePoint
enum class EAscenderSettlePoint : uint8 {
	INVALID,
	RopeAttachPoint_LOWER,
	RopeAttachPoint_UPPER,
	RopeAttachPoint_START,
	EAscenderSettlePoint_MAX,
};

// Enum TslGame.EAuxilaryIconRequestor
enum class EAuxilaryIconRequestor : uint8 {
	None,
	Minimap,
	OwningWidget,
	EAuxilaryIconRequestor_MAX,
};

// Enum TslGame.EAuxilaryIconType
enum class EAuxilaryIconType : uint8 {
	Invalid,
	Drone,
	Drone_Destroyed,
	Detected_Player,
	Detected_Player_Above,
	Detected_Player_Below,
	EAuxilaryIconType_MAX,
};

// Enum TslGame.EScopeType
enum class EScopeType : uint8 {
	Main,
	Right,
	Total,
	None,
	EScopeType_MAX,
};

// Enum TslGame.*bf00b0b84a
enum class *bf00b0b84a : uint8 {
	*734c2a4f52,
	*5065ec1e92,
	*b9f3e6fe2e,
	*fd3f9354a4,
	*bf00b0b84a_MAX,
};

// Enum TslGame.*cecd541801
enum class *cecd541801 : uint8 {
	*9e3919e642,
	*5eb707d310,
	*03feb632ad,
	*9a5235aec5,
	*c67982b797,
	*da32fe0a34,
	*a1d04b5ef2,
	*63f1f10c41,
	*a00cc73d2b,
	*885d385924,
	*9e876e8024,
	*3b449f4edf,
	*cecd541801_MAX,
};

// Enum TslGame.ECharacterActionEventType
enum class ECharacterActionEventType : uint8 {
	None,
	WeaponChange,
	ItemUseCast,
	TakeDamage,
	PostDealDamage,
	TryToUnarmedAttack,
	TryToMeleeAttack,
	ECharacterActionEventType_MAX,
};

// Enum TslGame.*a1c8f199a7
enum class *a1c8f199a7 : uint8 {
	*bdce6a0a0a,
	*5e2ddcb996,
	*845a3fa63b,
	*b8e42aa6c9,
	*21a6be4095,
	*a1c8f199a7_MAX,
};

// Enum TslGame.EInteractInputType
enum class EInteractInputType : uint8 {
	None,
	MainInteract,
	SecondaryInteract,
	EInteractInputType_MAX,
};

// Enum TslGame.EKickProcess
enum class EKickProcess : uint8 {
	Disconnect,
	Shutdown,
	ShutdownIn10Sec,
	DuplicatedLogin,
	EKickProcess_MAX,
};

// Enum TslGame.EDirectMessageType
enum class EDirectMessageType : uint8 {
	Radio,
	Direct,
	DirectReply,
	Warning,
	System,
	EDirectMessageType_MAX,
};

// Enum TslGame.EDirectMessageOutGameType
enum class EDirectMessageOutGameType : uint8 {
	Normal,
	Preset,
	System,
	ClanNormal,
	ClanSystem,
	EDirectMessageOutGameType_MAX,
};

// Enum TslGame.EFutsalGamePhase
enum class EFutsalGamePhase : uint8 {
	Waiting,
	FirstHalf,
	SecondHalf,
	AddedTime,
	End,
	EFutsalGamePhase_MAX,
};

// Enum TslGame.EUnarmedAnimType
enum class EUnarmedAnimType : uint8 {
	Default,
	Spray,
	EUnarmedAnimType_MAX,
};

// Enum TslGame.EInventorySlotStatePad
enum class EInventorySlotStatePad : uint8 {
	Normal,
	Focus,
	Link,
	Selfput,
	Disabled,
	EInventorySlotStatePad_MAX,
};

// Enum TslGame.EDualMatchingState
enum class EDualMatchingState : uint8 {
	NotMatchingState,
	Matching,
	GamePrepared,
	EDualMatchingState_MAX,
};

// Enum TslGame.ELastTeamIconState
enum class ELastTeamIconState : uint8 {
	Normal,
	Groggy,
	Die,
	ELastTeamIconState_MAX,
};

// Enum TslGame.ESeatState
enum class ESeatState : uint8 {
	Empty,
	Player,
	Teammate,
	Enemy,
	ESeatState_MAX,
};

// Enum TslGame.ETslInputDeviceTypeBranch_BPOnly
enum class ETslInputDeviceTypeBranch_BPOnly : uint8 {
	KeyboardMouse,
	XboxGamepad,
	PS4Gamepad,
	SwitchGamepad,
	QuailGamepad,
	ETslInputDeviceTypeBranch_MAX,
};

// Enum TslGame.ETslInputDeviceGroupBranch_BPOnly
enum class ETslInputDeviceGroupBranch_BPOnly : uint8 {
	KeyboardMouse,
	Gamepad,
	ETslInputDeviceGroupBranch_MAX,
};

// Enum TslGame.ETslPlatformTypeBranch_BPOnly
enum class ETslPlatformTypeBranch_BPOnly : uint8 {
	PC,
	Xbox,
	PS4,
	Quail,
	Invalid,
	ETslPlatformTypeBranch_MAX,
};

// Enum TslGame.ETslPlatformGroupBranch_BPOnly
enum class ETslPlatformGroupBranch_BPOnly : uint8 {
	PC,
	Console,
	ETslPlatformGroupBranch_MAX,
};

// Enum TslGame.EBuffPropertyType
enum class EBuffPropertyType : uint8 {
	CoolTime,
	MeleeDamageRatio,
	OtherDamageRatio,
	AllDamageRatio,
	MeleeAttackDamageRatio,
	OtherAttackDamageRatio,
	MeleeBehindAttackDamageRatio,
	LandingDamageRatio,
	GetBoostOnDeal,
	MovementSpeedModifier,
	OnFootSpeedAccelModifier,
	JumpVelocityModifier,
	MaxHpModifier,
	DecreaseRevivalCastTime,
	ReloadingSpeedModifier,
	MultiProperty,
	RecoilModifier,
	PlayerAttackDamageModifier,
	MonsterAttackDamageModifier,
	ReduceGaugeRatio,
	DebuffResistance,
	EBuffPropertyType_MAX,
};

// Enum TslGame.EAutoSpectatePriority
enum class EAutoSpectatePriority : uint8 {
	None,
	Vehicle,
	Distance,
	Combat,
	EAutoSpectatePriority_MAX,
};

// Enum TslGame.EFBRClass
enum class EFBRClass : uint8 {
	WARRIOR,
	RANGER,
	WIZARD,
	PALADIN,
	EFBRClass_MAX,
};

// Enum TslGame.ELeagueMatchStatistic
enum class ELeagueMatchStatistic : uint8 {
	Kill,
	Damage,
	Assist,
	ELeagueMatchStatistic_MAX,
};

// Enum TslGame.ELeagueMatchResultState
enum class ELeagueMatchResultState : uint8 {
	None,
	WinnerWinnerChickenDinner,
	Statistic,
	Ranking,
	ELeagueMatchResultState_MAX,
};

// Enum TslGame.EObserverHudAnimType
enum class EObserverHudAnimType : uint8 {
	TeamWipeOutAnim,
	PersonalKillingSpreeAnim,
	TeamTotalKillingSpreeAnim,
	EObserverHudAnimType_MAX,
};

// Enum TslGame.EPreviewPlatformIconType
enum class EPreviewPlatformIconType : uint8 {
	XboxOne,
	PS4,
	Switch,
	Quail,
	None,
	EPreviewPlatformIconType_MAX,
};

// Enum TslGame.EMovementBaseType
enum class EMovementBaseType : uint8 {
	None,
	Train,
	Ship,
	CableCar,
	COUNT,
	EMovementBaseType_MAX,
};

// Enum TslGame.*5f87d2f77d
enum class *5f87d2f77d : uint8 {
	*c6d07ba57f,
	*e730e6c8d7,
	*a0d106666d,
	*5f87d2f77d_MAX,
};

// Enum TslGame.EBlueZoneShape
enum class EBlueZoneShape : uint8 {
	None,
	Circle,
	Rectangle,
	EBlueZoneShape_MAX,
};

// Enum TslGame.EGameZoneType
enum class EGameZoneType : uint8 {
	SafeZone,
	PlayZone,
	BlueZone,
	RedZone,
	BlackZone,
	EGameZoneType_MAX,
};

// Enum TslGame.ERespawnType
enum class ERespawnType : uint8 {
	Airborne,
	DeadPoint,
	StartPoint,
	Selectable,
	RandomPoint,
	CheckPoint,
	ERespawnType_MAX,
};

// Enum TslGame.EPlatoonTeam
enum class EPlatoonTeam : uint8 {
	None,
	Blue,
	Red,
	EPlatoonTeam_MAX,
};

// Enum TslGame.EAutoRecoveryType
enum class EAutoRecoveryType : uint8 {
	None,
	Human,
	Zombie,
	HumanAndZombie,
	EAutoRecoveryType_MAX,
};

// Enum TslGame.EZombieVirusType
enum class EZombieVirusType : uint8 {
	None,
	Attacked,
	All,
	EZombieVirusType_MAX,
};

// Enum TslGame.EPrivateTrainingRoomType
enum class EPrivateTrainingRoomType : uint8 {
	IndoorRange,
	PracticalTrainingRoom,
	None,
	EPrivateTrainingRoomType_MAX,
};

// Enum TslGame.ETeamMateEmoteErrorType
enum class ETeamMateEmoteErrorType : uint8 {
	Normal,
	ExcessFollower,
	ExcessLimitDistance,
	ETeamMateEmoteErrorType_MAX,
};

// Enum TslGame.EInventoryRadioMessageType
enum class EInventoryRadioMessageType : uint8 {
	Vicinity,
	Inventory,
	Equipment,
	Weapon,
	Attachment,
	TacticalGear,
	Empty_Head,
	Empty_TorsoArmor,
	Empty_Backpack,
	Empty_PrimaryWeapon,
	Empty_SecondaryWeapon,
	Empty_WeaponMelee,
	Empty_WeaponThrowable,
	Empty_LowMagScope,
	Empty_HighMagScope,
	Empty_Muzzle,
	Empty_LowerRail,
	Empty_Magazine,
	Empty_Stock,
	Empty_Canted,
	None,
	EInventoryRadioMessageType_MAX,
};

// Enum TslGame.ERadioMessageInteractionType
enum class ERadioMessageInteractionType : uint8 {
	DroppedItem,
	Vehicle,
	CarepackageOrDeadbox,
	VendingMachine,
	RevivalTower,
	Normal,
	None,
	ERadioMessageInteractionType_MAX,
};

// Enum TslGame.ERadioMessageAlarmSoundCategory
enum class ERadioMessageAlarmSoundCategory : uint8 {
	Normal,
	Notify,
	Warning,
	Important,
	Invalid,
	ERadioMessageAlarmSoundCategory_MAX,
};

// Enum TslGame.ERadioMessageCategory
enum class ERadioMessageCategory : uint8 {
	Affirmative,
	ThankYou,
	NeedMed,
	Negative,
	Sorry,
	NeedAmmo,
	EnemySpotted,
	EnemyAreaSpotted,
	ItemSpotted,
	Ping,
	AreaPing,
	HelpMe,
	AreaNeedHelp,
	AreaBackup,
	WayPoint,
	EmergencyPickup,
	TeamMateEmote,
	Inventory,
	PlantingBomb,
	DefusingBomb,
	MovePlantedBombSite,
	BombCoin,
	Rush,
	Max,
	Invalid,
	ERadioMessageCategory_MAX,
};

// Enum TslGame.ERadioMessageHighlightType
enum class ERadioMessageHighlightType : uint8 {
	None,
	EnemySpotted,
	WorldMapPing,
	ERadioMessageHighlightType_MAX,
};

// Enum TslGame.EEquippedWeaponRTPC
enum class EEquippedWeaponRTPC : uint8 {
	None,
	HandBomb_Bottle,
	HandBomb_Metal,
	Melee,
	Pistol,
	SMG,
	AR,
	SR,
	Max,
	EEquippedWeaponRTPC_MAX,
};

// Enum TslGame.*10207b2a0a
enum class *10207b2a0a : uint8 {
	*8a162a8c98,
	*117990ed47,
	*f580089ef4,
	*10207b2a0a_MAX,
};

// Enum TslGame.EViewModeActorCenterPosition
enum class EViewModeActorCenterPosition : uint8 {
	None,
	Center,
	Bottom,
	EViewModeActorCenterPosition_MAX,
};

// Enum TslGame.EViewModeCategory
enum class EViewModeCategory : uint8 {
	None,
	Weapon,
	Parachute,
	Character,
	Vehicle,
	FloatingVehicle,
	LootCrate,
	EViewModeCategory_MAX,
};

// Enum TslGame.ESystemMenuButtonType
enum class ESystemMenuButtonType : uint8 {
	RESUME,
	SETTINGS,
	TEAM_MANAGEMENT,
	KEY_GUIDE,
	RESTART_LOBBY,
	LEAVE_MATCH,
	RETURN_TO_GAME,
	EXIT_TO_DESKTOP,
	GM_COMMAND_INGAME_HELPER,
	MATCH_LOG,
	ESystemMenuButtonType_MAX,
};

// Enum TslGame.*8bd9ed520b
enum class *8bd9ed520b : uint8 {
	*0f5b46e9c8,
	*ff88de383d,
	*936788ffdd,
	*8bd9ed520b_MAX,
};

// Enum TslGame.*92d13636f1
enum class *92d13636f1 : uint8 {
	*967103ef13,
	*5e495a8fba,
	*3b9d9694e4,
	*ba0b02f160,
	*f8f867b4b6,
	*92d13636f1_MAX,
};

// Enum TslGame.*f434f207ac
enum class *f434f207ac : uint8 {
	*ef51528046,
	*341d890ad4,
	*df32268a11,
	*0c00a2f34a,
	*9bb53afcf8,
	*46bee244fe,
	*ec0923719c,
	*f434f207ac_MAX,
};

// Enum TslGame.EReticleType
enum class EReticleType : uint8 {
	RedDot,
	HoloSight,
	Scope2x,
	Scope3x,
	Scope4x,
	Scope6x,
	Scope8x,
	EReticleType_MAX,
};

// Enum TslGame.EKeyHintType
enum class EKeyHintType : uint8 {
	Menu,
	Parachuting,
	Character,
	Driver,
	Rider,
	WeaponUse,
	WeaponChange,
	ADS,
	Aim,
	ADS_8x15x,
	ADS_6x,
	ADS_1x2x3x,
	ADS_CantedSight,
	ADS_IronSight,
	Throwing,
	Heal,
	Swimming,
	TeamSpectating,
	KillerSpectating,
	WorldMap,
	None,
	FreefallNew,
	ParachuteNew,
	SpikeTrap,
	MotorGlider,
	JerryCan,
	Melee,
	MeleeThrowing,
	ArenaModeHelpBox,
	Other,
	EKeyHintType_MAX,
};

// Enum TslGame.*8eec029a1b
enum class *8eec029a1b : uint8 {
	*14630ca4e1,
	*69ed2dca59,
	*8b21111016,
	*95c2d5508b,
	*0ee7231198,
	*ecc4af9ac7,
	*1cc689db6e,
	*632a151281,
	*d960c0df6e,
	*8eec029a1b_MAX,
};

// Enum TslGame.EWeatherChange
enum class EWeatherChange : uint8 {
	NoChange,
	Rainy,
	Foggy,
	EWeatherChange_MAX,
};

// Enum TslGame.*9246a5c889
enum class *9246a5c889 : uint8 {
	*a78f734bed,
	*1cdd59bbe9,
	*645d8c3f1f,
	*5ad1873cfe,
	*290eccb89c,
	*29a3328a7c,
	*9246a5c889_MAX,
};

// Enum TslGame.EMinimapColorType
enum class EMinimapColorType : uint8 {
	DESATURATED,
	SATURATED,
	EMinimapColorType_MAX,
};

// Enum TslGame.EDamageZoneType
enum class EDamageZoneType : uint8 {
	Head,
	Torso,
	Arm,
	Pelvis,
	Leg,
	EDamageZoneType_MAX,
};

// Enum TslGame.ETslWidgetCreationMethod
enum class ETslWidgetCreationMethod : uint8 {
	CreateOnInit,
	OnDemand,
	OnDemandOnOnlyPC,
	OnDemandOnOnlyConsole,
	ETslWidgetCreationMethod_MAX,
};

// Enum TslGame.ERedZoneGenerateType
enum class ERedZoneGenerateType : uint8 {
	None,
	Uniform_Distribution,
	Ringtaw,
	Outsider,
	RingtawOrOutsider,
	ERedZoneGenerateType_MAX,
};

// Enum TslGame.ETslHudType
enum class ETslHudType : uint8 {
	None,
	CharacterHud,
	SpectatorHud,
	ObserverHud,
	ReplayHud,
	LeagueReplayHud,
	ETslHudType_MAX,
};

// Enum TslGame.ETargetAnimDynamicsType
enum class ETargetAnimDynamicsType : uint8 {
	None,
	Hair,
	Coat,
	ETargetAnimDynamicsType_MAX,
};

// Enum TslGame.EAnimatableCustomizableTypes
enum class EAnimatableCustomizableTypes : uint8 {
	Hair,
	Outer,
	Legs,
	Torso,
	Head,
	Mask,
	Backpack,
	Eyes,
	TorsoArmor,
	Hands,
	Feet,
	Belt,
	Face,
	EAnimatableCustomizableTypes_MAX,
};

// Enum TslGame.EGameEndState
enum class EGameEndState : uint8 {
	None,
	CereMony,
	Cinematic,
	MatchFinish,
	EGameEndState_MAX,
};

// Enum TslGame.*13431f925c
enum class *13431f925c : uint8 {
	*86430e258b,
	*3946a14b62,
	*be40347571,
	*13431f925c_MAX,
};

// Enum TslGame.ELobbyCameraStates
enum class ELobbyCameraStates : uint8 {
	XBox_Home,
	Main_1,
	Main_2,
	Menu_1,
	Custom_1,
	Custom_2,
	EventPass_Milestone_1,
	EventPass_Milestone_2,
	EventPass_Missions,
	ViewMode_Character,
	ViewMode_Weapon,
	ViewMode_Parachute,
	EventPass_Milestone_0_Particle,
	None,
	ELobbyCameraStates_MAX,
};

// Enum TslGame.EUiShowType
enum class EUiShowType : uint8 {
	AlwaysShow,
	TpsOnlyShow,
	FpsOnlyShow,
	AlwaysHide,
	EUiShowType_MAX,
};

// Enum TslGame.EMatchLogTab
enum class EMatchLogTab : uint8 {
	All,
	Squad,
	You,
	EMatchLogTab_MAX,
};

// Enum TslGame.EMatchLogRelative
enum class EMatchLogRelative : uint8 {
	None,
	You,
	Squad,
	Other,
	EMatchLogRelative_MAX,
};

// Enum TslGame.EMatchLogType
enum class EMatchLogType : uint8 {
	None,
	KillMessage,
	SystemMessage,
	EMatchLogType_MAX,
};

// Enum TslGame.ETslApRewardLogicType
enum class ETslApRewardLogicType : uint8 {
	None,
	Public,
	ETslApRewardLogicType_MAX,
};

// Enum TslGame.ETslXpRewardLogicType
enum class ETslXpRewardLogicType : uint8 {
	None,
	Public,
	ETslXpRewardLogicType_MAX,
};

// Enum TslGame.ETslBpRewardLogicType
enum class ETslBpRewardLogicType : uint8 {
	None,
	Public,
	ScoreBased,
	ETslBpRewardLogicType_MAX,
};

// Enum TslGame.ELobbyItemStateFlags
enum class ELobbyItemStateFlags : uint8 {
	Default,
	Vehicle_DoorOpened,
	ELobbyItemStateFlags_MAX,
};

// Enum TslGame.ELobbyCustomizingSlotType
enum class ELobbyCustomizingSlotType : uint8 {
	None,
	VehicleSlot,
	WeaponSlot,
	ELobbyCustomizingSlotType_MAX,
};

// Enum TslGame.EGamepadInputResponseForTapIconWidget
enum class EGamepadInputResponseForTapIconWidget : uint8 {
	None,
	Hold,
	DoubleTap,
	EGamepadInputResponseForTapIconWidget_MAX,
};

// Enum TslGame.EActionType
enum class EActionType : uint8 {
	Action,
	Axis,
	Action_Combo,
	EActionType_MAX,
};

// Enum TslGame.EEmergencyPickupState
enum class EEmergencyPickupState : uint8 {
	None,
	Prepare,
	Aircraft,
	EEmergencyPickupState_MAX,
};

// Enum TslGame.*0147921a70
enum class *0147921a70 : uint8 {
	*0688093198,
	*327d070b42,
	*ba88b9bee7,
	*2e80417f04,
	*4c3932d902,
	*0147921a70_MAX,
};

// Enum TslGame.EGamepadInputResponseTypes
enum class EGamepadInputResponseTypes : uint8 {
	Pressed,
	Released,
	Tap,
	Hold,
	DoubleTap,
	EGamepadInputResponseTypes_MAX,
};

// Enum TslGame.ERadioMessagePresets
enum class ERadioMessagePresets : uint8 {
	Preset1,
	Preset2,
	ERadioMessagePresets_MAX,
};

// Enum TslGame.EGamepadPresets
enum class EGamepadPresets : uint8 {
	ControllerTypeA,
	ControllerTypeB,
	ControllerTypeC,
	CustomType,
	Max,
	EGamepadPresets_MAX,
};

// Enum TslGame.EKeyGuideShowCases
enum class EKeyGuideShowCases : uint8 {
	Reload,
	ExitVehicle,
	EKeyGuideShowCases_MAX,
};

// Enum TslGame.ETslInputModes
enum class ETslInputModes : uint8 {
	Toggle,
	Hold,
	DoubleTap,
	ETslInputModes_MAX,
};

// Enum TslGame.EGameplayClientReplay
enum class EGameplayClientReplay : uint8 {
	Replay,
	Killcam,
	KeyGuide,
	EGameplayClientReplay_MAX,
};

// Enum TslGame.*cf8efe2aea
enum class *cf8efe2aea : uint8 {
	*ed2f342139,
	*2fcbea3162,
	*cf8efe2aea_MAX,
};

// Enum TslGame.EInputModeSettingActions
enum class EInputModeSettingActions : uint8 {
	Crouch,
	Prone,
	Walk,
	Sprint,
	HoldRotation,
	HoldBreath,
	Peek,
	Map,
	ADS,
	Aim,
	HoldAngled,
	EInputModeSettingActions_MAX,
};

// Enum TslGame.*9428665aad
enum class *9428665aad : uint8 {
	*ae2fedf1aa,
	*069e1d373c,
	*3454a114df,
	*9428665aad_MAX,
};

// Enum TslGame.EReportDetailCauseType
enum class EReportDetailCauseType : uint8 {
	None,
	AutoAim,
	NoRecoil,
	EspOrPenetration,
	Speedhack,
	WallPenetration,
	FlyingCar,
	Other,
	EReportDetailCauseType_MAX,
};

// Enum TslGame.EReportedSessionType
enum class EReportedSessionType : uint8 {
	PublicOrCustomGame,
	Killcam,
	Replay,
	EReportedSessionType_MAX,
};

// Enum TslGame.EReportCause
enum class EReportCause : uint8 {
	Default,
	Cheat,
	TeamKill,
	Teaming,
	InappropriateID,
	VerbalHarassment,
	Griefing,
	StreamSniping,
	InappropriateClanTag,
	Abusing,
	MarketingSpamming,
	EReportCause_MAX,
};

// Enum TslGame.ItemPackageType
enum class ItemPackageType : uint8 {
	RootBox,
	CarePackage,
	DroppedEventPackage,
	VehicleTrunk,
	ItemPackageType_MAX,
};

// Enum TslGame.ECarePackageIconType
enum class ECarePackageIconType : uint8 {
	Normal,
	Flying,
	Opened,
	ECarePackageIconType_MAX,
};

// Enum TslGame.EVehicleRideType
enum class EVehicleRideType : uint8 {
	None,
	Normal,
	Aircraft,
	Mortar,
	EVehicleRideType_MAX,
};

// Enum TslGame.ECharacterIconType
enum class ECharacterIconType : uint8 {
	Normal,
	Vehicle,
	Parachute,
	Die,
	Groggy,
	Quitter,
	Observer,
	Aircraft,
	EmergencyPickup,
	ECharacterIconType_MAX,
};

// Enum TslGame.EReportUiType
enum class EReportUiType : uint8 {
	Normal,
	Respawn,
	EReportUiType_MAX,
};

// Enum TslGame.EZombieRuleType
enum class EZombieRuleType : uint8 {
	None,
	BattleRoyale,
	Survival,
	Elimination,
	EZombieRuleType_MAX,
};

// Enum TslGame.EZombieModePlayerState
enum class EZombieModePlayerState : uint8 {
	None,
	Human,
	ReadyToRevive,
	Zombie,
	EZombieModePlayerState_MAX,
};

// Enum TslGame.EFiremode
enum class EFiremode : uint8 {
	FullAuto,
	ThreeRoundBurst,
	TwoRoundBurst,
	SemiAuto,
	Single,
	FullAutoFast,
	FullAuto_SG,
	ThreeRoundBurst_SG,
	SemiAuto_SG,
	EFiremode_MAX,
};

// Enum TslGame.ETraumaBagHealMode
enum class ETraumaBagHealMode : uint8 {
	NoHealItem,
	Bandage,
	FirstAidKit,
	Medkit,
	MaxAndNone,
	ETraumaBagHealMode_MAX,
};

// Enum TslGame.EHeatState
enum class EHeatState : uint8 {
	Stable,
	IncreaseHeat,
	DecreaseHeat,
	OverHeated,
	CoolingDown,
	EHeatState_MAX,
};

// Enum TslGame.EKeyboardKeyIconDisplayType
enum class EKeyboardKeyIconDisplayType : uint8 {
	Tap,
	DoubleTap,
	Hold,
	EKeyboardKeyIconDisplayType_MAX,
};

// Enum TslGame.ETslHASInteractionState
enum class ETslHASInteractionState : uint8 {
	Normal,
	Buffed,
	Debuffed,
	Multiple,
	ETslHASInteractionState_MAX,
};

// Enum TslGame.ETslHASInteractionType
enum class ETslHASInteractionType : uint8 {
	None,
	Generator,
	Exit,
	Healing,
	BeingHealed,
	Chest,
	SelfHeal,
	Wiggle,
	Scoping,
	CabinetKnock,
	ETslHASInteractionType_MAX,
};

// Enum TslGame.ETslHASInteractionMethod
enum class ETslHASInteractionMethod : uint8 {
	None,
	Hand,
	Medkit,
	Toolbox,
	Win94,
	ETslHASInteractionMethod_MAX,
};

// Enum TslGame.EHASEndGamePhase
enum class EHASEndGamePhase : uint8 {
	NotStarted,
	Lv0,
	Lv1,
	Lv2,
	Lv3,
	Lv4,
	EHASEndGamePhase_MAX,
};

// Enum TslGame.*a081601528
enum class *a081601528 : uint8 {
	*2cf2311a91,
	*b0f815db03,
	*9348066ae9,
	*4ce78438dc,
	*a081601528_MAX,
};

// Enum TslGame.EHASSeekerWeapon
enum class EHASSeekerWeapon : uint8 {
	None,
	Win94,
	Machete,
	StickyBomb,
	EHASSeekerWeapon_MAX,
};

// Enum TslGame.EConsoleHitDirections
enum class EConsoleHitDirections : uint8 {
	None,
	Front_Right,
	Front_Left,
	Rear,
	EConsoleHitDirections_MAX,
};

// Enum TslGame.EPresetNumSlotState
enum class EPresetNumSlotState : uint8 {
	Normal,
	Focus,
	Select,
	Lock,
	Disable,
	FocusConsole,
	SelectFocus,
	SelectFocusConsole,
	EPresetNumSlotState_MAX,
};

// Enum TslGame.ETslMapMarkerTowerState
enum class ETslMapMarkerTowerState : uint8 {
	Init,
	Enable,
	Active,
	Disable,
	ETslMapMarkerTowerState_MAX,
};

// Enum TslGame.ETslNotificationMessageAnimationType
enum class ETslNotificationMessageAnimationType : uint8 {
	None,
	Appear,
	Loop,
	ETslNotificationMessageAnimationType_MAX,
};

// Enum TslGame.ETslNotificationMessageColorType
enum class ETslNotificationMessageColorType : uint8 {
	RichText,
	Default,
	Blue,
	Red,
	Yellow,
	ETslNotificationMessageColorType_MAX,
};

// Enum TslGame.ESoundType
enum class ESoundType : uint8 {
	Count,
	Start,
	ESoundType_MAX,
};

// Enum TslGame.ERoundEndPointType
enum class ERoundEndPointType : uint8 {
	Empty,
	Lost,
	Won,
	Draw,
	ERoundEndPointType_MAX,
};

// Enum TslGame.ETrainingInfoType
enum class ETrainingInfoType : uint8 {
	Latest,
	Best,
	ETrainingInfoType_MAX,
};

// Enum TslGame.ETrainingInfoSwitcherIndex
enum class ETrainingInfoSwitcherIndex : uint8 {
	Aim,
	Sound,
	ETrainingInfoSwitcherIndex_MAX,
};

// Enum TslGame.ELeaningState
enum class ELeaningState : uint8 {
	Normal,
	LeanLeft,
	LeanRight,
	ELeaningState_MAX,
};

// Enum TslGame.EEventBoostState
enum class EEventBoostState : uint8 {
	Normal,
	UsingBoost,
	CantUse,
	EEventBoostState_MAX,
};

// Enum TslGame.EVehicleAIAvoidanceMode
enum class EVehicleAIAvoidanceMode : uint8 {
	Off,
	SingleTrace,
	MultiTrace,
	EVehicleAIAvoidanceMode_MAX,
};

// Enum TslGame.ESpawnType
enum class ESpawnType : uint8 {
	Single,
	ContinuousOnTimer,
	ContinuousOnDeath,
	ESpawnType_MAX,
};

// Enum TslGame.*821998e51d
enum class *821998e51d : uint8 {
	*2d6b164cb2,
	*0c2f0d6385,
	*009aed8732,
	*595fde5baf,
	*933770aae8,
	*b4a65b5538,
	*09a04e9114,
	*e2bcd430ee,
	*2fe988d0ba,
	*5e49c7b4ea,
	*821998e51d_MAX,
};

// Enum TslGame.*b2517a3eb5
enum class *b2517a3eb5 : uint8 {
	*45ea9aafd8,
	*ac29944cdb,
	*d40db53ce8,
	*9953e8f773,
	*b2517a3eb5_MAX,
};

// Enum TslGame.ESurfaceEffect
enum class ESurfaceEffect : uint8 {
	S_None,
	S_Concrete_Roll,
	S_Concrete_Skid,
	S_Concrete_Spin,
	S_Dirt_Roll,
	S_Dirt_Skid,
	S_Dirt_Spin,
	S_Water_Roll,
	S_Water_Skid,
	S_Water_Spin,
	S_Metal_Roll,
	S_Metal_Skid,
	S_Metal_Spin,
	S_Wood_Roll,
	S_Wood_Skid,
	S_Wood_Spin,
	S_Rock_Roll,
	S_Rock_Skid,
	S_Rock_Spin,
	S_Grass_Roll,
	S_Grass_Skid,
	S_Grass_Spin,
	S_Sand_Roll,
	S_Sand_Skid,
	S_Sand_Spin,
	S_Concrete_Brake,
	S_Dirt_Brake,
	S_Water_Brake,
	S_Metal_Brake,
	S_Wood_Brake,
	S_Rock_Brake,
	S_Grass_Brake,
	S_Sand_Brake,
	S_Snow_Brake,
	S_SnowRock_Brake,
	S_Ice_Brake,
	S_Common_BrakeDisc,
	S_Concrete_Punctured_Roll,
	S_Concrete_Punctured_Skid,
	S_Concrete_Punctured_Spin,
	S_Concrete_Punctured_Brake,
	S_Snow_Roll,
	S_Snow_Skid,
	S_Snow_Spin,
	S_SnowRock_Roll,
	S_SnowRock_Skid,
	S_SnowRock_Spin,
	S_Ice_Roll,
	S_Ice_Skid,
	S_Ice_Spin,
	S_Mud_Roll,
	S_Mud_Skid,
	S_Mud_Spin,
	S_Mud_Brake,
	S_Common_Neutral,
	S_MAX,
};

// Enum TslGame.EMortarWeaponInstallState
enum class EMortarWeaponInstallState : uint8 {
	None,
	InstallInprogress,
	InstallComplete,
	Installed,
	EMortarWeaponInstallState_MAX,
};

// Enum TslGame.EDeployState
enum class EDeployState : uint8 {
	INVALID,
	UNDEPLOYED,
	DEPLOYING,
	DEPLOYED,
	EDeployState_MAX,
};

// Enum TslGame.ERepairKitMode
enum class ERepairKitMode : uint8 {
	Helmet,
	Vest,
	None,
	ERepairKitMode_MAX,
};

// Enum TslGame.*d5fce6255f
enum class *d5fce6255f : uint8 {
	*3f546539d3,
	*2c33528c9c,
	*0e3275fcc1,
	*d5fce6255f_MAX,
};

// Enum TslGame.EInfoPointType
enum class EInfoPointType : uint8 {
	InfoPoint,
	ObjectPoint,
	SafePoint,
	BeachPoint,
	EInfoPointType_MAX,
};

// Enum TslGame.EBlendSequenceByBoolStartType
enum class EBlendSequenceByBoolStartType : uint8 {
	Restart,
	SameTime,
	EBlendSequenceByBoolStartType_MAX,
};

// Enum TslGame.EJumpStartAnimationType
enum class EJumpStartAnimationType : uint8 {
	Stationary,
	Forward,
	Backward,
	EJumpStartAnimationType_MAX,
};

// Enum TslGame.ERotateBoneInputType
enum class ERotateBoneInputType : uint8 {
	Rotator,
	AngleAxis,
	ERotateBoneInputType_MAX,
};

// Enum TslGame.ERotateBoneSpace
enum class ERotateBoneSpace : uint8 {
	BoneSpace,
	LocalSpace,
	WorldSpace,
	ERotateBoneSpace_MAX,
};

// Enum TslGame.ETslLocomotionNodeState
enum class ETslLocomotionNodeState : uint8 {
	Idle,
	Locomotion,
	Start,
	Stop_Left,
	Stop_Right,
	Pivot_Left,
	Pivot_Right,
	FastTurn_Pivot,
	ETslLocomotionNodeState_MAX,
};

// Enum TslGame.EGameStartupTimeRecordType
enum class EGameStartupTimeRecordType : uint8 {
	ExecPubgBegin,
	ClientBegin,
	MoviePlaying,
	MovieEnded,
	WelcomeScreenLoadStarted,
	WelcomeScreenLoadEnded,
	LobbyLoadStarted,
	LobbyLoadEnded,
	StartMoviePlaying,
	StartMovieEnded,
	Count,
	SkipPrevRecord,
	EGameStartupTimeRecordType_MAX,
};

// Enum TslGame.*afb83b47e5
enum class *afb83b47e5 : uint8 {
	*7bcf528e5e,
	*6282ea61ea,
	*d339696bca,
	*fb0618674f,
	*afb83b47e5_MAX,
};

// Enum TslGame.ETeamChangeZombieMode
enum class ETeamChangeZombieMode : uint8 {
	None,
	LeaveTeam,
	JoinTeam,
	ETeamChangeZombieMode_MAX,
};

// Enum TslGame.*0ed626b9f0
enum class *0ed626b9f0 : uint8 {
	*5ee4941597,
	*bbae25f039,
	*f10ec91132,
	*0cb15c2c23,
	*246925a77d,
	*f9028fec4f,
	*0ed626b9f0_MAX,
};

// Enum TslGame.EObserverCameraMode
enum class EObserverCameraMode : uint8 {
	FixedCamera,
	FreeCamera,
	PlayerCamera,
	FollowCamera,
	EObserverCameraMode_MAX,
};

// Enum TslGame.EObserverAuthorityType
enum class EObserverAuthorityType : uint8 {
	None,
	FromBeginning,
	AfterDeath,
	AfterExtermination,
	ArenaModeEagleEye,
	EagleEye,
	EObserverAuthorityType_MAX,
};

// Enum TslGame.*447cb77fef
enum class *447cb77fef : uint8 {
	*3d0272ef3f,
	*763d6fc794,
	*ae00eacc22,
	*447cb77fef_MAX,
};

// Enum TslGame.EGameModeType
enum class EGameModeType : uint8 {
	BattleRoyale,
	War,
	TDM,
	Zombie,
	ZombieDefense,
	Conquest,
	Training,
	ESports,
	Arena,
	Challenger,
	ZoneTag,
	OneShot,
	Racing,
	Futsal,
	AtoZTutorial,
	ChickenRoyale,
	HAS,
	IntenseBattleRoyale,
	OverPower,
	Bomb,
	SLB,
	None,
	EGameModeType_MAX,
};

// Enum TslGame.EValueType
enum class EValueType : uint8 {
	Float,
	Int,
	String,
	Bool,
	EValueType_MAX,
};

// Enum TslGame.*0833c21d41
enum class *0833c21d41 : uint8 {
	*b377a9933e,
	*fea15241fe,
	*f540573a26,
	*c580a50edd,
	*3aab5a3199,
	*0833c21d41_MAX,
};

// Enum TslGame.*4bb1947cd2
enum class *4bb1947cd2 : uint8 {
	*2cffd8d071,
	*0d5ee5781b,
	*b479ee4f62,
	*4bb1947cd2_MAX,
};

// Enum TslGame.ENearClippingLevel
enum class ENearClippingLevel : uint8 {
	Default,
	Low,
	Middle,
	High,
	ENearClippingLevel_MAX,
};

// Enum TslGame.EThingSpotGroupType
enum class EThingSpotGroupType : uint8 {
	GroupA,
	GroupB,
	GroupC,
	GroupD,
	GroupE,
	GroupF,
	GroupG,
	GroupH,
	GroupI,
	GroupJ,
	GroupK,
	GroupL,
	GroupM,
	GroupN,
	GroupO,
	GroupP,
	GroupQ,
	GroupR,
	GroupS,
	GroupT,
	GroupU,
	GroupV,
	GroupW,
	GroupX,
	GroupY,
	GroupZ,
	MAX,
	EThingSpotGroupType_MAX,
};

// Enum TslGame.EPhysMaterialType
enum class EPhysMaterialType : uint8 {
	Unknown,
	Asphalt,
	Dirt,
	Water,
	Wood,
	Stone,
	Metal,
	EPhysMaterialType_MAX,
};

// Enum TslGame.EUIAkEvent
enum class EUIAkEvent : uint8 {
	None,
	HoverWeak,
	HoverMedium,
	SettingSlider,
	Confirm,
	Cancel,
	PopupModal,
	SystemMessage,
	EUIAkEvent_MAX,
};

// Enum TslGame.EEquipableItemSoundType
enum class EEquipableItemSoundType : uint8 {
	None,
	Vest,
	LongCoat,
	HipSack,
	Cloth,
	BackPack,
	MilitaryShoes,
	Sneakers,
	EEquipableItemSoundType_MAX,
};

// Enum TslGame.EEquipableItemSoundGroup
enum class EEquipableItemSoundGroup : uint8 {
	Default,
	Shoes,
	EEquipableItemSoundGroup_MAX,
};

// Enum TslGame.EColorBlindType
enum class EColorBlindType : uint8 {
	Normal,
	Deuteranopia,
	Protanopia,
	Tritanopia,
	EColorBlindType_MAX,
};

// Enum TslGame.EFrameRateLimitType
enum class EFrameRateLimitType : uint8 {
	Unlimited,
	Fixed_31,
	Fixed_61,
	Customizable,
	DisplayBased,
	EFrameRateLimitType_MAX,
};

// Enum TslGame.ETslOutGameCloudRequestErrorType
enum class ETslOutGameCloudRequestErrorType : uint8 {
	Unknown,
	InternalError,
	ServerError,
	RequestTimedOut,
	DataCorrupted,
	CompressionFailed,
	DecompressionFailed,
	ETslOutGameCloudRequestErrorType_MAX,
};

// Enum TslGame.ETslOutGameCloudRequestType
enum class ETslOutGameCloudRequestType : uint8 {
	Invalid,
	SaveToCloud,
	LoadFromCloud,
	ETslOutGameCloudRequestType_MAX,
};

// Enum TslGame.ETslPhysMaterialType
enum class ETslPhysMaterialType : uint8 {
	Unknown,
	Concrete,
	Dirt,
	Water,
	Metal,
	Wood,
	Grass,
	Glass,
	Flesh,
	ETslPhysMaterialType_MAX,
};

// Enum TslGame.ETppAimCameraPosition
enum class ETppAimCameraPosition : uint8 {
	LatestAimPosition,
	LastPeekingPosition,
	ResetToRightShoulderPosition,
	ResetToLeftShoulderPosition,
	ETppAimCameraPosition_MAX,
};

// Enum TslGame.EAccessorySlot
enum class EAccessorySlot : uint8 {
	Slot_Primary,
	Slot_Secondary,
	Slot_SideArm,
	Slot_Melee,
	Slot_Thrown,
	Slot_Belt,
	Slot_None,
	Slot_MAX,
};

// Enum TslGame.EInventoryListPackageType
enum class EInventoryListPackageType : uint8 {
	CarePackage,
	InventoryOrDeathDropPackage,
	TrunkPackage,
	ItemPackage,
	Ground,
	TacPack,
	Max,
	EInventoryListPackageType_MAX,
};

// Enum TslGame.EInventorySlotType
enum class EInventorySlotType : uint8 {
	Vicinity,
	Inventory,
	Crafting,
	Equipment,
	Weapon,
	Max,
	EInventorySlotType_MAX,
};

// Enum TslGame.ELobbyCharacterCameraType
enum class ELobbyCharacterCameraType : uint8 {
	None,
	WholeBodyCamera,
	TopCamera,
	HeadCamera,
	BodyCamera,
	LegCamera,
	FootCamera,
	Max,
	ELobbyCharacterCameraType_MAX,
};

// Enum TslGame.EAnimWeaponSpecificClass
enum class EAnimWeaponSpecificClass : uint8 {
	None,
	EAnimWeaponSpecificClass_MAX,
};

// Enum TslGame.EContinuousHealItem
enum class EContinuousHealItem : uint8 {
	Continuous_On,
	Bandaged_Only,
	Continuous_Off,
	EContinuousHealItem_MAX,
};

// Enum TslGame.EWeaponDisplayTypes
enum class EWeaponDisplayTypes : uint8 {
	None,
	Handgun,
	SMG,
	AR,
	Shotgun,
	SR,
	DMR,
	LMG,
	AMR,
	Melee,
	Throwable,
	Shield,
	Crossbow,
	Launcher,
	GrenadeLauncher,
	Mortar,
	TacticalGear,
	FlareGun,
	Special,
	EWeaponDisplayTypes_MAX,
};

// Enum TslGame.EWeaponClass
enum class EWeaponClass : uint8 {
	Class_None,
	Class_Pistol,
	Class_SMG,
	Class_Rifle,
	Class_Carbine,
	Class_Shotgun,
	Class_Sniper,
	Class_DMR,
	Class_LMG,
	Class_Melee,
	Class_Throwable,
	Class_Shield,
	Class_Crossbow,
	Class_Launcher,
	Class_GrenadeLauncher,
	Class_Mortar,
	EWeaponClass_MAX,
};

// Enum TslGame.EAllowedThrowMode
enum class EAllowedThrowMode : uint8 {
	Any,
	ThrowHigh,
	ThrowLow,
	EAllowedThrowMode_MAX,
};

// Enum TslGame.*b95106774f
enum class *b95106774f : uint8 {
	*48638625b8,
	*5613f3d85a,
	*2018df5889,
	*b95106774f_MAX,
};

// Enum TslGame.EAttachmentCalculateType
enum class EAttachmentCalculateType : uint8 {
	Addition,
	Multiply,
	EAttachmentCalculateType_MAX,
};

// Enum TslGame.EAutoEquipAttachmentForScopeMode
enum class EAutoEquipAttachmentForScopeMode : uint8 {
	Off,
	Sight_Only,
	ALL,
	EAutoEquipAttachmentForScopeMode_MAX,
};

// Enum TslGame.ECustomPartType
enum class ECustomPartType : uint8 {
	Vehicle,
	ECustomPartType_MAX,
};

// Enum TslGame.EItemCategory
enum class EItemCategory : uint8 {
	None,
	Equipment,
	Weapon,
	Attachment,
	Ammunition,
	Use,
	Skin,
	Event,
	Part,
	EItemCategory_MAX,
};

// Enum TslGame.EFiringMode
enum class EFiringMode : uint8 {
	Normal,
	Burst,
	FullAuto,
	FullAutoFast,
	EFiringMode_MAX,
};

// Enum TslGame.ECharacterGait
enum class ECharacterGait : uint8 {
	Walk,
	Run,
	Sprint,
	ECharacterGait_MAX,
};

// Enum TslGame.EWeaponHand
enum class EWeaponHand : uint8 {
	Left,
	Right,
	Total,
	EWeaponHand_MAX,
};

// Enum TslGame.EWeaponArmState
enum class EWeaponArmState : uint8 {
	None,
	NotArmed,
	Arming,
	Armed,
	UnArming,
	EWeaponArmState_MAX,
};

// Enum TslGame.*2f797355c1
enum class *2f797355c1 : uint8 {
	*b13bcb4245,
	*588d6fd2f5,
	*d5a03305a9,
	*2f797355c1_MAX,
};

// Enum TslGame.EAnimVehicleSeatType
enum class EAnimVehicleSeatType : uint8 {
	Rider,
	Pillion,
	VehicleDriver,
	VehiclePassenger,
	Pilot,
	AircraftPassenger,
	GliderPassenger,
	EAnimVehicleSeatType_MAX,
};

// Enum TslGame.ETurningDirection
enum class ETurningDirection : uint8 {
	None,
	Right_46,
	Right_91,
	Right_136,
	Right_181,
	Left_46,
	Left_91,
	Left_136,
	Left_181,
	ETurningDirection_MAX,
};

// Enum TslGame.*be529112d3
enum class *be529112d3 : uint8 {
	*c085f5e27c,
	*c47c77a4bf,
	*3d1b442d27,
	*4663c55312,
	*4d8c9cf6bd,
	*2c5f3ee1e6,
	*a23bde67c9,
	*e25f506282,
	*aa580117af,
	*be529112d3_MAX,
};

// Enum TslGame.EAnimStance
enum class EAnimStance : uint8 {
	Stand,
	Crouch,
	Prone,
	Groggy,
	EAnimStance_MAX,
};

// Enum TslGame.EAnimWeaponType
enum class EAnimWeaponType : uint8 {
	None,
	Rifle,
	Launcher,
	Pistol,
	Throwable,
	SpikeTrap,
	Melee,
	Shield,
	Mortar,
	MAX,
	EAnimWeaponType_MAX,
};

// Enum TslGame.*cca980e840
enum class *cca980e840 : uint8 {
	*297c0e7be8,
	*ba02cf4d64,
	*c62a58ac4d,
	*cca980e840_MAX,
};

// Enum TslGame.ECameraViewBehaviour
enum class ECameraViewBehaviour : uint8 {
	FpsAndTps,
	FpsOnly,
	TpsOnly,
	ECameraViewBehaviour_MAX,
};

// Enum TslGame.EPlayerStartType
enum class EPlayerStartType : uint8 {
	OnePlace,
	SeveralPlace,
	EPlayerStartType_MAX,
};

// Enum TslGame.EMatchStartType
enum class EMatchStartType : uint8 {
	Normal,
	Airborne,
	Monster,
	EMatchStartType_MAX,
};

// Enum TslGame.EGender
enum class EGender : uint8 {
	Male,
	Female,
	EGender_MAX,
};

// Enum TslGame.EThermalItemType
enum class EThermalItemType : uint8 {
	Character,
	Vehicle,
	Blood,
	Fire,
	Ghillie,
	CountOrNone,
	EThermalItemType_MAX,
};

// Enum TslGame.ESpecialEquipmentType
enum class ESpecialEquipmentType : uint8 {
	Default,
	BluezoneBlocker,
	EmergencyParachute,
	Toolbox,
	TacPack,
	TraumaBag,
	SoftRole,
	ESpecialEquipmentType_MAX,
};

// Enum TslGame.EEquipableItemLevelType
enum class EEquipableItemLevelType : uint8 {
	None,
	Level1,
	Level2,
	Level3,
	Level4,
	EEquipableItemLevelType_MAX,
};

// Enum TslGame.EConstraintSlotType
enum class EConstraintSlotType : uint8 {
	Block,
	Hide,
	Max,
	EConstraintSlotType_MAX,
};

// Enum TslGame.*8e9d560617
enum class *8e9d560617 : uint8 {
	*dff36baa11,
	*b6f3eb1961,
	*79b1e7dc50,
	*8e9d560617_MAX,
};

// Enum TslGame.*b3d7c18e06
enum class *b3d7c18e06 : uint8 {
	*295bf63ce3,
	*78e24b744e,
	*b1a6b763c9,
	*7c8702d29e,
	*faad2ba9b3,
	*b3d7c18e06_MAX,
};

// Enum TslGame.EItemSpotGroupType
enum class EItemSpotGroupType : uint8 {
	GroupA,
	GroupB,
	GroupC,
	GroupD,
	GroupE,
	GroupF,
	GroupG,
	GroupH,
	GroupI,
	GroupJ,
	GroupK,
	GroupL,
	GroupM,
	GroupN,
	GroupO,
	GroupP,
	GroupQ,
	GroupR,
	GroupS,
	GroupT,
	GroupU,
	GroupV,
	GroupW,
	GroupX,
	GroupY,
	GroupZ,
	MAX,
	EItemSpotGroupType_MAX,
};

// Enum TslGame.EItemSpotType
enum class EItemSpotType : uint8 {
	TypeA,
	TypeB,
	TypeC,
	TypeD,
	TypeE,
	TypeF,
	TypeG,
	TypeH,
	TypeI,
	TypeJ,
	TypeK,
	TypeL,
	TypeM,
	TypeN,
	TypeO,
	TypeP,
	TypeQ,
	TypeR,
	TypeS,
	TypeT,
	TypeU,
	TypeV,
	TypeW,
	TypeX,
	TypeY,
	TypeZ,
	MAX,
	EItemSpotType_MAX,
};

// Enum TslGame.EItemOverrideType
enum class EItemOverrideType : uint8 {
	NONE,
	TypeA,
	TypeB,
	TypeC,
	TypeD,
	TypeE,
	TypeF,
	TypeG,
	TypeH,
	TypeI,
	TypeJ,
	TypeK,
	TypeL,
	TypeM,
	TypeN,
	EItemOverrideType_MAX,
};

// Enum TslGame.ECastableItemType
enum class ECastableItemType : uint8 {
	None,
	Bandage,
	FirstAid,
	Medkit,
	EnergyDrink,
	Painkiller,
	Adrenaline,
	GasCan,
	Battery,
	Key,
	EmergencyPickup,
	SelfRevive,
	Ascender,
	RevivalTransmitter,
	TacticalGear,
	ECastableItemType_MAX,
};

// Enum TslGame.ECastLevel
enum class ECastLevel : uint8 {
	None,
	NoRestriction,
	Restriction,
	OnlyRotationRestriction,
	ECastLevel_MAX,
};

// Enum TslGame.ECastPriority
enum class ECastPriority : uint8 {
	None,
	Low,
	Normal,
	High,
	Max,
	ECastPriority_MAX,
};

// Enum TslGame.ELobbyItemPointSellingType
enum class ELobbyItemPointSellingType : uint8 {
	Normal,
	WeeklyDouble,
	ELobbyItemPointSellingType_MAX,
};

// Enum TslGame.ELobbyItemPlatform
enum class ELobbyItemPlatform : uint8 {
	PC_Steam,
	PC_NonSteam,
	Xbox,
	ELobbyItemPlatform_MAX,
};

// Enum TslGame.ELobbyItemTier
enum class ELobbyItemTier : uint8 {
	Basic,
	Common,
	Classic,
	Special,
	Rare,
	Elite,
	Epic,
	Legendary,
	Ultimate,
	Event,
	ELobbyItemTier_MAX,
};

// Enum TslGame.ELobbyItemCategory
enum class ELobbyItemCategory : uint8 {
	Belt,
	Body,
	Eyes,
	Feet,
	Head,
	Jacket,
	Legs,
	Mask,
	Hands,
	Box,
	Key,
	WeaponSkin,
	ParachuteSkin,
	HelmetSkin,
	BackpackSkin,
	TorsoArmorSkin,
	VehicleSkin,
	Multislot,
	ELobbyItemCategory_MAX,
};

// Enum TslGame.EDamageVictimActorType
enum class EDamageVictimActorType : uint8 {
	Default,
	Character,
	Vehicle,
	Wheel,
	DestructibleActor,
	ExplosiveItem,
	DummyAI,
	EDamageVictimActorType_MAX,
};

// Enum TslGame.EVehicleConvertState
enum class EVehicleConvertState : uint8 {
	None,
	Play,
	Cancel,
	Finish,
	EVehicleConvertState_MAX,
};

// Enum TslGame.EVehiclePartType
enum class EVehiclePartType : uint8 {
	BodyColor,
	WheelColor,
	BrakeCaliperColor,
	BoostEffect,
	WheelMesh,
	PinstripeColor,
	Spoiler,
	EVehiclePartType_MAX,
};

// Enum TslGame.*f3561aaaf5
enum class *f3561aaaf5 : uint8 {
	*0e377a5abe,
	*4bbfa742c3,
	*9b79cc9d12,
	*c899e87501,
	*f3561aaaf5_MAX,
};

// Enum TslGame.*1c15c94125
enum class *1c15c94125 : uint8 {
	*5c7ea17421,
	*38014767d2,
	*88e97e83b8,
	*1ef733128e,
	*9388c12a32,
	*930a4cb510,
	*b98bf81e9d,
	*6f72809495,
	*3c4a67f58c,
	*381221738b,
	*a76e6b9707,
	*38961a6936,
	*136c4d1112,
	*1e91083784,
	*efe89ffe7f,
	*288fcef33e,
	*602ba98348,
	*e4a71e33ce,
	*6a2ead2057,
	*34514bf330,
	*a6555f78e2,
	*0552571ba3,
	*45aa930d1f,
	*57b6e5d08a,
	*35c500ce12,
	*625d9473de,
	*7b6fa48a93,
	*715abe99a1,
	*bf15e67937,
	*b6b73c34d7,
	*42c37392b3,
	*b3230f0c6f,
	*f6025c875d,
	*a935e3c628,
	*2c3652586d,
	*107c679d02,
	*10928f0b7f,
	*629f5f5cb5,
	*34e8694ed1,
	*b0b0c27ad1,
	*933092d1b5,
	*851c7839d6,
	*6e31efdb69,
	*8f277513ba,
	*bc1a419505,
	*98b84c8589,
	*1a06da7228,
	*318d38cc45,
	*05db807cca,
	*6e735ffa70,
	*a116dd0a33,
	*e4e3dacc1e,
	*3976465a18,
	*b88a946762,
	*79471ae629,
	*1c15c94125_MAX,
};

// Enum TslGame.*cbd6a57fa8
enum class *cbd6a57fa8 : uint8 {
	*b4e8e7f51b,
	*6405b8610d,
	*08a5e4cb2e,
	*98bc3f59dd,
	*cbd6a57fa8_MAX,
};

// Enum TslGame.ERiderType
enum class ERiderType : uint8 {
	Driver,
	Passenger,
	ERiderType_MAX,
};

// Enum TslGame.EStatTrakState
enum class EStatTrakState : uint8 {
	Run,
	Locked,
	Error,
	EStatTrakState_MAX,
};

// Enum TslGame.*ebe673c122
enum class *ebe673c122 : uint8 {
	*0551c85f43,
	*9ec466d6dd,
	*c1c6c0f4fc,
	*acabf97f8f,
	*f2bc06f665,
	*ebe673c122_MAX,
};

// Enum TslGame.ESkinMeshType
enum class ESkinMeshType : uint8 {
	SkeletalMesh,
	AsyncStaticMesh,
	StaticMesh,
	ESkinMeshType_MAX,
};

// Enum TslGame.EVehicleSkinCategory
enum class EVehicleSkinCategory : uint8 {
	None,
	FourSeaterSUV,
	FourSeaterSedan,
	TwoSeaterSportsCar,
	TwoSeaterMotorbike,
	EVehicleSkinCategory_MAX,
};

// Enum TslGame.ESkinCategory
enum class ESkinCategory : uint8 {
	Skin_None,
	Skin_Equipment,
	Skin_Parachute,
	Skin_Weapon,
	Skin_MeleeWeapon,
	Skin_Vehicle,
	Skin_Throwable,
	Skin_MAX,
};

// Enum TslGame.EBuffOverlapSolveMethod
enum class EBuffOverlapSolveMethod : uint8 {
	IgnoreLater,
	Overwrite,
	RestartTimer,
	Stack,
	EBuffOverlapSolveMethod_MAX,
};

// Enum TslGame.*78d3f3d355
enum class *78d3f3d355 : uint8 {
	*9c776ff69d,
	*62fa271204,
	*b995eaf9ea,
	*14abb7e432,
	*78d3f3d355_MAX,
};

// Enum TslGame.EVaultAnimType
enum class EVaultAnimType : uint8 {
	VaultNone,
	Vault200_Stationary,
	Vault200_Mobile,
	Vault200_Narrow,
	Vault160_Stationary,
	Vault160_Mobile,
	Vault160_Narrow,
	Vault120_Stationary,
	Vault120_Mobile,
	Vault120_Slide,
	Vault120_Narrow,
	Vault90_Stationary,
	Vault90_Mobile,
	Vault90_Slide,
	Vault90_Narrow,
	Climb200_Stationary,
	Climb200_Mobile,
	Climb200_Slide,
	Climb200_Narrow,
	Climb160_Stationary,
	Climb160_Mobile,
	Climb160_Slide,
	Climb160_Narrow,
	Climb120_Stationary,
	Climb120_Mobile,
	Climb120_Slide,
	Climb120_Narrow,
	Climb90_Stationary,
	Climb90_Mobile,
	Climb90_Slide,
	Climb90_Narrow,
	Vault90Roll,
	Vault120Window,
	Vault60_Stationary,
	Vault60_Mobile,
	Vault60_Slide,
	Vault60_Narrow,
	Climb60_Stationary,
	Climb60_Mobile,
	Climb60_Narrow,
	LedgeGrab_Up_Climb,
	LedgeGrab_Up_Climb_Swing,
	LedgeGrab_Up_Climb_HalfSwing,
	LedgeGrab_Up_Vault,
	LedgeGrab_Up_Vault_Swing,
	LedgeGrab_Up_Vault_HalfSwing,
	LedgeGrab_High_Climb,
	LedgeGrab_High_Climb_Swing,
	LedgeGrab_High_Climb_HalfSwing,
	LedgeGrab_High_Vault,
	LedgeGrab_High_Vault_Swing,
	LedgeGrab_High_Vault_HalfSwing,
	LedgeGrab_Low_Climb,
	LedgeGrab_Low_Climb_Swing,
	LedgeGrab_Low_Climb_HalfSwing,
	LedgeGrab_Low_Vault,
	LedgeGrab_Low_Vault_Swing,
	LedgeGrab_Low_Vault_HalfSwing,
	LedgeGrab_Low_Vault_Narrow,
	LedgeGrab_Low_Vault_HalfSwing_Narrow,
	LedgeGrab_Low_Vault_Swing_Narrow,
	LedgeGrab_High_Vault_Narrow,
	LedgeGrab_High_Vault_HalfSwing_Narrow,
	LedgeGrab_High_Vault_Swing_Narrow,
	LedgeGrab_Up_Vault_Narrow,
	LedgeGrab_Up_Vault_HalfSwing_Narrow,
	LedgeGrab_Up_Vault_Swing_Narrow,
	EVaultAnimType_MAX,
};

// Enum TslGame.ECollisionProfileType
enum class ECollisionProfileType : uint8 {
	Profiles,
	DefaultChannelResponses,
	EditProfiles,
	ProfileRedirects,
	CollisionChannelRedirects,
	ECollisionProfileType_MAX,
};

// Enum TslGame.EMovingState
enum class EMovingState : uint8 {
	Walk,
	Run,
	Sprint,
	EMovingState_MAX,
};

// Enum TslGame.EPlayerInputType
enum class EPlayerInputType : uint8 {
	KeyboardMouse,
	Gamepad,
	Mixed,
	EPlayerInputType_MAX,
};

// Enum TslGame.EAntiCheatKickType
enum class EAntiCheatKickType : uint8 {
	Default,
	HWID,
	MouseMacro,
	InGame,
	BattleEye,
	EAntiCheatKickType_MAX,
};

// Enum TslGame.ECheatType
enum class ECheatType : uint8 {
	None,
	SpeedHack,
	IgnoreWall_Hit,
	IgnoreWall_Sight,
	IgnoreVelocity_Hit,
	IgnoreVelocity,
	IgnoreVelocity2,
	ItemPackage,
	CarePackageMount,
	Aimbot,
	VerifyLagSwitch,
	InvalidNetConnectionClose,
	InvalidImpact,
	InvalidImpactZ,
	InvalidImpact_Gun_C,
	InvalidOrigin_Gun,
	InvalidOrigin_Melee,
	InvalidOrigin_Punch,
	InvalidOrigin_Throwable,
	InvalidOrigin_MeleeThrow,
	InvalidSimStep_MeleeThrow,
	InvalidRange,
	InvalidRange2,
	InvalidReviving,
	InvalidKick,
	InvalidA0,
	InvalidB1,
	InvalidB1_2,
	InvalidH0,
	InvalidOrigin_Gun_C,
	InvalidD0,
	InvalidS0,
	InvalidH1,
	InvalidH2,
	InvalidH3,
	InvalidC0,
	InvalidC1,
	InvalidC2,
	InvalidC3,
	InvalidC4,
	InvalidC5,
	InvalidC6,
	InvalidC7,
	InvalidT0,
	InvalidT1,
	InvalidT2,
	InvalidAimDir,
	InvalidPelletDir,
	InvalidAmmoSpeed,
	InvalidAmmoDir,
	InvalidCharacterFlag,
	InvalidCharacterXRay,
	InvalidPropertyCrc,
	InvalidWeaponCrc,
	InvalidWeaponRecoil,
	InvalidSwayBuffer,
	InvalidCameraYaw,
	InvalidWeaponPackageCrc,
	InvalidWeaponFlag,
	InvalidHitComponent,
	InvalidCollisionProfileCrc,
	InvalidPakListCrc,
	InvalidCharacterCrc,
	InvalidHitLocation,
	InvalidSight,
	InvalidBackface,
	InvalidMovementCurveCrc,
	InvalidDriverFire,
	InvalidVehicleOverlap,
	InvalidViewRotation,
	InvalidPenetration,
	InvalidPunchSpeed,
	CHKSUM_PUNCH,
	CHKSUM_MELEE,
	CHKSUM_A0,
	CHKSUM_T0,
	CHKSUM_S0,
	CHKSUM_D0,
	CHKSUM_V0,
	CHKSUM_W0,
	CHKSUM_T1,
	CHKSUM_D1,
	CHKSUM_CD,
	CHKSUM_LC,
	CHKSUM_P0,
	CHKSUM_BP,
	CHKSUM_G1,
	CHKSUM_H2,
	CHKSUM_H3,
	CHKSUM_UO,
	CHKSUM_UF,
	VHC_RI,
	VHC_MG_FF,
	VHC_MG_FC,
	VHC_MG_SW,
	VHC_MG_OS,
	VHC_MG_BC,
	VHC_MG_TC,
	VHC_MG_PL,
	VHC_MG_HL,
	VHC_MG_SD,
	VHC_MG_AA,
	VHC_MG_AV,
	VHC_MG_AD,
	VHC_MGB_FF,
	VHC_MGB_FC,
	VHC_MGB_OS,
	VHC_MGB_BC,
	VHC_MGB_TC,
	VHC_MGB_PL,
	VHC_MGB_HL,
	VHC_MGB_AA,
	VHC_MGB_AV,
	VHC_MGB_AD,
	VHC_MGF_OS,
	VHC_MGF_TC,
	VHC_MGF_BC,
	VHC_MGF_SD,
	VHC_MGF_AA,
	VHC_MGF_AV,
	VHC_KILL,
	VHC_ED,
	VHC_SERVERSIMUL,
	VHC_SIMULATION_ACTIVATE,
	VHC_SIMULATION_DEACTIVATE,
	VHC_TRY_BYPASS_SERVERSIMUL,
	VHC_BYPASSED_SERVERSIMUL,
	VHC_FORCE_SERVERSIMUL,
	CK_ACTIVATE,
	CK_DEACTIVATE,
	AntiCheatKick_WallHack,
	AntiCheatKick_ESP,
	AntiCheatKick_SpeedHack1,
	AntiCheatKick_SpeedHack2,
	AntiCheatKick_SpeedHack3,
	AntiCheatKick_PLFC,
	AntiCheatKick_TCFC,
	AntiCheatKick_HL,
	AntiCheatKick_OS,
	AntiCheatKick_FC,
	AntiCheatKick_SV,
	VehicleSimulation_PLFC,
	VehicleSimulation_TCFC,
	VehicleSimulation_HL,
	VehicleSimulation_OS,
	VehicleSimulation_FC,
	CC_ACTIVATE,
	CC_DEACTIVATE,
	CC_FORCE_ERROR_CORRECTION,
	FLC_ACTIVATE,
	FLC_DEACTIVATE,
	FallingCorrection,
	VaultingCorrection,
	QS_AJ,
	QS_VZ,
	KGB_AF,
	InputLog,
	FireInputLog,
	ESPLog,
	ESPRatioLog,
	IsEnabledAntiESP,
	HighLocationVehicle,
	HighLocationBoat,
	UnderLandscapeBoat,
	UnderLandscapeCharacter,
	InsideMeshCharacter,
	BC_BoatCorrection,
	HBR_InvalidDashDistance,
	UNC_ACTIVATE,
	UNC_DEACTIVATE,
	UncAddUserFail,
	UncSetUserInfoFail,
	UncDeleteUserFail,
	UncGetCookieFail,
	UncCookieVerifyFail,
	UncCookieNotRespond,
	DESP_SelfInfo,
	DESP_SelfInvalidCheckSum,
	DESP_SelfInvalidCount,
	DESP_RemoteInfo,
	DESP_RemoteInvalidCheckSum,
	HitInSmoke,
	BoneFocusedShoot,
	CenterFocusedShoot,
	Combination_Undefined,
	Combination_FlyingCar,
	Combination_InsideMeshAttack,
	ECheatType_MAX,
};

// Enum TslGame.ETslCustomMovementMode
enum class ETslCustomMovementMode : uint8 {
	Vaulting,
	Freefalling,
	Parachuting,
	UsingAscender,
	ETslCustomMovementMode_MAX,
};

// Enum TslGame.*5f9f5f045f
enum class *5f9f5f045f : uint8 {
	*323d6f730e,
	*1dfd3872c3,
	*5cb3463306,
	*6d3be5477c,
	*5f9f5f045f_MAX,
};

// Enum TslGame.EPreoccupiedTeamType
enum class EPreoccupiedTeamType : uint8 {
	NEUTRAL,
	RED,
	BLUE,
	EPreoccupiedTeamType_MAX,
};

// Enum TslGame.*0c9cab8e00
enum class *0c9cab8e00 : uint8 {
	*2a2c02eb39,
	*b21f659e32,
	*dc5345544e,
	*25faea786a,
	*0c9cab8e00_MAX,
};

// Enum TslGame.EPopupStyle
enum class EPopupStyle : uint8 {
	Ok_Cancel,
	Ok,
	Yes_No,
	Controller_KeyboardMouse,
	EPopupStyle_MAX,
};

// Enum TslGame.EKillcamDisplayCode
enum class EKillcamDisplayCode : uint8 {
	NotVisible,
	OptionDisabled,
	Recording,
	Playable,
	Replay,
	FailToLoad,
	DemoFailure,
	DetectedUnusualMovement,
	EKillcamDisplayCode_MAX,
};

// Enum TslGame.EWidgetShowType
enum class EWidgetShowType : uint8 {
	Show,
	Hide,
	Toggle,
	EWidgetShowType_MAX,
};

// Enum TslGame.EAIPoseState
enum class EAIPoseState : uint8 {
	Stand,
	Crouch,
	Prone,
	Jump,
	Reload,
	UnArmed,
	EAIPoseState_MAX,
};

// Enum TslGame.ERaycastDirection
enum class ERaycastDirection : uint8 {
	Forward,
	Down_45_Degrees,
	Down,
	ERaycastDirection_MAX,
};

// Enum TslGame.EEmoteMoveType
enum class EEmoteMoveType : uint8 {
	None,
	MoveFoward,
	EEmoteMoveType_MAX,
};

// Enum TslGame.EEmotePlayType
enum class EEmotePlayType : uint8 {
	None,
	Normal,
	TeamMate,
	Interaction,
	EEmotePlayType_MAX,
};

// Enum TslGame.*f061715223
enum class *f061715223 : uint8 {
	*497e92e44a,
	*75adc38835,
	*bbaccf7957,
	*c4b4bfa963,
	*f061715223_MAX,
};

// Enum TslGame.ESpecialZoneAdditionalEffect
enum class ESpecialZoneAdditionalEffect : uint8 {
	RemoveFireAndSmoke,
	DestructDrone,
	DeactivateBluezoneBlocker,
	DeactivateSpotterScope,
	DeactivateBlueChipDetector,
	DeactivateBlueChipRevival,
	ESpecialZoneAdditionalEffect_MAX,
};

// Enum TslGame.ESpecialZoneState
enum class ESpecialZoneState : uint8 {
	Disabled,
	BeforeMatch,
	WaitingStartDelay,
	Warning,
	Activating,
	ActivationDone,
	Deactivating,
	Removed,
	Finished,
	ESpecialZoneState_MAX,
};

// Enum TslGame.ESpecialZoneType
enum class ESpecialZoneType : uint8 {
	None,
	Blizzard,
	SandStorm,
	ESpecialZoneType_MAX,
};

// Enum TslGame.EMovementSpamType
enum class EMovementSpamType : uint8 {
	LeanRight,
	LeanLeft,
	Crouch,
	EMovementSpamType_MAX,
};

// Enum TslGame.EAttackType
enum class EAttackType : uint8 {
	None,
	Weapon,
	VehicleCrash,
	VehicleExplosion,
	Fall,
	BlueZone,
	RedZone,
	BlackZone,
	EAttackType_MAX,
};

// Enum TslGame.EPlayerMoveType
enum class EPlayerMoveType : uint8 {
	OnFoot,
	OnSwim,
	OnVehicle,
	OnParachute,
	OnFreefall,
	EPlayerMoveType_MAX,
};

// Enum TslGame.EVoiceChannelType
enum class EVoiceChannelType : uint8 {
	None,
	All,
	GlobalOnly,
	TeamOnly,
	EVoiceChannelType_MAX,
};

// Enum TslGame.EVivoxResponseState
enum class EVivoxResponseState : uint8 {
	NotRequested,
	Requested,
	Fail,
	Success,
	EVivoxResponseState_MAX,
};

// Enum TslGame.ELandingSoundSwitchState
enum class ELandingSoundSwitchState : uint8 {
	None,
	Light,
	Heavy,
	VeryHeavy,
	ELandingSoundSwitchState_MAX,
};

// Enum TslGame.*4fba765f9a
enum class *4fba765f9a : uint8 {
	*4616ac1c2a,
	*3c4beb4d8f,
	*f6d637a269,
	*7f702a96dc,
	*60bc86cc2f,
	*4fba765f9a_MAX,
};

// Enum TslGame.ECustomGripBlendSpaceType
enum class ECustomGripBlendSpaceType : uint8 {
	None,
	Stand,
	Crouch,
	Prone,
	ProneTransition,
	ProneLocomotion,
	ECustomGripBlendSpaceType_MAX,
};

// Enum TslGame.EMasteryItemType
enum class EMasteryItemType : uint8 {
	Charm,
	Mesh,
	EMasteryItemType_MAX,
};

// Enum TslGame.TableType
enum class TableType : uint8 {
	Ammo,
	Attachment,
	Equipment,
	Skin,
	SkinThrowable,
	Weapon,
	WeaponThrowable,
	WeaponShield,
	Castable,
	UsedByAction,
	Event,
	Craft,
	VehiclePart,
	Bluechip,
	TableType_MAX,
};

// Enum TslGame.ESoftRoleState
enum class ESoftRoleState : uint8 {
	Open,
	Closed,
	Inspect,
	ESoftRoleState_MAX,
};

// Enum TslGame.*312d2d60bc
enum class *312d2d60bc : uint8 {
	*260a9d35d5,
	*bb27962e31,
	*0392707a99,
	*89d27d383a,
	*312d2d60bc_MAX,
};

// Enum TslGame.ESandboxConsoleGuideKeyType
enum class ESandboxConsoleGuideKeyType : uint8 {
	None,
	ExpandAndClose,
	SpawnAndBack,
	AdjustAndClose,
	ConfirmAndBack,
	SpawnAndClose,
	ESandboxConsoleGuideKeyType_MAX,
};

// Enum TslGame.ESandboxGroypType
enum class ESandboxGroypType : uint8 {
	None,
	Weapon,
	Attachment,
	Item,
	Vehicle,
	Sensitivity,
	Power,
	Special,
	ESandboxGroypType_MAX,
};

// Enum TslGame.ESandboxQuantityType
enum class ESandboxQuantityType : uint8 {
	None,
	Item,
	Vehicle,
	ESandboxQuantityType_MAX,
};

// Enum TslGame.ESandboxSpecialButtonType
enum class ESandboxSpecialButtonType : uint8 {
	None,
	EquipLv3,
	AddAmmo,
	SettingAPrevious,
	SettingAGunset,
	ESandboxSpecialButtonType_MAX,
};

// Enum TslGame.ESandboxPowerType
enum class ESandboxPowerType : uint8 {
	None,
	Fly,
	InvulnerableEffect,
	CarePackage,
	RedZone,
	Revive,
	TeamRevive,
	GiveItemToEveryone,
	BlueZone,
	ESandboxPowerType_MAX,
};

// Enum TslGame.ESandboxSoundType
enum class ESandboxSoundType : uint8 {
	None,
	ItemSpawnClick,
	ItemSpawnSuccess,
	ESandboxSoundType_MAX,
};

// Enum TslGame.*e76aa70173
enum class *e76aa70173 : uint8 {
	*649ecbaf94,
	*b2cacb5a62,
	*72d34feeba,
	*1fe1727de5,
	*8e4023e339,
	*9a2e4c0da3,
	*af1659a470,
	*e76aa70173_MAX,
};

// Enum TslGame.ECurrentSoundState
enum class ECurrentSoundState : uint8 {
	None,
	MovingUp,
	MovingUpSprinting,
	MovingDown,
	MovingDownSprinting,
	Stopping,
	ECurrentSoundState_MAX,
};

// Enum TslGame.*adc53fb654
enum class *adc53fb654 : uint8 {
	*806ad4936f,
	*a39e5d9a83,
	*2ac92ce507,
	*adc53fb654_MAX,
};

// Enum TslGame.*f075310b79
enum class *f075310b79 : uint8 {
	*f0095569e4,
	*77280230bc,
	*adb66f8321,
	*ab629ca86e,
	*f075310b79_MAX,
};

// Enum TslGame.EAscenderDirection
enum class EAscenderDirection : uint8 {
	AscenderUp,
	AscenderDown,
	Max,
	EAscenderDirection_MAX,
};

// Enum TslGame.EAscenderRopeType
enum class EAscenderRopeType : uint8 {
	None,
	AscenderRope,
	AscenderZipline,
	EAscenderRopeType_MAX,
};

// Enum TslGame.EControlType
enum class EControlType : uint8 {
	Move,
	Jump,
	Fire,
	Aim,
	Arm,
	Unarm,
	Reload,
	Interact,
	Peek,
	Roll,
	Crouch,
	Prone,
	UseItem,
	ThrowMelee,
	CookThrowable,
	ItemCatch,
	ItemThrow,
	InspectWeapon,
	ToggleFiringMode,
	ToggleThrowMode,
	EControlType_MAX,
};

// Enum TslGame.ECharFlagsNormal
enum class ECharFlagsNormal : uint8 {
	IsGroggying,
	IsActiveRagdollActive,
	HasShieldEquipped,
	IsInBluezone,
	IsBeingHealed,
	IsSelfHemostasis,
	ECharFlagsNormal_MAX,
};

// Enum TslGame.ELandingState
enum class ELandingState : uint8 {
	None,
	Falling,
	HeavyFalling,
	ExtremeFalling,
	FallingRecovery,
	PostLandingRecovery,
	ELandingState_MAX,
};

// Enum TslGame.ECharFlagsSkipOwner
enum class ECharFlagsSkipOwner : uint8 {
	WantsToRun,
	WantsToSprint,
	WantsToSprintingAuto,
	WantsToRollingLeft,
	WantsToRollingRight,
	AimStateActive,
	IsThirdPerson,
	IsReviving,
	IgnoreRotation,
	IsWeaponObstructed,
	IsCoatEquipped,
	IsThrowHigh,
	WantsToCancelVault,
	IsScopingRemote,
	IsAimingRemote,
	IsFirstPersonRemote,
	IsInVehicleRemote,
	IsPeekLeftRemote,
	IsPeekRightRemote,
	IsHoldingAngled,
	ECharFlagsSkipOwner_MAX,
};

// Enum TslGame.*9e15fc0d10
enum class *9e15fc0d10 : uint8 {
	*6a13413bf2,
	*4911684497,
	*5d7e854cd0,
	*9e15fc0d10_MAX,
};

// Enum TslGame.EMovementType
enum class EMovementType : uint8 {
	M_StandWalk,
	M_StandRun,
	M_StandSprint,
	M_CrouchWalk,
	M_CrouchRun,
	M_CrouchSprint,
	M_ProneWalk,
	M_ProneRun,
	M_ProneSprint,
	M_StandScope,
	M_CrouchScope,
	M_ProneScope,
	M_StandAim,
	M_CrouchAim,
	M_ProneAim,
	M_Swim,
	M_UnderwaterSwim,
	M_DBNO,
	Count,
	EMovementType_MAX,
};

// Enum TslGame.EAIPolyType
enum class EAIPolyType : uint8 {
	AIPoly_None,
	AIPoly_Attack,
	AIPoly_Moving,
	AIPoly_Moving_Directly,
	AIPoly_Jump,
	AIPoly_MovingTargetPos,
	AIPoly_Max,
};

// Enum TslGame.*c06d22dacc
enum class *c06d22dacc : uint8 {
	*d086a601a7,
	*0c1ede2f52,
	*cd162437fd,
	*c9a3cba158,
	*28f2bfbe84,
	*c06d22dacc_MAX,
};

// Enum TslGame.*b6493138e3
enum class *b6493138e3 : uint8 {
	*13a965b98e,
	*d859c9550c,
	*1641a9268b,
	*b6493138e3_MAX,
};

// Enum TslGame.ESurviveWeaponPropSlot
enum class ESurviveWeaponPropSlot : uint8 {
	SWPS_MainShootWeapon1,
	SWPS_MainShootWeapon2,
	SWPS_SubShootWeapon,
	SWPS_MeleeWeapon,
	SWPS_HandProp,
	SWPS_Max,
};

// Enum TslGame.*60475ea27c
enum class *60475ea27c : uint8 {
	*a50fbb778f,
	*1354fc381f,
	*d01697d1b7,
	*7dbd08150d,
	*7a57b6d701,
	*20f578abcc,
	*f528e02392,
	*51a521db18,
	*60475ea27c_MAX,
};

// Enum TslGame.*c399367f8b
enum class *c399367f8b : uint8 {
	*3705315a78,
	*c18831901b,
	*b03d5291b5,
	*869585e44a,
	*3675df1480,
	*c399367f8b_MAX,
};

// Enum TslGame.ExtraPlayerLiveState
enum class ExtraPlayerLiveState : uint8 {
	InDefault,
	InPlane,
	InParachute,
	InVehicle,
	InDying,
	InDied,
	Offline,
	ExtraPlayerLiveState_MAX,
};

// Enum TslGame.*73a493842e
enum class *73a493842e : uint8 {
	*27b5637db6,
	*6d14ec5a00,
	*6557802533,
	*73a493842e_MAX,
};

// Enum TslGame.EAIWeaponShootType
enum class EAIWeaponShootType : uint8 {
	SingleShot,
	Auto,
	EAIWeaponShootType_MAX,
};

// Enum TslGame.EAINewFocusPriority
enum class EAINewFocusPriority : uint8 {
	Default,
	Move,
	Gameplay,
	EAINewFocusPriority_MAX,
};

// Enum TslGame.EAIMovePose
enum class EAIMovePose : uint8 {
	Walk,
	Run,
	CrouchSprint,
	KeepCurrentPose,
	EAIMovePose_MAX,
};

// Enum TslGame.EAITriggerAttrType
enum class EAITriggerAttrType : uint8 {
	None,
	Health,
	Energy,
	EAITriggerAttrType_MAX,
};

// Enum TslGame.EAIAttrCompareType
enum class EAIAttrCompareType : uint8 {
	None,
	Great,
	Less,
	EAIAttrCompareType_MAX,
};

// Enum TslGame.EAIEquipSpawnItemType
enum class EAIEquipSpawnItemType : uint8 {
	Shoot_Weap,
	Backpack,
	other,
	EAIEquipSpawnItemType_MAX,
};

// Enum TslGame.EWeaponReloadMethod
enum class EWeaponReloadMethod : uint8 {
	Magazine,
	OneByOne,
	OneByOneAndClip,
	EWeaponReloadMethod_MAX,
};

// Enum TslGame.ETslRedeployPlayerState
enum class ETslRedeployPlayerState : uint8 {
	None,
	Initialized,
	RespawnTarget,
	ReadyToFight,
	Fighting,
	Dead,
	Survived,
	Redeployed,
	RevivalTarget,
	RevivalRegisted,
	Revived,
	ETslRedeployPlayerState_MAX,
};

// Enum TslGame.EDestrucibleSurfaceSourceType
enum class EDestrucibleSurfaceSourceType : uint8 {
	Unknown,
	Projectile,
	Grenade,
	Warhead,
	Slashing,
	EDestrucibleSurfaceSourceType_MAX,
};

// Enum TslGame.EAttachParent
enum class EAttachParent : uint8 {
	None,
	Character,
	WeaponGun,
	EAttachParent_MAX,
};

// Enum TslGame.EDoorState
enum class EDoorState : uint8 {
	Closed,
	Closing,
	Opened,
	Opening,
	EDoorState_MAX,
};

// Enum TslGame.*6d9af3f0f5
enum class *6d9af3f0f5 : uint8 {
	*ee1254d25a,
	*01894856c9,
	*72a8775a52,
	*9598fe0744,
	*50bb62e434,
	*6d9af3f0f5_MAX,
};

// Enum TslGame.eDESPMode
enum class eDESPMode : uint8 {
	None,
	UniformDivision,
	RadiusFromCenter,
	eDESPMode_MAX,
};

// Enum TslGame.ETdmSpawnKit
enum class ETdmSpawnKit : uint8 {
	Shotgun,
	Smg,
	Ar,
	Dmr,
	Sr,
	Etc,
	Max,
	ETdmSpawnKit_MAX,
};

// Enum TslGame.EWeaponReloadCancelReason
enum class EWeaponReloadCancelReason : uint8 {
	Default,
	PlayerInterrupted,
	PlayerMovement,
	PlayerInteraction,
	WeaponSwitch,
	PlayerIncapacitated,
	VehicleMoving,
	EWeaponReloadCancelReason_MAX,
};

// Enum TslGame.EWeaponReloadAnimExec
enum class EWeaponReloadAnimExec : uint8 {
	Tactical,
	Charge,
	Single,
	Loop,
	EWeaponReloadAnimExec_MAX,
};

// Enum TslGame.EWeaponState
enum class EWeaponState : uint8 {
	Idle,
	Firing,
	Reloading,
	EWeaponState_MAX,
};

// Enum TslGame.EWeaponTransitionState
enum class EWeaponTransitionState : uint8 {
	Stable,
	Arming,
	UnArming,
	EWeaponTransitionState_MAX,
};

// Enum TslGame.EPerceptionType
enum class EPerceptionType : uint8 {
	Sight,
	Disapp,
	Hearing,
	Attack,
	None,
	EPerceptionType_MAX,
};

// Enum TslGame.EBombGameJoinType
enum class EBombGameJoinType : uint8 {
	Normal,
	IntrusionStart,
	IntrusionFinish,
	EBombGameJoinType_MAX,
};

// Enum TslGame.EBombGameAreaType
enum class EBombGameAreaType : uint8 {
	None,
	StartArea,
	PlantedASite,
	PlantedBSite,
	NormalArea,
	EBombGameAreaType_MAX,
};

// Enum TslGame.EBombItemCategory
enum class EBombItemCategory : uint8 {
	None,
	Pistol,
	SMG,
	AR,
	SG,
	DMR,
	SR,
	Equipment,
	Throwable,
	ETC,
	EBombItemCategory_MAX,
};

// Enum TslGame.EBombTeamStateInfoType
enum class EBombTeamStateInfoType : uint8 {
	MoveASite,
	MoveBSite,
	SaveMoney,
	GiveMoney,
	Rush,
	SaveMe,
	MAX,
	EBombTeamStateInfoType_MAX,
};

// Enum TslGame.ECoinTakeType
enum class ECoinTakeType : uint8 {
	None,
	StoreSellItemToCustomer,
	CustomerSellItemToStore,
	KillReward,
	KillAssistReward,
	BombInstallReward,
	BombDefuseReward,
	RoundWin,
	Donate,
	Receipt,
	RoundStartNormal,
	RoundStartDecisive,
	RoundDefeat,
	TeamRoleChange,
	MinAllowanceCoin,
	MaxAllowanceCoin,
	ThriftyDiffSpendCoin,
	Admin,
	ECoinTakeType_MAX,
};

// Enum TslGame.EBombModeSoundType
enum class EBombModeSoundType : uint8 {
	Unknown,
	BombPlanting_Phase1,
	BombPlanting_Phase2,
	BombPlanting_Phase3,
	BombExplosion,
	BombDefusing,
	GiveCoin,
	ReceiveCoin,
	Purchase,
	BombTimerStart,
	BombTimerDismantle,
	BombTimeStop,
	RestrictionTimer,
	EBombModeSoundType_MAX,
};

// Enum TslGame.ETimeBombPhaseType
enum class ETimeBombPhaseType : uint8 {
	Unknown,
	Planting_Phase1,
	Planting_Phase2,
	Planting_Phase3,
	Explosion,
	Defusing,
	ETimeBombPhaseType_MAX,
};

// Enum TslGame.ETslBombMatchWinType
enum class ETslBombMatchWinType : uint8 {
	Draw,
	ExceedRoundWin,
	ExceedUseBombKit,
	ExceedKillCount,
	EnemyAllLogout,
	ETslBombMatchWinType_MAX,
};

// Enum TslGame.*a48665a176
enum class *a48665a176 : uint8 {
	*93badb7b08,
	*3200857fef,
	*322c44f4bd,
	*462999c1f8,
	*eb57087b7a,
	*a48665a176_MAX,
};

// Enum TslGame.ETslBombPlantedState
enum class ETslBombPlantedState : uint8 {
	NotSet,
	Planting,
	Planted,
	Defused,
	Exploded,
	ETslBombPlantedState_MAX,
};

// Enum TslGame.ETslBombRoundInProgressState
enum class ETslBombRoundInProgressState : uint8 {
	Invalid,
	TeamDecision,
	Preparing,
	Playing,
	Ending,
	ETslBombRoundInProgressState_MAX,
};

// Enum TslGame.EBombKeyNotifyState
enum class EBombKeyNotifyState : uint8 {
	None,
	InStartArea,
	DefenseTeam,
	AttackTeam,
	HoldBombPlantingKit,
	EBombKeyNotifyState_MAX,
};

// Enum TslGame.EBombRoundAttribute
enum class EBombRoundAttribute : uint8 {
	None,
	Normal,
	OverTime,
	TeamRoleChanged,
	EBombRoundAttribute_MAX,
};

// Enum TslGame.EBombRoundResultConditionType
enum class EBombRoundResultConditionType : uint8 {
	None,
	Excellent,
	Impressive,
	Overwhelming,
	Perfect,
	Thrifty,
	MAX,
	EBombRoundResultConditionType_MAX,
};

// Enum TslGame.ETslBombRoundResultHistoryType
enum class ETslBombRoundResultHistoryType : uint8 {
	None,
	TimeUp,
	BombExploded,
	BombDefused,
	TeamElimination,
	TeamGameLogout,
	ETslBombRoundResultHistoryType_MAX,
};

// Enum TslGame.EBombUITeamStatusType
enum class EBombUITeamStatusType : uint8 {
	None,
	Attack,
	Defence,
	MAX,
	EBombUITeamStatusType_MAX,
};

// Enum TslGame.EBombScopeInfo
enum class EBombScopeInfo : uint8 {
	None,
	Hologram,
	Reddot,
	Scope2x,
	Scope3x,
	Scope4x,
	Scope6x,
	Scope8x,
	Scope15x,
	MAX,
	EBombScopeInfo_MAX,
};

// Enum TslGame.ETslBombKDAMType
enum class ETslBombKDAMType : uint8 {
	Kill,
	Death,
	Assist,
	MissionInstallBomb,
	MissionDefuseBomb,
	ETslBombKDAMType_MAX,
};

// Enum TslGame.ETslBombTeamRole
enum class ETslBombTeamRole : uint8 {
	None,
	AttackTeam,
	DefenseTeam,
	ROLE_MAX,
	ETslBombTeamRole_MAX,
};

// Enum TslGame.EHealingItemType
enum class EHealingItemType : uint8 {
	HealItem,
	BoostItem,
	EHealingItemType_MAX,
};

// Enum TslGame.EComparisonTarget
enum class EComparisonTarget : uint8 {
	Value,
	BBKey,
	EComparisonTarget_MAX,
};

// Enum TslGame.EAIMapName
enum class EAIMapName : uint8 {
	Baltic,
	Desert,
	Sanhok,
	DihorOtok,
	Summerland,
	Paramo,
	Tiger,
	Chimera,
	Heaven,
	Kiki,
	Other,
	EAIMapName_MAX,
};

// Enum TslGame.ETeamModeType
enum class ETeamModeType : uint8 {
	Solo,
	Duo,
	Squad,
	ETeamModeType_MAX,
};

// Enum TslGame.*3d747d382e
enum class *3d747d382e : uint8 {
	*75cd47bc62,
	*828430b2c7,
	*93d732b5f2,
	*1abcebd06f,
	*6845446faa,
	*d77861347a,
	*3d747d382e_MAX,
};

// Enum TslGame.EAICommand
enum class EAICommand : uint8 {
	None,
	Moving,
	Battle,
	EAICommand_MAX,
};

// Enum TslGame.EAIActionState
enum class EAIActionState : uint8 {
	Idle,
	Battle,
	BattleMoving,
	Healing,
	Farming,
	Moving,
	Swimming,
	EAIActionState_MAX,
};

// Enum TslGame.EAIAliveState
enum class EAIAliveState : uint8 {
	Alive,
	Groggy,
	Dead,
	EAIAliveState_MAX,
};

// Enum TslGame.EPickupItemStatus
enum class EPickupItemStatus : uint8 {
	NeedWeapon,
	NeedBaseEquip,
	NeedOneMoreWeapon,
	NeedHealItem,
	NeedBoostItem,
	NeedThrowableItem,
	NeedPan,
	NeedNoItem,
	EPickupItemStatus_MAX,
};

// Enum TslGame.EIntoCircleLevel
enum class EIntoCircleLevel : uint8 {
	AlreadyInWhite,
	NearWhite,
	MiddleWhite,
	ReachableWhite,
	UnreachableWhite,
	EIntoCircleLevel_MAX,
};

// Enum TslGame.EValueCompareFunc
enum class EValueCompareFunc : uint8 {
	MoreThan,
	MoreThanOrEqual,
	LessThan,
	LessThanOrEqual,
	Equal,
	NotEqual,
	EValueCompareFunc_MAX,
};

// Enum TslGame.EAIParameter
enum class EAIParameter : uint8 {
	None,
	Offensive,
	PrepareType,
	EAIParameter_MAX,
};

// Enum TslGame.EPrepareType
enum class EPrepareType : uint8 {
	StopMovement,
	MoveRandomLoc,
	ThrowToy,
	TypeEnd,
	EPrepareType_MAX,
};

// Enum TslGame.EAIBehaviors
enum class EAIBehaviors : uint8 {
	Normal,
	Chasing,
	Runaway,
	EAIBehaviors_MAX,
};

// Enum TslGame.ERightMoveDirection
enum class ERightMoveDirection : uint8 {
	Left,
	Right,
	Stop,
	ERightMoveDirection_MAX,
};

// Enum TslGame.EForwardMoveDirection
enum class EForwardMoveDirection : uint8 {
	Forward,
	Backward,
	Stop,
	EForwardMoveDirection_MAX,
};

// Enum TslGame.EUltronWithCircle
enum class EUltronWithCircle : uint8 {
	InWhiteCircle,
	InBlueCircle,
	OutBlueCircle,
	MaxNum,
	EUltronWithCircle_MAX,
};

// Enum TslGame.EComparisonTargetCircle
enum class EComparisonTargetCircle : uint8 {
	WhiteCircle,
	BlueCircle,
	EComparisonTargetCircle_MAX,
};

// Enum TslGame.ETurnDirection
enum class ETurnDirection : uint8 {
	Left,
	Right,
	Stop,
	ETurnDirection_MAX,
};

// Enum TslGame.EPercivedGrenadeType
enum class EPercivedGrenadeType : uint8 {
	FragGrenade,
	StickyBomb,
	C4,
	EPercivedGrenadeType_MAX,
};

// Enum TslGame.EEnemyCompareElement
enum class EEnemyCompareElement : uint8 {
	None,
	HouseId,
	EEnemyCompareElement_MAX,
};

// Enum TslGame.EInfoPointWithHouse
enum class EInfoPointWithHouse : uint8 {
	All,
	InHouse,
	OutHouse,
	EInfoPointWithHouse_MAX,
};

// Enum TslGame.ETargetLocation
enum class ETargetLocation : uint8 {
	WhiteCircle,
	OtherLocation,
	ETargetLocation_MAX,
};

// Enum TslGame.ETestMoveDirection
enum class ETestMoveDirection : uint8 {
	Front,
	Back,
	Left,
	Right,
	ETestMoveDirection_MAX,
};

// Enum TslGame.EThownWeapon_AI
enum class EThownWeapon_AI : uint8 {
	GRENADE,
	MOLOTOV,
	SMOKEBOMB,
	FLASHBANG,
	EThownWeapon_MAX,
};

// Enum TslGame.EThrowablePoseState_AI
enum class EThrowablePoseState_AI : uint8 {
	Idle,
	PinOffStart,
	Cooking,
	WaitForThrow,
	Throwing,
	EThrowablePoseState_MAX,
};

// Enum TslGame.*b1a80747f8
enum class *b1a80747f8 : uint8 {
	*4394c7fefa,
	*e3ecfa585d,
	*c5923447d4,
	*b1a80747f8_MAX,
};

// Enum TslGame.EModifyBlackboardDataValueType
enum class EModifyBlackboardDataValueType : uint8 {
	Int,
	Float,
	Bool,
	String,
	Object,
	Vector3,
	EModifyBlackboardDataValueType_MAX,
};

// Enum TslGame.EAIBattleState
enum class EAIBattleState : uint8 {
	None,
	ReturnToSpawnLocation,
	Patrol,
	Battle,
	EAIBattleState_MAX,
};

// Enum TslGame.EThownWeapon
enum class EThownWeapon : uint8 {
	GRENADE,
	MOLOTOV,
	SMOKEBOMB,
	FLASHBANG,
	EThownWeapon_MAX,
};

// Enum TslGame.EThrowablePoseState
enum class EThrowablePoseState : uint8 {
	Idle,
	PinOffStart,
	Cooking,
	WaitForThrow,
	Throwing,
	EThrowablePoseState_MAX,
};

// Enum TslGame.EBoosterItem
enum class EBoosterItem : uint8 {
	ADRENALINE,
	PAINKILLER,
	ENERGYDRINK,
	EBoosterItem_MAX,
};

// Enum TslGame.*a5c8520112
enum class *a5c8520112 : uint8 {
	*c4fb4bccfb,
	*7f03b7872a,
	*04c71c4aee,
	*d83eb7e329,
	*6c184277ed,
	*a5c8520112_MAX,
};

// Enum TslGame.EFightMovingType
enum class EFightMovingType : uint8 {
	FM_Target,
	FM_TargetPos,
	FM_RandomPos,
	FM_Max,
};

// Enum TslGame.EMonsterPatrol
enum class EMonsterPatrol : uint8 {
	Patrol_BackDomain,
	Patrol_Flee,
	Patrol_RunawayHouse,
	Patrol_SpawnSpot,
	Patrol_Hearing,
	Patrol_Random,
	Patrol_Max,
};

// Enum TslGame.*a12164564c
enum class *a12164564c : uint8 {
	*21c7598ac0,
	*a9915fd8e1,
	*4c4f54324f,
	*e668b8df1d,
	*0d6e63109f,
	*a12164564c_MAX,
};

// Enum TslGame.*dd92d4fd50
enum class *dd92d4fd50 : uint8 {
	*90fa24e8dc,
	*d15cc7f3da,
	*f545cc016a,
	*67541541ce,
	*a366103fb2,
	*dd92d4fd50_MAX,
};

// Enum TslGame.*e7b41e0ffd
enum class *e7b41e0ffd : uint8 {
	*26fb9918cd,
	*ad62f19b84,
	*1b0e44fd96,
	*b91247078d,
	*e7b41e0ffd_MAX,
};

// Enum TslGame.EReactionObjectType
enum class EReactionObjectType : uint8 {
	Fence,
	Hay,
	Camera,
	EReactionObjectType_MAX,
};

// Enum TslGame.*fffe402d5e
enum class *fffe402d5e : uint8 {
	*f5c2a9e326,
	*d319633b8b,
	*8718549d01,
	*b390380674,
	*fffe402d5e_MAX,
};

// Enum TslGame.ECraftResult
enum class ECraftResult : uint8 {
	Success,
	Invalid_Character,
	Invalid_Inventory,
	Invalid_Equipment,
	Invalid_CraftingRuleComponent,
	Invalid_CraftItemData,
	Invalid_ReservedCraftItem,
	Invalid_PlayerState,
	Not_Enough_Material,
	Not_Enough_Space,
	Miss_Matched_RestrictFilter,
	Restricted_Stance,
	ECraftResult_MAX,
};

// Enum TslGame.*7d75b72830
enum class *7d75b72830 : uint8 {
	*7ea6af5c06,
	*0189ebef48,
	*8d9574bdea,
	*08618d059d,
	*074c84f7ae,
	*7d75b72830_MAX,
};

// Enum TslGame.ECustomCarepackageState
enum class ECustomCarepackageState : uint8 {
	Transporting,
	Falling,
	Landing,
	ECustomCarepackageState_MAX,
};

// Enum TslGame.EDecoyFiringState
enum class EDecoyFiringState : uint8 {
	Firing,
	BetweenShots,
	BetweenSequences,
	EDecoyFiringState_MAX,
};

// Enum TslGame.EDecoyState
enum class EDecoyState : uint8 {
	Uninitialized,
	Cooking,
	DelayedFiring,
	Firing,
	Reloading,
	DelayedEnding,
	EndOfLife,
	EDecoyState_MAX,
};

// Enum TslGame.EWhiteZoneShape
enum class EWhiteZoneShape : uint8 {
	None,
	Circle,
	EWhiteZoneShape_MAX,
};

// Enum TslGame.EBluezoneType
enum class EBluezoneType : uint8 {
	Normal,
	Fast,
	EBluezoneType_MAX,
};

// Enum TslGame.EVendingMachineType
enum class EVendingMachineType : uint8 {
	AMMUNITION,
	BOOSTING,
	THROWABLE,
	WEAPON,
	HEALING,
	EVendingMachineType_MAX,
};

// Enum TslGame.EPatrolSpeed
enum class EPatrolSpeed : uint8 {
	Walk,
	Run,
	Sprint,
	EPatrolSpeed_MAX,
};

// Enum TslGame.ELoadingScreenType
enum class ELoadingScreenType : uint8 {
	NONE,
	ICE_BRAKE,
	RULE_SET,
	WEAPON,
	ATTACHMENT,
	EQUIPMENT,
	ITEM,
	VEHICLE,
	SYSTEM,
	DEFAULT,
	GAME_MODE,
	EXPOSE_WITH_HIGHEST_PRIORITY,
	ELoadingScreenType_MAX,
};

// Enum TslGame.EPlayerAuthState
enum class EPlayerAuthState : uint8 {
	None,
	Login,
	Logout,
	EPlayerAuthState_MAX,
};

// Enum TslGame.EBlueChipTowerState
enum class EBlueChipTowerState : uint8 {
	IsUnavailable,
	IsAvailable,
	IsInUse,
	IsLaunching,
	RegisterFinished,
	NeedToCharge,
	Cancel,
	Broken,
	EBlueChipTowerState_MAX,
};

// Enum TslGame.EEmPickupAircraftStatus
enum class EEmPickupAircraftStatus : uint8 {
	Available,
	InvalidPhase_Early,
	InvalidPhase_Late,
	QueueFull,
	Disabled,
	EEmPickupAircraftStatus_MAX,
};

// Enum TslGame.EItemClientAnimSeqUnload
enum class EItemClientAnimSeqUnload : uint8 {
	None,
	Disable,
	Enable,
	EItemClientAnimSeqUnload_MAX,
};

// Enum TslGame.EFExplosivePropDataType
enum class EFExplosivePropDataType : uint8 {
	Default,
	PropaneTank,
	SmallTank,
	RacingExplosive,
	GasPump,
	EFExplosivePropDataType_MAX,
};

// Enum TslGame.*ff889b5df5
enum class *ff889b5df5 : uint8 {
	*96082063a5,
	*63266f99b4,
	*f13378c682,
	*ab0d87d13f,
	*ff889b5df5_MAX,
};

// Enum TslGame.ETslControllerType
enum class ETslControllerType : uint8 {
	Mouse,
	GamePad,
	Total,
	ETslControllerType_MAX,
};

// Enum TslGame.EVoiceInterfaceType
enum class EVoiceInterfaceType : uint8 {
	VIVOX,
	XIM,
	GVOICE,
	EVoiceInterfaceType_MAX,
};

// Enum TslGame.EVoiceTransmissionType
enum class EVoiceTransmissionType : uint8 {
	None,
	ToAll,
	ToChannel,
	EVoiceTransmissionType_MAX,
};

// Enum TslGame.EVoiceChannelJoinState
enum class EVoiceChannelJoinState : uint8 {
	NotJoined,
	Joining,
	Leaving,
	Joined,
	EVoiceChannelJoinState_MAX,
};

// Enum TslGame.EVoiceLoginState
enum class EVoiceLoginState : uint8 {
	NotLoggedin,
	Loggingin,
	Loggedin,
	EVoiceLoginState_MAX,
};

// Enum TslGame.EVoiceConnectionState
enum class EVoiceConnectionState : uint8 {
	NotConnected,
	Connecting,
	Connected,
	EVoiceConnectionState_MAX,
};

// Enum TslGame.ETableCheckerHideOption
enum class ETableCheckerHideOption : uint8 {
	Hide,
	Show,
	ETableCheckerHideOption_MAX,
};

// Enum TslGame.EKeyHintGradeSettingValue
enum class EKeyHintGradeSettingValue : uint8 {
	Basic,
	Advanced,
	EKeyHintGradeSettingValue_MAX,
};

// Enum TslGame.EKeyHintGradeBitmask
enum class EKeyHintGradeBitmask : uint8 {
	Basic,
	Advanced,
	EKeyHintGradeBitmask_MAX,
};

// Enum TslGame.ETslWeatherAction
enum class ETslWeatherAction : uint8 {
	NotDefined,
	Initialized,
	Prolonged,
	ETslWeatherAction_MAX,
};

// Enum TslGame.ECharacterInteractBehaviorType
enum class ECharacterInteractBehaviorType : uint8 {
	None,
	ExtraSlotForMode,
	Revive,
	BodyCarry,
	TraumaBag,
	InstantRevivalKit,
	TeamEmote,
	ItemRequest,
	RepairKit,
	ECharacterInteractBehaviorType_MAX,
};

// Enum TslGame.EInteractionPhase
enum class EInteractionPhase : uint8 {
	First,
	Second,
	EInteractionPhase_MAX,
};

// Enum TslGame.ETslSLBGeneratorState
enum class ETslSLBGeneratorState : uint8 {
	Breakdown,
	NeedFuel,
	BeforeActivate,
	Activate,
	MAX,
	ETslSLBGeneratorState_MAX,
};

// Enum TslGame.ELobbyItemBundleType
enum class ELobbyItemBundleType : uint8 {
	Bundle,
	Generator,
	ELobbyItemBundleType_MAX,
};

// Enum TslGame.EItemSpawnType
enum class EItemSpawnType : uint8 {
	FixedRatioAndAdjustableTotalNumber,
	AdjustableRatioAndFixedTotalNumber,
	AdjustableRatioAndAdjustableTotalNumber,
	Invalid,
	EItemSpawnType_MAX,
};

// Enum TslGame.EThreatType
enum class EThreatType : uint8 {
	Damage,
	Sight,
	Noise,
	EThreatType_MAX,
};

// Enum TslGame.ELocationType
enum class ELocationType : uint8 {
	LANDMARK,
	EXTRA_LANDMARK,
	CITY,
	CITY_DETAIL,
	TOWN,
	COMPOUNDS,
	EXTRA,
	TEST_SHOW_ALL,
	ELocationType_MAX,
};

// Enum TslGame.*5693bf1f41
enum class *5693bf1f41 : uint8 {
	*348ef343dd,
	*36f9d69662,
	*b5f31308a2,
	*efa63c33c0,
	*5a81da3983,
	*a7e2f9d6be,
	*af8a9cee6e,
	*c14f7ec402,
	*145f3bdc13,
	*dc46d400f1,
	*3271344471,
	*3708e8cbaf,
	*0c96bbee3c,
	*5693bf1f41_MAX,
};

// Enum TslGame.ELobbyLinkState
enum class ELobbyLinkState : uint8 {
	Disconnect,
	WaitInitialize,
	WaitStart,
	Gaming,
	Finished,
	ELobbyLinkState_MAX,
};

// Enum TslGame.ELobbyCharacterAnimationType
enum class ELobbyCharacterAnimationType : uint8 {
	Default,
	Wardrobe,
	Appearance,
	ELobbyCharacterAnimationType_MAX,
};

// Enum TslGame.EParameterLUTChannel
enum class EParameterLUTChannel : uint8 {
	R,
	G,
	B,
	A,
	RGBA,
	Undefined,
	EParameterLUTChannel_MAX,
};

// Enum TslGame.EMaterialParameterType
enum class EMaterialParameterType : uint8 {
	Bool,
	Scalar,
	Vector,
	Texture,
	Undefined,
	EMaterialParameterType_MAX,
};

// Enum TslGame.EBlackZoneState
enum class EBlackZoneState : uint8 {
	BZ_WaitingForMatchStart,
	BZ_SelectNewBlackZone,
	BZ_BeginStrike,
	BZ_FireMisile,
	BZ_EndBombing,
	BZ_MAX,
};

// Enum TslGame.*f38446698c
enum class *f38446698c : uint8 {
	*248c7f520c,
	*c1adff1396,
	*8971d5289c,
	*82e2b7ca52,
	*315e01629e,
	*f38446698c_MAX,
};

// Enum TslGame.*cea33fa8c2
enum class *cea33fa8c2 : uint8 {
	*04775c48a7,
	*c08547ae8e,
	*a7346ee49b,
	*c5994935c2,
	*cea33fa8c2_MAX,
};

// Enum TslGame.ENpcDirection
enum class ENpcDirection : uint8 {
	Forward,
	Backward,
	Left,
	Right,
	ForwardRight,
	BackwardRight,
	BackwardLeft,
	ForwardLeft,
	ENpcDirection_MAX,
};

// Enum TslGame.ENpcWalkingSpeedType
enum class ENpcWalkingSpeedType : uint8 {
	Idle,
	Walk,
	Run,
	Sprint,
	ENpcWalkingSpeedType_MAX,
};

// Enum TslGame.ENpcCharacterStateType
enum class ENpcCharacterStateType : uint8 {
	Default,
	Respawn,
	Fire1,
	Fire2,
	Fire3,
	Knockback,
	Knockdown,
	Getup,
	ThrowPhase1,
	ThrowPhase2,
	ThrowPhase3,
	Blind,
	Despawn,
	RunnerScream,
	ThrowBuff,
	Scream,
	Kidnap,
	Dash,
	InSafeZone,
	MeleeAttackWhileKidnapping,
	DoctorThrowPhase1,
	DoctorThrowPhase2,
	DoctorThrowPhase3,
	ENpcCharacterStateType_MAX,
};

// Enum TslGame.ERandomType
enum class ERandomType : uint8 {
	Random,
	Shuffle,
	Ascending,
	Descending,
	ERandomType_MAX,
};

// Enum TslGame.ECustomAnimDataType
enum class ECustomAnimDataType : uint8 {
	CustomAnimData,
	AnimSequence,
	ECustomAnimDataType_MAX,
};

// Enum TslGame.ECustomAnimSlotType
enum class ECustomAnimSlotType : uint8 {
	FullBody,
	UpperBody,
	FullBodyInstance,
	UpperBodyInstance,
	LowerBody,
	ECustomAnimSlotType_MAX,
};

// Enum TslGame.ERetriggerCounter
enum class ERetriggerCounter : uint8 {
	First,
	Sec,
	Third,
	Fourth,
	ERetriggerCounter_MAX,
};

// Enum TslGame.EPathDebugType
enum class EPathDebugType : uint8 {
	None,
	Location,
	SelectNpc,
	EPathDebugType_MAX,
};

// Enum TslGame.EOneOnOneRoomState
enum class EOneOnOneRoomState : uint8 {
	None,
	MatchPrepare,
	MatchStart,
	MatchEnd,
	MatchEndResult,
	RoundStart,
	RoundPlaying,
	GiveScore,
	BreakTime,
	RoundResult,
	RoundEnd,
	EOneOnOneRoomState_MAX,
};

// Enum TslGame.EOneOnOneStageType
enum class EOneOnOneStageType : uint8 {
	None,
	Arena,
	Audience,
	EOneOnOneStageType_MAX,
};

// Enum TslGame.EOneOnOneTicketState
enum class EOneOnOneTicketState : uint8 {
	None,
	Waiting,
	CountDown,
	Playing,
	EOneOnOneTicketState_MAX,
};

// Enum TslGame.EOneOnOneSideType
enum class EOneOnOneSideType : uint8 {
	None,
	Home,
	Away,
	Audience,
	EOneOnOneSideType_MAX,
};

// Enum TslGame.EOneOnOneInvenRecoverType
enum class EOneOnOneInvenRecoverType : uint8 {
	None,
	Empty,
	Recover,
	EOneOnOneInvenRecoverType_MAX,
};

// Enum TslGame.EOneOnOneResultType
enum class EOneOnOneResultType : uint8 {
	None,
	Lose,
	Win,
	Draw,
	Escape,
	EOneOnOneResultType_MAX,
};

// Enum TslGame.EOneOnOneMessageType
enum class EOneOnOneMessageType : uint8 {
	None,
	StartSearch_Message,
	StopSearch_Message_Normal,
	StopSearch_Message_UseDiffFacility,
	EnterArena_Message,
	ExitArena_Message_Normal,
	ExitArena_Message_FromAudience,
	CannotSearch_Message_NotInProgress,
	EOneOnOneMessageType_MAX,
};

// Enum TslGame.*b144f4465f
enum class *b144f4465f : uint8 {
	*4a3edb2da7,
	*183c8bfacc,
	*75a635850b,
	*9291244cde,
	*d0bd4c95a8,
	*b144f4465f_MAX,
};

// Enum TslGame.*f078137671
enum class *f078137671 : uint8 {
	*db83abb4a6,
	*0dcc7ad96e,
	*fbe9f2c4de,
	*d741014414,
	*f078137671_MAX,
};

// Enum TslGame.*525f57f793
enum class *525f57f793 : uint8 {
	*1087c2144f,
	*f51a40adcc,
	*b4f587e7b6,
	*b44a22d89d,
	*525f57f793_MAX,
};

// Enum TslGame.*06bdb8a6fa
enum class *06bdb8a6fa : uint8 {
	*4fb7a77c71,
	*5b7f047f3c,
	*fe92f48fc5,
	*b6edeb0e57,
	*a0d3b4ae79,
	*06bdb8a6fa_MAX,
};

// Enum TslGame.*8c58b6a757
enum class *8c58b6a757 : uint8 {
	*24081a03df,
	*f2118590d4,
	*8d55e2d69c,
	*8c58b6a757_MAX,
};

// Enum TslGame.ECorrectedSpawnLocationTraceType
enum class ECorrectedSpawnLocationTraceType : uint8 {
	Sweep,
	Trace,
	ECorrectedSpawnLocationTraceType_MAX,
};

// Enum TslGame.EThrowableState
enum class EThrowableState : uint8 {
	Idle,
	PinOff,
	Cooking,
	Throw,
	Dropped,
	EThrowableState_MAX,
};

// Enum TslGame.EProjectileExplosionStartType
enum class EProjectileExplosionStartType : uint8 {
	NotStart,
	Impact,
	Delay,
	ImpactOrDelay,
	EProjectileExplosionStartType_MAX,
};

// Enum TslGame.*f62222e453
enum class *f62222e453 : uint8 {
	*73b22db2e3,
	*2b43406d2d,
	*61aee1512a,
	*c3f6335560,
	*f62222e453_MAX,
};

// Enum TslGame.*680d3c3750
enum class *680d3c3750 : uint8 {
	*39268a0af6,
	*296d550603,
	*57fc935947,
	*7936e532de,
	*680d3c3750_MAX,
};

// Enum TslGame.*019e375b10
enum class *019e375b10 : uint8 {
	*6800a223e8,
	*b33ba4c58d,
	*d58c871af6,
	*19dec11f19,
	*019e375b10_MAX,
};

// Enum TslGame.ETslSLBAreaBlockActorState
enum class ETslSLBAreaBlockActorState : uint8 {
	Close,
	Open,
	MAX,
	ETslSLBAreaBlockActorState_MAX,
};

// Enum TslGame.ETslSLBExitActorState
enum class ETslSLBExitActorState : uint8 {
	Close,
	Open,
	MAX,
	ETslSLBExitActorState_MAX,
};

// Enum TslGame.ETargetInteractionPurpose
enum class ETargetInteractionPurpose : uint8 {
	Move,
	Reset,
	ETargetInteractionPurpose_MAX,
};

// Enum TslGame.ETrainingRoomInteractionType
enum class ETrainingRoomInteractionType : uint8 {
	None,
	Training_Stop,
	ETrainingRoomInteractionType_MAX,
};

// Enum TslGame.ESeatDirection
enum class ESeatDirection : uint8 {
	Forward,
	Backward,
	Left,
	Right,
	ESeatDirection_MAX,
};

// Enum TslGame.ESpareTireProcessState
enum class ESpareTireProcessState : uint8 {
	None,
	PutWorking,
	PutCancel,
	PutFinish,
	TakeWorking,
	TakeCancel,
	TakeFinish,
	ESpareTireProcessState_MAX,
};

// Enum TslGame.EMapColor
enum class EMapColor : uint8 {
	Undefined,
	Red,
	Green,
	Blue,
	Yellow,
	EMapColor_MAX,
};

// Enum TslGame.EVehicleEngineState
enum class EVehicleEngineState : uint8 {
	EEngineStateAutoOff,
	EEngineStateAutoOn,
	EEngineStateManualOff,
	EEngineStateManualOn,
	EVehicleEngineState_MAX,
};

// Enum TslGame.*8ddfb8c08b
enum class *8ddfb8c08b : uint8 {
	*bc2a0f8510,
	*d7f681fe2a,
	*1e974090fe,
	*6b33660896,
	*bcfd9b67bb,
	*8ddfb8c08b_MAX,
};

// Enum TslGame.EPackageState
enum class EPackageState : uint8 {
	Normal,
	Broken,
	Empty,
	EPackageState_MAX,
};

// Enum TslGame.EThingGroupSpawnType
enum class EThingGroupSpawnType : uint8 {
	None,
	Probability,
	TotalCount,
	EThingGroupSpawnType_MAX,
};

// Enum TslGame.EInteractionErrorType
enum class EInteractionErrorType : uint8 {
	None,
	Success,
	Fail_SearchingOneOnOne,
	Fail_PlayingOneOnOne,
	EInteractionErrorType_MAX,
};

// Enum TslGame.*fd5fc664cb
enum class *fd5fc664cb : uint8 {
	*3be0bd37b7,
	*9158652caf,
	*96092a892c,
	*65027dd2c3,
	*fd5fc664cb_MAX,
};

// Enum TslGame.*da516d8bdd
enum class *da516d8bdd : uint8 {
	*0ae50e5427,
	*2af5ee765d,
	*515d0bbd0f,
	*53b50b8449,
	*da516d8bdd_MAX,
};

// Enum TslGame.EContainerState
enum class EContainerState : uint8 {
	Closed,
	Opening,
	Opened,
	EContainerState_MAX,
};

// Enum TslGame.ESpawnDestroyTiming
enum class ESpawnDestroyTiming : uint8 {
	Undefined,
	SpawnOnMatchStart,
	DestoryOnMatchStart,
	ESpawnDestroyTiming_MAX,
};

// Enum TslGame.ELastMoveTask
enum class ELastMoveTask : uint8 {
	MoveTo,
	MoveDirectlyToward,
	ELastMoveTask_MAX,
};

// Enum TslGame.EEjectAllowed
enum class EEjectAllowed : uint8 {
	NotAllowed,
	Waiting,
	Allowed,
	EEjectAllowed_MAX,
};

// Enum TslGame.EUltAutoEquipItemType
enum class EUltAutoEquipItemType : uint8 {
	SubParts,
	Throwable,
	Boost,
	Heal,
	Other,
	EUltAutoEquipItemType_MAX,
};

// Enum TslGame.ECompareTeamDist
enum class ECompareTeamDist : uint8 {
	CurDest,
	FinalDest,
	SafeZone,
	ECompareTeamDist_MAX,
};

// Enum TslGame.EHelicopterState
enum class EHelicopterState : uint8 {
	Normal,
	Smoke,
	Explosion,
	EHelicopterState_MAX,
};

// Enum TslGame.EEmergencyAircraftState
enum class EEmergencyAircraftState : uint8 {
	None,
	Flame,
	Explosion,
	LastExplosion,
	Destroy,
	EEmergencyAircraftState_MAX,
};

// Enum TslGame.EEmPickup_PathValidationState
enum class EEmPickup_PathValidationState : uint8 {
	None,
	InProgress,
	Valid,
	Invalid,
	EEmPickup_MAX,
};

// Enum TslGame.*4b4c829efd
enum class *4b4c829efd : uint8 {
	*f3e82f7adf,
	*ff638068b3,
	*4b4c829efd_MAX,
};

// Enum TslGame.*c38888d688
enum class *c38888d688 : uint8 {
	*90174b8a51,
	*a9e2539380,
	*7add143225,
	*582dc7222d,
	*3129fbac06,
	*09ba852af5,
	*f4ea30e2c8,
	*3d64efc3ae,
	*ae74b3bc11,
	*36df6740f0,
	*aa564e62bc,
	*eadbca3f18,
	*ed09527cdc,
	*c38888d688_MAX,
};

// Enum TslGame.*f8a425f29f
enum class *f8a425f29f : uint8 {
	*abb32eecfc,
	*18db973b7c,
	*377ee42652,
	*220800eb5b,
	*f8a425f29f_MAX,
};

// Enum TslGame.*819c37bb54
enum class *819c37bb54 : uint8 {
	*2fa399d84a,
	*b9ffa516ee,
	*79e5ba22e7,
	*9eef5059bf,
	*6c1b758206,
	*eecf7d2c67,
	*819c37bb54_MAX,
};

// Enum TslGame.EOPUIBuffLocationType
enum class EOPUIBuffLocationType : uint8 {
	None,
	TPP,
	FPP,
	FPPWithMosnterHp,
	MAX,
	EOPUIBuffLocationType_MAX,
};

// Enum TslGame.EClanNoticeUGCLevel
enum class EClanNoticeUGCLevel : uint8 {
	Hide,
	Show,
	EClanNoticeUGCLevel_MAX,
};

// Enum TslGame.EClanNameUGCLevel
enum class EClanNameUGCLevel : uint8 {
	HideAll,
	OnlyMine,
	MineAndOthersTag,
	ShowAll,
	EClanNameUGCLevel_MAX,
};

// Enum TslGame.EPlayerArenaObserverState
enum class EPlayerArenaObserverState : uint8 {
	Off,
	RoundPreview,
	FinalRoundPreview,
	WonAlive,
	WonDead,
	RoundFinished,
	RoundFinishedWhileLoot,
	RoundResultWithObserve,
	RoundResult,
	Eliminated,
	AfterRoundLoadout,
	EPlayerArenaObserverState_MAX,
};

// Enum TslGame.EArenaMoneySource
enum class EArenaMoneySource : uint8 {
	Initial,
	Kill,
	Revive,
	WinArena,
	LoseArena,
	Buy,
	EArenaMoneySource_MAX,
};

// Enum TslGame.EArenaScreenOpen
enum class EArenaScreenOpen : uint8 {
	Loadout,
	Leaderboard,
	EArenaScreenOpen_MAX,
};

// Enum TslGame.EArenaCameraObserveState
enum class EArenaCameraObserveState : uint8 {
	Off,
	FreeFly,
	AttachedToPlayer,
	EArenaCameraObserveState_MAX,
};

// Enum TslGame.*5e559fc21f
enum class *5e559fc21f : uint8 {
	*5d484485be,
	*39ec60a0fb,
	*13116ccdf4,
	*90d248b810,
	*f2a9e0e805,
	*0c09949aeb,
	*400c160dc2,
	*6796aacdd2,
	*a994657415,
	*5e559fc21f_MAX,
};

// Enum TslGame.EStrictSelectObserveTarget
enum class EStrictSelectObserveTarget : uint8 {
	None,
	Arena,
	Player,
	EStrictSelectObserveTarget_MAX,
};

// Enum TslGame.EFutsalSoundType
enum class EFutsalSoundType : uint8 {
	Goal,
	Start,
	Finish,
	EFutsalSoundType_MAX,
};

// Enum TslGame.EHASSurvivorItemLevel
enum class EHASSurvivorItemLevel : uint8 {
	None,
	Lv1,
	Lv2,
	EHASSurvivorItemLevel_MAX,
};

// Enum TslGame.EHASSurvivorItemType
enum class EHASSurvivorItemType : uint8 {
	None,
	Flashbang,
	Healkit,
	Toolkit,
	SmokeBomb,
	EHASSurvivorItemType_MAX,
};

// Enum TslGame.EHASSurvivorCorruptPhase
enum class EHASSurvivorCorruptPhase : uint8 {
	None,
	PhaseOne,
	PhaseTwo,
	Corrupted,
	EHASSurvivorCorruptPhase_MAX,
};

// Enum TslGame.EHASSurvivorBreathState
enum class EHASSurvivorBreathState : uint8 {
	None,
	NormalBreath,
	FastBreath,
	Exhausted,
	EHASSurvivorBreathState_MAX,
};

// Enum TslGame.EHASSurvivorState
enum class EHASSurvivorState : uint8 {
	Normal,
	Injured,
	DBNO,
	BodyCarried,
	Captured,
	Dead,
	Escaped,
	Sacrificed,
	EndgameDead,
	EHASSurvivorState_MAX,
};

// Enum TslGame.EHASSeekerState
enum class EHASSeekerState : uint8 {
	Normal,
	Stunned,
	EHASSeekerState_MAX,
};

// Enum TslGame.EHASPlayerRole
enum class EHASPlayerRole : uint8 {
	None,
	Killer,
	Survivor,
	EHASPlayerRole_MAX,
};

// Enum TslGame.ETslParticleCullType
enum class ETslParticleCullType : uint8 {
	None,
	Distance,
	Frustum,
	LastRenderedTime,
	SameTransform,
	NearbyTransform,
	DistAndFrustumAndNear,
	All,
	ETslParticleCullType_MAX,
};

// Enum TslGame.ETslParticleGroupPriority
enum class ETslParticleGroupPriority : uint8 {
	High,
	Low,
	ETslParticleGroupPriority_MAX,
};

// Enum TslGame.ETslHASStencilColor
enum class ETslHASStencilColor : uint8 {
	None,
	SpectatedCharacter,
	SpectatedCharacterTeam,
	SpectatedCharacterEnemy,
	WithoutSpectatedCharacter,
	WithoutSpectatedTeamCharacter,
	InteractionFocusingColor,
	SandboxOutline,
	Invincible,
	ETslHASStencilColor_MAX,
};

// Enum TslGame.*caa2d0db8b
enum class *caa2d0db8b : uint8 {
	*6e76835f5d,
	*ae2a79ab10,
	*2421ead75a,
	*63f060518c,
	*5d3f416413,
	*3b0908e462,
	*ba551489df,
	*caa2d0db8b_MAX,
};

// Enum TslGame.ETslHASInteractType
enum class ETslHASInteractType : uint8 {
	BlockAllInteractive,
	InteractionObjectCanPassThrough,
	ETslHASInteractType_MAX,
};

// Enum TslGame.ETslHASFixTargetState
enum class ETslHASFixTargetState : uint8 {
	PreStart,
	Normal,
	StopFixing,
	Fixing,
	Explode,
	Broken,
	Fixed,
	ETslHASFixTargetState_MAX,
};

// Enum TslGame.EHASSoundType
enum class EHASSoundType : uint8 {
	Breath,
	BreathStop,
	FastBreath,
	FastBreathStop,
	HeartBeat,
	ReadyToFire,
	Exhausted,
	ExhaustedStop,
	Moan,
	MoanStop,
	Panic,
	CabinetPanic,
	SeekerStun,
	EHASSoundType_MAX,
};

// Enum TslGame.ETslHAS_QTEType
enum class ETslHAS_QTEType : uint8 {
	Generator,
	Wiggle,
	Prison,
	Healing,
	None,
	ETslHAS_MAX,
};

// Enum TslGame.ETslHASActiveEffet
enum class ETslHASActiveEffet : uint8 {
	GeneratorActive,
	PrisonActive,
	ExitActive,
	None,
	ETslHASActiveEffet_MAX,
};

// Enum TslGame.*941e67971d
enum class *941e67971d : uint8 {
	*25c1a67a3e,
	*411a62eb7c,
	*941e67971d_MAX,
};

// Enum TslGame.EPrivateTrainingRoomPhase
enum class EPrivateTrainingRoomPhase : uint8 {
	None,
	FinishSelect_Practice,
	StartSelect_Weapon,
	SetupStart_Practice,
	CountDownStart_Practice,
	Start_Practice,
	Cancel_Practice,
	Finish_Practice,
	Restart_Practice,
	Exit_Practice,
	EPrivateTrainingRoomPhase_MAX,
};

// Enum TslGame.EPrivateWaitingRoomPhase
enum class EPrivateWaitingRoomPhase : uint8 {
	None,
	LoadingMap,
	Ready,
	StartSelect_Practice,
	EPrivateWaitingRoomPhase_MAX,
};

// Enum TslGame.ETrainingScoreType
enum class ETrainingScoreType : uint8 {
	None,
	HeadShot,
	Kill,
	SoundCatch,
	TotalScore,
	AimAccuracy,
	ETrainingScoreType_MAX,
};

// Enum TslGame.ETrainingPracticeType
enum class ETrainingPracticeType : uint8 {
	None,
	Practice_Aim,
	Practice_Sound,
	ETrainingPracticeType_MAX,
};

// Enum TslGame.ETslTrainingTeleportType
enum class ETslTrainingTeleportType : uint8 {
	InfoThumnail,
	MapIconVolume,
	NONE,
	ETslTrainingTeleportType_MAX,
};

// Enum TslGame.EBombUIHUDTimerStatusType
enum class EBombUIHUDTimerStatusType : uint8 {
	None,
	RoundTime,
	Attack,
	Defence,
	MAX,
	EBombUIHUDTimerStatusType_MAX,
};

// Enum TslGame.EBombUIMatchResultType
enum class EBombUIMatchResultType : uint8 {
	None,
	Lose,
	Win,
	Draw,
	MAX,
	EBombUIMatchResultType_MAX,
};

// Enum TslGame.EBombUIPlayerStatusType
enum class EBombUIPlayerStatusType : uint8 {
	None,
	Alive,
	DBNO,
	Die,
	Disconnected,
	MAX,
	EBombUIPlayerStatusType_MAX,
};

// Enum TslGame.ETslPreloadPriority
enum class ETslPreloadPriority : uint8 {
	Static,
	Dynamic,
	ETslPreloadPriority_MAX,
};

// Enum TslGame.BlueChipTowerAnimState
enum class BlueChipTowerAnimState : uint8 {
	Wait,
	IsInUse,
	Success,
	BlueChipTowerAnimState_MAX,
};

// Enum TslGame.EFollowTargetType
enum class EFollowTargetType : uint8 {
	Bot,
	CurrentPlayer,
	EFollowTargetType_MAX,
};

// Enum TslGame.*f252d59620
enum class *f252d59620 : uint8 {
	*7175d5cbe8,
	*f187ccb0ab,
	*f252d59620_MAX,
};

// Enum TslGame.EHASGamePhase
enum class EHASGamePhase : uint8 {
	NotStarted,
	Started,
	GeneratorAllFixed,
	EndGame,
	MatchEnded,
	EHASGamePhase_MAX,
};

// Enum TslGame.EHASPrisonSoundType
enum class EHASPrisonSoundType : uint8 {
	Bluezone,
	BluezoneStop,
	Sink,
	EHASPrisonSoundType_MAX,
};

// Enum TslGame.ETslHASPrisonState
enum class ETslHASPrisonState : uint8 {
	PreStart,
	Normal,
	Broken,
	SurvivorHooked,
	Sacrificed,
	Reload,
	ETslHASPrisonState_MAX,
};

// Enum TslGame.*12eae276b6
enum class *12eae276b6 : uint8 {
	*ae592c0c15,
	*4a7729277a,
	*0b7fef5389,
	*71be4d4a4c,
	*2c65c06b77,
	*a109c15bb4,
	*a98961ebe2,
	*4d6b23bf8f,
	*41b1f43b9b,
	*12eae276b6_MAX,
};

// Enum TslGame.EHealthDebuffType
enum class EHealthDebuffType : uint8 {
	None,
	Bleed,
	EHealthDebuffType_MAX,
};

// Enum TslGame.EControlDebuffType
enum class EControlDebuffType : uint8 {
	None,
	Stun,
	Trap,
	Slow,
	EControlDebuffType_MAX,
};

// Enum TslGame.EBulletproofShieldDurabilityState
enum class EBulletproofShieldDurabilityState : uint8 {
	None,
	Normal,
	Damaged,
	DamagedSeverely,
	Destroyed,
	EBulletproofShieldDurabilityState_MAX,
};

// Enum TslGame.EBulletproofShieldInstallState
enum class EBulletproofShieldInstallState : uint8 {
	None,
	InstallInprogress,
	InstallComplete,
	Destroyed,
	EBulletproofShieldInstallState_MAX,
};

// Enum TslGame.*63ea63687b
enum class *63ea63687b : uint8 {
	*39776ec0b1,
	*57e13de35c,
	*e4ebd65835,
	*d3cc224948,
	*bef507be48,
	*7b8a46bf73,
	*c513c68c52,
	*8687b9e30b,
	*b85d84b8ba,
	*63ea63687b_MAX,
};

// Enum TslGame.EAITaskState
enum class EAITaskState : uint8 {
	Idle,
	Tasking,
	Done,
	InValid,
	EAITaskState_MAX,
};

// Enum TslGame.EZombieTargetingType
enum class EZombieTargetingType : uint8 {
	Passive,
	Aggressive,
	AggresiveRandom,
	EZombieTargetingType_MAX,
};

// Enum TslGame.EZombieAttackType
enum class EZombieAttackType : uint8 {
	Melee,
	Throw,
	EZombieAttackType_MAX,
};

// Enum TslGame.EDroneOperationalState
enum class EDroneOperationalState : uint8 {
	INVALID,
	ENABLED_ENUM_START,
	ENABLED,
	ENABLED_CONTROLLED,
	ENABLED_RETURNING_TO_OWNER,
	ENABLED_ENUM_END,
	DISABLED_ENUM_START,
	DISABLED,
	DISABLED_IN_WATER,
	DISABLED_DESTROYED,
	DISABLED_ENUM_END,
	COUNT,
	EDroneOperationalState_MAX,
};

// Enum TslGame.EDroneState
enum class EDroneState : uint8 {
	INVALID,
	STOWED,
	STOWING,
	PICK_UP,
	EQUIPPING,
	EQUIPPED,
	DEPLOYED,
	COUNT,
	EDroneState_MAX,
};

// Enum TslGame.*edb6076908
enum class *edb6076908 : uint8 {
	*b141dfc214,
	*476f2416e3,
	*491040541f,
	*32670dba7e,
	*edb6076908_MAX,
};

// Enum TslGame.*cdf9d3fc2d
enum class *cdf9d3fc2d : uint8 {
	*5b7f047f3c,
	*c11cf929bd,
	*d80362a69b,
	*cdf9d3fc2d_MAX,
};

// Enum TslGame.EBodyCarryState
enum class EBodyCarryState : uint8 {
	Inactive,
	Active,
	PickingUp,
	Dropping,
	EBodyCarryState_MAX,
};

// Enum TslGame.ECountInfoAnimType
enum class ECountInfoAnimType : uint8 {
	None,
	Default,
	Decreasing,
	Increasing,
	Warning,
	Emerging,
	Vanishing,
	ECountInfoAnimType_MAX,
};

// Enum TslGame.*c4b176c7c9
enum class *c4b176c7c9 : uint8 {
	*e1230da2ed,
	*e3b79e163e,
	*c4b176c7c9_MAX,
};

// Enum TslGame.ETrainingDashboardRange
enum class ETrainingDashboardRange : uint8 {
	None,
	Range10,
	Range50,
	Range100,
	ETrainingDashboardRange_MAX,
};

// Enum TslGame.ECustomDamageEventReactionType
enum class ECustomDamageEventReactionType : uint8 {
	SpawnActor,
	StopSpawnedParticles,
	HideMesh,
	HideMeshInstance,
	HideBone,
	ApplyPhysicalAnimationProfile,
	SetCollisionEnabled,
	ECustomDamageEventReactionType_MAX,
};

// Enum TslGame.*cfa246ad19
enum class *cfa246ad19 : uint8 {
	*b057412946,
	*104d668c57,
	*f02b54e228,
	*cfa246ad19_MAX,
};

// Enum TslGame.EScmCollisionGroup
enum class EScmCollisionGroup : uint8 {
	Default,
	FireField,
	ExplosiveItem,
	EScmCollisionGroup_MAX,
};

// Enum TslGame.EDamageFieldType
enum class EDamageFieldType : uint8 {
	Default,
	DirectTick,
	EDamageFieldType_MAX,
};

// Enum TslGame.EOptionTab
enum class EOptionTab : uint8 {
	Graphics,
	Audio,
	Controls,
	Gameplay,
	KeyBindings,
	EOptionTab_MAX,
};

// Enum TslGame.ETslGameOptionKeyBindingType
enum class ETslGameOptionKeyBindingType : uint8 {
	None,
	Action,
	Axis,
	ETslGameOptionKeyBindingType_MAX,
};

// Enum TslGame.ETslGameOptionSupplementaryType
enum class ETslGameOptionSupplementaryType : uint8 {
	None,
	KeyboardLayout,
	PreviewImage,
	PreviewCrosshair,
	VolumeUnitMeter,
	PreviewMaterial,
	LinkButton,
	ETslGameOptionSupplementaryType_MAX,
};

// Enum TslGame.ENaviGamepadInputType
enum class ENaviGamepadInputType : uint8 {
	DPad_Pressed,
	DPad_Released,
	Axis,
	Axis_Hold,
	ENaviGamepadInputType_MAX,
};

// Enum TslGame.EDynamicWeather
enum class EDynamicWeather : uint8 {
	NotInitialized,
	Initialized,
	BlendInStarted,
	Saturated,
	BlendOutStarted,
	BlendOutEnded,
	Finished,
	EDynamicWeather_MAX,
};

// Enum TslGame.EEffectSpreadState
enum class EEffectSpreadState : uint8 {
	ESS_InitialTrace,
	ESS_InitialProcess,
	ESS_Spreading,
	ESS_SpreadDone,
	ESS_Ending,
	ESS_MAX,
};

// Enum TslGame.*abdfb270ac
enum class *abdfb270ac : uint8 {
	*dd124cb126,
	*1fcbfd4603,
	*3842c80afe,
	*a4fb65fe44,
	*abdfb270ac_MAX,
};

// Enum TslGame.ETslFenceSelector
enum class ETslFenceSelector : uint8 {
	None,
	Use_2,
	Use_3,
	Use_4,
	Use_5,
	ETslFenceSelector_MAX,
};

// Enum TslGame.EFlowTextState
enum class EFlowTextState : uint8 {
	None,
	Wait,
	FlowLeftOut,
	FlowLeftIn,
	FlowRightOut,
	FlowRightIn,
	BlinkAnimation,
	EFlowTextState_MAX,
};

// Enum TslGame.*4ffb3bc856
enum class *4ffb3bc856 : uint8 {
	*9d63ffaa7c,
	*ba072f5e21,
	*c59a127d60,
	*b135c19091,
	*0c803b072d,
	*278bb7ecd7,
	*a8162cc892,
	*4ffb3bc856_MAX,
};

// Enum TslGame.EBBHolderSelectMethod
enum class EBBHolderSelectMethod : uint8 {
	Closest,
	Random,
	EBBHolderSelectMethod_MAX,
};

// Enum TslGame.*2c9ea0e78e
enum class *2c9ea0e78e : uint8 {
	*f91e9b29f7,
	*943455175a,
	*eedb7343a1,
	*561893262b,
	*2c9ea0e78e_MAX,
};

// Enum TslGame.ERacingBgmTheme
enum class ERacingBgmTheme : uint8 {
	Default,
	WinterRaicng,
	ERacingBgmTheme_MAX,
};

// Enum TslGame.EHungerState
enum class EHungerState : uint8 {
	Normal,
	Hunger,
	Starvation,
	Famine,
	EHungerState_MAX,
};

// Enum TslGame.EWarModeCarePackageKitType
enum class EWarModeCarePackageKitType : uint8 {
	CarepackageKit_Off,
	CarepackageKit_Basic,
	CarepackageKit_ARKit,
	CarepackageKit_SRKit,
	CarepackageKit_MAX,
};

// Enum TslGame.*988cf4cb82
enum class *988cf4cb82 : uint8 {
	*4e0e936c19,
	*56ca050946,
	*8a7fa8e836,
	*988cf4cb82_MAX,
};

// Enum TslGame.*e75b202d9c
enum class *e75b202d9c : uint8 {
	*170f38dce4,
	*f6b45a9403,
	*701e8e1a55,
	*e75b202d9c_MAX,
};

// Enum TslGame.EVoiceChatChannel
enum class EVoiceChatChannel : uint8 {
	All,
	TeamOnly,
	None,
	MAX,
	EVoiceChatChannel_MAX,
};

// Enum TslGame.EVoiceInputMode_Console
enum class EVoiceInputMode_Console : uint8 {
	OpenMic,
	Disable,
	MAX,
	EVoiceInputMode_MAX,
};

// Enum TslGame.EVoiceInputMode_PC
enum class EVoiceInputMode_PC : uint8 {
	OpenMic,
	PushToTalk,
	Toggle,
	Disable,
	MAX,
	EVoiceInputMode_MAX,
};

// Enum TslGame.ERacingGamePhase
enum class ERacingGamePhase : uint8 {
	NotStarted,
	PrepareState,
	InProgress,
	EndPhase,
	End,
	ERacingGamePhase_MAX,
};

// Enum TslGame.EGasPumpState
enum class EGasPumpState : uint8 {
	Inactive,
	StartFueling,
	StopFueling,
	StopFuelingFull,
	EGasPumpState_MAX,
};

// Enum TslGame.ETslHelperInputActionType
enum class ETslHelperInputActionType : uint8 {
	DPad,
	Shoulder,
	Face,
	Keyboard,
	ETslHelperInputActionType_MAX,
};

// Enum TslGame.*d0acc11e25
enum class *d0acc11e25 : uint8 {
	*c20796596e,
	*79a1c4f792,
	*7d0e76297f,
	*d0acc11e25_MAX,
};

// Enum TslGame.*7a9d995979
enum class *7a9d995979 : uint8 {
	*6e76835f5d,
	*2421ead75a,
	*dfcd81a98a,
	*9b239b6651,
	*92b4e0726b,
	*f100b9cf44,
	*7a9d995979_MAX,
};

// Enum TslGame.*e34786309f
enum class *e34786309f : uint8 {
	*6e76835f5d,
	*f50399c417,
	*2421ead75a,
	*3f371b4ec7,
	*e34786309f_MAX,
};

// Enum TslGame.ETrainingButtonActiveType
enum class ETrainingButtonActiveType : uint8 {
	Default,
	AimTrainingOnly,
	ETrainingButtonActiveType_MAX,
};

// Enum TslGame.EVendingMachineState
enum class EVendingMachineState : uint8 {
	ACTIVATED,
	DEACTIVATED_TEMPORARILY_BY_PICK_DELAY,
	DEACTIVATED_TEMPORARILY_BY_DAMAGE,
	DEACTIVATED_TEMPORARILY_BY_JACKPOT,
	DEACTIVATED_PERMANANTLY_BY_EXCEEDED_MAX_PICK_COUNT,
	EVendingMachineState_MAX,
};

// Enum TslGame.EOutGameMontageState
enum class EOutGameMontageState : uint8 {
	Default,
	Playing,
	Interrupted,
	Finished,
	EOutGameMontageState_MAX,
};

// Enum TslGame.EItemRequestType
enum class EItemRequestType : uint8 {
	None,
	Heal,
	Ammo,
	EItemRequestType_MAX,
};

// Enum TslGame.JukeBoxAnimState
enum class JukeBoxAnimState : uint8 {
	OPEN,
	CLOSED,
	JukeBoxAnimState_MAX,
};

// Enum TslGame.ELivingThingThreatLevel
enum class ELivingThingThreatLevel : uint8 {
	NoChanged,
	IncrementThreatLevel,
	DecrementThreatLevel,
	Calm,
	Fear,
	Panic,
	Dead,
	MAX,
	ELivingThingThreatLevel_MAX,
};

// Enum TslGame.ELivingThingCustomEvent
enum class ELivingThingCustomEvent : uint8 {
	HittedByBullet,
	HittedByExplosion,
	HittedByCar,
	HittedByCharacter,
	HittedByLivingThing,
	HittedByPhysicsBody,
	HittedByOthers,
	Custom1,
	Custom2,
	Custom3,
	Custom4,
	Custom5,
	Custom6,
	Custom7,
	Custom8,
	Custom9,
	Custom10,
	Custom11,
	Custom12,
	Custom13,
	Custom14,
	Custom15,
	Custom16,
	Custom17,
	Custom18,
	Custom19,
	Custom20,
	MAX,
	ELivingThingCustomEvent_MAX,
};

// Enum TslGame.ETLMeshSelection
enum class ETLMeshSelection : uint8 {
	Auto,
	StaticMesh,
	SkeletalMesh,
	None,
	ETLMeshSelection_MAX,
};

// Enum TslGame.ELobbyCharacterPosition
enum class ELobbyCharacterPosition : uint8 {
	Position1,
	Position2,
	Position3,
	Position4,
	ELobbyCharacterPosition_MAX,
};

// Enum TslGame.ELobbyCharacterReadyType
enum class ELobbyCharacterReadyType : uint8 {
	Ready,
	NotReady,
	ReadyToNotReady,
	NotReadyToReady,
	EmoteToReady,
	EmoteToNotReady,
	ELobbyCharacterReadyType_MAX,
};

// Enum TslGame.ETslSLBZombieSpawnType
enum class ETslSLBZombieSpawnType : uint8 {
	Instant,
	Time,
	ETslSLBZombieSpawnType_MAX,
};

// Enum TslGame.EObserverPlayerListType
enum class EObserverPlayerListType : uint8 {
	Distance,
	Kill,
	Survivor,
	Max,
	EObserverPlayerListType_MAX,
};

// Enum TslGame.ECustomDamageZoneType
enum class ECustomDamageZoneType : uint8 {
	Head,
	UpperBody,
	LowerBody,
	Arms,
	Legs,
	ECustomDamageZoneType_MAX,
};

// Enum TslGame.ECustomDamageWeaponClass
enum class ECustomDamageWeaponClass : uint8 {
	Bullet,
	Melee,
	ECustomDamageWeaponClass_MAX,
};

// Enum TslGame.EArenaStartType
enum class EArenaStartType : uint8 {
	Player,
	AircraftStart,
	AircraftEnd,
	EArenaStartType_MAX,
};

// Enum TslGame.ERacingItemIcon
enum class ERacingItemIcon : uint8 {
	Heal,
	Ammo,
	Boost,
	Gun,
	FlareAmmo,
	FlashBang,
	Granade,
	SmokeBomb,
	SpikeTrap,
	StickyBomb,
	FirstKillBombardItem,
	FirstKillBombardItem_NotActivate,
	ERacingItemIcon_MAX,
};

// Enum TslGame.ERacingGameScoreType
enum class ERacingGameScoreType : uint8 {
	CheckPoint,
	Trick,
	Kill,
	ERacingGameScoreType_MAX,
};

// Enum TslGame.ETslSLBInteractionType
enum class ETslSLBInteractionType : uint8 {
	None,
	Generator,
	Refueling,
	ClearDebuff,
	OpenLastDoor,
	MAX,
	ETslSLBInteractionType_MAX,
};

// Enum TslGame.EPGALOutput
enum class EPGALOutput : uint8 {
	Succeeded,
	Failed,
	EPGALOutput_MAX,
};

// Enum TslGame.*e3f472d76f
enum class *e3f472d76f : uint8 {
	*82c8abf5e1,
	*a9ab05c26d,
	*31cf32c101,
	*a2cf48853e,
	*49dad1dcff,
	*e3f472d76f_MAX,
};

// Enum TslGame.ESpikeDeploymentState
enum class ESpikeDeploymentState : uint8 {
	PreDeploy,
	Deploying,
	PostDeploy,
	Popped,
	Idle,
	ESpikeDeploymentState_MAX,
};

// Enum TslGame.E40mmDeployState
enum class E40mmDeployState : uint8 {
	None,
	FuseTriggered,
	DeployStarted,
	DeployFinished,
	DeployFailed,
	E40mmDeployState_MAX,
};

// Enum TslGame.*008a90bc13
enum class *008a90bc13 : uint8 {
	*d10d4d7e59,
	*e0a120170d,
	*0d2fd1ab7f,
	*008a90bc13_MAX,
};

// Enum TslGame.ETslPubgIdAssetType
enum class ETslPubgIdAssetType : uint8 {
	NONE,
	NAMEPLATE,
	EMBLEM,
	EMBLEM_ANIMATED,
	MEDAL1,
	MEDAL2,
	CLANPLATE,
	CLANPLATE_LOW_DEFINITION,
	TIER,
	ETslPubgIdAssetType_MAX,
};

// Enum TslGame.*5de6422ef1
enum class *5de6422ef1 : uint8 {
	*aa3de6f665,
	*422ed37b3e,
	*b0df0379d9,
	*5de6422ef1_MAX,
};

// Enum TslGame.ETslReferenceObjType
enum class ETslReferenceObjType : uint8 {
	GameMode,
	Character,
	Preload,
	ETslReferenceObjType_MAX,
};

// Enum TslGame.*0ef1e606e1
enum class *0ef1e606e1 : uint8 {
	*a34d0ae4de,
	*4f89aa9c51,
	*9c12ca9eec,
	*d63b170b0d,
	*085036d264,
	*0ef1e606e1_MAX,
};

// Enum TslGame.ESLBTriggerShapeType
enum class ESLBTriggerShapeType : uint8 {
	Box,
	Sphere,
	ESLBTriggerShapeType_MAX,
};

// Enum TslGame.ESandStormSoundType
enum class ESandStormSoundType : uint8 {
	None,
	StartSound,
	LoopSound,
	InSound,
	OutSound,
	ESandStormSoundType_MAX,
};

// Enum TslGame.EReplayTimelineMode
enum class EReplayTimelineMode : uint8 {
	ReplayPlay,
	ReplayEditor,
	ReplayRender,
	EReplayTimelineMode_MAX,
};

// Enum TslGame.*5d9cb0fcf7
enum class *5d9cb0fcf7 : uint8 {
	*dc7fed0b3e,
	*a1221eb41f,
	*10363a8759,
	*4020d5b33e,
	*a0b4c10f8d,
	*5d9cb0fcf7_MAX,
};

// Enum TslGame.*9addfc3028
enum class *9addfc3028 : uint8 {
	*6b50975398,
	*babcf3098a,
	*4435a26564,
	*8c86b0f5a7,
	*af3c079411,
	*72c6cd1d32,
	*af91e02389,
	*01c0ea515d,
	*5b4d9e0b92,
	*d7c004eb7a,
	*34eedcbaf8,
	*9addfc3028_MAX,
};

// Enum TslGame.ERideVehicle
enum class ERideVehicle : uint8 {
	None,
	Ride,
	Leave,
	ERideVehicle_MAX,
};

// Enum TslGame.*872d1d2e3c
enum class *872d1d2e3c : uint8 {
	*26a3fe6194,
	*a3b5d2b7de,
	*1ac979a662,
	*872d1d2e3c_MAX,
};

// Enum TslGame.*dd860635c9
enum class *dd860635c9 : uint8 {
	*073295d81d,
	*4693f0f5de,
	*7b7464af12,
	*dd860635c9_MAX,
};

// Enum TslGame.ERedeployProgressDotType
enum class ERedeployProgressDotType : uint8 {
	None,
	Pass,
	Start,
	Recruit,
	NotOpenYet,
	PlayingRedeploy,
	MAX,
	ERedeployProgressDotType_MAX,
};

// Enum TslGame.ETslTrainingDashboardRangeUIType
enum class ETslTrainingDashboardRangeUIType : uint8 {
	None,
	Range10,
	Range50,
	Range100,
	ETslTrainingDashboardRangeUIType_MAX,
};

// Enum TslGame.ETslTrainingDashboardPracticeUIType
enum class ETslTrainingDashboardPracticeUIType : uint8 {
	None,
	Practice_Aim,
	Practice_Sound,
	ETslTrainingDashboardPracticeUIType_MAX,
};

// Enum TslGame.*0c68ec7517
enum class *0c68ec7517 : uint8 {
	*082d2336e5,
	*78ca83dfde,
	*2a5df1edc3,
	*007a2eaf1c,
	*8e2aa53e6b,
	*e1dce969c9,
	*1dbad4c196,
	*0c68ec7517_MAX,
};

// Enum TslGame.*f170959b53
enum class *f170959b53 : uint8 {
	*1982af0706,
	*0bb315bc91,
	*24ee755cb5,
	*f170959b53_MAX,
};

// Enum TslGame.EMeleeThrowState
enum class EMeleeThrowState : uint8 {
	Idle,
	Prepare,
	Throw,
	EMeleeThrowState_MAX,
};

// Enum TslGame.*9419b42be7
enum class *9419b42be7 : uint8 {
	*017d74d695,
	*86f793b306,
	*81e43090fb,
	*9419b42be7_MAX,
};

// Enum TslGame.EMinimapFocus
enum class EMinimapFocus : uint8 {
	CharacterFocus,
	NextPlayzoneFocus,
	None,
	EMinimapFocus_MAX,
};

// Enum TslGame.ETslArenaLoadoutItemCategory
enum class ETslArenaLoadoutItemCategory : uint8 {
	PistolAndShotgun,
	Smg,
	Ar,
	Dmr,
	Sr,
	Equipment,
	ETslArenaLoadoutItemCategory_MAX,
};

// Enum TslGame.ETslArenaLoadoutDirections
enum class ETslArenaLoadoutDirections : uint8 {
	Up,
	Right,
	Down,
	Left,
	ETslArenaLoadoutDirections_MAX,
};

// Enum TslGame.*873c9362e5
enum class *873c9362e5 : uint8 {
	*972c65463e,
	*5b336f07bd,
	*de806fdd55,
	*f9b0498502,
	*873c9362e5_MAX,
};

// Enum TslGame.EConditionOfDeath
enum class EConditionOfDeath : uint8 {
	HeadShot,
	DBNO,
	DBNOByHeadShot,
	None,
	EConditionOfDeath_MAX,
};

// Enum TslGame.ETslTeamInfoIconState
enum class ETslTeamInfoIconState : uint8 {
	Default,
	Vehicle,
	Parachute,
	Die,
	Groggy,
	Quitter,
	AirCraft,
	ItemRequest,
	EmergencyPickup,
	BlueBallHolder,
	Redeploy,
	RedeployFighting,
	Revival,
	SpecificMode,
	ETslTeamInfoIconState_MAX,
};

// Enum TslGame.EControllerImageType
enum class EControllerImageType : uint8 {
	XboxOne,
	PS4,
	Quail,
	Quail_ThirdParty,
	None,
	EControllerImageType_MAX,
};

// Enum TslGame.EBinaryStepperType
enum class EBinaryStepperType : uint8 {
	OFF,
	ON,
	EBinaryStepperType_MAX,
};

// Enum TslGame.EKeyIconCombinationDisplayType
enum class EKeyIconCombinationDisplayType : uint8 {
	NotUsed,
	Empty,
	Plus,
	Slash,
	EKeyIconCombinationDisplayType_MAX,
};

// Enum TslGame.EGamepadKeyIconDisplayType
enum class EGamepadKeyIconDisplayType : uint8 {
	Tap,
	DoubleTap,
	ComboHold,
	TimerHoldCircle,
	TimerHoldBar,
	EGamepadKeyIconDisplayType_MAX,
};

// Enum TslGame.EDirectMessageColorType
enum class EDirectMessageColorType : uint8 {
	Alert,
	System,
	Chat,
	Clan,
	MAX,
	EDirectMessageColorType_MAX,
};

// Enum TslGame.*18dd162de2
enum class *18dd162de2 : uint8 {
	*287d76f50c,
	*056c8e24e3,
	*c03441b99b,
	*65ac627ac5,
	*18dd162de2_MAX,
};

// Enum TslGame.*e4161d4242
enum class *e4161d4242 : uint8 {
	*c4a34d9b0a,
	*28973b0fed,
	*0cbd05bdd8,
	*e4161d4242_MAX,
};

// Enum TslGame.EEmotePlayViewType
enum class EEmotePlayViewType : uint8 {
	Disable,
	TeamMate_Enable,
	Interaction_Enable,
	EEmotePlayViewType_MAX,
};

// Enum TslGame.*66fc567e90
enum class *66fc567e90 : uint8 {
	*696558800f,
	*4573e87815,
	*4c850a6cb3,
	*0cbd05bdd8,
	*66fc567e90_MAX,
};

// Enum TslGame.EBluezoneState
enum class EBluezoneState : uint8 {
	Wait,
	Release,
	NoRestrict,
	EBluezoneState_MAX,
};

// Enum TslGame.EStatInfoType
enum class EStatInfoType : uint8 {
	Kill,
	Damage,
	Assist,
	EStatInfoType_MAX,
};

// Enum TslGame.EDisplayPlayerInfoType
enum class EDisplayPlayerInfoType : uint8 {
	PlayerList,
	EngagedEnemies,
	NearbyPlayers,
	OtherEngagements,
	ObserverTeamInfoList,
	EDisplayPlayerInfoType_MAX,
};

// Enum TslGame.MatchResultTypeEnum
enum class MatchResultTypeEnum : uint8 {
	INVALID,
	DEFAULT,
	OBSERVER,
	ZOMBIE,
	LEAGUE,
	TYPE_NUM,
	MatchResultTypeEnum_MAX,
};

// Enum TslGame.EMarkStates
enum class EMarkStates : uint8 {
	Normal,
	Groggy,
	Dead,
	Vehicle,
	Parachute,
	Quitter,
	Aircraft,
	ItemRequest,
	EmergencyPickup,
	EMarkStates_MAX,
};

// Enum TslGame.ETeenageInfoType
enum class ETeenageInfoType : uint8 {
	Normal,
	Season,
	ETeenageInfoType_MAX,
};

// Enum TslGame.EGuideKeyType
enum class EGuideKeyType : uint8 {
	PickUp,
	Drop,
	QuickPickUp,
	QuickDrop,
	QuickPack,
	Equip,
	Unequip,
	Swap,
	Detach,
	Unpack,
	Use,
	SwitchSlot,
	Confirm,
	Cancel,
	Apply,
	Purchase,
	DetachAll,
	UnpackAll,
	PickUpAmount,
	DropAmount,
	SwapWeapon,
	DropWeapon,
	QuickEquip,
	QuickEquip_NoHold,
	MoveToTrunk,
	DropFromTrunk,
	VicinityToTrunk,
	WeaponToTrunk,
	Pack,
	Pack_NoHold,
	None,
	EGuideKeyType_MAX,
};

// Enum TslGame.EBlueBlockerStateUIType
enum class EBlueBlockerStateUIType : uint8 {
	None,
	Active,
	Deactive,
	Hide,
	EBlueBlockerStateUIType_MAX,
};

// ScriptStruct TslGame.*5f2a4acf67
// Size: 0x40 (Inherited: 0x00)
struct F*5f2a4acf67 {
	enum class EWeaponAttachmentSlotID AttachmentSlotID; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName AttachmentTag; // 0x08(0x08)
	struct UStaticMesh* AttachmentMeshAsset; // 0x10(0x20)
	struct FName AttachmentMeshName; // 0x30(0x08)
	struct UClass* AttachmentTemplate; // 0x38(0x08)
};

// ScriptStruct TslGame.DeathMessage
// Size: 0x108 (Inherited: 0x00)
struct FDeathMessage {
	struct FText KillerName; // 0x00(0x18)
	struct FText VictimName; // 0x18(0x18)
	struct FText KillerUniqueId; // 0x30(0x18)
	struct FUniqueNetIdRepl GroggyCauserUniqueId; // 0x48(0x18)
	struct FText VictimUniqueId; // 0x60(0x18)
	char bKillerIsOwner : 1; // 0x78(0x01)
	char bVictimIsOwner : 1; // 0x78(0x01)
	char bVictimIsPillar : 1; // 0x78(0x01)
	char bVictimIsMonster : 1; // 0x78(0x01)
	char pad_78_4 : 4; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	int32 KillerTeamNum; // 0x7c(0x04)
	int32 VictimTeamNum; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UTslDamageType* DamageType; // 0x88(0x08)
	struct FText InsertMessage; // 0x90(0x18)
	enum class EDamageReason DamageReason; // 0xa8(0x01)
	bool bGroggy; // 0xa9(0x01)
	char pad_AA[0x2]; // 0xaa(0x02)
	int32 AlivePlayerNum; // 0xac(0x04)
	int32 AliveTeamNum; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct FText DamageCauserName; // 0xb8(0x18)
	int32 DamageCauserLevel; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct UTexture* DamageCauserIcon; // 0xd8(0x08)
	float DamageCauserIconRatio; // 0xe0(0x04)
	bool bIsKillerExist; // 0xe4(0x01)
	bool bIsStealKilled; // 0xe5(0x01)
	bool bIsObserver; // 0xe6(0x01)
	bool bIsObserverAndKillerIsSpectated; // 0xe7(0x01)
	bool bIsObserverAndVictimIsSpectated; // 0xe8(0x01)
	bool bIsMidGameBanMessage; // 0xe9(0x01)
	char pad_EA[0x2]; // 0xea(0x02)
	float DistanceFromKillerToVictim; // 0xec(0x04)
	enum class EOutGamePlatformProvider KillerPlatform; // 0xf0(0x01)
	enum class EOutGamePlatformProvider VictimPlatform; // 0xf1(0x01)
	char pad_F2[0x16]; // 0xf2(0x16)
};

// ScriptStruct TslGame.*4ae432cb8e
// Size: 0x18 (Inherited: 0x00)
struct F*4ae432cb8e {
	struct F*5e23fc320a *7361a01dd9; // 0x00(0x08)
	struct F*5e23fc320a WeaponPackage; // 0x08(0x08)
	struct F*5e23fc320a HealingPackage; // 0x10(0x08)
};

// ScriptStruct TslGame.*5e23fc320a
// Size: 0x08 (Inherited: 0x00)
struct F*5e23fc320a {
	bool bEnable; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *e1bf8095ec; // 0x04(0x04)
};

// ScriptStruct TslGame.*ad225cd187
// Size: 0x10 (Inherited: 0x00)
struct F*ad225cd187 {
	bool Show; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D MarkerPosition; // 0x04(0x08)
	enum class EMarkerType MarkerType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*adc8b70632
// Size: 0x20 (Inherited: 0x10)
struct F*adc8b70632 : F*f54d27b55a {
	struct FVector SpawnPosition; // 0x10(0x0c)
	float *1f791771bd; // 0x1c(0x04)
};

// ScriptStruct TslGame.*f54d27b55a
// Size: 0x10 (Inherited: 0x00)
struct F*f54d27b55a {
	enum class EPlatoonSupportRequestEventType EventType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 *79bacb6740; // 0x04(0x04)
	bool *b7b2c87ad7; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float StartTime; // 0x0c(0x04)
};

// ScriptStruct TslGame.*9b9ccc5519
// Size: 0x24 (Inherited: 0x10)
struct F*9b9ccc5519 : F*f54d27b55a {
	enum class EPlatoonCarePackageType CarePackageType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 *727626d7fd; // 0x14(0x04)
	struct FVector *c47dd826b6; // 0x18(0x0c)
};

// ScriptStruct TslGame.*2bc8abf160
// Size: 0x58 (Inherited: 0x00)
struct F*2bc8abf160 {
	float *c55c12cb53; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UClass* *f23bfe8a1c; // 0x08(0x08)
	struct ATslPlayerState* *8b96d79e0f; // 0x10(0x08)
	struct FVector_NetQuantize *c5fae6626d; // 0x18(0x0c)
	struct FVector_NetQuantize *a910196918; // 0x24(0x0c)
	struct FName BoneName; // 0x30(0x08)
	float *d4703b8a54; // 0x38(0x04)
	bool *17badf2c8a; // 0x3c(0x01)
	bool *c1263db16a; // 0x3d(0x01)
	char *046c2eaa88 : 1; // 0x3e(0x01)
	char *50a4d699df : 1; // 0x3e(0x01)
	char *35a41644ef : 1; // 0x3e(0x01)
	char pad_3E_3 : 5; // 0x3e(0x01)
	bool *29526e02a9; // 0x3f(0x01)
	struct FName *a61c615344; // 0x40(0x08)
	struct FVector AttackerLocation; // 0x48(0x0c)
	char pad_54[0x4]; // 0x54(0x04)
};

// ScriptStruct TslGame.*12f55e173e
// Size: 0x30 (Inherited: 0x00)
struct F*12f55e173e {
	struct FString PartyId; // 0x00(0x10)
	bool IsPartyLeader; // 0x10(0x01)
	enum class ERequestPartyState PartyState; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	int32 *4d21036631; // 0x14(0x04)
	bool *bf4c77d895; // 0x18(0x01)
	char pad_19[0x17]; // 0x19(0x17)
};

// ScriptStruct TslGame.*a48499ea81
// Size: 0x20 (Inherited: 0x00)
struct F*a48499ea81 {
	char pad_0[0x8]; // 0x00(0x08)
	struct AActor* TargetActor; // 0x08(0x08)
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct TslGame.*4f71fcfb58
// Size: 0x20 (Inherited: 0x00)
struct F*4f71fcfb58 {
	int32 *c8dfb0e7fb; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FText *a0ed28d062; // 0x08(0x18)
};

// ScriptStruct TslGame.*9f7db6ca61
// Size: 0x28 (Inherited: 0x00)
struct F*9f7db6ca61 {
	int32 *2447c35116; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct ATslCharacter* Rider; // 0x08(0x08)
	char pad_10[0x18]; // 0x10(0x18)
};

// ScriptStruct TslGame.*f24e323a9e
// Size: 0x10 (Inherited: 0x00)
struct F*f24e323a9e {
	float *2e5ed5c35d; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)
};

// ScriptStruct TslGame.*12b601d39a
// Size: 0x10 (Inherited: 0x00)
struct F*12b601d39a {
	struct FVector2D *35bcdc11be; // 0x00(0x08)
	struct FVector2D *f6cb334ef9; // 0x08(0x08)
};

// ScriptStruct TslGame.*a1ab208fc4
// Size: 0x38 (Inherited: 0x00)
struct F*a1ab208fc4 {
	float DemoTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString Weather; // 0x08(0x10)
	enum class ETslOvercastAction Action; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float InitElapsedTime; // 0x1c(0x04)
	float SaturateTime; // 0x20(0x04)
	float BlendInTime; // 0x24(0x04)
	float BlendOutTime; // 0x28(0x04)
	float TimeMultiplier; // 0x2c(0x04)
	float ThunderAngle; // 0x30(0x04)
	float ThunderDistance; // 0x34(0x04)
};

// ScriptStruct TslGame.*1103e86975
// Size: 0x98 (Inherited: 0x00)
struct F*1103e86975 {
	bool bIsCustomGame; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString MapName; // 0x08(0x10)
	struct FString ModeName; // 0x18(0x10)
	struct FString MatchId; // 0x28(0x10)
	int32 TeamCount; // 0x38(0x04)
	int32 MinPlayerCount; // 0x3c(0x04)
	int32 MaxPlayerCount; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TMap<struct FString, struct FString> StringParameter; // 0x48(0x50)
};

// ScriptStruct TslGame.*8736dbfc20
// Size: 0x10 (Inherited: 0x00)
struct F*8736dbfc20 {
	float DemoTime; // 0x00(0x04)
	float FogFallOff; // 0x04(0x04)
	float FogStartDistance; // 0x08(0x04)
	float FogDensity; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslPlayerStateSummary
// Size: 0x40 (Inherited: 0x00)
struct FTslPlayerStateSummary {
	struct FString UniqueId; // 0x00(0x10)
	struct FString PlayerName; // 0x10(0x10)
	int32 TeamNumber; // 0x20(0x04)
	int32 Ranking; // 0x24(0x04)
	int32 HeadShots; // 0x28(0x04)
	int32 NumKills; // 0x2c(0x04)
	float TotalGivenDamages; // 0x30(0x04)
	float LongestDistanceKill; // 0x34(0x04)
	float TotalMovedDistanceMeter; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct TslGame.TslReplaySummary
// Size: 0x90 (Inherited: 0x00)
struct FTslReplaySummary {
	struct FString MatchId; // 0x00(0x10)
	bool bIsServerRecording; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString RecordUserId; // 0x18(0x10)
	struct FString RecordAccountId; // 0x28(0x10)
	struct FString RecordUserNickName; // 0x38(0x10)
	struct FString MapName; // 0x48(0x10)
	struct FString WeatherName; // 0x58(0x10)
	struct FString RegionName; // 0x68(0x10)
	int32 NumPlayers; // 0x78(0x04)
	int32 NumTeams; // 0x7c(0x04)
	struct TArray<struct FTslPlayerStateSummary> PlayerStateSummaries; // 0x80(0x10)
};

// ScriptStruct TslGame.*ebd18e3fe8
// Size: 0xe0 (Inherited: 0x00)
struct F*ebd18e3fe8 {
	int32 DataSetNumber; // 0x00(0x04)
	int32 TimeMS; // 0x04(0x04)
	bool IsSkip; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct FString Type; // 0x10(0x10)
	float FOV; // 0x20(0x04)
	float PositionX; // 0x24(0x04)
	float PositionY; // 0x28(0x04)
	float PositionZ; // 0x2c(0x04)
	float RotationX; // 0x30(0x04)
	float RotationY; // 0x34(0x04)
	float RotationZ; // 0x38(0x04)
	float Angle; // 0x3c(0x04)
	struct FString Target; // 0x40(0x10)
	struct FString InterpolationType; // 0x50(0x10)
	struct FString CameraDirection; // 0x60(0x10)
	struct FString ReplaySpeed; // 0x70(0x10)
	bool IsAutoExposureEnable; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct FString DofMethod; // 0x88(0x10)
	float DofFocalRegion; // 0x98(0x04)
	bool IsDofAutoFocus; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float DofFocalDistance; // 0xa0(0x04)
	float DofNearTransitionRegion; // 0xa4(0x04)
	float DofFarTransitionRegion; // 0xa8(0x04)
	float DofBokehScale; // 0xac(0x04)
	float DofBokehMaxSize; // 0xb0(0x04)
	float DofGaussianNearBlurSize; // 0xb4(0x04)
	float DofGaussianFarBlurSize; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct FString ColorGradingLUT; // 0xc0(0x10)
	float ColorGradingLUTIntensity; // 0xd0(0x04)
	float BloomIntensity; // 0xd4(0x04)
	float VignetteIntensity; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
};

// ScriptStruct TslGame.*bf1227c132
// Size: 0x50 (Inherited: 0x00)
struct F*bf1227c132 {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.TslOutGameLog
// Size: 0x20 (Inherited: 0x00)
struct FTslOutGameLog {
	struct FString Type; // 0x00(0x10)
	struct FString Log; // 0x10(0x10)
};

// ScriptStruct TslGame.*b22003f3e0
// Size: 0x10 (Inherited: 0x00)
struct F*b22003f3e0 {
	struct UExponentialHeightFogComponent* *95138e4092; // 0x00(0x08)
	bool *3d9ef0fd72; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct TslGame.*b6149201ec
// Size: 0x20 (Inherited: 0x00)
struct F*b6149201ec {
	enum class EQualityType QualityType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText DisplayQualityLevelName; // 0x08(0x18)
};

// ScriptStruct TslGame.TslMissionInLobby
// Size: 0x88 (Inherited: 0x00)
struct FTslMissionInLobby {
	struct FString MissionId; // 0x00(0x10)
	bool bAchieved; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString Description; // 0x18(0x10)
	int32 Priority; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FString Type; // 0x30(0x10)
	bool bLocked; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float ProgressRatio; // 0x44(0x04)
	struct FString ProgressText; // 0x48(0x10)
	struct FString MissionIconName; // 0x58(0x10)
	int32 InitialProgress; // 0x68(0x04)
	int32 CurrentProgress; // 0x6c(0x04)
	int32 MaximumProgress; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct TArray<struct FName> TargetGameModeList; // 0x78(0x10)
};

// ScriptStruct TslGame.PointInfo
// Size: 0x08 (Inherited: 0x00)
struct FPointInfo {
	int32 *cc7f0b8159; // 0x00(0x04)
	int32 *8f5bbd7a6a; // 0x04(0x04)
};

// ScriptStruct TslGame.TeamInfo
// Size: 0x50 (Inherited: 0x00)
struct FTeamInfo {
	struct FString TeamName; // 0x00(0x10)
	struct FString *a20f72d2fc; // 0x10(0x10)
	struct UTexture2D* TeamIcon; // 0x20(0x08)
	struct FLinearColor TeamColor; // 0x28(0x10)
	struct FLinearColor *893c851205; // 0x38(0x10)
	struct UTexture2D* TeamMember; // 0x48(0x08)
};

// ScriptStruct TslGame.ReplayItem
// Size: 0x100 (Inherited: 0x00)
struct FReplayItem {
	struct FString FriendlyName; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	bool bIsLive; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FDateTime Date; // 0x28(0x08)
	int32 SizeInBytes; // 0x30(0x04)
	int32 LengthInMS; // 0x34(0x04)
	int32 NumViewers; // 0x38(0x04)
	bool bIncomplete; // 0x3c(0x01)
	bool bIsVersionCompatible; // 0x3d(0x01)
	bool bIsCorrupted; // 0x3e(0x01)
	bool bIsServerRecording; // 0x3f(0x01)
	bool bShouldKeep; // 0x40(0x01)
	bool bArchived; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct FString GameVersion; // 0x48(0x10)
	int32 MK3DReplayVersion; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FString Mode; // 0x60(0x10)
	struct FString RecordUserId; // 0x70(0x10)
	struct FString RecordUserNickName; // 0x80(0x10)
	struct FString MapName; // 0x90(0x10)
	bool bAllDeadOrWin; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	int32 ArchiveSizeInBytes; // 0xa4(0x04)
	bool bIsClip; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	int32 ClipTime; // 0xac(0x04)
	int32 ClipStartTime; // 0xb0(0x04)
	int32 ClipEndTime; // 0xb4(0x04)
	struct FString ClipTargetUserId; // 0xb8(0x10)
	struct FString ClipTargetUserNickName; // 0xc8(0x10)
	struct FString ReportToken; // 0xd8(0x10)
	struct FString RecordAccountId; // 0xe8(0x10)
	bool bHaveCameraEvent; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
};

// ScriptStruct TslGame.*e41543b881
// Size: 0xb8 (Inherited: 0x00)
struct F*e41543b881 {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString KillerName; // 0x38(0x10)
	struct FString KillerNetId; // 0x48(0x10)
	struct FString VictimName; // 0x58(0x10)
	struct FString VictimNetId; // 0x68(0x10)
	struct FString DamageCauseClassName; // 0x78(0x10)
	int32 DamageTypeCategory; // 0x88(0x04)
	int32 DamageReason; // 0x8c(0x04)
	bool bGroggy; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FString KillerPlayerId; // 0x98(0x10)
	struct FString VictimPlayerId; // 0xa8(0x10)
};

// ScriptStruct TslGame.*3e7ea6e653
// Size: 0x138 (Inherited: 0x00)
struct F*3e7ea6e653 {
	float LastUpdateTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString KillerUniqueId; // 0x08(0x10)
	struct FString KillerName; // 0x18(0x10)
	struct FString KillerPlayerId; // 0x28(0x10)
	struct FString VictimUniqueId; // 0x38(0x10)
	struct FString VictimName; // 0x48(0x10)
	struct FString VictimPlayerId; // 0x58(0x10)
	char pad_68[0xd0]; // 0x68(0xd0)
};

// ScriptStruct TslGame.*55164c1e1d
// Size: 0x58 (Inherited: 0x00)
struct F*55164c1e1d {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString RecordTargetName; // 0x38(0x10)
	struct FString RecordTargetNetId; // 0x48(0x10)
};

// ScriptStruct TslGame.*f16e2659eb
// Size: 0x68 (Inherited: 0x00)
struct F*f16e2659eb {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString EtceteraEventCode; // 0x38(0x10)
	struct FString TargetNetId; // 0x48(0x10)
	struct FString TargetName; // 0x58(0x10)
};

// ScriptStruct TslGame.*690e4e04e4
// Size: 0xb8 (Inherited: 0x00)
struct F*690e4e04e4 {
	struct FString ID; // 0x00(0x10)
	struct FString Group; // 0x10(0x10)
	struct FString MetaData; // 0x20(0x10)
	int32 Time1; // 0x30(0x04)
	int32 Time2; // 0x34(0x04)
	struct FString InstigatorName; // 0x38(0x10)
	struct FString InstigatorNetId; // 0x48(0x10)
	struct FString VictimName; // 0x58(0x10)
	struct FString VictimNetId; // 0x68(0x10)
	struct FString DamageCauseClassName; // 0x78(0x10)
	int32 DamageTypeCategory; // 0x88(0x04)
	int32 DamageReason; // 0x8c(0x04)
	bool bGroggy; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FString InstigatorPlayerId; // 0x98(0x10)
	struct FString VictimPlayerId; // 0xa8(0x10)
};

// ScriptStruct TslGame.*7d7454d0b1
// Size: 0x18 (Inherited: 0x00)
struct F*7d7454d0b1 {
	int32 *27adf40b84; // 0x00(0x04)
	int32 *d82c3c8a3c; // 0x04(0x04)
	struct TArray<struct F*927539a7ae> *dd3bed0418; // 0x08(0x10)
};

// ScriptStruct TslGame.*927539a7ae
// Size: 0x18 (Inherited: 0x00)
struct F*927539a7ae {
	struct TArray<struct F*f3ac3fdb3c> *4c15c8ae6f; // 0x00(0x10)
	bool bIsLastStage; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 *f2862c9388; // 0x14(0x04)
};

// ScriptStruct TslGame.*f3ac3fdb3c
// Size: 0x60 (Inherited: 0x00)
struct F*f3ac3fdb3c {
	struct TArray<struct F*efa1194c58> *9388ea8252; // 0x00(0x10)
	struct TArray<int32> *d3ee96f650; // 0x10(0x10)
	int32 *abd96ae1b9; // 0x20(0x04)
	int32 *041622af76; // 0x24(0x04)
	enum class EArenaState *f3ac3fdb3c; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float *9e61831727; // 0x2c(0x04)
	float *14dbd1031d; // 0x30(0x04)
	float *6bb451f2df; // 0x34(0x04)
	float *8056498ac2; // 0x38(0x04)
	int32 *735029dc87; // 0x3c(0x04)
	float *761b417b2f; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FString Name; // 0x48(0x10)
	int32 *47b967452b; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct TslGame.*efa1194c58
// Size: 0x14 (Inherited: 0x00)
struct F*efa1194c58 {
	int32 TeamId; // 0x00(0x04)
	int32 Score; // 0x04(0x04)
	int32 *8dc6739aa5; // 0x08(0x04)
	float *7a5c5534aa; // 0x0c(0x04)
	bool *0ef9e76b30; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.*047e471dbd
// Size: 0x10 (Inherited: 0x00)
struct F*047e471dbd {
	struct TArray<struct F*d9ce401090> DynamicTeamsInfo; // 0x00(0x10)
};

// ScriptStruct TslGame.*d9ce401090
// Size: 0x28 (Inherited: 0x00)
struct F*d9ce401090 {
	int32 TeamId; // 0x00(0x04)
	int32 Chances; // 0x04(0x04)
	struct TArray<bool> RoundHistory; // 0x08(0x10)
	struct TArray<struct F*1f7e59b01a> DynamicPlayersInfo; // 0x18(0x10)
};

// ScriptStruct TslGame.*1f7e59b01a
// Size: 0x14 (Inherited: 0x00)
struct F*1f7e59b01a {
	int32 Kills; // 0x00(0x04)
	int32 Deaths; // 0x04(0x04)
	int32 DamageDealt; // 0x08(0x04)
	int32 money; // 0x0c(0x04)
	int32 MemberIndex; // 0x10(0x04)
};

// ScriptStruct TslGame.*2ef80828fc
// Size: 0x08 (Inherited: 0x00)
struct F*2ef80828fc {
	int32 GoalScore; // 0x00(0x04)
	bool bIsTeamElimination; // 0x04(0x01)
	bool bUseWarRoyaleBluezone; // 0x05(0x01)
	bool bUsingTeamXRay; // 0x06(0x01)
	char pad_7[0x1]; // 0x07(0x01)
};

// ScriptStruct TslGame.*ca25363ecf
// Size: 0x50 (Inherited: 0x00)
struct F*ca25363ecf {
	float TimeLimitSeconds; // 0x00(0x04)
	float LastRespawnTimeSeconds; // 0x04(0x04)
	struct TArray<int32> TeamIds; // 0x08(0x10)
	struct TArray<int32> TeamIndices; // 0x18(0x10)
	struct TArray<struct FString> TeamLeaderNames; // 0x28(0x10)
	struct TArray<struct FString> TeamLeaderClanNames; // 0x38(0x10)
	int32 TeamCount; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// ScriptStruct TslGame.*76a7200ac1
// Size: 0x30 (Inherited: 0x00)
struct F*76a7200ac1 {
	float TrainingScore; // 0x00(0x04)
	float TrainingPlayTime; // 0x04(0x04)
	bool TrainingStartCountDown; // 0x08(0x01)
	bool HeadShotCount; // 0x09(0x01)
	bool KillCount; // 0x0a(0x01)
	bool AimAccuracy; // 0x0b(0x01)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString WeaponName; // 0x10(0x10)
	float *36debdbb36; // 0x20(0x04)
	bool *e77ab0547b; // 0x24(0x01)
	bool *7e5133a1fb; // 0x25(0x01)
	bool *38ae073233; // 0x26(0x01)
	bool *6e34709ac9; // 0x27(0x01)
	bool *1c5051d17a; // 0x28(0x01)
	bool *6a6656b70c; // 0x29(0x01)
	bool *d615479f5a; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
};

// ScriptStruct TslGame.TslReportUserInfo
// Size: 0x70 (Inherited: 0x00)
struct FTslReportUserInfo {
	struct FString PlayerName; // 0x00(0x10)
	struct FString ClanId; // 0x10(0x10)
	struct FString ClanTag; // 0x20(0x10)
	int32 ClanLevel; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString StreamerFakeName; // 0x38(0x10)
	struct FString NetId; // 0x48(0x10)
	struct FString AccountId; // 0x58(0x10)
	int32 TeamId; // 0x68(0x04)
	enum class ESubjectToReport SubjectToReport; // 0x6c(0x01)
	enum class EOutGamePlatformProvider PlayerPlatform; // 0x6d(0x01)
	enum class ETslAIPlayerType AIType; // 0x6e(0x01)
	char pad_6F[0x1]; // 0x6f(0x01)
};

// ScriptStruct TslGame.TslInputKey
// Size: 0x20 (Inherited: 0x00)
struct FTslInputKey {
	struct FKey Key; // 0x00(0x18)
	char bShift : 1; // 0x18(0x01)
	char bCtrl : 1; // 0x18(0x01)
	char bAlt : 1; // 0x18(0x01)
	char pad_18_3 : 5; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct TslGame.*df332186d2
// Size: 0x08 (Inherited: 0x00)
struct F*df332186d2 {
	struct ATslPlayerState* PlayerState; // 0x00(0x08)
};

// ScriptStruct TslGame.*ed3419bf49
// Size: 0x18 (Inherited: 0x00)
struct F*ed3419bf49 {
	struct ATslCharacter* *02ba72abda; // 0x00(0x08)
	float *6f39e14420; // 0x08(0x04)
	float *591b101e0a; // 0x0c(0x04)
	float *a32f9e6654; // 0x10(0x04)
	bool bIsGroggy; // 0x14(0x01)
	bool *2d1d10babc; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
};

// ScriptStruct TslGame.*7e7e97b5c1
// Size: 0x20 (Inherited: 0x00)
struct F*7e7e97b5c1 {
	struct FText *9315327d9f; // 0x00(0x18)
	char pad_18[0x8]; // 0x18(0x08)
};

// ScriptStruct TslGame.*2c3de5c408
// Size: 0x50 (Inherited: 0x00)
struct F*2c3de5c408 {
	struct TMap<enum class EFiremode, struct UTexture2D*> TextureData; // 0x00(0x50)
};

// ScriptStruct TslGame.*26bc02150b
// Size: 0x50 (Inherited: 0x00)
struct F*26bc02150b {
	struct TMap<enum class ETraumaBagHealMode, struct UTexture2D*> TextureData; // 0x00(0x50)
};

// ScriptStruct TslGame.*4f2a86e400
// Size: 0x18 (Inherited: 0x00)
struct F*4f2a86e400 {
	struct FName ItemID; // 0x00(0x08)
	int32 *9775ae7e4f; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct U*84a85f0ae3* *cac23466d2; // 0x10(0x08)
};

// ScriptStruct TslGame.*d18c0833ab
// Size: 0x50 (Inherited: 0x00)
struct F*d18c0833ab {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.*de373e9aba
// Size: 0x10 (Inherited: 0x00)
struct F*de373e9aba {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct TslGame.*44b330afde
// Size: 0x18 (Inherited: 0x00)
struct F*44b330afde {
	int32 Index; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct U*d528f2c6cf*> Cache; // 0x08(0x10)
};

// ScriptStruct TslGame.*b54b11c920
// Size: 0x18 (Inherited: 0x00)
struct F*b54b11c920 {
	enum class ECastableItemType *466d4d9ab0; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName ItemID; // 0x08(0x08)
	struct UTexture2D* *c390f0189b; // 0x10(0x08)
};

// ScriptStruct TslGame.*2bee84db49
// Size: 0x10 (Inherited: 0x00)
struct F*2bee84db49 {
	struct TArray<struct F*d0568404a4> *909672fc53; // 0x00(0x10)
};

// ScriptStruct TslGame.*d0568404a4
// Size: 0x20 (Inherited: 0x00)
struct F*d0568404a4 {
	struct FName ActionName; // 0x00(0x08)
	struct FText Description; // 0x08(0x18)
};

// ScriptStruct TslGame.*9333421ac1
// Size: 0x38 (Inherited: 0x00)
struct F*9333421ac1 {
	enum class ESystemMessageType MessageType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Duration; // 0x04(0x04)
	float *e008e01e6b; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FText Message; // 0x10(0x18)
	int32 *88eb1b7175; // 0x28(0x04)
	int32 *bc492662e4; // 0x2c(0x04)
	bool *b5ea26f68d; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*2edf616f74
// Size: 0x38 (Inherited: 0x08)
struct F*2edf616f74 : FTableRowBase {
	struct FText Message; // 0x08(0x18)
	enum class ETslNotificationMessageColorType *0ca85b6174; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct UTexture2D* *2768f1e6de; // 0x28(0x08)
	enum class ETslNotificationMessageAnimationType *f71edb1445; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*8d6d797852
// Size: 0x08 (Inherited: 0x00)
struct F*8d6d797852 {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*ed2aaf203a
// Size: 0x08 (Inherited: 0x00)
struct F*ed2aaf203a {
	float Score; // 0x00(0x04)
	int32 *cbbe4496ad; // 0x04(0x04)
};

// ScriptStruct TslGame.*32d748f2bd
// Size: 0x08 (Inherited: 0x00)
struct F*32d748f2bd {
	int32 TeamNum; // 0x00(0x04)
	int32 TeamRanking; // 0x04(0x04)
};

// ScriptStruct TslGame.*06ae18bb44
// Size: 0x28 (Inherited: 0x00)
struct F*06ae18bb44 {
	struct FVector *d42dcf9a5d; // 0x00(0x0c)
	float *d15661b9ea; // 0x0c(0x04)
	float *1296aa7894; // 0x10(0x04)
	struct FVector *fe40c3e568; // 0x14(0x0c)
	float *a3c567c574; // 0x20(0x04)
	float *15f1620484; // 0x24(0x04)
};

// ScriptStruct TslGame.*fe626a3bcc
// Size: 0x48 (Inherited: 0x00)
struct F*fe626a3bcc {
	struct UClass* Widget; // 0x00(0x20)
	struct UTexture2D* Texture; // 0x20(0x20)
	struct FVector2D Size; // 0x40(0x08)
};

// ScriptStruct TslGame.*65c31adf7d
// Size: 0x10 (Inherited: 0x00)
struct F*65c31adf7d {
	struct TArray<struct UUserWidget*> Widgets; // 0x00(0x10)
};

// ScriptStruct TslGame.*8aa2a61bd0
// Size: 0x60 (Inherited: 0x00)
struct F*8aa2a61bd0 {
	char pad_0[0x60]; // 0x00(0x60)
};

// ScriptStruct TslGame.*e00483e6d6
// Size: 0x60 (Inherited: 0x00)
struct F*e00483e6d6 {
	struct UTexture2D* IconBackground; // 0x00(0x20)
	struct UTexture2D* MemberIndexBackground; // 0x20(0x20)
	struct UTexture2D* FullWidgetBackground; // 0x40(0x20)
};

// ScriptStruct TslGame.PlayerInfo
// Size: 0x50 (Inherited: 0x00)
struct FPlayerInfo {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct TslGame.*65017b093c
// Size: 0x10 (Inherited: 0x00)
struct F*65017b093c {
	struct UTexture2D* Left; // 0x00(0x08)
	struct UTexture2D* Right; // 0x08(0x08)
};

// ScriptStruct TslGame.*bd73580d0b
// Size: 0x10 (Inherited: 0x00)
struct F*bd73580d0b {
	struct TArray<struct U*10099c704f*> Items; // 0x00(0x10)
};

// ScriptStruct TslGame.*f20ed664e0
// Size: 0x14 (Inherited: 0x00)
struct F*f20ed664e0 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*d5f0c085dd
// Size: 0x10 (Inherited: 0x00)
struct F*d5f0c085dd {
	struct TArray<struct ATslAIWaypointSegment*> *72c10bc4d6; // 0x00(0x10)
};

// ScriptStruct TslGame.*5737274745
// Size: 0xa0 (Inherited: 0x00)
struct F*5737274745 {
	struct TMap<struct F*3a4fc3c196, bool> *e35aa69471; // 0x00(0x50)
	struct TMap<struct F*3a4fc3c196, struct F*9413f02812> *84b8515766; // 0x50(0x50)
};

// ScriptStruct TslGame.*3a4fc3c196
// Size: 0x10 (Inherited: 0x00)
struct F*3a4fc3c196 {
	struct ATslAIWaypointSegment* path; // 0x00(0x08)
	float InputKey; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*9413f02812
// Size: 0x08 (Inherited: 0x00)
struct F*9413f02812 {
	float *8b2b3eee9b; // 0x00(0x04)
	float *f47266cf8e; // 0x04(0x04)
};

// ScriptStruct TslGame.*67df3e6efa
// Size: 0x48 (Inherited: 0x00)
struct F*67df3e6efa {
	int32 SpawnCount; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FName VehicleTag; // 0x08(0x08)
	struct FName SpawnTag; // 0x10(0x08)
	bool *ac71c902b5; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	struct FVector SpawnLocation; // 0x1c(0x0c)
	struct FRotator *c9bf8272bb; // 0x28(0x0c)
	char pad_34[0x4]; // 0x34(0x04)
	struct F*19e3498e5d *23d02448f0; // 0x38(0x10)
};

// ScriptStruct TslGame.*19e3498e5d
// Size: 0x10 (Inherited: 0x00)
struct F*19e3498e5d {
	struct ATslAIWaypointSegment* *ef181d98b2; // 0x00(0x08)
	float *451de35fc9; // 0x08(0x04)
	bool *a3e9e5fd2d; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*bbdacef020
// Size: 0x28 (Inherited: 0x00)
struct F*bbdacef020 {
	struct APawn* *bd98770c8e; // 0x00(0x08)
	struct UBehaviorTree* BehaviorTree; // 0x08(0x08)
	struct UBlackboardData* BlackboardData; // 0x10(0x08)
	struct F*19e3498e5d *23d02448f0; // 0x18(0x10)
};

// ScriptStruct TslGame.VehicleSpawn
// Size: 0xc0 (Inherited: 0x08)
struct FVehicleSpawn : FTableRowBase {
	struct FGuid ID; // 0x08(0x10)
	enum class ESpawnType SpawnType; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct FName VehicleTag; // 0x20(0x08)
	struct UClass* VehicleClass; // 0x28(0x20)
	struct UBehaviorTree* BehaviorTreeAsset; // 0x48(0x20)
	struct UBlackboardData* BlackboardDataAsset; // 0x68(0x20)
	float InitialSpawnDelay; // 0x88(0x04)
	float SubsequentSpawnDelay; // 0x8c(0x04)
	int32 MaxTriggers; // 0x90(0x04)
	bool MinToSpawn; // 0x94(0x01)
	bool MaxToSpawn; // 0x95(0x01)
	char pad_96[0x2]; // 0x96(0x02)
	struct F*2b36dc4c2b SpawnFilter; // 0x98(0x28)
};

// ScriptStruct TslGame.*2b36dc4c2b
// Size: 0x28 (Inherited: 0x00)
struct F*2b36dc4c2b {
	bool bLimitSpawnPoints; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FName> ValidSpawnPoints; // 0x08(0x10)
	struct TArray<struct FName> InvalidSpawnPoints; // 0x18(0x10)
};

// ScriptStruct TslGame.*f51314da5a
// Size: 0x20 (Inherited: 0x00)
struct F*f51314da5a {
	char pad_0[0x20]; // 0x00(0x20)
};

// ScriptStruct TslGame.*69ddfbccda
// Size: 0x60 (Inherited: 0x00)
struct F*69ddfbccda {
	struct FGuid ID; // 0x00(0x10)
	struct FString *694a774ef8; // 0x10(0x10)
	struct UClass* VehicleClass; // 0x20(0x08)
	struct UBehaviorTree* BehaviorTree; // 0x28(0x08)
	struct UBlackboardData* BlackboardData; // 0x30(0x08)
	struct F*2b36dc4c2b SpawnSettings; // 0x38(0x28)
};

// ScriptStruct TslGame.*c161809596
// Size: 0x40 (Inherited: 0x00)
struct F*c161809596 {
	float *8ddb56b817; // 0x00(0x04)
	float *53afbadd1e; // 0x04(0x04)
	float *e35a8a6242; // 0x08(0x04)
	float Damage; // 0x0c(0x04)
	float *d8e4bbe504; // 0x10(0x04)
	float *a5cf76ceec; // 0x14(0x04)
	struct FName *04dfe4e2df; // 0x18(0x08)
	struct FVector *575753c9f5; // 0x20(0x0c)
	struct FVector *ebd74d5a2a; // 0x2c(0x0c)
	struct UClass* *f23bfe8a1c; // 0x38(0x08)
};

// ScriptStruct TslGame.*4c7d32fd0d
// Size: 0x30 (Inherited: 0x00)
struct F*4c7d32fd0d {
	struct F*b3ca2eb017 *95cdd05ad9; // 0x00(0x18)
	struct F*b3ca2eb017 *cb23c0d3c4; // 0x18(0x18)
};

// ScriptStruct TslGame.*b3ca2eb017
// Size: 0x18 (Inherited: 0x00)
struct F*b3ca2eb017 {
	float *86d1b3113b; // 0x00(0x04)
	float *5e6aea0f35; // 0x04(0x04)
	struct UAkAudioEvent* AkEvent; // 0x08(0x08)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct TslGame.*f203135574
// Size: 0x18 (Inherited: 0x00)
struct F*f203135574 {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*bd13d4062a
// Size: 0x58 (Inherited: 0x00)
struct F*bd13d4062a {
	enum class EVehiclePartType *11ce994c43; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TMap<int32, struct UMaterialInterface*> *5bad64c664; // 0x08(0x50)
};

// ScriptStruct TslGame.*7c1653f90b
// Size: 0x98 (Inherited: 0x00)
struct F*7c1653f90b {
	bool *90964b44b6; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *fd728bf585; // 0x04(0x04)
	struct FName *7d4ddc63b0; // 0x08(0x08)
	struct FVector2D *9be5203234; // 0x10(0x08)
	struct FVector2D *3e0502340c; // 0x18(0x08)
	struct FVector *36fffc5c22; // 0x20(0x0c)
	struct FVector2D *c9740604a6; // 0x2c(0x08)
	struct FVector2D *20b08966a7; // 0x34(0x08)
	float *5f8dc14e2e; // 0x3c(0x04)
	float *a9651d6763; // 0x40(0x04)
	float *4c30b906e0; // 0x44(0x04)
	struct FVector *7bbec081b9; // 0x48(0x0c)
	struct FVector *c805630568; // 0x54(0x0c)
	struct FVector2D *34c23f4edb; // 0x60(0x08)
	float *f305a0da9c; // 0x68(0x04)
	bool *3ec553f143; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	float *6464924c2d; // 0x70(0x04)
	bool *186a57fb15; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FVector2D *82a21a555c; // 0x78(0x08)
	struct U*226eb62c2c* *5955bd0aa9; // 0x80(0x08)
	bool *ba29c72e1e; // 0x88(0x01)
	char pad_89[0xf]; // 0x89(0x0f)
};

// ScriptStruct TslGame.*caf7fe5826
// Size: 0x68 (Inherited: 0x00)
struct F*caf7fe5826 {
	struct FName *8544f8eb37; // 0x00(0x08)
	float *b26e73e532; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FName *ce6882612d; // 0x10(0x08)
	float *1a8d0fa0dd; // 0x18(0x04)
	float *3d06ea16d3; // 0x1c(0x04)
	struct UCurveFloat* CurveEngineOn; // 0x20(0x08)
	struct UCurveFloat* CurveEngineOff; // 0x28(0x08)
	float EngineSwitchMaxTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FName HeadLightIntensityParamName; // 0x38(0x08)
	float HeadLightIntensity_Mat; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FName TailLightIntensityParamName; // 0x48(0x08)
	float TailLightIntensity_Mat; // 0x50(0x04)
	bool bTickIndicatorSpeedText; // 0x54(0x01)
	bool bTickIndicatorGearText; // 0x55(0x01)
	bool bTickIndicatorHealth; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct FName TextRenderIntensityParameterName; // 0x58(0x08)
	struct FName HealthStateParameterName; // 0x60(0x08)
};

// ScriptStruct TslGame.*ed34cebb44
// Size: 0x130 (Inherited: 0x00)
struct F*ed34cebb44 {
	bool *f8a7cc87dd; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *09bc1391cd; // 0x04(0x04)
	float *70e26779f5; // 0x08(0x04)
	float *46858b2999; // 0x0c(0x04)
	float *04f62dca57; // 0x10(0x04)
	struct FFloatRange *75790b9622; // 0x14(0x10)
	float *d8939878a7; // 0x24(0x04)
	float *1bd922b1e1; // 0x28(0x04)
	float *d5402383ea; // 0x2c(0x04)
	float *2b451e99a1; // 0x30(0x04)
	int32 *c0d92dc6cf; // 0x34(0x04)
	char pad_38[0x8]; // 0x38(0x08)
	struct TMap<enum class EPhysicalSurface, struct F*edfd17b241> *2f700ceec2; // 0x40(0x50)
	struct TMap<enum class EPhysicalSurface, struct F*edfd17b241> *0f4594443d; // 0x90(0x50)
	struct TMap<enum class EPhysicalSurface, struct F*88a612a0cc> *8b9a9bf60b; // 0xe0(0x50)
};

// ScriptStruct TslGame.*88a612a0cc
// Size: 0x28 (Inherited: 0x00)
struct F*88a612a0cc {
	char pad_0[0x18]; // 0x00(0x18)
	struct UAkComponent* *899b6ab549; // 0x18(0x08)
	struct UParticleSystemComponent* ParticleComp; // 0x20(0x08)
};

// ScriptStruct TslGame.*edfd17b241
// Size: 0x10 (Inherited: 0x00)
struct F*edfd17b241 {
	struct UParticleSystem* ParticleSystem; // 0x00(0x08)
	struct UAkAudioEvent* AkEvent; // 0x08(0x08)
};

// ScriptStruct TslGame.*d26781d533
// Size: 0x28 (Inherited: 0x00)
struct F*d26781d533 {
	char pad_0[0x18]; // 0x00(0x18)
	struct USceneComponent* *02788983e3; // 0x18(0x08)
	struct USceneComponent* *be2c4c8459; // 0x20(0x08)
};

// ScriptStruct TslGame.*2548f355d6
// Size: 0x28 (Inherited: 0x00)
struct F*2548f355d6 {
	int32 *25dd18cb38; // 0x00(0x04)
	float *d9d33f091c; // 0x04(0x04)
	float *8115cbe10d; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UCurveFloat* *3d532886ce; // 0x10(0x08)
	struct UCurveFloat* *5694b9f862; // 0x18(0x08)
	struct UClass* *f23bfe8a1c; // 0x20(0x08)
};

// ScriptStruct TslGame.*ec8e22c2a9
// Size: 0x10 (Inherited: 0x00)
struct F*ec8e22c2a9 {
	struct FName *f9817b0373; // 0x00(0x08)
	struct FName *fd7d4ea8bb; // 0x08(0x08)
};

// ScriptStruct TslGame.*26fbe3855e
// Size: 0x70 (Inherited: 0x00)
struct F*26fbe3855e {
	struct FTransform PlantingTransform; // 0x00(0x30)
	struct FTransform EffectTransform; // 0x30(0x30)
	struct FLinearColor EffectColor; // 0x60(0x10)
};

// ScriptStruct TslGame.TslWeaponDisplayDataRow
// Size: 0x10 (Inherited: 0x08)
struct FTslWeaponDisplayDataRow : FTableRowBase {
	float DefaultScale; // 0x08(0x04)
	float ZoomScale; // 0x0c(0x04)
};

// ScriptStruct TslGame.*1c6f2fa2ab
// Size: 0x20 (Inherited: 0x00)
struct F*1c6f2fa2ab {
	struct FString ItemID; // 0x00(0x10)
	struct FString SkinId; // 0x10(0x10)
};

// ScriptStruct TslGame.*24df8ee7bb
// Size: 0x30 (Inherited: 0x00)
struct F*24df8ee7bb {
	struct APostProcessVolume* PostProcessVolume; // 0x00(0x08)
	struct F*cc3a03e87e LocalWeatherSetting; // 0x08(0x28)
};

// ScriptStruct TslGame.*cc3a03e87e
// Size: 0x28 (Inherited: 0x00)
struct F*cc3a03e87e {
	float FogDensity; // 0x00(0x04)
	struct FLinearColor FogColor; // 0x04(0x10)
	float FogStartDistance; // 0x14(0x04)
	float VolFogExtinctionScale; // 0x18(0x04)
	float WeatherParticleSpawnScale; // 0x1c(0x04)
	char bUseWetEffectWithSpawnScale : 1; // 0x20(0x01)
	char pad_20_1 : 7; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float SoundScale; // 0x24(0x04)
};

// ScriptStruct TslGame.*4ae4809a18
// Size: 0x10 (Inherited: 0x00)
struct F*4ae4809a18 {
	float DirectionalLightIntensity; // 0x00(0x04)
	float DirectionalLightTemperature; // 0x04(0x04)
	float DirectionalLightVolumetricScattering; // 0x08(0x04)
	float SkyLightIntensity; // 0x0c(0x04)
};

// ScriptStruct TslGame.*93c43ffb12
// Size: 0x68 (Inherited: 0x00)
struct F*93c43ffb12 {
	struct FString WeatherName; // 0x00(0x10)
	struct ATslDynamicWeather* DynamicWeather; // 0x10(0x08)
	float Weight; // 0x18(0x04)
	float DirectionalLightIntensity; // 0x1c(0x04)
	float DirectionalLightTemperature; // 0x20(0x04)
	float DirectionalLightVolumetricScattering; // 0x24(0x04)
	float SkyLightIntensity; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UTextureCube* SkyLightCubemap; // 0x30(0x08)
	float SkyLightCubemapAngle; // 0x38(0x04)
	float SkyLightCubemapResolution; // 0x3c(0x04)
	char bUseBlendSkyBox : 1; // 0x40(0x01)
	char bRefreshLightSetting : 1; // 0x40(0x01)
	char bOverrideDurationTime : 1; // 0x40(0x01)
	char pad_40_3 : 5; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float OverrideDurationTimeMin; // 0x44(0x04)
	float OverrideDurationTimeMax; // 0x48(0x04)
	char bUseDistanceDepthBlur : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	float DepthBlurIntensity; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct UCurveFloat* DepthBlurCurveAsset; // 0x58(0x08)
	char bClearFootprints : 1; // 0x60(0x01)
	char pad_60_1 : 7; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
};

// ScriptStruct TslGame.*7873d585b7
// Size: 0x1c (Inherited: 0x00)
struct F*7873d585b7 {
	bool *347c814389; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *dc97520232; // 0x04(0x04)
	float *2f4276a50a; // 0x08(0x04)
	float *5681fa28a0; // 0x0c(0x04)
	float *05da93a23f; // 0x10(0x04)
	float *da2960c97c; // 0x14(0x04)
	bool *0d6b518c1a; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
};

// ScriptStruct TslGame.*11e2f3bd7b
// Size: 0x30 (Inherited: 0x00)
struct F*11e2f3bd7b {
	struct UAkAudioEvent* *919b248ad2; // 0x00(0x08)
	struct UAkAudioEvent* *627faa1164; // 0x08(0x08)
	float *3251bf3218; // 0x10(0x04)
	float *97371ef122; // 0x14(0x04)
	struct FString *21b338c7b8; // 0x18(0x10)
	float *dcae61dec0; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*021255a0fc
// Size: 0x30 (Inherited: 0x00)
struct F*021255a0fc {
	float *4b788dd144; // 0x00(0x04)
	struct FVector2D *6275f8dc48; // 0x04(0x08)
	struct FVector2D *529db2ccee; // 0x0c(0x08)
	float *081759173f; // 0x14(0x04)
	float *dedceb9bd7; // 0x18(0x04)
	float *7fca5de4e6; // 0x1c(0x04)
	struct FVector2D *6a1b864ffb; // 0x20(0x08)
	struct FVector2D *5bf91d51fe; // 0x28(0x08)
};

// ScriptStruct TslGame.*f0f00e05c7
// Size: 0x10 (Inherited: 0x00)
struct F*f0f00e05c7 {
	bool *380d66ba2d; // 0x00(0x01)
	char pad_1[0xf]; // 0x01(0x0f)
};

// ScriptStruct TslGame.*96e52da178
// Size: 0x58 (Inherited: 0x00)
struct F*96e52da178 {
	float *878d350cff; // 0x00(0x04)
	float *46e6d4b2df; // 0x04(0x04)
	struct FVector2D *c5a5b748e5; // 0x08(0x08)
	struct FVector2D *b9a9a13fcf; // 0x10(0x08)
	struct FVector2D *3211c7ecc3; // 0x18(0x08)
	struct FVector2D *a20b96e0ff; // 0x20(0x08)
	struct FVector2D *300885b34f; // 0x28(0x08)
	struct FVector2D *62c9b95375; // 0x30(0x08)
	struct FVector2D *08b379f1b8; // 0x38(0x08)
	float *bb845813dd; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct UAnimMontage* *5b80653703; // 0x48(0x08)
	float *4935a2d0f4; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
};

// ScriptStruct TslGame.*31ae37af6e
// Size: 0x14 (Inherited: 0x00)
struct F*31ae37af6e {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*094b253087
// Size: 0x40 (Inherited: 0x00)
struct F*094b253087 {
	float *d3af652b5d; // 0x00(0x04)
	float *ce9404e6c4; // 0x04(0x04)
	float *31d6846705; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UCurveFloat* *4b9b78b510; // 0x10(0x08)
	float *de5256e0c3; // 0x18(0x04)
	float *cdf267c0bd; // 0x1c(0x04)
	float *b304828d28; // 0x20(0x04)
	float *f47516cfb0; // 0x24(0x04)
	struct FVector2D *ebef2152b5; // 0x28(0x08)
	struct FVector2D *ab5d0873ef; // 0x30(0x08)
	float *8e6dcc9855; // 0x38(0x04)
	float *c14c81af06; // 0x3c(0x04)
};

// ScriptStruct TslGame.*42f508378f
// Size: 0x14 (Inherited: 0x14)
struct F*42f508378f : F*d0fda4b5b6 {
};

// ScriptStruct TslGame.*d0fda4b5b6
// Size: 0x14 (Inherited: 0x00)
struct F*d0fda4b5b6 {
	char pad_0[0x14]; // 0x00(0x14)
};

// ScriptStruct TslGame.*59f93cc7d9
// Size: 0x14 (Inherited: 0x14)
struct F*59f93cc7d9 : F*d0fda4b5b6 {
};

// ScriptStruct TslGame.*c5f693461c
// Size: 0x1c (Inherited: 0x14)
struct F*c5f693461c : F*d0fda4b5b6 {
	char pad_14[0x8]; // 0x14(0x08)
};

// ScriptStruct TslGame.*066ab9085f
// Size: 0x10 (Inherited: 0x00)
struct F*066ab9085f {
	struct UAnimSequence* TransitionSequence; // 0x00(0x08)
	float PlayRate; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*d1560293a7
// Size: 0x30 (Inherited: 0x00)
struct F*d1560293a7 {
	struct USkeletalMesh* *0168052800; // 0x00(0x20)
	struct TArray<struct UMaterialInterface*> *29f5a4d1d5; // 0x20(0x10)
};

// ScriptStruct TslGame.*8fc4ae6ea5
// Size: 0x18 (Inherited: 0x00)
struct F*8fc4ae6ea5 {
	struct USkeletalMesh* *e32c1d4761; // 0x00(0x08)
	struct TArray<struct UMaterialInterface*> *fd88f37089; // 0x08(0x10)
};

// ScriptStruct TslGame.*1b583cae79
// Size: 0x38 (Inherited: 0x00)
struct F*1b583cae79 {
	struct TArray<struct F*b222c70dcd> StartParticleList; // 0x00(0x10)
	struct TArray<struct F*b222c70dcd> FinishParticleList; // 0x10(0x10)
	struct F*d1f8d18748 OverrideMaterial; // 0x20(0x18)
};

// ScriptStruct TslGame.*d1f8d18748
// Size: 0x18 (Inherited: 0x00)
struct F*d1f8d18748 {
	enum class *ebe673c122 SkinApplicationType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct F*3fcbffb0f2> SkinMaterials; // 0x08(0x10)
};

// ScriptStruct TslGame.*3fcbffb0f2
// Size: 0x30 (Inherited: 0x00)
struct F*3fcbffb0f2 {
	struct FName MaterialSlotName; // 0x00(0x08)
	int32 MaterialSlotIndex; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UMaterialInstance* MaterialInstance; // 0x10(0x20)
};

// ScriptStruct TslGame.*b222c70dcd
// Size: 0x20 (Inherited: 0x00)
struct F*b222c70dcd {
	struct TArray<struct FName> AttachSocketCandidates; // 0x00(0x10)
	struct FStringClassReference ParticleClass; // 0x10(0x10)
};

// ScriptStruct TslGame.*95404deeb7
// Size: 0x18 (Inherited: 0x08)
struct F*95404deeb7 : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	int32 Weight; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*6fd5c5f728
// Size: 0x50 (Inherited: 0x00)
struct F*6fd5c5f728 {
	struct TMap<enum class EPhysicalSurface, float> *2ce2eaa7d1; // 0x00(0x50)
};

// ScriptStruct TslGame.*1c406892c5
// Size: 0x08 (Inherited: 0x00)
struct F*1c406892c5 {
	float *4fcf243c76; // 0x00(0x04)
	float *d24be023d9; // 0x04(0x04)
};

// ScriptStruct TslGame.*6ebab05e02
// Size: 0x28 (Inherited: 0x00)
struct F*6ebab05e02 {
	bool AtlasIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct UClass*> WheelTypes; // 0x08(0x10)
	struct TArray<struct UClass*> ExemptedWheelTypes; // 0x18(0x10)
};

// ScriptStruct TslGame.*64b8596e55
// Size: 0x60 (Inherited: 0x00)
struct F*64b8596e55 {
	struct UStaticMesh* StaticMesh; // 0x00(0x20)
	struct UDestructibleMesh* DestructibleMesh; // 0x20(0x20)
	struct UAkAudioEvent* *3a10e0be7a; // 0x40(0x08)
	struct UPhysicalMaterial* PhysicalMaterial; // 0x48(0x08)
	float *7c222a7a0b; // 0x50(0x04)
	enum class *f1e85ae637 IndoorOutdoorMask; // 0x54(0x01)
	char LightingChannel1 : 1; // 0x55(0x01)
	char pad_55_1 : 7; // 0x55(0x01)
	enum class ECollisionEnabled CollisionEnabled; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct FName CollisionProfileName; // 0x58(0x08)
};

// ScriptStruct TslGame.*988298836b
// Size: 0x48 (Inherited: 0x08)
struct F*988298836b : FTableRowBase {
	struct UTexture* Icon; // 0x08(0x20)
	struct F*2ebc54c01b AbilityAttribute; // 0x28(0x0c)
	char pad_34[0x4]; // 0x34(0x04)
	struct FName AbilityID; // 0x38(0x08)
	struct UClass* AbilityClass; // 0x40(0x08)
};

// ScriptStruct TslGame.*2ebc54c01b
// Size: 0x0c (Inherited: 0x00)
struct F*2ebc54c01b {
	float Distance; // 0x00(0x04)
	float Angle; // 0x04(0x04)
	char UsingDir : 1; // 0x08(0x01)
	char pad_8_1 : 7; // 0x08(0x01)
	bool bStopMove; // 0x09(0x01)
	bool bTrace; // 0x0a(0x01)
	char pad_B[0x1]; // 0x0b(0x01)
};

// ScriptStruct TslGame.AnimNode_LocomotionBSPlayer
// Size: 0x140 (Inherited: 0x58)
struct FAnimNode_LocomotionBSPlayer : FAnimNode_AssetPlayerBase {
	float NodeSpeed; // 0x58(0x04)
	float Dir; // 0x5c(0x04)
	enum class EAnimStance AnimStance; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct U*abedad4c9f* AnimDB; // 0x68(0x08)
	bool bIsSprinting; // 0x70(0x01)
	bool bIsRelaxed; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	float PlayRate; // 0x74(0x04)
	bool bLoop; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	float StartPosition; // 0x7c(0x04)
	struct UBlendSpaceBase* BlendSpace; // 0x80(0x08)
	bool bResetPlayTimeWhenBlendSpaceChanges; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct FBlendFilter BlendFilter; // 0x90(0x90)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x120(0x10)
	struct UBlendSpaceBase* PreviousBlendSpace; // 0x130(0x08)
	float Speed; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
};

// ScriptStruct TslGame.TslAnimNode_AimOffsets
// Size: 0xb0 (Inherited: 0x58)
struct FTslAnimNode_AimOffsets : FAnimNode_AssetPlayerBase {
	struct U*4ea5d6c53e* AnimDBMap; // 0x58(0x08)
	struct U*4ea5d6c53e* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslAimOffsetsNodeBlendSpaceData> BlendSpacesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	float X; // 0x90(0x04)
	float Y; // 0x94(0x04)
	float NormalizedTime; // 0x98(0x04)
	char pad_9C[0x8]; // 0x9c(0x08)
	enum class EAnimStance Stance; // 0xa4(0x01)
	bool bRelaxed; // 0xa5(0x01)
	enum class EWeaponClass WeaponClass; // 0xa6(0x01)
	enum class EAnimWeaponSpecificClass AnimWeaponSpecificClass; // 0xa7(0x01)
	enum class EAlphaBlendOption BlendType; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// ScriptStruct TslGame.TslAimOffsetsNodeBlendSpaceData
// Size: 0xc8 (Inherited: 0x00)
struct FTslAimOffsetsNodeBlendSpaceData {
	struct UBlendSpace* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb0]; // 0x18(0xb0)
};

// ScriptStruct TslGame.TslAnimNode_BlendPerBoneBase
// Size: 0x128 (Inherited: 0x30)
struct FTslAnimNode_BlendPerBoneBase : FAnimNode_Base {
	char pad_30[0x4]; // 0x30(0x04)
	enum class EAnimAlphaInputType AlphaInputType; // 0x34(0x01)
	bool bAlphaBoolEnabled; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	float Alpha; // 0x38(0x04)
	struct FInputScaleBias AlphaScaleBias; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
	struct FInputAlphaBoolBlend AlphaBoolBlend; // 0x48(0x50)
	struct FName AlphaCurveName; // 0x98(0x08)
	struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0xa0(0x30)
	int32 LODThreshold; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct TArray<float> PerBoneBlendWeights; // 0xd8(0x10)
	struct FGuid SkeletonGuid; // 0xe8(0x10)
	struct FGuid VirtualBoneGuid; // 0xf8(0x10)
	char pad_108[0x20]; // 0x108(0x20)
};

// ScriptStruct TslGame.BlendBoneSettings
// Size: 0x20 (Inherited: 0x00)
struct FBlendBoneSettings {
	struct FBoneReference Bone; // 0x00(0x18)
	float Weight; // 0x18(0x04)
	bool bPropagateToChildren; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditivePerBone
// Size: 0x168 (Inherited: 0x158)
struct FTslAnimNode_ApplyAdditivePerBone : FTslAnimNode_ApplyAdditivePerBoneBase {
	struct TArray<struct FBlendBoneSettings> OverrideBones; // 0x158(0x10)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditivePerBoneBase
// Size: 0x158 (Inherited: 0x128)
struct FTslAnimNode_ApplyAdditivePerBoneBase : FTslAnimNode_BlendPerBoneBase {
	struct FPoseLink Base; // 0x128(0x18)
	struct FPoseLink Additive; // 0x140(0x18)
};

// ScriptStruct TslGame.TslAnimNode_ApplyAdditiveExcludeBones
// Size: 0x168 (Inherited: 0x158)
struct FTslAnimNode_ApplyAdditiveExcludeBones : FTslAnimNode_ApplyAdditivePerBoneBase {
	struct TArray<struct FExcludeBoneSettings> ExcludeBones; // 0x158(0x10)
};

// ScriptStruct TslGame.ExcludeBoneSettings
// Size: 0x20 (Inherited: 0x00)
struct FExcludeBoneSettings {
	struct FBoneReference Bone; // 0x00(0x18)
	bool bPropagateToChildren; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct TslGame.TslAnimNode_BlendListBlendSpace
// Size: 0xb8 (Inherited: 0x58)
struct FTslAnimNode_BlendListBlendSpace : FAnimNode_AssetPlayerBase {
	float X; // 0x58(0x04)
	float Y; // 0x5c(0x04)
	struct UCurveFloat* CustomBlendCurve; // 0x60(0x08)
	struct UBlendSpace* LastActiveBlendSpace; // 0x68(0x08)
	struct TArray<struct UBlendSpace*> BlendSpace; // 0x70(0x10)
	struct TArray<float> BlendTime; // 0x80(0x10)
	struct TArray<struct FTslBlendSpaceBlendData> BlendSpaceData; // 0x90(0x10)
	char pad_A0[0x10]; // 0xa0(0x10)
	float PlayRate; // 0xb0(0x04)
	bool bLoop; // 0xb4(0x01)
	enum class EAlphaBlendOption BlendType; // 0xb5(0x01)
	char pad_B6[0x2]; // 0xb6(0x02)
};

// ScriptStruct TslGame.TslBlendSpaceBlendData
// Size: 0xd0 (Inherited: 0x00)
struct FTslBlendSpaceBlendData {
	struct UBlendSpace* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb8]; // 0x18(0xb8)
};

// ScriptStruct TslGame.TslAnimNode_BlendListBlendSpaceByEnum
// Size: 0xd0 (Inherited: 0xb8)
struct FTslAnimNode_BlendListBlendSpaceByEnum : FTslAnimNode_BlendListBlendSpace {
	struct TArray<bool> EnumToPoseIndex; // 0xb8(0x10)
	char pad_C8[0x5]; // 0xc8(0x05)
	bool ActiveEnumValue; // 0xcd(0x01)
	char pad_CE[0x2]; // 0xce(0x02)
};

// ScriptStruct TslGame.TslAnimNode_BlendEvaluatorBlendSpaceByEnum
// Size: 0xd8 (Inherited: 0xd0)
struct FTslAnimNode_BlendEvaluatorBlendSpaceByEnum : FTslAnimNode_BlendListBlendSpaceByEnum {
	float NormalizedTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct TslGame.TslAnimNode_BlendListRandom
// Size: 0x120 (Inherited: 0xc8)
struct FTslAnimNode_BlendListRandom : FAnimNode_BlendListBase {
	int32 ActiveChildIndex; // 0xc8(0x04)
	enum class ERandomType RandomType; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
	struct TArray<struct FBlendPosePlayInfo> PlayChances; // 0xd0(0x10)
	struct TArray<int32> PlayList; // 0xe0(0x10)
	int32 LoopingCounter; // 0xf0(0x04)
	float RandomPlayTime; // 0xf4(0x04)
	float RandomAccumlateTime; // 0xf8(0x04)
	struct FRandomStream RandomStream; // 0xfc(0x08)
	char pad_104[0x4]; // 0x104(0x04)
	struct TArray<float> NormalizedPlayChances; // 0x108(0x10)
	float LastChildAssetTime; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
};

// ScriptStruct TslGame.BlendPosePlayInfo
// Size: 0x24 (Inherited: 0x00)
struct FBlendPosePlayInfo {
	float PlayChance; // 0x00(0x04)
	struct FInt32Range LoopingCounter; // 0x04(0x10)
	struct FFloatRange RandomPlayTime; // 0x14(0x10)
};

// ScriptStruct TslGame.TslAnimNode_BlendPerBone
// Size: 0x188 (Inherited: 0x128)
struct FTslAnimNode_BlendPerBone : FTslAnimNode_BlendPerBoneBase {
	struct TArray<struct FBlendBoneSettings> OverrideBones; // 0x128(0x10)
	struct FPoseLink BasePose; // 0x138(0x18)
	struct FPoseLink BlendPose; // 0x150(0x18)
	struct FBoneReference BlendBone; // 0x168(0x18)
	bool bMeshSpaceRotationBlend; // 0x180(0x01)
	bool bKeepBlendBonePosition; // 0x181(0x01)
	enum class *25bebd741c CurveBlendOption; // 0x182(0x01)
	char pad_183[0x5]; // 0x183(0x05)
};

// ScriptStruct TslGame.TslAnimNode_BlendSequencesByBool
// Size: 0xb0 (Inherited: 0x58)
struct FTslAnimNode_BlendSequencesByBool : FAnimNode_AssetPlayerBase {
	bool ActiveValue; // 0x58(0x01)
	enum class EAlphaBlendOption BlendType; // 0x59(0x01)
	bool bLooping; // 0x5a(0x01)
	char pad_5B[0x1]; // 0x5b(0x01)
	enum class EBlendSequenceByBoolStartType StartType; // 0x5c(0x04)
	struct TArray<struct FTslBlendSequencesByBoolAnimationData> SequencesData; // 0x60(0x10)
	struct UAnimSequence* TrueSequence; // 0x70(0x08)
	struct UAnimSequence* FalseSequence; // 0x78(0x08)
	struct UAnimSequence* LastActiveSequence; // 0x80(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x88(0x08)
	char pad_90[0x10]; // 0x90(0x10)
	float TrueBlendTime; // 0xa0(0x04)
	float FalseBlendTime; // 0xa4(0x04)
	float TruePlayRate; // 0xa8(0x04)
	float FalsePlayRate; // 0xac(0x04)
};

// ScriptStruct TslGame.TslBlendSequencesByBoolAnimationData
// Size: 0x30 (Inherited: 0x00)
struct FTslBlendSequencesByBoolAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x28]; // 0x08(0x28)
};

// ScriptStruct TslGame.TslAnimNode_BonesLookAtEachOther
// Size: 0x118 (Inherited: 0xf8)
struct FTslAnimNode_BonesLookAtEachOther : FAnimNode_SkeletalControlBase {
	struct TArray<struct FTslBonesLookAtEachOtherSettings> Bones; // 0xf8(0x10)
	char pad_108[0x10]; // 0x108(0x10)
};

// ScriptStruct TslGame.TslBonesLookAtEachOtherSettings
// Size: 0x58 (Inherited: 0x00)
struct FTslBonesLookAtEachOtherSettings {
	struct FBoneReference Bone1; // 0x00(0x18)
	struct FBoneReference Bone2; // 0x18(0x18)
	struct FAxis LookAt_Axis; // 0x30(0x10)
	struct FAxis LookUp_Axis; // 0x40(0x10)
	bool bUseLookUpAxis; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// ScriptStruct TslGame.TslAnimNode_BranchByBool
// Size: 0x68 (Inherited: 0x30)
struct FTslAnimNode_BranchByBool : FAnimNode_Base {
	bool ActiveValue; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FPoseLink TruePose; // 0x38(0x18)
	struct FPoseLink FalsePose; // 0x50(0x18)
};

// ScriptStruct TslGame.TslAnimNode_CCDIK
// Size: 0x1c0 (Inherited: 0xf8)
struct FTslAnimNode_CCDIK : FAnimNode_SkeletalControlBase {
	struct FVector EffectorLocation; // 0xf8(0x0c)
	enum class *4c02c9923e EffectorLocationSpace; // 0x104(0x01)
	char pad_105[0xb]; // 0x105(0x0b)
	struct FBoneSocketTarget EffectorTarget; // 0x110(0x60)
	struct FBoneReference TipBone; // 0x170(0x18)
	struct FBoneReference RootBone; // 0x188(0x18)
	float Precision; // 0x1a0(0x04)
	int32 MaxIterations; // 0x1a4(0x04)
	bool bStartFromTail; // 0x1a8(0x01)
	bool bEnableRotationLimit; // 0x1a9(0x01)
	char pad_1AA[0x6]; // 0x1aa(0x06)
	struct TArray<struct FCCDIKJointSettings> RotationLimitPerJoints; // 0x1b0(0x10)
};

// ScriptStruct TslGame.CCDIKJointSettings
// Size: 0x1c (Inherited: 0x00)
struct FCCDIKJointSettings {
	float MaxConeAngle; // 0x00(0x04)
	float MaxAngleX; // 0x04(0x04)
	float MinAngleX; // 0x08(0x04)
	float MaxAngleY; // 0x0c(0x04)
	float MinAngleY; // 0x10(0x04)
	float MaxAngleZ; // 0x14(0x04)
	float MinAngleZ; // 0x18(0x04)
};

// ScriptStruct TslGame.TslAnimNode_CopyBones
// Size: 0x118 (Inherited: 0xf8)
struct FTslAnimNode_CopyBones : FAnimNode_SkeletalControlBase {
	struct TArray<struct FTslCopyBoneSettings> Bones; // 0xf8(0x10)
	char pad_108[0x10]; // 0x108(0x10)
};

// ScriptStruct TslGame.TslCopyBoneSettings
// Size: 0x38 (Inherited: 0x00)
struct FTslCopyBoneSettings {
	struct FBoneReference SourceBone; // 0x00(0x18)
	struct FBoneReference TargetBone; // 0x18(0x18)
	bool bCopyTranslation; // 0x30(0x01)
	bool bCopyRotation; // 0x31(0x01)
	bool bCopyScale; // 0x32(0x01)
	enum class *4c02c9923e ControlSpace; // 0x33(0x01)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct TslGame.TslAnimNode_CustomAnimSequence
// Size: 0x90 (Inherited: 0x70)
struct FTslAnimNode_CustomAnimSequence : FAnimNode_SequencePlayer {
	struct U*3064612971* AnimDataAsset; // 0x70(0x08)
	struct FName AnimName; // 0x78(0x08)
	struct FName AltAnimName; // 0x80(0x08)
	int32 AnimationIndex; // 0x88(0x04)
	enum class ECustomAnimDataType CustomAnimDataType; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
};

// ScriptStruct TslGame.TslAnimNode_FabrikElbow
// Size: 0x1b0 (Inherited: 0xf8)
struct FTslAnimNode_FabrikElbow : FAnimNode_SkeletalControlBase {
	char pad_F8[0x8]; // 0xf8(0x08)
	struct FTransform EffectorTransform; // 0x100(0x30)
	enum class *4c02c9923e EffectorTransformSpace; // 0x130(0x01)
	char pad_131[0x7]; // 0x131(0x07)
	struct FBoneReference EffectorTransformBone; // 0x138(0x18)
	enum class *7be84fcd7b EffectorRotationSource; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct FBoneReference TipBone; // 0x158(0x18)
	struct FBoneReference RootBone; // 0x170(0x18)
	struct FBoneReference ElbowBone; // 0x188(0x18)
	float ElbowInterpCoef; // 0x1a0(0x04)
	float Precision; // 0x1a4(0x04)
	int32 MaxIterations; // 0x1a8(0x04)
	bool bEnableDebugDraw; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
};

// ScriptStruct TslGame.TslAnimNode_Falling
// Size: 0xa0 (Inherited: 0x58)
struct FTslAnimNode_Falling : FAnimNode_AssetPlayerBase {
	struct U*4ea5d6c53e* AnimDBMap; // 0x58(0x08)
	struct U*4ea5d6c53e* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslFallingNodeAnimationData> BlendSpacesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	float X; // 0x90(0x04)
	float BlendTime; // 0x94(0x04)
	char pad_98[0x4]; // 0x98(0x04)
	enum class EWeaponClass WeaponClass; // 0x9c(0x01)
	enum class EAlphaBlendOption BlendType; // 0x9d(0x01)
	char pad_9E[0x2]; // 0x9e(0x02)
};

// ScriptStruct TslGame.TslFallingNodeAnimationData
// Size: 0xd0 (Inherited: 0x00)
struct FTslFallingNodeAnimationData {
	struct UBlendSpace1D* BlendSpace; // 0x00(0x08)
	struct TArray<struct FBlendSampleData> BlendSampleDataCache; // 0x08(0x10)
	char pad_18[0xb8]; // 0x18(0xb8)
};

// ScriptStruct TslGame.TslAnimNode_Healing
// Size: 0x80 (Inherited: 0x30)
struct FTslAnimNode_Healing : FAnimNode_Base {
	struct U*4ea5d6c53e* AnimDBMap; // 0x30(0x08)
	struct U*4ea5d6c53e* PrevAnimDBMap; // 0x38(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x40(0x08)
	struct TArray<struct FTslHealingSequenceData> SequencesData; // 0x48(0x10)
	char pad_58[0x18]; // 0x58(0x18)
	float PlayRate; // 0x70(0x04)
	float BlendTime; // 0x74(0x04)
	enum class EAlphaBlendOption BlendType; // 0x78(0x01)
	enum class ECastAnim CurrentItem; // 0x79(0x01)
	bool IsParentControl; // 0x7a(0x01)
	enum class EAnimStance Stance; // 0x7b(0x01)
	bool IsFPP; // 0x7c(0x01)
	bool Looping; // 0x7d(0x01)
	char pad_7E[0x2]; // 0x7e(0x02)
};

// ScriptStruct TslGame.TslHealingSequenceData
// Size: 0x28 (Inherited: 0x00)
struct FTslHealingSequenceData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x20]; // 0x08(0x20)
};

// ScriptStruct TslGame.TslAnimNode_Idles
// Size: 0xa8 (Inherited: 0x58)
struct FTslAnimNode_Idles : FAnimNode_AssetPlayerBase {
	struct U*4ea5d6c53e* AnimDBMap; // 0x58(0x08)
	struct U*4ea5d6c53e* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslIdlesNodeAnimationData> SequencesData; // 0x70(0x10)
	char pad_80[0x18]; // 0x80(0x18)
	float PlayRate; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	enum class EAnimStance Stance; // 0xa0(0x01)
	enum class EWeaponClass WeaponClass; // 0xa1(0x01)
	bool Relaxed; // 0xa2(0x01)
	enum class EAlphaBlendOption BlendType; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.TslIdlesNodeAnimationData
// Size: 0x38 (Inherited: 0x00)
struct FTslIdlesNodeAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x30]; // 0x08(0x30)
};

// ScriptStruct TslGame.TslAnimNode_JumpStart
// Size: 0xb8 (Inherited: 0x58)
struct FTslAnimNode_JumpStart : FAnimNode_AssetPlayerBase {
	struct U*4ea5d6c53e* AnimDBMap; // 0x58(0x08)
	struct U*4ea5d6c53e* PrevAnimDBMap; // 0x60(0x08)
	struct UCurveFloat* CustomBlendCurve; // 0x68(0x08)
	struct TArray<struct FTslJumpStartNodeAnimationData> SequencesData; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	struct FVector Velocity; // 0x90(0x0c)
	float Yaw; // 0x9c(0x04)
	float JumpHeight; // 0xa0(0x04)
	float BlendTime; // 0xa4(0x04)
	float BackwardAngleThreshold; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	enum class EWeaponClass WeaponClass; // 0xb0(0x01)
	bool bRelaxed; // 0xb1(0x01)
	bool bIsLocalPlayer; // 0xb2(0x01)
	enum class EAlphaBlendOption BlendType; // 0xb3(0x01)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.TslJumpStartNodeAnimationData
// Size: 0x40 (Inherited: 0x00)
struct FTslJumpStartNodeAnimationData {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x38]; // 0x08(0x38)
};

// ScriptStruct TslGame.TslAnimNode_LobbyAnimSequence
// Size: 0x100 (Inherited: 0x70)
struct FTslAnimNode_LobbyAnimSequence : FAnimNode_SequencePlayer {
	struct FLobbyCharacterAnimationDataRow CurrentAnimData; // 0x70(0x80)
	struct UAnimSequenceBase* LobbySequence; // 0xf0(0x08)
	int32 LobbyCharacterPosition; // 0xf8(0x04)
	enum class ELobbyCharacterReadyType ReadyType; // 0xfc(0x01)
	enum class EWeaponClass LastLobbyAnimationClass; // 0xfd(0x01)
	bool bPlayingDefaultAnim; // 0xfe(0x01)
	bool bPlayNextAnim; // 0xff(0x01)
};

// ScriptStruct TslGame.LobbyCharacterAnimationDataRow
// Size: 0x80 (Inherited: 0x08)
struct FLobbyCharacterAnimationDataRow : FTableRowBase {
	enum class ELobbyCharacterPosition Poisition; // 0x08(0x01)
	enum class ELobbyCharacterReadyType State; // 0x09(0x01)
	bool bDefaultAnimation; // 0x0a(0x01)
	char pad_B[0x1]; // 0x0b(0x01)
	float CycleTimes; // 0x0c(0x04)
	struct UAnimSequenceBase* UnArmed; // 0x10(0x08)
	struct UAnimSequenceBase* Pistol; // 0x18(0x08)
	struct UAnimSequenceBase* SMG; // 0x20(0x08)
	struct UAnimSequenceBase* Rifle; // 0x28(0x08)
	struct UAnimSequenceBase* Carbine; // 0x30(0x08)
	struct UAnimSequenceBase* Shotgun; // 0x38(0x08)
	struct UAnimSequenceBase* Sniper; // 0x40(0x08)
	struct UAnimSequenceBase* DMR; // 0x48(0x08)
	struct UAnimSequenceBase* LMG; // 0x50(0x08)
	struct UAnimSequenceBase* Melee; // 0x58(0x08)
	struct UAnimSequenceBase* Throwable; // 0x60(0x08)
	struct UAnimSequenceBase* Shield; // 0x68(0x08)
	struct UAnimSequenceBase* crossbow; // 0x70(0x08)
	struct UAnimSequenceBase* Launcher; // 0x78(0x08)
};

// ScriptStruct TslGame.TslAnimNode_PlayIdleSequence
// Size: 0xd0 (Inherited: 0x58)
struct FTslAnimNode_PlayIdleSequence : FAnimNode_AssetPlayerBase {
	struct U*daa1e59061* ParentInstance; // 0x58(0x08)
	struct U*abedad4c9f* AnimDB; // 0x60(0x08)
	float BlendTime; // 0x68(0x04)
	float PlayRate; // 0x6c(0x04)
	float IdleTriggerTimeMin; // 0x70(0x04)
	float IdleTriggerTimeVariation; // 0x74(0x04)
	bool bIsFPP; // 0x78(0x01)
	bool bIsCold; // 0x79(0x01)
	enum class EAnimStance Stance; // 0x7a(0x01)
	char pad_7B[0x5]; // 0x7b(0x05)
	struct FSequenceData ActiveSequence; // 0x80(0x10)
	struct FSequenceData PreviousSequence; // 0x90(0x10)
	char pad_A0[0x30]; // 0xa0(0x30)
};

// ScriptStruct TslGame.SequenceData
// Size: 0x10 (Inherited: 0x00)
struct FSequenceData {
	struct UAnimSequence* Sequence; // 0x00(0x08)
	float AccumulatedTime; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslAnimNode_RotateBones
// Size: 0xd0 (Inherited: 0x30)
struct FTslAnimNode_RotateBones : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x30(0x18)
	struct TArray<struct FName> Bone; // 0x48(0x10)
	struct TArray<enum class ERotateBoneSpace> Space; // 0x58(0x10)
	struct TArray<enum class EAxis> Axis; // 0x68(0x10)
	struct TArray<float> Angle; // 0x78(0x10)
	struct TArray<struct FRotator> Rotator; // 0x88(0x10)
	struct TArray<float> Alpha; // 0x98(0x10)
	char pad_A8[0x20]; // 0xa8(0x20)
	enum class ERotateBoneInputType InputType; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
};

// ScriptStruct TslGame.TslAnimNode_RotateRootBone
// Size: 0x68 (Inherited: 0x30)
struct FTslAnimNode_RotateRootBone : FAnimNode_Base {
	struct FPoseLink BasePose; // 0x30(0x18)
	char pad_48[0x10]; // 0x48(0x10)
	float Yaw; // 0x58(0x04)
	float Pitch; // 0x5c(0x04)
	bool bKeepChildTransforms; // 0x60(0x01)
	bool bInvert; // 0x61(0x01)
	char pad_62[0x6]; // 0x62(0x06)
};

// ScriptStruct TslGame.TslAnimNode_SequenceEvaluatorWithBlending
// Size: 0xa0 (Inherited: 0x58)
struct FTslAnimNode_SequenceEvaluatorWithBlending : FAnimNode_AssetPlayerBase {
	struct UAnimSequence* Sequence; // 0x58(0x08)
	struct UAnimSequence* PrevSequence; // 0x60(0x08)
	struct TArray<struct FTslSequenceBlending> SequencesData; // 0x68(0x10)
	char pad_78[0x10]; // 0x78(0x10)
	float ExplicitTime; // 0x88(0x04)
	float BlendTime; // 0x8c(0x04)
	enum class EAlphaBlendOption BlendType; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct UCurveFloat* CustomBlendCurve; // 0x98(0x08)
};

// ScriptStruct TslGame.TslSequenceBlending
// Size: 0x30 (Inherited: 0x00)
struct FTslSequenceBlending {
	struct UAnimSequence* AnimSequence; // 0x00(0x08)
	char pad_8[0x28]; // 0x08(0x28)
};

// ScriptStruct TslGame.TslAnimNode_Slot
// Size: 0x78 (Inherited: 0x70)
struct FTslAnimNode_Slot : FAnimNode_Slot {
	float Alpha; // 0x70(0x04)
	enum class ECustomAnimSlotType SlotType; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
};

// ScriptStruct TslGame.TslAnimNode_SlotByEnum
// Size: 0x1a8 (Inherited: 0x30)
struct FTslAnimNode_SlotByEnum : FAnimNode_Base {
	struct FPoseLink Source; // 0x30(0x18)
	bool ActiveEnumValue; // 0x48(0x01)
	enum class EAlphaBlendOption BlendType; // 0x49(0x01)
	char pad_4A[0x26]; // 0x4a(0x26)
	struct TArray<struct FName> Slot; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
	struct TArray<float> BlendTime; // 0x90(0x10)
	struct TArray<int32> EnumToSlotIndex; // 0xa0(0x10)
	struct UCurveFloat* CustomBlendCurve; // 0xb0(0x08)
	char pad_B8[0x4]; // 0xb8(0x04)
	enum class EAnimAlphaInputType AlphaInputType; // 0xbc(0x01)
	bool bAlphaBoolEnabled; // 0xbd(0x01)
	char pad_BE[0x2]; // 0xbe(0x02)
	float Alpha; // 0xc0(0x04)
	struct FInputScaleBias AlphaScaleBias; // 0xc4(0x08)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct FInputAlphaBoolBlend AlphaBoolBlend; // 0xd0(0x50)
	struct FName AlphaCurveName; // 0x120(0x08)
	struct FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x128(0x30)
	char pad_158[0x50]; // 0x158(0x50)
};

// ScriptStruct TslGame.TslAnimNode_SlotByWeapon
// Size: 0x118 (Inherited: 0x70)
struct FTslAnimNode_SlotByWeapon : FAnimNode_Slot {
	float Alpha; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct TMap<enum class EAnimWeaponType, struct FName> SlotNames; // 0x78(0x50)
	enum class EAnimWeaponType InWeapon; // 0xc8(0x01)
	char pad_C9[0x4f]; // 0xc9(0x4f)
};

// ScriptStruct TslGame.*2ef56e4d9d
// Size: 0x18 (Inherited: 0x08)
struct F*2ef56e4d9d : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	struct UClass* *1a9c31d4c1; // 0x10(0x08)
};

// ScriptStruct TslGame.*cd3fe03e99
// Size: 0x18 (Inherited: 0x08)
struct F*cd3fe03e99 : FTableRowBase {
	struct TArray<struct FName> ItemIDs; // 0x08(0x10)
};

// ScriptStruct TslGame.*d441a4acc2
// Size: 0x28 (Inherited: 0x08)
struct F*d441a4acc2 : FTableRowBase {
	enum class ECoinTakeType CoinTakeType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 BannedRoundAttributes; // 0x0c(0x04)
	int32 TakeValue; // 0x10(0x04)
	bool bOverwrite; // 0x14(0x01)
	bool bUseCustomOverride; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
	struct TArray<struct F*d3cbeb8b20> CustomOverrideValues; // 0x18(0x10)
};

// ScriptStruct TslGame.*d3cbeb8b20
// Size: 0x08 (Inherited: 0x00)
struct F*d3cbeb8b20 {
	int32 OverrideIndex; // 0x00(0x04)
	int32 OverrideValue; // 0x04(0x04)
};

// ScriptStruct TslGame.*9dd07f9bf1
// Size: 0x50 (Inherited: 0x08)
struct F*9dd07f9bf1 : FTableRowBase {
	struct FName ItemID; // 0x08(0x08)
	bool bEssential; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 CarryLimit; // 0x14(0x04)
	enum class EBombItemCategory Category; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	int32 SortID; // 0x1c(0x04)
	bool Purchasable; // 0x20(0x01)
	bool bGiveItemAfterRestart; // 0x21(0x01)
	char pad_22[0x2]; // 0x22(0x02)
	int32 Price; // 0x24(0x04)
	struct TArray<struct FName> WeaponAttachments; // 0x28(0x10)
	struct F*4194fd53ba WeaponAmmoData; // 0x38(0x10)
	enum class EBombScopeInfo ScopeInfo; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.*4194fd53ba
// Size: 0x10 (Inherited: 0x10)
struct F*4194fd53ba : F*e05f0f67b1 {
};

// ScriptStruct TslGame.*e05f0f67b1
// Size: 0x10 (Inherited: 0x00)
struct F*e05f0f67b1 {
	struct FName ItemID; // 0x00(0x08)
	int32 Stack; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*8824e76803
// Size: 0x20 (Inherited: 0x10)
struct F*8824e76803 : F*e05f0f67b1 {
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct TslGame.*a3377cd7c7
// Size: 0x520 (Inherited: 0x520)
struct F*a3377cd7c7 : F*29144ded29 {
};

// ScriptStruct TslGame.*3503d8b3cd
// Size: 0x178 (Inherited: 0x08)
struct F*3503d8b3cd : FTableRowBase {
	enum class *afb83b47e5 CharacterInteractType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float MaxInteractableDistance; // 0x0c(0x04)
	struct FText InteractionVerb; // 0x10(0x18)
	struct FText InteractiveObjectName; // 0x28(0x18)
	bool bUseTraceCheck; // 0x40(0x01)
	bool bTraceComplexForInteraction; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct F*90e797cdc2 CastConfig; // 0x48(0x130)
};

// ScriptStruct TslGame.*90e797cdc2
// Size: 0x130 (Inherited: 0x00)
struct F*90e797cdc2 {
	struct FText CastName; // 0x00(0x18)
	float CastTime; // 0x18(0x04)
	enum class ECastPriority CastPriority; // 0x1c(0x01)
	enum class ECastLevel CastLevel; // 0x1d(0x01)
	bool bIgnoreCastDistanceLimitation; // 0x1e(0x01)
	char pad_1F[0x1]; // 0x1f(0x01)
	float CastMaxDistance; // 0x20(0x04)
	float CastMaxDistanceMultiplierOnServer; // 0x24(0x04)
	float CasterAndCastObjectMaxDistance; // 0x28(0x04)
	float CasterAndCastObjectMaxDistanceMultiplierOnServer; // 0x2c(0x04)
	bool bCanCastInsideMovingVehicle; // 0x30(0x01)
	bool bKeepCastWhenVehicleHandling; // 0x31(0x01)
	char pad_32[0x2]; // 0x32(0x02)
	float MaxLinAcceleration; // 0x34(0x04)
	float CastMaxSpeed; // 0x38(0x04)
	float CastWalkSpeedModifier; // 0x3c(0x04)
	bool bNeedUnarm; // 0x40(0x01)
	bool bRecastsOnFinish; // 0x41(0x01)
	bool bLimitViewRotation; // 0x42(0x01)
	bool bForceStance; // 0x43(0x01)
	bool bSkipRestoreCharacterStance; // 0x44(0x01)
	bool bLockRotation; // 0x45(0x01)
	bool bCanCancelCasting; // 0x46(0x01)
	bool bCheckCastableConditionInProgress; // 0x47(0x01)
	bool bCancleWhenSprint; // 0x48(0x01)
	enum class ECastAnim CastAnim; // 0x49(0x01)
	char pad_4A[0x2]; // 0x4a(0x02)
	float CastBlendingTime; // 0x4c(0x04)
	float CancelBlockDuration; // 0x50(0x04)
	float CastAnimPlayRate; // 0x54(0x04)
	bool IsPermanentCasting; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct F*ea600104f9 CustomCastAnim; // 0x60(0xc0)
	enum class EStanceMode Stance; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct FName *11f61bab54; // 0x128(0x08)
};

// ScriptStruct TslGame.*ea600104f9
// Size: 0xc0 (Inherited: 0x00)
struct F*ea600104f9 {
	struct F*aaeb13b180 StartAnim; // 0x00(0x40)
	struct F*aaeb13b180 LoopAnim; // 0x40(0x40)
	struct F*aaeb13b180 EndAnim; // 0x80(0x40)
};

// ScriptStruct TslGame.*aaeb13b180
// Size: 0x40 (Inherited: 0x00)
struct F*aaeb13b180 {
	struct F*90ec9cbf1c AnimSequence; // 0x00(0x10)
	struct F*90ec9cbf1c AnimSequenceFPP; // 0x10(0x10)
	struct F*90ec9cbf1c AnimSequenceProne; // 0x20(0x10)
	struct F*90ec9cbf1c AnimSequenceProneFPP; // 0x30(0x10)
};

// ScriptStruct TslGame.*90ec9cbf1c
// Size: 0x10 (Inherited: 0x00)
struct F*90ec9cbf1c {
	struct UAnimSequence* Sequence; // 0x00(0x08)
	float PlayRate; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*565b9aa246
// Size: 0x480 (Inherited: 0x00)
struct F*565b9aa246 {
	struct F*d74c5d6e2d *d74c5d6e2d; // 0x00(0x290)
	struct F*2da22a520d *2da22a520d; // 0x290(0x1b0)
	struct F*6f1051854e *6f1051854e; // 0x440(0x38)
	char pad_478[0x8]; // 0x478(0x08)
};

// ScriptStruct TslGame.*6f1051854e
// Size: 0x38 (Inherited: 0x08)
struct F*6f1051854e : F*1c16ebccc7 {
	int32 *0b9bc74763; // 0x08(0x04)
	int32 *3e8221e735; // 0x0c(0x04)
	float Timestamp; // 0x10(0x04)
	struct FVector *e753914852; // 0x14(0x0c)
	int64 *1b22c279d4; // 0x20(0x08)
	struct FString TextMarker; // 0x28(0x10)
};

// ScriptStruct TslGame.*1c16ebccc7
// Size: 0x08 (Inherited: 0x00)
struct F*1c16ebccc7 {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct TslGame.*2da22a520d
// Size: 0x1b0 (Inherited: 0x08)
struct F*2da22a520d : F*1c16ebccc7 {
	char pad_8[0x8]; // 0x08(0x08)
	struct F*5a8371a5a3 *55d5072060; // 0x10(0xa0)
	struct F*5a8371a5a3 *a1ded433ce; // 0xb0(0xa0)
	struct FString *15c45668dc; // 0x150(0x10)
	struct FString *76558b56cc; // 0x160(0x10)
	struct FString *7a462ce760; // 0x170(0x10)
	struct FString *84ac0305db; // 0x180(0x10)
	char pad_190[0x20]; // 0x190(0x20)
};

// ScriptStruct TslGame.*5a8371a5a3
// Size: 0xa0 (Inherited: 0x00)
struct F*5a8371a5a3 {
	float Min; // 0x00(0x04)
	float Max; // 0x04(0x04)
	float Average; // 0x08(0x04)
	char pad_C[0x94]; // 0x0c(0x94)
};

// ScriptStruct TslGame.*d74c5d6e2d
// Size: 0x290 (Inherited: 0x08)
struct F*d74c5d6e2d : F*1c16ebccc7 {
	char pad_8[0x8]; // 0x08(0x08)
	struct F*5a8371a5a3 Frame; // 0x10(0xa0)
	struct F*5a8371a5a3 *b27e6d92d7; // 0xb0(0xa0)
	struct F*5a8371a5a3 *c76c2847d0; // 0x150(0xa0)
	struct F*5a8371a5a3 *c5455af685; // 0x1f0(0xa0)
};

// ScriptStruct TslGame.*5e1f60ced4
// Size: 0x40 (Inherited: 0x00)
struct F*5e1f60ced4 {
	struct FString DeviceName; // 0x00(0x10)
	struct FString ClientVersion; // 0x10(0x10)
	struct FString MapName; // 0x20(0x10)
	struct FString ModeName; // 0x30(0x10)
};

// ScriptStruct TslGame.*554c8845fa
// Size: 0x28 (Inherited: 0x08)
struct F*554c8845fa : FTableRowBase {
	float phase; // 0x08(0x04)
	float killer_x; // 0x0c(0x04)
	float killer_y; // 0x10(0x04)
	float killer_z; // 0x14(0x04)
	float victim_x; // 0x18(0x04)
	float victim_y; // 0x1c(0x04)
	float victim_z; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.HemostasisTableRow
// Size: 0x18 (Inherited: 0x08)
struct FHemostasisTableRow : FTableRowBase {
	int32 Stack; // 0x08(0x04)
	bool bCanHemostasis; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float HemostasisPercent; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*572cf8abd7
// Size: 0x3c8 (Inherited: 0x3b8)
struct F*572cf8abd7 : FItemTableRowCastable {
	struct TArray<struct F*4308a4a8c6> SupplyItems; // 0x3b8(0x10)
};

// ScriptStruct TslGame.ItemTableRowCastable
// Size: 0x3b8 (Inherited: 0x268)
struct FItemTableRowCastable : F*eee16334b9 {
	bool *f5f87f67c9; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct F*90e797cdc2 *90e797cdc2; // 0x270(0x130)
	enum class ECastableItemType *35796908f0; // 0x3a0(0x01)
	bool *b0745b5983; // 0x3a1(0x01)
	char pad_3A2[0x6]; // 0x3a2(0x06)
	struct TArray<struct UClass*> *097b84925d; // 0x3a8(0x10)
};

// ScriptStruct TslGame.*eee16334b9
// Size: 0x268 (Inherited: 0x08)
struct F*eee16334b9 : FTableRowBase {
	char bStackable : 1; // 0x08(0x01)
	char bUsable : 1; // 0x08(0x01)
	char bIsConsumable : 1; // 0x08(0x01)
	char bSetStackMaterialParameter : 1; // 0x08(0x01)
	char bDisableSpawnInGame : 1; // 0x08(0x01)
	char pad_8_5 : 3; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 StackCount; // 0x0c(0x04)
	int32 DefaultStackCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FText ItemName; // 0x18(0x18)
	struct FText ItemCategory; // 0x30(0x18)
	struct FText ItemDetailedName; // 0x48(0x18)
	struct FText ItemDescription; // 0x60(0x18)
	float ItemMaxInteractableDistance; // 0x78(0x04)
	int32 StackCountMax; // 0x7c(0x04)
	float SpacePerItem; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UStaticMesh* DroppedMesh; // 0x88(0x20)
	float DroppedMeshScale; // 0xa8(0x04)
	bool bDropAsProjectile; // 0xac(0x01)
	bool bThermalScopeInteractive; // 0xad(0x01)
	enum class EThermalItemType ThermalItemType; // 0xae(0x01)
	char pad_AF[0x1]; // 0xaf(0x01)
	struct U*76d2ef26df* ProjectileConfig; // 0xb0(0x20)
	struct UTexture* Icon; // 0xd0(0x20)
	struct UTexture* ToolTipIcon; // 0xf0(0x20)
	float IconSizeRatio; // 0x110(0x04)
	float ToolTipIconSizeRatio; // 0x114(0x04)
	struct UAkAudioEvent* DropSoundAk; // 0x118(0x20)
	struct FName DropAnimation; // 0x138(0x08)
	struct UAkAudioEvent* PickUpSoundAk; // 0x140(0x20)
	enum class EPickupAnimType PickUpAnimationOverride; // 0x160(0x01)
	char pad_161[0x7]; // 0x161(0x07)
	struct UAkAudioEvent* InventoryPutSoundAk; // 0x168(0x20)
	int32 SortPriority; // 0x188(0x04)
	enum class EItemCategory Category; // 0x18c(0x01)
	char pad_18D[0x3]; // 0x18d(0x03)
	struct FName SubCategory; // 0x190(0x08)
	bool bIsToy; // 0x198(0x01)
	bool bNeedToCheckPopup; // 0x199(0x01)
	bool bIsLobbyItem; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	int32 LobbyItemID; // 0x19c(0x04)
	struct F*ad68a30df7 LobbyItemDesc; // 0x1a0(0x60)
	bool bIsLobbyWeapon; // 0x200(0x01)
	char pad_201[0x3]; // 0x201(0x03)
	int32 LobbyWeaponID; // 0x204(0x04)
	struct UClass* LobbyWeaponInstance; // 0x208(0x20)
	bool *8bc728e4c8; // 0x228(0x01)
	bool *ff7b93e220; // 0x229(0x01)
	bool *fc7f28203f; // 0x22a(0x01)
	char pad_22B[0x5]; // 0x22b(0x05)
	struct FString Note; // 0x230(0x10)
	int32 AIFullValue; // 0x240(0x04)
	int32 ItemSubType; // 0x244(0x04)
	struct FName ItemID; // 0x248(0x08)
	struct UClass* ItemClass; // 0x250(0x08)
	struct UClass* *536517c11e; // 0x258(0x08)
	struct U*af7a15c57f* *1f34b2682f; // 0x260(0x08)
};

// ScriptStruct TslGame.*ad68a30df7
// Size: 0x60 (Inherited: 0x00)
struct F*ad68a30df7 {
	char *467c4320cb : 1; // 0x00(0x01)
	char bPointSellable : 1; // 0x00(0x01)
	char *27d748b5f4 : 1; // 0x00(0x01)
	char bPointRefundable : 1; // 0x00(0x01)
	char pad_0_4 : 4; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString *ff7fe1d4e8; // 0x08(0x10)
	enum class ELobbyItemTier Tier; // 0x18(0x01)
	enum class ELobbyItemCategory Category; // 0x19(0x01)
	char pad_1A[0x6]; // 0x1a(0x06)
	struct FText Description; // 0x20(0x18)
	bool *825f86d24d; // 0x38(0x01)
	bool *25e9f2a160; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct TArray<enum class ELobbyItemPlatform> Platforms; // 0x40(0x10)
	float *25efecb90f; // 0x50(0x04)
	enum class ELobbyItemPointSellingType *9e33732630; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	int32 *72ead98635; // 0x58(0x04)
	int32 *5c2a8ba201; // 0x5c(0x04)
};

// ScriptStruct TslGame.*4308a4a8c6
// Size: 0x10 (Inherited: 0x00)
struct F*4308a4a8c6 {
	struct FName SupplyItemID; // 0x00(0x08)
	int32 StackCount; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*cb5b5655b8
// Size: 0x280 (Inherited: 0x268)
struct F*cb5b5655b8 : F*eee16334b9 {
	enum class ECustomPartType CustomPart; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct TArray<struct FName> PartTags; // 0x270(0x10)
};

// ScriptStruct TslGame.*cb47a8faff
// Size: 0x280 (Inherited: 0x280)
struct F*cb47a8faff : F*644a0b9307 {
};

// ScriptStruct TslGame.*644a0b9307
// Size: 0x280 (Inherited: 0x268)
struct F*644a0b9307 : F*eee16334b9 {
	bool bAutoAction; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct F*e2478af550 SkinParam; // 0x270(0x10)
};

// ScriptStruct TslGame.*e2478af550
// Size: 0x10 (Inherited: 0x00)
struct F*e2478af550 {
	enum class ESkinCategory SkinCategory; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName SkinName; // 0x08(0x08)
};

// ScriptStruct TslGame.ItemTableRowVehiclePart
// Size: 0x310 (Inherited: 0x280)
struct FItemTableRowVehiclePart : F*cb5b5655b8 {
	enum class EVehiclePartType VehiclePart; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
	struct TArray<struct UMaterialInterface*> Materials; // 0x288(0x10)
	struct TMap<int32, struct UMaterialInterface*> OverrideDestroyedMaterial; // 0x298(0x50)
	struct USkeletalMesh* SkeletalMesh; // 0x2e8(0x20)
	int32 WheelSize; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
};

// ScriptStruct TslGame.*584c65cc94
// Size: 0x38 (Inherited: 0x00)
struct F*584c65cc94 {
	float *3a466695b4; // 0x00(0x04)
	float *e83d7c984b; // 0x04(0x04)
	int32 *6be2fa0baa; // 0x08(0x04)
	float *fb5d874678; // 0x0c(0x04)
	float *cfa77ea208; // 0x10(0x04)
	float *6a81deda37; // 0x14(0x04)
	int32 *d2b56a7ae7; // 0x18(0x04)
	float *13fca35e28; // 0x1c(0x04)
	struct TArray<struct F*754e52de24> *c2518acfb7; // 0x20(0x10)
	bool *3fce594eff; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *1b4fea72d0; // 0x34(0x04)
};

// ScriptStruct TslGame.*754e52de24
// Size: 0x30 (Inherited: 0x00)
struct F*754e52de24 {
	struct FString MapName; // 0x00(0x10)
	struct FString LocationName; // 0x10(0x10)
	struct FVector Location; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*d04bd35f86
// Size: 0x10 (Inherited: 0x00)
struct F*d04bd35f86 {
	uint32 *591e70dcab; // 0x00(0x04)
	float *fb5d874678; // 0x04(0x04)
	float *8299ef9bc2; // 0x08(0x04)
	bool *6b40ec1332; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*33c94acb29
// Size: 0x08 (Inherited: 0x00)
struct F*33c94acb29 {
	float *3a466695b4; // 0x00(0x04)
	float *6ccac66f2f; // 0x04(0x04)
};

// ScriptStruct TslGame.*6a60ecf9a4
// Size: 0x38 (Inherited: 0x00)
struct F*6a60ecf9a4 {
	float *3a466695b4; // 0x00(0x04)
	float *e83d7c984b; // 0x04(0x04)
	int32 *6be2fa0baa; // 0x08(0x04)
	float *fb5d874678; // 0x0c(0x04)
	float *cfa77ea208; // 0x10(0x04)
	float *6a81deda37; // 0x14(0x04)
	int32 *d2b56a7ae7; // 0x18(0x04)
	float *13fca35e28; // 0x1c(0x04)
	struct TArray<struct F*25c148b31f> *c2518acfb7; // 0x20(0x10)
	bool *3fce594eff; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *1b4fea72d0; // 0x34(0x04)
};

// ScriptStruct TslGame.*25c148b31f
// Size: 0x30 (Inherited: 0x00)
struct F*25c148b31f {
	struct FString MapName; // 0x00(0x10)
	struct FString LocationName; // 0x10(0x10)
	struct FVector Location; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*ba4df866b0
// Size: 0x18 (Inherited: 0x08)
struct F*ba4df866b0 : FTableRowBase {
	struct UStaticMesh* OldMesh; // 0x08(0x08)
	struct UStaticMesh* NewMesh; // 0x10(0x08)
};

// ScriptStruct TslGame.*52f8790078
// Size: 0x10 (Inherited: 0x08)
struct F*52f8790078 : FTableRowBase {
	struct UStaticMesh* Mesh; // 0x08(0x08)
};

// ScriptStruct TslGame.*fe2998b827
// Size: 0x30 (Inherited: 0x08)
struct F*fe2998b827 : FTableRowBase {
	enum class *40da61f0d8 DetailMode; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct TArray<struct UStaticMesh*> MeshesToOverride; // 0x10(0x10)
	struct TArray<struct UMaterialInterface*> DecalMaterialsToOverride; // 0x20(0x10)
};

// ScriptStruct TslGame.*fd3d8732c9
// Size: 0x10 (Inherited: 0x08)
struct F*fd3d8732c9 : FTableRowBase {
	struct UClass* BPClass; // 0x08(0x08)
};

// ScriptStruct TslGame.*470d020567
// Size: 0x70 (Inherited: 0x08)
struct F*470d020567 : FTableRowBase {
	struct FStringAssetReference *5d0cd86413; // 0x08(0x10)
	struct FStringAssetReference *58c49859df; // 0x18(0x10)
	struct FStringAssetReference *8ec1e281b1; // 0x28(0x10)
	struct FStringAssetReference *54ff8d1c90; // 0x38(0x10)
	struct FStringAssetReference *8d064922d9; // 0x48(0x10)
	struct FStringAssetReference *63a51d7060; // 0x58(0x10)
	float Ratio; // 0x68(0x04)
	bool *c38c7b1a9a; // 0x6c(0x01)
	bool *554d88c259; // 0x6d(0x01)
	bool *ee9af0a788; // 0x6e(0x01)
	bool *d24c0c4c27; // 0x6f(0x01)
};

// ScriptStruct TslGame.*af59171f35
// Size: 0x18 (Inherited: 0x08)
struct F*af59171f35 : FTableRowBase {
	struct FVector BeachPointLocation; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*de52e29671
// Size: 0x18 (Inherited: 0x08)
struct F*de52e29671 : FTableRowBase {
	int32 LocationX; // 0x08(0x04)
	int32 LocationY; // 0x0c(0x04)
	int32 LocationZ; // 0x10(0x04)
	int32 SafeScore; // 0x14(0x04)
};

// ScriptStruct TslGame.*e3d3eaec18
// Size: 0x60 (Inherited: 0x08)
struct F*e3d3eaec18 : FTableRowBase {
	float NormalArea; // 0x08(0x04)
	char pad_C[0x54]; // 0x0c(0x54)
};

// ScriptStruct TslGame.*24b693b668
// Size: 0xc8 (Inherited: 0x60)
struct F*24b693b668 : F*e3d3eaec18 {
	float Farm; // 0x60(0x04)
	float FerryPier; // 0x64(0x04)
	float Gatka; // 0x68(0x04)
	float Georgopol; // 0x6c(0x04)
	float Hospital; // 0x70(0x04)
	float Kameshki; // 0x74(0x04)
	float Lipovka; // 0x78(0x04)
	float Mansion; // 0x7c(0x04)
	float Mylta; // 0x80(0x04)
	float MyltaPower; // 0x84(0x04)
	float Novorepnoye; // 0x88(0x04)
	float Pochinki; // 0x8c(0x04)
	float Primorsk; // 0x90(0x04)
	float Prison; // 0x94(0x04)
	float Quarry; // 0x98(0x04)
	float Rozhok; // 0x9c(0x04)
	float Ruins; // 0xa0(0x04)
	float School; // 0xa4(0x04)
	float Severny; // 0xa8(0x04)
	float Shelter; // 0xac(0x04)
	float ShootingRange; // 0xb0(0x04)
	float SosnovkaMilitaryBase; // 0xb4(0x04)
	float Stalber; // 0xb8(0x04)
	float YasnayaPolyana; // 0xbc(0x04)
	float Zharki; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// ScriptStruct TslGame.*adac0c81f4
// Size: 0x70 (Inherited: 0x60)
struct F*adac0c81f4 : F*e3d3eaec18 {
	float Level_A; // 0x60(0x04)
	float Level_B; // 0x64(0x04)
	float Level_C; // 0x68(0x04)
	float Level_D; // 0x6c(0x04)
};

// ScriptStruct TslGame.*9f9406b355
// Size: 0xd8 (Inherited: 0x60)
struct F*9f9406b355 : F*e3d3eaec18 {
	float Alcantara; // 0x60(0x04)
	float CampoMilitar; // 0x64(0x04)
	float Chumacera; // 0x68(0x04)
	float Craterfields; // 0x6c(0x04)
	float CruzdelValle; // 0x70(0x04)
	float ElAzahar; // 0x74(0x04)
	float ElPozo; // 0x78(0x04)
	float Graveyard; // 0x7c(0x04)
	float HeciendadelPatron; // 0x80(0x04)
	float Junkyard; // 0x84(0x04)
	float LaBendita; // 0x88(0x04)
	float LaCobreria; // 0x8c(0x04)
	float Ladrillera; // 0x90(0x04)
	float Lmpala; // 0x94(0x04)
	float LosHigos; // 0x98(0x04)
	float LosLeones; // 0x9c(0x04)
	float MinasdelSur; // 0xa0(0x04)
	float MinasGenerales; // 0xa4(0x04)
	float MonteNuevo; // 0xa8(0x04)
	float Pecado; // 0xac(0x04)
	float Powergrid; // 0xb0(0x04)
	float Prison; // 0xb4(0x04)
	float PuertoParaiso; // 0xb8(0x04)
	float Ruins; // 0xbc(0x04)
	float SanMartin; // 0xc0(0x04)
	float TierraBronca; // 0xc4(0x04)
	float TorreAhumada; // 0xc8(0x04)
	float TrailerPark; // 0xcc(0x04)
	float ValledelMar; // 0xd0(0x04)
	float WaterTreatment; // 0xd4(0x04)
};

// ScriptStruct TslGame.*06c7a6f988
// Size: 0xa0 (Inherited: 0x60)
struct F*06c7a6f988 : F*e3d3eaec18 {
	float castle; // 0x60(0x04)
	float CoalMine; // 0x64(0x04)
	float Cosmodrome; // 0x68(0x04)
	float DekaMesto; // 0x6c(0x04)
	float Dinoland; // 0x70(0x04)
	float Kranik; // 0x74(0x04)
	float Laveni; // 0x78(0x04)
	float Laznova; // 0x7c(0x04)
	float LumberYard; // 0x80(0x04)
	float Naros; // 0x84(0x04)
	float Observatory; // 0x88(0x04)
	float Pavilka; // 0x8c(0x04)
	float TrainStation; // 0x90(0x04)
	float Trika; // 0x94(0x04)
	float Villa; // 0x98(0x04)
	float Winery; // 0x9c(0x04)
};

// ScriptStruct TslGame.*a133ac8bb4
// Size: 0x78 (Inherited: 0x60)
struct F*a133ac8bb4 : F*e3d3eaec18 {
	float CoalYards; // 0x60(0x04)
	float Docks; // 0x64(0x04)
	float IndustrialPark; // 0x68(0x04)
	float RailYard; // 0x6c(0x04)
	float Steelmill; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.*b9d3b86a76
// Size: 0xb0 (Inherited: 0x60)
struct F*b9d3b86a76 : F*e3d3eaec18 {
	float Arena; // 0x60(0x04)
	float Assembly; // 0x64(0x04)
	float Cabana_Town; // 0x68(0x04)
	float Coastal_Towns; // 0x6c(0x04)
	float Concert; // 0x70(0x04)
	float Dam_Town; // 0x74(0x04)
	float downtown; // 0x78(0x04)
	float Fulfillment_Center; // 0x7c(0x04)
	float Hill_Town; // 0x80(0x04)
	float Hydroelectric_Dam; // 0x84(0x04)
	float Little_City; // 0x88(0x04)
	float Lodge; // 0x8c(0x04)
	float Simple_Town; // 0x90(0x04)
	float Solar_Town; // 0x94(0x04)
	float Storage_Town; // 0x98(0x04)
	float Sunken_Town; // 0x9c(0x04)
	float swamp; // 0xa0(0x04)
	float Swamp_Town; // 0xa4(0x04)
	float Trailer_Town; // 0xa8(0x04)
	float Wind_Farms; // 0xac(0x04)
};

// ScriptStruct TslGame.*27fb15e012
// Size: 0xb0 (Inherited: 0x60)
struct F*27fb15e012 : F*e3d3eaec18 {
	float AirField; // 0x60(0x04)
	float BanTai; // 0x64(0x04)
	float Bootcamp; // 0x68(0x04)
	float CampAlpha; // 0x6c(0x04)
	float CampBravo; // 0x70(0x04)
	float CampCharlie; // 0x74(0x04)
	float Cave; // 0x78(0x04)
	float Getaway; // 0x7c(0x04)
	float Hatinh; // 0x80(0x04)
	float Kampong; // 0x84(0x04)
	float Khao; // 0x88(0x04)
	float Lawaki; // 0x8c(0x04)
	float NaKham; // 0x90(0x04)
	float Painan; // 0x94(0x04)
	float ParadiseResort; // 0x98(0x04)
	float Quarry; // 0x9c(0x04)
	float Ruins; // 0xa0(0x04)
	float Sahmee; // 0xa4(0x04)
	float Tambang; // 0xa8(0x04)
	float Tatmok; // 0xac(0x04)
};

// ScriptStruct TslGame.*2b2075e3e0
// Size: 0x78 (Inherited: 0x60)
struct F*2b2075e3e0 : F*e3d3eaec18 {
	float AlHabar; // 0x60(0x04)
	float AlHayik; // 0x64(0x04)
	float Bahrsahir; // 0x68(0x04)
	float Bashara; // 0x6c(0x04)
	float Hadiqanemo; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.*c1d4f2e2e0
// Size: 0xa8 (Inherited: 0x60)
struct F*c1d4f2e2e0 : F*e3d3eaec18 {
	float airport; // 0x60(0x04)
	float ArmyBase; // 0x64(0x04)
	float Buksansa; // 0x68(0x04)
	float FishingCamp; // 0x6c(0x04)
	float Godok; // 0x70(0x04)
	float Haemoosa; // 0x74(0x04)
	float Hapo; // 0x78(0x04)
	float Hosan; // 0x7c(0x04)
	float HosanPrison; // 0x80(0x04)
	float Kangneung; // 0x84(0x04)
	float Ohyang; // 0x88(0x04)
	float Palace; // 0x8c(0x04)
	float School; // 0x90(0x04)
	float ShipYard; // 0x94(0x04)
	float Songam; // 0x98(0x04)
	float Studio; // 0x9c(0x04)
	float Terminal; // 0xa0(0x04)
	float Wolsong; // 0xa4(0x04)
};

// ScriptStruct TslGame.*fcc20f3db3
// Size: 0x20 (Inherited: 0x08)
struct F*fcc20f3db3 : FTableRowBase {
	struct FText *cf7f58a1e1; // 0x08(0x18)
};

// ScriptStruct TslGame.*94be468464
// Size: 0x30 (Inherited: 0x00)
struct F*94be468464 {
	bool bUseMateriaSlotIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<int32> MaterialSlotIndex; // 0x08(0x10)
	bool bUseMaterialSlotName; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct TArray<struct FName> MaterialSlotName; // 0x20(0x10)
};

// ScriptStruct TslGame.*43c17757ce
// Size: 0x48 (Inherited: 0x00)
struct F*43c17757ce {
	struct F*3f053b24f8 *3f053b24f8; // 0x00(0x40)
	struct UImage* *9811139e17; // 0x40(0x08)
};

// ScriptStruct TslGame.*3f053b24f8
// Size: 0x40 (Inherited: 0x00)
struct F*3f053b24f8 {
	struct FGuid IconGUID; // 0x00(0x10)
	struct FVector WorldLocation; // 0x10(0x0c)
	struct FRotator WorldRotation; // 0x1c(0x0c)
	enum class EAuxilaryIconType IconType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FLinearColor IconColor; // 0x2c(0x10)
	bool bIsVisible; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct TslGame.*04982ef2bb
// Size: 0x60 (Inherited: 0x00)
struct F*04982ef2bb {
	struct FString *0383d268ce; // 0x00(0x10)
	char pad_10[0x50]; // 0x10(0x50)
};

// ScriptStruct TslGame.*2bf8f73c59
// Size: 0x20 (Inherited: 0x00)
struct F*2bf8f73c59 {
	struct FString *e20105168b; // 0x00(0x10)
	struct FString *504952b5f1; // 0x10(0x10)
};

// ScriptStruct TslGame.*86b3a82c8f
// Size: 0x28 (Inherited: 0x08)
struct F*86b3a82c8f : FTableRowBase {
	enum class EAuxilaryIconType IconType; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct UTexture* IconTexture; // 0x10(0x08)
	struct UCurveFloat* IconRatioCurve; // 0x18(0x08)
	float MinimapIconRatio; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.*1cddde8d3b
// Size: 0x28 (Inherited: 0x00)
struct F*1cddde8d3b {
	float *5b7856298c; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FName *f703b8633e; // 0x08(0x08)
	bool bShowTrunkMesh; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct F*586bc5d76b> *b72a0053ff; // 0x18(0x10)
};

// ScriptStruct TslGame.*586bc5d76b
// Size: 0x28 (Inherited: 0x00)
struct F*586bc5d76b {
	struct UStaticMesh* TrunkMesh; // 0x00(0x20)
	float MinCapacityPercent; // 0x20(0x04)
	float MaxCapacityPercent; // 0x24(0x04)
};

// ScriptStruct TslGame.*3a12cd300e
// Size: 0x30 (Inherited: 0x00)
struct F*3a12cd300e {
	struct F*1d4a6818de Stand; // 0x00(0x10)
	struct F*1d4a6818de Crouch; // 0x10(0x10)
	struct F*1d4a6818de Prone; // 0x20(0x10)
};

// ScriptStruct TslGame.*1d4a6818de
// Size: 0x10 (Inherited: 0x00)
struct F*1d4a6818de {
	float *53a4222ba0; // 0x00(0x04)
	float *33e632ef1e; // 0x04(0x04)
	float *abf1073bc4; // 0x08(0x04)
	float *ae76f7fcba; // 0x0c(0x04)
};

// ScriptStruct TslGame.*44dcadb9b7
// Size: 0x0c (Inherited: 0x00)
struct F*44dcadb9b7 {
	struct FVector Acceleration; // 0x00(0x0c)
};

// ScriptStruct TslGame.*9f5cfa5d67
// Size: 0x20 (Inherited: 0x00)
struct F*9f5cfa5d67 {
	struct UBlendSpace1D* BlendSpaceFPP; // 0x00(0x08)
	struct UBlendSpace1D* BlendSpaceTPP; // 0x08(0x08)
	struct FInputBlendPose BlendSettings; // 0x10(0x10)
};

// ScriptStruct TslGame.*13bbace17a
// Size: 0x10 (Inherited: 0x00)
struct F*13bbace17a {
	struct TArray<struct F*65a756e5c3> IdleAnimations; // 0x00(0x10)
};

// ScriptStruct TslGame.*65a756e5c3
// Size: 0x20 (Inherited: 0x00)
struct F*65a756e5c3 {
	struct UAnimSequence* AnimAsset; // 0x00(0x08)
	struct FInt32Range LoopingCounter; // 0x08(0x10)
	float ChanceToPlay; // 0x18(0x04)
	float BlendTime; // 0x1c(0x04)
};

// ScriptStruct TslGame.*0273bd0eae
// Size: 0x10 (Inherited: 0x00)
struct F*0273bd0eae {
	struct FName Name; // 0x00(0x08)
	bool bIsAxis; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float Scale; // 0x0c(0x04)
};

// ScriptStruct TslGame.*f1572a8200
// Size: 0x10 (Inherited: 0x00)
struct F*f1572a8200 {
	struct FName Name; // 0x00(0x08)
	float Scale; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*db468a7f17
// Size: 0x10 (Inherited: 0x00)
struct F*db468a7f17 {
	bool bEnabled; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Health; // 0x04(0x04)
	int32 Count; // 0x08(0x04)
	bool bUseRandomizedWeaponKits; // 0x0c(0x01)
	bool bUseUniqueWeaponKits; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
};

// ScriptStruct TslGame.*bee4cc6749
// Size: 0x10 (Inherited: 0x00)
struct F*bee4cc6749 {
	struct FName *f934cc21bd; // 0x00(0x08)
	int32 Count; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*48ada72602
// Size: 0x20 (Inherited: 0x00)
struct F*48ada72602 {
	enum class EAutoSpectatePriority *0d93824f0b; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 TeamId; // 0x04(0x04)
	struct FString *805f515875; // 0x08(0x10)
	float *5edb492125; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*2fa2a8adbc
// Size: 0x50 (Inherited: 0x00)
struct F*2fa2a8adbc {
	enum class EObserverHudAnimType AnimType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 EliminatorTeamNum; // 0x04(0x04)
	int32 EliminatedTeamNum; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString KillingSpreePlayerName; // 0x10(0x10)
	struct FString KillingSpreeClanName; // 0x20(0x10)
	struct FString KillingSpreeTeamName; // 0x30(0x10)
	int32 KillingSpreeTeamNum; // 0x40(0x04)
	int32 KillingSpreeKillCount; // 0x44(0x04)
	enum class EOutGamePlatformProvider KillingSpreePlayerPlatform; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.*145269dcdd
// Size: 0x18 (Inherited: 0x00)
struct F*145269dcdd {
	struct FString UniqueId; // 0x00(0x10)
	bool *bd8f690d33; // 0x10(0x01)
	bool *7b3b5446d4; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
};

// ScriptStruct TslGame.CommunicateTargetInfo
// Size: 0x30 (Inherited: 0x00)
struct FCommunicateTargetInfo {
	struct FString UniqueId; // 0x00(0x10)
	struct FString Nickname; // 0x10(0x10)
	enum class EOutGamePlatformProvider PlatformData; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	struct FCommunicationPrivilege CommunicationPrivileges; // 0x24(0x08)
	bool bMyFollower; // 0x2c(0x01)
	bool bIAmFollowing; // 0x2d(0x01)
	char pad_2E[0x2]; // 0x2e(0x02)
};

// ScriptStruct TslGame.CommunicationPrivilege
// Size: 0x08 (Inherited: 0x00)
struct FCommunicationPrivilege {
	int32 CommunicationPrivilege_Multiplay; // 0x00(0x04)
	int32 CommunicationPrivilege_CrossPlay; // 0x04(0x04)
};

// ScriptStruct TslGame.*51ac2126ef
// Size: 0x20 (Inherited: 0x00)
struct F*51ac2126ef {
	struct FString Key; // 0x00(0x10)
	struct TArray<struct F*8b995b3fca> Logs; // 0x10(0x10)
};

// ScriptStruct TslGame.*8b995b3fca
// Size: 0x20 (Inherited: 0x00)
struct F*8b995b3fca {
	struct FString Key; // 0x00(0x10)
	struct FString Value; // 0x10(0x10)
};

// ScriptStruct TslGame.BodyTypeDef
// Size: 0x08 (Inherited: 0x00)
struct FBodyTypeDef {
	int32 *51cb423240; // 0x00(0x04)
	int32 *c3ed69c0f6; // 0x04(0x04)
};

// ScriptStruct TslGame.*1c1d75f657
// Size: 0x98 (Inherited: 0x00)
struct F*1c1d75f657 {
	struct FString PlayerName; // 0x00(0x10)
	uint32 *9c52223615; // 0x10(0x04)
	int32 TeamId; // 0x14(0x04)
	bool *d32a003eab; // 0x18(0x01)
	bool Gender; // 0x19(0x01)
	bool *d76745ef66; // 0x1a(0x01)
	char pad_1B[0x5]; // 0x1b(0x05)
	struct TArray<int32> *84972f9bad; // 0x20(0x10)
	struct TArray<int32> *c851f1e380; // 0x30(0x10)
	struct TArray<int32> *2aa431bf7c; // 0x40(0x10)
	struct FString Emotes; // 0x50(0x10)
	struct FName *cf858b2989; // 0x60(0x08)
	struct FName *49d56b823d; // 0x68(0x08)
	float *0d2144d0cd; // 0x70(0x04)
	float *6ee59b4909; // 0x74(0x04)
	float *52a7cb994b; // 0x78(0x04)
	float *607b107017; // 0x7c(0x04)
	bool *e378366667; // 0x80(0x01)
	bool *684fcc58f1; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
	struct FString *5aa2985649; // 0x88(0x10)
};

// ScriptStruct TslGame.*5d29bb47cd
// Size: 0x10 (Inherited: 0x00)
struct F*5d29bb47cd {
	struct FVector Location; // 0x00(0x0c)
	bool *3b33a81f55; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*58967fb14a
// Size: 0x10 (Inherited: 0x00)
struct F*58967fb14a {
	enum class EMatchStartType Type; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UClass* Class; // 0x08(0x08)
};

// ScriptStruct TslGame.*54c5e763a0
// Size: 0x08 (Inherited: 0x00)
struct F*54c5e763a0 {
	float *30b365560c; // 0x00(0x04)
	float *da5aeb266b; // 0x04(0x04)
};

// ScriptStruct TslGame.*4c0596fe87
// Size: 0x24 (Inherited: 0x00)
struct F*4c0596fe87 {
	enum class EInventoryRadioMessageType *d5953f4c8c; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 *8e549d748b; // 0x04(0x04)
	int32 *1fcbfd4603; // 0x08(0x04)
	bool *846b74eaa3; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	int32 *175afe232e; // 0x10(0x04)
	int32 *bd97575fec; // 0x14(0x04)
	struct FVector_NetQuantize *ad23da627a; // 0x18(0x0c)
};

// ScriptStruct TslGame.*440a6f6735
// Size: 0x30 (Inherited: 0x00)
struct F*440a6f6735 {
	enum class ERadioMessageCategory Category; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FString> *2313f978bd; // 0x08(0x10)
	struct TArray<struct FText> *4aba7257b1; // 0x18(0x10)
	int32 *2cea562664; // 0x28(0x04)
	enum class ERadioMessageHighlightType *ea46456f94; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// ScriptStruct TslGame.*4339c9d7ee
// Size: 0x38 (Inherited: 0x28)
struct F*4339c9d7ee : F*7bd22f385a {
	struct TArray<struct FName> SkinnableTagList; // 0x28(0x10)
};

// ScriptStruct TslGame.*7bd22f385a
// Size: 0x28 (Inherited: 0x00)
struct F*7bd22f385a {
	struct FText ItemName; // 0x00(0x18)
	struct FString BlueprintId; // 0x18(0x10)
};

// ScriptStruct TslGame.*d40bfd9eb4
// Size: 0x38 (Inherited: 0x28)
struct F*d40bfd9eb4 : F*7bd22f385a {
	enum class EWeaponClass WeaponClassEnum; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct FName SkinTag; // 0x30(0x08)
};

// ScriptStruct TslGame.*b14bd35857
// Size: 0x10 (Inherited: 0x00)
struct F*b14bd35857 {
	struct FName ItemID; // 0x00(0x08)
	int32 Count; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.RankingInfo
// Size: 0x18 (Inherited: 0x00)
struct FRankingInfo {
	int32 TeamId; // 0x00(0x04)
	int32 *cbbe4496ad; // 0x04(0x04)
	int32 *0e19695995; // 0x08(0x04)
	int32 Score; // 0x0c(0x04)
	int32 Order; // 0x10(0x04)
	bool *3c8290ec43; // 0x14(0x01)
	bool *a7a833ac93; // 0x15(0x01)
	char pad_16[0x2]; // 0x16(0x02)
};

// ScriptStruct TslGame.*6fe09374d0
// Size: 0x08 (Inherited: 0x00)
struct F*6fe09374d0 {
	struct FName ItemID; // 0x00(0x08)
};

// ScriptStruct TslGame.*9147081c37
// Size: 0x10 (Inherited: 0x00)
struct F*9147081c37 {
	struct FStringClassReference ObjectClass; // 0x00(0x10)
};

// ScriptStruct TslGame.*89ea3617cc
// Size: 0x10 (Inherited: 0x00)
struct F*89ea3617cc {
	struct UTexture* Texture; // 0x00(0x08)
	float Ratio; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*d4d6d5b337
// Size: 0x30 (Inherited: 0x00)
struct F*d4d6d5b337 {
	struct FKey Key; // 0x00(0x18)
	struct UTexture* KeyIcon; // 0x18(0x08)
	struct UTexture* KeyIcon_PS; // 0x20(0x08)
	float IconRatio; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*5773b04061
// Size: 0x08 (Inherited: 0x00)
struct F*5773b04061 {
	int32 Width; // 0x00(0x04)
	int32 Height; // 0x04(0x04)
};

// ScriptStruct TslGame.*a112463383
// Size: 0x20 (Inherited: 0x00)
struct F*a112463383 {
	struct FString ActorName; // 0x00(0x10)
	struct FVector *a408745fb6; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*b2238adb88
// Size: 0x20 (Inherited: 0x00)
struct F*b2238adb88 {
	struct FString MapName; // 0x00(0x10)
	struct TArray<struct FSavedObPos> SavedObPos; // 0x10(0x10)
};

// ScriptStruct TslGame.SavedObPos
// Size: 0x18 (Inherited: 0x00)
struct FSavedObPos {
	struct FVector Loc; // 0x00(0x0c)
	struct FRotator Rot; // 0x0c(0x0c)
};

// ScriptStruct TslGame.*ef0c22f0da
// Size: 0x58 (Inherited: 0x00)
struct F*ef0c22f0da {
	struct TArray<enum class EGameModeType> GameModeTypeList; // 0x00(0x10)
	struct FString WidgetName; // 0x10(0x10)
	bool bRemoveWidget; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct F*290199d127 NewWidgetConfig; // 0x28(0x30)
};

// ScriptStruct TslGame.*290199d127
// Size: 0x30 (Inherited: 0x00)
struct F*290199d127 {
	struct FStringAssetReference WidgetClassReference; // 0x00(0x10)
	bool bDefaultShow; // 0x10(0x01)
	bool bUseMouse; // 0x11(0x01)
	bool bCloseByEscape; // 0x12(0x01)
	bool bRemovedByHiding; // 0x13(0x01)
	int32 ZOrder; // 0x14(0x04)
	bool bUsePcOnly; // 0x18(0x01)
	bool bUseConsoleOnly; // 0x19(0x01)
	bool bCharacterHudUi; // 0x1a(0x01)
	bool bSpectatorHudUi; // 0x1b(0x01)
	bool bObserverHudUi; // 0x1c(0x01)
	bool bReplayHudUi; // 0x1d(0x01)
	bool bLeagueReplayHudUi; // 0x1e(0x01)
	enum class ETslWidgetCreationMethod WidgetCreationMethod; // 0x1f(0x01)
	struct TArray<struct FString> HideWidgetList; // 0x20(0x10)
};

// ScriptStruct TslGame.*a1561f004d
// Size: 0x20 (Inherited: 0x00)
struct F*a1561f004d {
	struct FString WidgetName; // 0x00(0x10)
	struct TArray<struct F*7dfaa9aae9> AlternativeWidgets; // 0x10(0x10)
};

// ScriptStruct TslGame.*7dfaa9aae9
// Size: 0x30 (Inherited: 0x00)
struct F*7dfaa9aae9 {
	struct FName GameModeAlias; // 0x00(0x08)
	struct FStringAssetReference Reference; // 0x08(0x10)
	struct TArray<struct FString> HideWidgetList; // 0x18(0x10)
	int32 ZOrderOverride; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct TslGame.*33345791b8
// Size: 0x40 (Inherited: 0x00)
struct F*33345791b8 {
	struct FString WidgetName; // 0x00(0x10)
	struct F*290199d127 WidgetConfig; // 0x10(0x30)
};

// ScriptStruct TslGame.*769d8f477f
// Size: 0x18 (Inherited: 0x00)
struct F*769d8f477f {
	struct FString *27f1a1ad88; // 0x00(0x10)
	int32 *5e4df06e35; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.TslUserProfile
// Size: 0x18 (Inherited: 0x00)
struct FTslUserProfile {
	struct FString PlayerNetId; // 0x00(0x10)
	float TotalPlayTime_Sec; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.*b06f270220
// Size: 0x0c (Inherited: 0x00)
struct F*b06f270220 {
	char pad_0[0x8]; // 0x00(0x08)
	int32 Counter; // 0x08(0x04)
};

// ScriptStruct TslGame.*6c6591959a
// Size: 0x08 (Inherited: 0x00)
struct F*6c6591959a {
	enum class EWeatherChange newWeather; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Weight; // 0x04(0x04)
};

// ScriptStruct TslGame.ChineseLicensingDefaultCustomizeData
// Size: 0x18 (Inherited: 0x00)
struct FChineseLicensingDefaultCustomizeData {
	struct FString CustomizableObjectGroupName; // 0x00(0x10)
	struct FName EquipableItemID; // 0x10(0x08)
};

// ScriptStruct TslGame.*5b77532293
// Size: 0x14 (Inherited: 0x00)
struct F*5b77532293 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 AircraftCount; // 0x04(0x04)
	float AircraftCooldown; // 0x08(0x04)
	int32 InvalidBeforePhase; // 0x0c(0x04)
	int32 InvalidAfterPhase; // 0x10(0x04)
};

// ScriptStruct TslGame.*a9fc98a744
// Size: 0x24 (Inherited: 0x00)
struct F*a9fc98a744 {
	int32 BlueZonePhase; // 0x00(0x04)
	float StartDelay; // 0x04(0x04)
	float WarningDuration; // 0x08(0x04)
	float ReleaseDuration; // 0x0c(0x04)
	float BlueZoneDamagePerSecond; // 0x10(0x04)
	float RadiusRate; // 0x14(0x04)
	float SpreadRatio; // 0x18(0x04)
	float LandRatio; // 0x1c(0x04)
	int32 CircleAlgorithm; // 0x20(0x04)
};

// ScriptStruct TslGame.*9632ca367e
// Size: 0x40 (Inherited: 0x00)
struct F*9632ca367e {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float PlayerNearBuildingMaxDamage; // 0x04(0x04)
	float PlayerNearBuildingMaxDistance; // 0x08(0x04)
	float StrikeInnerRadius; // 0x0c(0x04)
	float StrikeMidRadius; // 0x10(0x04)
	float StrikeOuterRadius; // 0x14(0x04)
	float StartDelay; // 0x18(0x04)
	float StandbyDelay; // 0x1c(0x04)
	float RequestedStandbyDelay; // 0x20(0x04)
	float BombingDelay; // 0x24(0x04)
	int32 MaxMidCount; // 0x28(0x04)
	int32 MaxFarCount; // 0x2c(0x04)
	int32 MinimumBuildingsToDestroy; // 0x30(0x04)
	struct FVector2D BombingInterval; // 0x34(0x08)
	bool bUseBlackZoneCurves; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct TslGame.*87191fef66
// Size: 0x1c (Inherited: 0x00)
struct F*87191fef66 {
	bool bIsActive; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float MultiplierRedZoneExplosionDensity; // 0x04(0x04)
	float MultiplierRedZoneStartTime; // 0x08(0x04)
	float MultiplierRedZoneEndTime; // 0x0c(0x04)
	float MultiplierRedZoneExplosionDelay; // 0x10(0x04)
	float MultiplierRedZoneDuration; // 0x14(0x04)
	float MultiplierRedZoneArea; // 0x18(0x04)
};

// ScriptStruct TslGame.MatchLog
// Size: 0x60 (Inherited: 0x00)
struct FMatchLog {
	char pad_0[0x60]; // 0x00(0x60)
};

// ScriptStruct TslGame.*f48087c0ae
// Size: 0x08 (Inherited: 0x00)
struct F*f48087c0ae {
	float *e1b8a377cf; // 0x00(0x04)
	float *fed59cb44d; // 0x04(0x04)
};

// ScriptStruct TslGame.*11f48a0f99
// Size: 0x10 (Inherited: 0x00)
struct F*11f48a0f99 {
	float *e1b8a377cf; // 0x00(0x04)
	float *fed59cb44d; // 0x04(0x04)
	float *6bf865ae86; // 0x08(0x04)
	float *e372677027; // 0x0c(0x04)
};

// ScriptStruct TslGame.*7f04408362
// Size: 0x18 (Inherited: 0x00)
struct F*7f04408362 {
	float *133f57b14b; // 0x00(0x04)
	float *d5a54f296a; // 0x04(0x04)
	float *85bea70777; // 0x08(0x04)
	float *36c0b9e4ac; // 0x0c(0x04)
	float *6bf865ae86; // 0x10(0x04)
	float *089abad134; // 0x14(0x04)
};

// ScriptStruct TslGame.*74e93816fd
// Size: 0x14 (Inherited: 0x00)
struct F*74e93816fd {
	bool *94e6714ab2; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float *99e9bcc5f9; // 0x04(0x04)
	float *ccdd1ef28d; // 0x08(0x04)
	float *57a83f28a5; // 0x0c(0x04)
	float *ce21a37634; // 0x10(0x04)
};

// ScriptStruct TslGame.*a805e914d5
// Size: 0x0c (Inherited: 0x00)
struct F*a805e914d5 {
	float *f916f36b14; // 0x00(0x04)
	float BpBoost; // 0x04(0x04)
	float *80404d61d6; // 0x08(0x04)
};

// ScriptStruct TslGame.*4ffa7cc4bf
// Size: 0x10 (Inherited: 0x00)
struct F*4ffa7cc4bf {
	float SurvivalTimeStart; // 0x00(0x04)
	float TeamSpectatingTimeStart; // 0x04(0x04)
	float SurvivalTimeAccumulated; // 0x08(0x04)
	float TeamSpectatingTimeAccumulated; // 0x0c(0x04)
};

// ScriptStruct TslGame.TslLobbyCustomizingData
// Size: 0x58 (Inherited: 0x00)
struct FTslLobbyCustomizingData {
	enum class ELobbyCustomizingSlotType LobbyCustomizingSlotType; // 0x00(0x01)
	bool SlotIndex; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct FTslLobbyItemViewData LobbyItemViewData; // 0x08(0x50)
};

// ScriptStruct TslGame.TslLobbyItemViewData
// Size: 0x50 (Inherited: 0x00)
struct FTslLobbyItemViewData {
	struct FString TargetItemId; // 0x00(0x10)
	struct FString SkinItemId; // 0x10(0x10)
	struct TArray<struct FString> PartIds; // 0x20(0x10)
	struct FString SequenceTag; // 0x30(0x10)
	float InitialScale; // 0x40(0x04)
	float ZoomMultiplier; // 0x44(0x04)
	float ViewModeScaleMin; // 0x48(0x04)
	float ViewModeScaleMax; // 0x4c(0x04)
};

// ScriptStruct TslGame.TslLobbyCharacterCreateType
// Size: 0x50 (Inherited: 0x00)
struct FTslLobbyCharacterCreateType {
	uint32 SlotIndex; // 0x00(0x04)
	bool IsGenderMale; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	struct FString NetId; // 0x08(0x10)
	struct FString Nickname; // 0x18(0x10)
	struct FString ClanTag; // 0x28(0x10)
	struct FString ClanplateId; // 0x38(0x10)
	enum class EOutGamePlatformProvider PlatformProvider; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct TslGame.TslLobbyEmotePlaySetData
// Size: 0x38 (Inherited: 0x00)
struct FTslLobbyEmotePlaySetData {
	struct FName EmoteName; // 0x00(0x08)
	struct FName SectionName; // 0x08(0x08)
	struct FString PlayType; // 0x10(0x10)
	struct FString EmoteLeaderNetId; // 0x20(0x10)
	bool bIsEmoteFollower; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct TslGame.*08180f54e1
// Size: 0x58 (Inherited: 0x08)
struct F*08180f54e1 : FTableRowBase {
	struct TMap<struct FName, struct F*40bbd1898c> TargetStateData; // 0x08(0x50)
};

// ScriptStruct TslGame.*40bbd1898c
// Size: 0x20 (Inherited: 0x00)
struct F*40bbd1898c {
	struct UAnimationAsset* StateAnimation; // 0x00(0x20)
};

// ScriptStruct TslGame.*b4767c0ff6
// Size: 0xa8 (Inherited: 0x00)
struct F*b4767c0ff6 {
	enum class ETslOutGameCloudRequestType *590ff4f6c3; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText *5e46a1bc28; // 0x08(0x18)
	float *5e3473d0e8; // 0x20(0x04)
	float *6c64a0fb93; // 0x24(0x04)
	struct FText *c162b9a5f4; // 0x28(0x18)
	struct FText *e4ef67d428; // 0x40(0x18)
	struct TMap<enum class ETslOutGameCloudRequestErrorType, struct FText> *6762a70bbb; // 0x58(0x50)
};

// ScriptStruct TslGame.*e19a130d46
// Size: 0x10 (Inherited: 0x00)
struct F*e19a130d46 {
	struct FName *d175fe2194; // 0x00(0x08)
	bool bEnable; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct TslGame.*e1836cc2bf
// Size: 0x20 (Inherited: 0x00)
struct F*e1836cc2bf {
	struct FString AccountId; // 0x00(0x10)
	struct FString LoadingState; // 0x10(0x10)
};

// ScriptStruct TslGame.*d5fe4bb536
// Size: 0x18 (Inherited: 0x00)
struct F*d5fe4bb536 {
	struct FString AccountId; // 0x00(0x10)
	float *de1772b4a3; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.TslReportedInfo
// Size: 0x108 (Inherited: 0x00)
struct FTslReportedInfo {
	struct FString MatchId; // 0x00(0x10)
	struct FTslReportUserInfo UserInfo; // 0x10(0x70)
	struct FTslReporterInfo ReporterInfo; // 0x80(0x48)
	struct FString Cause; // 0xc8(0x10)
	struct TArray<struct FString> DetailCauseList; // 0xd8(0x10)
	struct FString ReportedSessionType; // 0xe8(0x10)
	float MatchElapsedTimeSec; // 0xf8(0x04)
	bool bIsKilledByReportedUser; // 0xfc(0x01)
	bool bIsDBNOedByReportedUser; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	float DamagedAmountByReportedUser; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.TslReporterInfo
// Size: 0x48 (Inherited: 0x00)
struct FTslReporterInfo {
	struct FString AccountId; // 0x00(0x10)
	struct FString PlayerName; // 0x10(0x10)
	int32 TeamId; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FString ClanId; // 0x28(0x10)
	struct FString ClanTag; // 0x38(0x10)
};

// ScriptStruct TslGame.*d642b59180
// Size: 0x50 (Inherited: 0x00)
struct F*d642b59180 {
	struct FString PlayerName; // 0x00(0x10)
	struct FString FullPlayerName; // 0x10(0x10)
	struct FString ClanName; // 0x20(0x10)
	int32 NumKills; // 0x30(0x04)
	int32 NumAssists; // 0x34(0x04)
	int32 Ranking; // 0x38(0x04)
	int32 TeamId; // 0x3c(0x04)
	int32 NumStartTeamMember; // 0x40(0x04)
	float DamageDealtOnEnemy; // 0x44(0x04)
	bool bIsZombie; // 0x48(0x01)
	enum class EOutGamePlatformProvider PlayerPlatform; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct TslGame.*d7d88d0f34
// Size: 0x18 (Inherited: 0x00)
struct F*d7d88d0f34 {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct TslGame.*a21d8551f6
// Size: 0x20 (Inherited: 0x00)
struct F*a21d8551f6 {
	enum class EReportDetailCauseType ReportDetailCauseType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText Description; // 0x08(0x18)
};

// ScriptStruct TslGame.*ee8d455cd5
// Size: 0x10 (Inherited: 0x00)
struct F*ee8d455cd5 {
	int32 PlayerCount; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct ATslPlayerStart* PlayerStart; // 0x08(0x08)
};

// ScriptStruct TslGame.*9ddb47d48f
// Size: 0x0c (Inherited: 0x00)
struct F*9ddb47d48f {
	int32 TeamId; // 0x00(0x04)
	int32 SquadIndex; // 0x04(0x04)
	int32 *e1fe54ff27; // 0x08(0x04)
};

// ScriptStruct TslGame.*26bd3d8cb9
// Size: 0x30 (Inherited: 0x00)
struct F*26bd3d8cb9 {
	struct ATslPlayerState* Commander; // 0x00(0x08)
	struct F*ad225cd187 *ad225cd187; // 0x08(0x10)
	struct ATslPlatoonFireSupportController* *3d9179781c; // 0x18(0x08)
	struct U*f16f41a842* *f8039ba9cb; // 0x20(0x08)
	struct U*f16f41a842* *a14e70c264; // 0x28(0x08)
};

// ScriptStruct TslGame.*330a9ede17
// Size: 0x18 (Inherited: 0x00)
struct F*330a9ede17 {
	int32 TeamNum; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct ATeam*> Members; // 0x08(0x10)
};

// ScriptStruct TslGame.*699dc04a5b
// Size: 0x18 (Inherited: 0x00)
struct F*699dc04a5b {
	struct AActor* SpottedActor; // 0x00(0x08)
	float SpottedStartTime; // 0x08(0x04)
	float SpottedEndTime; // 0x0c(0x04)
	bool SpottedDuringThisCycle; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct TslGame.*65f3696e1b
// Size: 0x14 (Inherited: 0x00)
struct F*65f3696e1b {
	bool *feca501812; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector *fcdae2f2e9; // 0x04(0x0c)
	bool *e72bea105d; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.WorldMarker
// Size: 0x68 (Inherited: 0x00)
struct FWorldMarker {
	bool Show; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector_NetQuantize100 MarkerPosition; // 0x04(0x0c)
	struct FVector_NetQuantize100 MarkerOffset; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct AActor* TrackedActor; // 0x20(0x08)
	enum class EMarkerType MarkerType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float MarkerCreationTime; // 0x2c(0x04)
	float MarkerLifetime; // 0x30(0x04)
	struct FGuid MarkerID; // 0x34(0x10)
	struct FLinearColor MarkerColor; // 0x44(0x10)
	bool bUseSquadColor; // 0x54(0x01)
	bool bIsPassiveMarker; // 0x55(0x01)
	int8 *42bbc64952; // 0x56(0x01)
	char pad_57[0x1]; // 0x57(0x01)
	struct TArray<int8> *226ce078d0; // 0x58(0x10)
};

// ScriptStruct TslGame.*968e5d5b17
// Size: 0x20 (Inherited: 0x00)
struct F*968e5d5b17 {
	struct AActor* SpottedActor; // 0x00(0x08)
	float SpottingTime; // 0x08(0x04)
	struct FGuid MarkerID; // 0x0c(0x10)
	int8 *42bbc64952; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct TslGame.*a299381029
// Size: 0x08 (Inherited: 0x00)
struct F*a299381029 {
	float Z; // 0x00(0x04)
	enum class ENearClippingLevel Level; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct TslGame.*3c48c0d9c6
// Size: 0x08 (Inherited: 0x00)
struct F*3c48c0d9c6 {
	enum class ENearClippingLevel Level; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Value; // 0x04(0x04)
};

// ScriptStruct TslGame.LevelLoadingBoostParameters
// Size: 0x10 (Inherited: 0x00)
struct FLevelLoadingBoostParameters {
	float AsyncLoadingTimeLimit; // 0x00(0x04)
	float PriorityAsyncLoadingExtraTime; // 0x04(0x04)
	float LevelStreamingActorsUpdateTimeLimit; // 0x08(0x04)
	int32 LevelStreamingComponentsRegistrationGranularity; // 0x0c(0x04)
};

// ScriptStruct TslGame.*be80d72f85
// Size: 0x0c (Inherited: 0x00)
struct F*be80d72f85 {
	bool bRandomSpawn; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float RandomSpawnRadius; // 0x04(0x04)
	float *50ccab64f3; // 0x08(0x04)
};

// ScriptStruct TslGame.*d40e1ee965
// Size: 0x10 (Inherited: 0x00)
struct F*d40e1ee965 {
	int32 *0e6dd34f49; // 0x00(0x04)
	int32 *62c65a2f2b; // 0x04(0x04)
	struct ADroppedItem* *2b634e88f6; // 0x08(0x08)
};

// ScriptStruct TslGame.*720eb4d247
// Size: 0x10 (Inherited: 0x00)
struct F*720eb4d247 {
	struct FName *2e73011f72; // 0x00(0x08)
	int32 *46be55c5c1; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct TslGame.*3cbd353435
// Size: 0x10 (Inherited: 0x00)
struct F*3cbd353435 {
	enum class EConstraintSlotType ConstraintSlotType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct F*fa3080db19 EquipPosition; // 0x04(0x08)
	enum class EEquipableItemSoundType OverrideSoundType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct TslGame.*fa3080db19
// Size: 0x08 (Inherited: 0x00)
struct F*fa3080db19 {
	enum class EEquipSlotID SlotID; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32 Index; // 0x04(0x04)
};

// ScriptStruct TslGame.*5bd7eb8b19
// Size: 0x48 (Inherited: 0x00)
struct F*5bd7eb8b19 {
	struct FRotator *80ba3b91ea; // 0x00(0x0c)
	struct FVector Location; // 0x0c(0x0c)
	struct FVector Direction; // 0x18(0x0c)
	char pad_24[0x4]; // 0x24(0x04)
	struct U*76d2ef26df* ThrowableConfig; // 0x28(0x08)
	int32 *947e9c0b9c; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct ATslCharacter* *cdb74f6dc7; // 0x38(0x08)
	struct UPrimitiveComponent* *d17b8928d9; // 0x40(0x08)
};

// ScriptStruct TslGame.*799e0696d3
// Size: 0x190 (Inherited: 0x00)
struct F*799e0696d3 {
	struct TMap<struct UClass*, struct F*457adccb5c> SlotOffset_Primary_PerWeapon; // 0x00(0x50)
	struct TMap<struct UClass*, struct F*457adccb5c> SlotOffset_Secondary_PerWeapon; // 0x50(0x50)
	struct TMap<struct UClass*, struct F*457adccb5c> SlotOffset_SideArm_PerWeapon; // 0xa0(0x50)
	struct TMap<struct UClass*, struct F*457adccb5c> SlotOffset_Melee_PerWeapon; // 0xf0(0x50)
	struct TMap<struct UClass*, struct F*457adccb5c> SlotOffset_Thrown_PerWeapon; // 0x140(0x50)
};

// ScriptStruct TslGame.*457adccb5c
// Size: 0x18 (Inherited: 0x00)
struct F*457adccb5c {
	struct FVector Location; // 0x00(0x0c)
	struct FRotator Rotation; // 0x0c(0x0c)
};

// ScriptStruct TslGame.*ca1fad9579
// Size: 0x78 (Inherited: 0x00)
struct F*ca1fad9579 {
	struct FVector SlotOffset_Primary_Location; // 0x00(0x0c)
	struct FVector SlotOffset_Secondary_Location; // 0x0c(0x0c)
	struct FVector SlotOffset_SideArm_Location; // 0x18(0x0c)
	struct FVector SlotOffset_Melee_Location; // 0x24(0x0c)
	struct FVector SlotOffset_Thrown_Location; // 0x30(0x0c)
	struct FRotator SlotOffset_Primary_Rotation; // 0x3c(0x0c)
	struct FRotator SlotOffset_Secondary_Rotation; // 0x48(0x0c)
	struct FRotator SlotOffset_SideArm_Rotation; // 0x54(0x0c)
	struct FRotator SlotOffset_Melee_Rotation; // 0x60(0x0c)
	struct FRotator SlotOffset_Thrown_Rotation; // 0x6c(0x0c)
};

// ScriptStruct TslGame.*3f28b1cc0f
// Size: 0x08 (Inherited: 0x08)
struct F*3f28b1cc0f : FTableRowBase {
};

// ScriptStruct TslGame.*125ad54661
// Size: 0xd8 (Inherited: 0x00)
struct F*125ad54661 {
	enum class ECastAnim CastAnim; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float CastAnimPlayRate; // 0x04(0x04)
	struct F*ea600104f9 CustomCastAnim; // 0x08(0xc0)
	float CustomCastTimeRemaining; // 0xc8(0x04)
	bool IsPermanentCasting; // 0xcc(0x01)
	char pad_CD[0x3]; // 0xcd(0x03)
	float CastBlendingTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct TslGame.*9328db8dea
// Size: 0xb8 (Inherited: 0xb0)
struct F*9328db8dea : F*dfd238f456 {
	bool *23dafa55f0; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
};

// ScriptStruct TslGame.*b102709db9
// Size: 0x08 (Inherited: 0x00)
struct F*b102709db9 {
	float *678aae16d2; // 0x00(0x04)
	enum class EDamageVictimActorType *84ffb2c2a8; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct TslGame.*83021f2c21
// Size: 0x140 (Inherited: 0x00)
struct F*83021f2c21 {
	struct UClass* Explosion; // 0x00(0x08)
	float DamagedPercentMax; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UClass* Damaged; // 0x10(0x08)
	struct UClass* Destroyed; // 0x18(0x08)
	struct UAkAudioEvent* EngineSound; // 0x20(0x08)
	struct UAkAudioEvent* EngineSound_Remote; // 0x28(0x08)
	struct UAkAudioEvent* EngineSound_Stop; // 0x30(0x08)
	struct UAkAudioEvent* DelayedExplosion; // 0x38(0x08)
	struct UClass* Muffler; // 0x40(0x08)
	struct UClass* Muffler2; // 0x48(0x08)
	struct UClass* Muffler3; // 0x50(0x08)
	struct UClass* Muffler4; // 0x58(0x08)
	struct UClass* Boost; // 0x60(0x08)
	struct UClass* Boost2; // 0x68(0x08)
	struct UClass* Boost3; // 0x70(0x08)
	struct UClass* Boost4; // 0x78(0x08)
	struct UClass* FrontTrail; // 0x80(0x08)
	struct UClass* RearTrail; // 0x88(0x08)
	struct UClass* Thruster; // 0x90(0x08)
	struct UClass* Thruster2; // 0x98(0x08)
	struct UClass* FrontFoamLeft; // 0xa0(0x08)
	struct UClass* FrontFoamRight; // 0xa8(0x08)
	struct UClass* SpashEffectOverride; // 0xb0(0x08)
	struct UStaticMesh* Rotor; // 0xb8(0x08)
	struct UStaticMesh* RotorDamaged; // 0xc0(0x08)
	struct UClass* ExhaustPopEffect; // 0xc8(0x08)
	struct FFloatRange ImpactNormalForceRange; // 0xd0(0x10)
	struct UClass* ImpactDefault; // 0xe0(0x08)
	int32 MaxImpactCount; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct TMap<enum class EPhysicalSurface, struct UClass*> ImpactEffectMap; // 0xf0(0x50)
};

// ScriptStruct TslGame.*2e8bbe7789
// Size: 0x10 (Inherited: 0x00)
struct F*2e8bbe7789 {
	struct UAkAudioEvent* *8a154aa1ff; // 0x00(0x08)
	struct UAkAudioEvent* *d0d54e921c; // 0x08(0x08)
};

// ScriptStruct TslGame.*67fce95b16
// Size: 0x10 (Inherited: 0x08)
struct F*67fce95b16 : FTableRowBase {
	struct FName *2e73011f72; // 0x08(0x08)
};

// ScriptStruct TslGame.*d21249a8c5
// Size: 0x70 (Inherited: 0x00)
struct F*d21249a8c5 {
	struct ATslPlayerState* *d44ca7d636; // 0x00(0x08)
	struct UClass* *631db4da0e; // 0x08(0x08)
	struct F*dad71c8c98 *dad71c8c98; // 0x10(0x20)
	struct FDateTime *5b32e8c47e; // 0x30(0x08)
	enum class EDamageReason *f743161860; // 0x38(0x01)
	enum class EDamageTypeCategory *3cdf7e5eca; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct FName *965bf86607; // 0x40(0x08)
	struct TArray<struct FString> *8da9ba04a6; // 0x48(0x10)
	float Distance; // 0x58(0x04)
	bool *1171a8a3c6; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct TArray<struct ATslPlayerState*> *60ec5aaebf; // 0x60(0x10)
};

// ScriptStruct TslGame.*dad71c8c98
// Size: 0x20 (Inherited: 0x00)
struct F*dad71c8c98 {
	struct FName *2e73011f72; // 0x00(0x08)
	struct F*e2478af550 SkinParam; // 0x08(0x10)
	int32 *46be55c5c1; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.*5eb36389e7
// Size: 0x120 (Inherited: 0xf8)
struct F*5eb36389e7 : F*f550436cdf {
	struct FStringClassReference ReplaceVehicle; // 0xf8(0x10)
	enum class EVehicleSkinCategory VehicleSkinCategory; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct TArray<struct F*a9d69e1f89> DefaultPartSkinList; // 0x110(0x10)
};

// ScriptStruct TslGame.*f550436cdf
// Size: 0xf8 (Inherited: 0x08)
struct F*f550436cdf : FTableRowBase {
	struct TMap<struct FName, struct F*bba3f67595> SkinnedMeshSet; // 0x08(0x50)
	struct TMap<struct FName, struct F*d1f8d18748> SkinnedMaterialSet; // 0x58(0x50)
	struct TArray<struct FName> SkinnableTagList; // 0xa8(0x10)
	struct FRotator DefaultViewModeRotation; // 0xb8(0x0c)
	struct FRotator PivotModifierRotation; // 0xc4(0x0c)
	struct FVector PCViewModeLocation; // 0xd0(0x0c)
	struct FVector ConsoleViewModeLocation; // 0xdc(0x0c)
	struct FVector RecommendArrowOffset; // 0xe8(0x0c)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.*bba3f67595
// Size: 0x28 (Inherited: 0x00)
struct F*bba3f67595 {
	enum class ESkinMeshType MeshType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UObject* MeshAsset; // 0x08(0x20)
};

// ScriptStruct TslGame.*a9d69e1f89
// Size: 0x10 (Inherited: 0x00)
struct F*a9d69e1f89 {
	enum class EVehiclePartType *cf98085aa3; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FName *76f3db08e4; // 0x08(0x08)
};

// ScriptStruct TslGame.*c18eab18dd
// Size: 0x178 (Inherited: 0x178)
struct F*c18eab18dd : F*9e5d9652c2 {
};

// ScriptStruct TslGame.*9e5d9652c2
// Size: 0x178 (Inherited: 0xf8)
struct F*9e5d9652c2 : F*f550436cdf {
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForMale; // 0xf8(0x30)
	struct FCustomizableObjectIdentifier CustomizableObjectIdentifierForFemale; // 0x128(0x30)
	struct F*42c0484a8b CustomizableObjectSkin; // 0x158(0x20)
};

// ScriptStruct TslGame.*46fa642119
// Size: 0x178 (Inherited: 0x178)
struct F*46fa642119 : F*9e5d9652c2 {
};

// ScriptStruct TslGame.*1ae51cc792
// Size: 0x178 (Inherited: 0x178)
struct F*1ae51cc792 : F*9e5d9652c2 {
};

// ScriptStruct TslGame.*582e4e73fe
// Size: 0x178 (Inherited: 0x178)
struct F*582e4e73fe : F*9e5d9652c2 {
};

// ScriptStruct TslGame.*18dcaba45a
// Size: 0x170 (Inherited: 0x170)
struct F*18dcaba45a : F*48d2260db5 {
};

// ScriptStruct TslGame.*48d2260db5
// Size: 0x170 (Inherited: 0xf8)
struct F*48d2260db5 : F*f550436cdf {
	char bStatTrak : 1; // 0xf8(0x01)
	char pad_F8_1 : 7; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
	struct FStringAssetReference StatTrakActorClass; // 0x100(0x10)
	struct UAnimMontage* *f0b648ed2d; // 0x110(0x08)
	struct FName *a1eae64103; // 0x118(0x08)
	struct TMap<struct FName, struct FLinearColor> SkinnedColorSet; // 0x120(0x50)
};

// ScriptStruct TslGame.*78d7ab359a
// Size: 0x148 (Inherited: 0x08)
struct F*78d7ab359a : FTableRowBase {
	struct UTexture2D* *ff72077f6e; // 0x08(0x20)
	struct UTexture2D* *b2e07b7df0; // 0x28(0x20)
	struct UTexture2D* *0973b058a2; // 0x48(0x20)
	struct UTexture2D* *ac28e89cc0; // 0x68(0x20)
	struct FName *d54d1785da; // 0x88(0x08)
	struct FSlateColor *6c09333421; // 0x90(0x28)
	struct FSlateColor *19a4c93a76; // 0xb8(0x28)
	struct UMaterial* *f2eb956873; // 0xe0(0x20)
	struct UTexture2D* *99c9359e67; // 0x100(0x20)
	struct UTexture2D* *45655bf1f9; // 0x120(0x20)
	int32 *996daf7580; // 0x140(0x04)
	int32 *590332cda9; // 0x144(0x04)
};

// ScriptStruct TslGame.*2756a7353c
// Size: 0x170 (Inherited: 0x170)
struct F*2756a7353c : F*48d2260db5 {
};

// ScriptStruct TslGame.*baff61a875
// Size: 0x08 (Inherited: 0x00)
struct F*baff61a875 {
	struct USkeletalMesh* SkeletalMesh; // 0x00(0x08)
};

// ScriptStruct TslGame.*88dd8a2d11
// Size: 0x10 (Inherited: 0x00)
struct F*88dd8a2d11 {
	struct FName TargetName; // 0x00(0x08)
	struct UMeshComponent* TargetMesh; // 0x08(0x08)
};

// ScriptStruct TslGame.WuLogPlayerCureDebuff
// Size: 0x190 (Inherited: 0x60)
struct FWuLogPlayerCureDebuff : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogCharacter TargetCharacter; // 0xf0(0x90)
	struct FString DebuffName; // 0x180(0x10)
};

// ScriptStruct TslGame.WuLogCharacter
// Size: 0x90 (Inherited: 0x00)
struct FWuLogCharacter {
	struct FString Name; // 0x00(0x10)
	struct FString NetId; // 0x10(0x10)
	int32 TeamId; // 0x20(0x04)
	float Health; // 0x24(0x04)
	struct FVector Location; // 0x28(0x0c)
	int32 Ranking; // 0x34(0x04)
	int32 IndividualRanking; // 0x38(0x04)
	int32 Platform; // 0x3c(0x04)
	struct FString AccountId; // 0x40(0x10)
	bool IsInBlueZone; // 0x50(0x01)
	bool IsInRedZone; // 0x51(0x01)
	char pad_52[0x6]; // 0x52(0x06)
	struct TArray<struct FString> Zone; // 0x58(0x10)
	struct FString MovementBase; // 0x68(0x10)
	bool IsAI; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FString ParticipatedState; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogPlayerHungryStage
// Size: 0x108 (Inherited: 0x60)
struct FWuLogPlayerHungryStage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 PreviousStage; // 0xf0(0x04)
	int32 CurrentStage; // 0xf4(0x04)
	struct FString DebuffName; // 0xf8(0x10)
};

// ScriptStruct TslGame.WuLogSLBItemTransmit
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSLBItemTransmit : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FWuLogItem> TransmitedItem; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogItem
// Size: 0x50 (Inherited: 0x00)
struct FWuLogItem {
	struct FString ItemID; // 0x00(0x10)
	int32 StackCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString Category; // 0x18(0x10)
	struct FString SubCategory; // 0x28(0x10)
	struct TArray<struct FString> AttachedItems; // 0x38(0x10)
	bool HasRandomAttachments; // 0x48(0x01)
	bool IsUnique; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct TslGame.WuLogSLBItemReward
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSLBItemReward : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FWuLogItem> Item; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogSLBClearResult
// Size: 0x90 (Inherited: 0x60)
struct FWuLogSLBClearResult : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 Stage; // 0x70(0x04)
	bool Clear; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FString Reason; // 0x78(0x10)
	int32 PlayTime; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// ScriptStruct TslGame.WuLogSLBStartStage
// Size: 0x68 (Inherited: 0x60)
struct FWuLogSLBStartStage : FLogBase {
	int32 Stage; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// ScriptStruct TslGame.WuLogAliveCharacterNum
// Size: 0x90 (Inherited: 0x60)
struct FWuLogAliveCharacterNum : FLogBase {
	int32 AliveAINum; // 0x60(0x04)
	int32 AliveAITeamNum; // 0x64(0x04)
	int32 AlivePlayerNum; // 0x68(0x04)
	int32 AlivePlayerTeamNum; // 0x6c(0x04)
	struct TArray<struct FString> VictimCharacterAccountId; // 0x70(0x10)
	struct TArray<struct FString> ReviveOrRespawnCharacterAccountId; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogBombPlayerDefuse
// Size: 0x108 (Inherited: 0x60)
struct FWuLogBombPlayerDefuse : FLogBase {
	struct FWuLogBombMissionInfo Info; // 0x60(0xa8)
};

// ScriptStruct TslGame.WuLogBombMissionInfo
// Size: 0xa8 (Inherited: 0x00)
struct FWuLogBombMissionInfo {
	struct FWuLogCharacter Character; // 0x00(0x90)
	struct FString Action; // 0x90(0x10)
	int32 CurrentRound; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerPlant
// Size: 0x108 (Inherited: 0x60)
struct FWuLogBombPlayerPlant : FLogBase {
	struct FWuLogBombMissionInfo Info; // 0x60(0xa8)
};

// ScriptStruct TslGame.WuLogBombMoneyDonation
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogBombMoneyDonation : FLogBase {
	struct FWuLogBombPlayerCoinInfo Giver; // 0x60(0x28)
	struct FWuLogBombPlayerCoinInfo Taker; // 0x88(0x28)
	int32 Amount; // 0xb0(0x04)
	int32 CurrentRound; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerCoinInfo
// Size: 0x28 (Inherited: 0x00)
struct FWuLogBombPlayerCoinInfo {
	struct FString CharacterName; // 0x00(0x10)
	struct FString AccountId; // 0x10(0x10)
	int32 PresentCurrency; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct TslGame.WuLogBombItemBuy
// Size: 0x150 (Inherited: 0x60)
struct FWuLogBombItemBuy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 PresentCurrency; // 0xf0(0x04)
	int32 Cost; // 0xf4(0x04)
	int32 CurrentRound; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FWuLogItem Item; // 0x100(0x50)
};

// ScriptStruct TslGame.WuLogBombMatchResult
// Size: 0x98 (Inherited: 0x60)
struct FWuLogBombMatchResult : FLogBase {
	struct FWuLogBombMatchResultTeamInfo VictoryTeam; // 0x60(0x14)
	struct FWuLogBombMatchResultTeamInfo DefeatTeam; // 0x74(0x14)
	struct FString FinishCause; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogBombMatchResultTeamInfo
// Size: 0x14 (Inherited: 0x00)
struct FWuLogBombMatchResultTeamInfo {
	int32 TeamId; // 0x00(0x04)
	int32 TotalKills; // 0x04(0x04)
	int32 TotalAssists; // 0x08(0x04)
	int32 TotalPlantCount; // 0x0c(0x04)
	int32 TotalDefuseCount; // 0x10(0x04)
};

// ScriptStruct TslGame.WuLogBombPlayerIncome
// Size: 0x110 (Inherited: 0x60)
struct FWuLogBombPlayerIncome : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 Amount; // 0xf0(0x04)
	int32 CurrentRound; // 0xf4(0x04)
	struct FWuBombRoundSummary RoundSummary; // 0xf8(0x14)
	char pad_10C[0x4]; // 0x10c(0x04)
};

// ScriptStruct TslGame.WuBombRoundSummary
// Size: 0x14 (Inherited: 0x00)
struct FWuBombRoundSummary {
	int32 KillCount; // 0x00(0x04)
	int32 AssistCount; // 0x04(0x04)
	bool PlantOrDefuse; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 DefeatStreak; // 0x0c(0x04)
	bool DeciveRound; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct TslGame.WuLogBombRoundFinished
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogBombRoundFinished : FLogBase {
	struct FWuLogBombRoundFinishTeamInfo VictoryTeam; // 0x60(0x20)
	struct FWuLogBombRoundFinishTeamInfo DefeatTeam; // 0x80(0x20)
	struct FString FinishCause; // 0xa0(0x10)
	int32 CurrentRound; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogBombRoundFinishTeamInfo
// Size: 0x20 (Inherited: 0x00)
struct FWuLogBombRoundFinishTeamInfo {
	int32 TeamId; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString TeamType; // 0x08(0x10)
	int32 AlivePlayerCount; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.WuLogTireReplaced
// Size: 0x1a0 (Inherited: 0x60)
struct FWuLogTireReplaced : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle ParentVehicle; // 0xf0(0x58)
	struct FWuLogItem Item; // 0x148(0x50)
	float Durability; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
};

// ScriptStruct TslGame.WuLogVehicle
// Size: 0x58 (Inherited: 0x00)
struct FWuLogVehicle {
	struct FString VehicleType; // 0x00(0x10)
	struct FString SpawnId; // 0x10(0x10)
	struct FString VehicleId; // 0x20(0x10)
	int32 VehicleUniqueId; // 0x30(0x04)
	int32 SeatIndex; // 0x34(0x04)
	float HealthPercent; // 0x38(0x04)
	float FeulPercent; // 0x3c(0x04)
	float RotationPitch; // 0x40(0x04)
	float AltitudeAbs; // 0x44(0x04)
	float AltitudeRel; // 0x48(0x04)
	float Velocity; // 0x4c(0x04)
	bool IsWheelsInAir; // 0x50(0x01)
	bool IsInWaterVolume; // 0x51(0x01)
	bool IsEngineOn; // 0x52(0x01)
	char pad_53[0x5]; // 0x53(0x05)
};

// ScriptStruct TslGame.WuLogTirePulledOut
// Size: 0x1a0 (Inherited: 0x60)
struct FWuLogTirePulledOut : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle ParentVehicle; // 0xf0(0x58)
	struct FWuLogItem Item; // 0x148(0x50)
	float Durability; // 0x198(0x04)
	char pad_19C[0x4]; // 0x19c(0x04)
};

// ScriptStruct TslGame.WuLogSoftRoleRepairkitUse
// Size: 0x288 (Inherited: 0x60)
struct FWuLogSoftRoleRepairkitUse : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	struct FWuLogItem RepairedItem; // 0x140(0x50)
	struct FWuLogVehicle RepairedVehicle; // 0x190(0x58)
	struct FWuLogCharacter TargetCharacter; // 0x1e8(0x90)
	float PreviousRepairedStatus; // 0x278(0x04)
	float RepairedStatus; // 0x27c(0x04)
	int32 Remainedcount; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
};

// ScriptStruct TslGame.WuLogRevivalAircraft
// Size: 0x78 (Inherited: 0x60)
struct FWuLogRevivalAircraft : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FString> ReviveAccounts; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogSuccessRegisterBluechip
// Size: 0x90 (Inherited: 0x60)
struct FWuLogSuccessRegisterBluechip : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString RegisteredByAccountId; // 0x70(0x10)
	struct FString RegisteringMethod; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogTryRegisterBluechip
// Size: 0x90 (Inherited: 0x60)
struct FWuLogTryRegisterBluechip : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString RegisteredByAccountId; // 0x70(0x10)
	struct FString RegisteringMethod; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogBluechipLooted
// Size: 0x80 (Inherited: 0x60)
struct FWuLogBluechipLooted : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString LootingUserAccountId; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogBluechipRemove
// Size: 0x70 (Inherited: 0x60)
struct FWuLogBluechipRemove : FLogBase {
	struct FString AccountId; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogBluechipCreate
// Size: 0x78 (Inherited: 0x60)
struct FWuLogBluechipCreate : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 phase; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRejectReconnect
// Size: 0x70 (Inherited: 0x60)
struct FWuLogPlayerRejectReconnect : FLogBase {
	struct FString AccountId; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogPlayerDisconnected
// Size: 0x128 (Inherited: 0x60)
struct FWuLogPlayerDisconnected : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	struct FString Reason; // 0x110(0x10)
	bool IsRewardConfirmed; // 0x120(0x01)
	bool IsPenaltyWaived; // 0x121(0x01)
	bool ExitToDesktop; // 0x122(0x01)
	bool WasKicked; // 0x123(0x01)
	char pad_124[0x4]; // 0x124(0x04)
};

// ScriptStruct TslGame.WuGameResultPerPlayer
// Size: 0xb0 (Inherited: 0x00)
struct FWuGameResultPerPlayer {
	struct FString PlayerNetId; // 0x00(0x10)
	int32 Rank; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString GameResult; // 0x18(0x10)
	int32 TeamId; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FWuGameResultStatsPerPlayer Stats; // 0x30(0x68)
	bool IsBpGrinder; // 0x98(0x01)
	bool IsXpGrinder; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
	struct FString AccountId; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuGameResultStatsPerPlayer
// Size: 0x68 (Inherited: 0x00)
struct FWuGameResultStatsPerPlayer {
	int32 KillCount; // 0x00(0x04)
	float Score; // 0x04(0x04)
	float Xp; // 0x08(0x04)
	float DistanceOnFoot; // 0x0c(0x04)
	float DistanceOnSwim; // 0x10(0x04)
	float DistanceOnVehicle; // 0x14(0x04)
	float DistanceOnParachute; // 0x18(0x04)
	float DistanceOnFreefall; // 0x1c(0x04)
	struct FWuLogPlayTimeRecord PlayTime; // 0x20(0x08)
	struct FWuBpRewardDetail BpRewardDetail; // 0x28(0x18)
	struct FWuArcadeRewardDetail ArcadeRewardDetail; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct FWuStatTrakData> StatTrakDataPairs; // 0x48(0x10)
	struct TArray<struct FWuStatTrakData> HeadshotStatTrakDataPairs; // 0x58(0x10)
};

// ScriptStruct TslGame.WuStatTrakData
// Size: 0x18 (Inherited: 0x00)
struct FWuStatTrakData {
	struct FString GameItemId; // 0x00(0x10)
	int32 Value; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuArcadeRewardDetail
// Size: 0x04 (Inherited: 0x00)
struct FWuArcadeRewardDetail {
	int32 ByPlayTime; // 0x00(0x04)
};

// ScriptStruct TslGame.WuBpRewardDetail
// Size: 0x18 (Inherited: 0x00)
struct FWuBpRewardDetail {
	float ByPlayTime; // 0x00(0x04)
	float ByRanking; // 0x04(0x04)
	float ByKills; // 0x08(0x04)
	float ByDamageDealt; // 0x0c(0x04)
	float BoostAmount; // 0x10(0x04)
	float ByModeScore; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogPlayTimeRecord
// Size: 0x08 (Inherited: 0x00)
struct FWuLogPlayTimeRecord {
	int32 SurvivalTime; // 0x00(0x04)
	int32 TeamSpectatingTime; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogPlayerDisconnectedByQuit
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerDisconnectedByQuit : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	bool IsPenaltyWaived; // 0x110(0x01)
	bool ExitToDesktop; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)
};

// ScriptStruct TslGame.WuLogPlayerDisconnectedByTimeout
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerDisconnectedByTimeout : FLogBase {
	struct FWuGameResultPerPlayer GameResult; // 0x60(0xb0)
	bool IsPenaltyWaived; // 0x110(0x01)
	bool ExitToDesktop; // 0x111(0x01)
	bool WasKicked; // 0x112(0x01)
	char pad_113[0x5]; // 0x113(0x05)
};

// ScriptStruct TslGame.WuLogPlayerConnected
// Size: 0x88 (Inherited: 0x60)
struct FWuLogPlayerConnected : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	bool IsReconnect; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FString Reason; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogCrowbarInteraction
// Size: 0x100 (Inherited: 0x60)
struct FWuLogCrowbarInteraction : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString TargetName; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogUsePresetSlotIngame
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogUsePresetSlotIngame : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 SlotIndex; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLog1vs1ArenaMatching
// Size: 0xd8 (Inherited: 0x60)
struct FWuLog1vs1ArenaMatching : FLogBase {
	struct FString SearchStartTime; // 0x60(0x10)
	struct FWuLog1vs1ArenaTimeRecord MatchingTimeRecord; // 0x70(0x20)
	struct TArray<struct FString> SavedItems; // 0x90(0x10)
	struct TArray<int32> Results; // 0xa0(0x10)
	int32 RoundCount; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct FString AccountId; // 0xb8(0x10)
	struct FString NetId; // 0xc8(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaTimeRecord
// Size: 0x20 (Inherited: 0x00)
struct FWuLog1vs1ArenaTimeRecord {
	struct FString StartTime; // 0x00(0x10)
	struct FString EndTime; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaMatchingSearch
// Size: 0xa0 (Inherited: 0x60)
struct FWuLog1vs1ArenaMatchingSearch : FLogBase {
	struct FWuLog1vs1ArenaTimeRecord TimeRecord; // 0x60(0x20)
	struct FString AccountId; // 0x80(0x10)
	struct FString NetId; // 0x90(0x10)
};

// ScriptStruct TslGame.WuLog1vs1ArenaOberserver
// Size: 0x90 (Inherited: 0x60)
struct FWuLog1vs1ArenaOberserver : FLogBase {
	struct TArray<struct FWuLog1vs1ArenaTimeRecord> TimeRecords; // 0x60(0x10)
	struct FString AccountId; // 0x70(0x10)
	struct FString NetId; // 0x80(0x10)
};

// ScriptStruct TslGame.WuLogMinimapTeleport
// Size: 0x80 (Inherited: 0x60)
struct FWuLogMinimapTeleport : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct TArray<struct FWuLogMinimapTeleportData> TeleportDatas; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogMinimapTeleportData
// Size: 0x18 (Inherited: 0x00)
struct FWuLogMinimapTeleportData {
	int32 TeleportType; // 0x00(0x04)
	int32 PracticeType; // 0x04(0x04)
	struct FString DestinationActorName; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLogAbilitySummer
// Size: 0x100 (Inherited: 0x60)
struct FWuLogAbilitySummer : FLogBase {
	struct FWuLogCharacter Owner; // 0x60(0x90)
	struct TArray<struct FWuLogAbilityData> AbilityDataArr; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogAbilityData
// Size: 0x20 (Inherited: 0x00)
struct FWuLogAbilityData {
	struct FString AbilityID; // 0x00(0x10)
	int32 TotalActivate; // 0x10(0x04)
	int32 TotalSuccess; // 0x14(0x04)
	int32 TotalCancel; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct TslGame.WuLogAbilityActivate
// Size: 0x120 (Inherited: 0x60)
struct FWuLogAbilityActivate : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Owner; // 0x68(0x90)
	struct FWuLogAbility Ability; // 0xf8(0x20)
	int32 Index; // 0x118(0x04)
	bool IsSuccess; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
};

// ScriptStruct TslGame.WuLogAbility
// Size: 0x20 (Inherited: 0x00)
struct FWuLogAbility {
	struct FString AbilityID; // 0x00(0x10)
	struct TArray<struct FString> Attributes; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLogItemPickupFromChickenBox
// Size: 0x148 (Inherited: 0x60)
struct FWuLogItemPickupFromChickenBox : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	int32 ChickenBoxId; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
};

// ScriptStruct TslGame.WuLogZDF2StageData
// Size: 0x98 (Inherited: 0x60)
struct FWuLogZDF2StageData : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString Timestamp; // 0x70(0x10)
	int32 StageNumber; // 0x80(0x04)
	bool IsCraftingTime; // 0x84(0x01)
	bool IsStart; // 0x85(0x01)
	bool IsLastStage; // 0x86(0x01)
	char pad_87[0x1]; // 0x87(0x01)
	struct TArray<struct FWuLogZDF2PlayerData> PlayersData; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogZDF2PlayerData
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogZDF2PlayerData : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 HoldingCoinNum; // 0xf0(0x04)
	int32 EarnedCoinNum; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogRacingModeCoursePlayData
// Size: 0x98 (Inherited: 0x60)
struct FWuLogRacingModeCoursePlayData : FLogBase {
	int32 CourseNum; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString AccountId; // 0x68(0x10)
	int32 FinalRanking; // 0x78(0x04)
	int32 DeathCount; // 0x7c(0x04)
	int32 KillCount; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct TArray<struct FWuLogRacingModeCheckPointPlayData> CheckPoinPlayDatas; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogRacingModeCheckPointPlayData
// Size: 0x80 (Inherited: 0x60)
struct FWuLogRacingModeCheckPointPlayData : FLogBase {
	int32 PassedCheckPointNum; // 0x60(0x04)
	float CheckPointPassedTime; // 0x64(0x04)
	int32 IndividualRanking; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FString Passed_Vehicle; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogSandboxItemUsageCount
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSandboxItemUsageCount : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FWuLogSandboxItemDataUsage> ItemsPerCategory; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogSandboxItemDataUsage
// Size: 0x20 (Inherited: 0x00)
struct FWuLogSandboxItemDataUsage {
	struct FString ItemCategory; // 0x00(0x10)
	struct TArray<struct FWuStringIntPair> Items; // 0x10(0x10)
};

// ScriptStruct TslGame.WuStringIntPair
// Size: 0x18 (Inherited: 0x00)
struct FWuStringIntPair {
	struct FString First; // 0x00(0x10)
	int32 second; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogRadioMessage
// Size: 0x100 (Inherited: 0x60)
struct FWuLogRadioMessage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString MessageCategory; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogAtoZTutorialAllMissionClear
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogAtoZTutorialAllMissionClear : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogItemTypeOverrideZone
// Size: 0x78 (Inherited: 0x60)
struct FWuLogItemTypeOverrideZone : FLogBase {
	int32 ItemTypeOverrideZone; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FWuLogItemTypeOverrideZoneData> ItemTypeOverrideZoneDatas; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogItemTypeOverrideZoneData
// Size: 0x80 (Inherited: 0x60)
struct FWuLogItemTypeOverrideZoneData : FLogBase {
	struct FString OverrideType; // 0x60(0x10)
	struct FVector ItemTypeOverrideZonePosition; // 0x70(0x0c)
	float ItemTypeOverrideZoneRadius; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRedeploy
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogPlayerRedeploy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 phase; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogPlayerRedeployBRStart
// Size: 0x78 (Inherited: 0x60)
struct FWuLogPlayerRedeployBRStart : FLogBase {
	struct TArray<struct FWuLogCharacter> Characters; // 0x60(0x10)
	int32 phase; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogUsedBlueBlockerAndReturnedToSafeZone
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogUsedBlueBlockerAndReturnedToSafeZone : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 NumTimesUsedBlueBlockerAndReturnedToSafeZone; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogBlueBlockerAbsorbBlueZoneDamage
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogBlueBlockerAbsorbBlueZoneDamage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	float DamageAbsorbed; // 0xf0(0x04)
	int32 NumTimesBlueZoneAbsorbed; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogVoiceChatUseage
// Size: 0x90 (Inherited: 0x60)
struct FWuLogVoiceChatUseage : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct TArray<struct FWuStringFloatPair> Option; // 0x70(0x10)
	float PushTime; // 0x80(0x04)
	float TimeSpent; // 0x84(0x04)
	int32 PlatformProvider; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// ScriptStruct TslGame.WuStringFloatPair
// Size: 0x18 (Inherited: 0x00)
struct FWuStringFloatPair {
	struct FString First; // 0x00(0x10)
	float second; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuEventDamage
// Size: 0x68 (Inherited: 0x10)
struct FWuEventDamage : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	bool IsVictimMe; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	float Damage; // 0x14(0x04)
	struct FString DamageTypeCategory; // 0x18(0x10)
	struct FString AttackerName; // 0x28(0x10)
	struct FVector AttackerLocation; // 0x38(0x0c)
	int32 AttackerTeamId; // 0x44(0x04)
	struct FString VictimName; // 0x48(0x10)
	struct FVector VictimLocation; // 0x58(0x0c)
	int32 VictimTeamId; // 0x64(0x04)
};

// ScriptStruct TslGame.WuEventKill
// Size: 0x88 (Inherited: 0x10)
struct FWuEventKill : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	bool IsKillerMe; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	struct FString KillerName; // 0x18(0x10)
	struct FVector KillerLocation; // 0x28(0x0c)
	int32 KillerTeamId; // 0x34(0x04)
	bool IsVictimMe; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString VictimName; // 0x40(0x10)
	struct FVector VictimLocation; // 0x50(0x0c)
	int32 VictimTeamId; // 0x5c(0x04)
	struct FString DamageCauser; // 0x60(0x10)
	struct FString DamageReason; // 0x70(0x10)
	bool IsGroggy; // 0x80(0x01)
	bool IsStealKilled; // 0x81(0x01)
	char pad_82[0x6]; // 0x82(0x06)
};

// ScriptStruct TslGame.WuEventMatchResult
// Size: 0x38 (Inherited: 0x10)
struct FWuEventMatchResult : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	int32 StartPlayerCount; // 0x20(0x04)
	int32 StartTeamCount; // 0x24(0x04)
	struct TArray<struct FWuEventDataTeamResult> Teams; // 0x28(0x10)
};

// ScriptStruct TslGame.WuEventDataTeamResult
// Size: 0x18 (Inherited: 0x00)
struct FWuEventDataTeamResult {
	int32 TeamId; // 0x00(0x04)
	int32 Ranking; // 0x04(0x04)
	struct TArray<struct FWuEventDataPlayerResult> Members; // 0x08(0x10)
};

// ScriptStruct TslGame.WuEventDataPlayerResult
// Size: 0x18 (Inherited: 0x00)
struct FWuEventDataPlayerResult {
	struct FString PlayerName; // 0x00(0x10)
	int32 KillCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuEventPlayerMatchResult
// Size: 0x48 (Inherited: 0x10)
struct FWuEventPlayerMatchResult : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	int32 StartPlayerCount; // 0x20(0x04)
	int32 StartTeamCount; // 0x24(0x04)
	struct FString PlayerName; // 0x28(0x10)
	int32 Ranking; // 0x38(0x04)
	int32 KillCount; // 0x3c(0x04)
	int32 HeadShotCount; // 0x40(0x04)
	float GivenDamages; // 0x44(0x04)
};

// ScriptStruct TslGame.WuEventMatchStatus
// Size: 0xc8 (Inherited: 0x10)
struct FWuEventMatchStatus : FGameEventBase {
	bool IsDetailStatus; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString MatchId; // 0x18(0x10)
	struct FString TeamMode; // 0x28(0x10)
	struct FString CameraMode; // 0x38(0x10)
	struct FString MatchState; // 0x48(0x10)
	int32 ElapsedTime; // 0x58(0x04)
	int32 BlueZonePhase; // 0x5c(0x04)
	bool IsBlueZoneMoving; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float BluezoneRadius; // 0x64(0x04)
	struct FVector BlueZoneLocation; // 0x68(0x0c)
	float WhiteZoneRadius; // 0x74(0x04)
	struct FVector WhiteZoneLocation; // 0x78(0x0c)
	float RedZoneRadius; // 0x84(0x04)
	struct FVector RedZoneLocation; // 0x88(0x0c)
	float BlackZoneRadius; // 0x94(0x04)
	struct FVector BlackZoneLocation; // 0x98(0x0c)
	int32 StartPlayerCount; // 0xa4(0x04)
	int32 AlivePlayerCount; // 0xa8(0x04)
	int32 StartTeamCount; // 0xac(0x04)
	int32 AliveTeamCount; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct TArray<struct FWuEventDataPlayerInfo> PlayerInfos; // 0xb8(0x10)
};

// ScriptStruct TslGame.WuEventDataPlayerInfo
// Size: 0x50 (Inherited: 0x00)
struct FWuEventDataPlayerInfo {
	struct FString PlayerName; // 0x00(0x10)
	int32 TeamId; // 0x10(0x04)
	struct FVector Location; // 0x14(0x0c)
	float Health; // 0x20(0x04)
	float BoostGauge; // 0x24(0x04)
	struct FString State; // 0x28(0x10)
	struct FString ArmedWeapon; // 0x38(0x10)
	int32 ArmedAmmoCount; // 0x48(0x04)
	int32 InventoryAmmoCount; // 0x4c(0x04)
};

// ScriptStruct TslGame.WuEventPlayerStatus
// Size: 0xa0 (Inherited: 0x10)
struct FWuEventPlayerStatus : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	struct FString MyPlayerName; // 0x20(0x10)
	bool IsSpetating; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FVector SpectatingCameraLocation; // 0x34(0x0c)
	struct FWuEventDataPlayerInfo CurrentPlayerInfo; // 0x40(0x50)
	struct TArray<struct FWuEventDataPlayerInfo> TeamMatesInfo; // 0x90(0x10)
};

// ScriptStruct TslGame.WuEventMatchLeave
// Size: 0x20 (Inherited: 0x10)
struct FWuEventMatchLeave : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
};

// ScriptStruct TslGame.WuEventMatchJoin
// Size: 0x48 (Inherited: 0x10)
struct FWuEventMatchJoin : FGameEventBase {
	struct FString MatchId; // 0x10(0x10)
	struct FString TeamMode; // 0x20(0x10)
	struct FString CameraMode; // 0x30(0x10)
	bool IsDetailObserver; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// ScriptStruct TslGame.WuLogUseBrokenElectronics
// Size: 0x100 (Inherited: 0x60)
struct FWuLogUseBrokenElectronics : FLogBase {
	struct FString ElectronicsType; // 0x60(0x10)
	struct FWuLogCharacter Character; // 0x70(0x90)
};

// ScriptStruct TslGame.WuLogSpecialZoneSpawn
// Size: 0x80 (Inherited: 0x60)
struct FWuLogSpecialZoneSpawn : FLogBase {
	struct FString ZoneType; // 0x60(0x10)
	struct FVector SpawnedPosition; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogIndoorRangeScore
// Size: 0x90 (Inherited: 0x60)
struct FWuLogIndoorRangeScore : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	struct TArray<struct FWuIntIntPair> Score; // 0x80(0x10)
};

// ScriptStruct TslGame.WuIntIntPair
// Size: 0x08 (Inherited: 0x00)
struct FWuIntIntPair {
	int32 First; // 0x00(0x04)
	int32 second; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogChangeTargetDistance
// Size: 0x88 (Inherited: 0x60)
struct FWuLogChangeTargetDistance : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	int32 Distance; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct TslGame.WuLogEnterIndoorRange
// Size: 0x88 (Inherited: 0x60)
struct FWuLogEnterIndoorRange : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	struct FString NetId; // 0x70(0x10)
	bool bIsExit; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
};

// ScriptStruct TslGame.WuLogSpray
// Size: 0x100 (Inherited: 0x60)
struct FWuLogSpray : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString SprayName; // 0xf0(0x10)
};

// ScriptStruct TslGame.WuLogHelmetHide
// Size: 0x68 (Inherited: 0x60)
struct FWuLogHelmetHide : FLogBase {
	bool IsHat; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
};

// ScriptStruct TslGame.WuLogLobbyMusic
// Size: 0x70 (Inherited: 0x60)
struct FWuLogLobbyMusic : FLogBase {
	struct FString MusicEventName; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogArenaRoundEnd
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaRoundEnd : FLogBase {
	int32 Round; // 0x60(0x04)
	bool IsLastRound; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct FWuLogArenaEndData> Arenas; // 0x68(0x10)
	struct TArray<struct FWuLogTeamInfoData> Teams; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogTeamInfoData
// Size: 0x30 (Inherited: 0x00)
struct FWuLogTeamInfoData {
	int32 TeamId; // 0x00(0x04)
	int32 Chances; // 0x04(0x04)
	int32 TotalKills; // 0x08(0x04)
	int32 TotalMoney; // 0x0c(0x04)
	struct FString KeyPlayer; // 0x10(0x10)
	struct TArray<struct FWuLogCharacterWeapons> Characters; // 0x20(0x10)
};

// ScriptStruct TslGame.WuLogCharacterWeapons
// Size: 0xc8 (Inherited: 0x00)
struct FWuLogCharacterWeapons {
	struct FWuLogCharacter Character; // 0x00(0x90)
	struct FString PrimaryWeaponFirst; // 0x90(0x10)
	struct FString PrimaryWeaponSecond; // 0xa0(0x10)
	struct FString SecondaryWeapon; // 0xb0(0x10)
	int32 SpawnKitIndex; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// ScriptStruct TslGame.WuLogArenaEndData
// Size: 0x08 (Inherited: 0x00)
struct FWuLogArenaEndData {
	int32 ArenaID; // 0x00(0x04)
	int32 WinnerTeamId; // 0x04(0x04)
};

// ScriptStruct TslGame.WuLogArenaRoundStart
// Size: 0x78 (Inherited: 0x60)
struct FWuLogArenaRoundStart : FLogBase {
	int32 Round; // 0x60(0x04)
	bool IsLastRound; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct TArray<struct FWuLogArenaStartData> Arenas; // 0x68(0x10)
};

// ScriptStruct TslGame.WuLogArenaStartData
// Size: 0x18 (Inherited: 0x00)
struct FWuLogArenaStartData {
	int32 ArenaID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FWuLogTeamInfoData> Teams; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLogArenaLoadoutBuy
// Size: 0x98 (Inherited: 0x60)
struct FWuLogArenaLoadoutBuy : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	int32 Sum; // 0x70(0x04)
	int32 ItemsNum; // 0x74(0x04)
	struct FString ItemID; // 0x78(0x10)
	struct FString ReplacedItemId; // 0x88(0x10)
};

// ScriptStruct TslGame.WuLogArenaCurrencyChange
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaCurrencyChange : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	int32 CurrencyDif; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FString Source; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogArenaScreenOpen
// Size: 0x80 (Inherited: 0x60)
struct FWuLogArenaScreenOpen : FLogBase {
	struct FString PlayerName; // 0x60(0x10)
	struct FString ScreenName; // 0x70(0x10)
};

// ScriptStruct TslGame.WuLogArenaGameStatePeriodic
// Size: 0xe8 (Inherited: 0x60)
struct FWuLogArenaGameStatePeriodic : FLogBase {
	struct FWuLogArenaGameState ArenaGameState; // 0x60(0x88)
};

// ScriptStruct TslGame.WuLogArenaGameState
// Size: 0x88 (Inherited: 0x60)
struct FWuLogArenaGameState : FLogBase {
	int32 ElapsedTime; // 0x60(0x04)
	int32 NumAliveTeams; // 0x64(0x04)
	int32 NumJoinPlayers; // 0x68(0x04)
	int32 NumStartPlayers; // 0x6c(0x04)
	int32 NumAlivePlayers; // 0x70(0x04)
	int32 Round; // 0x74(0x04)
	struct TArray<struct FWuLogArena> Arenas; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogArena
// Size: 0x24 (Inherited: 0x00)
struct FWuLogArena {
	struct FVector SafetyZonePosition; // 0x00(0x0c)
	float SafetyZoneRadius; // 0x0c(0x04)
	struct FVector PoisonGasWarningPosition; // 0x10(0x0c)
	float PoisonGasWarningRadius; // 0x1c(0x04)
	int32 ArenaID; // 0x20(0x04)
};

// ScriptStruct TslGame.WuLogInPacketStat
// Size: 0xa8 (Inherited: 0x60)
struct FWuLogInPacketStat : FLogBase {
	struct FString LeagueType; // 0x60(0x10)
	struct FString ModeName; // 0x70(0x10)
	struct FString Name; // 0x80(0x10)
	struct FString AccountId; // 0x90(0x10)
	float ElapsedTimeSec; // 0xa0(0x04)
	int32 NumOutOfOrder; // 0xa4(0x04)
};

// ScriptStruct TslGame.WuLogOutPacketLoss
// Size: 0xd0 (Inherited: 0x60)
struct FWuLogOutPacketLoss : FLogBase {
	struct FString LeagueType; // 0x60(0x10)
	struct FString ModeName; // 0x70(0x10)
	struct FString Name; // 0x80(0x10)
	struct FString AccountId; // 0x90(0x10)
	float ElapsedTimeSec; // 0xa0(0x04)
	int32 NumOutBunch; // 0xa4(0x04)
	int32 NumOutPacket; // 0xa8(0x04)
	int32 NumOutPacketNaked; // 0xac(0x04)
	struct TArray<struct FWuLostPacketData> NakedPacketDataList; // 0xb0(0x10)
	struct TArray<struct FWuLostBunchData> NakedBunchDataList; // 0xc0(0x10)
};

// ScriptStruct TslGame.WuLostBunchData
// Size: 0x18 (Inherited: 0x00)
struct FWuLostBunchData {
	int32 NumSent; // 0x00(0x04)
	int32 NumLoss; // 0x04(0x04)
	struct FString Content; // 0x08(0x10)
};

// ScriptStruct TslGame.WuLostPacketData
// Size: 0x0c (Inherited: 0x00)
struct FWuLostPacketData {
	int32 NumLoss; // 0x00(0x04)
	int32 SizeBitsPlain; // 0x04(0x04)
	int32 SizeBitsEncryped; // 0x08(0x04)
};

// ScriptStruct TslGame.WuLogParachuteFollowReleaseByHoldKey
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogParachuteFollowReleaseByHoldKey : FLogBase {
	struct FWuLogCharacter UserInfo; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogParachuteFollow
// Size: 0x118 (Inherited: 0x60)
struct FWuLogParachuteFollow : FLogBase {
	struct FWuLogCharacter UserInfo; // 0x60(0x90)
	bool IsFollower; // 0xf0(0x01)
	char pad_F1[0x3]; // 0xf1(0x03)
	int32 FollowerNum; // 0xf4(0x04)
	struct FString TargetName; // 0xf8(0x10)
	struct FString ModeName; // 0x108(0x10)
};

// ScriptStruct TslGame.WuLogPlayerMovementBaseChanged
// Size: 0x118 (Inherited: 0x60)
struct FWuLogPlayerMovementBaseChanged : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString NewMovementBase; // 0xf0(0x10)
	struct FString OldMovementBase; // 0x100(0x10)
	float MovedDistance; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
};

// ScriptStruct TslGame.WuLogPlayerScore
// Size: 0x138 (Inherited: 0x60)
struct FWuLogPlayerScore : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 KillScore; // 0xf0(0x04)
	int32 KillCount; // 0xf4(0x04)
	int32 DeathScore; // 0xf8(0x04)
	int32 DeathCount; // 0xfc(0x04)
	int32 AssistScore; // 0x100(0x04)
	int32 AssistCount; // 0x104(0x04)
	int32 ChainKillScore; // 0x108(0x04)
	int32 ChainKillCount; // 0x10c(0x04)
	int32 WinRoundScore; // 0x110(0x04)
	int32 WinRoundCount; // 0x114(0x04)
	int32 DefeatRoundScore; // 0x118(0x04)
	int32 DefeatRoundCount; // 0x11c(0x04)
	int32 WinMatchScore; // 0x120(0x04)
	int32 WinMatchCount; // 0x124(0x04)
	int32 DefeatMatchScore; // 0x128(0x04)
	int32 DefeatMatchCount; // 0x12c(0x04)
	int32 TotalScore; // 0x130(0x04)
	char pad_134[0x4]; // 0x134(0x04)
};

// ScriptStruct TslGame.WuDevLog
// Size: 0x80 (Inherited: 0x60)
struct FWuDevLog : FLogBase {
	struct FString DevLogKey; // 0x60(0x10)
	struct TArray<struct FWuDevLogElement> DevLogs; // 0x70(0x10)
};

// ScriptStruct TslGame.WuDevLogElement
// Size: 0x20 (Inherited: 0x00)
struct FWuDevLogElement {
	struct FString Key; // 0x00(0x10)
	struct FString Value; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLogPlayerHealed
// Size: 0x1a8 (Inherited: 0x60)
struct FWuLogPlayerHealed : FLogBase {
	struct FWuLogCharacter Healer; // 0x60(0x90)
	struct FWuLogCharacter Target; // 0xf0(0x90)
	int32 HealId; // 0x180(0x04)
	float Healamount; // 0x184(0x04)
	struct FString HealCauserName; // 0x188(0x10)
	struct FString HealTypeCategory; // 0x198(0x10)
};

// ScriptStruct TslGame.WuLogPlayerBuffed
// Size: 0x1a8 (Inherited: 0x60)
struct FWuLogPlayerBuffed : FLogBase {
	struct FWuLogCharacter Buffer; // 0x60(0x90)
	struct FWuLogCharacter Target; // 0xf0(0x90)
	int32 BuffId; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
	struct FString BuffCauserName; // 0x188(0x10)
	struct FString BuffType; // 0x198(0x10)
};

// ScriptStruct TslGame.WuLogItemSkillSpawn
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemSkillSpawn : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogCraftResult
// Size: 0x178 (Inherited: 0x60)
struct FWuLogCraftResult : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	bool SUCCESS; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct FString FailedReason; // 0xf8(0x10)
	struct FString CraftItem; // 0x108(0x10)
	struct FWuLogItem ItemResult; // 0x118(0x50)
	struct TArray<struct FWuLogItem> Materials; // 0x168(0x10)
};

// ScriptStruct TslGame.WuLogConnectionTimeOutError
// Size: 0xa0 (Inherited: 0x60)
struct FWuLogConnectionTimeOutError : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	float DriverTime; // 0x70(0x04)
	float Threshold; // 0x74(0x04)
	struct FString RemoteAddress; // 0x78(0x10)
	bool IsServer; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct FString UniqueId; // 0x90(0x10)
};

// ScriptStruct TslGame.WuLogServerInfo
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogServerInfo : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString InstanceId; // 0x70(0x10)
	struct FString PublicIp; // 0x80(0x10)
	struct FString InstanceType; // 0x90(0x10)
	struct FString GameServerVersion; // 0xa0(0x10)
	struct FString Weather; // 0xb0(0x10)
	struct FString MapName; // 0xc0(0x10)
	struct FString StartTimeStamp; // 0xd0(0x10)
	struct FString EndTimeStamp; // 0xe0(0x10)
};

// ScriptStruct TslGame.WuLogPing
// Size: 0xc8 (Inherited: 0x60)
struct FWuLogPing : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString LeagueType; // 0x70(0x10)
	struct FString ModeName; // 0x80(0x10)
	float MissRate; // 0x90(0x04)
	float ReliableDelay; // 0x94(0x04)
	float UnreliableDelay; // 0x98(0x04)
	float ReliableDelayRange; // 0x9c(0x04)
	float UnreliableDelayRange; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FString Nickname; // 0xa8(0x10)
	struct FString AccountId; // 0xb8(0x10)
};

// ScriptStruct TslGame.WuLogNickname
// Size: 0xb0 (Inherited: 0x60)
struct FWuLogNickname : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString PlayerNetId; // 0x70(0x10)
	struct FString Nickname; // 0x80(0x10)
	struct FString Ip; // 0x90(0x10)
	struct FString ClientVersion; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuLogLocationCorrection
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogLocationCorrection : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString AccountId; // 0x70(0x10)
	struct FString PlayerName; // 0x80(0x10)
	float LocDiff; // 0x90(0x04)
	float AllowedDiff; // 0x94(0x04)
	struct FVector Velocity; // 0x98(0x0c)
	float Speed; // 0xa4(0x04)
	struct FString MovementMode; // 0xa8(0x10)
	struct FString CustomMovementMode; // 0xb8(0x10)
	struct FString ClientMovementMode; // 0xc8(0x10)
	struct FString ClientCustomMovementMode; // 0xd8(0x10)
	float Ping; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// ScriptStruct TslGame.WuLogFps
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogFps : FLogBase {
	struct FString MatchId; // 0x60(0x10)
	struct FString LeagueType; // 0x70(0x10)
	struct FString ModeName; // 0x80(0x10)
	int32 ServerFps; // 0x90(0x04)
	int32 AlivePlayers; // 0x94(0x04)
	int32 JoinPlayers; // 0x98(0x04)
	float Duration; // 0x9c(0x04)
	float AvgInBytesPerSecond; // 0xa0(0x04)
	float AvgOutBytesPerSecond; // 0xa4(0x04)
	int32 MaxInBytesPerSecond; // 0xa8(0x04)
	int32 MaxOutBytesPerSecond; // 0xac(0x04)
	float UsedVirtualMemoryMiB; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// ScriptStruct TslGame.WuLogVehicleInteraction
// Size: 0x168 (Inherited: 0x60)
struct FWuLogVehicleInteraction : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	struct FString EventType; // 0x148(0x10)
	struct TArray<struct FWuStringIntPair> EventInfo; // 0x158(0x10)
};

// ScriptStruct TslGame.WuLogObjectInteraction
// Size: 0x120 (Inherited: 0x60)
struct FWuLogObjectInteraction : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString ObjectType; // 0xf0(0x10)
	struct FString ObjectTypeStatus; // 0x100(0x10)
	struct TArray<struct FWuStringIntPair> ObjectTypeAdditionalInfo; // 0x110(0x10)
};

// ScriptStruct TslGame.WuLogFlaregunCalled
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogFlaregunCalled : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	bool IsInWhiteZone; // 0xf0(0x01)
	bool IsCalledSuccessfully; // 0xf1(0x01)
	char pad_F2[0x6]; // 0xf2(0x06)
};

// ScriptStruct TslGame.WuLogPlayerDeath
// Size: 0x110 (Inherited: 0x60)
struct FWuLogPlayerDeath : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct TArray<struct FString> Weapons; // 0xf0(0x10)
	struct TArray<struct FString> Equips; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogXboxUnautorizedDevice
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogXboxUnautorizedDevice : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	int32 KillCount; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogNetDriverError
// Size: 0x70 (Inherited: 0x60)
struct FWuLogNetDriverError : FLogBase {
	struct TArray<struct FWuDdosInfo> Infos; // 0x60(0x10)
};

// ScriptStruct TslGame.WuDdosInfo
// Size: 0x28 (Inherited: 0x00)
struct FWuDdosInfo {
	struct FString ErrorType; // 0x00(0x10)
	struct FString Ip; // 0x10(0x10)
	int32 Port; // 0x20(0x04)
	int32 Count; // 0x24(0x04)
};

// ScriptStruct TslGame.WuLogMissionListOpen
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogMissionListOpen : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogWeaponFireCount
// Size: 0x108 (Inherited: 0x60)
struct FWuLogWeaponFireCount : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString WeaponId; // 0xf0(0x10)
	int32 FireCount; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// ScriptStruct TslGame.WuLogRedZoneEnded
// Size: 0x70 (Inherited: 0x60)
struct FWuLogRedZoneEnded : FLogBase {
	struct TArray<struct FWuLogCharacter> Drivers; // 0x60(0x10)
};

// ScriptStruct TslGame.WuLogParachuteLanding
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogParachuteLanding : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	float Distance; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogObjectDestroy
// Size: 0x110 (Inherited: 0x60)
struct FWuLogObjectDestroy : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString ObjectType; // 0xf0(0x10)
	struct FVector ObjectLocation; // 0x100(0x0c)
	char pad_10C[0x4]; // 0x10c(0x04)
};

// ScriptStruct TslGame.WuLogEmote
// Size: 0x120 (Inherited: 0x60)
struct FWuLogEmote : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString EmoteName; // 0xf0(0x10)
	struct FString EmoteType; // 0x100(0x10)
	struct TArray<struct FWuStringStringPair> AdditionalParameters; // 0x110(0x10)
};

// ScriptStruct TslGame.WuStringStringPair
// Size: 0x20 (Inherited: 0x00)
struct FWuStringStringPair {
	struct FString First; // 0x00(0x10)
	struct FString second; // 0x10(0x10)
};

// ScriptStruct TslGame.WuLogVaultStart
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogVaultStart : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	bool IsLedgeGrab; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
};

// ScriptStruct TslGame.WuLogSkinUpdate
// Size: 0x170 (Inherited: 0x60)
struct FWuLogSkinUpdate : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	struct FString SkinName; // 0x140(0x10)
	struct FString SkinCategory; // 0x150(0x10)
	struct TArray<struct FWuLogItem> PartItems; // 0x160(0x10)
};

// ScriptStruct TslGame.WuLogMovementSpam
// Size: 0x98 (Inherited: 0x60)
struct FWuLogMovementSpam : FLogBase {
	struct FString AttackerId; // 0x60(0x10)
	struct FString VictimId; // 0x70(0x10)
	int32 AttackerLeftLeans; // 0x80(0x04)
	int32 AttackerRightLeans; // 0x84(0x04)
	int32 AttackerCrouches; // 0x88(0x04)
	int32 VictimLeftLeans; // 0x8c(0x04)
	int32 VictimRightLeans; // 0x90(0x04)
	int32 VictimCrouches; // 0x94(0x04)
};

// ScriptStruct TslGame.WuLogStatAccuracy
// Size: 0x78 (Inherited: 0x60)
struct FWuLogStatAccuracy : FLogBase {
	struct FString AccountId; // 0x60(0x10)
	int32 NumShots; // 0x70(0x04)
	int32 NumHits; // 0x74(0x04)
};

// ScriptStruct TslGame.WuLogLoadingFinished
// Size: 0x178 (Inherited: 0x60)
struct FWuLogLoadingFinished : FLogBase {
	struct FString DeviceName; // 0x60(0x10)
	struct FString Timestamp; // 0x70(0x10)
	struct FString MatchId; // 0x80(0x10)
	struct FString ServerName; // 0x90(0x10)
	struct FString ModeName; // 0xa0(0x10)
	struct FString Date; // 0xb0(0x10)
	struct FString State; // 0xc0(0x10)
	int32 LoadingTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct FWuLogCharacter Character; // 0xd8(0x90)
	struct FString ActualHardwareName; // 0x168(0x10)
};

// ScriptStruct TslGame.WuLogFreeMemory
// Size: 0xb0 (Inherited: 0x60)
struct FWuLogFreeMemory : FLogBase {
	struct FString DeviceName; // 0x60(0x10)
	struct FString PlayerNetId; // 0x70(0x10)
	struct FString AccountId; // 0x80(0x10)
	struct TArray<struct FWuMemoryStat> MemoryStats; // 0x90(0x10)
	struct FString ActualHardwareName; // 0xa0(0x10)
};

// ScriptStruct TslGame.WuMemoryStat
// Size: 0x18 (Inherited: 0x00)
struct FWuMemoryStat {
	struct FString Name; // 0x00(0x10)
	float Value; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct TslGame.WuLogMatchSetting
// Size: 0xb8 (Inherited: 0x60)
struct FWuLogMatchSetting : FLogBase {
	bool IsCustomGame; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct FString MapName; // 0x68(0x10)
	struct FString ModeName; // 0x78(0x10)
	struct FString MatchId; // 0x88(0x10)
	int32 TeamCount; // 0x98(0x04)
	int32 MinPlayerCount; // 0x9c(0x04)
	int32 MaxPlayerCount; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct TArray<struct FWuStringStringPair> MatchSettings; // 0xa8(0x10)
};

// ScriptStruct TslGame.WuLogBulletShotDistance
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogBulletShotDistance : FLogBase {
	struct FVector VictimLocation; // 0x60(0x0c)
	struct FVector HitLocation; // 0x6c(0x0c)
	float Distance; // 0x78(0x04)
	bool IsVictimInVehicle; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	float VictimSpeed; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct FString VictimStanceMode; // 0x88(0x10)
	struct FString VictimMovementMode; // 0x98(0x10)
	struct FString AttackerAccountId; // 0xa8(0x10)
	float AttackerPing; // 0xb8(0x04)
	float AttackerRDelay; // 0xbc(0x04)
	float AttackerUDelay; // 0xc0(0x04)
	float AttackerUMissPercent; // 0xc4(0x04)
	struct FString VictimAccountId; // 0xc8(0x10)
	float VictimPing; // 0xd8(0x04)
	float VictimRDelay; // 0xdc(0x04)
	float VictimUDelay; // 0xe0(0x04)
	float VictimUMissPercent; // 0xe4(0x04)
	int32 AttackId; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// ScriptStruct TslGame.WuLogSteamNoNetworkConnection
// Size: 0x88 (Inherited: 0x60)
struct FWuLogSteamNoNetworkConnection : FLogBase {
	int32 DisconnectionCountPerGame; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString SteamKickReason; // 0x68(0x10)
	struct FString AccountId; // 0x78(0x10)
};

// ScriptStruct TslGame.WuLogBodyPenetrationDamageInfo
// Size: 0x110 (Inherited: 0x60)
struct FWuLogBodyPenetrationDamageInfo : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	float DamageDiff; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FString DamageZone; // 0x100(0x10)
};

// ScriptStruct TslGame.WuLogCheat
// Size: 0x138 (Inherited: 0x60)
struct FWuLogCheat : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString CheatType; // 0xf0(0x10)
	struct FString Description; // 0x100(0x10)
	float ParamFloat1; // 0x110(0x04)
	float ParamFloat2; // 0x114(0x04)
	struct FString ParamString1; // 0x118(0x10)
	struct FString ParamString2; // 0x128(0x10)
};

// ScriptStruct TslGame.WuLogSwimEnd
// Size: 0xf8 (Inherited: 0x60)
struct FWuLogSwimEnd : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	float SwimDistance; // 0xf0(0x04)
	float MaxSwimDepthOfWater; // 0xf4(0x04)
};

// ScriptStruct TslGame.WuLogSwimStart
// Size: 0xf0 (Inherited: 0x60)
struct FWuLogSwimStart : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
};

// ScriptStruct TslGame.WuLogWheelDestroy
// Size: 0x178 (Inherited: 0x60)
struct FWuLogWheelDestroy : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogVehicle Vehicle; // 0xf8(0x58)
	int32 WheelIndex; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct FString DamageTypeCategory; // 0x158(0x10)
	struct FString DamageCauserName; // 0x168(0x10)
};

// ScriptStruct TslGame.WuLogVehicleDestroy
// Size: 0x178 (Inherited: 0x60)
struct FWuLogVehicleDestroy : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogVehicle Vehicle; // 0xf8(0x58)
	struct FString DamageTypeCategory; // 0x150(0x10)
	struct FString DamageCauserName; // 0x160(0x10)
	float Distance; // 0x170(0x04)
	char pad_174[0x4]; // 0x174(0x04)
};

// ScriptStruct TslGame.WuLogVehicleDamage
// Size: 0x178 (Inherited: 0x60)
struct FWuLogVehicleDamage : FLogBase {
	int32 AttackId; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FWuLogCharacter Attacker; // 0x68(0x90)
	struct FWuLogVehicle Vehicle; // 0xf8(0x58)
	struct FString DamageTypeCategory; // 0x150(0x10)
	struct FString DamageCauserName; // 0x160(0x10)
	float Damage; // 0x170(0x04)
	float Distance; // 0x174(0x04)
};

// ScriptStruct TslGame.WuLogVehicleLeave
// Size: 0x168 (Inherited: 0x60)
struct FWuLogVehicleLeave : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	float RideDistance; // 0x148(0x04)
	int32 SeatIndex; // 0x14c(0x04)
	float MaxSpeed; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct TArray<struct FWuLogCharacter> FellowPassengers; // 0x158(0x10)
};

// ScriptStruct TslGame.WuLogVehicleRide
// Size: 0x160 (Inherited: 0x60)
struct FWuLogVehicleRide : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogVehicle Vehicle; // 0xf0(0x58)
	int32 SeatIndex; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct TArray<struct FWuLogCharacter> FellowPassengers; // 0x150(0x10)
};

// ScriptStruct TslGame.WuLogVehicleSpawn
// Size: 0x80 (Inherited: 0x60)
struct FWuLogVehicleSpawn : FLogBase {
	struct FString VehicleId; // 0x60(0x10)
	struct FVector Location; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct TslGame.WuLogVehicleAISpawn
// Size: 0xc8 (Inherited: 0x60)
struct FWuLogVehicleAISpawn : FLogBase {
	struct FString SpawnId; // 0x60(0x10)
	struct FWuLogVehicle Vehicle; // 0x70(0x58)
};

// ScriptStruct TslGame.WuLogUseRevivalTransmitter
// Size: 0x88 (Inherited: 0x60)
struct FWuLogUseRevivalTransmitter : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString AccountId; // 0x68(0x10)
	struct FVector UsingPosition; // 0x78(0x0c)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct TslGame.WuLogUseRevivalTower
// Size: 0x80 (Inherited: 0x60)
struct FWuLogUseRevivalTower : FLogBase {
	int32 phase; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString AccountId; // 0x68(0x10)
	bool bIsSuccess; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// ScriptStruct TslGame.WuLogRevivalTowerSpawn
// Size: 0x70 (Inherited: 0x60)
struct FWuLogRevivalTowerSpawn : FLogBase {
	struct FVector SpawnedPosition; // 0x60(0x0c)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// ScriptStruct TslGame.WuLogCarePackageLand
// Size: 0x90 (Inherited: 0x60)
struct FWuLogCarePackageLand : FLogBase {
	struct FWuLogItemPackage ItemPackage; // 0x60(0x30)
};

// ScriptStruct TslGame.WuLogItemPackage
// Size: 0x30 (Inherited: 0x00)
struct FWuLogItemPackage {
	struct FString ItemPackageId; // 0x00(0x10)
	struct FVector Location; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct TArray<struct FWuLogItem> Items; // 0x20(0x10)
};

// ScriptStruct TslGame.WuLogCarePackageSpawn
// Size: 0x90 (Inherited: 0x60)
struct FWuLogCarePackageSpawn : FLogBase {
	struct FWuLogItemPackage ItemPackage; // 0x60(0x30)
};

// ScriptStruct TslGame.WuLogLootTruckPackageSpawn
// Size: 0x178 (Inherited: 0x60)
struct FWuLogLootTruckPackageSpawn : FLogBase {
	struct FWuLogItemPackage ItemPackage; // 0x60(0x30)
	struct FWuLogCharacter Character; // 0x90(0x90)
	struct FWuLogVehicle Vehicle; // 0x120(0x58)
};

// ScriptStruct TslGame.WuLogLanguage
// Size: 0x110 (Inherited: 0x60)
struct FWuLogLanguage : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString WindowsLanguage; // 0xf0(0x10)
	struct FString GameLanguage; // 0x100(0x10)
};

// ScriptStruct TslGame.WuSystemInfo
// Size: 0x240 (Inherited: 0x60)
struct FWuSystemInfo : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FString OsLanguage; // 0xf0(0x10)
	struct FString GameLanguage; // 0x100(0x10)
	struct FString OsVersion; // 0x110(0x10)
	struct FString CpuName; // 0x120(0x10)
	struct FString GpuName; // 0x130(0x10)
	int32 RamInGB; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct FString BaseBoardSerial; // 0x148(0x10)
	struct TArray<struct FString> MemorySerials; // 0x158(0x10)
	int32 ArpIpCount; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
	struct FString OsUserAccount; // 0x170(0x10)
	struct TArray<struct FString> DiskModelNames; // 0x180(0x10)
	struct TArray<struct FString> DiskSerials; // 0x190(0x10)
	struct TArray<struct FString> MonitorModelNames; // 0x1a0(0x10)
	struct TArray<struct FString> MonitorSerials; // 0x1b0(0x10)
	struct TArray<struct FString> MemoryModelNames; // 0x1c0(0x10)
	struct FString BaseBoardModelName; // 0x1d0(0x10)
	struct TArray<struct FString> GatewayMacAddress; // 0x1e0(0x10)
	struct FWuGraphicSettings GraphicSettings; // 0x1f0(0x40)
	struct FString CpuClock; // 0x230(0x10)
};

// ScriptStruct TslGame.WuGraphicSettings
// Size: 0x40 (Inherited: 0x00)
struct FWuGraphicSettings {
	int32 ResolutionWidth; // 0x00(0x04)
	int32 ResolutionHeight; // 0x04(0x04)
	bool VSync; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32 DisplayMode; // 0x0c(0x04)
	int32 FOV; // 0x10(0x04)
	int32 ScreenScale; // 0x14(0x04)
	int32 AntiAliasing; // 0x18(0x04)
	int32 PostProcessing; // 0x1c(0x04)
	int32 Shadows; // 0x20(0x04)
	int32 Textures; // 0x24(0x04)
	int32 Effects; // 0x28(0x04)
	int32 Foliage; // 0x2c(0x04)
	int32 ViewDistance; // 0x30(0x04)
	bool MotionBlur; // 0x34(0x01)
	bool MinimapDynamicZoom; // 0x35(0x01)
	bool FreelockInterpolation; // 0x36(0x01)
	bool Replay; // 0x37(0x01)
	bool DeathCam; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	int32 GraphicsAPI; // 0x3c(0x04)
};

// ScriptStruct TslGame.WuLogHeal
// Size: 0x148 (Inherited: 0x60)
struct FWuLogHeal : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
	float Healamount; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
};

// ScriptStruct TslGame.WuLogEmPickupLiftOff
// Size: 0x110 (Inherited: 0x60)
struct FWuLogEmPickupLiftOff : FLogBase {
	struct FWuLogCharacter Instigator; // 0x60(0x90)
	struct TArray<struct FWuLogCharacter> Riders; // 0xf0(0x10)
	int32 VehicleUniqueId; // 0x100(0x04)
	int32 BlueZonePhase; // 0x104(0x04)
	float DistanceToBluezone; // 0x108(0x04)
	float DistanceToSafezone; // 0x10c(0x04)
};

// ScriptStruct TslGame.WuLogItemThrow
// Size: 0x1d8 (Inherited: 0x60)
struct FWuLogItemThrow : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogCharacter Target; // 0xf0(0x90)
	struct FWuLogItem Item; // 0x180(0x50)
	float Distance; // 0x1d0(0x04)
	bool IsSuccess; // 0x1d4(0x01)
	char pad_1D5[0x3]; // 0x1d5(0x03)
};

// ScriptStruct TslGame.WuLogItemUse
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemUse : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogItemDetach
// Size: 0x190 (Inherited: 0x60)
struct FWuLogItemDetach : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem ParentItem; // 0xf0(0x50)
	struct FWuLogItem ChildItem; // 0x140(0x50)
};

// ScriptStruct TslGame.WuLogItemAttachedAll
// Size: 0x190 (Inherited: 0x60)
struct FWuLogItemAttachedAll : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem ParentItem; // 0xf0(0x50)
	struct FWuLogItem ChildItem; // 0x140(0x50)
};

// ScriptStruct TslGame.WuLogItemAttach
// Size: 0x190 (Inherited: 0x60)
struct FWuLogItemAttach : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem ParentItem; // 0xf0(0x50)
	struct FWuLogItem ChildItem; // 0x140(0x50)
};

// ScriptStruct TslGame.WuLogItemUnequip
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemUnequip : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogItemEquip
// Size: 0x140 (Inherited: 0x60)
struct FWuLogItemEquip : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
};

// ScriptStruct TslGame.WuLogItemDrop
// Size: 0x148 (Inherited: 0x60)
struct FWuLogItemDrop : FLogBase {
	struct FWuLogCharacter Character; // 0x60(0x90)
	struct FWuLogItem Item; // 0xf0(0x50)
