// Enum ChromaSDKPlugin.EChromaSDKStreamStatusEnum
enum class EChromaSDKStreamStatusEnum : uint8 {
	READY,
	AUTHORIZING,
	BROADCASTING,
	WATCHING,
	NOT_AUTHORIZED,
	BROADCAST_DUPLICATE,
	SERVICE_OFFLINE,
	EChromaSDKStreamStatusEnum_MAX,
};

// Enum ChromaSDKPlugin.*1c050da426
enum class *1c050da426 : uint8 {
	*7b0dca353a,
	*ea1dc12c49,
	*57c07715d1,
	*1715b7fc90,
	*869a896c70,
	*9f77a10a81,
	*4ed26802b6,
	*1c050da426_MAX,
};

// Enum ChromaSDKPlugin.*397f666f9d
enum class *397f666f9d : uint8 {
	*8f59841aae,
	*d91e137704,
	*7b9c39b908,
	*1f55513707,
	*3525d88676,
	*397f666f9d_MAX,
};

// Enum ChromaSDKPlugin.*ced23a60ad
enum class *ced23a60ad : uint8 {
	*602d8e1bbd,
	*7c9126cd00,
	*de6ced9c2e,
	*15ab8b3f51,
	*ca39a60280,
	*eb0663a743,
	*b8890ef1cd,
	*577b4ce0e5,
	*ae0396e365,
	*f0c01a6ec8,
	*71b2d6148c,
	*9a221eed31,
	*54a9d9f7c6,
	*cfb91a89e1,
	*230e123653,
	*0f3ebb95f3,
	*adb2ae550d,
	*d460d0c689,
	*84b11c6c24,
	*7cdcae1a15,
	*316ad03b34,
	*377b96a1de,
	*13067472c9,
	*ced23a60ad_MAX,
};

// Enum ChromaSDKPlugin.*78850c97a2
enum class *78850c97a2 : uint8 {
	*a08d3b808c,
	*d7b1e41820,
	*38417d59e9,
	*5728662cf0,
	*c61ee762a7,
	*0302795738,
	*f9de91c472,
	*ccd39e1aaf,
	*62df20031b,
	*2dced12982,
	*2ad4d21dcc,
	*4f382ad489,
	*0ba81d727b,
	*3f843c8028,
	*3bdc86051c,
	*6fb1affce3,
	*0cac2e9c05,
	*0a9c0e8527,
	*04dcb77a67,
	*a8795f34e0,
	*3cca2525c9,
	*a354ee84f5,
	*acf3fab1f7,
	*52e9f687a7,
	*d5a6d84411,
	*2f9f90c308,
	*f72165ded1,
	*6e7d2b20fd,
	*cdf78e79f2,
	*b45e219967,
	*f0f65447d6,
	*97d7a7af4f,
	*888d0d612f,
	*d27bc91e22,
	*98ce1bee18,
	*ea46287d45,
	*972006ffbd,
	*7ad81a7bd9,
	*98fd0c3475,
	*f7d39a5f9d,
	*a2dca98d54,
	*de0a7e5e9d,
	*3da810b96d,
	*0c3c3d9655,
	*c0df145302,
	*c23c748271,
	*c5920744c1,
	*d68dad87c5,
	*7dd47bc83f,
	*b1df0b9d4f,
	*d9965a51d2,
	*235811a15e,
	*155ab6c42a,
	*d38e3f3147,
	*81ca5a8c2f,
	*0d485b4430,
	*c4b0391208,
	*5b2ffbc6ab,
	*168358ac42,
	*132565b716,
	*fd0a0914e3,
	*8ba3b09960,
	*0381f4cd69,
	*de23bdfc73,
	*b9be1db525,
	*8e55964dd3,
	*2199c47b43,
	*ae835719bc,
	*0f1f25b2ba,
	*1b60515f05,
	*6d1133a69b,
	*ee2b984aad,
	*bbba1fd81b,
	*35d754f0b3,
	*492c98d1fc,
	*e73580df77,
	*9b410227d9,
	*66bf888cda,
	*462cd27685,
	*a1b314f207,
	*30d606fd40,
	*b9e458f7f6,
	*fa997dd053,
	*25fa799c57,
	*5f867975e8,
	*497bd8b82e,
	*7c21005dac,
	*f37795ebe9,
	*e3837a2643,
	*b4b76cf7bd,
	*5b13f2bc62,
	*9bcaef4aaa,
	*e4fc5a9bd5,
	*8433adb56d,
	*74866b3011,
	*7ffd2dd694,
	*9e3d0d72b8,
	*46f60fa979,
	*28c6be4e48,
	*1b0d08ba92,
	*ced36ccaf7,
	*4fe76c42c0,
	*da026398fe,
	*c6bc214cb6,
	*c4a497e992,
	*91798be509,
	*ab2e46761c,
	*9e586b9a76,
	*513d87b26b,
	*2b0dc0c36d,
	*ac7790c652,
	*30133c2498,
	*74e161141a,
	*7b8d1166cd,
	*76c76e5d3b,
	*0c38a0d4db,
	*ba7aedd28f,
	*a7e830139f,
	*af352e00cd,
	*013301aa6f,
	*db79ef1f75,
	*81bdfe22ee,
	*a7242f83cd,
	*6520aa522a,
	*9f60b64a81,
	*d22f911d51,
	*78850c97a2_MAX,
};

// Enum ChromaSDKPlugin.*227ee3bcdf
enum class *227ee3bcdf : uint8 {
	*9c84f9c0cf,
	*7a4a01db25,
	*82d437fc73,
	*817dc6f904,
	*9d8e1dfb38,
	*3537760e82,
	*f822a1bb2f,
	*227ee3bcdf_MAX,
};

// Enum ChromaSDKPlugin.*54b724a622
enum class *54b724a622 : uint8 {
	*82d437fc73,
	*817dc6f904,
	*9d8e1dfb38,
	*f822a1bb2f,
	*54b724a622_MAX,
};

// Enum ChromaSDKPlugin.*877f8f0164
enum class *877f8f0164 : uint8 {
	*9c84f9c0cf,
	*7a4a01db25,
	*3537760e82,
	*f822a1bb2f,
	*877f8f0164_MAX,
};

// Enum ChromaSDKPlugin.*dd877f1da6
enum class *dd877f1da6 : uint8 {
	*74d0c402d1,
	*cb69c4adfb,
	*f822a1bb2f,
	*dd877f1da6_MAX,
};

// ScriptStruct ChromaSDKPlugin.*84e35b177a
// Size: 0x10 (Inherited: 0x00)
struct F*84e35b177a {
	struct TArray<struct F*eb8f8f9479> Effects; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*eb8f8f9479
// Size: 0x38 (Inherited: 0x00)
struct F*eb8f8f9479 {
	struct FString Animation; // 0x00(0x10)
	bool State; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 PrimaryColor; // 0x14(0x04)
	int32 SecondaryColor; // 0x18(0x04)
	int32 Speed; // 0x1c(0x04)
	enum class *397f666f9d Blend; // 0x20(0x01)
	enum class *1c050da426 Mode; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct F*47046a3a7b FrameIndex; // 0x28(0x10)
};

// ScriptStruct ChromaSDKPlugin.*47046a3a7b
// Size: 0x10 (Inherited: 0x00)
struct F*47046a3a7b {
	struct TArray<int32> *31a9a07258; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*aeb05e0708
// Size: 0x48 (Inherited: 0x00)
struct F*aeb05e0708 {
	struct FString Title; // 0x00(0x10)
	struct FString Description; // 0x10(0x10)
	struct FString *341f0f46ec; // 0x20(0x10)
	struct FString *d68651a8df; // 0x30(0x10)
	int32 *730f22b6a6; // 0x40(0x04)
	int32 Category; // 0x44(0x04)
};

// ScriptStruct ChromaSDKPlugin.*a3eae4927e
// Size: 0x18 (Inherited: 0x00)
struct F*a3eae4927e {
	struct TArray<struct F*2ea49bc14a> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*2ea49bc14a
// Size: 0x10 (Inherited: 0x00)
struct F*2ea49bc14a {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*c67d87ab64
// Size: 0x18 (Inherited: 0x00)
struct F*c67d87ab64 {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*2ec0de6acb
// Size: 0x14 (Inherited: 0x00)
struct F*2ec0de6acb {
	int32 Result; // 0x00(0x04)
	struct F*ec21954049 EffectId; // 0x04(0x10)
};

// ScriptStruct ChromaSDKPlugin.*ec21954049
// Size: 0x10 (Inherited: 0x00)
struct F*ec21954049 {
	char pad_0[0x10]; // 0x00(0x10)
};

