// Class Engine.Actor
// Size: 0x3e8 (Inherited: 0x28)
struct AActor : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x38(0x10)
	char pad_48[0x4]; // 0x48(0x04)
	char pad_4C_0 : 3; // 0x4c(0x01)
	char *ee7fa09f2a : 1; // 0x4c(0x01)
	char pad_4C_4 : 4; // 0x4c(0x01)
	char pad_4D_0 : 1; // 0x4d(0x01)
	char *1c1a603df8 : 1; // 0x4d(0x01)
	char bReplicates : 1; // 0x4d(0x01)
	char pad_4D_3 : 5; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	struct FName *9736d97f72; // 0x50(0x08)
	enum class ENetRole RemoteRole; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct AActor* Owner; // 0x60(0x08)
	struct FRepMovement ReplicatedMovement; // 0x68(0x34)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct F*e12fd4230c *71a4a5335d; // 0xa0(0x40)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	struct UChildActorComponent* *02788983e3; // 0xe4(0x08)
	char pad_EC[0x4]; // 0xec(0x04)
	struct FMulticastDelegate OnInputTouchEnd; // 0xf0(0x10)
	char bHidden : 1; // 0x100(0x01)
	char *203daa4969 : 1; // 0x100(0x01)
	char *ef18b22ab3 : 1; // 0x100(0x01)
	char bOnlyRelevantToOwner : 1; // 0x100(0x01)
	char bAlwaysRelevant : 1; // 0x100(0x01)
	char *8ba71f2430 : 1; // 0x100(0x01)
	char *c488fcabdb : 1; // 0x100(0x01)
	char *95a7dbac35 : 1; // 0x100(0x01)
	char *d360431085 : 1; // 0x101(0x01)
	char pad_101_1 : 1; // 0x101(0x01)
	char *0a42a36656 : 1; // 0x101(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x101(0x01)
	char *296d657336 : 1; // 0x101(0x01)
	char pad_101_5 : 1; // 0x101(0x01)
	char *73eeec1e6d : 1; // 0x101(0x01)
	char pad_101_7 : 1; // 0x101(0x01)
	char pad_102[0x2]; // 0x102(0x02)
	int32 *bb4531cf18; // 0x104(0x04)
	struct FMulticastDelegate OnEndCursorOver; // 0x108(0x10)
	struct TArray<struct AMatineeActor*> *342408205b; // 0x118(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x128(0x01)
	char bCanBeDamaged : 1; // 0x128(0x01)
	char *e5601844d6 : 1; // 0x128(0x01)
	char *f334832ed0 : 1; // 0x128(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x128(0x01)
	char *157511b45d : 1; // 0x128(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x128(0x01)
	char *13e484c425 : 1; // 0x128(0x01)
	char *6afb884530 : 1; // 0x129(0x01)
	char pad_129_1 : 7; // 0x129(0x01)
	char pad_12A[0x6]; // 0x12a(0x06)
	struct TArray<struct FName> Layers; // 0x130(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x140(0x10)
	char *e88d5f0d04 : 1; // 0x150(0x01)
	char pad_150_1 : 4; // 0x150(0x01)
	char *fa37ec8795 : 1; // 0x150(0x01)
	char *546a2c1ba4 : 1; // 0x150(0x01)
	char *9c48e84b30 : 1; // 0x150(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x151(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x152(0x01)
	char pad_153[0x55]; // 0x153(0x55)
	struct FMulticastDelegate OnReleased; // 0x1a8(0x10)
	float NetPriority; // 0x1b8(0x04)
	char pad_1BC[0xc]; // 0x1bc(0x0c)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x1c8(0x10)
	struct AActor* ParentComponentActor; // 0x1d8(0x08)
	float NetCullDistanceSquared; // 0x1e0(0x04)
	char pad_1E4[0x4]; // 0x1e4(0x04)
	struct USceneComponent* RootComponent; // 0x1e8(0x08)
	struct U*37a897c2a6* *37a897c2a6; // 0x1f0(0x08)
	char pad_1F8[0x50]; // 0x1f8(0x50)
	struct FMulticastDelegate OnTakePointDamage; // 0x248(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x258(0x10)
	enum class *3d79023269 InputConsumeOption; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x270(0x10)
	struct TArray<struct FName> Tags; // 0x280(0x10)
	struct APawn* Instigator; // 0x290(0x08)
	float InitialLifeSpan; // 0x298(0x04)
	struct FGuid DestructibleId; // 0x29c(0x10)
	bool bIsDestroyedVersion; // 0x2ac(0x01)
	bool RemoveFromLevelLOD; // 0x2ad(0x01)
	char pad_2AE[0x2]; // 0x2ae(0x02)
	struct F*0a81d45cd1 PrimaryActorTick; // 0x2b0(0x58)
	char pad_308[0x10]; // 0x308(0x10)
	float NetUpdateFrequency; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x320(0x10)
	struct FMulticastDelegate OnActorHit; // 0x330(0x10)
	struct TArray<struct AActor*> Children; // 0x340(0x10)
	char pad_350[0x4]; // 0x350(0x04)
	int32 *72feb06886; // 0x354(0x04)
	struct FMulticastDelegate OnClicked; // 0x358(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x368(0x10)
	uint64 *3b8b1d07eb; // 0x378(0x08)
	float MinNetUpdateFrequency; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct FMulticastDelegate OnInputTouchEnter; // 0x388(0x10)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x398(0x10)
	enum class EAutoReceiveInput *63eb2f6239; // 0x3a8(0x01)
	char pad_3A9[0x7]; // 0x3a9(0x07)
	struct FMulticastDelegate OnDestroyed; // 0x3b0(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3c0(0x10)
	char pad_3D0[0x2]; // 0x3d0(0x02)
	enum class ENetRole Role; // 0x3d2(0x01)
	char pad_3D3[0x1]; // 0x3d3(0x01)
	float CustomTimeDilation; // 0x3d4(0x04)
	float *87e93a3748; // 0x3d8(0x04)
	char pad_3DC[0xc]; // 0x3dc(0x0c)

	void *0128a55b1c(); // Function Engine.Actor.*0128a55b1c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddd18
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e8d14
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x32e590
	struct AActor* *a681358bc4(); // Function Engine.Actor.*a681358bc4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfd44
	void *61de3812ee(); // Function Engine.Actor.*61de3812ee // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddcf0
	void ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x32e590
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e8904
	void *1271c83ac5(); // Function Engine.Actor.*1271c83ac5 // Native|Public|BlueprintCallable // @ game+0x64ec58c
	void *2bb0c747eb(); // Function Engine.Actor.*2bb0c747eb // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x64dd550
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x32e590
	void *4a0e7bcfa3(); // Function Engine.Actor.*4a0e7bcfa3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddb8c
	struct FRotator K2_AddActorLocalRotation(bool bSweep); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e5310
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x9e27d8
	bool K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e9118
	void *b759798186(); // Function Engine.Actor.*b759798186 // Native|Public|BlueprintCallable // @ game+0x64ec464
	void *39323dc533(); // Function Engine.Actor.*39323dc533 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2abc
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x32e590
	void K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x32e590
	void *39298590ca(); // Function Engine.Actor.*39298590ca // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e199c
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xa54f24
	void *29508a4bf2(); // Function Engine.Actor.*29508a4bf2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4480
	bool K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xb6c170
	struct AActor* *a6118fe2c0(); // Function Engine.Actor.*a6118fe2c0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0a80
	void K2_SetActorRelativeLocation(bool bSweep); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e8b3c
	struct FKey *7cd9bf7d62(); // Function Engine.Actor.*7cd9bf7d62 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0fbc
	void *c47d432c57(); // Function Engine.Actor.*c47d432c57 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd90c
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e5714
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0x881c50
	void *c92feec516(); // Function Engine.Actor.*c92feec516 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2a98
	void *55f16db019(); // Function Engine.Actor.*55f16db019 // Final|Native|Public|BlueprintCallable // @ game+0x64e399c
	void *cc2ec62328(); // Function Engine.Actor.*cc2ec62328 // Final|Native|Public|BlueprintCallable // @ game+0x64f5588
	enum class EAttachmentRule *79d6ce8944(); // Function Engine.Actor.*79d6ce8944 // Final|Native|Public|BlueprintCallable // @ game+0x738194
	float ReceivePointDamage(struct U*f23bfe8a1c* DamageType, struct FVector HitNormal, struct FName BoneName, struct AController* InstigatedBy); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x32e590
	struct AController* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x32e590
	void *2ba131945a(); // Function Engine.Actor.*2ba131945a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e18d4
	struct FHitResult K2_AddActorWorldRotation(struct FRotator DeltaRotation); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e58ec
	struct FName *91098873e6(); // Function Engine.Actor.*91098873e6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e10b0
	void K2_SetActorLocation(bool bSweep, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e8720
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xb02434
	enum class EAttachmentRule *3989b8b937(enum class EAttachmentRule RotationRule); // Function Engine.Actor.*3989b8b937 // Final|Native|Public|BlueprintCallable // @ game+0x64e70c0
	void *1aee2325a9(); // Function Engine.Actor.*1aee2325a9 // Final|Native|Public|BlueprintCallable // @ game+0x64ea990
	struct FHitResult K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e5ac4
	void *bd080aece3(struct AActor* OtherActor); // Function Engine.Actor.*bd080aece3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfde4
	void *b895bffb9a(); // Function Engine.Actor.*b895bffb9a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4518
	struct UClass* *d59794b83e(); // Function Engine.Actor.*d59794b83e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df43c
	void *714237daa5(); // Function Engine.Actor.*714237daa5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2a10
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x75a0f4
	void *e7e17038d8(); // Function Engine.Actor.*e7e17038d8 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64efaec
	struct FKey *7d96186e34(); // Function Engine.Actor.*7d96186e34 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e16cc
	void *7a8a6dd052(); // Function Engine.Actor.*7a8a6dd052 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64de2f4
	void *925fe8d3ea(); // Function Engine.Actor.*925fe8d3ea // Native|Public|BlueprintCallable // @ game+0x64f5020
	void *fff52e4054(); // Function Engine.Actor.*fff52e4054 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3e1c
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x32e590
	void SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x64efb8c
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector BoxExtent); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd764
	struct FVector *c04bf37fb1(); // Function Engine.Actor.*c04bf37fb1 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd934
	void *9b7475c7cd(struct TArray<struct AActor*> ChildActors); // Function Engine.Actor.*9b7475c7cd // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64de0b8
	void *b559cd5bb6(); // Function Engine.Actor.*b559cd5bb6 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x64f50b8
	struct FVector ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x32e590
	void *3e6eb6bf5c(); // Function Engine.Actor.*3e6eb6bf5c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x64dff8c
	void *106e09f070(struct FVector DestLocation); // Function Engine.Actor.*106e09f070 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ea358
	struct AActor* *586623e9e7(); // Function Engine.Actor.*586623e9e7 // Final|Native|Public|BlueprintCallable // @ game+0x64f67f0
	void MakeNoise(float Loudness, struct FVector NoiseLocation); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64eaa0c
	void *2c4afd0cc9(); // Function Engine.Actor.*2c4afd0cc9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddca4
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x32e590
	void *d0599f9969(); // Function Engine.Actor.*d0599f9969 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3210
	struct AController* ReceiveRadialDamage(struct U*f23bfe8a1c* DamageType); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x32e590
	void *b979e02c0b(); // Function Engine.Actor.*b979e02c0b // Native|Public|BlueprintCallable // @ game+0x64f74f8
	void *4b8ae6f2a5(); // Function Engine.Actor.*4b8ae6f2a5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e18ec
	void K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x32e590
	void *7650e89956(); // Function Engine.Actor.*7650e89956 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4464
	void ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x32e590
	void *4018d0c632(); // Function Engine.Actor.*4018d0c632 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dda40
	void *4f65c06a84(); // Function Engine.Actor.*4f65c06a84 // Final|Native|Public|BlueprintCallable // @ game+0x64f56a0
	void *486c8ab3b8(); // Function Engine.Actor.*486c8ab3b8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7bd8
	struct UObject* AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xa755e8
	void AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x64d66e8
	void ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x32e590
	void SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x64f43b8
	enum class EAttachLocation K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x64e6dc0
	void *1584fc199d(); // Function Engine.Actor.*1584fc199d // Native|Public|BlueprintCallable // @ game+0x64d6810
	void *908e613f2a(); // Function Engine.Actor.*908e613f2a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64f7bc0
	struct FName ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d4a50
	void *53ba01cd9c(struct AActor* OtherActor); // Function Engine.Actor.*53ba01cd9c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e09e0
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x32e590
	void *e5d0e7e401(); // Function Engine.Actor.*e5d0e7e401 // Final|Native|Public|BlueprintCallable // @ game+0x64ef750
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x64dd564
	void *737d73e961(); // Function Engine.Actor.*737d73e961 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddb58
	void *81b4039d6c(); // Function Engine.Actor.*81b4039d6c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de28c
	void *7148b110dc(); // Function Engine.Actor.*7148b110dc // Native|Public|BlueprintCallable // @ game+0x5eaadfc
	void *ba856be1c7(); // Function Engine.Actor.*ba856be1c7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de2b0
	void *2c9921815b(); // Function Engine.Actor.*2c9921815b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e8058
	void *a743e7718b(); // Function Engine.Actor.*a743e7718b // Native|Public|BlueprintCallable // @ game+0xb59f3c
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x64db5b4
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3de4
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x6c7c30
	struct FHitResult K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e8eec
	void K2_AddActorLocalTransform(bool bSweep); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e54e8
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x64ef7e8
	struct UClass* *765007f9fa(); // Function Engine.Actor.*765007f9fa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df534
	void K2_AttachRootComponentTo(enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x64e6c40
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x32e590
	enum class *90c9408cc7 *0f5dc47999(enum class *90c9408cc7 RotationRule); // Function Engine.Actor.*0f5dc47999 // Final|Native|Public|BlueprintCallable // @ game+0x64e7868
	struct FHitResult K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e5138
	void DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x64db520
	void *47d2b9df79(); // Function Engine.Actor.*47d2b9df79 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df624
	void GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2880
	void GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xa842a8
	void *1374553f9f(); // Function Engine.Actor.*1374553f9f // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64efa4c
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x32e590
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2620
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x64e7700
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xaa9884
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7c90
	void *e67787df0d(); // Function Engine.Actor.*e67787df0d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4c4c
	void ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x32e590
	struct AActor* *34262bebc8(); // Function Engine.Actor.*34262bebc8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e36d0
	void *9b88d7e8d4(); // Function Engine.Actor.*9b88d7e8d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddcd8
	void *e9a85fdb39(); // Function Engine.Actor.*e9a85fdb39 // Final|Native|Public|BlueprintCallable // @ game+0x64efc20
	void *54a0becbfe(); // Function Engine.Actor.*54a0becbfe // Final|Native|Public|BlueprintCallable // @ game+0x64e7718
};

// Class Engine.AnimInstance
// Size: 0x3a0 (Inherited: 0x28)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct USkeleton* *00f1a04d93; // 0x30(0x08)
	enum class *bad4eeba2c *64d499977d; // 0x38(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x39(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x3a(0x01)
	bool *19654fcffc; // 0x3b(0x01)
	bool bWarnAboutBlueprintUsage; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x40(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x50(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x60(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x70(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x80(0x10)
	char pad_90[0x60]; // 0x90(0x60)
	bool *b2f6e14773; // 0xf0(0x01)
	char pad_F1[0x9f]; // 0xf1(0x9f)
	struct TArray<struct FAnimNotifyEvent> *d4944da090; // 0x190(0x10)
	char pad_1A0[0x200]; // 0x1a0(0x200)

	int32 GetStateWeight(); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651d850
	struct UAnimMontage* *8b2dbddc42(); // Function Engine.AnimInstance.*8b2dbddc42 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652dbb4
	void GetAnimAssetPlayerTimeFromEnd(struct UAnimationAsset* AnimAsset); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65148d8
	struct FName *b00a4c6977(); // Function Engine.AnimInstance.*b00a4c6977 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x4a31a4
	int32 *1b44e35344(); // Function Engine.AnimInstance.*1b44e35344 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651bc78
	void *1e685b1c44(); // Function Engine.AnimInstance.*1e685b1c44 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6515fb8
	int32 *576eca5fe6(); // Function Engine.AnimInstance.*576eca5fe6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x9ec4bc
	struct FName *fc5123822e(); // Function Engine.AnimInstance.*fc5123822e // Native|Public|BlueprintCallable // @ game+0x4a3020
	void *a508d5065e(); // Function Engine.AnimInstance.*a508d5065e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6529688
	void *0afc1c441a(int32 TransitionIndex); // Function Engine.AnimInstance.*0afc1c441a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6518e98
	struct UAnimMontage* *d975dc291b(); // Function Engine.AnimInstance.*d975dc291b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb50f5c
	int32 *642b0d689d(); // Function Engine.AnimInstance.*642b0d689d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65186d0
	void *55851ebd85(struct FName InSyncGroupName, struct FName NextMarker); // Function Engine.AnimInstance.*55851ebd85 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6523cdc
	void BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x32e590
	struct UAnimMontage* Montage_Play(enum class EMontagePlayReturnType ReturnValueType); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x46aaa0
	struct FName *09b1e8fd25(); // Function Engine.AnimInstance.*09b1e8fd25 // Final|Native|Public|BlueprintCallable // @ game+0x652ded0
	int32 GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65163a0
	void *d20b45d812(); // Function Engine.AnimInstance.*d20b45d812 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652db14
	void *a5725955ed(struct FName SlotNodeName); // Function Engine.AnimInstance.*a5725955ed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6523754
	void *21224e4f15(); // Function Engine.AnimInstance.*21224e4f15 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xaf3f34
	struct UAnimationAsset* GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6514764
	void *2fd908ba89(); // Function Engine.AnimInstance.*2fd908ba89 // Final|Native|Public|BlueprintCallable // @ game+0x6541a18
	int32 *4625570d97(); // Function Engine.AnimInstance.*4625570d97 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651bf68
	void *39e1d97951(); // Function Engine.AnimInstance.*39e1d97951 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x65498c4
	void *7b42284f1f(struct FVector Velocity); // Function Engine.AnimInstance.*7b42284f1f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6506054
	void *4aa8d6f78e(int32 AssetPlayerIndex); // Function Engine.AnimInstance.*4aa8d6f78e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x9ec2e4
	struct UAnimMontage* *ddf1ff6163(); // Function Engine.AnimInstance.*ddf1ff6163 // Final|Native|Public|BlueprintCallable // @ game+0x652e0cc
	struct UAnimSequenceBase* PlaySlotAnimationAsDynamicMontage(struct FName SlotNodeName, float BlendOutTime, int32 LoopCount, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x6531de0
	struct UAnimMontage* *e145e83604(); // Function Engine.AnimInstance.*e145e83604 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652dc50
	int32 *17d24ff813(int32 StateIndex); // Function Engine.AnimInstance.*17d24ff813 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x469978
	void *ede2013dc0(int32 MachineIndex); // Function Engine.AnimInstance.*ede2013dc0 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65190a0
	void *67800d693e(); // Function Engine.AnimInstance.*67800d693e // Final|Native|Public|BlueprintCallable // @ game+0x6543834
	struct UAnimMontage* *56658b7153(); // Function Engine.AnimInstance.*56658b7153 // Final|Native|Public|BlueprintCallable // @ game+0x652e1ac
	void PlaySlotAnimation(struct UAnimSequenceBase* Asset, float BlendInTime, float InPlayRate); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x6531bbc
	int32 *0979216d6d(); // Function Engine.AnimInstance.*0979216d6d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65192a0
	void *0af7b6e222(); // Function Engine.AnimInstance.*0af7b6e222 // Final|Native|Public|BlueprintCallable // @ game+0x654e884
	void *0da90049a4(); // Function Engine.AnimInstance.*0da90049a4 // Native|Public|BlueprintCallable // @ game+0x6e64b8
	float *d40af44efc(); // Function Engine.AnimInstance.*d40af44efc // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651e3b4
	void *5f792f1e89(struct UAnimMontage* Montage); // Function Engine.AnimInstance.*5f792f1e89 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652dd90
	void *0f4214a44c(); // Function Engine.AnimInstance.*0f4214a44c // Native|Public|BlueprintCallable // @ game+0x6536c64
	float GetAnimAssetPlayerTimeFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x65147f8
	int32 *a3d96e72ea(); // Function Engine.AnimInstance.*a3d96e72ea // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651be80
	void *507b3ae08c(); // Function Engine.AnimInstance.*507b3ae08c // Final|Native|Public|BlueprintCallable // @ game+0x652e03c
	void *d1802716c0(); // Function Engine.AnimInstance.*d1802716c0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651adb0
	struct FName *427acd4368(); // Function Engine.AnimInstance.*427acd4368 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65216e8
	void *8d25a2b336(int32 AssetPlayerIndex); // Function Engine.AnimInstance.*8d25a2b336 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6518500
	void GetAnimAssetPlayerTimeFromEndFraction(struct UAnimationAsset* AnimAsset); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x65149dc
	int32 *97675e998b(); // Function Engine.AnimInstance.*97675e998b // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6518348
	int32 *74e6c97aea(); // Function Engine.AnimInstance.*74e6c97aea // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6516440
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x32e590
	void *7f10900457(); // Function Engine.AnimInstance.*7f10900457 // Final|Native|Public|BlueprintCallable // @ game+0x65092fc
	void *f24a483c94(); // Function Engine.AnimInstance.*f24a483c94 // Final|Native|Public|BlueprintCallable // @ game+0x652dfac
	struct UAnimMontage* *aacf4df222(); // Function Engine.AnimInstance.*aacf4df222 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652dcf0
	void *ffaf42859e(int32 AssetPlayerIndex); // Function Engine.AnimInstance.*ffaf42859e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651817c
	void *7bf1dbb0b1(bool bLockMovement); // Function Engine.AnimInstance.*7bf1dbb0b1 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6529688
	void *47f249075c(); // Function Engine.AnimInstance.*47f249075c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65505cc
	struct FName *e8c2c21ba8(); // Function Engine.AnimInstance.*e8c2c21ba8 // Native|Public|BlueprintCallable // @ game+0x57efe38
	void *445a0d40ab(int32 MachineIndex); // Function Engine.AnimInstance.*445a0d40ab // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x65189b8
	void *aa1433683b(struct UAnimMontage* Montage); // Function Engine.AnimInstance.*aa1433683b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652de30
	struct FName *5c70e4f6eb(); // Function Engine.AnimInstance.*5c70e4f6eb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651dd04
	int32 *7a139bbc29(int32 StateIndex); // Function Engine.AnimInstance.*7a139bbc29 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x46cfe0
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x32e590
	void *925ceab1f2(); // Function Engine.AnimInstance.*925ceab1f2 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6517fb0
	void *12bd0b8eee(); // Function Engine.AnimInstance.*12bd0b8eee // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6523010
};

// Class Engine.ActorComponent
// Size: 0x1f0 (Inherited: 0x28)
struct UActorComponent : UObject {
	char pad_28[0xe8]; // 0x28(0xe8)
	struct F*4325a9ec93 PrimaryComponentTick; // 0x110(0x58)
	struct TArray<struct FName> ComponentTags; // 0x168(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x178(0x10)
	char pad_188_0 : 3; // 0x188(0x01)
	char bReplicates : 1; // 0x188(0x01)
	char bNetAddressable : 1; // 0x188(0x01)
	char *e1ab54f0d0 : 1; // 0x188(0x01)
	char pad_188_6 : 2; // 0x188(0x01)
	char pad_189[0x1]; // 0x189(0x01)
	char pad_18A_0 : 2; // 0x18a(0x01)
	char bCreatedByConstructionScript : 1; // 0x18a(0x01)
	char bInstanceComponent : 1; // 0x18a(0x01)
	char bAutoActivate : 1; // 0x18a(0x01)
	char *bdff81749e : 1; // 0x18a(0x01)
	char *9049ba6b33 : 1; // 0x18a(0x01)
	char pad_18A_7 : 1; // 0x18a(0x01)
	char pad_18B[0x1]; // 0x18b(0x01)
	struct FGuid DestructibleId; // 0x18c(0x10)
	bool bIsDestroyedVersion; // 0x19c(0x01)
	char pad_19D[0x3]; // 0x19d(0x03)
	char *74755571f4 : 1; // 0x1a0(0x01)
	char pad_1A0_1 : 2; // 0x1a0(0x01)
	char bIsEditorOnly : 1; // 0x1a0(0x01)
	char pad_1A0_4 : 4; // 0x1a0(0x01)
	char pad_1A1[0x4]; // 0x1a1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1a5(0x01)
	enum class EPendingCreationType *c62b495b2d; // 0x1a6(0x01)
	char pad_1A7[0x9]; // 0x1a7(0x09)
	struct TArray<struct FSimpleMemberReference> *7a3c8367fe; // 0x1b0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1d0(0x10)
	char pad_1E0[0x9]; // 0x1e0(0x09)
	char *1c1a603df8 : 1; // 0x1e9(0x01)
	char pad_1E9_1 : 7; // 0x1e9(0x01)
	char pad_1EA[0x6]; // 0x1ea(0x06)

	struct FName *576122409c(); // Function Engine.ActorComponent.*576122409c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64da59c
	void IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e443c
	void Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xbaaa38
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x32e590
	void *2b6de5a619(); // Function Engine.ActorComponent.*2b6de5a619 // Final|Native|Public|BlueprintCallable // @ game+0x64f1ea0
	void *33759e78a8(); // Function Engine.ActorComponent.*33759e78a8 // Final|Native|Public|BlueprintCallable // @ game+0x64f343c
	void *4c6494a5d4(); // Function Engine.ActorComponent.*4c6494a5d4 // Native|Public|BlueprintCallable // @ game+0x5f8ec24
	void *00bf4cdabe(); // Function Engine.ActorComponent.*00bf4cdabe // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df4e4
	void *714237daa5(); // Function Engine.ActorComponent.*714237daa5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xaa90cc
	void *c791c9d07e(); // Function Engine.ActorComponent.*c791c9d07e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e44fc
	void ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x32e590
	void *cc2ec62328(); // Function Engine.ActorComponent.*cc2ec62328 // Final|Native|Public|BlueprintCallable // @ game+0x64f5614
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0xaef910
	bool *e1b93fda8a(); // Function Engine.ActorComponent.*e1b93fda8a // Native|Public|BlueprintCallable // @ game+0x64ef65c
	void ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x32e590
	void *54a0becbfe(); // Function Engine.ActorComponent.*54a0becbfe // Final|Native|Public|BlueprintCallable // @ game+0x64e77b0
	void *4f65c06a84(); // Function Engine.ActorComponent.*4f65c06a84 // Final|Native|Public|BlueprintCallable // @ game+0x64f5738
	void *b759798186(); // Function Engine.ActorComponent.*b759798186 // Native|Public|BlueprintCallable // @ game+0x64ec4f8
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x64eaf6c
	void AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x64d677c
	void *61043d392b(); // Function Engine.ActorComponent.*61043d392b // Native|Public|BlueprintCallable // @ game+0x64f0254
	void *e2e0972c8e(); // Function Engine.ActorComponent.*e2e0972c8e // Native|Public|BlueprintCallable // @ game+0x64f1e08
	void *1271c83ac5(); // Function Engine.ActorComponent.*1271c83ac5 // Native|Public|BlueprintCallable // @ game+0x64ec620
	void *f755d02be8(); // Function Engine.ActorComponent.*f755d02be8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4608
	void *1584fc199d(); // Function Engine.ActorComponent.*1584fc199d // Native|Public|BlueprintCallable // @ game+0x64d68a4
};

// Class Engine.Pawn
// Size: 0x450 (Inherited: 0x3e8)
struct APawn : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	char bUseControllerRotationPitch : 1; // 0x3f0(0x01)
	char bUseControllerRotationYaw : 1; // 0x3f0(0x01)
	char bUseControllerRotationRoll : 1; // 0x3f0(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x3f0(0x01)
	char pad_3F0_4 : 4; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	float BaseEyeHeight; // 0x3f4(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x3f8(0x01)
	enum class EAutoPossessAI *80f545fe29; // 0x3f9(0x01)
	char pad_3FA[0x6]; // 0x3fa(0x06)
	struct UClass* AIControllerClass; // 0x400(0x08)
	uint16 *1fbcce05c7; // 0x408(0x02)
	char pad_40A[0x6]; // 0x40a(0x06)
	struct AController* Controller; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct AController* *771ed191dc; // 0x420(0x08)
	struct APlayerState* PlayerState; // 0x428(0x08)
	char pad_430[0x4]; // 0x430(0x04)
	struct FVector *7e7ad45e69; // 0x434(0x0c)
	struct FVector *3b712bd90f; // 0x440(0x0c)
	char pad_44C[0x4]; // 0x44c(0x04)

	void *9f69700260(struct FVector NoiseLocation); // Function Engine.Pawn.*9f69700260 // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64eb1e0
	void *d8774202a5(); // Function Engine.Pawn.*d8774202a5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57aee60
	void GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df7d0
	void *710294f579(); // Function Engine.Pawn.*710294f579 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64da9b4
	void AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x64d4cd8
	void *abdc1da901(); // Function Engine.Pawn.*abdc1da901 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb15d3c
	void *98a6e6af0b(); // Function Engine.Pawn.*98a6e6af0b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2d54
	bool *b6c21f1d01(); // Function Engine.Pawn.*b6c21f1d01 // Final|Native|Public|BlueprintCallable // @ game+0x64f12e4
	void *ae94aa4833(bool bXYOverride); // Function Engine.Pawn.*ae94aa4833 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ea5b0
	void AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x64d4d74
	void K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2d54
	void *5062f1e06a(); // Function Engine.Pawn.*5062f1e06a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x577d238
	void ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x32e590
	void *85f4ccf8cf(); // Function Engine.Pawn.*85f4ccf8cf // Native|Public|BlueprintCallable // @ game+0x5778b00
	void GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64df79c
	float *bd818f4eae(); // Function Engine.Pawn.*bd818f4eae // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5f04
	void AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x64d4e10
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x50e27c
	struct APawn* *b6654ecead(); // Function Engine.Pawn.*b6654ecead // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x64e20f8
	void *05c9ee399f(); // Function Engine.Pawn.*05c9ee399f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4bd4
	void *5b6826bae8(); // Function Engine.Pawn.*5b6826bae8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4634
	void *01e8ed425d(); // Function Engine.Pawn.*01e8ed425d // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de3dc
	void *f994a202e6(); // Function Engine.Pawn.*f994a202e6 // Native|Public|BlueprintCallable // @ game+0x64f69d4
	void ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x32e590
	void *7446c37470(); // Function Engine.Pawn.*7446c37470 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2230
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0x846408
	void *cf0a44c8b8(); // Function Engine.Pawn.*cf0a44c8b8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1974
};

// Class Engine.DataAsset
// Size: 0x30 (Inherited: 0x28)
struct UDataAsset : UObject {
	struct UClass* *a8f9540798; // 0x28(0x08)
};

// Class Engine.SceneComponent
// Size: 0x460 (Inherited: 0x1f0)
struct USceneComponent : UActorComponent {
	struct FName *d0cdbdd0fa; // 0x1f0(0x08)
	enum class *40da61f0d8 DetailMode; // 0x1f8(0x01)
	char pad_1F9[0x7]; // 0x1f9(0x07)
	char pad_200_0 : 1; // 0x200(0x01)
	char bReplicatesAttachmentReference : 1; // 0x200(0x01)
	char bReplicatesAttachment : 1; // 0x200(0x01)
	char *398fd0c0d1 : 1; // 0x200(0x01)
	char pad_200_4 : 1; // 0x200(0x01)
	char bAbsoluteLocation : 1; // 0x200(0x01)
	char bAbsoluteRotation : 1; // 0x200(0x01)
	char bAbsoluteScale : 1; // 0x200(0x01)
	char bVisible : 1; // 0x201(0x01)
	char bHiddenInGame : 1; // 0x201(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x201(0x01)
	char *e8ec283885 : 1; // 0x201(0x01)
	char bUseAttachParentBound : 1; // 0x201(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x201(0x01)
	char pad_201_6 : 2; // 0x201(0x01)
	char pad_202_0 : 3; // 0x202(0x01)
	char bAbsoluteTranslation : 1; // 0x202(0x01)
	char pad_202_4 : 4; // 0x202(0x01)
	char pad_203[0x1]; // 0x203(0x01)
	struct APhysicsVolume* PhysicsVolume; // 0x204(0x08)
	char pad_20C[0xc]; // 0x20c(0x0c)
	enum class EComponentMobility Mobility; // 0x218(0x01)
	char pad_219[0x27]; // 0x219(0x27)
	struct FVector RelativeScale3D; // 0x240(0x0c)
	struct FVector RelativeTranslation; // 0x24c(0x0c)
	char pad_258[0x28]; // 0x258(0x28)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x280(0x10)
	char pad_290[0x30]; // 0x290(0x30)
	struct USceneComponent* AttachParent; // 0x2c0(0x08)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct FRotator RelativeRotation; // 0x2d0(0x0c)
	char pad_2DC[0xc]; // 0x2dc(0x0c)
	struct FVector RelativeLocation; // 0x2e8(0x0c)
	char pad_2F4[0x1c]; // 0x2f4(0x1c)
	SetProperty *5e68ef062e; // 0x310(0x50)
	struct FVector *47e17f1cb8; // 0x360(0x0c)
	char pad_36C[0x4]; // 0x36c(0x04)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x370(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x380(0x10)
	char pad_390[0xd0]; // 0x390(0xd0)

	void IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e5020
	void K2_AddWorldRotation(struct FRotator DeltaRotation, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e683c
	void *0c74739254(); // Function Engine.SceneComponent.*0c74739254 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2c44
	void *7ec7e6d06d(enum class *90c9408cc7 RotationRule); // Function Engine.SceneComponent.*7ec7e6d06d // Final|Native|Public|BlueprintCallable // @ game+0xa892d4
	bool DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x64db42c
	void *5517b00eba(); // Function Engine.SceneComponent.*5517b00eba // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfee8
	void K2_AttachTo(struct FName InSocketName, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x64e6f40
	struct FHitResult K2_AddLocalTransform(); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e60a0
	void *e36ab2b188(); // Function Engine.SceneComponent.*e36ab2b188 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2fb0
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xa43218
	void *2c76227353(bool bNewAbsoluteRotation); // Function Engine.SceneComponent.*2c76227353 // Final|Native|Public|BlueprintCallable // @ game+0x64ef518
	void *e177c790ac(); // Function Engine.SceneComponent.*e177c790ac // Final|Native|Public|BlueprintCallable // @ game+0x64ec6e4
	int32 *1ff5be215f(); // Function Engine.SceneComponent.*1ff5be215f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64defdc
	void K2_SetRelativeRotation(struct FRotator NewRotation, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e9748
	struct FHitResult K2_AddRelativeRotation(); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e6498
	void *2107af1f45(); // Function Engine.SceneComponent.*2107af1f45 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3224
	void *0c17c4ef20(); // Function Engine.SceneComponent.*0c17c4ef20 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3c14
	void *02150347c8(); // Function Engine.SceneComponent.*02150347c8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de2dc
	struct FName *2529aa9c4b(); // Function Engine.SceneComponent.*2529aa9c4b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3380
	bool K2_SetWorldRotation(struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e9f54
	void *e734bbfdd1(); // Function Engine.SceneComponent.*e734bbfdd1 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64df4fc
	void *7b31d151fc(); // Function Engine.SceneComponent.*7b31d151fc // Final|Native|Public|BlueprintCallable // @ game+0x64f3304
	void *21797244da(); // Function Engine.SceneComponent.*21797244da // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xb9ec54
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xa7546c
	void K2_AddLocalOffset(bool bSweep); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e5cf0
	struct FName *c2d343c5f6(); // Function Engine.SceneComponent.*c2d343c5f6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64db660
	struct FHitResult K2_SetWorldTransform(); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64ea12c
	void *841542b838(bool bIncludeAllDescendants); // Function Engine.SceneComponent.*841542b838 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64df07c
	enum class *22ea206da9 *32022b8b54(); // Function Engine.SceneComponent.*32022b8b54 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e35a0
	bool K2_SetWorldLocation(struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e9b4c
	void K2_SetRelativeLocation(struct FVector NewLocation, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e934c
	struct FName *4ae5e515bf(); // Function Engine.SceneComponent.*4ae5e515bf // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x580ae28
	struct USceneComponent* *79d6ce8944(enum class EAttachmentRule ScaleRule); // Function Engine.SceneComponent.*79d6ce8944 // Final|Native|Public|BlueprintCallable // @ game+0x64e72e0
	bool *3821db7cba(); // Function Engine.SceneComponent.*3821db7cba // Final|Native|Public|BlueprintCallable // @ game+0x64f302c
	void *2d79511c8a(struct USceneComponent* InParent); // Function Engine.SceneComponent.*2d79511c8a // Final|Native|Public|BlueprintCallable // @ game+0x64f68cc
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xaae9cc
	void *0ac31b13a0(); // Function Engine.SceneComponent.*0ac31b13a0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de1d4
	void *05ac12a2ed(); // Function Engine.SceneComponent.*05ac12a2ed // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e31b8
	void *ec6cc6480a(struct FName InSocketName); // Function Engine.SceneComponent.*ec6cc6480a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3438
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xa7546c
	struct FHitResult K2_AddWorldOffset(); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e6664
	void *7f1c545765(); // Function Engine.SceneComponent.*7f1c545765 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7d8c
	void *0f883d6ef4(); // Function Engine.SceneComponent.*0f883d6ef4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb34438
	void OnRep_Visibility(); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x64eb078
	struct FHitResult *54b40a2d71(); // Function Engine.SceneComponent.*54b40a2d71 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e9d24
	void *dfe7f29b70(); // Function Engine.SceneComponent.*dfe7f29b70 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e44d4
	void *b97017c5f1(); // Function Engine.SceneComponent.*b97017c5f1 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e34e8
	void *8e756cd690(); // Function Engine.SceneComponent.*8e756cd690 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f4d9c
	void *005bf0b0a1(); // Function Engine.SceneComponent.*005bf0b0a1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7e10
	struct FTransform K2_SetRelativeTransform(bool bSweep); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e9920
	void *3248871ca9(); // Function Engine.SceneComponent.*3248871ca9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e243c
	struct FHitResult K2_AddWorldTransform(); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e6a14
	void *4047176641(); // Function Engine.SceneComponent.*4047176641 // Final|Native|Public|BlueprintCallable // @ game+0x64f33a0
	void K2_AddLocalRotation(bool bSweep); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e5ec8
	void ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x64f765c
	void K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7e54
	void *400454d1c2(); // Function Engine.SceneComponent.*400454d1c2 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f64c0
	void K2_AddRelativeLocation(struct FVector DeltaLocation, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e62cc
	bool SetVisibility(); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xb40ad4
	struct FVector *77558c73a3(struct FRotator NewRotation, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.*77558c73a3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e9518
};

// Class Engine.PrimitiveComponent
// Size: 0x990 (Inherited: 0x460)
struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x460(0x04)
	float LDMaxDrawDistance; // 0x464(0x04)
	float CachedMaxDrawDistance; // 0x468(0x04)
	enum class *b2d3e352d1 *763e39a9cb; // 0x46c(0x01)
	enum class *b2d3e352d1 *9497012a6e; // 0x46d(0x01)
	char pad_46E[0x2]; // 0x46e(0x02)
	char pad_470_0 : 3; // 0x470(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x470(0x01)
	char bGenerateOverlapEvents : 1; // 0x470(0x01)
	char bMultiBodyOverlap : 1; // 0x470(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x470(0x01)
	char bTraceComplexOnMove : 1; // 0x470(0x01)
	char bDisableForceFromCharacter : 1; // 0x471(0x01)
	char bReturnMaterialOnMove : 1; // 0x471(0x01)
	char *3515772747 : 1; // 0x471(0x01)
	char bAllowCullDistanceVolume : 1; // 0x471(0x01)
	char bImportantMesh : 1; // 0x471(0x01)
	char bOverrideCullingDistances : 1; // 0x471(0x01)
	char pad_471_6 : 2; // 0x471(0x01)
	char pad_472[0x2]; // 0x472(0x02)
	float HLODScreenSize; // 0x474(0x04)
	char *fa107373d7 : 1; // 0x478(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x478(0x01)
	char bRenderInMainPass : 1; // 0x478(0x01)
	char bRenderInMono : 1; // 0x478(0x01)
	char bOwnerNoSee : 1; // 0x478(0x01)
	char bOnlyOwnerSee : 1; // 0x478(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x478(0x01)
	char bUseAsOccluder : 1; // 0x478(0x01)
	char bForceAsOccluder : 1; // 0x479(0x01)
	char bForceOcclusionQuerying : 1; // 0x479(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x479(0x01)
	char *4826fc9fad : 1; // 0x479(0x01)
	char bForceMipStreaming : 1; // 0x479(0x01)
	char *cca2f750f4 : 1; // 0x479(0x01)
	char pad_479_6 : 1; // 0x479(0x01)
	char CastShadow : 1; // 0x479(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x47a(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x47a(0x01)
	char bCastDynamicShadow : 1; // 0x47a(0x01)
	char bCastStaticShadow : 1; // 0x47a(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x47a(0x01)
	char bSelfShadowOnly : 1; // 0x47a(0x01)
	char bCastFarShadow : 1; // 0x47a(0x01)
	char bCastInsetShadow : 1; // 0x47a(0x01)
	char bCastCinematicShadow : 1; // 0x47b(0x01)
	char bCastHiddenShadow : 1; // 0x47b(0x01)
	char bCastShadowAsTwoSided : 1; // 0x47b(0x01)
	char bLightAsIfStatic : 1; // 0x47b(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x47b(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x47b(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x47b(0x01)
	char bIgnoreRadialImpulse : 1; // 0x47b(0x01)
	char bIgnoreRadialForce : 1; // 0x47c(0x01)
	char bApplyImpulseOnDamage : 1; // 0x47c(0x01)
	char bSyncBodySleep : 1; // 0x47c(0x01)
	char *fefaebb36c : 1; // 0x47c(0x01)
	char *7ccce4ff36 : 1; // 0x47c(0x01)
	char *92a6fd4e7c : 1; // 0x47c(0x01)
	char bRenderCustomDepth : 1; // 0x47c(0x01)
	char pad_47C_7 : 1; // 0x47c(0x01)
	char pad_47D_0 : 7; // 0x47d(0x01)
	char *d927c19d75 : 1; // 0x47d(0x01)
	char *bd65329126 : 1; // 0x47e(0x01)
	char *775983f410 : 1; // 0x47e(0x01)
	char pad_47E_2 : 6; // 0x47e(0x01)
	char pad_47F[0x1]; // 0x47f(0x01)
	enum class EDecalChannel DecalChannel; // 0x480(0x01)
	enum class *f1e85ae637 IndoorOutdoorMask; // 0x481(0x01)
	struct FLightingChannels LightingChannels; // 0x482(0x03)
	enum class *5b12535706 IndirectLightingCacheQuality; // 0x485(0x01)
	bool CustomDepthStencilValue; // 0x486(0x01)
	enum class *5081dde572 CustomDepthStencilWriteMask; // 0x487(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x488(0x10)
	int32 TranslucencySortPriority; // 0x498(0x04)
	int32 *09bfa079b0; // 0x49c(0x04)
	char pad_4A0[0x4]; // 0x4a0(0x04)
	float LpvBiasMultiplier; // 0x4a4(0x04)
	char pad_4A8[0x8]; // 0x4a8(0x08)
	struct FBodyInstance BodyInstance; // 0x4b0(0x230)
	char pad_6E0[0x8]; // 0x6e0(0x08)
	enum class EHasCustomNavigableGeometry *78051e740d; // 0x6e8(0x01)
	char pad_6E9[0x3b]; // 0x6e9(0x3b)
	float BoundsScale; // 0x724(0x04)
	float *af2466df12; // 0x728(0x04)
	float *582a6a05b9; // 0x72c(0x04)
	float *8aa40722fd; // 0x730(0x04)
	enum class *4c9c4152b1 CanBeCharacterBase; // 0x734(0x01)
	char pad_735[0x1]; // 0x735(0x01)
	enum class *4c9c4152b1 CanCharacterStepUpOn; // 0x736(0x01)
	char pad_737[0x1]; // 0x737(0x01)
	struct TArray<struct AActor*> *3263ebc401; // 0x738(0x10)
	struct TArray<struct UPrimitiveComponent*> *a555ecd237; // 0x748(0x10)
	char pad_758[0xb8]; // 0x758(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x810(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x820(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x830(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x840(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x850(0x10)
	char pad_860[0x10]; // 0x860(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x870(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x880(0x10)
	struct FMulticastDelegate OnClicked; // 0x890(0x10)
	struct FMulticastDelegate OnReleased; // 0x8a0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x8b0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x8c0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x8d0(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x8e0(0x10)
	char pad_8F0[0x28]; // 0x8f0(0x28)
	struct UPrimitiveComponent* *17bfbe7021; // 0x918(0x08)
	struct UPrimitiveComponent* *b257202527; // 0x920(0x08)
	struct F*71789ef7cf *9449fd3492; // 0x928(0x58)
	char pad_980[0x10]; // 0x980(0x10)

	void SetCollisionObjectType(); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x64f189c
	void *7b97c590ca(float MassInKg); // Function Engine.PrimitiveComponent.*7b97c590ca // Native|Public|BlueprintCallable // @ game+0x64f3ae4
	void CreateAndSetMaterialInstanceDynamic(int32 ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x64dab9c
	struct AActor* *a3ced43a9e(); // Function Engine.PrimitiveComponent.*a3ced43a9e // Final|Native|Public|BlueprintCallable // @ game+0x64e40cc
	struct FVector *01e27a1a47(struct FName BoneName); // Function Engine.PrimitiveComponent.*01e27a1a47 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ecbc0
	void SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f152c
	int32 SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0xb16170
	void *d16743e48e(); // Function Engine.PrimitiveComponent.*d16743e48e // Native|Public|BlueprintCallable // @ game+0x64f1f38
	void *9f38f9fbc2(); // Function Engine.PrimitiveComponent.*9f38f9fbc2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2474
	void *7693ea05a0(struct FName BoneName); // Function Engine.PrimitiveComponent.*7693ea05a0 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e2e78
	void *2a6b53140c(); // Function Engine.PrimitiveComponent.*2a6b53140c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x571d944
	void *fc59628470(); // Function Engine.PrimitiveComponent.*fc59628470 // Final|Native|Public|BlueprintCallable // @ game+0x64f4e40
	void *632fed46bc(); // Function Engine.PrimitiveComponent.*632fed46bc // Native|Public|BlueprintCallable // @ game+0x64f3c10
	void *2faa0a8d88(struct UPrimitiveComponent* OtherComp); // Function Engine.PrimitiveComponent.*2faa0a8d88 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4d8c
	struct APawn* *82d09edad4(); // Function Engine.PrimitiveComponent.*82d09edad4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d70b0
	void *1d887895df(); // Function Engine.PrimitiveComponent.*1d887895df // Native|Public|BlueprintCallable // @ game+0x64f41d0
	void SetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x57f0464
	void SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x64f37d8
	struct FVector *3569fb64cc(); // Function Engine.PrimitiveComponent.*3569fb64cc // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64efd50
	struct FName *2a28a4db69(); // Function Engine.PrimitiveComponent.*2a28a4db69 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64deec4
	void *30247e1b2f(); // Function Engine.PrimitiveComponent.*30247e1b2f // Native|Public|BlueprintCallable // @ game+0x64f5bfc
	int32 *3172cb3554(); // Function Engine.PrimitiveComponent.*3172cb3554 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1c14
	void *e4d650bcfd(); // Function Engine.PrimitiveComponent.*e4d650bcfd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e80d8
	void *dcaed91866(); // Function Engine.PrimitiveComponent.*dcaed91866 // Final|Native|Public|BlueprintCallable // @ game+0x64d7700
	void SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x64effe0
	struct FName *f7e8b000d4(struct FVector Point); // Function Engine.PrimitiveComponent.*f7e8b000d4 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64df1b0
	void *ca937dc5a0(); // Function Engine.PrimitiveComponent.*ca937dc5a0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3fe8
	void *d9842fd919(); // Function Engine.PrimitiveComponent.*d9842fd919 // Final|Native|Public|BlueprintCallable // @ game+0x64f1400
	void AddAngularImpulse(struct FName BoneName); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d4af0
	enum class *92e9a571fb *e3829bf1a9(); // Function Engine.PrimitiveComponent.*e3829bf1a9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d6478
	void GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xace5c0
	void *deff003dba(); // Function Engine.PrimitiveComponent.*deff003dba // Final|Native|Public|BlueprintCallable // @ game+0x64df35c
	bool SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x64f4638
	void *a413ad5332(); // Function Engine.PrimitiveComponent.*a413ad5332 // Native|Public|BlueprintCallable // @ game+0x64eff48
	void *1f762b8275(); // Function Engine.PrimitiveComponent.*1f762b8275 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f63ec
	void CreateDynamicMaterialInstance(struct UMaterialInterface* SourceMaterial); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x64dad30
	void *d0b4bb5c03(); // Function Engine.PrimitiveComponent.*d0b4bb5c03 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e8104
	struct TArray<struct AActor*> GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2750
	void AddImpulse(struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5a64
	enum class *92e9a571fb *92fc76ae27(); // Function Engine.PrimitiveComponent.*92fc76ae27 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d62a4
	void *9b10ee1e80(struct UPrimitiveComponent* Component); // Function Engine.PrimitiveComponent.*9b10ee1e80 // Final|Native|Public|BlueprintCallable // @ game+0x64e41ac
	void *a7aa88bafe(); // Function Engine.PrimitiveComponent.*a7aa88bafe // Final|Native|Public|BlueprintCallable // @ game+0x64f5958
	void *24021479fd(); // Function Engine.PrimitiveComponent.*24021479fd // Final|Native|Public|BlueprintCallable // @ game+0x64d771c
	void *b954d8828a(); // Function Engine.PrimitiveComponent.*b954d8828a // Final|Native|Public|BlueprintCallable // @ game+0x64dab14
	enum class ECollisionChannel *79e487c6f9(); // Function Engine.PrimitiveComponent.*79e487c6f9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df394
	void *78fdfb4d17(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.*78fdfb4d17 // Native|Public|BlueprintCallable // @ game+0x64f1a60
	struct FVector AddForceAtLocation(); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5504
	void GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2948
	void AddImpulseAtLocation(struct FVector Impulse); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5ba4
	struct UMaterialInterface* CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x64dac40
	void GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1b28
	void *5ffb7dcccd(); // Function Engine.PrimitiveComponent.*5ffb7dcccd // Native|Public|BlueprintCallable // @ game+0x64f3874
	void *40a5d1cffa(); // Function Engine.PrimitiveComponent.*40a5d1cffa // Native|Public|BlueprintCallable // @ game+0x64f24a4
	void *bbb624a79d(); // Function Engine.PrimitiveComponent.*bbb624a79d // Final|Native|Public|BlueprintCallable // @ game+0x64f4ed4
	void *66aea35f5e(); // Function Engine.PrimitiveComponent.*66aea35f5e // Final|Native|Public|BlueprintCallable // @ game+0x64f4268
	void *d282999091(); // Function Engine.PrimitiveComponent.*d282999091 // Final|Native|Public|BlueprintCallable // @ game+0x64f444c
	void *039800f1f5(int32 FaceIndex); // Function Engine.PrimitiveComponent.*039800f1f5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1cb8
	void SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64efe48
	void *cce6c67132(); // Function Engine.PrimitiveComponent.*cce6c67132 // Native|Public|BlueprintCallable // @ game+0xac8874
	void *e6b23a751f(); // Function Engine.PrimitiveComponent.*e6b23a751f // Native|Public|BlueprintCallable // @ game+0x64f7944
	void *332f931425(); // Function Engine.PrimitiveComponent.*332f931425 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e8134
	void *f823da27dc(); // Function Engine.PrimitiveComponent.*f823da27dc // Final|Native|Public|BlueprintCallable // @ game+0x64f11a8
	struct FVector AddForceAtLocationLocal(); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5650
	struct AActor* *e67787df0d(); // Function Engine.PrimitiveComponent.*e67787df0d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4cec
	void *b03bf8da06(); // Function Engine.PrimitiveComponent.*b03bf8da06 // Final|Native|Public|BlueprintCallable // @ game+0x64f21f8
	void *36485e4886(); // Function Engine.PrimitiveComponent.*36485e4886 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df334
	void *f0b5efc4d8(); // Function Engine.PrimitiveComponent.*f0b5efc4d8 // Native|Public|BlueprintCallable // @ game+0x64f19c8
	struct FVector SetPhysicsAngularVelocity(bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x720050
	struct FHitResult K2_LineTraceComponent(struct FVector TraceStart, bool bTraceComplex); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e8168
	void GetPhysicsAngularVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e2dc8
	void AddForce(struct FVector force); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d53c4
	void *fd716d5e78(); // Function Engine.PrimitiveComponent.*fd716d5e78 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e25a8
	void *036f31ad96(); // Function Engine.PrimitiveComponent.*036f31ad96 // Native|Public|BlueprintCallable // @ game+0x64ead24
	void *2faca86bd3(); // Function Engine.PrimitiveComponent.*2faca86bd3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e492c
	void *02681a1ced(); // Function Engine.PrimitiveComponent.*02681a1ced // Final|Native|Public|BlueprintCallable // @ game+0x64f20d0
	void *2887752cc3(); // Function Engine.PrimitiveComponent.*2887752cc3 // Final|Native|Public|BlueprintCallable // @ game+0x64ec140
	void *16e97b9149(); // Function Engine.PrimitiveComponent.*16e97b9149 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e19f4
	void *164ed6c2a4(struct FName BoneName); // Function Engine.PrimitiveComponent.*164ed6c2a4 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0b80
	void CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x64daa8c
	void *75e72496bd(); // Function Engine.PrimitiveComponent.*75e72496bd // Native|Public|BlueprintCallable // @ game+0x64f45a4
	void *dfc676b7a3(); // Function Engine.PrimitiveComponent.*dfc676b7a3 // Final|Native|Public|BlueprintCallable // @ game+0x64f4f68
	void *dab6d024ed(); // Function Engine.PrimitiveComponent.*dab6d024ed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df30c
	void AddTorque(struct FName BoneName); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d6938
	void *b5162d1d9b(); // Function Engine.PrimitiveComponent.*b5162d1d9b // Native|Public|BlueprintCallable // @ game+0xb4d208
	void *69a6b1b25d(); // Function Engine.PrimitiveComponent.*69a6b1b25d // Native|Public|BlueprintCallable // @ game+0x64e44ac
	struct FName *bbbb9b1909(); // Function Engine.PrimitiveComponent.*bbbb9b1909 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1b54
	void SetPhysicsLinearVelocity(bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x71ff68
	void *5929e5407b(); // Function Engine.PrimitiveComponent.*5929e5407b // Final|Native|Public|BlueprintCallable // @ game+0x64f2168
	void *c1ae168066(); // Function Engine.PrimitiveComponent.*c1ae168066 // Native|Public|BlueprintCallable // @ game+0x64f1934
	void *9d0af71f5d(); // Function Engine.PrimitiveComponent.*9d0af71f5d // Native|Public|BlueprintCallable // @ game+0x6f27f0
};

// Class Engine.MeshComponent
// Size: 0xa90 (Inherited: 0x990)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x988(0x10)
	char pad_9A0[0xf0]; // 0x9a0(0xf0)

	struct FName *52fc39a231(); // Function Engine.MeshComponent.*52fc39a231 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1d5c
	void *eb1d5a0c74(); // Function Engine.MeshComponent.*eb1d5a0c74 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1e90
	struct FName *a07df3b67c(); // Function Engine.MeshComponent.*a07df3b67c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4b04
	struct FName *b7c03fab71(); // Function Engine.MeshComponent.*b7c03fab71 // Final|Native|Public|BlueprintCallable // @ game+0x824d6c
	void *4128bad4a1(); // Function Engine.MeshComponent.*4128bad4a1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f5f6c
	void *bd0d269c5b(); // Function Engine.MeshComponent.*bd0d269c5b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1e04
};

// Class Engine.StaticMeshComponent
// Size: 0xb30 (Inherited: 0xa90)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xa90(0x04)
	int32 *198fecb621; // 0xa94(0x04)
	bool bOverrideMinLOD; // 0xa98(0x01)
	char pad_A99[0x3]; // 0xa99(0x03)
	int32 MinLOD; // 0xa9c(0x04)
	struct UStaticMesh* StaticMesh; // 0xaa0(0x08)
	bool bOverrideWireframeColor; // 0xaa8(0x01)
	char pad_AA9[0x3]; // 0xaa9(0x03)
	struct FColor WireframeColorOverride; // 0xaac(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xab0(0x10)
	char *7f859870b0 : 1; // 0xac0(0x01)
	char *4d9ef1a96b : 1; // 0xac0(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xac0(0x01)
	char *c4be459603 : 1; // 0xac0(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xac0(0x01)
	char bOverrideLightMapRes : 1; // 0xac0(0x01)
	char pad_AC0_6 : 2; // 0xac0(0x01)
	char pad_AC1[0x3]; // 0xac1(0x03)
	int32 OverriddenLightMapRes; // 0xac4(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xac8(0x01)
	char pad_AC8_1 : 7; // 0xac8(0x01)
	char pad_AC9[0x3]; // 0xac9(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xacc(0x04)
	float StreamingDistanceMultiplier; // 0xad0(0x04)
	int32 *d6ee954a0d; // 0xad4(0x04)
	char *3331e715ef : 1; // 0xad8(0x01)
	char pad_AD8_1 : 7; // 0xad8(0x01)
	char pad_AD9[0x7]; // 0xad9(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xae0(0x10)
	struct TArray<struct F*fec1278a78> *db24bbedf0; // 0xaf0(0x10)
	struct TArray<struct F*b5b893870e> *e396a7ceab; // 0xb00(0x10)
	bool *6fa59b2292; // 0xb10(0x01)
	char pad_B11[0x3]; // 0xb11(0x03)
	struct F*886b75ca22 LightmassSettings; // 0xb14(0x18)
	char pad_B2C[0x4]; // 0xb2c(0x04)

	void *e499d85100(); // Function Engine.StaticMeshComponent.*e499d85100 // Final|Native|Public|BlueprintCallable // @ game+0x64f2864
	void SetStaticMesh(struct UStaticMesh* NewMesh); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x5f9f54c
	void *231c06526a(); // Function Engine.StaticMeshComponent.*231c06526a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1a20
	void OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x64eafd0
};

// Class Engine.SkinnedMeshComponent
// Size: 0xc30 (Inherited: 0xa90)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xa90(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xa98(0x08)
	char pad_AA0[0x60]; // 0xaa0(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb00(0x01)
	char pad_B00_1 : 7; // 0xb00(0x01)
	char pad_B01[0x7]; // 0xb01(0x07)
	struct TArray<struct FBoxSphereBounds> *a849bc8171; // 0xb08(0x10)
	char pad_B18[0x20]; // 0xb18(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xb38(0x08)
	int32 ForcedLodModel; // 0xb40(0x04)
	int32 MinLodModel; // 0xb44(0x04)
	char pad_B48[0x10]; // 0xb48(0x10)
	struct TArray<struct F*6785417a7c> LODInfo; // 0xb58(0x10)
	float StreamingDistanceMultiplier; // 0xb68(0x04)
	struct FColor WireframeColor; // 0xb6c(0x04)
	char *428602d4f6 : 1; // 0xb70(0x01)
	char *0ef0300f94 : 1; // 0xb70(0x01)
	char bDisableMorphTarget : 1; // 0xb70(0x01)
	char *39de54be4e : 1; // 0xb70(0x01)
	char pad_B70_4 : 4; // 0xb70(0x01)
	char pad_B71[0x17]; // 0xb71(0x17)
	char bPerBoneMotionBlur : 1; // 0xb88(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xb88(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xb88(0x01)
	char bSyncAttachParentLOD : 1; // 0xb88(0x01)
	char pad_B88_4 : 4; // 0xb88(0x01)
	char pad_B89[0x3]; // 0xb89(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xb8c(0x01)
	char pad_B8D[0x3]; // 0xb8d(0x03)
	char *56b03ddea8 : 1; // 0xb90(0x01)
	char *6caa3c3fe1 : 1; // 0xb90(0x01)
	char *ab97d111d5 : 1; // 0xb90(0x01)
	char pad_B90_3 : 5; // 0xb90(0x01)
	char pad_B91[0x3]; // 0xb91(0x03)
	bool *cee1355191; // 0xb94(0x01)
	char pad_B95[0x3]; // 0xb95(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xb98(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xb98(0x01)
	char pad_B98_2 : 6; // 0xb98(0x01)
	char pad_B99[0x3]; // 0xb99(0x03)
	char bRenderStatic : 1; // 0xb9c(0x01)
	char pad_B9C_1 : 7; // 0xb9c(0x01)
	char pad_B9D[0x3]; // 0xb9d(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xba0(0x04)
	char *15a4761d5b : 1; // 0xba4(0x01)
	char pad_BA4_1 : 7; // 0xba4(0x01)
	char pad_BA5[0xf]; // 0xba5(0x0f)
	struct FBoxSphereBounds *d470b2b7d1; // 0xbb4(0x1c)
	bool *4cd34b6758; // 0xbd0(0x01)
	bool bEnableUpdateRateOptimizations; // 0xbd1(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xbd2(0x01)
	char pad_BD3[0x4e]; // 0xbd3(0x4e)
	bool *e9990aed04; // 0xc21(0x01)
	bool *05a0730e26; // 0xc22(0x01)
	char pad_C23[0xd]; // 0xc23(0x0d)

	void *ec248b25a0(); // Function Engine.SkinnedMeshComponent.*ec248b25a0 // Final|Native|Public|BlueprintCallable // @ game+0x653b1c8
	void *c4f0ee9e4c(int32 BoneIndex); // Function Engine.SkinnedMeshComponent.*c4f0ee9e4c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65154d4
	void *9c5d0b6944(); // Function Engine.SkinnedMeshComponent.*9c5d0b6944 // Final|Native|Public|BlueprintCallable // @ game+0x653b278
	int32 *604742927d(); // Function Engine.SkinnedMeshComponent.*604742927d // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6546ee4
	void *61a9693b85(); // Function Engine.SkinnedMeshComponent.*61a9693b85 // Final|Native|Public|BlueprintCallable // @ game+0x65416fc
	void *69ce5b8b8d(); // Function Engine.SkinnedMeshComponent.*69ce5b8b8d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651ae08
	void GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6515218
	struct FName *ef1192b277(); // Function Engine.SkinnedMeshComponent.*ef1192b277 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65021b4
	void *0e7e6cd84f(); // Function Engine.SkinnedMeshComponent.*0e7e6cd84f // Final|Native|Public|BlueprintCallable // @ game+0x653eb08
	void *8bf10f391d(); // Function Engine.SkinnedMeshComponent.*8bf10f391d // Native|Public|BlueprintCallable // @ game+0x65426c0
	void *559e974ba0(); // Function Engine.SkinnedMeshComponent.*559e974ba0 // Final|Native|Public|BlueprintCallable // @ game+0x65435f0
	struct FVector *518eb77a8b(); // Function Engine.SkinnedMeshComponent.*518eb77a8b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x654ffe8
	void *cfacb7d388(); // Function Engine.SkinnedMeshComponent.*cfacb7d388 // Final|Native|Public|BlueprintCallable // @ game+0x653ad24
	void *d2f08d65bc(); // Function Engine.SkinnedMeshComponent.*d2f08d65bc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651aa44
	void *be13762590(); // Function Engine.SkinnedMeshComponent.*be13762590 // Final|Native|Public|BlueprintCallable // @ game+0x6509724
	struct FRotator *af2312fcf3(struct FVector OutPosition); // Function Engine.SkinnedMeshComponent.*af2312fcf3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65503bc
	void SetSkeletalMesh(struct USkeletalMesh* NewMesh); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x6543bf0
	void *d9b06c421e(); // Function Engine.SkinnedMeshComponent.*d9b06c421e // Final|Native|Public|BlueprintCallable // @ game+0x65505f4
	void *bf7d10d1b2(); // Function Engine.SkinnedMeshComponent.*bf7d10d1b2 // Final|Native|Public|BlueprintCallable // @ game+0x654182c
	void *5a0c0a8877(struct FVector TestLocation, float IgnoreScale); // Function Engine.SkinnedMeshComponent.*5a0c0a8877 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6511db0
	void *a7992bfca2(); // Function Engine.SkinnedMeshComponent.*a7992bfca2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651d518
	int32 SetSkinWeightOverride(); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6543d64
	void *d2ec714e3f(); // Function Engine.SkinnedMeshComponent.*d2ec714e3f // Final|Native|Public|BlueprintCallable // @ game+0x65230dc
	void *03bce2e129(); // Function Engine.SkinnedMeshComponent.*03bce2e129 // Final|Native|Public|BlueprintCallable // @ game+0x65093c0
	struct FName *14d803ab8f(); // Function Engine.SkinnedMeshComponent.*14d803ab8f // Final|Native|Public|BlueprintCallable // @ game+0x6521c18
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1130 (Inherited: 0xc30)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xc30(0x08)
	struct UClass* AnimClass; // 0xc38(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xc40(0x08)
	struct TArray<struct UAnimInstance*> *c85816968d; // 0xc48(0x10)
	struct UAnimInstance* *d41233ff0c; // 0xc58(0x08)
	struct F*6592b79d68 AnimationData; // 0xc60(0x18)
	char pad_C78[0x30]; // 0xc78(0x30)
	struct TArray<struct FTransform> *c4b76afb18; // 0xca8(0x10)
	struct TArray<struct FTransform> *2e37c7a139; // 0xcb8(0x10)
	char pad_CC8[0x20]; // 0xcc8(0x20)
	float GlobalAnimRateScale; // 0xce8(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xcec(0x01)
	enum class *3c8dc5cc54 PhysicsTransformUpdateMode; // 0xced(0x01)
	char pad_CEE[0x1]; // 0xcee(0x01)
	enum class EAnimationMode AnimationMode; // 0xcef(0x01)
	char pad_CF0[0x4]; // 0xcf0(0x04)
	char pad_CF4_0 : 1; // 0xcf4(0x01)
	char *0765881b66 : 1; // 0xcf4(0x01)
	char pad_CF4_2 : 1; // 0xcf4(0x01)
	char *c88cf8b3b6 : 1; // 0xcf4(0x01)
	char pad_CF4_4 : 2; // 0xcf4(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xcf4(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xcf4(0x01)
	char bDisableClothSimulation : 1; // 0xcf5(0x01)
	char pad_CF5_1 : 2; // 0xcf5(0x01)
	char bCollideWithEnvironment : 1; // 0xcf5(0x01)
	char bCollideWithAttachedChildren : 1; // 0xcf5(0x01)
	char bLocalSpaceSimulation : 1; // 0xcf5(0x01)
	char *186c36d696 : 1; // 0xcf5(0x01)
	char bResetAfterTeleport : 1; // 0xcf5(0x01)
	char pad_CF6_0 : 1; // 0xcf6(0x01)
	char bNoSkeletonUpdate : 1; // 0xcf6(0x01)
	char bPauseAnims : 1; // 0xcf6(0x01)
	char *e321c6819c : 1; // 0xcf6(0x01)
	char bEnablePerPolyCollision : 1; // 0xcf6(0x01)
	char *b39284674e : 1; // 0xcf6(0x01)
	char *d4f8e0be1a : 1; // 0xcf6(0x01)
	char *4a2d21f86d : 1; // 0xcf6(0x01)
	char *e46c1d1db1 : 1; // 0xcf7(0x01)
	char *d42c156e9b : 1; // 0xcf7(0x01)
	char *cccca4cafe : 1; // 0xcf7(0x01)
	char *1fecf92850 : 1; // 0xcf7(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xcf7(0x01)
	char *c012ed566e : 1; // 0xcf7(0x01)
	char pad_CF7_6 : 2; // 0xcf7(0x01)
	char *bd8057b0dc : 1; // 0xcf8(0x01)
	char pad_CF8_1 : 7; // 0xcf8(0x01)
	char pad_CF9_0 : 2; // 0xcf9(0x01)
	char bDefaultLooping : 1; // 0xcf9(0x01)
	char bDefaultPlaying : 1; // 0xcf9(0x01)
	char pad_CF9_4 : 4; // 0xcf9(0x01)
	uint16 *e8a7b9de66; // 0xcfa(0x02)
	float ClothBlendWeight; // 0xcfc(0x04)
	struct FVector *dfd815ea46; // 0xd00(0x0c)
	char pad_D0C[0x4]; // 0xd0c(0x04)
	struct UBodySetup* BodySetup; // 0xd10(0x08)
	float TeleportDistanceThreshold; // 0xd18(0x04)
	float TeleportRotationThreshold; // 0xd1c(0x04)
	struct FVector *c599877e19; // 0xd20(0x0c)
	char pad_D2C[0x4]; // 0xd2c(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xd30(0x10)
	char pad_D40[0xe0]; // 0xd40(0xe0)
	struct UClass* *41d1d8804c; // 0xe20(0x08)
	char pad_E28[0x1e8]; // 0xe28(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1010(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1018(0x08)
	float DefaultPosition; // 0x1020(0x04)
	float DefaultPlayRate; // 0x1024(0x04)
	uint32 *e648f1c23a; // 0x1028(0x04)
	float *a1f019615b; // 0x102c(0x04)
	char pad_1030[0x100]; // 0x1030(0x100)

	void *9e55cd1127(); // Function Engine.SkeletalMeshComponent.*9e55cd1127 // Final|Native|Public|BlueprintCallable // @ game+0x65427a4
	void *c95e2eb189(); // Function Engine.SkeletalMeshComponent.*c95e2eb189 // Final|Native|Public|BlueprintCallable // @ game+0x6515b64
	void *32a72275c6(); // Function Engine.SkeletalMeshComponent.*32a72275c6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6514abc
	void *578f9a271e(); // Function Engine.SkeletalMeshComponent.*578f9a271e // Final|Native|Public|BlueprintCallable // @ game+0x653d854
	void *88160de687(); // Function Engine.SkeletalMeshComponent.*88160de687 // Final|Native|Public|BlueprintCallable // @ game+0x65362b8
	void *7c7a4f8d4b(); // Function Engine.SkeletalMeshComponent.*7c7a4f8d4b // Final|Native|Public|BlueprintCallable // @ game+0x653635c
	void *82f85b462f(struct FName BoneName); // Function Engine.SkeletalMeshComponent.*82f85b462f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64fc0dc
	float *7a2fd6088c(); // Function Engine.SkeletalMeshComponent.*7a2fd6088c // Final|Native|Public|BlueprintCallable // @ game+0x65309e0
	int32 *d836f3cdcc(); // Function Engine.SkeletalMeshComponent.*d836f3cdcc // Final|Native|Public|BlueprintCallable // @ game+0x65123b8
	void *88b6545993(); // Function Engine.SkeletalMeshComponent.*88b6545993 // Final|Native|Public|BlueprintCallable // @ game+0x653b894
	float *a16076bca9(); // Function Engine.SkeletalMeshComponent.*a16076bca9 // Final|Native|Public|BlueprintCallable // @ game+0x653863c
	struct FName *37c1df285c(); // Function Engine.SkeletalMeshComponent.*37c1df285c // Final|Native|Public|BlueprintCallable // @ game+0x652302c
	void *7a87ebfeb9(bool bEnableGravity); // Function Engine.SkeletalMeshComponent.*7a87ebfeb9 // Final|Native|Public|BlueprintCallable // @ game+0x653d590
	void PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x653150c
	void GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651b7a4
	void SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x82427c
	void *3f2c53189b(float AddPhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.*3f2c53189b // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64fb958
	bool *908191f82a(); // Function Engine.SkeletalMeshComponent.*908191f82a // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6537cc4
	void IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6523714
	void SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x653909c
	void *c3c91f087e(bool bEnableSwingDrive); // Function Engine.SkeletalMeshComponent.*c3c91f087e // Final|Native|Public|BlueprintCallable // @ game+0x65381c0
	void *2863de562e(); // Function Engine.SkeletalMeshComponent.*2863de562e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651d4e4
	struct FName *42a4fc1ad0(float Swing1Angle); // Function Engine.SkeletalMeshComponent.*42a4fc1ad0 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6515fdc
	void GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651b064
	void SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0x8209d8
	void *39e1d97951(); // Function Engine.SkeletalMeshComponent.*39e1d97951 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65499bc
	void *74ff591f58(); // Function Engine.SkeletalMeshComponent.*74ff591f58 // Final|Native|Public|BlueprintCallable // @ game+0x6500f00
	void *2fd908ba89(float Value); // Function Engine.SkeletalMeshComponent.*2fd908ba89 // Final|Native|Public|BlueprintCallable // @ game+0x6541af8
	void *7bb96a0e6d(); // Function Engine.SkeletalMeshComponent.*7bb96a0e6d // Final|Native|Public|BlueprintCallable // @ game+0x6536630
	bool *e2235034c0(); // Function Engine.SkeletalMeshComponent.*e2235034c0 // Final|Native|Public|BlueprintCallable // @ game+0x653807c
	void *ce530fa306(struct FVector WorldPosition, struct FVector Normal, float Distance); // Function Engine.SkeletalMeshComponent.*ce530fa306 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6524338
	float SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x6542d8c
	void *e93856bf3e(); // Function Engine.SkeletalMeshComponent.*e93856bf3e // Final|Native|Public|BlueprintCallable // @ game+0x654f330
	void Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0x824208
	void *1a786e57d5(); // Function Engine.SkeletalMeshComponent.*1a786e57d5 // Final|Native|Public|BlueprintCallable // @ game+0x6537e68
	void *71d3f55db1(); // Function Engine.SkeletalMeshComponent.*71d3f55db1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x577dbfc
	void *04bd387e61(); // Function Engine.SkeletalMeshComponent.*04bd387e61 // Final|Native|Public|BlueprintCallable // @ game+0x65231a8
	struct FName *ee48004024(); // Function Engine.SkeletalMeshComponent.*ee48004024 // Final|Native|Public|BlueprintCallable // @ game+0x653be24
	void *baef9ab32e(); // Function Engine.SkeletalMeshComponent.*baef9ab32e // Final|Native|Public|BlueprintCallable // @ game+0x6513788
	void *10273169ee(); // Function Engine.SkeletalMeshComponent.*10273169ee // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb60a40
	void *8afc579124(); // Function Engine.SkeletalMeshComponent.*8afc579124 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6521ad0
	void *8cc93862cf(); // Function Engine.SkeletalMeshComponent.*8cc93862cf // Final|Native|Public|BlueprintCallable // @ game+0x5779578
	struct FVector *0d7fe52d3f(struct FName BoneName); // Function Engine.SkeletalMeshComponent.*0d7fe52d3f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64fc270
	void *18e31ec1ba(); // Function Engine.SkeletalMeshComponent.*18e31ec1ba // Final|Native|Public|BlueprintCallable // @ game+0x820aec
	struct FVector *946b36923d(); // Function Engine.SkeletalMeshComponent.*946b36923d // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6504ed0
	struct FName *b3d8eb2cbb(bool bScaleMass); // Function Engine.SkeletalMeshComponent.*b3d8eb2cbb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65153e8
	void *a847fc7087(float PhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.*a847fc7087 // Final|Native|Public|BlueprintCallable // @ game+0x6f1ff4
	struct FName *3e6b6b7c05(); // Function Engine.SkeletalMeshComponent.*3e6b6b7c05 // Native|Public|BlueprintCallable // @ game+0x6541ee4
	void *a6e5e1b394(); // Function Engine.SkeletalMeshComponent.*a6e5e1b394 // Final|Native|Public|BlueprintCallable // @ game+0x6550684
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x820938
	void *4adf88a322(float InSpring, float InForceLimit); // Function Engine.SkeletalMeshComponent.*4adf88a322 // Final|Native|Public|BlueprintCallable // @ game+0x6537efc
	bool *9323118453(); // Function Engine.SkeletalMeshComponent.*9323118453 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6f1e70
	void *7f10900457(); // Function Engine.SkeletalMeshComponent.*7f10900457 // Final|Native|Public|BlueprintCallable // @ game+0x6509310
	void *1c036a91e9(); // Function Engine.SkeletalMeshComponent.*1c036a91e9 // Final|Native|Public|BlueprintCallable // @ game+0x653d4a4
	struct FName *6d7e22c6e6(); // Function Engine.SkeletalMeshComponent.*6d7e22c6e6 // Final|Native|Public|BlueprintCallable // @ game+0x653bcf4
	void *2c38e2c65f(); // Function Engine.SkeletalMeshComponent.*2c38e2c65f // Final|Native|Public|BlueprintCallable // @ game+0x6513770
	struct FName *b21911ca74(); // Function Engine.SkeletalMeshComponent.*b21911ca74 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651a948
	void *e816aee7a9(bool bNewNotifyRigidBodyCollision); // Function Engine.SkeletalMeshComponent.*e816aee7a9 // Native|Public|BlueprintCallable // @ game+0x6539dd8
};

// Class Engine.*9f23a81057
// Size: 0x30 (Inherited: 0x28)
struct U*9f23a81057 : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Engine.*7563a7fc65
// Size: 0x30 (Inherited: 0x30)
struct U*7563a7fc65 : U*9f23a81057 {
};

// Class Engine.*5c0419d42f
// Size: 0x28 (Inherited: 0x28)
struct U*5c0419d42f : UObject {
};

// Class Engine.*f23bfe8a1c
// Size: 0x40 (Inherited: 0x28)
struct U*f23bfe8a1c : UObject {
	char bCausedByWorld : 1; // 0x28(0x01)
	char bScaleMomentumByMass : 1; // 0x28(0x01)
	char bRadialDamageVelChange : 1; // 0x28(0x01)
	char pad_28_3 : 5; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float DamageImpulse; // 0x2c(0x04)
	float DestructibleImpulse; // 0x30(0x04)
	float DestructibleDamageSpreadScale; // 0x34(0x04)
	float DamageFalloff; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.MovementComponent
// Size: 0x240 (Inherited: 0x1f0)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x1f0(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x1f8(0x08)
	char pad_200[0x4]; // 0x200(0x04)
	struct FVector Velocity; // 0x204(0x0c)
	char bConstrainToPlane : 1; // 0x210(0x01)
	char bSnapToPlaneAtStart : 1; // 0x210(0x01)
	char pad_210_2 : 6; // 0x210(0x01)
	char pad_211[0x3]; // 0x211(0x03)
	enum class EPlaneConstraintAxisSetting *a77cbf5800; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	struct FVector PlaneConstraintNormal; // 0x218(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x224(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x230(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x230(0x01)
	char bTickBeforeOwner : 1; // 0x230(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x230(0x01)
	char pad_230_4 : 4; // 0x230(0x01)
	char pad_231[0xf]; // 0x231(0x0f)

	void K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7ebc
	void PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0x959998
	void K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7f14
	void *e6f44122ff(); // Function Engine.MovementComponent.*e6f44122ff // Native|Public|BlueprintCallable // @ game+0x64f7324
	void ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64da7ec
	void *b4cb0012a1(); // Function Engine.MovementComponent.*b4cb0012a1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dffb4
	void *b04193052d(); // Function Engine.MovementComponent.*b04193052d // Native|Public|BlueprintCallable // @ game+0x64f4800
	void *c3de771e31(); // Function Engine.MovementComponent.*c3de771e31 // Native|Public|BlueprintCallable // @ game+0x64f476c
	void *cbfd9eb4d4(); // Function Engine.MovementComponent.*cbfd9eb4d4 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64da8b4
	float *9c8f4b265c(); // Function Engine.MovementComponent.*9c8f4b265c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4830
	void *e36ab2b188(); // Function Engine.MovementComponent.*e36ab2b188 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2f88
	void *3eb8132b76(struct FVector Delta, struct FHitResult OutHit, bool bTeleport); // Function Engine.MovementComponent.*3eb8132b76 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e84d4
	void *6fecebcb5c(); // Function Engine.MovementComponent.*6fecebcb5c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3014
	void *2094bf75a9(); // Function Engine.MovementComponent.*2094bf75a9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f4a48
	void *27b6012a40(); // Function Engine.MovementComponent.*27b6012a40 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f49a4
	void *34e8851871(); // Function Engine.MovementComponent.*34e8851871 // Native|Public|BlueprintCallable // @ game+0x64f69bc
	void *3f3594939d(); // Function Engine.MovementComponent.*3f3594939d // Native|Public|BlueprintCallable // @ game+0x64f5b68
	void *62cc96d62b(); // Function Engine.MovementComponent.*62cc96d62b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2fec
	void *d7d499fbfa(); // Function Engine.MovementComponent.*d7d499fbfa // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1fa0
	void *a027f13766(struct FVector Forward); // Function Engine.MovementComponent.*a027f13766 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f4898
	void *f705c7d54e(struct FVector Direction); // Function Engine.MovementComponent.*f705c7d54e // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64da724
	void *e45e138b8a(); // Function Engine.MovementComponent.*e45e138b8a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2fd4
};

// Class Engine.NavMovementComponent
// Size: 0x270 (Inherited: 0x240)
struct UNavMovementComponent : UMovementComponent {
	struct F*afffc9221e NavAgentProps; // 0x238(0x20)
	float *7b65d425cd; // 0x258(0x04)
	char *d2cfd1f855 : 1; // 0x25c(0x01)
	char bUseAccelerationForPaths : 1; // 0x25c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x25c(0x01)
	struct F*656446cb71 *1a07ad26f3; // 0x260(0x04)
	char pad_268_3 : 5; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)

	void *63853a7259(); // Function Engine.NavMovementComponent.*63853a7259 // Final|Native|Public|BlueprintCallable // @ game+0x64f733c
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x64f6cd8
	void *e453ff855f(); // Function Engine.NavMovementComponent.*e453ff855f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e47d8
	void IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e48dc
	void *a617f7fb8d(); // Function Engine.NavMovementComponent.*a617f7fb8d // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4c24
	void *80b74fcbc2(); // Function Engine.NavMovementComponent.*80b74fcbc2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4ff8
	void *d8d4d3d439(); // Function Engine.NavMovementComponent.*d8d4d3d439 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4904
};

// Class Engine.PawnMovementComponent
// Size: 0x280 (Inherited: 0x270)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *4e1d878be7; // 0x270(0x08)
	char pad_278[0x8]; // 0x278(0x08)

	void *1c570a1aae(); // Function Engine.PawnMovementComponent.*1c570a1aae // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2d24
	struct FVector *96aa53ac22(); // Function Engine.PawnMovementComponent.*96aa53ac22 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5cf0
	void *9cb1bf1b1b(); // Function Engine.PawnMovementComponent.*9cb1bf1b1b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1914
	void *533feeba94(); // Function Engine.PawnMovementComponent.*533feeba94 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64da97c
	void *05c9ee399f(); // Function Engine.PawnMovementComponent.*05c9ee399f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4bfc
	void *4fe8686d15(); // Function Engine.PawnMovementComponent.*4fe8686d15 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2d0c
	void K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7e88
};

// Class Engine.CharacterMovementComponent
// Size: 0x920 (Inherited: 0x280)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_280[0x8]; // 0x280(0x08)
	struct ACharacter* *850fe79414; // 0x288(0x08)
	char bApplyGravityWhileJumping : 1; // 0x290(0x01)
	char pad_290_1 : 7; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	float GravityScale; // 0x294(0x04)
	float MaxStepHeight; // 0x298(0x04)
	float JumpZVelocity; // 0x29c(0x04)
	float JumpOffJumpZFactor; // 0x2a0(0x04)
	float *fa8f1fd3c5; // 0x2a4(0x04)
	float *6a63fdee84; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	float *abc0cd5685; // 0x2b0(0x04)
	float *73183d834f; // 0x2b4(0x04)
	char pad_2B8[0x8]; // 0x2b8(0x08)
	enum class EMovementMode MovementMode; // 0x2c0(0x01)
	bool CustomMovementMode; // 0x2c1(0x01)
	char pad_2C2[0x1e]; // 0x2c2(0x1e)
	float GroundFriction; // 0x2e0(0x04)
	float MaxWalkSpeed; // 0x2e4(0x04)
	float MaxWalkSpeedCrouched; // 0x2e8(0x04)
	float MaxSwimSpeed; // 0x2ec(0x04)
	float MaxFlySpeed; // 0x2f0(0x04)
	float MaxCustomMovementSpeed; // 0x2f4(0x04)
	float MaxAcceleration; // 0x2f8(0x04)
	float BrakingFrictionFactor; // 0x2fc(0x04)
	float BrakingFriction; // 0x300(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x304(0x01)
	char pad_304_1 : 7; // 0x304(0x01)
	char pad_305[0x3]; // 0x305(0x03)
	float BrakingDecelerationWalking; // 0x308(0x04)
	float BrakingDecelerationFalling; // 0x30c(0x04)
	float BrakingDecelerationSwimming; // 0x310(0x04)
	float BrakingDecelerationFlying; // 0x314(0x04)
	float AirControl; // 0x318(0x04)
	float AirControlBoostMultiplier; // 0x31c(0x04)
	float AirControlBoostVelocityThreshold; // 0x320(0x04)
	float FallingLateralFriction; // 0x324(0x04)
	float CrouchedHalfHeight; // 0x328(0x04)
	float PronedHalfHeight; // 0x32c(0x04)
	float PronedRadius; // 0x330(0x04)
	float Buoyancy; // 0x334(0x04)
	float PerchRadiusThreshold; // 0x338(0x04)
	float PerchAdditionalHeight; // 0x33c(0x04)
	struct FRotator RotationRate; // 0x340(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x34c(0x01)
	char bOrientRotationToMovement : 1; // 0x34c(0x01)
	char bSweepWhileNavWalking : 1; // 0x34c(0x01)
	char pad_34C_3 : 2; // 0x34c(0x01)
	char *3a41001e8f : 1; // 0x34c(0x01)
	char *181cbd7fbd : 1; // 0x34c(0x01)
	char bForceMaxAccel : 1; // 0x34c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x34d(0x01)
	char bForceNextFloorCheck : 1; // 0x34d(0x01)
	char *55d98c9816 : 1; // 0x34d(0x01)
	char bCanWalkOffLedges : 1; // 0x34d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x34d(0x01)
	char pad_34D_5 : 2; // 0x34d(0x01)
	char *a181fe0a7a : 1; // 0x34d(0x01)
	char *bc1853d4a4 : 1; // 0x34e(0x01)
	char pad_34E_1 : 7; // 0x34e(0x01)
	char pad_34F[0x1]; // 0x34f(0x01)
	struct USceneComponent* *dd5532d1f3; // 0x350(0x08)
	float MaxOutOfWaterStepHeight; // 0x358(0x04)
	float OutofWaterZ; // 0x35c(0x04)
	float Mass; // 0x360(0x04)
	bool bEnablePhysicsInteraction; // 0x364(0x01)
	bool bTouchForceScaledToMass; // 0x365(0x01)
	bool bPushForceScaledToMass; // 0x366(0x01)
	bool bPushForceUsingZOffset; // 0x367(0x01)
	bool bScalePushForceToVelocity; // 0x368(0x01)
	char pad_369[0x3]; // 0x369(0x03)
	float StandingDownwardForceScale; // 0x36c(0x04)
	float InitialPushForceFactor; // 0x370(0x04)
	float PushForceFactor; // 0x374(0x04)
	float PushForcePointZOffsetFactor; // 0x378(0x04)
	float TouchForceFactor; // 0x37c(0x04)
	float MinTouchForce; // 0x380(0x04)
	float MaxTouchForce; // 0x384(0x04)
	float RepulsionForce; // 0x388(0x04)
	char bForceBraking : 1; // 0x38c(0x01)
	char pad_38C_1 : 7; // 0x38c(0x01)
	char pad_38D[0x3]; // 0x38d(0x03)
	float CrouchedSpeedMultiplier; // 0x390(0x04)
	float UpperImpactNormalScale; // 0x394(0x04)
	struct FVector Acceleration; // 0x398(0x0c)
	struct FVector *b38db9fa0a; // 0x3a4(0x0c)
	struct FQuat *cb13287acd; // 0x3b0(0x10)
	struct FVector *2326939532; // 0x3c0(0x0c)
	float *2c8a26d287; // 0x3cc(0x04)
	float *a5a6a835a3; // 0x3d0(0x04)
	float *21abb31899; // 0x3d4(0x04)
	struct FVector *3c6c846d6e; // 0x3d8(0x0c)
	struct FVector *e826a5d8b4; // 0x3e4(0x0c)
	float *c22b8bcc91; // 0x3f0(0x04)
	char pad_3F4[0x8]; // 0x3f4(0x08)
	float MaxSimulationTimeStep; // 0x3fc(0x04)
	int32 MaxSimulationIterations; // 0x400(0x04)
	float MaxDepenetrationWithGeometry; // 0x404(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x408(0x04)
	float MaxDepenetrationWithPawn; // 0x40c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x410(0x04)
	float *e1309db822; // 0x414(0x04)
	float *62cdf6b6f5; // 0x418(0x04)
	float *32491f59b3; // 0x41c(0x04)
	float *a3c5a0cc2f; // 0x420(0x04)
	float *9a25d8eb73; // 0x424(0x04)
	float *ecdd5ac4d1; // 0x428(0x04)
	float *6b8c95142c; // 0x42c(0x04)
	float *7119fd2666; // 0x430(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	float *416fcf627d; // 0x438(0x04)
	float *212ee42817; // 0x43c(0x04)
	float *bfd8190383; // 0x440(0x04)
	float *71f6b1e9a2; // 0x444(0x04)
	float LedgeCheckThreshold; // 0x448(0x04)
	float JumpOutOfWaterPitch; // 0x44c(0x04)
	struct F*722e4d89eb CurrentFloor; // 0x450(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4e8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4e9(0x01)
	enum class EMovementMode *7f8d102d5b; // 0x4ea(0x01)
	char pad_4EB[0x1]; // 0x4eb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityX : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityY : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4ec(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4ec(0x01)
	char bJustTeleported : 1; // 0x4ec(0x01)
	char *4daca329e5 : 1; // 0x4ec(0x01)
	char *6c90dcabf5 : 1; // 0x4ec(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4ed(0x01)
	char bNotifyApex : 1; // 0x4ed(0x01)
	char *10ced04b9c : 1; // 0x4ed(0x01)
	char bWantsToCrouch : 1; // 0x4ed(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4ed(0x01)
	char pad_4ED_5 : 3; // 0x4ed(0x01)
	char pad_4EE[0x2]; // 0x4ee(0x02)
	enum class EStanceMode StanceMode; // 0x4f0(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x4f1(0x01)
	char pad_4F2[0x2]; // 0x4f2(0x02)
	char bIgnoreBaseRotation : 1; // 0x4f4(0x01)
	char *38aadbe468 : 1; // 0x4f4(0x01)
	char bAlwaysCheckFloor : 1; // 0x4f4(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x4f4(0x01)
	char *e2a28f8307 : 1; // 0x4f4(0x01)
	char *d68f5f981a : 1; // 0x4f4(0x01)
	char bUseRVOAvoidance : 1; // 0x4f4(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x4f4(0x01)
	char pad_4F5[0xf]; // 0x4f5(0x0f)
	char *7b3f475677 : 1; // 0x504(0x01)
	char *104ee2c836 : 1; // 0x504(0x01)
	char *628968668d : 1; // 0x504(0x01)
	char pad_504_3 : 2; // 0x504(0x01)
	char bProjectNavMeshWalking : 1; // 0x504(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x504(0x01)
	char pad_504_7 : 1; // 0x504(0x01)
	char pad_505[0x13]; // 0x505(0x13)
	float AvoidanceConsiderationRadius; // 0x518(0x04)
	struct FVector *065ad3559c; // 0x51c(0x0c)
	int32 AvoidanceUID; // 0x528(0x04)
	struct F*056e48c16d AvoidanceGroup; // 0x52c(0x04)
	struct F*056e48c16d GroupsToAvoid; // 0x530(0x04)
	struct F*056e48c16d GroupsToIgnore; // 0x534(0x04)
	float AvoidanceWeight; // 0x538(0x04)
	struct FVector *2a911bb8e7; // 0x53c(0x0c)
	char pad_548[0xa8]; // 0x548(0xa8)
	float NavMeshProjectionInterval; // 0x5f0(0x04)
	float *d098fcb6a4; // 0x5f4(0x04)
	float NavMeshProjectionInterpSpeed; // 0x5f8(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x5fc(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x600(0x04)
	float NavWalkingFloorDistTolerance; // 0x604(0x04)
	char pad_608[0xb0]; // 0x608(0xb0)
	struct F*76138ff06a *9a60267788; // 0x6b8(0x58)
	char pad_710[0x10]; // 0x710(0x10)
	float *22fd1c7889; // 0x720(0x04)
	char pad_724[0x4]; // 0x724(0x04)
	struct FRootMotionSourceGroup *0568a1fe71; // 0x728(0x100)
	char pad_828[0x98]; // 0x828(0x98)
	struct F*627659f0e8 *add4ad8474; // 0x8c0(0x40)
	struct FVector *c3deac0730; // 0x900(0x0c)
	bool *2c10e261b6; // 0x90c(0x01)
	char pad_90D[0x3]; // 0x90d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x910(0x01)
	char pad_910_1 : 7; // 0x910(0x01)
	char pad_911[0xf]; // 0x911(0x0f)

	void *9fd6ee3699(); // Function Engine.CharacterMovementComponent.*9fd6ee3699 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f0734
	void *658ba87d09(); // Function Engine.CharacterMovementComponent.*658ba87d09 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1f1c
	void *0c76887b2d(); // Function Engine.CharacterMovementComponent.*0c76887b2d // Final|Native|Public|BlueprintCallable // @ game+0x64f0614
	void *2dac781daa(); // Function Engine.CharacterMovementComponent.*2dac781daa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3cb8
	void *fe0be86a58(); // Function Engine.CharacterMovementComponent.*fe0be86a58 // Final|Native|Public|BlueprintCallable // @ game+0x64f6354
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x64db648
	void AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5320
	void *6c8dd965b4(); // Function Engine.CharacterMovementComponent.*6c8dd965b4 // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x64f6560
	void *94f636ce1d(); // Function Engine.CharacterMovementComponent.*94f636ce1d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e79a4
	void *0452b20aef(); // Function Engine.CharacterMovementComponent.*0452b20aef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e80c0
	bool CapsuleTouched(); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x64d7294
	void *7f595838bc(); // Function Engine.CharacterMovementComponent.*7f595838bc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de25c
	void *53963c7cc3(); // Function Engine.CharacterMovementComponent.*53963c7cc3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64def74
	struct FVector AddImpulse(); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5964
	void *147ef7dd14(); // Function Engine.CharacterMovementComponent.*147ef7dd14 // Final|Native|Public|BlueprintCallable // @ game+0x64f06a8
	void *13f0640241(); // Function Engine.CharacterMovementComponent.*13f0640241 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7ee8
	void *a29777516d(); // Function Engine.CharacterMovementComponent.*a29777516d // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f2d38
	void *07353d85d0(); // Function Engine.CharacterMovementComponent.*07353d85d0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfbf0
	void *91171cfb26(); // Function Engine.CharacterMovementComponent.*91171cfb26 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e20d4
	void *7189be6350(); // Function Engine.CharacterMovementComponent.*7189be6350 // Final|Native|Public|BlueprintCallable // @ game+0x64f4c68
	void *e9bb4bf72b(struct FHitResult Hit); // Function Engine.CharacterMovementComponent.*e9bb4bf72b // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e5048
	bool *1824662e69(); // Function Engine.CharacterMovementComponent.*1824662e69 // Native|Public|BlueprintCallable // @ game+0x64d6e90
	void *e7264375ff(); // Function Engine.CharacterMovementComponent.*e7264375ff // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57eda1c
	void *d87d4eadbf(); // Function Engine.CharacterMovementComponent.*d87d4eadbf // Final|Native|Public|BlueprintCallable // @ game+0x64f2cac
	void *e20c938d2b(); // Function Engine.CharacterMovementComponent.*e20c938d2b // Final|Native|Public|BlueprintCallable // @ game+0x64f2dd4
	float *fff693c5d1(); // Function Engine.CharacterMovementComponent.*fff693c5d1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7500
	void *f34d54f218(); // Function Engine.CharacterMovementComponent.*f34d54f218 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1f48
	void *52493b55a9(); // Function Engine.CharacterMovementComponent.*52493b55a9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1f74
	void *6b112f30eb(); // Function Engine.CharacterMovementComponent.*6b112f30eb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2d7c
	void *c321d72587(); // Function Engine.CharacterMovementComponent.*c321d72587 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f2e60
	void *6910913444(); // Function Engine.CharacterMovementComponent.*6910913444 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57aa900
	void *d855a114c2(); // Function Engine.CharacterMovementComponent.*d855a114c2 // Final|Native|Public|BlueprintCallable // @ game+0x64f62bc
	void *10628ed3f7(); // Function Engine.CharacterMovementComponent.*10628ed3f7 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0b20
	enum class EMovementMode *9f0cb1dccd(); // Function Engine.CharacterMovementComponent.*9f0cb1dccd // Native|Public|BlueprintCallable // @ game+0x64f402c
	void *3040c850fd(); // Function Engine.CharacterMovementComponent.*3040c850fd // Native|Public|BlueprintCallable // @ game+0x6effc4
	void *ee2c7d3fc7(); // Function Engine.CharacterMovementComponent.*ee2c7d3fc7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4c24
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject {

	struct FString MakeStringAssetReference(); // Function Engine.BlueprintFunctionLibrary.MakeStringAssetReference // Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x652b584
};

// Class Engine.StaticMeshActor
// Size: 0x3f8 (Inherited: 0x3e8)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3e8(0x08)
	bool bStaticMeshReplicateMovement; // 0x3f0(0x01)
	enum class ENavDataGatheringMode *c609dcac1c; // 0x3f1(0x01)
	char pad_3F2[0x6]; // 0x3f2(0x06)
};

// Class Engine.HUD
// Size: 0x4d0 (Inherited: 0x3e8)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x3e8(0x08)
	char bLostFocusPaused : 1; // 0x3f0(0x01)
	char bShowHUD : 1; // 0x3f0(0x01)
	char bShowDebugInfo : 1; // 0x3f0(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x3f0(0x01)
	char bShowOverlays : 1; // 0x3f0(0x01)
	char bEnableDebugTextShadow : 1; // 0x3f0(0x01)
	char pad_3F0_6 : 2; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct TArray<struct AActor*> *ebd7d5061f; // 0x3f8(0x10)
	char pad_408[0x8]; // 0x408(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x410(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x420(0x10)
	struct UCanvas* Canvas; // 0x430(0x08)
	struct UCanvas* *0d29f139dd; // 0x438(0x08)
	struct TArray<struct F*3211ef0a69> *ecb7863718; // 0x440(0x10)
	struct UClass* *08814e006a; // 0x450(0x08)
	struct AActor* *af2f44f80d; // 0x458(0x08)
	char pad_460[0x70]; // 0x460(0x70)

	void ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x64f660c
	float *230588c472(struct FString Text, float ScreenX); // Function Engine.HUD.*230588c472 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dc560
	float *79b5cb8643(float Param2, struct FVector Param4, bool Param6, bool Param8); // Function Engine.HUD.*79b5cb8643 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d4eac
	struct FVector2D *20afb725bc(struct FVector2D V0_UV, struct FVector2D V2_UV, struct FLinearColor V1_Color); // Function Engine.HUD.*20afb725bc // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dc014
	struct FVector Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ebf28
	float *237a6ec72d(struct UFont* Font); // Function Engine.HUD.*237a6ec72d // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3770
	bool *c58acecd13(float ScreenX, float Rotation); // Function Engine.HUD.*c58acecd13 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64db934
	void ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x32e590
	void *7eacfe0be3(); // Function Engine.HUD.*7eacfe0be3 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x580e2ac
	struct FVector2D *8859b9196f(struct TArray<struct AActor*> OutActors); // Function Engine.HUD.*8859b9196f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x64dde30
	void *1ac67b0b0c(); // Function Engine.HUD.*1ac67b0b0c // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2a74
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0xc7da20
	void ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x32e590
	struct FLinearColor *d94ebbc912(float ScreenX, float ScreenW); // Function Engine.HUD.*d94ebbc912 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dc384
	void *a86621049b(); // Function Engine.HUD.*a86621049b // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x64ec1d0
	float *243680367d(); // Function Engine.HUD.*243680367d // Final|Native|Public|BlueprintCallable // @ game+0x64dcd28
	void Deproject(float ScreenX, struct FVector WorldPosition); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64daff4
	void *6f61339728(); // Function Engine.HUD.*6f61339728 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x64ec384
	void ShowDebugToggleSubCategory(); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x64f6760
	struct FVector2D AddHitBox(struct FVector2D Size, bool bConsumesInput); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d579c
	void ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x64f66a0
	struct FLinearColor *00ad7eb6f8(); // Function Engine.HUD.*00ad7eb6f8 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64db708
	float DrawTexture(struct UTexture* Texture, float ScreenY, float ScreenH); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dc818
	void ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x32e590
	int32 ReceiveDrawHUD(); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x32e590
	struct UMaterialInterface* *71be62ac5d(float ScreenX, float ScreenW, float Scale); // Function Engine.HUD.*71be62ac5d // Final|Native|Public|BlueprintCallable // @ game+0x64dbd9c
};

// Class Engine.Brush
// Size: 0x420 (Inherited: 0x3e8)
struct ABrush : AActor {
	enum class *6e8770e217 *e507f4dc1d; // 0x3e8(0x01)
	char pad_3E9[0x3]; // 0x3e9(0x03)
	struct FColor BrushColor; // 0x3ec(0x04)
	int32 PolyFlags; // 0x3f0(0x04)
	char *41f7cd1aa2 : 1; // 0x3f4(0x01)
	char *dec024378d : 1; // 0x3f4(0x01)
	char *9d800fe794 : 1; // 0x3f4(0x01)
	char *a42f9041c9 : 1; // 0x3f4(0x01)
	char pad_3F4_4 : 4; // 0x3f4(0x01)
	char pad_3F5[0x3]; // 0x3f5(0x03)
	struct UModel* Brush; // 0x3f8(0x08)
	struct UBrushComponent* BrushComponent; // 0x400(0x08)
	char *9daf5965a3 : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct TArray<struct F*9c7d57f967> *3c19074f41; // 0x410(0x10)
};

// Class Engine.Volume
// Size: 0x420 (Inherited: 0x420)
struct AVolume : ABrush {
};

// Class Engine.AnimNotify
// Size: 0x38 (Inherited: 0x28)
struct UAnimNotify : UObject {
	char pad_28[0x10]; // 0x28(0x10)

	void Received_Notify(struct USkeletalMeshComponent* MeshComp); // Function Engine.AnimNotify.Received_Notify // Event|Public|BlueprintEvent|Const // @ game+0x32e590
	void GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x64e2344
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x38)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct FVector LocationOffset; // 0x40(0x0c)
	struct FRotator RotationOffset; // 0x4c(0x0c)
	char pad_58[0x18]; // 0x58(0x18)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x30 (Inherited: 0x28)
struct UAnimNotifyState : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	float Received_NotifyTick(); // Function Engine.AnimNotifyState.Received_NotifyTick // Event|Public|BlueprintEvent|Const // @ game+0x32e590
	void Received_NotifyBegin(struct UAnimSequenceBase* Animation); // Function Engine.AnimNotifyState.Received_NotifyBegin // Event|Public|BlueprintEvent|Const // @ game+0x32e590
	struct UAnimSequenceBase* Received_NotifyEnd(); // Function Engine.AnimNotifyState.Received_NotifyEnd // Event|Public|BlueprintEvent|Const // @ game+0x32e590
	void GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x64e2344
};

// Class Engine.DataTable
// Size: 0x80 (Inherited: 0x28)
struct UDataTable : UObject {
	struct UScriptStruct* *6a0e474767; // 0x28(0x08)
	char pad_30[0x50]; // 0x30(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x450)
struct ACharacter : APawn {
	int32 JumpMaxCount; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)
	struct UCapsuleComponent* CapsuleComponent; // 0x458(0x08)
	bool *a08ccf36b9; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct F*fdb76a0b2f *3aef46cc56; // 0x468(0x48)
	bool *5487c0eb5a; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	float JumpMaxHoldTime; // 0x4b4(0x04)
	float *8282d7bae1; // 0x4b8(0x04)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct FQuat *9a1399a27e; // 0x4c0(0x10)
	struct F*fdb76a0b2f *35d4fdbf05; // 0x4d0(0x48)
	struct USkeletalMeshComponent* Mesh; // 0x518(0x08)
	char bPressedJump : 1; // 0x520(0x01)
	char *b6ecb6139d : 1; // 0x520(0x01)
	char *f24257721c : 1; // 0x520(0x01)
	char *7c13366d17 : 1; // 0x520(0x01)
	char *4fb6a4f581 : 1; // 0x520(0x01)
	char *6e32dcbd7c : 1; // 0x520(0x01)
	char *1330ddef84 : 1; // 0x520(0x01)
	char *4c2b4c8150 : 1; // 0x520(0x01)
	char bWasJumping : 1; // 0x521(0x01)
	char pad_521_1 : 7; // 0x521(0x01)
	char pad_522[0x2]; // 0x522(0x02)
	struct FVector *9503c1703e; // 0x524(0x0c)
	float CrouchedEyeHeight; // 0x530(0x04)
	char bIsCrouched : 1; // 0x534(0x01)
	char pad_534_1 : 7; // 0x534(0x01)
	char pad_535[0x3]; // 0x535(0x03)
	float JumpKeyHoldTime; // 0x538(0x04)
	float *2cfd1e1c0a; // 0x53c(0x04)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x540(0x08)
	struct UCharacterMovementComponent* CharacterMovement; // 0x548(0x08)
	int32 JumpCurrentCount; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	struct FMulticastDelegate OnReachedJumpApex; // 0x558(0x10)
	char pad_568[0x10]; // 0x568(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x578(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x588(0x10)
	struct FRootMotionSourceGroup *9e3b80c0bc; // 0x598(0x100)
	char pad_698[0x8]; // 0x698(0x08)
	struct F*627659f0e8 *f3302eb91e; // 0x6a0(0x40)
	struct TArray<struct F*9758e900e3> *2f15cfb895; // 0x6e0(0x10)
	struct F*a9dde184de *ed92183131; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	bool *c843ca3e4f(bool Param2, float Param4, struct FVector_NetQuantize100 Param6, bool Param8); // Function Engine.Character.*c843ca3e4f // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ed948
	void *8a872d2897(); // Function Engine.Character.*8a872d2897 // Native|Public|BlueprintCallable // @ game+0x64f72f4
	bool *8370e81c2a(struct FVector Param1, struct FVector Param3, struct FName Param5); // Function Engine.Character.*8370e81c2a // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0xa207c0
	float K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x32e590
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x64eafbc
	void CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x64d717c
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x7168e8
	struct UPrimitiveComponent* ServerMove(struct FName Param7); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ecfcc
	void *82a7fc0378(); // Function Engine.Character.*82a7fc0378 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4e6c
	bool OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x32e590
	void *2ffe47f2b1(); // Function Engine.Character.*2ffe47f2b1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de274
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x64e5120
	void OnWalkingOffLedge(struct FVector PreviousFloorContactNormal); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xba7234
	void ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x34b1bc
	struct UAnimMontage* *972000ab2b(float InPlayRate); // Function Engine.Character.*972000ab2b // Native|Public|BlueprintCallable // @ game+0x64eb5d0
	void *b4b3ca13a4(); // Function Engine.Character.*b4b3ca13a4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xb943c0
	void *925fe8d3ea(); // Function Engine.Character.*925fe8d3ea // Native|Public|BlueprintCallable // @ game+0x64f5020
	void *b84654cf54(); // Function Engine.Character.*b84654cf54 // Final|Native|Public|BlueprintCallable // @ game+0x64dfc18
	void *6d4709a5ef(); // Function Engine.Character.*6d4709a5ef // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de43c
	bool *edfb88bd75(float Param0, struct FVector Param2, float Param4); // Function Engine.Character.*edfb88bd75 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64d7890
	bool *9deef22338(struct FVector_NetQuantize10 Param1, uint32 Param3, struct FVector_NetQuantize10 Param5, bool Param7); // Function Engine.Character.*9deef22338 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64edec8
	void *8b6d00d4e5(); // Function Engine.Character.*8b6d00d4e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de484
	void *5c525c793d(); // Function Engine.Character.*5c525c793d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d6d84
	void K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x32e590
	void OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x32e590
	bool LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ea46c
	void *a7355a3acf(); // Function Engine.Character.*a7355a3acf // Native|Public|BlueprintCallable // @ game+0x64f7798
	void CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d7158
	struct FVector_NetQuantize100 *a56b7b5859(bool Param7, uint32 Param9, struct FName Param11); // Function Engine.Character.*a56b7b5859 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ed3c8
	struct FVector_NetQuantize10 *21c34738dd(); // Function Engine.Character.*21c34738dd // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ee6d4
	enum class EMovementMode K2_OnMovementModeChanged(enum class EMovementMode NewMovementMode); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x32e590
	void Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x64daf10
	float *403a59b916(struct UPrimitiveComponent* Param7, bool Param9); // Function Engine.Character.*403a59b916 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64d7c24
	bool *2168d1ee10(); // Function Engine.Character.*2168d1ee10 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64da1e4
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x57b17e8
	void *bfd2003b09(); // Function Engine.Character.*bfd2003b09 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4e48
	void *bf5bca255c(); // Function Engine.Character.*bf5bca255c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5728ac0
	float K2_OnStartCrouch(); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x32e590
	void *59137a9491(); // Function Engine.Character.*59137a9491 // Native|Public|BlueprintCallable // @ game+0x64f6fe8
	bool *b10d651cf7(float Param0, struct FVector_NetQuantize100 Param2, bool Param4); // Function Engine.Character.*b10d651cf7 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ee390
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x5785614
	void IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e44ac
	void *e33839d558(); // Function Engine.Character.*e33839d558 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5815860
};

// Class Engine.Controller
// Size: 0x468 (Inherited: 0x3e8)
struct AController : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct FName StateName; // 0x3f0(0x08)
	struct APlayerState* PlayerState; // 0x3f8(0x08)
	struct USceneComponent* TransformComponent; // 0x400(0x08)
	char pad_408[0x28]; // 0x408(0x28)
	struct APawn* Pawn; // 0x430(0x08)
	char *2037508fdb : 1; // 0x438(0x01)
	char *e4df4b351c : 1; // 0x438(0x01)
	char pad_438_2 : 6; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	struct FRotator *86cbcf5377; // 0x43c(0x0c)
	struct ACharacter* Character; // 0x448(0x08)
	char pad_450[0x8]; // 0x450(0x08)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x458(0x10)

	void *962f4aad33(); // Function Engine.Controller.*962f4aad33 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0xb721d0
	void GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64df764
	void K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e7f40
	void *a0460f48ea(); // Function Engine.Controller.*a0460f48ea // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4a70
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x64f730c
	void *aff2b06803(); // Function Engine.Controller.*aff2b06803 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4e2c
	bool *6b9f58d27f(); // Function Engine.Controller.*6b9f58d27f // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ea6f0
	void *ab6c7d5021(); // Function Engine.Controller.*ab6c7d5021 // Native|Public|BlueprintCallable // @ game+0x64f3120
	void *5029bb8f19(struct FVector Param0); // Function Engine.Controller.*5029bb8f19 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d95fc
	void *dfeb0b0e7e(); // Function Engine.Controller.*dfeb0b0e7e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64f1fd0
	struct AActor* ReceiveInstigatedAnyDamage(); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x32e590
	void *05c9ee399f(); // Function Engine.Controller.*05c9ee399f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4bac
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x8aa9e0
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x57b29c8
	void *c01988db06(); // Function Engine.Controller.*c01988db06 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4a48
	void *4f8918160c(); // Function Engine.Controller.*4f8918160c // Native|Public|BlueprintCallable // @ game+0x64ec6cc
	void *b10cb0e752(); // Function Engine.Controller.*b10cb0e752 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfd0c
	void *acd547e5d2(); // Function Engine.Controller.*acd547e5d2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4ab4
	void *545f74ebe7(); // Function Engine.Controller.*545f74ebe7 // Final|Native|Public|BlueprintCallable // @ game+0x64d74e8
	void *3e765612de(); // Function Engine.Controller.*3e765612de // Native|Public|BlueprintCallable // @ game+0x57afaa0
	void *869d9be173(); // Function Engine.Controller.*869d9be173 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3ebc
	void Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x576283c
	void *4405c697bf(); // Function Engine.Controller.*4405c697bf // Native|Public|BlueprintCallable // @ game+0x64ec6b4
	void *116e3e6556(); // Function Engine.Controller.*116e3e6556 // Native|Public|BlueprintCallable // @ game+0x64f7830
	void *7315ed88c4(); // Function Engine.Controller.*7315ed88c4 // Native|Public|BlueprintCallable // @ game+0xb4d208
};

// Class Engine.SpringArmComponent
// Size: 0x4e0 (Inherited: 0x460)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x458(0x04)
	struct FVector SocketOffset; // 0x45c(0x0c)
	struct FVector TargetOffset; // 0x468(0x0c)
	float ProbeSize; // 0x474(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x478(0x01)
	char bDoCollisionTest : 1; // 0x47c(0x01)
	char bUsePawnControlRotation : 1; // 0x47c(0x01)
	char bInheritPitch : 1; // 0x47c(0x01)
	char bInheritYaw : 1; // 0x47c(0x01)
	char bInheritRoll : 1; // 0x47c(0x01)
	char bLockPitchLag : 1; // 0x47c(0x01)
	char bLockYawLag : 1; // 0x47c(0x01)
	char bLockRollLag : 1; // 0x47c(0x01)
	char bEnableCameraLag : 1; // 0x47d(0x01)
	char bEnableCameraRotationLag : 1; // 0x47d(0x01)
	char bUseCameraLagSubstepping : 1; // 0x47d(0x01)
	char bDrawDebugLagMarkers : 1; // 0x47d(0x01)
	float CameraLagSpeed; // 0x480(0x04)
	float CameraRotationLagSpeed; // 0x484(0x04)
	float CameraLagMaxTimeStep; // 0x488(0x04)
	float CameraLagMaxDistance; // 0x48c(0x04)
	char pad_492[0x4e]; // 0x492(0x4e)
};

// Class Engine.PlayerController
// Size: 0x7a0 (Inherited: 0x468)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)
	struct APawn* *6a4cba1840; // 0x478(0x08)
	struct U*e3e1c98a8e* *ba4f6cd603; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)
	struct AHUD* *04081450f1; // 0x490(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x498(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4a0(0x08)
	bool *4ec6b44b0b; // 0x4a8(0x01)
	char pad_4A9[0x3]; // 0x4a9(0x03)
	struct FRotator TargetViewRotation; // 0x4ac(0x0c)
	char pad_4B8[0xc]; // 0x4b8(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4c4(0x04)
	struct TArray<struct AActor*> *1c7ef4d523; // 0x4c8(0x10)
	char pad_4D8[0x4]; // 0x4d8(0x04)
	float *ba0265b64d; // 0x4dc(0x04)
	struct FVector *1a41b5e739; // 0x4e0(0x0c)
	struct FRotator *86cb465afb; // 0x4ec(0x0c)
	int32 *44b280390c; // 0x4f8(0x04)
	char pad_4FC[0x4]; // 0x4fc(0x04)
	struct UCheatManager* CheatManager; // 0x500(0x08)
	struct UClass* CheatClass; // 0x508(0x08)
	struct UPlayerInput* PlayerInput; // 0x510(0x08)
	struct TArray<struct F*3715816a7a> *34d360a810; // 0x518(0x10)
	char pad_528[0x90]; // 0x528(0x90)
	char pad_5B8_0 : 3; // 0x5b8(0x01)
	char bPlayerIsWaiting : 1; // 0x5b8(0x01)
	char pad_5B8_4 : 4; // 0x5b8(0x01)
	char pad_5B9[0x3]; // 0x5b9(0x03)
	bool *81aa8c666f; // 0x5bc(0x01)
	char pad_5BD[0x3b]; // 0x5bd(0x3b)
	struct UNetConnection* *44f81e9eea; // 0x5f8(0x08)
	struct UNetConnection* NetConnection; // 0x600(0x08)
	char pad_608[0xc]; // 0x608(0x0c)
	float InputYawScale; // 0x614(0x04)
	float InputPitchScale; // 0x618(0x04)
	float InputRollScale; // 0x61c(0x04)
	char bShowMouseCursor : 1; // 0x620(0x01)
	char bEnableClickEvents : 1; // 0x620(0x01)
	char bEnableTouchEvents : 1; // 0x620(0x01)
	char bEnableMouseOverEvents : 1; // 0x620(0x01)
	char bEnableTouchOverEvents : 1; // 0x620(0x01)
	char bForceFeedbackEnabled : 1; // 0x620(0x01)
	char pad_620_6 : 2; // 0x620(0x01)
	char pad_621[0x7]; // 0x621(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x628(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x638(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x639(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x63a(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x63b(0x01)
	float HitResultTraceDistance; // 0x63c(0x04)
	char pad_640[0x80]; // 0x640(0x80)
	struct U*37a897c2a6* *306ff6bcbf; // 0x6c0(0x08)
	char pad_6C8_0 : 3; // 0x6c8(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6c8(0x01)
	char pad_6C8_4 : 4; // 0x6c8(0x01)
	char pad_6C9[0x17]; // 0x6c9(0x17)
	struct UTouchInterface* *df1d787aeb; // 0x6e0(0x08)
	char pad_6E8[0x40]; // 0x6e8(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x728(0x08)
	struct FVector SpawnLocation; // 0x730(0x0c)
	char pad_73C[0x4]; // 0x73c(0x04)
	bool *87b6227a52; // 0x740(0x01)
	char pad_741[0x1]; // 0x741(0x01)
	uint16 *efcb195a25; // 0x742(0x02)
	uint16 *d04a484e7d; // 0x744(0x02)
	char pad_746[0x2]; // 0x746(0x02)
	struct AActor* *f63237023a; // 0x748(0x08)
	struct AActor* *d886600ea5; // 0x750(0x08)
	char pad_758[0x48]; // 0x758(0x48)

	void *ab46466854(); // Function Engine.PlayerController.*ab46466854 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d837c
	bool *c9154578aa(); // Function Engine.PlayerController.*c9154578aa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8da4
	void LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x64ea834
	void ServerUpdateLevelVisibility(); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xa98a38
	float *559f3a7288(); // Function Engine.PlayerController.*559f3a7288 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d92fc
	void *662f19b64b(float Param1); // Function Engine.PlayerController.*662f19b64b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d94d4
	void *51bb1b7e14(); // Function Engine.PlayerController.*51bb1b7e14 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ee99c
	void *d865da1570(); // Function Engine.PlayerController.*d865da1570 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64da00c
	void *b761367baa(); // Function Engine.PlayerController.*b761367baa // Native|Public|BlueprintCallable // @ game+0x64f6224
	void *f9de26ecaa(); // Function Engine.PlayerController.*f9de26ecaa // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3ee4
	struct FName *7c562762e1(); // Function Engine.PlayerController.*7c562762e1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d9aa4
	void *c859b2be62(); // Function Engine.PlayerController.*c859b2be62 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8108
	void *6a2f785a50(struct UClass* Shake); // Function Engine.PlayerController.*6a2f785a50 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x64d98e0
	void SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x64f410c
	struct UForceFeedbackEffect* *9d5e26bec5(); // Function Engine.PlayerController.*9d5e26bec5 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x64d99c4
	void *4468a93312(); // Function Engine.PlayerController.*4468a93312 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb3f9e0
	void *b485fdf911(struct FKey Key); // Function Engine.PlayerController.*b485fdf911 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64f79d8
	float *c24283339d(struct U*f1b0840319* HapticEffect); // Function Engine.PlayerController.*c24283339d // Final|Native|Public|BlueprintCallable // @ game+0x64ebda4
	float *ae6aff6c58(); // Function Engine.PlayerController.*ae6aff6c58 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0d2c
	void *13b471381b(); // Function Engine.PlayerController.*13b471381b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xb24f90
	void *86157f4703(); // Function Engine.PlayerController.*86157f4703 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eecec
	void SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x64f7434
	void *08dee7b7b4(); // Function Engine.PlayerController.*08dee7b7b4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xba71b4
	struct UCameraAnim* *5d0a47f76b(float Scale, float BlendInTime, bool bLoop, enum class ECameraAnimPlaySpace Space); // Function Engine.PlayerController.*5d0a47f76b // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x64d8698
	void *dd4eed6524(); // Function Engine.PlayerController.*dd4eed6524 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ece4c
	void *92eb1c672a(); // Function Engine.PlayerController.*92eb1c672a // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eeca0
	void *97866029a2(enum class ETouchIndex FingerIndex, bool bTraceComplex); // Function Engine.PlayerController.*97866029a2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0478
	void *8c147ac969(); // Function Engine.PlayerController.*8c147ac969 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64da4c8
	void *d418e4d62b(); // Function Engine.PlayerController.*d418e4d62b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d984c
	struct UClass* *acfb0a2a60(int32 Param1, struct APlayerState* Param3); // Function Engine.PlayerController.*acfb0a2a60 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8f30
	void *78fabe42dc(); // Function Engine.PlayerController.*78fabe42dc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d9834
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x571ef8c
	struct FKey *4d8a0fc0f4(); // Function Engine.PlayerController.*4d8a0fc0f4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e17d0
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x64ec710
	void *9de9eaecfe(float Frequency); // Function Engine.PlayerController.*9de9eaecfe // Final|Native|Public|BlueprintCallable // @ game+0x64f2efc
	void *bbdb1bd24f(); // Function Engine.PlayerController.*bbdb1bd24f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eee80
	void *43c33d58dd(); // Function Engine.PlayerController.*43c33d58dd // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eef8c
	void Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x64d701c
	void *403bdd06e1(struct FString Param0); // Function Engine.PlayerController.*403bdd06e1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8414
	struct FHitResult *c0318a1033(); // Function Engine.PlayerController.*c0318a1033 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0150
	void *2d0548b040(struct FKey Key); // Function Engine.PlayerController.*2d0548b040 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0c38
	void *adf056a575(); // Function Engine.PlayerController.*adf056a575 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e36b8
	void *bf4dab2329(); // Function Engine.PlayerController.*bf4dab2329 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d92e4
	void *4fb67236ed(); // Function Engine.PlayerController.*4fb67236ed // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x64d97a0
	bool *2ebb436600(); // Function Engine.PlayerController.*2ebb436600 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8c6c
	void AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x64d6208
	void *795eba9f52(); // Function Engine.PlayerController.*795eba9f52 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eef40
	void *d30eb8d01c(); // Function Engine.PlayerController.*d30eb8d01c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d9708
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x64eb1c8
	void *8a4a5b5e1e(); // Function Engine.PlayerController.*8a4a5b5e1e // Net|NetReliableNative|Event|Public|NetClient // @ game+0xba7fb8
	void *61f8c21999(float LocationY); // Function Engine.PlayerController.*61f8c21999 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1fcc
	struct FVector *64beea8065(); // Function Engine.PlayerController.*64beea8065 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f010c
	void *0ef1f5ec13(); // Function Engine.PlayerController.*0ef1f5ec13 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8138
	void *1b5a3aa90c(); // Function Engine.PlayerController.*1b5a3aa90c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8150
	void *56bb0f1181(); // Function Engine.PlayerController.*56bb0f1181 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64da128
	void *dfe66674ee(); // Function Engine.PlayerController.*dfe66674ee // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8168
	struct FHitResult *da0857f36b(); // Function Engine.PlayerController.*da0857f36b // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e02c0
	void *7a4fd55871(bool bTraceComplex); // Function Engine.PlayerController.*7a4fd55871 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dffe0
	struct FKey *23845e204c(); // Function Engine.PlayerController.*23845e204c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4954
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x57fd168
	struct FVector *cf2959b8be(); // Function Engine.PlayerController.*cf2959b8be // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x64eed38
	void ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x8ad1a0
	void *e1ca3da977(); // Function Engine.PlayerController.*e1ca3da977 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ee83c
	void *52b71b8a9e(); // Function Engine.PlayerController.*52b71b8a9e // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x64d8120
	bool *c4ae2f176a(bool Param3); // Function Engine.PlayerController.*c4ae2f176a // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6b3204
	void *1b6c599c99(); // Function Engine.PlayerController.*1b6c599c99 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d90f8
	void *97ee96fbb0(); // Function Engine.PlayerController.*97ee96fbb0 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xc7b7b0
	void *e3d2d62e3b(); // Function Engine.PlayerController.*e3d2d62e3b // Final|Native|Public|BlueprintCallable // @ game+0x64d76dc
	float *cd0ed7643e(); // Function Engine.PlayerController.*cd0ed7643e // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64d8ae8
	void *bd7480c73b(); // Function Engine.PlayerController.*bd7480c73b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f2044
	void *5853422cfa(); // Function Engine.PlayerController.*5853422cfa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ecf34
	void *5fca0030f8(); // Function Engine.PlayerController.*5fca0030f8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d9220
	struct FKey *b5eb53ad0e(); // Function Engine.PlayerController.*b5eb53ad0e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1158
	void *b3c21183d2(float Duration, bool bAffectsLeftSmall, bool bAffectsRightSmall); // Function Engine.PlayerController.*b3c21183d2 // Final|Native|Public|BlueprintCallable // @ game+0x64eba98
	bool *35919963a5(struct FHitResult HitResult); // Function Engine.PlayerController.*35919963a5 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e07d8
	void *68dfc2b6f7(float DeltaX); // Function Engine.PlayerController.*68dfc2b6f7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1414
	void *b2390ab0a2(); // Function Engine.PlayerController.*b2390ab0a2 // Native|Public|BlueprintCallable // @ game+0x64d49bc
	void *d2e6055c43(); // Function Engine.PlayerController.*d2e6055c43 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x57293cc
	void *1c9682404c(); // Function Engine.PlayerController.*1c9682404c // Final|Native|Public|BlueprintCallable // @ game+0x64f725c
	void *7cab1cf9db(); // Function Engine.PlayerController.*7cab1cf9db // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ecd98
	bool *6025a956b9(); // Function Engine.PlayerController.*6025a956b9 // Final|Native|Public|HasDefaults // @ game+0x64d9c60
	void *efcf0317d0(); // Function Engine.PlayerController.*efcf0317d0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xba0e78
	void FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x64dd088
	void ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x64f75c4
	enum class ECameraAnimPlaySpace *16669cfe05(); // Function Engine.PlayerController.*16669cfe05 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0xb0a640
	void *5fce39e8de(); // Function Engine.PlayerController.*5fce39e8de // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ef35c
	void *827ed06000(struct FVector2D ScreenLocation); // Function Engine.PlayerController.*827ed06000 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ebfe8
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x64dafdc
	void *0a98009ba2(); // Function Engine.PlayerController.*0a98009ba2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d82e4
	void *5350f7c24f(); // Function Engine.PlayerController.*5350f7c24f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ef310
	void *b66b4cd46b(enum class ETouchIndex FingerIndex, bool bTraceComplex); // Function Engine.PlayerController.*b66b4cd46b // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0628
	void *04a52a0e21(); // Function Engine.PlayerController.*04a52a0e21 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64f7acc
	float *eb438dd755(); // Function Engine.PlayerController.*eb438dd755 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1518
	void *703938c013(int32 X); // Function Engine.PlayerController.*703938c013 // Final|Native|Public|BlueprintCallable // @ game+0x64f3ebc
	void StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x64f6c18
	bool *affae98f27(); // Function Engine.PlayerController.*affae98f27 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d9e34
	void *0ef46105ab(float Param1); // Function Engine.PlayerController.*0ef46105ab // Net|Native|Event|Public|NetClient // @ game+0x64d89c4
	void *4706b0dd25(); // Function Engine.PlayerController.*4706b0dd25 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xc82808
	void *68263df898(); // Function Engine.PlayerController.*68263df898 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ef3f4
	struct AActor* *cf9e5e1026(); // Function Engine.PlayerController.*cf9e5e1026 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8200
	void *94de0543e5(float Param1); // Function Engine.PlayerController.*94de0543e5 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d774c
	void *d629fba752(); // Function Engine.PlayerController.*d629fba752 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64eb130
	float *b8a2b9a959(); // Function Engine.PlayerController.*b8a2b9a959 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0e74
	struct AActor* *4378cb5b7b(float BlendTime, float BlendExp); // Function Engine.PlayerController.*4378cb5b7b // Native|Public|BlueprintCallable // @ game+0x64f605c
	struct FVector *0cb5679844(); // Function Engine.PlayerController.*0cb5679844 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64db290
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x57b2ecc
	void AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x64d664c
	void ServerUpdateCamera(struct FVector_NetQuantize Param0); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ef0ec
	void *60d2f2e83e(); // Function Engine.PlayerController.*60d2f2e83e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d81e8
	struct AActor* *3e63e83084(); // Function Engine.PlayerController.*3e63e83084 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xaa71bc
	void *26ecccb14e(); // Function Engine.PlayerController.*26ecccb14e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d857c
	void ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d918c
	void *86c5638054(); // Function Engine.PlayerController.*86c5638054 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xb86920
	void *b41ac62737(); // Function Engine.PlayerController.*b41ac62737 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ecf80
	struct FVector DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64db188
	void *bd105c49d6(); // Function Engine.PlayerController.*bd105c49d6 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ef3a8
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x64dcefc
	bool *42c23c4926(); // Function Engine.PlayerController.*42c23c4926 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xa92394
	void *4e8d0e40c4(); // Function Engine.PlayerController.*4e8d0e40c4 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ef218
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x5819c84
	void *1c4adf6d0b(struct FVector RotationRate); // Function Engine.PlayerController.*1c4adf6d0b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e124c
	bool *278a1612b5(); // Function Engine.PlayerController.*278a1612b5 // Native|Public|BlueprintCallable // @ game+0x64f16ac
	void SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x64eccd4
	void *a0b0a56a1d(); // Function Engine.PlayerController.*a0b0a56a1d // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x981d74
	void ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x64da63c
	void *68eef5585b(); // Function Engine.PlayerController.*68eef5585b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfeb0
	void *271d361b1b(bool bLooping); // Function Engine.PlayerController.*271d361b1b // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0xa3fe5c
	void AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x64d6a74
};

// Class Engine.Info
// Size: 0x3e8 (Inherited: 0x3e8)
struct AInfo : AActor {
};

// Class Engine.GameModeBase
// Size: 0x488 (Inherited: 0x3e8)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x3e8(0x10)
	struct UClass* GameSessionClass; // 0x3f8(0x08)
	struct UClass* GameStateClass; // 0x400(0x08)
	struct UClass* PlayerControllerClass; // 0x408(0x08)
	struct UClass* PlayerStateClass; // 0x410(0x08)
	struct FStringClassReference HUDClass; // 0x418(0x10)
	struct UClass* DefaultPawnClass; // 0x428(0x08)
	struct FStringClassReference SpectatorClass; // 0x430(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x440(0x08)
	struct AGameSession* GameSession; // 0x448(0x08)
	struct AGameStateBase* GameState; // 0x450(0x08)
	struct FText *ea2300ff97; // 0x458(0x18)
	char bUseSeamlessTravel : 1; // 0x470(0x01)
	char bStartPlayersAsSpectators : 1; // 0x470(0x01)
	char bPauseable : 1; // 0x470(0x01)
	char pad_470_3 : 5; // 0x470(0x01)
	char pad_471[0x17]; // 0x471(0x17)

	void *54f66c09c1(); // Function Engine.GameModeBase.*54f66c09c1 // Native|Public|BlueprintCallable // @ game+0x64e249c
	struct APlayerController* PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0x867598
	void *ff7bd76d7c(); // Function Engine.GameModeBase.*ff7bd76d7c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57aee60
	void RestartPlayerAtPlayerStart(struct AController* NewPlayer); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x64ec858
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xac23e0
	struct FString *ef6066069a(); // Function Engine.GameModeBase.*ef6066069a // Native|Public|BlueprintCallable // @ game+0x64d7578
	void RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x64ec7c4
	void *b5028fdf32(); // Function Engine.GameModeBase.*b5028fdf32 // Native|Public|BlueprintCallable // @ game+0x64e2580
	void InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xc5568c
	struct AActor* SpawnDefaultPawnFor(); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xb6f180
	void MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xb5b63c
	struct FString FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xb2ea48
	void K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x32e590
	void ChoosePlayerStart(struct AController* Player); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xb69dd0
	void CanSpectate(struct APlayerState* ViewTarget); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x64d71a4
	struct AController* GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xb831ac
	struct AController* SpawnDefaultPawnAtTransform(struct FTransform SpawnTransform); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xbab4c0
	void HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0x867658
	struct AActor* InitStartSpot(); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xc4a9b8
	void K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x32e590
	void RestartPlayerAtTransform(struct AController* NewPlayer); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64ec938
	void K2_OnChangeName(struct AController* Other); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x32e590
	struct FString *86e3800e25(); // Function Engine.GameModeBase.*86e3800e25 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x64e7abc
	struct APlayerController* K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x32e590
	void K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x32e590
	void *3d35c0366a(); // Function Engine.GameModeBase.*3d35c0366a // Native|Public|BlueprintCallable // @ game+0x64eaf90
	struct AActor* ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x64ec2dc
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x581558c
};

// Class Engine.GameMode
// Size: 0x4c8 (Inherited: 0x488)
struct AGameMode : AGameModeBase {
	struct FName *fdf168a227; // 0x488(0x08)
	char bDelayedStart : 1; // 0x490(0x01)
	char pad_490_1 : 7; // 0x490(0x01)
	char pad_491[0x3]; // 0x491(0x03)
	int32 NumSpectators; // 0x494(0x04)
	int32 NumPlayers; // 0x498(0x04)
	int32 NumBots; // 0x49c(0x04)
	float MinRespawnDelay; // 0x4a0(0x04)
	int32 NumTravellingPlayers; // 0x4a4(0x04)
	struct UClass* *e51b494abc; // 0x4a8(0x08)
	struct TArray<struct APlayerState*> *076b29c2b9; // 0x4b0(0x10)
	float *05697249b5; // 0x4c0(0x04)
	bool bHandleDedicatedServerReplays; // 0x4c4(0x01)
	char pad_4C5[0x3]; // 0x4c5(0x03)

	void *4fa79e4abc(); // Function Engine.GameMode.*4fa79e4abc // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4adc
	void *59744331f1(); // Function Engine.GameMode.*59744331f1 // Native|Public|BlueprintCallable // @ game+0x64dd05c
	void *b85bd19301(); // Function Engine.GameMode.*b85bd19301 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4050
	void K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x32e590
	void Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x64ecafc
	void *45c451c13d(); // Function Engine.GameMode.*45c451c13d // Native|Public|BlueprintCallable // @ game+0x64ec6f8
	void *088224d128(); // Function Engine.GameMode.*088224d128 // Native|Public|BlueprintCallable // @ game+0x5785c64
	void *9baee83b47(); // Function Engine.GameMode.*9baee83b47 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1bfc
	void SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x64f07d0
	void ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xbb5c60
	void *558b992273(); // Function Engine.GameMode.*558b992273 // Native|Public|BlueprintCallable // @ game+0x64d496c
	void ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0x9dd6e8
};

// Class Engine.PlayerState
// Size: 0x480 (Inherited: 0x3e8)
struct APlayerState : AInfo {
	char pad_3E8[0x10]; // 0x3e8(0x10)
	char bIsSpectator : 1; // 0x3f8(0x01)
	char *d7a1fd552e : 1; // 0x3f8(0x01)
	char bIsABot : 1; // 0x3f8(0x01)
	char pad_3F8_3 : 1; // 0x3f8(0x01)
	char *6304b8eff5 : 1; // 0x3f8(0x01)
	char *7c4d44b809 : 1; // 0x3f8(0x01)
	char pad_3F8_6 : 2; // 0x3f8(0x01)
	char pad_3F9[0xf]; // 0x3f9(0x0f)
	struct FString *7f441a13dc; // 0x408(0x10)
	struct FUniqueNetIdRepl UniqueId; // 0x418(0x18)
	bool Ping; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	int32 StartTime; // 0x434(0x04)
	float Score; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct UClass* *e51b494abc; // 0x440(0x08)
	int32 PlayerId; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct FString PlayerName; // 0x450(0x10)
	char pad_460[0x18]; // 0x460(0x18)
	bool *93f72aa7fc; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)

	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x57d21a0
	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0xc7da20
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x580ba2c
	void ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x32e590
	void ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x32e590
	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x580ba14
};

// Class Engine.SkeletalMeshActor
// Size: 0x470 (Inherited: 0x3e8)
struct ASkeletalMeshActor : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	char bShouldDoAnimNotifies : 1; // 0x3f0(0x01)
	char bWakeOnLevelStart : 1; // 0x3f0(0x01)
	char pad_3F0_2 : 6; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x3f8(0x08)
	struct USkeletalMesh* *cc378d83c0; // 0x400(0x08)
	struct UPhysicsAsset* *89fe11466c; // 0x408(0x08)
	struct UMaterialInterface* *1e7caac314; // 0x410(0x08)
	struct UMaterialInterface* *db45004a8f; // 0x418(0x08)
	char pad_420[0x50]; // 0x420(0x50)

	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x580ba14
	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x57d21a0
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x580ba2c
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0xc7da20
};

// Class Engine.DestructibleComponent
// Size: 0xcf0 (Inherited: 0xc30)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc28(0x01)
	struct TArray<struct F*096817792e> FractureEffects; // 0xc30(0x10)
	bool bEnableHardSleeping; // 0xc40(0x01)
	char pad_C41_1 : 7; // 0xc41(0x01)
	char pad_C42[0x2]; // 0xc42(0x02)
	float LargeChunkThreshold; // 0xc44(0x04)
	char pad_C48[0x10]; // 0xc48(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xc58(0x10)
	char pad_C68[0x88]; // 0xc68(0x88)

	void *4676ce6de9(); // Function Engine.DestructibleComponent.*4676ce6de9 // Final|Native|Public|BlueprintCallable // @ game+0x653cbb0
	float *339d88c256(); // Function Engine.DestructibleComponent.*339d88c256 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64ff204
	void *c55dc2289f(); // Function Engine.DestructibleComponent.*c55dc2289f // Final|Native|Public|BlueprintCallable // @ game+0x6516eb0
	struct FVector *150c20fc0e(float DamageAmount); // Function Engine.DestructibleComponent.*150c20fc0e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fe008
};

// Class Engine.SaveGame
// Size: 0x28 (Inherited: 0x28)
struct USaveGame : UObject {
};

// Class Engine.*ecc7e9561f
// Size: 0x9b0 (Inherited: 0x990)
struct U*ecc7e9561f : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x988(0x04)
	struct UBodySetup* *6d9ffc621f; // 0x990(0x08)
	char *5ad4a49835 : 1; // 0x998(0x01)
	char *b1a48519e8 : 1; // 0x998(0x01)
	char *d96fb7dd6c : 1; // 0x998(0x01)
	char pad_99C_3 : 5; // 0x99c(0x01)
	char pad_99D[0x3]; // 0x99d(0x03)
	struct UClass* AreaClass; // 0x9a0(0x08)
	char pad_9A8[0x8]; // 0x9a8(0x08)
};

// Class Engine.TargetPoint
// Size: 0x3e8 (Inherited: 0x3e8)
struct ATargetPoint : AActor {
};

// Class Engine.GameStateBase
// Size: 0x428 (Inherited: 0x3e8)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x3e8(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x3f0(0x08)
	struct UClass* SpectatorClass; // 0x3f8(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x400(0x10)
	bool *d506f7e5e4; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float *83b1d93eee; // 0x414(0x04)
	float *c28d41fd4b; // 0x418(0x04)
	float *32844ee1a9; // 0x41c(0x04)
	char pad_420[0x8]; // 0x420(0x08)

	void *a9952ba0bf(); // Function Engine.GameStateBase.*a9952ba0bf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57205e8
	void *8cab2d71c2(); // Function Engine.GameStateBase.*8cab2d71c2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4028
	void *4b737c5214(); // Function Engine.GameStateBase.*4b737c5214 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1f1c
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0x6effc4
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0x57d3040
	struct AController* *e8df0b00a7(); // Function Engine.GameStateBase.*e8df0b00a7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3068
	void *8ad83f8ecb(); // Function Engine.GameStateBase.*8ad83f8ecb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3110
	void *ff7bd76d7c(); // Function Engine.GameStateBase.*ff7bd76d7c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4078
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xac23e0
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0xb98400
	void *f0b4c46c31(); // Function Engine.GameStateBase.*f0b4c46c31 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57abd0c
};

// Class Engine.GameState
// Size: 0x448 (Inherited: 0x428)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x428(0x08)
	struct FName PreviousMatchState; // 0x430(0x08)
	int32 ElapsedTime; // 0x438(0x04)
	char pad_43C[0xc]; // 0x43c(0x0c)

	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x5778b00
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0x64eaf90
};

// Class Engine.BoxComponent
// Size: 0x9c0 (Inherited: 0x9b0)
struct UBoxComponent : U*ecc7e9561f {
	struct FVector BoxExtent; // 0x9a8(0x0c)
	char pad_9BC[0x4]; // 0x9bc(0x04)

	void *f1bf6a0bed(); // Function Engine.BoxComponent.*f1bf6a0bed // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651f344
	void *b9d99948c0(); // Function Engine.BoxComponent.*b9d99948c0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651cff0
	struct FVector *17de6d8a81(); // Function Engine.BoxComponent.*17de6d8a81 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x653aa24
};

// Class Engine.ProjectileMovementComponent
// Size: 0x300 (Inherited: 0x240)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x238(0x04)
	float MaxSpeed; // 0x23c(0x04)
	char bRotationFollowsVelocity : 1; // 0x240(0x01)
	char bShouldBounce : 1; // 0x240(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x240(0x01)
	char bForceSubStepping : 1; // 0x240(0x01)
	char bSimulationEnabled : 1; // 0x240(0x01)
	char bSweepCollision : 1; // 0x240(0x01)
	char bIsHomingProjectile : 1; // 0x240(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x240(0x01)
	char bIsSliding : 1; // 0x241(0x01)
	char bInterpMovement : 1; // 0x241(0x01)
	char bInterpRotation : 1; // 0x241(0x01)
	float PreviousHitTime; // 0x244(0x04)
	struct FVector PreviousHitNormal; // 0x248(0x0c)
	float ProjectileGravityScale; // 0x254(0x04)
	float *941c01e255; // 0x258(0x04)
	float Bounciness; // 0x25c(0x04)
	float Friction; // 0x260(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x264(0x04)
	float MinFrictionFraction; // 0x268(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x270(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x280(0x10)
	float HomingAccelerationMagnitude; // 0x290(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x294(0x08)
	float MaxSimulationTimeStep; // 0x29c(0x04)
	int32 MaxSimulationIterations; // 0x2a0(0x04)
	int32 BounceAdditionalIterations; // 0x2a4(0x04)
	float InterpLocationTime; // 0x2a8(0x04)
	float InterpRotationTime; // 0x2ac(0x04)
	float InterpLocationMaxLagDistance; // 0x2b0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2b4(0x04)
	char pad_2B9[0x47]; // 0x2b9(0x47)

	void OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x32e590
	void *bd4604da41(); // Function Engine.ProjectileMovementComponent.*bd4604da41 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652402c
	struct FHitResult OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x32e590
	void *d542984fd9(); // Function Engine.ProjectileMovementComponent.*d542984fd9 // Native|Public|BlueprintCallable // @ game+0x57b2eb4
	void *40a4d84143(); // Function Engine.ProjectileMovementComponent.*40a4d84143 // Native|Public|BlueprintCallable // @ game+0x6540144
	void LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6526a64
	void *0e6e4bda92(); // Function Engine.ProjectileMovementComponent.*0e6e4bda92 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6523468
	void *b1925dc644(); // Function Engine.ProjectileMovementComponent.*b1925dc644 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6546da0
	void StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x654e7bc
	void *a1edadaf82(struct FVector NewLocation); // Function Engine.ProjectileMovementComponent.*a1edadaf82 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x652e5f4
};

// Class Engine.CurveBase
// Size: 0x30 (Inherited: 0x28)
struct UCurveBase : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	void *66c74365d8(float MinValue); // Function Engine.CurveBase.*66c74365d8 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3ce0
	float *01a35ccac8(); // Function Engine.CurveBase.*01a35ccac8 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e39b8
};

// Class Engine.GameUserSettings
// Size: 0x110 (Inherited: 0x28)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x28(0x01)
	bool bUseDynamicResolution; // 0x29(0x01)
	char pad_2A[0x4e]; // 0x2a(0x4e)
	uint32 ResolutionSizeX; // 0x78(0x04)
	uint32 ResolutionSizeY; // 0x7c(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x80(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x84(0x04)
	int32 WindowPosX; // 0x88(0x04)
	int32 WindowPosY; // 0x8c(0x04)
	int32 FullscreenMode; // 0x90(0x04)
	int32 LastConfirmedFullscreenMode; // 0x94(0x04)
	int32 PreferredFullscreenMode; // 0x98(0x04)
	uint32 Version; // 0x9c(0x04)
	int32 AudioQualityLevel; // 0xa0(0x04)
	float FrameRateLimit; // 0xa4(0x04)
	char pad_A8[0x4]; // 0xa8(0x04)
	int32 DesiredScreenWidth; // 0xac(0x04)
	bool bUseDesiredScreenHeight; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	int32 DesiredScreenHeight; // 0xb4(0x04)
	float LastRecommendedScreenWidth; // 0xb8(0x04)
	float LastRecommendedScreenHeight; // 0xbc(0x04)
	float LastCPUBenchmarkResult; // 0xc0(0x04)
	float LastGPUBenchmarkResult; // 0xc4(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xc8(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xd8(0x10)
	float LastGPUBenchmarkMultiplier; // 0xe8(0x04)
	bool bUseHDRDisplayOutput; // 0xec(0x01)
	char pad_ED[0x3]; // 0xed(0x03)
	int32 HDRDisplayOutputNits; // 0xf0(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xf4(0x01)
	bool bGPUDebug; // 0xf5(0x01)
	char pad_F6[0x2]; // 0xf6(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0xf8(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x100(0x10)

	void *3fa07a2c15(); // Function Engine.GameUserSettings.*3fa07a2c15 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6561bd8
	void *42adf84a10(); // Function Engine.GameUserSettings.*42adf84a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x656119c
	void *8a20ad8cd1(); // Function Engine.GameUserSettings.*8a20ad8cd1 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6561630
	void LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x655f7f8
	void *41ac2628ab(); // Function Engine.GameUserSettings.*41ac2628ab // Final|Native|Public|BlueprintCallable // @ game+0x656b640
	void *053c3bb9c7(); // Function Engine.GameUserSettings.*053c3bb9c7 // Native|Public|BlueprintCallable // @ game+0x656309c
	void *b7a04ffac6(); // Function Engine.GameUserSettings.*b7a04ffac6 // Final|Native|Public|BlueprintCallable // @ game+0x656a874
	void *42946d5ee0(); // Function Engine.GameUserSettings.*42946d5ee0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6564aa4
	void *1a6266fca5(); // Function Engine.GameUserSettings.*1a6266fca5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x656c444
	void *33c615124b(); // Function Engine.GameUserSettings.*33c615124b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6563d28
	void *39a5d552d0(); // Function Engine.GameUserSettings.*39a5d552d0 // Final|Native|Public|BlueprintCallable // @ game+0x656a738
	void *e7d97d07ad(); // Function Engine.GameUserSettings.*e7d97d07ad // Final|Native|Public|BlueprintCallable // @ game+0x656b438
	void *1b557feea9(); // Function Engine.GameUserSettings.*1b557feea9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x656459c
	void *639dffa7ed(); // Function Engine.GameUserSettings.*639dffa7ed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562b74
	void *44991ed37a(); // Function Engine.GameUserSettings.*44991ed37a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6564ac8
	void *febf6f3b86(); // Function Engine.GameUserSettings.*febf6f3b86 // Final|Native|Public|BlueprintCallable // @ game+0x656ad30
	void *4c04eab1f7(); // Function Engine.GameUserSettings.*4c04eab1f7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x656b080
	int32 GetResolutionScaleInformation(); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65631ac
	void *551ad5a02b(); // Function Engine.GameUserSettings.*551ad5a02b // Final|Native|Public|BlueprintCallable // @ game+0x656b4c4
	void *1883a41186(float CurrentScaleValue); // Function Engine.GameUserSettings.*1883a41186 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65633a4
	void *7a9fb9af57(); // Function Engine.GameUserSettings.*7a9fb9af57 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x656406c
	void *86347b2bd7(); // Function Engine.GameUserSettings.*86347b2bd7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6564080
	void *3ebc1d55ed(); // Function Engine.GameUserSettings.*3ebc1d55ed // Final|Native|Public|BlueprintCallable // @ game+0x656b10c
	void *96553099cc(); // Function Engine.GameUserSettings.*96553099cc // Native|Public|BlueprintCallable // @ game+0xb02434
	void *cdb9c52b4d(); // Function Engine.GameUserSettings.*cdb9c52b4d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6561188
	void *a09c0e4ab2(); // Function Engine.GameUserSettings.*a09c0e4ab2 // Final|Native|Static|Public|BlueprintCallable // @ game+0xb67120
	void *3b9d09fcec(); // Function Engine.GameUserSettings.*3b9d09fcec // Final|Native|Public|BlueprintCallable // @ game+0x655ceb0
	void *d468322917(); // Function Engine.GameUserSettings.*d468322917 // Final|Native|Public|BlueprintCallable // @ game+0x656a9a8
	void *f140babb19(); // Function Engine.GameUserSettings.*f140babb19 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6561bec
	void *ed58553e72(); // Function Engine.GameUserSettings.*ed58553e72 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6564578
	void *afea566c1e(); // Function Engine.GameUserSettings.*afea566c1e // Native|Public|BlueprintCallable // @ game+0x5f8ec24
	void *8bd0d486a3(); // Function Engine.GameUserSettings.*8bd0d486a3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6561648
	void *d2dcc0db36(); // Function Engine.GameUserSettings.*d2dcc0db36 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x9767d8
	void *fca58327d0(); // Function Engine.GameUserSettings.*fca58327d0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65620dc
	void *4e0db130e4(); // Function Engine.GameUserSettings.*4e0db130e4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x655ca6c
	void *bd8d78e737(); // Function Engine.GameUserSettings.*bd8d78e737 // Final|Native|Public|BlueprintCallable // @ game+0x656ae74
	void *625aed7dbe(); // Function Engine.GameUserSettings.*625aed7dbe // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65635a0
	void *288f53c0c3(bool bEnable); // Function Engine.GameUserSettings.*288f53c0c3 // Final|Native|Public|BlueprintCallable // @ game+0x655fb7c
	void *518e9c9ba4(); // Function Engine.GameUserSettings.*518e9c9ba4 // Final|Native|Public|BlueprintCallable // @ game+0x656a7e8
	void *4d5ec9c010(); // Function Engine.GameUserSettings.*4d5ec9c010 // Native|Public|BlueprintCallable // @ game+0xa0caac
	void *576b1ee454(); // Function Engine.GameUserSettings.*576b1ee454 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6563584
	void *ade7a8eb7f(); // Function Engine.GameUserSettings.*ade7a8eb7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562b88
	void *7e207f2d19(); // Function Engine.GameUserSettings.*7e207f2d19 // Native|Public|BlueprintCallable // @ game+0x6561604
	void *5646d1bc97(); // Function Engine.GameUserSettings.*5646d1bc97 // Native|Public|BlueprintCallable // @ game+0x655936c
	void *9ad0171dd6(); // Function Engine.GameUserSettings.*9ad0171dd6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65613c8
	void *c2386c6a9d(); // Function Engine.GameUserSettings.*c2386c6a9d // Final|Native|Public|BlueprintCallable // @ game+0x656a620
	void *70413184d2(); // Function Engine.GameUserSettings.*70413184d2 // Final|Native|Public|BlueprintCallable // @ game+0x656aca4
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x57e0784
	void *af951b2cd6(); // Function Engine.GameUserSettings.*af951b2cd6 // Final|Native|Public|BlueprintCallable // @ game+0x57b7098
	void *ecd76f8120(); // Function Engine.GameUserSettings.*ecd76f8120 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6562100
	void *dfe3eff084(); // Function Engine.GameUserSettings.*dfe3eff084 // Final|Native|Static|Public|BlueprintCallable // @ game+0x6561d04
	void *c68bfff735(); // Function Engine.GameUserSettings.*c68bfff735 // Final|Native|Public|BlueprintCallable // @ game+0x656a910
	void *9f1edd93aa(); // Function Engine.GameUserSettings.*9f1edd93aa // Final|Native|Public|BlueprintCallable // @ game+0x6559384
	void *511dbb1516(); // Function Engine.GameUserSettings.*511dbb1516 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562600
	void SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x656ade0
	void *1bdc89e63d(); // Function Engine.GameUserSettings.*1bdc89e63d // Final|Native|Public|BlueprintCallable // @ game+0x6569f1c
	void *177680250c(); // Function Engine.GameUserSettings.*177680250c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6564540
	void *b847c10734(); // Function Engine.GameUserSettings.*b847c10734 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6561c04
	void *732707d3cd(); // Function Engine.GameUserSettings.*732707d3cd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6564564
	void *2610d883f2(); // Function Engine.GameUserSettings.*2610d883f2 // Native|Public|BlueprintCallable // @ game+0x656ac10
	void *f4e03bd257(); // Function Engine.GameUserSettings.*f4e03bd257 // Native|Public|BlueprintCallable // @ game+0xa54f24
	void *b5801bbd2f(); // Function Engine.GameUserSettings.*b5801bbd2f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6564a60
	void *faa773b54d(); // Function Engine.GameUserSettings.*faa773b54d // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x65615e4
	float *28ad51e5eb(); // Function Engine.GameUserSettings.*28ad51e5eb // Native|Public|BlueprintCallable // @ game+0x656a4b0
	void *922ccd84f4(); // Function Engine.GameUserSettings.*922ccd84f4 // Final|Native|Public|BlueprintCallable // @ game+0x656a6ac
	void *ae8bd0cce0(); // Function Engine.GameUserSettings.*ae8bd0cce0 // Native|Public|BlueprintCallable // @ game+0x57bcbbc
};

// Class Engine.GameInstance
// Size: 0x1e0 (Inherited: 0x28)
struct UGameInstance : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct U*095debd2a0* *095debd2a0; // 0x30(0x08)
	struct U*7e8b14b3a6* *7e8b14b3a6; // 0x38(0x08)
	char pad_40[0xb8]; // 0x40(0xb8)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0xf8(0x10)
	char pad_108[0xd8]; // 0x108(0xd8)

	void DebugCreatePlayer(); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x650cc14
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x32e590
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x32e590
	void HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x32e590
	void DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x650cca8
	enum class ENetworkFailure HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x32e590
};

// Class Engine.TriggerBase
// Size: 0x3f0 (Inherited: 0x3e8)
struct ATriggerBase : AActor {
	struct U*ecc7e9561f* CollisionComponent; // 0x3e8(0x08)
};

// Class Engine.TriggerBox
// Size: 0x3f0 (Inherited: 0x3f0)
struct ATriggerBox : ATriggerBase {
};

// Class Engine.CapsuleComponent
// Size: 0x9c0 (Inherited: 0x9b0)
struct UCapsuleComponent : U*ecc7e9561f {
	float CapsuleHalfHeight; // 0x9a8(0x04)
	float CapsuleRadius; // 0x9ac(0x04)
	float CapsuleHeight; // 0x9b0(0x04)
	char pad_9BC[0x4]; // 0x9bc(0x04)

	float *ddfefb99fd(); // Function Engine.CapsuleComponent.*ddfefb99fd // Final|Native|Public|BlueprintCallable // @ game+0x653adcc
	float *b352bc1860(); // Function Engine.CapsuleComponent.*b352bc1860 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651d138
	void *c1ae168066(); // Function Engine.CapsuleComponent.*c1ae168066 // Native|Public|BlueprintCallable // @ game+0x64f1934
	void *5c5966e669(float OutRadius); // Function Engine.CapsuleComponent.*5c5966e669 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651f4c8
	void *156cc7bd6d(); // Function Engine.CapsuleComponent.*156cc7bd6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651d098
	float *d8d9e8ddda(); // Function Engine.CapsuleComponent.*d8d9e8ddda // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651d26c
	void *9a3a3845fe(); // Function Engine.CapsuleComponent.*9a3a3845fe // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651f3c0
	void *78fdfb4d17(); // Function Engine.CapsuleComponent.*78fdfb4d17 // Native|Public|BlueprintCallable // @ game+0x64f1a60
	void *d18ea0f521(); // Function Engine.CapsuleComponent.*d18ea0f521 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651f3a8
	void *5ad9e5ebdb(); // Function Engine.CapsuleComponent.*5ad9e5ebdb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651f384
	void *5cf3fa611a(float InHalfHeight); // Function Engine.CapsuleComponent.*5cf3fa611a // Final|Native|Public|BlueprintCallable // @ game+0x653aeb8
	void *4daa1f5aaf(); // Function Engine.CapsuleComponent.*4daa1f5aaf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651d4a0
	float *656ab9bef3(); // Function Engine.CapsuleComponent.*656ab9bef3 // Final|Native|Public|BlueprintCallable // @ game+0x653ac38
	void *f0b5efc4d8(); // Function Engine.CapsuleComponent.*f0b5efc4d8 // Native|Public|BlueprintCallable // @ game+0x64f19c8
	void *32f034ebd4(); // Function Engine.CapsuleComponent.*32f034ebd4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651f36c
	void *3bc6d21068(); // Function Engine.CapsuleComponent.*3bc6d21068 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651d04c
	void *197503b2c5(); // Function Engine.CapsuleComponent.*197503b2c5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651d0ec
};

// Class Engine.PhysicsVolume
// Size: 0x438 (Inherited: 0x420)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x420(0x04)
	int32 Priority; // 0x424(0x04)
	float FluidFriction; // 0x428(0x04)
	char bWaterVolume : 1; // 0x42c(0x01)
	char bPhysicsOnContact : 1; // 0x42c(0x01)
	char pad_42C_2 : 6; // 0x42c(0x01)
	char pad_42D[0x3]; // 0x42d(0x03)
	bool *c1e105b0ce; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x7f0 (Inherited: 0x7a0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7a0(0x01)
	char *0b2402a34c : 1; // 0x7a0(0x01)
	char pad_7A0_2 : 6; // 0x7a0(0x01)
	char pad_7A1[0x7]; // 0x7a1(0x07)
	struct U*e8224a1e62* *9324a8bb8c; // 0x7a8(0x08)
	char pad_7B0[0x20]; // 0x7b0(0x20)
	float SpeedScale; // 0x7d0(0x04)
	float InitialMaxSpeed; // 0x7d4(0x04)
	float InitialAccel; // 0x7d8(0x04)
	float InitialDecel; // 0x7dc(0x04)
	char pad_7E0[0x10]; // 0x7e0(0x10)

	void *2e4653783e(); // Function Engine.DebugCameraController.*2e4653783e // Final|Native|Public|BlueprintCallable // @ game+0x64f7560
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x64f6748
	void *b67f45561f(); // Function Engine.DebugCameraController.*b67f45561f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e32c8
	void *de56c362d2(); // Function Engine.DebugCameraController.*de56c362d2 // Final|Native|Public|BlueprintCallable // @ game+0x64f4500
	void ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveOnActorSelected(struct FVector SelectHitLocation); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x32e590
};

// Class Engine.Channel
// Size: 0x68 (Inherited: 0x28)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x28(0x08)
	char pad_30[0x38]; // 0x30(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x68)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x68(0x08)
	char pad_70[0x300]; // 0x70(0x300)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	char pad_370[0x20]; // 0x370(0x20)
};

// Class Engine.NavigationObjectBase
// Size: 0x410 (Inherited: 0x3e8)
struct ANavigationObjectBase : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x3f0(0x08)
	struct UBillboardComponent* *6369e93122; // 0x3f8(0x08)
	struct UBillboardComponent* *83f6a9b2b9; // 0x400(0x08)
	char *9088118d89 : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
};

// Class Engine.PlayerStart
// Size: 0x418 (Inherited: 0x410)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x410(0x08)
};

// Class Engine.CheatManager
// Size: 0x78 (Inherited: 0x28)
struct UCheatManager : UObject {
	struct ADebugCameraController* *a08dd8a11c; // 0x28(0x08)
	struct UClass* DebugCameraControllerClass; // 0x30(0x08)
	char pad_38[0x40]; // 0x38(0x40)

	void OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6568ff4
	void FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x6560ff8
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x57a87cc
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x655f9d8
	void CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x655cb30
	void *795eba9f52(); // Function Engine.CheatManager.*795eba9f52 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x656a5d4
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x5762568
	void Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x656c380
	void StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x656c0c4
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x655f5bc
	void *f8b0d01959(); // Function Engine.CheatManager.*f8b0d01959 // Native|Protected|BlueprintCallable // @ game+0xaf7e4c
	void ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x655ca94
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x32e590
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x656db54
	void DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x655f5d4
	void ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x656da90
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x6567b80
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x656d230
	void DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x655f764
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x57e079c
	void BugItGo(float Param0, float Param2, float Param4); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x655af64
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x6569574
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x655f50c
	void DebugCapsuleSweepSize(float Param0); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x655f684
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x6569784
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x57e06ec
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x656d218
	struct FString BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x655b180
	void DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x5eaadfc
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x656b6cc
	void DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x655f524
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0x655f66c
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0xb02434
	void DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x655f470
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x655f9a8
	void *9377c54237(); // Function Engine.CheatManager.*9377c54237 // Native|Protected|BlueprintCallable // @ game+0x655fa70
	void StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x656c030
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x32e590
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x655f9c0
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x6560fe0
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x57e0744
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x65644d4
	void BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x655aea0
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x656ab64
	void SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x656ab78
	void ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x656d968
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x64f74f8
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x65496c8
	void Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x656ba98
	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x57e0784
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x656c46c
	void ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x656d9fc
};

// Class Engine.*6df4f0aacf
// Size: 0x9a0 (Inherited: 0x990)
struct U*6df4f0aacf : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0x990(0x10)
};

// Class Engine.NavArea
// Size: 0x40 (Inherited: 0x28)
struct UNavArea : UObject {
	float DefaultCost; // 0x28(0x04)
	float FixedAreaEnteringCost; // 0x2c(0x04)
	struct FColor DrawColor; // 0x30(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x34(0x04)
	char bSupportsAgent0 : 1; // 0x38(0x01)
	char bSupportsAgent1 : 1; // 0x38(0x01)
	char bSupportsAgent2 : 1; // 0x38(0x01)
	char bSupportsAgent3 : 1; // 0x38(0x01)
	char bSupportsAgent4 : 1; // 0x38(0x01)
	char bSupportsAgent5 : 1; // 0x38(0x01)
	char bSupportsAgent6 : 1; // 0x38(0x01)
	char bSupportsAgent7 : 1; // 0x38(0x01)
	char bSupportsAgent8 : 1; // 0x39(0x01)
	char bSupportsAgent9 : 1; // 0x39(0x01)
	char bSupportsAgent10 : 1; // 0x39(0x01)
	char bSupportsAgent11 : 1; // 0x39(0x01)
	char bSupportsAgent12 : 1; // 0x39(0x01)
	char bSupportsAgent13 : 1; // 0x39(0x01)
	char bSupportsAgent14 : 1; // 0x39(0x01)
	char bSupportsAgent15 : 1; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x3f0 (Inherited: 0x3e8)
struct ALevelScriptActor : AActor {
	char *6600a3ea98 : 1; // 0x3e8(0x01)
	char pad_3E8_1 : 7; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)

	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x32e590
	bool *278a1612b5(); // Function Engine.LevelScriptActor.*278a1612b5 // Native|Public|BlueprintCallable // @ game+0xa91e84
	void WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x32e590
	void *e55cf6f554(struct FName EventName); // Function Engine.LevelScriptActor.*e55cf6f554 // Native|Public|BlueprintCallable // @ game+0x57e69ec
};

// Class Engine.ChildActorComponent
// Size: 0x490 (Inherited: 0x460)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x458(0x08)
	struct AActor* ChildActor; // 0x460(0x08)
	struct AActor* ChildActorTemplate; // 0x468(0x08)
	char pad_478[0x18]; // 0x478(0x18)

	void *13873450fe(); // Function Engine.ChildActorComponent.*13873450fe // Final|Native|Public|BlueprintCallable // @ game+0x64f161c
};

// Class Engine.CameraComponent
// Size: 0xa50 (Inherited: 0x460)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x458(0x04)
	float OrthoWidth; // 0x45c(0x04)
	float OrthoNearClipPlane; // 0x460(0x04)
	float OrthoFarClipPlane; // 0x464(0x04)
	float AspectRatio; // 0x468(0x04)
	char bConstrainAspectRatio : 1; // 0x46c(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x46c(0x01)
	char bLockToHmd : 1; // 0x46c(0x01)
	char bUsePawnControlRotation : 1; // 0x46c(0x01)
	enum class ECameraProjectionMode ProjectionMode; // 0x470(0x01)
	float PostProcessBlendWeight; // 0x474(0x04)
	char pad_479_4 : 4; // 0x479(0x01)
	char pad_47A[0x6]; // 0x47a(0x06)
	struct FPostProcessSettings PostProcessSettings; // 0x480(0x570)
	char pad_9F0[0x58]; // 0x9f0(0x58)
	char bUseControllerViewRotation : 1; // 0xa48(0x01)
	char pad_A48_1 : 7; // 0xa48(0x01)
	char pad_A49[0x7]; // 0xa49(0x07)

	void *3243136986(); // Function Engine.CameraComponent.*3243136986 // Final|Native|Public|BlueprintCallable // @ game+0x65424fc
	void *319ffc6c21(); // Function Engine.CameraComponent.*319ffc6c21 // Final|Native|Public|BlueprintCallable // @ game+0x6542464
	void *014a2540ed(); // Function Engine.CameraComponent.*014a2540ed // Final|Native|Public|BlueprintCallable // @ game+0x6546858
	void *83f44d6997(); // Function Engine.CameraComponent.*83f44d6997 // Final|Native|Public|BlueprintCallable // @ game+0x6542fa4
	float *1018ac5a95(); // Function Engine.CameraComponent.*1018ac5a95 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6515940
	void *2af209604c(); // Function Engine.CameraComponent.*2af209604c // Final|Native|Public|BlueprintCallable // @ game+0x653bc5c
	void *2ac6b59eb0(); // Function Engine.CameraComponent.*2ac6b59eb0 // Final|Native|Public|BlueprintCallable // @ game+0x65394fc
	void *e3575fd8d0(); // Function Engine.CameraComponent.*e3575fd8d0 // Final|Native|Public|BlueprintCallable // @ game+0x653ff84
	TScriptInterface<struct UBlendableInterface> *279e5ee7e9(); // Function Engine.CameraComponent.*279e5ee7e9 // Final|Native|Public|BlueprintCallable // @ game+0x64fcd28
	void *23da1c6514(); // Function Engine.CameraComponent.*23da1c6514 // Final|Native|Public|BlueprintCallable // @ game+0x6543330
	void *e404a296b4(); // Function Engine.CameraComponent.*e404a296b4 // Final|Native|Public|BlueprintCallable // @ game+0x653e260
};

// Class Engine.Engine
// Size: 0xf50 (Inherited: 0x28)
struct UEngine : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct UFont* TinyFont; // 0x30(0x08)
	struct FStringAssetReference TinyFontName; // 0x38(0x10)
	struct UFont* SmallFont; // 0x48(0x08)
	struct FStringAssetReference SmallFontName; // 0x50(0x10)
	struct UFont* *d5575fd1a5; // 0x60(0x08)
	struct FStringAssetReference MediumFontName; // 0x68(0x10)
	struct UFont* LargeFont; // 0x78(0x08)
	struct FStringAssetReference LargeFontName; // 0x80(0x10)
	struct UFont* *eb5965c5ca; // 0x90(0x08)
	struct FStringAssetReference SubtitleFontName; // 0x98(0x10)
	struct TArray<struct UFont*> *6684f966fa; // 0xa8(0x10)
	struct UMaterial* *16717bdf0d; // 0xb8(0x08)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0xc0(0x10)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0xd0(0x10)
	struct UClass* *94e76c0b64; // 0xe0(0x08)
	struct FStringAssetReference MiniFontTextureName; // 0xe8(0x10)
	struct UTexture* WeightMapPlaceholderTexture; // 0xf8(0x08)
	struct UGameUserSettings* GameUserSettings; // 0x100(0x08)
	struct UTexture2D* *2897f70a3a; // 0x108(0x08)
	struct FStringAssetReference DebugMeshMaterialName; // 0x110(0x10)
	char bRenderLightMapDensityGrayscale : 1; // 0x120(0x01)
	char pad_120_1 : 7; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct FStringAssetReference LightMapDensityTextureName; // 0x128(0x10)
	struct FStringClassReference ConsoleClassName; // 0x138(0x10)
	float NearClipPlane; // 0x148(0x04)
	char bHardwareSurveyEnabled : 1; // 0x14c(0x01)
	char pad_14C_1 : 7; // 0x14c(0x01)
	char pad_14D[0x3]; // 0x14d(0x03)
	struct FFloatRange SmoothedFrameRateRange; // 0x150(0x10)
	struct FColor *92098a0da9; // 0x160(0x04)
	char pad_164[0x4]; // 0x164(0x04)
	struct FString LevelColorationUnlitMaterialName; // 0x168(0x10)
	struct FStringClassReference AvoidanceManagerClassName; // 0x178(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x188(0x08)
	float *8d74b94f2c; // 0x190(0x04)
	struct FLinearColor LightingOnlyBrightness; // 0x194(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x1a4(0x10)
	char bCanBlueprintsTickByDefault : 1; // 0x1b4(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x1b4(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x1b4(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x1b4(0x01)
	char pad_1B4_4 : 1; // 0x1b4(0x01)
	char bSmoothFrameRate : 1; // 0x1b4(0x01)
	char bUseFixedFrameRate : 1; // 0x1b4(0x01)
	char pad_1B4_7 : 1; // 0x1b4(0x01)
	char pad_1B5[0x3]; // 0x1b5(0x03)
	float IdealLightMapDensity; // 0x1b8(0x04)
	char pad_1BC[0x4]; // 0x1bc(0x04)
	struct UMaterial* WireframeMaterial; // 0x1c0(0x08)
	struct UMaterial* *c0e0776fba; // 0x1c8(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x1d0(0x10)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x1e0(0x01)
	char pad_1E0_1 : 7; // 0x1e0(0x01)
	char pad_1E1[0x3]; // 0x1e1(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0x1e4(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x1e8(0x01)
	char pad_1E8_1 : 1; // 0x1e8(0x01)
	char bPauseOnLossOfFocus : 1; // 0x1e8(0x01)
	char pad_1E8_3 : 5; // 0x1e8(0x01)
	char pad_1E9[0x3]; // 0x1e9(0x03)
	int32 MaxParticleResize; // 0x1ec(0x04)
	float NetClientTicksPerSecond; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct UMaterial* VertexColorMaterial; // 0x1f8(0x08)
	struct TArray<struct FString> *06f7de7a1f; // 0x200(0x10)
	char pad_210[0x18]; // 0x210(0x18)
	int32 *16613c20a8; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct UAssetManager* AssetManager; // 0x230(0x08)
	int32 MaximumLoopIterationCount; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct UTextureCube* *139a25f293; // 0x240(0x08)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x248(0x10)
	float PrimitiveProbablyVisibleTime; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct FString ShadedLevelColorationLitMaterialName; // 0x260(0x10)
	struct UMaterial* *ec17bc7747; // 0x270(0x08)
	struct UTexture* DefaultDiffuseTexture; // 0x278(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x280(0x10)
	struct FColor *d4edb0cd71; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct UMaterialInstanceDynamic* *39ca5c3bcb; // 0x298(0x08)
	struct TArray<struct F*be03b16f81> ActiveClassRedirects; // 0x2a0(0x10)
	struct UTexture2D* *8e6f7d16a9; // 0x2b0(0x08)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x2b8(0x10)
	struct FString *7d46f4c031; // 0x2c8(0x10)
	struct FColor *5a587410f9; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct TArray<struct F*79d333047c> StatColorMappings; // 0x2e0(0x10)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x2f0(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x300(0x04)
	float RenderLightMapDensityGrayscaleScale; // 0x304(0x04)
	float MaxLightMapDensity; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct UMaterial* *2a7f86453a; // 0x310(0x08)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x318(0x08)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x320(0x10)
	struct FStringClassReference GameViewportClientClassName; // 0x330(0x10)
	struct UMaterial* *4e145c5e75; // 0x340(0x08)
	struct TArray<struct F*2dbfe53fec> ActivePluginRedirects; // 0x348(0x10)
	struct TArray<struct F*a26d903e83> ActiveStructRedirects; // 0x358(0x10)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0x368(0x10)
	struct FColor *bedef1c2e2; // 0x378(0x04)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct UClass* *0578464ae5; // 0x380(0x08)
	struct FString LightingTexelDensityName; // 0x388(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x398(0x10)
	struct FStringClassReference GameUserSettingsClassName; // 0x3a8(0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x3b8(0x10)
	struct UTexture2D* *68954a0e95; // 0x3c8(0x08)
	struct FStringClassReference AssetManagerClassName; // 0x3d0(0x10)
	struct UTexture2D* DefaultTexture; // 0x3e0(0x08)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x3e8(0x10)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x3f8(0x10)
	struct UTexture2D* MiniFontTexture; // 0x408(0x08)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0x410(0x10)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0x420(0x10)
	struct FColor *076b3a5e59; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UClass* *0a729b2cf7; // 0x438(0x08)
	struct UObject* *5d37fdbc39; // 0x440(0x08)
	struct UMaterialInstanceDynamic* *8c82e4230b; // 0x448(0x08)
	struct FStringClassReference WorldSettingsClassName; // 0x450(0x10)
	struct FStringAssetReference ArrowMaterialName; // 0x460(0x10)
	struct UMaterialInstanceDynamic* *34d0d906a6; // 0x470(0x08)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x478(0x10)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x488(0x10)
	struct F*1d97e2f35e PhysicErrorCorrection; // 0x498(0x1c)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct UMaterial* *14f279bb49; // 0x4b8(0x08)
	struct FStringAssetReference DefaultTextureName; // 0x4c0(0x10)
	struct FColor *c2302d3d50; // 0x4d0(0x04)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	struct UMaterial* *9d1254360e; // 0x4d8(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x4e0(0x10)
	struct UTexture2D* *54b303e300; // 0x4f0(0x08)
	struct UMaterial* DebugMeshMaterial; // 0x4f8(0x08)
	float MaxOcclusionPixelsFraction; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct UMaterial* *7ace57a663; // 0x508(0x08)
	struct TArray<struct F*5d92169511> ActiveGameNameRedirects; // 0x510(0x10)
	struct FStringClassReference NavigationSystemClassName; // 0x520(0x10)
	struct UGameViewportClient* GameViewport; // 0x530(0x08)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0x538(0x10)
	float DisplayGamma; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x550(0x08)
	struct FString VertexColorMaterialName; // 0x558(0x10)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0x568(0x10)
	struct UMaterial* *728c6c3f00; // 0x578(0x08)
	struct FStringClassReference LevelScriptActorClassName; // 0x580(0x10)
	int32 *a116c62737; // 0x590(0x04)
	char bSubtitlesForcedOff : 1; // 0x594(0x01)
	char pad_594_1 : 7; // 0x594(0x01)
	char pad_595[0x3]; // 0x595(0x03)
	int32 MaxParticleResizeWarn; // 0x598(0x04)
	struct FColor *6adb0523e6; // 0x59c(0x04)
	float MinDesiredFrameRate; // 0x5a0(0x04)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x5a4(0x04)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x5a8(0x10)
	struct TArray<struct F*7bed299cf3> *8744020533; // 0x5b8(0x10)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0x5c8(0x10)
	struct FString PlayOnConsoleSaveDir; // 0x5d8(0x10)
	struct TArray<struct FString> AdditionalFontNames; // 0x5e8(0x10)
	struct UClass* *54adc8e9b7; // 0x5f8(0x08)
	char pad_600[0x58]; // 0x600(0x58)
	struct UClass* *0b327eac45; // 0x658(0x08)
	struct UMaterial* *228f144519; // 0x660(0x08)
	enum class *5bfc0775d8 *66a16761a7; // 0x668(0x01)
	char pad_669[0x7]; // 0x669(0x07)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0x670(0x10)
	char bSubtitlesEnabled : 1; // 0x680(0x01)
	char pad_680_1 : 7; // 0x680(0x01)
	char pad_681[0x7]; // 0x681(0x07)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x688(0x10)
	struct UMaterialInstanceDynamic* *ae4f6d03a2; // 0x698(0x08)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x6a0(0x08)
	struct FStringClassReference GameSingletonClassName; // 0x6a8(0x10)
	struct UClass* *3ae64d6909; // 0x6b8(0x08)
	struct UClass* *4d2f7e062f; // 0x6c0(0x08)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x6c8(0x10)
	struct FColor *ab8b895c94; // 0x6d8(0x04)
	char pad_6DC[0x4]; // 0x6dc(0x04)
	struct FString *f2905c8f30; // 0x6e0(0x10)
	float FixedFrameRate; // 0x6f0(0x04)
	char pad_6F4[0x4]; // 0x6f4(0x04)
	struct FString WireframeMaterialName; // 0x6f8(0x10)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x708(0x10)
	struct FLinearColor *df438f7d68; // 0x718(0x10)
	struct FLinearColor *a4766efbe6; // 0x728(0x10)
	struct FLinearColor *7851acd877; // 0x738(0x10)
	struct FLinearColor *c4c5215f57; // 0x748(0x10)
	bool *2a0a2d4f68; // 0x758(0x01)
	char pad_759[0x3]; // 0x759(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x75c(0x01)
	char *dbe8d54996 : 1; // 0x75c(0x01)
	char bSuppressMapWarnings : 1; // 0x75c(0x01)
	char bDisableAILogging : 1; // 0x75c(0x01)
	char pad_75C_4 : 4; // 0x75c(0x01)
	char pad_75D[0x3]; // 0x75d(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x760(0x04)
	struct FBox *79b02780b5; // 0x764(0x1c)
	char pad_780[0x4]; // 0x780(0x04)
	int32 *5d401516ab; // 0x784(0x04)
	char *c8c363118f : 1; // 0x788(0x01)
	char pad_788_1 : 7; // 0x788(0x01)
	char pad_789[0x7]; // 0x789(0x07)
	struct FString ParticleEventManagerClassPath; // 0x790(0x10)
	char pad_7A0[0x20]; // 0x7a0(0x20)
	float SelectionHighlightIntensity; // 0x7c0(0x04)
	float *66fa485314; // 0x7c4(0x04)
	float BSPSelectionHighlightIntensity; // 0x7c8(0x04)
	float HoverHighlightIntensity; // 0x7cc(0x04)
	float *18588a0834; // 0x7d0(0x04)
	float PrimitiveBaseIntensity; // 0x7d4(0x04)
	float PrimitiveSelectedIntensity; // 0x7d8(0x04)
	float PrimitiveHoverIntensity; // 0x7dc(0x04)
	char pad_7E0[0x290]; // 0x7e0(0x290)
	struct FString LevelColorationLitMaterialName; // 0xa70(0x10)
	struct UTexture2D* *5512ddb13b; // 0xa80(0x08)
	struct UTexture2D* *8d18d8f0e3; // 0xa88(0x08)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0xa90(0x10)
	float MinLightMapDensity; // 0xaa0(0x04)
	char pad_AA4[0x4]; // 0xaa4(0x04)
	struct UMaterial* LevelColorationLitMaterial; // 0xaa8(0x08)
	struct FColor *b2b0568658; // 0xab0(0x04)
	char pad_AB4[0x4]; // 0xab4(0x04)
	struct FStringAssetReference DefaultPhysMaterialName; // 0xab8(0x10)
	struct FColor *64dcbccba7; // 0xac8(0x04)
	char pad_ACC[0x4]; // 0xacc(0x04)
	struct UMaterialInstanceDynamic* *26117a141b; // 0xad0(0x08)
	float RenderLightMapDensityColorScale; // 0xad8(0x04)
	char pad_ADC[0x1d4]; // 0xadc(0x1d4)
	struct TArray<struct F*ac3a1c14b3> NetDriverDefinitions; // 0xcb0(0x10)
	struct TArray<struct FString> ServerActors; // 0xcc0(0x10)
	struct TArray<struct FString> *65faad95f3; // 0xcd0(0x10)
	char *0dabd9a1d1 : 1; // 0xce0(0x01)
	char pad_CE0_1 : 7; // 0xce0(0x01)
	char pad_CE1[0x7]; // 0xce1(0x07)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0xce8(0x10)
	struct FStringAssetReference DefaultBokehTextureName; // 0xcf8(0x10)
	float CameraTranslationThreshold; // 0xd08(0x04)
	char pad_D0C[0x4]; // 0xd0c(0x04)
	struct UMaterial* *840a3e28dd; // 0xd10(0x08)
	struct FStringClassReference LocalPlayerClassName; // 0xd18(0x10)
	int32 *07c764073a; // 0xd28(0x04)
	char pad_D2C[0xc]; // 0xd2c(0x0c)
	struct UClass* *f01d850c6c; // 0xd38(0x08)
	struct UClass* *6fdc146635; // 0xd40(0x08)
	struct FColor *86c7fafaec; // 0xd48(0x04)
	char bAllowMatureLanguage : 1; // 0xd4c(0x01)
	char pad_D4C_1 : 7; // 0xd4c(0x01)
	char pad_D4D[0x3]; // 0xd4d(0x03)
	float CameraRotationThreshold; // 0xd50(0x04)
	char pad_D54[0x4]; // 0xd54(0x04)
	struct UMaterialInstanceDynamic* *43a400f78e; // 0xd58(0x08)
	struct UMaterialInstanceDynamic* *1f05e695fb; // 0xd60(0x08)
	struct FColor *7fbd372b8c; // 0xd68(0x04)
	char pad_D6C[0x4]; // 0xd6c(0x04)
	struct FStringClassReference AIControllerClassName; // 0xd70(0x10)
	float MeshLODRange; // 0xd80(0x04)
	struct FColor *d04cd288f8; // 0xd84(0x04)
	char pad_D88[0x18]; // 0xd88(0x18)
	int32 *d47b04d98a; // 0xda0(0x04)
	char pad_DA4[0x1ac]; // 0xda4(0x1ac)
};

// Class Engine.*c2c4669a63
// Size: 0x38 (Inherited: 0x28)
struct U*c2c4669a63 : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x670 (Inherited: 0x38)
struct UGameViewportClient : U*c2c4669a63 {
	char pad_38[0x3c8]; // 0x38(0x3c8)
	struct UGameInstance* GameInstance; // 0x400(0x08)
	char pad_408[0xd8]; // 0x408(0xd8)
	struct TArray<struct F*fda7674ce5> *34de75708c; // 0x4e0(0x10)
	char pad_4F0[0x8]; // 0x4f0(0x08)
	struct UConsole* *8ac97c4fce; // 0x4f8(0x08)
	char pad_500[0x170]; // 0x500(0x170)

	void SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x653ba48
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x65496c8
	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0x57d5490
};

// Class Engine.Console
// Size: 0x108 (Inherited: 0x28)
struct UConsole : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct ULocalPlayer* *25aa99e4de; // 0x38(0x08)
	struct UTexture2D* *c25a475780; // 0x40(0x08)
	struct UTexture2D* *09a2d0b96a; // 0x48(0x08)
	char pad_50[0x18]; // 0x50(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x68(0x10)
	char pad_78[0x90]; // 0x78(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c0 (Inherited: 0x28)
struct UNetDriver : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FString NetConnectionClassName; // 0x30(0x10)
	int32 MaxDownloadSize; // 0x40(0x04)
	char bClampListenServerTickRate : 1; // 0x44(0x01)
	char pad_44_1 : 7; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	int32 NetServerMaxTickRate; // 0x48(0x04)
	int32 MaxInternetClientRate; // 0x4c(0x04)
	int32 MaxClientRate; // 0x50(0x04)
	float ServerTravelPause; // 0x54(0x04)
	float SpawnPrioritySeconds; // 0x58(0x04)
	float RelevantTimeout; // 0x5c(0x04)
	float KeepAliveTime; // 0x60(0x04)
	float InitialConnectTimeout; // 0x64(0x04)
	float ConnectionTimeout; // 0x68(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x6c(0x04)
	bool bNoTimeouts; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UNetConnection* *614083bb45; // 0x78(0x08)
	struct TArray<struct UNetConnection*> *a7669e53d2; // 0x80(0x10)
	char pad_90[0x28]; // 0x90(0x28)
	struct UWorld* World; // 0xb8(0x08)
	struct UPackage* *a40890d105; // 0xc0(0x08)
	char pad_C8[0x20]; // 0xc8(0x20)
	struct UClass* *349976212f; // 0xe8(0x08)
	struct UProperty* *603e7c60f1; // 0xf0(0x08)
	struct UProperty* *102db0a7dd; // 0xf8(0x08)
	struct FName NetDriverName; // 0x100(0x08)
	char pad_108[0x8]; // 0x108(0x08)
	float Time; // 0x110(0x04)
	char pad_114[0x3ac]; // 0x114(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c0)
struct UDemoNetDriver : UNetDriver {
	char pad_4C0[0xf8]; // 0x4c0(0xf8)
	struct TMap<struct FString, struct F*ca62b3ee9d> *f53af746dc; // 0x5b8(0x50)
	char pad_608[0x438]; // 0x608(0x438)
	bool *250fd8a592; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.GameEngine
// Size: 0xfb0 (Inherited: 0xf50)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf48(0x04)
	float ServerFlushLogInterval; // 0xf4c(0x04)
	struct UGameInstance* GameInstance; // 0xf50(0x08)
	char pad_F60[0x38]; // 0xf60(0x38)
	struct TArray<struct UWorld*> *9f9543648a; // 0xf98(0x10)
	char pad_FA8[0x8]; // 0xfa8(0x08)
};

// Class Engine.Player
// Size: 0x48 (Inherited: 0x28)
struct UPlayer : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	int32 *e859f7f96e; // 0x38(0x04)
	int32 ConfiguredInternetSpeed; // 0x3c(0x04)
	int32 ConfiguredLanSpeed; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.NetConnection
// Size: 0x65848 (Inherited: 0x48)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x48(0x10)
	struct UNetDriver* Driver; // 0x58(0x08)
	struct UClass* *f5d4b8f8cf; // 0x60(0x08)
	struct UPackageMap* PackageMap; // 0x68(0x08)
	struct TArray<struct UChannel*> *5b232f3ac5; // 0x70(0x10)
	struct TArray<struct AActor*> *3008bea0ae; // 0x80(0x10)
	struct AActor* ViewTarget; // 0x90(0x08)
	struct AActor* *d1679cf1be; // 0x98(0x08)
	int32 *26af5d53fc; // 0xa0(0x04)
	char *75d8776e4c : 1; // 0xa4(0x01)
	char pad_A4_1 : 1; // 0xa4(0x01)
	char *ad6c4fa058 : 1; // 0xa4(0x01)
	char pad_A4_3 : 5; // 0xa4(0x01)
	char pad_A5[0x8b]; // 0xa5(0x8b)
	struct TArray<struct UChannel*> *be2f9ef971; // 0x130(0x10)
	char pad_140[0x28]; // 0x140(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x168(0x18)
	char pad_180[0x68]; // 0x180(0x68)
	double *8efce3eca0; // 0x1e8(0x08)
	char pad_1F0[0x65538]; // 0x1f0(0x65538)
	struct TArray<struct UChannel*> *0f9ee5b029; // 0x65728(0x10)
	char pad_65738[0x110]; // 0x65738(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x40 (Inherited: 0x28)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*205de32a17> ChannelDetails; // 0x28(0x10)
	float Duration; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.GameSession
// Size: 0x400 (Inherited: 0x3e8)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x3e8(0x04)
	int32 MaxPlayers; // 0x3ec(0x04)
	int32 *2ad8f4e517; // 0x3f0(0x04)
	bool MaxSplitscreensPerConnection; // 0x3f4(0x01)
	bool bRequiresPushToTalk; // 0x3f5(0x01)
	char pad_3F6[0x2]; // 0x3f6(0x02)
	struct FName SessionName; // 0x3f8(0x08)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc10 (Inherited: 0xb30)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*4c863aba6e> PerInstanceSMData; // 0xb30(0x10)
	int32 InstancingRandomSeed; // 0xb40(0x04)
	int32 InstanceStartCullDistance; // 0xb44(0x04)
	int32 InstanceEndCullDistance; // 0xb48(0x04)
	char pad_B4C[0x4]; // 0xb4c(0x04)
	struct TArray<int32> *27d7b53530; // 0xb50(0x10)
	struct TArray<int32> *1e6d926d08; // 0xb60(0x10)
	char pad_B70[0x78]; // 0xb70(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xbe8(0x08)
	bool *51ec92abde; // 0xbf0(0x01)
	char pad_BF1[0x3]; // 0xbf1(0x03)
	int32 *5a45105c4b; // 0xbf4(0x04)
	struct TArray<struct F*91c2e21207> *e45f5a1fc9; // 0xbf8(0x10)
	char pad_C08[0x8]; // 0xc08(0x08)

	struct FTransform *fb3e7943e7(struct FVector4 InPerInstanceCustomData); // Function Engine.InstancedStaticMeshComponent.*fb3e7943e7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fcb34
	void *34858cee07(int32 InstanceIndex); // Function Engine.InstancedStaticMeshComponent.*34858cee07 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x653fa98
	bool *74896c1b04(); // Function Engine.InstancedStaticMeshComponent.*74896c1b04 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518d1c
	void *f11665ac8b(); // Function Engine.InstancedStaticMeshComponent.*f11665ac8b // Native|Public|BlueprintCallable // @ game+0xa44bbc
	void *e3f589368d(float Radius, bool bSphereInWorldSpace); // Function Engine.InstancedStaticMeshComponent.*e3f589368d // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6519610
	bool *a236834d4b(); // Function Engine.InstancedStaticMeshComponent.*a236834d4b // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x655084c
	void *5fa70cdbed(struct FVector4 OutPerInstanceCustomData); // Function Engine.InstancedStaticMeshComponent.*5fa70cdbed // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518898
	struct FVector4 *a5fc070c25(); // Function Engine.InstancedStaticMeshComponent.*a5fc070c25 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fc6f4
	struct FBox *e2a0483047(bool bBoxInWorldSpace); // Function Engine.InstancedStaticMeshComponent.*e2a0483047 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65194a8
	void *5d18775563(); // Function Engine.InstancedStaticMeshComponent.*5d18775563 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65186b8
	int32 *8f18d87416(); // Function Engine.InstancedStaticMeshComponent.*8f18d87416 // Native|Public|BlueprintCallable // @ game+0x6535dbc
	int32 *b2a56a014a(); // Function Engine.InstancedStaticMeshComponent.*b2a56a014a // Final|Native|Public|BlueprintCallable // @ game+0x653c5f8
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xd40 (Inherited: 0xc10)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C10[0x68]; // 0xc10(0x68)
	struct TArray<int32> *1ea986fdd9; // 0xc78(0x10)
	int32 *c1094df86a; // 0xc88(0x04)
	char pad_C8C[0x4]; // 0xc8c(0x04)
	struct FBox *54127f44a0; // 0xc90(0x1c)
	struct FBox *b92c55ee01; // 0xcac(0x1c)
	struct TArray<struct FBox> *135ab4ba4c; // 0xcc8(0x10)
	char pad_CD8[0x20]; // 0xcd8(0x20)
	int32 *d51b7513be; // 0xcf8(0x04)
	struct FBoxSphereBounds *492020ad6c; // 0xcfc(0x1c)
	char *e0205a426d : 1; // 0xd18(0x01)
	char *80d1f14af7 : 1; // 0xd18(0x01)
	char pad_D18_2 : 6; // 0xd18(0x01)
	char pad_D19[0x27]; // 0xd19(0x27)

	struct TArray<int32> *1ad0bfab12(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*1ad0bfab12 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6535e60
};

// Class Engine.*b3661966b1
// Size: 0xd40 (Inherited: 0xd40)
struct U*b3661966b1 : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xd38(0x04)
};

// Class Engine.NavLinkProxy
// Size: 0x438 (Inherited: 0x3e8)
struct ANavLinkProxy : AActor {
	char pad_3E8[0x10]; // 0x3e8(0x10)
	struct TArray<struct FNavigationLink> PointLinks; // 0x3f8(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks; // 0x408(0x10)
	struct UNavLinkCustomComponent* SmartLinkComp; // 0x418(0x08)
	bool *4ca76d14ea; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct FMulticastDelegate OnSmartLinkReached; // 0x428(0x10)

	void *2be3a03e1b(); // Function Engine.NavLinkProxy.*2be3a03e1b // Final|Native|Public|BlueprintCallable // @ game+0x64eca6c
	struct AActor* ReceiveSmartLinkReached(); // Function Engine.NavLinkProxy.ReceiveSmartLinkReached // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x32e590
	void *b31ecb569a(); // Function Engine.NavLinkProxy.*b31ecb569a // Final|Native|Public|BlueprintCallable // @ game+0x64f520c
	void *77f910379c(); // Function Engine.NavLinkProxy.*77f910379c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e40a0
	void *2d23854a56(); // Function Engine.NavLinkProxy.*2d23854a56 // Final|Native|Public // @ game+0xaa4b6c
	void *39772e22ca(); // Function Engine.NavLinkProxy.*39772e22ca // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e4fd4
};

// Class Engine.LocalPlayer
// Size: 0x280 (Inherited: 0x48)
struct ULocalPlayer : UPlayer {
	char pad_48[0x68]; // 0x48(0x68)
	struct UClass* *dba1add6cc; // 0xb0(0x08)
	char pad_B8[0x38]; // 0xb8(0x38)
	char *c4e1796760 : 1; // 0xf0(0x01)
	char pad_F0_1 : 7; // 0xf0(0x01)
	char pad_F1[0x18f]; // 0xf1(0x18f)
};

// Class Engine.*987a7e4edb
// Size: 0x28 (Inherited: 0x28)
struct U*987a7e4edb : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1d00 (Inherited: 0x3e8)
struct APlayerCameraManager : AActor {
	struct APlayerController* *337303fb79; // 0x3e8(0x08)
	struct USceneComponent* TransformComponent; // 0x3f0(0x08)
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct TArray<struct UClass*> DefaultModifiers; // 0x400(0x10)
	struct FVector FreeCamOffset; // 0x410(0x0c)
	char pad_41C[0x4]; // 0x41c(0x04)
	float DefaultOrthoWidth; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	float DefaultAspectRatio; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct F*4156116286 *b9e38e345e; // 0x430(0x5d0)
	float ViewYawMin; // 0xa00(0x04)
	char pad_A04[0xc]; // 0xa04(0x0c)
	struct F*8aa6907eaa ViewTarget; // 0xa10(0x5e0)
	char pad_FF0[0x10]; // 0xff0(0x10)
	float ViewPitchMax; // 0x1000(0x04)
	float ViewRollMin; // 0x1004(0x04)
	char pad_1008[0x8]; // 0x1008(0x08)
	struct F*4156116286 *3db2ea3e19; // 0x1010(0x5d0)
	float ViewPitchMin; // 0x15e0(0x04)
	char pad_15E4[0x4]; // 0x15e4(0x04)
	float ViewRollMax; // 0x15e8(0x04)
	char pad_15EC[0xc]; // 0x15ec(0x0c)
	struct TArray<struct U*6f88f7780c*> *3ba8d1be87; // 0x15f8(0x10)
	float ViewYawMax; // 0x1608(0x04)
	float DefaultFOV; // 0x160c(0x04)
	char pad_1610[0x20]; // 0x1610(0x20)
	struct F*8aa6907eaa *c127c2df70; // 0x1630(0x5e0)
	char pad_1C10[0x4]; // 0x1c10(0x04)
	struct FVector ViewTargetOffset; // 0x1c14(0x0c)
	struct TArray<struct AEmitterCameraLensEffectBase*> *8de88dbdb2; // 0x1c20(0x10)
	struct U*b78b10b0de* *31a29477e5; // 0x1c30(0x08)
	struct U*6ec4247e64* *4f634c058f[0x08]; // 0x1c38(0x40)
	struct TArray<struct FPostProcessSettings> *08ad61c413; // 0x1c78(0x10)
	char pad_1C88[0x10]; // 0x1c88(0x10)
	struct TArray<struct U*6ec4247e64*> *618c273364; // 0x1c98(0x10)
	struct TArray<struct U*6ec4247e64*> *9a08cca306; // 0x1ca8(0x10)
	struct ACameraActor* *a53a740657; // 0x1cb8(0x08)
	char bIsOrthographic : 1; // 0x1cc0(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x1cc0(0x01)
	char pad_1CC0_2 : 5; // 0x1cc0(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1cc0(0x01)
	char pad_1CC1[0x2f]; // 0x1cc1(0x2f)
	float FreeCamDistance; // 0x1cf0(0x04)
	char pad_1CF4[0xc]; // 0x1cf4(0x0c)

	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x580ba2c
	struct UClass* *e8095d1352(); // Function Engine.PlayerCameraManager.*e8095d1352 // Native|Public|BlueprintCallable // @ game+0x64d4c30
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0xc7da20
	void *2e8b0c44f7(float FromAlpha, float Duration, bool bShouldFadeAudio); // Function Engine.PlayerCameraManager.*2e8b0c44f7 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f69ec
	void *c088fc72a2(); // Function Engine.PlayerCameraManager.*c088fc72a2 // Native|Public|BlueprintCallable // @ game+0x64f7160
	void *fb39f794ac(); // Function Engine.PlayerCameraManager.*fb39f794ac // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x9d517c
	struct UClass* *1f80dc24b8(); // Function Engine.PlayerCameraManager.*1f80dc24b8 // Native|Public|BlueprintCallable // @ game+0x64f6f04
	void *425fe6edc8(struct UClass* ModifierClass); // Function Engine.PlayerCameraManager.*425fe6edc8 // Native|Public|BlueprintCallable // @ game+0x64dd318
	struct U*6ec4247e64* *525fdb233a(); // Function Engine.PlayerCameraManager.*525fdb233a // Native|Public|BlueprintCallable // @ game+0x64f707c
	float *8bc8bf3569(float BlendInTime, bool bLoop, float Duration, struct FRotator UserPlaySpaceRot); // Function Engine.PlayerCameraManager.*8bc8bf3569 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64eb708
	void *7b429467f1(); // Function Engine.PlayerCameraManager.*7b429467f1 // Native|Public|BlueprintCallable // @ game+0x64f6cf0
	struct FVector PhotographyCameraModify(struct FVector OriginalCameraLocation); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x64eb374
	void *b6fe6d34c7(); // Function Engine.PlayerCameraManager.*b6fe6d34c7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfe84
	void *2aa021959f(); // Function Engine.PlayerCameraManager.*2aa021959f // Native|Public|BlueprintCallable // @ game+0x5772148
	float BlueprintUpdateCamera(); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x32e590
	void *8e5bd58a3c(struct UCameraShake* ShakeInstance); // Function Engine.PlayerCameraManager.*8e5bd58a3c // Native|Public|BlueprintCallable // @ game+0x64f7178
	void *60f87ce7b1(float InFadeAmount); // Function Engine.PlayerCameraManager.*60f87ce7b1 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f39a4
	void *7eacfe0be3(); // Function Engine.PlayerCameraManager.*7eacfe0be3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57cf08c
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x580ba14
	void *21c6524708(struct UCameraAnim* Anim); // Function Engine.PlayerCameraManager.*21c6524708 // Native|Public|BlueprintCallable // @ game+0x64f6e20
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x57d21a0
	void *16a0f6ce64(); // Function Engine.PlayerCameraManager.*16a0f6ce64 // Native|Public|BlueprintCallable // @ game+0x64ec248
	struct FRotator *81fbfd81fe(); // Function Engine.PlayerCameraManager.*81fbfd81fe // Native|Public|HasDefaults|BlueprintCallable // @ game+0xb0a518
	void *77a059e7d8(); // Function Engine.PlayerCameraManager.*77a059e7d8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dee9c
	void *cb0d0af535(); // Function Engine.PlayerCameraManager.*cb0d0af535 // Native|Public|BlueprintCallable // @ game+0x64ec2dc
	struct UClass* *02258300bf(); // Function Engine.PlayerCameraManager.*02258300bf // Native|Public|BlueprintCallable // @ game+0x64d604c
	void *2afd20dc05(); // Function Engine.PlayerCameraManager.*2afd20dc05 // Native|Public|BlueprintCallable // @ game+0x64f6d88
};

// Class Engine.PlayerInput
// Size: 0x488 (Inherited: 0x28)
struct UPlayerInput : UObject {
	char pad_28[0xf8]; // 0x28(0xf8)
	struct TArray<struct F*2717edfafa> DebugExecBindings; // 0x120(0x10)
	char pad_130[0x30]; // 0x130(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x160(0x10)
	char pad_170[0x318]; // 0x170(0x318)

	void SetGamePadSensitivity(); // Function Engine.PlayerInput.SetGamePadSensitivity // Final|Exec|Native|Public // @ game+0x64f2ad8
	struct FKey SetGamePadSensitivityOf(); // Function Engine.PlayerInput.SetGamePadSensitivityOf // Final|Exec|Native|Public // @ game+0x64f2b70
	void InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x64e428c
	void InvertAxisKey(); // Function Engine.PlayerInput.InvertAxisKey // Final|Exec|Native|Public // @ game+0x64e431c
	struct FName SetBind(); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x64f10a8
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // Final|Exec|Native|Public // @ game+0x64d7738
	void SetMouseSensitivity(); // Function Engine.PlayerInput.SetMouseSensitivity // Final|Exec|Native|Public // @ game+0x64f3f94
	void SetGamePadDeadZone(); // Function Engine.PlayerInput.SetGamePadDeadZone // Final|Exec|Native|Public // @ game+0x64f2904
	struct FKey SetGamePadDeadZoneOf(); // Function Engine.PlayerInput.SetGamePadDeadZoneOf // Final|Exec|Native|Public // @ game+0x64f299c
};

// Class Engine.NavigationData
// Size: 0x590 (Inherited: 0x3e8)
struct ANavigationData : AActor {
	struct UPrimitiveComponent* RenderingComp; // 0x3e8(0x08)
	struct F*462177a17f *462177a17f; // 0x3f0(0x50)
	char *bac07b4450 : 1; // 0x440(0x01)
	char bForceRebuildOnLoad : 1; // 0x440(0x01)
	char bCanBeMainNavData : 1; // 0x440(0x01)
	char bCanSpawnOnRebuild : 1; // 0x440(0x01)
	char bRebuildAtRuntime : 1; // 0x440(0x01)
	char pad_440_5 : 3; // 0x440(0x01)
	char pad_441[0x3]; // 0x441(0x03)
	enum class ERuntimeGenerationType RuntimeGeneration; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float ObservedPathsTickInterval; // 0x448(0x04)
	char *2ebe96be74 : 1; // 0x44c(0x01)
	char pad_44C_1 : 7; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	uint32 DataVersion; // 0x450(0x04)
	char pad_454[0xd4]; // 0x454(0xd4)
	struct TArray<struct F*0d9672f37f> *d7200b38ad; // 0x528(0x10)
	char pad_538[0x58]; // 0x538(0x58)
};

// Class Engine.RecastNavMesh
// Size: 0x6a0 (Inherited: 0x590)
struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x590(0x01)
	char bDrawPolyEdges : 1; // 0x590(0x01)
	char bDrawFilledPolys : 1; // 0x590(0x01)
	char bDrawNavMeshEdges : 1; // 0x590(0x01)
	char *6c6c1af813 : 1; // 0x590(0x01)
	char *e038d03c15 : 1; // 0x590(0x01)
	char *562f95af0f : 1; // 0x590(0x01)
	char *9f56e33560 : 1; // 0x590(0x01)
	char *222ec416dc : 1; // 0x591(0x01)
	char *411252ef0e : 1; // 0x591(0x01)
	char *3fc58fe4e3 : 1; // 0x591(0x01)
	char *56901851bd : 1; // 0x591(0x01)
	char *976f67927b : 1; // 0x591(0x01)
	char *3a378a3576 : 1; // 0x591(0x01)
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x591(0x01)
	char *3186dc8861 : 1; // 0x591(0x01)
	char pad_592[0x2]; // 0x592(0x02)
	float DrawOffset; // 0x594(0x04)
	char bFixedTilePoolSize : 1; // 0x598(0x01)
	char pad_598_1 : 7; // 0x598(0x01)
	char pad_599[0x3]; // 0x599(0x03)
	int32 TilePoolSize; // 0x59c(0x04)
	float TileSizeUU; // 0x5a0(0x04)
	float CellSize; // 0x5a4(0x04)
	float CellHeight; // 0x5a8(0x04)
	float AgentRadius; // 0x5ac(0x04)
	float AgentHeight; // 0x5b0(0x04)
	float AgentMaxHeight; // 0x5b4(0x04)
	float AgentMaxSlope; // 0x5b8(0x04)
	float AgentMaxStepHeight; // 0x5bc(0x04)
	float MinRegionArea; // 0x5c0(0x04)
	float MergeRegionSize; // 0x5c4(0x04)
	float MaxSimplificationError; // 0x5c8(0x04)
	int32 MaxSimultaneousTileGenerationJobsCount; // 0x5cc(0x04)
	int32 TileNumberHardLimit; // 0x5d0(0x04)
	int32 *30c0de5171; // 0x5d4(0x04)
	int32 *880eefab19; // 0x5d8(0x04)
	int32 *02abe6f742; // 0x5dc(0x04)
	float DefaultDrawDistance; // 0x5e0(0x04)
	float DefaultMaxSearchNodes; // 0x5e4(0x04)
	float DefaultMaxHierarchicalSearchNodes; // 0x5e8(0x04)
	enum class ERecastPartitioning RegionPartitioning; // 0x5ec(0x01)
	enum class ERecastPartitioning LayerPartitioning; // 0x5ed(0x01)
	char pad_5EE[0x2]; // 0x5ee(0x02)
	int32 RegionChunkSplits; // 0x5f0(0x04)
	int32 LayerChunkSplits; // 0x5f4(0x04)
	char bSortNavigationAreasByCost : 1; // 0x5f8(0x01)
	char bPerformVoxelFiltering : 1; // 0x5f8(0x01)
	char bMarkLowHeightAreas : 1; // 0x5f8(0x01)
	char bDoFullyAsyncNavDataGathering : 1; // 0x5f8(0x01)
	char bUseBetterOffsetsFromCorners : 1; // 0x5f8(0x01)
	char bStoreEmptyTileLayers : 1; // 0x5f8(0x01)
	char bUseVirtualFilters : 1; // 0x5f8(0x01)
	char bAllowNavLinkAsPathEnd : 1; // 0x5f8(0x01)
	char pad_5F9[0x3]; // 0x5f9(0x03)
	bool bOnlySavedOnDS; // 0x5fc(0x01)
	char pad_5FD[0x3]; // 0x5fd(0x03)
	char bUseVoxelCache : 1; // 0x600(0x01)
	char pad_600_1 : 7; // 0x600(0x01)
	char pad_601[0x3]; // 0x601(0x03)
	float TileSetUpdateInterval; // 0x604(0x04)
	float HeuristicScale; // 0x608(0x04)
	float VerticalDeviationFromGroundCompensation; // 0x60c(0x04)
	char pad_610[0x90]; // 0x610(0x90)
};

// Class Engine.*095debd2a0
// Size: 0x38 (Inherited: 0x28)
struct U*095debd2a0 : UObject {
	struct TArray<struct F*94b0348d76> *fed618dac9; // 0x28(0x10)
};

// Class Engine.SceneCaptureComponent
// Size: 0x4e0 (Inherited: 0x460)
struct USceneCaptureComponent : USceneComponent {
	struct TArray<struct UPrimitiveComponent*> *ef56703d53; // 0x458(0x10)
	struct TArray<struct AActor*> HiddenActors; // 0x468(0x10)
	struct TArray<struct UPrimitiveComponent*> *331673c74c; // 0x478(0x10)
	struct TArray<struct AActor*> ShowOnlyActors; // 0x488(0x10)
	bool bIsLobbyCapture; // 0x498(0x01)
	bool bCaptureEveryFrame; // 0x499(0x01)
	bool bCaptureOnMovement; // 0x49a(0x01)
	float LODDistanceFactor; // 0x49c(0x04)
	float MaxViewDistanceOverride; // 0x4a0(0x04)
	int32 CaptureSortPriority; // 0x4a4(0x04)
	struct TArray<struct F*b7c981d2f2> ShowFlagSettings; // 0x4a8(0x10)
	char pad_4BF[0x21]; // 0x4bf(0x21)

	void *19e9f39c55(); // Function Engine.SceneCaptureComponent.*19e9f39c55 // Final|Native|Public|BlueprintCallable // @ game+0x6521b54
	void *65ed61b800(); // Function Engine.SceneCaptureComponent.*65ed61b800 // Final|Native|Public|BlueprintCallable // @ game+0x6521cf4
	void *e17a9e386f(); // Function Engine.SceneCaptureComponent.*e17a9e386f // Final|Native|Public|BlueprintCallable // @ game+0x653613c
	void *49d5d2a458(); // Function Engine.SceneCaptureComponent.*49d5d2a458 // Final|Native|Public|BlueprintCallable // @ game+0x6549438
	void *1248442e38(); // Function Engine.SceneCaptureComponent.*1248442e38 // Final|Native|Public|BlueprintCallable // @ game+0x653afec
	void *779e2d00c6(); // Function Engine.SceneCaptureComponent.*779e2d00c6 // Final|Native|Public|BlueprintCallable // @ game+0x650932c
	void *f3cad6b200(); // Function Engine.SceneCaptureComponent.*f3cad6b200 // Final|Native|Public|BlueprintCallable // @ game+0x65360ac
	void *4136dcbbf8(); // Function Engine.SceneCaptureComponent.*4136dcbbf8 // Final|Native|Public|BlueprintCallable // @ game+0x65494c8
};

// Class Engine.SceneCaptureComponent2D
// Size: 0xb10 (Inherited: 0x4e0)
struct USceneCaptureComponent2D : USceneCaptureComponent {
	enum class ECameraProjectionMode ProjectionType; // 0x4d8(0x01)
	float FOVAngle; // 0x4dc(0x04)
	bool *0fe8ec7f05; // 0x4e0(0x01)
	float *3c48c0d9c6; // 0x4e4(0x04)
	float OrthoWidth; // 0x4e8(0x04)
	char pad_4EE[0x2]; // 0x4ee(0x02)
	struct UTextureRenderTarget2D* TextureTarget; // 0x4f0(0x08)
	enum class *b7ca9f4a0d CaptureSource; // 0x4f8(0x01)
	enum class *d1df128539 CompositeMode; // 0x4f9(0x01)
	char pad_4FA[0x2]; // 0x4fa(0x02)
	struct FLinearColor LightingOnlyBrightness; // 0x4fc(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x50c(0x10)
	struct FLinearColor LightingOnlyCustomData; // 0x51c(0x10)
	float LightingOnlyCustomDataAlpha; // 0x52c(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x530(0x570)
	float PostProcessBlendWeight; // 0xaa0(0x04)
	bool bUseCustomProjectionMatrix; // 0xaa4(0x01)
	char pad_AA5[0xb]; // 0xaa5(0x0b)
	struct FMatrix CustomProjectionMatrix; // 0xab0(0x40)
	char *32c0f2ecda : 1; // 0xaf0(0x01)
	char pad_AF0_1 : 7; // 0xaf0(0x01)
	char pad_AF1[0x3]; // 0xaf1(0x03)
	bool bEnableClipPlane; // 0xaf4(0x01)
	char pad_AF5[0x3]; // 0xaf5(0x03)
	struct FVector ClipPlaneBase; // 0xaf8(0x0c)
	struct FVector ClipPlaneNormal; // 0xb04(0x0c)

	void CaptureScene(); // Function Engine.SceneCaptureComponent2D.CaptureScene // Final|Native|Public|BlueprintCallable // @ game+0x6508c30
	TScriptInterface<struct UBlendableInterface> *279e5ee7e9(); // Function Engine.SceneCaptureComponent2D.*279e5ee7e9 // Final|Native|Public|BlueprintCallable // @ game+0x64fcf50
};

// Class Engine.ArrowComponent
// Size: 0x9a0 (Inherited: 0x990)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor; // 0x988(0x04)
	float ArrowSize; // 0x98c(0x04)
	bool bIsScreenSizeScaled; // 0x990(0x01)
	float ScreenSize; // 0x994(0x04)
	char bTreatAsASprite : 1; // 0x998(0x01)
	char pad_99D_1 : 7; // 0x99d(0x01)
	char pad_99E[0x2]; // 0x99e(0x02)

	void SetArrowColor(); // Function Engine.ArrowComponent.SetArrowColor // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6539460
};

// Class Engine.NavModifierVolume
// Size: 0x430 (Inherited: 0x420)
struct ANavModifierVolume : AVolume {
	char pad_420[0x8]; // 0x420(0x08)
	struct UClass* AreaClass; // 0x428(0x08)

	void *d8bfb93e76(); // Function Engine.NavModifierVolume.*d8bfb93e76 // Final|Native|Public|BlueprintCallable // @ game+0x64f007c
};

// Class Engine.ParticleSystemComponent
// Size: 0xbf0 (Inherited: 0x990)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template; // 0x988(0x08)
	struct TArray<struct UMaterialInterface*> *00f7198f74; // 0x990(0x10)
	struct TArray<struct USkeletalMeshComponent*> *5a07e1add1; // 0x9a0(0x10)
	char pad_9B8_0 : 7; // 0x9b8(0x01)
	char bResetOnDetach : 1; // 0x9b0(0x01)
	char *ff8d451cae : 1; // 0x9b1(0x01)
	char bAllowRecycling : 1; // 0x9b1(0x01)
	char bAutoManageAttachment : 1; // 0x9b1(0x01)
	char *a2f085d08c : 1; // 0x9b1(0x01)
	char bOverrideLODMethod : 1; // 0x9b2(0x01)
	char *0ba5990fe1 : 1; // 0x9b2(0x01)
	char *7273167b2a : 1; // 0x9b2(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0x9b8(0x10)
	struct FMulticastDelegate OnParticleSpawn; // 0x9c8(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x9d8(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0x9e8(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0x9f8(0x10)
	struct FVector *133f54f9c1; // 0xa08(0x0c)
	struct FVector *03cebd95ff; // 0xa14(0x0c)
	float WarmupTime; // 0xa20(0x04)
	float *21f822f4fc; // 0xa24(0x04)
	char pad_A29[0x3]; // 0xa29(0x03)
	float SecondsBeforeInactive; // 0xa2c(0x04)
	char pad_A30[0x4]; // 0xa30(0x04)
	float *28094ea3db; // 0xa34(0x04)
	char pad_A38[0x8]; // 0xa38(0x08)
	enum class *d8246e725f LODMethod; // 0xa40(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0xa41(0x01)
	char pad_A42[0x16]; // 0xa42(0x16)
	struct TArray<struct U*e7dabfb57c*> *69abc3880d; // 0xa58(0x10)
	char pad_A68[0x60]; // 0xa68(0x60)
	float CustomTimeDilation; // 0xac8(0x04)
	char pad_ACC[0x4]; // 0xacc(0x04)
	struct FMulticastDelegate OnSystemFinished; // 0xad0(0x10)
	struct USceneComponent* AutoAttachParent; // 0xae0(0x08)
	struct FName AutoAttachSocketName; // 0xae8(0x08)
	enum class EAttachLocation AutoAttachLocationType; // 0xaf0(0x01)
	enum class EAttachmentRule AutoAttachLocationRule; // 0xaf1(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0xaf2(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0xaf3(0x01)
	char pad_AF4[0xfc]; // 0xaf4(0xfc)

	void *af8f2729da(); // Function Engine.ParticleSystemComponent.*af8f2729da // Final|Native|Public|BlueprintCallable // @ game+0x64f0434
	struct FVector *9016027b91(); // Function Engine.ParticleSystemComponent.*9016027b91 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de828
	void *8f3b7c4a62(int32 emitterIndex); // Function Engine.ParticleSystemComponent.*8f3b7c4a62 // Native|Public|BlueprintCallable // @ game+0x64f0aa4
	void *23a60326d0(); // Function Engine.ParticleSystemComponent.*23a60326d0 // Final|Native|Public|BlueprintCallable // @ game+0x64f54f8
	struct FName *8dd7e62706(); // Function Engine.ParticleSystemComponent.*8dd7e62706 // Final|Native|Public|BlueprintCallable // @ game+0x64f3de0
	void *4a5ebe8285(int32 emitterIndex, struct FVector OutTargetPoint); // Function Engine.ParticleSystemComponent.*4a5ebe8285 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de96c
	void *5da5ae8752(struct FName ParameterName); // Function Engine.ParticleSystemComponent.*5da5ae8752 // Final|Native|Public|BlueprintCallable // @ game+0x64ef970
	struct FVector *9c94a2ccab(); // Function Engine.ParticleSystemComponent.*9c94a2ccab // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f0f6c
	void *bb78f88ed2(int32 emitterIndex); // Function Engine.ParticleSystemComponent.*bb78f88ed2 // Native|Public|BlueprintCallable // @ game+0x64f0e44
	void *8fbddde934(struct FName ParameterName); // Function Engine.ParticleSystemComponent.*8fbddde934 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f5e7c
	int32 *b5b49ed10a(); // Function Engine.ParticleSystemComponent.*b5b49ed10a // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f086c
	void *cc31ded515(); // Function Engine.ParticleSystemComponent.*cc31ded515 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e23d0
	void *e0804ccf30(struct FName InName); // Function Engine.ParticleSystemComponent.*e0804ccf30 // Native|Public|BlueprintCallable // @ game+0x64dae20
	enum class *37b72e83a6 *5e90794424(); // Function Engine.ParticleSystemComponent.*5e90794424 // Final|Native|Public|BlueprintCallable // @ game+0x64f57d0
	int32 *91864b1bfc(float OutTargetStrength); // Function Engine.ParticleSystemComponent.*91864b1bfc // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64deab0
	void *81aa9c9e01(int32 SourceIndex); // Function Engine.ParticleSystemComponent.*81aa9c9e01 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64de6e8
	struct FName SetFloatParameter(); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x64f2784
	void *dcd1366a40(); // Function Engine.ParticleSystemComponent.*dcd1366a40 // Final|Native|Public|BlueprintCallable // @ game+0x64dd074
	void *87d95bf46d(int32 emitterIndex); // Function Engine.ParticleSystemComponent.*87d95bf46d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f0bcc
	struct FVector *5a5e9d1b9b(); // Function Engine.ParticleSystemComponent.*5a5e9d1b9b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f0d08
	enum class *37b72e83a6 *56ca8e695c(); // Function Engine.ParticleSystemComponent.*56ca8e695c // Final|Native|Public|BlueprintCallable // @ game+0x64d6bfc
	void *ffaa140e86(int32 emitterIndex, struct FVector OutTangentPoint); // Function Engine.ParticleSystemComponent.*ffaa140e86 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64debf0
	struct FVector *c5fef19fba(); // Function Engine.ParticleSystemComponent.*c5fef19fba // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dd57c
	void *d026be7050(int32 emitterIndex); // Function Engine.ParticleSystemComponent.*d026be7050 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de4ac
	struct FVector *d65be3badb(); // Function Engine.ParticleSystemComponent.*d65be3badb // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f0968
	struct FName *0a63d98f02(); // Function Engine.ParticleSystemComponent.*0a63d98f02 // Final|Native|Public|BlueprintCallable // @ game+0x64f02ec
	void *2b029e7d25(struct FName ParameterName); // Function Engine.ParticleSystemComponent.*2b029e7d25 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f1d18
	struct FVector *d513b656ba(); // Function Engine.ParticleSystemComponent.*d513b656ba // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de5a4
	struct FName *4bf991f689(); // Function Engine.ParticleSystemComponent.*4bf991f689 // Native|Public|BlueprintCallable // @ game+0x64f23c0
	void *5a1c100be7(struct FName InName); // Function Engine.ParticleSystemComponent.*5a1c100be7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2188
};

// Class Engine.DefaultPawn
// Size: 0x478 (Inherited: 0x450)
struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x450(0x04)
	float BaseLookUpRate; // 0x454(0x04)
	struct UPawnMovementComponent* MovementComponent; // 0x458(0x08)
	struct USphereComponent* CollisionComponent; // 0x460(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x468(0x08)
	char bAddDefaultMovementBindings : 1; // 0x470(0x01)
	char pad_470_1 : 7; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)

	void *b7bc4778c8(); // Function Engine.DefaultPawn.*b7bc4778c8 // Native|Public|BlueprintCallable // @ game+0x64ead24
	void MoveRight(); // Function Engine.DefaultPawn.MoveRight // Native|Public|BlueprintCallable // @ game+0x64eac88
	void MoveForward(); // Function Engine.DefaultPawn.MoveForward // Native|Public|BlueprintCallable // @ game+0x64eabec
	void *100c4e8c95(); // Function Engine.DefaultPawn.*100c4e8c95 // Final|Native|Public|BlueprintCallable // @ game+0x64f7700
	void *f6d7ca130e(); // Function Engine.DefaultPawn.*f6d7ca130e // Final|Native|Public|BlueprintCallable // @ game+0x64ea8f8
};

// Class Engine.SpectatorPawn
// Size: 0x478 (Inherited: 0x478)
struct ASpectatorPawn : ADefaultPawn {
};

// Class Engine.FloatingPawnMovement
// Size: 0x290 (Inherited: 0x280)
struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x278(0x04)
	float Acceleration; // 0x27c(0x04)
	float Deceleration; // 0x280(0x04)
	float TurningBoost; // 0x284(0x04)
	char *764464ee1e : 1; // 0x288(0x01)
};

// Class Engine.SpectatorPawnMovement
// Size: 0x2a0 (Inherited: 0x290)
struct USpectatorPawnMovement : UFloatingPawnMovement {
	char *4c44f735ef : 1; // 0x290(0x01)
	char pad_290_1 : 7; // 0x290(0x01)
	char pad_291[0xf]; // 0x291(0x0f)
};

// Class Engine.SplineComponent
// Size: 0xa80 (Inherited: 0x990)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves *224d387ba3; // 0x988(0x60)
	struct FInterpCurveVector SplineInfo; // 0x9e8(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0xa00(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0xa18(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0xa30(0x18)
	bool bAllowSplineEditingPerInstance; // 0xa48(0x01)
	int32 *f8e649923a; // 0xa4c(0x04)
	bool *f2a977ad56; // 0xa50(0x01)
	bool *2893c957ff; // 0xa51(0x01)
	float *cdd4b1628c; // 0xa54(0x04)
	float Duration; // 0xa58(0x04)
	bool bStationaryEndpoints; // 0xa5c(0x01)
	bool *1e587541cf; // 0xa5d(0x01)
	bool *49d508f387; // 0xa5e(0x01)
	bool bInputSplinePointsToConstructionScript; // 0xa5f(0x01)
	bool bDrawDebug; // 0xa60(0x01)
	bool *c5ecf4ffed; // 0xa61(0x01)
	bool bLoopPositionOverride; // 0xa62(0x01)
	float *f6c05ad304; // 0xa64(0x04)
	struct FVector DefaultUpVector; // 0xa68(0x0c)
	char pad_A76[0xa]; // 0xa76(0x0a)

	void *d673f600e5(float Distance); // Function Engine.SplineComponent.*d673f600e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651c8fc
	enum class ESplineCoordinateSpace *8ecb0fa226(); // Function Engine.SplineComponent.*8ecb0fa226 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6512c44
	void *fdf9e67fe7(); // Function Engine.SplineComponent.*fdf9e67fe7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fd2b0
	void *6ead38f785(float Distance); // Function Engine.SplineComponent.*6ead38f785 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651c5e4
	enum class ESplineCoordinateSpace *7408da665f(); // Function Engine.SplineComponent.*7408da665f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651247c
	int32 *8b88c5dc14(); // Function Engine.SplineComponent.*8b88c5dc14 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6519db8
	void *13b012d465(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*13b012d465 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651c9fc
	bool *ce47968eb4(); // Function Engine.SplineComponent.*ce47968eb4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ecac
	struct FVector *c6a9416911(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*c6a9416911 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6512d48
	void *3710f7f090(struct FVector WorldLocation); // Function Engine.SplineComponent.*3710f7f090 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6512f40
	struct FVector *a9c9c456e5(); // Function Engine.SplineComponent.*a9c9c456e5 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6512e78
	enum class ESplineCoordinateSpace *8c35d1f7f5(); // Function Engine.SplineComponent.*8c35d1f7f5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6517038
	void *1660da9917(int32 Index); // Function Engine.SplineComponent.*1660da9917 // Final|Native|Public|BlueprintCallable // @ game+0x65361dc
	void *3195c7e671(); // Function Engine.SplineComponent.*3195c7e671 // Final|Native|Public|BlueprintCallable // @ game+0x6509690
	void *d87c8d6bad(); // Function Engine.SplineComponent.*d87c8d6bad // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6523190
	int32 *f4439078ed(struct FVector LocalLocation); // Function Engine.SplineComponent.*f4439078ed // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6519f84
	bool *ce6002c659(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*ce6002c659 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651efcc
	float *33bc2a12af(); // Function Engine.SplineComponent.*33bc2a12af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6517f08
	void *4c7f033e12(bool bUseConstantVelocity); // Function Engine.SplineComponent.*4c7f033e12 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6520200
	void *bed6cf0bd0(float Time); // Function Engine.SplineComponent.*bed6cf0bd0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ff78
	bool *7c17f0a4fe(); // Function Engine.SplineComponent.*7c17f0a4fe // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6517234
	void *6aa9eb9d3e(); // Function Engine.SplineComponent.*6aa9eb9d3e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651d5b4
	void *94d245fc05(); // Function Engine.SplineComponent.*94d245fc05 // Final|Native|Public|BlueprintCallable // @ game+0x6550ac8
	enum class ESplineCoordinateSpace *8310eb6ecf(); // Function Engine.SplineComponent.*8310eb6ecf // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6519c94
	float *46b2142b51(); // Function Engine.SplineComponent.*46b2142b51 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6520088
	void *66b7b68804(); // Function Engine.SplineComponent.*66b7b68804 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64f1fd0
	void *ade3704335(); // Function Engine.SplineComponent.*ade3704335 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fd624
	enum class ESplineCoordinateSpace *0934b4ef0b(); // Function Engine.SplineComponent.*0934b4ef0b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651a27c
	float *a905ae0b50(); // Function Engine.SplineComponent.*a905ae0b50 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6520580
	void *5e679265d5(struct FVector Location); // Function Engine.SplineComponent.*5e679265d5 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651a0dc
	int32 *959750a15a(); // Function Engine.SplineComponent.*959750a15a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651d5dc
	enum class ESplineCoordinateSpace *f3e6cc0da5(); // Function Engine.SplineComponent.*f3e6cc0da5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6519c94
	void SetSplinePointType(int32 PointIndex); // Function Engine.SplineComponent.SetSplinePointType // Final|Native|Public|BlueprintCallable // @ game+0x6544584
	struct FSplinePoint *9608efba38(); // Function Engine.SplineComponent.*9608efba38 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64fd064
	float *646a979561(); // Function Engine.SplineComponent.*646a979561 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651cd60
	void AddSplinePoint(struct FVector Position); // Function Engine.SplineComponent.AddSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fd350
	enum class ESplineCoordinateSpace *746eb47343(); // Function Engine.SplineComponent.*746eb47343 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6514ad4
	enum class ESplineCoordinateSpace *1a380c46df(); // Function Engine.SplineComponent.*1a380c46df // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fd498
	void *19cbff31f5(); // Function Engine.SplineComponent.*19cbff31f5 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x654491c
	bool *f774fd53f0(); // Function Engine.SplineComponent.*f774fd53f0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6520470
	void *403b71cbdf(); // Function Engine.SplineComponent.*403b71cbdf // Final|Native|Public|BlueprintCallable // @ game+0x653d138
	void *1933a88fb1(); // Function Engine.SplineComponent.*1933a88fb1 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65444b8
	enum class ESplineCoordinateSpace *b8941565d3(int32 PointIndex); // Function Engine.SplineComponent.*b8941565d3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65457f8
	bool *4bd1c9f850(); // Function Engine.SplineComponent.*4bd1c9f850 // Final|Native|Public|BlueprintCallable // @ game+0x653b658
	void *f8859c177b(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*f8859c177b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6512b20
	void *2924338abc(bool bInClosedLoop); // Function Engine.SplineComponent.*2924338abc // Final|Native|Public|BlueprintCallable // @ game+0x653b750
	bool *501b9a11ab(); // Function Engine.SplineComponent.*501b9a11ab // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651caf8
	void *9e14956702(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.*9e14956702 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651c7c4
	enum class ESplineCoordinateSpace *56f46e0ef4(); // Function Engine.SplineComponent.*56f46e0ef4 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65131ec
	enum class ESplineCoordinateSpace *1b5eaab969(bool bUseConstantVelocity); // Function Engine.SplineComponent.*1b5eaab969 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651c49c
	void *4504979742(); // Function Engine.SplineComponent.*4504979742 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65125a0
	float *eda55d2a75(); // Function Engine.SplineComponent.*eda55d2a75 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65203b0
	struct TArray<struct FVector> *f34dca8240(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*f34dca8240 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65446b4
	void *7f0073e87c(int32 PointIndex); // Function Engine.SplineComponent.*7f0073e87c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6520148
	enum class ESplineCoordinateSpace *47ea0cb673(); // Function Engine.SplineComponent.*47ea0cb673 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651c268
	int32 *c7a047602a(); // Function Engine.SplineComponent.*c7a047602a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65478cc
	void *256a13f2fc(struct FVector InLocation); // Function Engine.SplineComponent.*256a13f2fc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6541444
	bool *7ec8746925(); // Function Engine.SplineComponent.*7ec8746925 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651a478
	void *c4855fe4f1(); // Function Engine.SplineComponent.*c4855fe4f1 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64fd180
	void *8a52c93cee(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*8a52c93cee // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651f8c0
	enum class ESplineCoordinateSpace *b453b9e47e(); // Function Engine.SplineComponent.*b453b9e47e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651a37c
	void *03a69497f9(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*03a69497f9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ee20
	int32 *6bb1fc9463(); // Function Engine.SplineComponent.*6bb1fc9463 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ce18
	enum class ESplineCoordinateSpace *c80b104bf3(); // Function Engine.SplineComponent.*c80b104bf3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651f78c
	void *4c5972a9ee(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.*4c5972a9ee // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6516dfc
	void *5ff9d6f2ec(int32 PointIndex); // Function Engine.SplineComponent.*5ff9d6f2ec // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6517138
	int32 *569d25225d(); // Function Engine.SplineComponent.*569d25225d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6517570
	void *ff1b454d4c(int32 PointIndex, struct FVector InLeaveTangent); // Function Engine.SplineComponent.*ff1b454d4c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6545984
	enum class ESplineCoordinateSpace *fb6ac9935d(); // Function Engine.SplineComponent.*fb6ac9935d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65466cc
	enum class ESplineCoordinateSpace *1c8bc77998(); // Function Engine.SplineComponent.*1c8bc77998 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651f68c
	void GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651aab0
	enum class ESplineCoordinateSpace *25a54483b3(); // Function Engine.SplineComponent.*25a54483b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651c6d8
	enum class ESplineCoordinateSpace *df6beb22a8(); // Function Engine.SplineComponent.*df6beb22a8 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651264c
	void *735d907566(struct FVector WorldLocation, bool bUseScale); // Function Engine.SplineComponent.*735d907566 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6513064
	float *79680f8e7c(); // Function Engine.SplineComponent.*79680f8e7c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651feb8
	bool *4d42091b21(); // Function Engine.SplineComponent.*4d42091b21 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ceec
	void *bbab5ff12a(); // Function Engine.SplineComponent.*bbab5ff12a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x653c96c
	enum class ESplineCoordinateSpace *eda3f2865f(); // Function Engine.SplineComponent.*eda3f2865f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ddd0
	void *a14ead8189(); // Function Engine.SplineComponent.*a14ead8189 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64f1fd0
	void *cb028b19c9(int32 PointIndex); // Function Engine.SplineComponent.*cb028b19c9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651c368
	bool *92b5343530(float Time); // Function Engine.SplineComponent.*92b5343530 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ded0
};

// Class Engine.MaterialInterface
// Size: 0x70 (Inherited: 0x28)
struct UMaterialInterface : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x30(0x08)
	char pad_38[0x8]; // 0x38(0x08)
	struct F*5f515f80fd LightmassSettings; // 0x40(0x14)
	char pad_54[0x4]; // 0x54(0x04)
	struct TArray<struct F*ec346d410d> *500d5753a1; // 0x58(0x10)
	char pad_68[0x8]; // 0x68(0x08)

	void *ea747ae92c(); // Function Engine.MaterialInterface.*ea747ae92c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2da0
	void *dab70eafa3(); // Function Engine.MaterialInterface.*dab70eafa3 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x64de414
};

// Class Engine.MaterialInstance
// Size: 0x1e0 (Inherited: 0x70)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0x70(0x08)
	struct UMaterialInterface* Parent; // 0x78(0x08)
	char *eaf1df3c01 : 1; // 0x80(0x01)
	char *72e525d9b9 : 1; // 0x80(0x01)
	char pad_80_2 : 1; // 0x80(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x80(0x01)
	char pad_80_4 : 4; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct TArray<struct F*2f1f908113> FontParameterValues; // 0x88(0x10)
	struct TArray<struct F*40219917e5> ScalarParameterValues; // 0x98(0x10)
	struct TArray<struct F*a504c41607> TextureParameterValues; // 0xa8(0x10)
	struct TArray<struct F*ded523a6c8> VectorParameterValues; // 0xb8(0x10)
	bool bOverrideBaseProperties; // 0xc8(0x01)
	char pad_C9[0x3]; // 0xc9(0x03)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xcc(0x24)
	char pad_F0[0xf0]; // 0xf0(0xf0)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x1e0 (Inherited: 0x1e0)
struct UMaterialInstanceConstant : UMaterialInstance {
};

// Class Engine.MaterialExpression
// Size: 0x60 (Inherited: 0x28)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x28(0x08)
	struct UMaterialFunction* Function; // 0x30(0x08)
	struct FString Desc; // 0x38(0x10)
	struct FColor BorderColor; // 0x48(0x04)
	char *cea6bfdf23 : 1; // 0x4c(0x01)
	char *bd8ba0fbe0 : 1; // 0x4c(0x01)
	char *557ea9fb7b : 1; // 0x4c(0x01)
	char *ae1d26f90d : 1; // 0x4c(0x01)
	char *9e48e7b9cf : 1; // 0x4c(0x01)
	char *eb86d6d948 : 1; // 0x4c(0x01)
	char *40d454dad4 : 1; // 0x4c(0x01)
	char *90211ea547 : 1; // 0x4c(0x01)
	char *f80a46dfc4 : 1; // 0x4d(0x01)
	char *895388f7c0 : 1; // 0x4d(0x01)
	char *8316a56514 : 1; // 0x4d(0x01)
	char pad_4D_3 : 5; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	struct TArray<struct FExpressionOutput> Outputs; // 0x50(0x10)
};

// Class Engine.*2f7623087a
// Size: 0x60 (Inherited: 0x60)
struct U*2f7623087a : UMaterialExpression {
};

// Class Engine.*f8e25a8f91
// Size: 0x60 (Inherited: 0x60)
struct U*f8e25a8f91 : UMaterialExpression {
};

// Class Engine.*528374bf77
// Size: 0x28 (Inherited: 0x28)
struct U*528374bf77 : UObject {

	void Activate(); // Function Engine.*528374bf77.Activate // Native|Public|BlueprintCallable // @ game+0x57d5490
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x3c0 (Inherited: 0x2b8)
struct UBlueprintGeneratedClass : UClass {
	int32 NumReplicatedProperties; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct TArray<struct U*f9ce876360*> *ba400071f6; // 0x2c0(0x10)
	struct TArray<struct UActorComponent*> *3cf3d68327; // 0x2d0(0x10)
	struct TArray<struct U*bd91982c84*> *196fc7dd02; // 0x2e0(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x2f0(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x2f8(0x08)
	struct UStructProperty* *1720bc2967; // 0x300(0x08)
	struct UFunction* *ebc54076cf; // 0x308(0x08)
	struct TArray<struct F*a3aa512dca> FastCallPairs; // 0x310(0x10)
	bool *b4339b2bed; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct TMap<struct FName, struct F*1489c052de> *8f11984777; // 0x328(0x50)
	bool *fafb82cdff; // 0x378(0x01)
	char pad_379[0x47]; // 0x379(0x47)
};

// Class Engine.CameraActor
// Size: 0x990 (Inherited: 0x3e8)
struct ACameraActor : AActor {
	enum class EAutoReceiveInput *0307a8293d; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct UCameraComponent* CameraComponent; // 0x3f0(0x08)
	struct USceneComponent* SceneComponent; // 0x3f8(0x08)
	char pad_400[0x8]; // 0x400(0x08)
	char bConstrainAspectRatio : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	float AspectRatio; // 0x40c(0x04)
	float FOVAngle; // 0x410(0x04)
	float PostProcessBlendWeight; // 0x414(0x04)
	char pad_418[0x8]; // 0x418(0x08)
	struct FPostProcessSettings PostProcessSettings; // 0x420(0x570)

	void *3333a6d15b(); // Function Engine.CameraActor.*3333a6d15b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de3bc
};

// Class Engine.UserDefinedStruct
// Size: 0x100 (Inherited: 0xf0)
struct UUserDefinedStruct : UScriptStruct {
	struct FGuid Guid; // 0xf0(0x10)
};

// Class Engine.AISystemBase
// Size: 0x48 (Inherited: 0x28)
struct UAISystemBase : UObject {
	struct FStringClassReference AISystemClassName; // 0x28(0x10)
	struct FName AISystemModuleName; // 0x38(0x08)
	bool bInstantiateAISystemOnClient; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Engine.*10128294dc
// Size: 0x48 (Inherited: 0x28)
struct U*10128294dc : UObject {
	struct TArray<struct F*6c9a74e1a9> Areas; // 0x28(0x10)
	struct F*0fdc6dd237 IncludeFlags; // 0x38(0x04)
	struct F*0fdc6dd237 ExcludeFlags; // 0x3c(0x04)
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Engine.*6080c6b78b
// Size: 0x38 (Inherited: 0x28)
struct U*6080c6b78b : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.Model
// Size: 0x560 (Inherited: 0x28)
struct UModel : UObject {
	char pad_28[0x538]; // 0x28(0x538)
};

// Class Engine.*99e10d1a78
// Size: 0x28 (Inherited: 0x28)
struct U*99e10d1a78 : UObject {
};

// Class Engine.*a31a367d3b
// Size: 0x28 (Inherited: 0x28)
struct U*a31a367d3b : UObject {
};

// Class Engine.EdGraphNode
// Size: 0xa0 (Inherited: 0x28)
struct UEdGraphNode : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38(0x10)
	int32 *453eb07774; // 0x48(0x04)
	int32 *e8a7c66564; // 0x4c(0x04)
	int32 *41bb7e52ed; // 0x50(0x04)
	int32 *8ee5020f45; // 0x54(0x04)
	char *2c238b1825 : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct FString NodeComment; // 0x60(0x10)
	bool *fd61023e55; // 0x70(0x01)
	bool *ae1d26f90d; // 0x71(0x01)
	bool *60f8cb15f4; // 0x72(0x01)
	char pad_73[0x1]; // 0x73(0x01)
	int32 *93a1fb6944; // 0x74(0x04)
	struct FString *df390b77be; // 0x78(0x10)
	struct FGuid NodeGuid; // 0x88(0x10)
	enum class ENodeAdvancedPins *0aa90830dc; // 0x98(0x01)
	enum class ENodeEnabledState *9b625cf000; // 0x99(0x01)
	bool *2e79c61b80; // 0x9a(0x01)
	bool bIsNodeEnabled; // 0x9b(0x01)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x140 (Inherited: 0x28)
struct UEdGraphPin_Deprecated : UObject {
	struct FString PinName; // 0x28(0x10)
	struct FString PinToolTip; // 0x38(0x10)
	enum class EEdGraphPinDirection Direction; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct F*dcaec3c3e2 PinType; // 0x50(0x80)
	struct FString DefaultValue; // 0xd0(0x10)
	struct FString *89bfb03fc3; // 0xe0(0x10)
	struct UObject* *a79607a05b; // 0xf0(0x08)
	struct FText *7bd11a9b4a; // 0xf8(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> *e9dc81a250; // 0x110(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> *1934011d8f; // 0x120(0x10)
	struct UEdGraphPin_Deprecated* *2ddfa7bea5; // 0x130(0x08)
	struct UEdGraphPin_Deprecated* *9a0ee59ff0; // 0x138(0x08)
};

// Class Engine.*40ddb9dd5e
// Size: 0x28 (Inherited: 0x28)
struct U*40ddb9dd5e : UInterface {
};

// Class Engine.Level
// Size: 0x330 (Inherited: 0x28)
struct ULevel : UObject {
	char pad_28[0x48]; // 0x28(0x48)
	struct TArray<struct FVector> *1b020b5803; // 0x70(0x10)
	char pad_80[0x8]; // 0x80(0x08)
	struct ANavigationObjectBase* *a3f1f8c9bf; // 0x88(0x08)
	struct UMapBuildDataRegistry* *65a9a6cf12; // 0x90(0x08)
	struct UModel* Model; // 0x98(0x08)
	struct ANavigationObjectBase* *f01e8b66cf; // 0xa0(0x08)
	float *3496d6af4a; // 0xa8(0x04)
	struct FGuid *75e39f3690; // 0xac(0x10)
	char pad_BC_0 : 2; // 0xbc(0x01)
	char *d629bf8c8b : 1; // 0xbc(0x01)
	char bIsVisible : 1; // 0xbc(0x01)
	char bLocked : 1; // 0xbc(0x01)
	char *d752c4753f : 1; // 0xbc(0x01)
	char pad_BC_6 : 2; // 0xbc(0x01)
	char pad_BD[0x93]; // 0xbd(0x93)
	struct ALevelScriptActor* LevelScriptActor; // 0x150(0x08)
	bool *863c6a3c52; // 0x158(0x01)
	char pad_159[0x3]; // 0x159(0x03)
	int32 *752abb6ca7; // 0x15c(0x04)
	int32 *8b1a426e8e; // 0x160(0x04)
	char pad_164[0x3c]; // 0x164(0x3c)
	struct FIntVector *bea6ba621d; // 0x1a0(0x0c)
	char pad_1AC[0xc]; // 0x1ac(0x0c)
	struct TArray<struct U*83352a2b89*> *7aa5102cd3; // 0x1b8(0x10)
	char pad_1C8[0x70]; // 0x1c8(0x70)
	struct TArray<struct U*e52d54c0e0*> *6eb75bf41b; // 0x238(0x10)
	char pad_248[0x18]; // 0x248(0x18)
	float *372f07566a; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct U*9a60b08820* ActorCluster; // 0x268(0x08)
	struct UWorld* *16f61c64e0; // 0x270(0x08)
	char pad_278[0x8]; // 0x278(0x08)
	struct TArray<struct FGuid> *e58b8f8bd9; // 0x280(0x10)
	char pad_290[0x70]; // 0x290(0x70)
	struct AWorldSettings* WorldSettings; // 0x300(0x08)
	char pad_308[0x8]; // 0x308(0x08)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x310(0x10)
	char pad_320[0x10]; // 0x320(0x10)
};

// Class Engine.*067b0e25b7
// Size: 0x28 (Inherited: 0x28)
struct U*067b0e25b7 : UInterface {
};

// Class Engine.AmbientSound
// Size: 0x3f0 (Inherited: 0x3e8)
struct AAmbientSound : AActor {
	struct UAudioComponent* AudioComponent; // 0x3e8(0x08)

	void AdjustVolume(float AdjustVolumeDuration); // Function Engine.AmbientSound.AdjustVolume // Final|Native|Public|BlueprintCallable // @ game+0x64d6b10
	float FadeOut(); // Function Engine.AmbientSound.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0x64dd214
	float *46088c3b7b(); // Function Engine.AmbientSound.*46088c3b7b // Final|Native|Public|BlueprintCallable // @ game+0x64dd124
	void Play(); // Function Engine.AmbientSound.Play // Final|Native|Public|BlueprintCallable // @ game+0x64eb538
	void Stop(); // Function Engine.AmbientSound.Stop // Final|Native|Public|BlueprintCallable // @ game+0x64f6cac
};

// Class Engine.AutoBenchSettings
// Size: 0x40 (Inherited: 0x28)
struct UAutoBenchSettings : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct F*cc01e78d73> Settings; // 0x30(0x10)
};

// Class Engine.AutoBenchControlActor
// Size: 0x3e8 (Inherited: 0x3e8)
struct AAutoBenchControlActor : AActor {
};

// Class Engine.*c03ab1e88c
// Size: 0x28 (Inherited: 0x28)
struct U*c03ab1e88c : UObject {
};

// Class Engine.*5351691cca
// Size: 0x28 (Inherited: 0x28)
struct U*5351691cca : UInterface {
};

// Class Engine.BillboardComponent
// Size: 0x9b0 (Inherited: 0x990)
struct UBillboardComponent : UPrimitiveComponent {
	struct UTexture2D* Sprite; // 0x988(0x08)
	char bIsScreenSizeScaled : 1; // 0x990(0x01)
	float ScreenSize; // 0x994(0x04)
	float U; // 0x998(0x04)
	float UL; // 0x99c(0x04)
	float V; // 0x9a0(0x04)
	float VL; // 0x9a4(0x04)
	struct FColor Color; // 0x9a8(0x04)

	int32 *b34a91956b(); // Function Engine.BillboardComponent.*b34a91956b // Native|Public|BlueprintCallable // @ game+0x64f5338
	void *5a310660a0(int32 NewUL); // Function Engine.BillboardComponent.*5a310660a0 // Native|Public|BlueprintCallable // @ game+0x64f59f8
	struct FColor SetColor(); // Function Engine.BillboardComponent.SetColor // Final|Native|Public|HasDefaults // @ game+0x64f1b40
	void *73296e1372(); // Function Engine.BillboardComponent.*73296e1372 // Native|Public|BlueprintCallable // @ game+0x64f52a4
};

// Class Engine.*1d5d887209
// Size: 0x28 (Inherited: 0x28)
struct U*1d5d887209 : UInterface {
};

// Class Engine.StaticMesh
// Size: 0x170 (Inherited: 0x28)
struct UStaticMesh : UObject {
	char pad_28[0x18]; // 0x28(0x18)
	int32 MinLOD; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct UMaterialInterface*> Materials; // 0x48(0x10)
	struct TArray<struct F*9b3c03c912> StaticMaterials; // 0x58(0x10)
	float *65706d282d; // 0x68(0x04)
	int32 LightMapResolution; // 0x6c(0x04)
	int32 *9ed26776d4; // 0x70(0x04)
	float *2927a40459; // 0x74(0x04)
	struct UBodySetup* BodySetup; // 0x78(0x08)
	int32 *3c7ddc148a; // 0x80(0x04)
	char *4c18bc5776 : 1; // 0x84(0x01)
	char *bdcbbf1dd0 : 1; // 0x84(0x01)
	char bStripComplexCollisionForConsole : 1; // 0x84(0x01)
	char *1c6acdad28 : 1; // 0x84(0x01)
	char bRequiresAreaWeightedSampling : 1; // 0x84(0x01)
	char pad_84_5 : 3; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	float LpvBiasMultiplier; // 0x88(0x04)
	bool *72b429015b; // 0x8c(0x01)
	char pad_8D[0x33]; // 0x8d(0x33)
	struct TArray<struct U*c90fb310e3*> Sockets; // 0xc0(0x10)
	char pad_D0[0x10]; // 0xd0(0x10)
	struct FVector *70f0883a57; // 0xe0(0x0c)
	struct FVector *a395dacd15; // 0xec(0x0c)
	struct FBoxSphereBounds *12c825a915; // 0xf8(0x1c)
	bool *3b56ad7171; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	int32 *46b6d7aa69; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x120(0x10)
	struct UNavCollision* NavCollision; // 0x130(0x08)
	struct F*9156f9f612 *9dbf5c9c9c; // 0x138(0x28)
	struct TArray<struct UMaterialInstanceConstant*> *7949b827cb; // 0x160(0x10)

	void *a8ad6da3c5(); // Function Engine.StaticMesh.*a8ad6da3c5 // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ded34
	void *3fdb8d2cbb(); // Function Engine.StaticMesh.*3fdb8d2cbb // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dee3c
	int32 *237c992952(); // Function Engine.StaticMesh.*237c992952 // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e24c4
	void *10b99163ef(); // Function Engine.StaticMesh.*10b99163ef // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2454
};

// Class Engine.*fd5ad6fe6e
// Size: 0x570 (Inherited: 0x460)
struct U*fd5ad6fe6e : USceneComponent {
	struct FVector Extents; // 0x458(0x0c)
	struct FVector FadeExtents_Neg; // 0x464(0x0c)
	struct FVector FadeExtents_Pos; // 0x470(0x0c)
	bool bOutdoorTransition; // 0x47c(0x01)
	float VolumeAlpha; // 0x480(0x04)
	float Brightness; // 0x484(0x04)
	float SkyIntensity; // 0x488(0x04)
	int32 Priority; // 0x48c(0x04)
	struct F*8f50c6ced6 AmbientCube2; // 0x490(0xc8)
	char pad_55D[0x13]; // 0x55d(0x13)

	void *b8587251c4(); // Function Engine.*fd5ad6fe6e.*b8587251c4 // Final|Native|Public // @ game+0xaa4b6c
};

// Class Engine.GIVolumesContainerComponent
// Size: 0x470 (Inherited: 0x460)
struct UGIVolumesContainerComponent : USceneComponent {
	char pad_460[0x10]; // 0x460(0x10)
};

// Class Engine.BoxGIVolume
// Size: 0x3f0 (Inherited: 0x3e8)
struct ABoxGIVolume : AActor {
	struct U*fd5ad6fe6e* VolumeComponent; // 0x3e8(0x08)
};

// Class Engine.BrushShape
// Size: 0x420 (Inherited: 0x420)
struct ABrushShape : ABrush {
};

// Class Engine.AudioVolume
// Size: 0x468 (Inherited: 0x420)
struct AAudioVolume : AVolume {
	float Priority; // 0x420(0x04)
	char bEnabled : 1; // 0x424(0x01)
	char pad_424_1 : 7; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	struct FReverbSettings Settings; // 0x428(0x18)
	struct F*391dcb41c3 AmbientZoneSettings; // 0x440(0x24)
	char pad_464[0x4]; // 0x464(0x04)

	void SetReverbSettings(); // Function Engine.AudioVolume.SetReverbSettings // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f514c
	void *ae23d1077e(); // Function Engine.AudioVolume.*ae23d1077e // Final|Native|Public|BlueprintCallable // @ game+0x64f253c
	void SetPriority(); // Function Engine.AudioVolume.SetPriority // Final|Native|Public|BlueprintCallable // @ game+0x64f4bd0
	void *402694ef73(); // Function Engine.AudioVolume.*402694ef73 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f3254
	void OnRep_bEnabled(); // Function Engine.AudioVolume.OnRep_bEnabled // Final|Native|Private // @ game+0x57b29c8
};

// Class Engine.BlockingVolume
// Size: 0x420 (Inherited: 0x420)
struct ABlockingVolume : AVolume {
};

// Class Engine.CameraBlockingVolume
// Size: 0x420 (Inherited: 0x420)
struct ACameraBlockingVolume : AVolume {
};

// Class Engine.CullDistanceVolume
// Size: 0x448 (Inherited: 0x420)
struct ACullDistanceVolume : AVolume {
	struct TArray<struct F*dcfd236c03> CullDistances; // 0x420(0x10)
	char bEnabled : 1; // 0x430(0x01)
	char pad_430_1 : 7; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	float CullDistanceForLODActor; // 0x434(0x04)
	float CullDistanceForLODActorTooFar; // 0x438(0x04)
	bool bUseActorBound; // 0x43c(0x01)
	char pad_43D[0x3]; // 0x43d(0x03)
	float IgnoreActorBoundSize; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class Engine.LevelStreamingVolume
// Size: 0x438 (Inherited: 0x420)
struct ALevelStreamingVolume : AVolume {
	struct TArray<struct FName> StreamingLevelNames; // 0x420(0x10)
	char bEditorPreVisOnly : 1; // 0x430(0x01)
	char bDisabled : 1; // 0x430(0x01)
	char pad_430_2 : 6; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	enum class *7d7353c297 StreamingUsage; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
};

// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x420 (Inherited: 0x420)
struct ALightmassCharacterIndirectDetailVolume : AVolume {
};

// Class Engine.LightmassImportanceVolume
// Size: 0x420 (Inherited: 0x420)
struct ALightmassImportanceVolume : AVolume {
};

// Class Engine.MeshMergeCullingVolume
// Size: 0x420 (Inherited: 0x420)
struct AMeshMergeCullingVolume : AVolume {
};

// Class Engine.NavMeshBoundsVolume
// Size: 0x428 (Inherited: 0x420)
struct ANavMeshBoundsVolume : AVolume {
	struct FNavAgentSelector SupportedAgents; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
};

// Class Engine.DefaultPhysicsVolume
// Size: 0x438 (Inherited: 0x438)
struct ADefaultPhysicsVolume : APhysicsVolume {
};

// Class Engine.KillZVolume
// Size: 0x438 (Inherited: 0x438)
struct AKillZVolume : APhysicsVolume {
};

// Class Engine.PainCausingVolume
// Size: 0x460 (Inherited: 0x438)
struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x438(0x01)
	char pad_438_1 : 7; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	float DamagePerSec; // 0x43c(0x04)
	struct UClass* DamageType; // 0x440(0x08)
	float PainInterval; // 0x448(0x04)
	char bEntryPain : 1; // 0x44c(0x01)
	char *d23089194a : 1; // 0x44c(0x01)
	char pad_44C_2 : 6; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	struct AController* *a06dab2416; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
};

// Class Engine.BlendableInterface
// Size: 0x28 (Inherited: 0x28)
struct UBlendableInterface : UInterface {
};

// Class Engine.Scene
// Size: 0x28 (Inherited: 0x28)
struct UScene : UObject {
};

// Class Engine.*92425e8a49
// Size: 0x28 (Inherited: 0x28)
struct U*92425e8a49 : UInterface {
};

// Class Engine.PostProcessVolume
// Size: 0x9b0 (Inherited: 0x420)
struct APostProcessVolume : AVolume {
	char pad_420[0x10]; // 0x420(0x10)
	struct FPostProcessSettings Settings; // 0x430(0x570)
	float Priority; // 0x9a0(0x04)
	float BlendRadius; // 0x9a4(0x04)
	float BlendWeight; // 0x9a8(0x04)
	char bEnabled : 1; // 0x9ac(0x01)
	char bUnbound : 1; // 0x9ac(0x01)
	char pad_9AC_2 : 6; // 0x9ac(0x01)
	char pad_9AD[0x3]; // 0x9ad(0x03)

	void *c9d474ee9d(); // Function Engine.PostProcessVolume.*c9d474ee9d // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x64f7848
	TScriptInterface<struct UBlendableInterface> *279e5ee7e9(); // Function Engine.PostProcessVolume.*279e5ee7e9 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x64d60f4
};

// Class Engine.PrecomputedVisibilityOverrideVolume
// Size: 0x450 (Inherited: 0x420)
struct APrecomputedVisibilityOverrideVolume : AVolume {
	struct TArray<struct AActor*> OverrideVisibleActors; // 0x420(0x10)
	struct TArray<struct AActor*> OverrideInvisibleActors; // 0x430(0x10)
	struct TArray<struct FName> OverrideInvisibleLevels; // 0x440(0x10)
};

// Class Engine.PrecomputedVisibilityVolume
// Size: 0x420 (Inherited: 0x420)
struct APrecomputedVisibilityVolume : AVolume {
};

// Class Engine.TriggerVolume
// Size: 0x420 (Inherited: 0x420)
struct ATriggerVolume : AVolume {
};

// Class Engine.*f914516f16
// Size: 0x28 (Inherited: 0x28)
struct U*f914516f16 : UInterface {
};

// Class Engine.CameraShake
// Size: 0x160 (Inherited: 0x28)
struct UCameraShake : UObject {
	char *b704adf1d7 : 1; // 0x28(0x01)
	char pad_28_1 : 7; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float *3494df5f25; // 0x2c(0x04)
	float *abaaa2b446; // 0x30(0x04)
	float *8fa9951745; // 0x34(0x04)
	struct F*2f8ce11fce *082d0a181c; // 0x38(0x24)
	struct F*1b91ec26de *5b7a8129a5; // 0x5c(0x24)
	struct F*e34584cb7c *2282ddc178; // 0x80(0x0c)
	float AnimPlayRate; // 0x8c(0x04)
	float *f2b647a17e; // 0x90(0x04)
	float *bc412c6d67; // 0x94(0x04)
	float *624c126bbe; // 0x98(0x04)
	float *7f3f2c4230; // 0x9c(0x04)
	struct UCameraAnim* Anim; // 0xa0(0x08)
	char bRandomAnimSegment : 1; // 0xa8(0x01)
	char pad_A8_1 : 7; // 0xa8(0x01)
	char pad_A9[0x17]; // 0xa9(0x17)
	struct APlayerCameraManager* CameraOwner; // 0xc0(0x08)
	char pad_C8[0x80]; // 0xc8(0x80)
	float ShakeScale; // 0x148(0x04)
	float OscillatorTimeRemaining; // 0x14c(0x04)
	struct U*6ec4247e64* AnimInst; // 0x150(0x08)
	char pad_158[0x8]; // 0x158(0x08)

	void ReceiveIsFinished(); // Function Engine.CameraShake.ReceiveIsFinished // Native|Event|Public|BlueprintEvent|Const // @ game+0xc82768
	void ReceivePlayShake(); // Function Engine.CameraShake.ReceivePlayShake // Event|Public|BlueprintEvent // @ game+0x32e590
	void ReceiveStopShake(); // Function Engine.CameraShake.ReceiveStopShake // Event|Public|BlueprintEvent // @ game+0x32e590
	void BlueprintUpdateCameraShake(float DeltaTime, struct F*5cde951495 POV); // Function Engine.CameraShake.BlueprintUpdateCameraShake // Event|Public|HasOutParms|BlueprintEvent // @ game+0x32e590
};

// Class Engine.*37a897c2a6
// Size: 0x280 (Inherited: 0x1f0)
struct U*37a897c2a6 : UActorComponent {
	char pad_1F0[0x70]; // 0x1f0(0x70)
	struct TArray<struct F*526a26a06d> *526a26a06d; // 0x260(0x10)
	char pad_270[0x10]; // 0x270(0x10)

	struct FKey *4e1e11b6f1(); // Function Engine.*37a897c2a6.*4e1e11b6f1 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64e46d0
	struct FKey *5c6989adde(); // Function Engine.*37a897c2a6.*5c6989adde // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64e46d0
	void OnInputOwnerEndPlayed(); // Function Engine.*37a897c2a6.OnInputOwnerEndPlayed // Final|Native|Private // @ game+0x64eade0
	void *fd267e57f5(); // Function Engine.*37a897c2a6.*fd267e57f5 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64df7e8
	struct FKey *d0cf4daf38(); // Function Engine.*37a897c2a6.*d0cf4daf38 // Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfad8
	float *e4664e535a(); // Function Engine.*37a897c2a6.*e4664e535a // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64df8f0
	void *8f23584155(float DeltaX); // Function Engine.*37a897c2a6.*8f23584155 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfa08
	struct FKey *3eafaa8a5c(); // Function Engine.*37a897c2a6.*3eafaa8a5c // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64e46d0
	struct FKey *444e3d14dd(); // Function Engine.*37a897c2a6.*444e3d14dd // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64df7e8
	void *45b87fdbeb(float LocationX); // Function Engine.*37a897c2a6.*45b87fdbeb // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3abc
};

// Class Engine.CurveFloat
// Size: 0xa8 (Inherited: 0x30)
struct UCurveFloat : UCurveBase {
	struct FRichCurve *aa79e9f954; // 0x30(0x70)
	bool *03e61e74a0; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)

	float *df1965b3ab(); // Function Engine.CurveFloat.*df1965b3ab // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfc64
	void *6e95764d2e(); // Function Engine.CurveFloat.*6e95764d2e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x9b3568
};

// Class Engine.DecalActor
// Size: 0x3f0 (Inherited: 0x3e8)
struct ADecalActor : AActor {
	struct UDecalComponent* Decal; // 0x3e8(0x08)

