// Class Engine.Actor
// Size: 0x3f0 (Inherited: 0x30)
struct AActor : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct USceneComponent* RootComponent; // 0x40(0x08)
	char pad_48_0 : 3; // 0x48(0x01)
	char *ee7fa09f2a : 1; // 0x48(0x01)
	char pad_48_4 : 4; // 0x48(0x01)
	char pad_49_0 : 1; // 0x49(0x01)
	char *1c1a603df8 : 1; // 0x49(0x01)
	char bReplicates : 1; // 0x49(0x01)
	char pad_49_3 : 5; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
	struct FName *9736d97f72; // 0x50(0x08)
	enum class ENetRole RemoteRole; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct AActor* Owner; // 0x60(0x08)
	struct FRepMovement ReplicatedMovement; // 0x68(0x34)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct F*e12fd4230c *71a4a5335d; // 0xa0(0x40)
	char pad_E0[0x8]; // 0xe0(0x08)
	struct APawn* Instigator; // 0xe8(0x08)
	float NetCullDistanceSquared; // 0xf0(0x04)
	float *87e93a3748; // 0xf4(0x04)
	float CustomTimeDilation; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FMulticastDelegate OnInputTouchEnter; // 0x100(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x110(0x10)
	int32 *bb4531cf18; // 0x120(0x04)
	char bAutoDestroyWhenFinished : 1; // 0x124(0x01)
	char bCanBeDamaged : 1; // 0x124(0x01)
	char *e5601844d6 : 1; // 0x124(0x01)
	char *f334832ed0 : 1; // 0x124(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x124(0x01)
	char *157511b45d : 1; // 0x124(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x124(0x01)
	char *13e484c425 : 1; // 0x124(0x01)
	char *6afb884530 : 1; // 0x125(0x01)
	char pad_125_1 : 7; // 0x125(0x01)
	char pad_126[0x2]; // 0x126(0x02)
	struct FMulticastDelegate OnInputTouchBegin; // 0x128(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x138(0x10)
	char *e88d5f0d04 : 1; // 0x148(0x01)
	char pad_148_1 : 4; // 0x148(0x01)
	char *fa37ec8795 : 1; // 0x148(0x01)
	char *546a2c1ba4 : 1; // 0x148(0x01)
	char *9c48e84b30 : 1; // 0x148(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x149(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x14a(0x01)
	char bHidden : 1; // 0x14b(0x01)
	char *203daa4969 : 1; // 0x14b(0x01)
	char *ef18b22ab3 : 1; // 0x14b(0x01)
	char bOnlyRelevantToOwner : 1; // 0x14b(0x01)
	char bAlwaysRelevant : 1; // 0x14b(0x01)
	char *8ba71f2430 : 1; // 0x14b(0x01)
	char *c488fcabdb : 1; // 0x14b(0x01)
	char *95a7dbac35 : 1; // 0x14b(0x01)
	char *d360431085 : 1; // 0x14c(0x01)
	char pad_14C_1 : 1; // 0x14c(0x01)
	char *0a42a36656 : 1; // 0x14c(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x14c(0x01)
	char *296d657336 : 1; // 0x14c(0x01)
	char pad_14C_5 : 1; // 0x14c(0x01)
	char *73eeec1e6d : 1; // 0x14c(0x01)
	char pad_14C_7 : 1; // 0x14c(0x01)
	char pad_14D[0x3]; // 0x14d(0x03)
	struct TArray<struct AMatineeActor*> *342408205b; // 0x150(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x160(0x01)
	char pad_161[0x7]; // 0x161(0x07)
	struct FMulticastDelegate OnBeginCursorOver; // 0x168(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x178(0x10)
	struct TArray<struct FName> Layers; // 0x188(0x10)
	float InitialLifeSpan; // 0x198(0x04)
	char pad_19C[0x54]; // 0x19c(0x54)
	struct UChildActorComponent* *02788983e3; // 0x1f0(0x08)
	char pad_1F8[0x4]; // 0x1f8(0x04)
	struct FGuid DestructibleId; // 0x1fc(0x10)
	bool bIsDestroyedVersion; // 0x20c(0x01)
	bool RemoveFromLevelLOD; // 0x20d(0x01)
	char pad_20E[0x2]; // 0x20e(0x02)
	struct F*0a81d45cd1 PrimaryActorTick; // 0x210(0x58)
	char pad_268[0x50]; // 0x268(0x50)
	struct FMulticastDelegate OnClicked; // 0x2b8(0x10)
	struct FMulticastDelegate OnTakePointDamage; // 0x2c8(0x10)
	int32 *72feb06886; // 0x2d8(0x04)
	char pad_2DC[0xc]; // 0x2dc(0x0c)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x2e8(0x10)
	float MinNetUpdateFrequency; // 0x2f8(0x04)
	enum class ENetRole Role; // 0x2fc(0x01)
	char pad_2FD[0x3]; // 0x2fd(0x03)
	struct U*37a897c2a6* *37a897c2a6; // 0x300(0x08)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x308(0x10)
	char pad_318[0x8]; // 0x318(0x08)
	struct FMulticastDelegate OnEndCursorOver; // 0x320(0x10)
	struct TArray<struct FName> Tags; // 0x330(0x10)
	struct FMulticastDelegate OnReleased; // 0x340(0x10)
	char pad_350[0x10]; // 0x350(0x10)
	struct FMulticastDelegate OnActorHit; // 0x360(0x10)
	struct TArray<struct AActor*> Children; // 0x370(0x10)
	float NetPriority; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct FMulticastDelegate OnInputTouchLeave; // 0x388(0x10)
	enum class EAutoReceiveInput *63eb2f6239; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	float NetUpdateFrequency; // 0x39c(0x04)
	uint64 *3b8b1d07eb; // 0x3a0(0x08)
	struct FMulticastDelegate OnDestroyed; // 0x3a8(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3b8(0x10)
	char pad_3C8[0x2]; // 0x3c8(0x02)
	enum class *3d79023269 InputConsumeOption; // 0x3ca(0x01)
	char pad_3CB[0x5]; // 0x3cb(0x05)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x3d0(0x10)
	struct AActor* ParentComponentActor; // 0x3e0(0x08)
	char pad_3E8[0x8]; // 0x3e8(0x08)

	bool HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xab852c
	struct APlayerController* DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x64d9e44
	struct UClass* GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0f44
	struct AActor* *714237daa5(); // Function Engine.Actor.*714237daa5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1334
	bool *c47d432c57(); // Function Engine.Actor.*c47d432c57 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc230
	float *fff52e4054(); // Function Engine.Actor.*fff52e4054 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2774
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void *b979e02c0b(); // Function Engine.Actor.*b979e02c0b // Native|Public|BlueprintCallable // @ game+0x64f5cec
	struct FVector *4018d0c632(); // Function Engine.Actor.*4018d0c632 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc364
	struct FName *ba856be1c7(); // Function Engine.Actor.*ba856be1c7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcbec
	struct FHitResult ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1dcd78
	bool K2_SetActorLocation(); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e70a8
	struct UActorComponent* *1584fc199d(); // Function Engine.Actor.*1584fc199d // Native|Public|BlueprintCallable // @ game+0x64d50a0
	enum class ENetRole *d0599f9969(); // Function Engine.Actor.*d0599f9969 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1b68
	bool *e5d0e7e401(); // Function Engine.Actor.*e5d0e7e401 // Final|Native|Public|BlueprintCallable // @ game+0x64edfd8
	struct FVector *0128a55b1c(); // Function Engine.Actor.*0128a55b1c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc64c
	struct APlayerController* K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct TArray<struct UActorComponent*> *47d2b9df79(); // Function Engine.Actor.*47d2b9df79 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddf48
	float *9b88d7e8d4(); // Function Engine.Actor.*9b88d7e8d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc60c
	float *7cd9bf7d62(); // Function Engine.Actor.*7cd9bf7d62 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df8e0
	void *2bb0c747eb(); // Function Engine.Actor.*2bb0c747eb // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x64dbe74
	bool K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xc7477c
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x64e606c
	bool K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4080
	bool K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4430
	bool K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e7874
	struct FVector *7d96186e34(); // Function Engine.Actor.*7d96186e34 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfff0
	float *91098873e6(); // Function Engine.Actor.*91098873e6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df9d4
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x1dcd78
	struct UActorComponent* *d59794b83e(); // Function Engine.Actor.*d59794b83e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddd60
	bool GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc088
	struct FKey ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct UActorComponent* *1271c83ac5(); // Function Engine.Actor.*1271c83ac5 // Native|Public|BlueprintCallable // @ game+0x64eae80
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xb90a0c
	bool K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e3aa4
	float *a681358bc4(); // Function Engine.Actor.*a681358bc4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de668
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xbfb6c8
	struct FVector *1374553f9f(); // Function Engine.Actor.*1374553f9f // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ee2d4
	struct AActor* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xb61fa4
	struct FVector *737d73e961(); // Function Engine.Actor.*737d73e961 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc484
	struct TArray<struct AActor*> *7a8a6dd052(); // Function Engine.Actor.*7a8a6dd052 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcc30
	bool *79d6ce8944(); // Function Engine.Actor.*79d6ce8944 // Final|Native|Public|BlueprintCallable // @ game+0x6630c0
	bool *106e09f070(); // Function Engine.Actor.*106e09f070 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e8ce0
	struct UChildActorComponent* *39323dc533(); // Function Engine.Actor.*39323dc533 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e13ec
	struct FVector *2c4afd0cc9(); // Function Engine.Actor.*2c4afd0cc9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc5d8
	struct AActor* *b759798186(); // Function Engine.Actor.*b759798186 // Native|Public|BlueprintCallable // @ game+0x5ea3d2c
	struct FRotator *c04bf37fb1(); // Function Engine.Actor.*c04bf37fb1 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc258
	bool *b559cd5bb6(); // Function Engine.Actor.*b559cd5bb6 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x64f38ac
	struct FVector *e7e17038d8(); // Function Engine.Actor.*e7e17038d8 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ee374
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e11a4
	enum class ETouchIndex ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool *e67787df0d(); // Function Engine.Actor.*e67787df0d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e35b8
	bool *55f16db019(); // Function Engine.Actor.*55f16db019 // Final|Native|Public|BlueprintCallable // @ game+0x64e22f4
	bool K2_AttachRootComponentTo(); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x64e55ac
	enum class ETickingGroup *cc2ec62328(); // Function Engine.Actor.*cc2ec62328 // Final|Native|Public|BlueprintCallable // @ game+0x64f3d7c
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb43878
	bool *29508a4bf2(); // Function Engine.Actor.*29508a4bf2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2dd8
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1dcd78
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e7aa0
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1dcd78
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d32e0
	struct USceneComponent* *2c9921815b(); // Function Engine.Actor.*2c9921815b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e69d8
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool *925fe8d3ea(); // Function Engine.Actor.*925fe8d3ea // Native|Public|BlueprintCallable // @ game+0x64f3814
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x1dcd78
	float *34262bebc8(); // Function Engine.Actor.*34262bebc8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2028
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e769c
	struct TArray<struct UActorComponent*> *765007f9fa(); // Function Engine.Actor.*765007f9fa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dde58
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x1dcd78
	float *a743e7718b(); // Function Engine.Actor.*a743e7718b // Native|Public|BlueprintCallable // @ game+0xc61af0
	bool K2_AddActorLocalTransform(); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e3e54
	bool *7650e89956(); // Function Engine.Actor.*7650e89956 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2dbc
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x73263c
	float *3e6eb6bf5c(); // Function Engine.Actor.*3e6eb6bf5c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x64de8b0
	bool SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x64ee070
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x572931c
	struct AActor* *c92feec516(); // Function Engine.Actor.*c92feec516 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e13c8
	struct FVector *4a0e7bcfa3(); // Function Engine.Actor.*4a0e7bcfa3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc4b8
	float *a6118fe2c0(); // Function Engine.Actor.*a6118fe2c0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df3a4
	struct UActorComponent* AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xb5041c
	struct FVector *486c8ab3b8(); // Function Engine.Actor.*486c8ab3b8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6544
	bool *4f65c06a84(); // Function Engine.Actor.*4f65c06a84 // Final|Native|Public|BlueprintCallable // @ game+0x64f3e94
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct AController* *4b8ae6f2a5(); // Function Engine.Actor.*4b8ae6f2a5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0210
	struct UActorComponent* *54a0becbfe(); // Function Engine.Actor.*54a0becbfe // Final|Native|Public|BlueprintCallable // @ game+0x64e6084
	struct UMaterialInstanceDynamic* *1aee2325a9(); // Function Engine.Actor.*1aee2325a9 // Final|Native|Public|BlueprintCallable // @ game+0x64e9318
	bool *908e613f2a(); // Function Engine.Actor.*908e613f2a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64f63b4
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e728c
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x64dbe88
	float *61de3812ee(); // Function Engine.Actor.*61de3812ee // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc624
	float *e9a85fdb39(); // Function Engine.Actor.*e9a85fdb39 // Final|Native|Public|BlueprintCallable // @ game+0x64ee4a8
	struct AActor* ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct APawn* *2ba131945a(); // Function Engine.Actor.*2ba131945a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e01f8
	struct FName *586623e9e7(); // Function Engine.Actor.*586623e9e7 // Final|Native|Public|BlueprintCallable // @ game+0x64f4fe4
	float *bd080aece3(); // Function Engine.Actor.*bd080aece3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de708
	bool K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4258
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e273c
	bool K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x64e572c
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6608
	enum class ETouchIndex ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x1dcd78
	float *53ba01cd9c(); // Function Engine.Actor.*53ba01cd9c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df304
	float ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e74c4
	bool *3989b8b937(); // Function Engine.Actor.*3989b8b937 // Final|Native|Public|BlueprintCallable // @ game+0x64e5a2c
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x64ee414
	struct APlayerController* *7148b110dc(); // Function Engine.Actor.*7148b110dc // Native|Public|BlueprintCallable // @ game+0x64db8ec
	bool K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e3c7c
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x5864a4
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0x579e6c
	bool DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x64d9db0
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x64d4f78
	struct AActor* *81b4039d6c(); // Function Engine.Actor.*81b4039d6c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcbc8
	float *39298590ca(); // Function Engine.Actor.*39298590ca // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e02c0
	enum class *90c9408cc7 *0f5dc47999(); // Function Engine.Actor.*0f5dc47999 // Final|Native|Public|BlueprintCallable // @ game+0x64e61d4
	bool *9b7475c7cd(); // Function Engine.Actor.*9b7475c7cd // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dc9f4
	bool *b895bffb9a(); // Function Engine.Actor.*b895bffb9a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2e70
	struct FName MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e9394
};

// Class Engine.AnimInstance
// Size: 0x3a8 (Inherited: 0x30)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct USkeleton* *00f1a04d93; // 0x38(0x08)
	enum class *bad4eeba2c *64d499977d; // 0x40(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x41(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x42(0x01)
	bool *19654fcffc; // 0x43(0x01)
	bool bWarnAboutBlueprintUsage; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x48(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x58(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x68(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x78(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x88(0x10)
	char pad_98[0x60]; // 0x98(0x60)
	bool *b2f6e14773; // 0xf8(0x01)
	char pad_F9[0x9f]; // 0xf9(0x9f)
	struct TArray<struct FAnimNotifyEvent> *d4944da090; // 0x198(0x10)
	char pad_1A8[0x200]; // 0x1a8(0x200)

	float GetStateWeight(); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651c14c
	struct FName *8b2dbddc42(); // Function Engine.AnimInstance.*8b2dbddc42 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652c3b4
	float GetAnimAssetPlayerTimeFromEnd(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6513150
	float *b00a4c6977(); // Function Engine.AnimInstance.*b00a4c6977 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5c6254
	float *1b44e35344(); // Function Engine.AnimInstance.*1b44e35344 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651a574
	struct UAnimMontage* *1e685b1c44(); // Function Engine.AnimInstance.*1e685b1c44 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6514800
	float *576eca5fe6(); // Function Engine.AnimInstance.*576eca5fe6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x9d4b24
	struct UAnimMontage* *fc5123822e(); // Function Engine.AnimInstance.*fc5123822e // Native|Public|BlueprintCallable // @ game+0x5c60d0
	bool *a508d5065e(); // Function Engine.AnimInstance.*a508d5065e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6527e78
	float *0afc1c441a(); // Function Engine.AnimInstance.*0afc1c441a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6517774
	bool *d975dc291b(); // Function Engine.AnimInstance.*d975dc291b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc56d2c
	float *642b0d689d(); // Function Engine.AnimInstance.*642b0d689d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6516fac
	bool *55851ebd85(); // Function Engine.AnimInstance.*55851ebd85 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6522604
	float BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x1dcd78
	float Montage_Play(); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x60d93c
	struct UAnimMontage* *09b1e8fd25(); // Function Engine.AnimInstance.*09b1e8fd25 // Final|Native|Public|BlueprintCallable // @ game+0x652c6d0
	float GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6514be8
	float *d20b45d812(); // Function Engine.AnimInstance.*d20b45d812 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652c314
	bool *a5725955ed(); // Function Engine.AnimInstance.*a5725955ed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652207c
	struct AActor* *21224e4f15(); // Function Engine.AnimInstance.*21224e4f15 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbe8d88
	float GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6512fdc
	float *2fd908ba89(); // Function Engine.AnimInstance.*2fd908ba89 // Final|Native|Public|BlueprintCallable // @ game+0x6540218
	float *4625570d97(); // Function Engine.AnimInstance.*4625570d97 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651a864
	struct FPoseSnapshot *39e1d97951(); // Function Engine.AnimInstance.*39e1d97951 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x65480d0
	float *7b42284f1f(); // Function Engine.AnimInstance.*7b42284f1f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6504858
	float *4aa8d6f78e(); // Function Engine.AnimInstance.*4aa8d6f78e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x9d46a8
	float *ddf1ff6163(); // Function Engine.AnimInstance.*ddf1ff6163 // Final|Native|Public|BlueprintCallable // @ game+0x652c8cc
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x65305e0
	bool *e145e83604(); // Function Engine.AnimInstance.*e145e83604 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652c450
	float *17d24ff813(); // Function Engine.AnimInstance.*17d24ff813 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x9d4880
	float *ede2013dc0(); // Function Engine.AnimInstance.*ede2013dc0 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651797c
	enum class *bad4eeba2c *67800d693e(); // Function Engine.AnimInstance.*67800d693e // Final|Native|Public|BlueprintCallable // @ game+0x6542034
	float *56658b7153(); // Function Engine.AnimInstance.*56658b7153 // Final|Native|Public|BlueprintCallable // @ game+0x652c9ac
	float PlaySlotAnimation(); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x65303bc
	float *0979216d6d(); // Function Engine.AnimInstance.*0979216d6d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6517b7c
	struct FName *0af7b6e222(); // Function Engine.AnimInstance.*0af7b6e222 // Final|Native|Public|BlueprintCallable // @ game+0x654d090
	struct UAnimMontage* *0da90049a4(); // Function Engine.AnimInstance.*0da90049a4 // Native|Public|BlueprintCallable // @ game+0x823668
	bool *d40af44efc(); // Function Engine.AnimInstance.*d40af44efc // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651ccdc
	float *5f792f1e89(); // Function Engine.AnimInstance.*5f792f1e89 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652c590
	struct FName *0f4214a44c(); // Function Engine.AnimInstance.*0f4214a44c // Native|Public|BlueprintCallable // @ game+0x6535464
	float GetAnimAssetPlayerTimeFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6513070
	float *a3d96e72ea(); // Function Engine.AnimInstance.*a3d96e72ea // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x651a77c
	struct UAnimMontage* *507b3ae08c(); // Function Engine.AnimInstance.*507b3ae08c // Final|Native|Public|BlueprintCallable // @ game+0x652c83c
	struct USkeletalMeshComponent* *d1802716c0(); // Function Engine.AnimInstance.*d1802716c0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651968c
	bool *427acd4368(); // Function Engine.AnimInstance.*427acd4368 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6520010
	float *8d25a2b336(); // Function Engine.AnimInstance.*8d25a2b336 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6516dc4
	float GetAnimAssetPlayerTimeFromEndFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6513254
	float *97675e998b(); // Function Engine.AnimInstance.*97675e998b // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6516c0c
	struct FName *74e6c97aea(); // Function Engine.AnimInstance.*74e6c97aea // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6514c88
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void *7f10900457(); // Function Engine.AnimInstance.*7f10900457 // Final|Native|Public|BlueprintCallable // @ game+0x6507b00
	struct UAnimMontage* *f24a483c94(); // Function Engine.AnimInstance.*f24a483c94 // Final|Native|Public|BlueprintCallable // @ game+0x652c7ac
	float *aacf4df222(); // Function Engine.AnimInstance.*aacf4df222 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652c4f0
	float *ffaf42859e(); // Function Engine.AnimInstance.*ffaf42859e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6516a40
	bool *7bf1dbb0b1(); // Function Engine.AnimInstance.*7bf1dbb0b1 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6527e78
	struct APawn* *47f249075c(); // Function Engine.AnimInstance.*47f249075c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x654edd8
	struct UAnimMontage* *e8c2c21ba8(); // Function Engine.AnimInstance.*e8c2c21ba8 // Native|Public|BlueprintCallable // @ game+0x57e79dc
	float *445a0d40ab(); // Function Engine.AnimInstance.*445a0d40ab // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6517294
	bool *aa1433683b(); // Function Engine.AnimInstance.*aa1433683b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652c630
	struct F*38341cf260 *5c70e4f6eb(); // Function Engine.AnimInstance.*5c70e4f6eb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651c62c
	float *7a139bbc29(); // Function Engine.AnimInstance.*7a139bbc29 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x412ba8
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x1dcd78
	float *925ceab1f2(); // Function Engine.AnimInstance.*925ceab1f2 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6516874
	bool *12bd0b8eee(); // Function Engine.AnimInstance.*12bd0b8eee // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6521938
};

// Class Engine.ActorComponent
// Size: 0x200 (Inherited: 0x30)
struct UActorComponent : UObject {
	char pad_30[0xf0]; // 0x30(0xf0)
	struct F*4325a9ec93 PrimaryComponentTick; // 0x120(0x58)
	struct TArray<struct FName> ComponentTags; // 0x178(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x188(0x10)
	char pad_198_0 : 3; // 0x198(0x01)
	char bReplicates : 1; // 0x198(0x01)
	char bNetAddressable : 1; // 0x198(0x01)
	char *e1ab54f0d0 : 1; // 0x198(0x01)
	char pad_198_6 : 2; // 0x198(0x01)
	char pad_199[0x1]; // 0x199(0x01)
	char pad_19A_0 : 2; // 0x19a(0x01)
	char bCreatedByConstructionScript : 1; // 0x19a(0x01)
	char bInstanceComponent : 1; // 0x19a(0x01)
	char bAutoActivate : 1; // 0x19a(0x01)
	char *bdff81749e : 1; // 0x19a(0x01)
	char *9049ba6b33 : 1; // 0x19a(0x01)
	char pad_19A_7 : 1; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	struct FGuid DestructibleId; // 0x19c(0x10)
	bool bIsDestroyedVersion; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	char *74755571f4 : 1; // 0x1b0(0x01)
	char pad_1B0_1 : 2; // 0x1b0(0x01)
	char bIsEditorOnly : 1; // 0x1b0(0x01)
	char pad_1B0_4 : 4; // 0x1b0(0x01)
	char pad_1B1[0x4]; // 0x1b1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1b5(0x01)
	enum class EPendingCreationType *c62b495b2d; // 0x1b6(0x01)
	char pad_1B7[0x9]; // 0x1b7(0x09)
	struct TArray<struct FSimpleMemberReference> *7a3c8367fe; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1d0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1e0(0x10)
	char pad_1F0[0x9]; // 0x1f0(0x09)
	char *1c1a603df8 : 1; // 0x1f9(0x01)
	char pad_1F9_1 : 7; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)

	bool *576122409c(); // Function Engine.ActorComponent.*576122409c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d8e2c
	bool IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2d94
	bool Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xcb3f50
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x1dcd78
	float *2b6de5a619(); // Function Engine.ActorComponent.*2b6de5a619 // Final|Native|Public|BlueprintCallable // @ game+0x64f0728
	bool *33759e78a8(); // Function Engine.ActorComponent.*33759e78a8 // Final|Native|Public|BlueprintCallable // @ game+0x64f1cc4
	void *4c6494a5d4(); // Function Engine.ActorComponent.*4c6494a5d4 // Native|Public|BlueprintCallable // @ game+0x5f883dc
	float *00bf4cdabe(); // Function Engine.ActorComponent.*00bf4cdabe // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dde08
	struct AActor* *714237daa5(); // Function Engine.ActorComponent.*714237daa5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb9046c
	bool *c791c9d07e(); // Function Engine.ActorComponent.*c791c9d07e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2e54
	float ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1dcd78
	enum class ETickingGroup *cc2ec62328(); // Function Engine.ActorComponent.*cc2ec62328 // Final|Native|Public|BlueprintCallable // @ game+0x64f3e08
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0x8bf26c
	bool *e1b93fda8a(); // Function Engine.ActorComponent.*e1b93fda8a // Native|Public|BlueprintCallable // @ game+0x64edee4
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct UObject* *54a0becbfe(); // Function Engine.ActorComponent.*54a0becbfe // Final|Native|Public|BlueprintCallable // @ game+0x64e611c
	bool *4f65c06a84(); // Function Engine.ActorComponent.*4f65c06a84 // Final|Native|Public|BlueprintCallable // @ game+0x64f3f2c
	struct AActor* *b759798186(); // Function Engine.ActorComponent.*b759798186 // Native|Public|BlueprintCallable // @ game+0x64eadec
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x64e98f4
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x64d500c
	bool *61043d392b(); // Function Engine.ActorComponent.*61043d392b // Native|Public|BlueprintCallable // @ game+0x64eeadc
	bool *e2e0972c8e(); // Function Engine.ActorComponent.*e2e0972c8e // Native|Public|BlueprintCallable // @ game+0x64f0690
	struct UActorComponent* *1271c83ac5(); // Function Engine.ActorComponent.*1271c83ac5 // Native|Public|BlueprintCallable // @ game+0x64eaf14
	bool *f755d02be8(); // Function Engine.ActorComponent.*f755d02be8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2f74
	struct UActorComponent* *1584fc199d(); // Function Engine.ActorComponent.*1584fc199d // Native|Public|BlueprintCallable // @ game+0x64d5134
};

// Class Engine.Pawn
// Size: 0x450 (Inherited: 0x3f0)
struct APawn : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	char bUseControllerRotationPitch : 1; // 0x3f8(0x01)
	char bUseControllerRotationYaw : 1; // 0x3f8(0x01)
	char bUseControllerRotationRoll : 1; // 0x3f8(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x3f8(0x01)
	char pad_3F8_4 : 4; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	float BaseEyeHeight; // 0x3fc(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x400(0x01)
	enum class EAutoPossessAI *80f545fe29; // 0x401(0x01)
	char pad_402[0x6]; // 0x402(0x06)
	struct UClass* AIControllerClass; // 0x408(0x08)
	struct APlayerState* PlayerState; // 0x410(0x08)
	uint16 *1fbcce05c7; // 0x418(0x02)
	char pad_41A[0x6]; // 0x41a(0x06)
	struct AController* Controller; // 0x420(0x08)
	struct AController* *771ed191dc; // 0x428(0x08)
	char pad_430[0x4]; // 0x430(0x04)
	struct FVector *7e7ad45e69; // 0x434(0x0c)
	struct FVector *3b712bd90f; // 0x440(0x0c)
	char pad_44C[0x4]; // 0x44c(0x04)

	struct AActor* *9f69700260(); // Function Engine.Pawn.*9f69700260 // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e9b68
	bool *d8774202a5(); // Function Engine.Pawn.*d8774202a5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57a6744
	struct AController* GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de0f4
	struct FVector *710294f579(); // Function Engine.Pawn.*710294f579 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d9244
	float AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x64d3568
	bool *abdc1da901(); // Function Engine.Pawn.*abdc1da901 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc157e4
	struct FVector *98a6e6af0b(); // Function Engine.Pawn.*98a6e6af0b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e16ac
	bool *b6c21f1d01(); // Function Engine.Pawn.*b6c21f1d01 // Final|Native|Public|BlueprintCallable // @ game+0x64efb6c
	bool *ae94aa4833(); // Function Engine.Pawn.*ae94aa4833 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e8f38
	float AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x64d3604
	struct FVector K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e16ac
	struct UPawnMovementComponent* *5062f1e06a(); // Function Engine.Pawn.*5062f1e06a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5774aa4
	struct AController* ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void *85f4ccf8cf(); // Function Engine.Pawn.*85f4ccf8cf // Native|Public|BlueprintCallable // @ game+0x5770330
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de0c0
	bool *bd818f4eae(); // Function Engine.Pawn.*bd818f4eae // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d4794
	float AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x64d36a0
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0xd578a4
	struct AActor* *b6654ecead(); // Function Engine.Pawn.*b6654ecead // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x64e0a1c
	bool *05c9ee399f(); // Function Engine.Pawn.*05c9ee399f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3540
	bool *5b6826bae8(); // Function Engine.Pawn.*5b6826bae8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2fa0
	struct FRotator *01e8ed425d(); // Function Engine.Pawn.*01e8ed425d // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcd18
	void *f994a202e6(); // Function Engine.Pawn.*f994a202e6 // Native|Public|BlueprintCallable // @ game+0x64f51c8
	struct AController* ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct FVector *7446c37470(); // Function Engine.Pawn.*7446c37470 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0b54
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0x8a611c
	struct FVector *cf0a44c8b8(); // Function Engine.Pawn.*cf0a44c8b8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0298
};

// Class Engine.DataAsset
// Size: 0x38 (Inherited: 0x30)
struct UDataAsset : UObject {
	struct UClass* *a8f9540798; // 0x30(0x08)
};

// Class Engine.SceneComponent
// Size: 0x480 (Inherited: 0x200)
struct USceneComponent : UActorComponent {
	enum class EComponentMobility Mobility; // 0x200(0x01)
	char pad_201[0x3]; // 0x201(0x03)
	struct FVector *47e17f1cb8; // 0x204(0x0c)
	SetProperty *5e68ef062e; // 0x210(0x50)
	enum class *40da61f0d8 DetailMode; // 0x260(0x01)
	char pad_261[0x3]; // 0x261(0x03)
	char pad_264_0 : 1; // 0x264(0x01)
	char bReplicatesAttachmentReference : 1; // 0x264(0x01)
	char bReplicatesAttachment : 1; // 0x264(0x01)
	char *398fd0c0d1 : 1; // 0x264(0x01)
	char pad_264_4 : 1; // 0x264(0x01)
	char bAbsoluteLocation : 1; // 0x264(0x01)
	char bAbsoluteRotation : 1; // 0x264(0x01)
	char bAbsoluteScale : 1; // 0x264(0x01)
	char bVisible : 1; // 0x265(0x01)
	char bHiddenInGame : 1; // 0x265(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x265(0x01)
	char *e8ec283885 : 1; // 0x265(0x01)
	char bUseAttachParentBound : 1; // 0x265(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x265(0x01)
	char pad_265_6 : 2; // 0x265(0x01)
	char pad_266_0 : 3; // 0x266(0x01)
	char bAbsoluteTranslation : 1; // 0x266(0x01)
	char pad_266_4 : 4; // 0x266(0x01)
	char pad_267[0x1]; // 0x267(0x01)
	struct APhysicsVolume* PhysicsVolume; // 0x268(0x08)
	struct FName *d0cdbdd0fa; // 0x270(0x08)
	char pad_278[0x68]; // 0x278(0x68)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x2e0(0x10)
	struct FRotator RelativeRotation; // 0x2f0(0x0c)
	char pad_2FC[0x50]; // 0x2fc(0x50)
	struct FVector RelativeScale3D; // 0x34c(0x0c)
	struct USceneComponent* AttachParent; // 0x358(0x08)
	char pad_360[0x8]; // 0x360(0x08)
	struct FVector RelativeLocation; // 0x368(0x0c)
	char pad_374[0xc]; // 0x374(0x0c)
	struct FVector RelativeTranslation; // 0x380(0x0c)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x390(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x3a0(0x10)
	char pad_3B0[0xd0]; // 0x3b0(0xd0)

	bool IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e398c
	bool K2_AddWorldRotation(); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e51a8
	struct TArray<struct USceneComponent*> *0c74739254(); // Function Engine.SceneComponent.*0c74739254 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e159c
	bool *7ec7e6d06d(); // Function Engine.SceneComponent.*7ec7e6d06d // Final|Native|Public|BlueprintCallable // @ game+0xb6b5f0
	bool DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x64d9cbc
	struct FVector *5517b00eba(); // Function Engine.SceneComponent.*5517b00eba // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de80c
	bool K2_AttachTo(); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x64e58ac
	bool K2_AddLocalTransform(); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4a0c
	struct APhysicsVolume* *e36ab2b188(); // Function Engine.SceneComponent.*e36ab2b188 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1908
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xb10810
	bool *2c76227353(); // Function Engine.SceneComponent.*2c76227353 // Final|Native|Public|BlueprintCallable // @ game+0x64edda0
	void *e177c790ac(); // Function Engine.SceneComponent.*e177c790ac // Final|Native|Public|BlueprintCallable // @ game+0x64eafd8
	struct USceneComponent* *1ff5be215f(); // Function Engine.SceneComponent.*1ff5be215f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd900
	bool K2_SetRelativeRotation(); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e80d0
	bool K2_AddRelativeRotation(); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4e04
	struct FVector *2107af1f45(); // Function Engine.SceneComponent.*2107af1f45 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1b7c
	struct FVector *0c17c4ef20(); // Function Engine.SceneComponent.*0c17c4ef20 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e256c
	struct FName *02150347c8(); // Function Engine.SceneComponent.*02150347c8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcc18
	struct FVector *2529aa9c4b(); // Function Engine.SceneComponent.*2529aa9c4b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1cd8
	bool K2_SetWorldRotation(); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e88dc
	struct FVector *e734bbfdd1(); // Function Engine.SceneComponent.*e734bbfdd1 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dde20
	bool *7b31d151fc(); // Function Engine.SceneComponent.*7b31d151fc // Final|Native|Public|BlueprintCallable // @ game+0x64f1b8c
	struct FVector *21797244da(); // Function Engine.SceneComponent.*21797244da // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xca8e64
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xb4b8e8
	bool K2_AddLocalOffset(); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e465c
	bool *c2d343c5f6(); // Function Engine.SceneComponent.*c2d343c5f6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d9ef0
	bool K2_SetWorldTransform(); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e8ab4
	struct TArray<struct USceneComponent*> *841542b838(); // Function Engine.SceneComponent.*841542b838 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd9a0
	struct FTransform *32022b8b54(); // Function Engine.SceneComponent.*32022b8b54 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1ef8
	bool K2_SetWorldLocation(); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e84d4
	bool K2_SetRelativeLocation(); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e7cd4
	bool *4ae5e515bf(); // Function Engine.SceneComponent.*4ae5e515bf // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5802ad4
	bool *79d6ce8944(); // Function Engine.SceneComponent.*79d6ce8944 // Final|Native|Public|BlueprintCallable // @ game+0x64e5c4c
	bool *3821db7cba(); // Function Engine.SceneComponent.*3821db7cba // Final|Native|Public|BlueprintCallable // @ game+0x64f18b4
	bool *2d79511c8a(); // Function Engine.SceneComponent.*2d79511c8a // Final|Native|Public|BlueprintCallable // @ game+0x64f50c0
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xb9b7b0
	struct TArray<struct FName> *0ac31b13a0(); // Function Engine.SceneComponent.*0ac31b13a0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcb10
	struct FTransform *05ac12a2ed(); // Function Engine.SceneComponent.*05ac12a2ed // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1b10
	struct FQuat *ec6cc6480a(); // Function Engine.SceneComponent.*ec6cc6480a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1d90
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xb4b8e8
	bool K2_AddWorldOffset(); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4fd0
	struct FRotator *7f1c545765(); // Function Engine.SceneComponent.*7f1c545765 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e670c
	struct USceneComponent* *0f883d6ef4(); // Function Engine.SceneComponent.*0f883d6ef4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc38c14
	bool OnRep_Visibility(); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x64e9a00
	bool *54b40a2d71(); // Function Engine.SceneComponent.*54b40a2d71 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e86ac
	bool *dfe7f29b70(); // Function Engine.SceneComponent.*dfe7f29b70 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2e2c
	struct FRotator *b97017c5f1(); // Function Engine.SceneComponent.*b97017c5f1 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1e40
	struct FVector *8e756cd690(); // Function Engine.SceneComponent.*8e756cd690 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f3590
	struct FVector *005bf0b0a1(); // Function Engine.SceneComponent.*005bf0b0a1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6790
	bool K2_SetRelativeTransform(); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e82a8
	int32 *3248871ca9(); // Function Engine.SceneComponent.*3248871ca9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0d60
	bool K2_AddWorldTransform(); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e5380
	bool *4047176641(); // Function Engine.SceneComponent.*4047176641 // Final|Native|Public|BlueprintCallable // @ game+0x64f1c28
	bool K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4834
	bool ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x64f5e50
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e67d4
	struct FVector *400454d1c2(); // Function Engine.SceneComponent.*400454d1c2 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f4cb4
	bool K2_AddRelativeLocation(); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e4c38
	bool SetVisibility(); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xc45604
	bool *77558c73a3(); // Function Engine.SceneComponent.*77558c73a3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e7ea0
};

// Class Engine.PrimitiveComponent
// Size: 0x9b0 (Inherited: 0x480)
struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x480(0x04)
	float LDMaxDrawDistance; // 0x484(0x04)
	float CachedMaxDrawDistance; // 0x488(0x04)
	enum class *b2d3e352d1 *763e39a9cb; // 0x48c(0x01)
	enum class *b2d3e352d1 *9497012a6e; // 0x48d(0x01)
	char pad_48E[0x2]; // 0x48e(0x02)
	char pad_490_0 : 3; // 0x490(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x490(0x01)
	char bGenerateOverlapEvents : 1; // 0x490(0x01)
	char bMultiBodyOverlap : 1; // 0x490(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x490(0x01)
	char bTraceComplexOnMove : 1; // 0x490(0x01)
	char bDisableForceFromCharacter : 1; // 0x491(0x01)
	char bReturnMaterialOnMove : 1; // 0x491(0x01)
	char *3515772747 : 1; // 0x491(0x01)
	char bAllowCullDistanceVolume : 1; // 0x491(0x01)
	char bImportantMesh : 1; // 0x491(0x01)
	char bOverrideCullingDistances : 1; // 0x491(0x01)
	char pad_491_6 : 2; // 0x491(0x01)
	char pad_492[0x2]; // 0x492(0x02)
	float HLODScreenSize; // 0x494(0x04)
	char *fa107373d7 : 1; // 0x498(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x498(0x01)
	char bRenderInMainPass : 1; // 0x498(0x01)
	char bRenderInMono : 1; // 0x498(0x01)
	char bOwnerNoSee : 1; // 0x498(0x01)
	char bOnlyOwnerSee : 1; // 0x498(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x498(0x01)
	char bUseAsOccluder : 1; // 0x498(0x01)
	char bForceAsOccluder : 1; // 0x499(0x01)
	char bForceOcclusionQuerying : 1; // 0x499(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x499(0x01)
	char *4826fc9fad : 1; // 0x499(0x01)
	char bForceMipStreaming : 1; // 0x499(0x01)
	char *cca2f750f4 : 1; // 0x499(0x01)
	char pad_499_6 : 1; // 0x499(0x01)
	char CastShadow : 1; // 0x499(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x49a(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x49a(0x01)
	char bCastDynamicShadow : 1; // 0x49a(0x01)
	char bCastStaticShadow : 1; // 0x49a(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x49a(0x01)
	char bSelfShadowOnly : 1; // 0x49a(0x01)
	char bCastFarShadow : 1; // 0x49a(0x01)
	char bCastInsetShadow : 1; // 0x49a(0x01)
	char bCastCinematicShadow : 1; // 0x49b(0x01)
	char bCastHiddenShadow : 1; // 0x49b(0x01)
	char bCastShadowAsTwoSided : 1; // 0x49b(0x01)
	char bLightAsIfStatic : 1; // 0x49b(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x49b(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x49b(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x49b(0x01)
	char bIgnoreRadialImpulse : 1; // 0x49b(0x01)
	char bIgnoreRadialForce : 1; // 0x49c(0x01)
	char bApplyImpulseOnDamage : 1; // 0x49c(0x01)
	char bSyncBodySleep : 1; // 0x49c(0x01)
	char *fefaebb36c : 1; // 0x49c(0x01)
	char *7ccce4ff36 : 1; // 0x49c(0x01)
	char *92a6fd4e7c : 1; // 0x49c(0x01)
	char bRenderCustomDepth : 1; // 0x49c(0x01)
	char pad_49C_7 : 1; // 0x49c(0x01)
	char pad_49D_0 : 7; // 0x49d(0x01)
	char *d927c19d75 : 1; // 0x49d(0x01)
	char *bd65329126 : 1; // 0x49e(0x01)
	char *775983f410 : 1; // 0x49e(0x01)
	char pad_49E_2 : 6; // 0x49e(0x01)
	char pad_49F[0x1]; // 0x49f(0x01)
	enum class EDecalChannel DecalChannel; // 0x4a0(0x01)
	enum class *f1e85ae637 IndoorOutdoorMask; // 0x4a1(0x01)
	struct FLightingChannels LightingChannels; // 0x4a2(0x03)
	enum class *5b12535706 IndirectLightingCacheQuality; // 0x4a5(0x01)
	bool CustomDepthStencilValue; // 0x4a6(0x01)
	enum class *5081dde572 CustomDepthStencilWriteMask; // 0x4a7(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x4a8(0x10)
	int32 TranslucencySortPriority; // 0x4b8(0x04)
	int32 *09bfa079b0; // 0x4bc(0x04)
	char pad_4C0[0x4]; // 0x4c0(0x04)
	float LpvBiasMultiplier; // 0x4c4(0x04)
	char pad_4C8[0x8]; // 0x4c8(0x08)
	struct FBodyInstance BodyInstance; // 0x4d0(0x230)
	char pad_700[0x8]; // 0x700(0x08)
	enum class EHasCustomNavigableGeometry *78051e740d; // 0x708(0x01)
	char pad_709[0x3b]; // 0x709(0x3b)
	float BoundsScale; // 0x744(0x04)
	float *af2466df12; // 0x748(0x04)
	float *582a6a05b9; // 0x74c(0x04)
	float *8aa40722fd; // 0x750(0x04)
	enum class *4c9c4152b1 CanBeCharacterBase; // 0x754(0x01)
	char pad_755[0x1]; // 0x755(0x01)
	enum class *4c9c4152b1 CanCharacterStepUpOn; // 0x756(0x01)
	char pad_757[0x1]; // 0x757(0x01)
	struct TArray<struct AActor*> *3263ebc401; // 0x758(0x10)
	struct TArray<struct UPrimitiveComponent*> *a555ecd237; // 0x768(0x10)
	char pad_778[0xb8]; // 0x778(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x830(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x840(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x850(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x860(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x870(0x10)
	char pad_880[0x10]; // 0x880(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x890(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x8a0(0x10)
	struct FMulticastDelegate OnClicked; // 0x8b0(0x10)
	struct FMulticastDelegate OnReleased; // 0x8c0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x8d0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x8e0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x8f0(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x900(0x10)
	char pad_910[0x28]; // 0x910(0x28)
	struct UPrimitiveComponent* *17bfbe7021; // 0x938(0x08)
	struct UPrimitiveComponent* *b257202527; // 0x940(0x08)
	struct F*71789ef7cf *9449fd3492; // 0x948(0x58)
	char pad_9A0[0x10]; // 0x9a0(0x10)

	enum class ECollisionChannel SetCollisionObjectType(); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x64f0124
	bool *7b97c590ca(); // Function Engine.PrimitiveComponent.*7b97c590ca // Native|Public|BlueprintCallable // @ game+0x64f236c
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x64d942c
	bool *a3ced43a9e(); // Function Engine.PrimitiveComponent.*a3ced43a9e // Final|Native|Public|BlueprintCallable // @ game+0x64e2a24
	struct FVector *01e27a1a47(); // Function Engine.PrimitiveComponent.*01e27a1a47 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64eb4b4
	struct FName SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64efdb4
	struct UMaterialInterface* SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0xc1668c
	enum class EDOFMode *d16743e48e(); // Function Engine.PrimitiveComponent.*d16743e48e // Native|Public|BlueprintCallable // @ game+0x64f07c0
	int32 *9f38f9fbc2(); // Function Engine.PrimitiveComponent.*9f38f9fbc2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0d98
	struct FVector *7693ea05a0(); // Function Engine.PrimitiveComponent.*7693ea05a0 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e17d0
	float *2a6b53140c(); // Function Engine.PrimitiveComponent.*2a6b53140c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57151b0
	bool *fc59628470(); // Function Engine.PrimitiveComponent.*fc59628470 // Final|Native|Public|BlueprintCallable // @ game+0x64f3634
	struct UMaterialInterface* *632fed46bc(); // Function Engine.PrimitiveComponent.*632fed46bc // Native|Public|BlueprintCallable // @ game+0x64f2498
	bool *2faa0a8d88(); // Function Engine.PrimitiveComponent.*2faa0a8d88 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e36f8
	bool *82d09edad4(); // Function Engine.PrimitiveComponent.*82d09edad4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d5940
	bool *1d887895df(); // Function Engine.PrimitiveComponent.*1d887895df // Native|Public|BlueprintCallable // @ game+0x64f2a58
	float SetMassScale(); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x57e8008
	float SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x64f2060
	bool *3569fb64cc(); // Function Engine.PrimitiveComponent.*3569fb64cc // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64ee5d8
	struct FVector *2a28a4db69(); // Function Engine.PrimitiveComponent.*2a28a4db69 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dd7dc
	struct FName *30247e1b2f(); // Function Engine.PrimitiveComponent.*30247e1b2f // Native|Public|BlueprintCallable // @ game+0x64f43f0
	struct UMaterialInterface* *3172cb3554(); // Function Engine.PrimitiveComponent.*3172cb3554 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0538
	bool *e4d650bcfd(); // Function Engine.PrimitiveComponent.*e4d650bcfd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6a60
	void *dcaed91866(); // Function Engine.PrimitiveComponent.*dcaed91866 // Final|Native|Public|BlueprintCallable // @ game+0x64d5f90
	float SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x64ee868
	float *f7e8b000d4(); // Function Engine.PrimitiveComponent.*f7e8b000d4 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddad4
	struct F*630cf25516 *ca937dc5a0(); // Function Engine.PrimitiveComponent.*ca937dc5a0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2940
	bool *d9842fd919(); // Function Engine.PrimitiveComponent.*d9842fd919 // Final|Native|Public|BlueprintCallable // @ game+0x64efc88
	bool AddAngularImpulse(); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d3380
	bool *e3829bf1a9(); // Function Engine.PrimitiveComponent.*e3829bf1a9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d4d08
	struct FVector GetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x5c6c34
	struct FName *deff003dba(); // Function Engine.PrimitiveComponent.*deff003dba // Final|Native|Public|BlueprintCallable // @ game+0x64ddc80
	struct FName SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x64f2e2c
	bool *a413ad5332(); // Function Engine.PrimitiveComponent.*a413ad5332 // Native|Public|BlueprintCallable // @ game+0x64ee7d0
	struct F*630cf25516 *1f762b8275(); // Function Engine.PrimitiveComponent.*1f762b8275 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f4be0
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x64d95c0
	bool *d0b4bb5c03(); // Function Engine.PrimitiveComponent.*d0b4bb5c03 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6a8c
	struct UClass* GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1074
	bool AddImpulse(); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d42f4
	bool *92fc76ae27(); // Function Engine.PrimitiveComponent.*92fc76ae27 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d4b34
	bool *9b10ee1e80(); // Function Engine.PrimitiveComponent.*9b10ee1e80 // Final|Native|Public|BlueprintCallable // @ game+0x64e2b04
	int32 *a7aa88bafe(); // Function Engine.PrimitiveComponent.*a7aa88bafe // Final|Native|Public|BlueprintCallable // @ game+0x64f414c
	void *24021479fd(); // Function Engine.PrimitiveComponent.*24021479fd // Final|Native|Public|BlueprintCallable // @ game+0x64d5fac
	struct TArray<struct UPrimitiveComponent*> *b954d8828a(); // Function Engine.PrimitiveComponent.*b954d8828a // Final|Native|Public|BlueprintCallable // @ game+0x64d93a4
	enum class ECollisionResponse *79e487c6f9(); // Function Engine.PrimitiveComponent.*79e487c6f9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddcb8
	enum class ECollisionResponse *78fdfb4d17(); // Function Engine.PrimitiveComponent.*78fdfb4d17 // Native|Public|BlueprintCallable // @ game+0x64f02e8
	struct FName AddForceAtLocation(); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d3d94
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e126c
	struct FName AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d4434
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x64d94d0
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e044c
	enum class EDOFMode *5ffb7dcccd(); // Function Engine.PrimitiveComponent.*5ffb7dcccd // Native|Public|BlueprintCallable // @ game+0x64f20fc
	bool *40a5d1cffa(); // Function Engine.PrimitiveComponent.*40a5d1cffa // Native|Public|BlueprintCallable // @ game+0x64f0d2c
	bool *bbb624a79d(); // Function Engine.PrimitiveComponent.*bbb624a79d // Final|Native|Public|BlueprintCallable // @ game+0x64f36c8
	bool *66aea35f5e(); // Function Engine.PrimitiveComponent.*66aea35f5e // Final|Native|Public|BlueprintCallable // @ game+0x64f2af0
	bool *d282999091(); // Function Engine.PrimitiveComponent.*d282999091 // Final|Native|Public|BlueprintCallable // @ game+0x64f2c40
	struct UMaterialInterface* *039800f1f5(); // Function Engine.PrimitiveComponent.*039800f1f5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e05dc
	bool SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ee6d0
	enum class ECollisionEnabled *cce6c67132(); // Function Engine.PrimitiveComponent.*cce6c67132 // Native|Public|BlueprintCallable // @ game+0xbb7f10
	struct FName *e6b23a751f(); // Function Engine.PrimitiveComponent.*e6b23a751f // Native|Public|BlueprintCallable // @ game+0x64f6138
	bool *332f931425(); // Function Engine.PrimitiveComponent.*332f931425 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6abc
	float *f823da27dc(); // Function Engine.PrimitiveComponent.*f823da27dc // Final|Native|Public|BlueprintCallable // @ game+0x64efa30
	struct FName AddForceAtLocationLocal(); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d3ee0
	bool *e67787df0d(); // Function Engine.PrimitiveComponent.*e67787df0d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3658
	enum class *5081dde572 *b03bf8da06(); // Function Engine.PrimitiveComponent.*b03bf8da06 // Final|Native|Public|BlueprintCallable // @ game+0x64f0a80
	enum class ECollisionChannel *36485e4886(); // Function Engine.PrimitiveComponent.*36485e4886 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddc58
	enum class ECollisionResponse *f0b5efc4d8(); // Function Engine.PrimitiveComponent.*f0b5efc4d8 // Native|Public|BlueprintCallable // @ game+0x64f0250
	struct FName SetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x539acc
	bool K2_LineTraceComponent(); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e6af0
	struct FVector GetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e1720
	bool AddForce(); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d3c54
	struct TArray<struct F*28df80a383> *fd716d5e78(); // Function Engine.PrimitiveComponent.*fd716d5e78 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0ecc
	float *036f31ad96(); // Function Engine.PrimitiveComponent.*036f31ad96 // Native|Public|BlueprintCallable // @ game+0x64e96ac
	bool *2faca86bd3(); // Function Engine.PrimitiveComponent.*2faca86bd3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3298
	float *02681a1ced(); // Function Engine.PrimitiveComponent.*02681a1ced // Final|Native|Public|BlueprintCallable // @ game+0x64f0958
	struct FName *2887752cc3(); // Function Engine.PrimitiveComponent.*2887752cc3 // Final|Native|Public|BlueprintCallable // @ game+0x64eaac8
	float *16e97b9149(); // Function Engine.PrimitiveComponent.*16e97b9149 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0318
	struct FVector *164ed6c2a4(); // Function Engine.PrimitiveComponent.*164ed6c2a4 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64df4a4
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x64d931c
	struct UPhysicalMaterial* *75e72496bd(); // Function Engine.PrimitiveComponent.*75e72496bd // Native|Public|BlueprintCallable // @ game+0x64f2d98
	bool *dfc676b7a3(); // Function Engine.PrimitiveComponent.*dfc676b7a3 // Final|Native|Public|BlueprintCallable // @ game+0x64f375c
	enum class ECollisionEnabled *dab6d024ed(); // Function Engine.PrimitiveComponent.*dab6d024ed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64ddc30
	bool AddTorque(); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d51c8
	void *b5162d1d9b(); // Function Engine.PrimitiveComponent.*b5162d1d9b // Native|Public|BlueprintCallable // @ game+0xc526f8
	bool *69a6b1b25d(); // Function Engine.PrimitiveComponent.*69a6b1b25d // Native|Public|BlueprintCallable // @ game+0x64e2e04
	float *bbbb9b1909(); // Function Engine.PrimitiveComponent.*bbbb9b1909 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0478
	struct FName SetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x5399e4
	int32 *5929e5407b(); // Function Engine.PrimitiveComponent.*5929e5407b // Final|Native|Public|BlueprintCallable // @ game+0x64f09f0
	struct FName *c1ae168066(); // Function Engine.PrimitiveComponent.*c1ae168066 // Native|Public|BlueprintCallable // @ game+0x64f01bc
	bool *9d0af71f5d(); // Function Engine.PrimitiveComponent.*9d0af71f5d // Native|Public|BlueprintCallable // @ game+0x4ffb34
};

// Class Engine.MeshComponent
// Size: 0xab0 (Inherited: 0x9b0)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x9a8(0x10)
	char pad_9C0[0xf0]; // 0x9c0(0xf0)

	int32 *52fc39a231(); // Function Engine.MeshComponent.*52fc39a231 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0680
	struct TArray<struct UMaterialInterface*> *eb1d5a0c74(); // Function Engine.MeshComponent.*eb1d5a0c74 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e07b4
	bool *a07df3b67c(); // Function Engine.MeshComponent.*a07df3b67c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3470
	float *b7c03fab71(); // Function Engine.MeshComponent.*b7c03fab71 // Final|Native|Public|BlueprintCallable // @ game+0x97d1cc
	struct FVector *4128bad4a1(); // Function Engine.MeshComponent.*4128bad4a1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f4760
	struct TArray<struct FName> *bd0d269c5b(); // Function Engine.MeshComponent.*bd0d269c5b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0728
};

// Class Engine.StaticMeshComponent
// Size: 0xb50 (Inherited: 0xab0)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xab0(0x04)
	int32 *198fecb621; // 0xab4(0x04)
	bool bOverrideMinLOD; // 0xab8(0x01)
	char pad_AB9[0x3]; // 0xab9(0x03)
	int32 MinLOD; // 0xabc(0x04)
	struct UStaticMesh* StaticMesh; // 0xac0(0x08)
	bool bOverrideWireframeColor; // 0xac8(0x01)
	char pad_AC9[0x3]; // 0xac9(0x03)
	struct FColor WireframeColorOverride; // 0xacc(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xad0(0x10)
	char *7f859870b0 : 1; // 0xae0(0x01)
	char *4d9ef1a96b : 1; // 0xae0(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xae0(0x01)
	char *c4be459603 : 1; // 0xae0(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xae0(0x01)
	char bOverrideLightMapRes : 1; // 0xae0(0x01)
	char pad_AE0_6 : 2; // 0xae0(0x01)
	char pad_AE1[0x3]; // 0xae1(0x03)
	int32 OverriddenLightMapRes; // 0xae4(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xae8(0x01)
	char pad_AE8_1 : 7; // 0xae8(0x01)
	char pad_AE9[0x3]; // 0xae9(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xaec(0x04)
	float StreamingDistanceMultiplier; // 0xaf0(0x04)
	int32 *d6ee954a0d; // 0xaf4(0x04)
	char *3331e715ef : 1; // 0xaf8(0x01)
	char pad_AF8_1 : 7; // 0xaf8(0x01)
	char pad_AF9[0x7]; // 0xaf9(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xb00(0x10)
	struct TArray<struct F*fec1278a78> *db24bbedf0; // 0xb10(0x10)
	struct TArray<struct F*b5b893870e> *e396a7ceab; // 0xb20(0x10)
	bool *6fa59b2292; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	struct F*886b75ca22 LightmassSettings; // 0xb34(0x18)
	char pad_B4C[0x4]; // 0xb4c(0x04)

	int32 *e499d85100(); // Function Engine.StaticMeshComponent.*e499d85100 // Final|Native|Public|BlueprintCallable // @ game+0x64f10ec
	bool SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x5f98cfc
	struct FVector *231c06526a(); // Function Engine.StaticMeshComponent.*231c06526a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0344
	struct UStaticMesh* OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x64e9958
};

// Class Engine.SkinnedMeshComponent
// Size: 0xc50 (Inherited: 0xab0)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xab0(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xab8(0x08)
	char pad_AC0[0x60]; // 0xac0(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb20(0x01)
	char pad_B20_1 : 7; // 0xb20(0x01)
	char pad_B21[0x7]; // 0xb21(0x07)
	struct TArray<struct FBoxSphereBounds> *a849bc8171; // 0xb28(0x10)
	char pad_B38[0x20]; // 0xb38(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xb58(0x08)
	int32 ForcedLodModel; // 0xb60(0x04)
	int32 MinLodModel; // 0xb64(0x04)
	char pad_B68[0x10]; // 0xb68(0x10)
	struct TArray<struct F*6785417a7c> LODInfo; // 0xb78(0x10)
	float StreamingDistanceMultiplier; // 0xb88(0x04)
	struct FColor WireframeColor; // 0xb8c(0x04)
	char *428602d4f6 : 1; // 0xb90(0x01)
	char *0ef0300f94 : 1; // 0xb90(0x01)
	char bDisableMorphTarget : 1; // 0xb90(0x01)
	char *39de54be4e : 1; // 0xb90(0x01)
	char pad_B90_4 : 4; // 0xb90(0x01)
	char pad_B91[0x17]; // 0xb91(0x17)
	char bPerBoneMotionBlur : 1; // 0xba8(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xba8(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xba8(0x01)
	char bSyncAttachParentLOD : 1; // 0xba8(0x01)
	char pad_BA8_4 : 4; // 0xba8(0x01)
	char pad_BA9[0x3]; // 0xba9(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xbac(0x01)
	char pad_BAD[0x3]; // 0xbad(0x03)
	char *56b03ddea8 : 1; // 0xbb0(0x01)
	char *6caa3c3fe1 : 1; // 0xbb0(0x01)
	char *ab97d111d5 : 1; // 0xbb0(0x01)
	char pad_BB0_3 : 5; // 0xbb0(0x01)
	char pad_BB1[0x3]; // 0xbb1(0x03)
	bool *cee1355191; // 0xbb4(0x01)
	char pad_BB5[0x3]; // 0xbb5(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xbb8(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xbb8(0x01)
	char pad_BB8_2 : 6; // 0xbb8(0x01)
	char pad_BB9[0x3]; // 0xbb9(0x03)
	char bRenderStatic : 1; // 0xbbc(0x01)
	char pad_BBC_1 : 7; // 0xbbc(0x01)
	char pad_BBD[0x3]; // 0xbbd(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xbc0(0x04)
	char *15a4761d5b : 1; // 0xbc4(0x01)
	char pad_BC4_1 : 7; // 0xbc4(0x01)
	char pad_BC5[0xf]; // 0xbc5(0x0f)
	struct FBoxSphereBounds *d470b2b7d1; // 0xbd4(0x1c)
	bool *4cd34b6758; // 0xbf0(0x01)
	bool bEnableUpdateRateOptimizations; // 0xbf1(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xbf2(0x01)
	char pad_BF3[0x4e]; // 0xbf3(0x4e)
	bool *e9990aed04; // 0xc41(0x01)
	bool *05a0730e26; // 0xc42(0x01)
	char pad_C43[0xd]; // 0xc43(0x0d)

	bool *ec248b25a0(); // Function Engine.SkinnedMeshComponent.*ec248b25a0 // Final|Native|Public|BlueprintCallable // @ game+0x65399c8
	struct FName *c4f0ee9e4c(); // Function Engine.SkinnedMeshComponent.*c4f0ee9e4c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6513d4c
	bool *9c5d0b6944(); // Function Engine.SkinnedMeshComponent.*9c5d0b6944 // Final|Native|Public|BlueprintCallable // @ game+0x6539a78
	struct TArray<struct FLinearColor> *604742927d(); // Function Engine.SkinnedMeshComponent.*604742927d // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65456e4
	struct USkinnedMeshComponent* *61a9693b85(); // Function Engine.SkinnedMeshComponent.*61a9693b85 // Final|Native|Public|BlueprintCallable // @ game+0x653fefc
	struct FName *69ce5b8b8d(); // Function Engine.SkinnedMeshComponent.*69ce5b8b8d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65196e4
	int32 GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6513a90
	bool *ef1192b277(); // Function Engine.SkinnedMeshComponent.*ef1192b277 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65009b8
	int32 *0e7e6cd84f(); // Function Engine.SkinnedMeshComponent.*0e7e6cd84f // Final|Native|Public|BlueprintCallable // @ game+0x653d308
	bool *8bf10f391d(); // Function Engine.SkinnedMeshComponent.*8bf10f391d // Native|Public|BlueprintCallable // @ game+0x6540ec0
	bool *559e974ba0(); // Function Engine.SkinnedMeshComponent.*559e974ba0 // Final|Native|Public|BlueprintCallable // @ game+0x6541df0
	struct FRotator *518eb77a8b(); // Function Engine.SkinnedMeshComponent.*518eb77a8b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x654e7f4
	float *cfacb7d388(); // Function Engine.SkinnedMeshComponent.*cfacb7d388 // Final|Native|Public|BlueprintCallable // @ game+0x6539524
	int32 *d2f08d65bc(); // Function Engine.SkinnedMeshComponent.*d2f08d65bc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6519320
	int32 *be13762590(); // Function Engine.SkinnedMeshComponent.*be13762590 // Final|Native|Public|BlueprintCallable // @ game+0x6507f28
	struct FRotator *af2312fcf3(); // Function Engine.SkinnedMeshComponent.*af2312fcf3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x654ebc8
	bool SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x65423f0
	struct FName *d9b06c421e(); // Function Engine.SkinnedMeshComponent.*d9b06c421e // Final|Native|Public|BlueprintCallable // @ game+0x654ee00
	int32 *bf7d10d1b2(); // Function Engine.SkinnedMeshComponent.*bf7d10d1b2 // Final|Native|Public|BlueprintCallable // @ game+0x654002c
	struct FName *5a0c0a8877(); // Function Engine.SkinnedMeshComponent.*5a0c0a8877 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6510628
	struct FName *a7992bfca2(); // Function Engine.SkinnedMeshComponent.*a7992bfca2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651be14
	struct TArray<struct F*2d76a0ca1c> SetSkinWeightOverride(); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6542564
	bool *d2ec714e3f(); // Function Engine.SkinnedMeshComponent.*d2ec714e3f // Final|Native|Public|BlueprintCallable // @ game+0x6521a04
	int32 *03bce2e129(); // Function Engine.SkinnedMeshComponent.*03bce2e129 // Final|Native|Public|BlueprintCallable // @ game+0x6507bc4
	enum class *58b4be883c *14d803ab8f(); // Function Engine.SkinnedMeshComponent.*14d803ab8f // Final|Native|Public|BlueprintCallable // @ game+0x6520540
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1150 (Inherited: 0xc50)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xc50(0x08)
	struct UClass* AnimClass; // 0xc58(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xc60(0x08)
	struct TArray<struct UAnimInstance*> *c85816968d; // 0xc68(0x10)
	struct UAnimInstance* *d41233ff0c; // 0xc78(0x08)
	struct F*6592b79d68 AnimationData; // 0xc80(0x18)
	char pad_C98[0x30]; // 0xc98(0x30)
	struct TArray<struct FTransform> *c4b76afb18; // 0xcc8(0x10)
	struct TArray<struct FTransform> *2e37c7a139; // 0xcd8(0x10)
	char pad_CE8[0x20]; // 0xce8(0x20)
	float GlobalAnimRateScale; // 0xd08(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd0c(0x01)
	enum class *3c8dc5cc54 PhysicsTransformUpdateMode; // 0xd0d(0x01)
	char pad_D0E[0x1]; // 0xd0e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd0f(0x01)
	char pad_D10[0x4]; // 0xd10(0x04)
	char pad_D14_0 : 1; // 0xd14(0x01)
	char *0765881b66 : 1; // 0xd14(0x01)
	char pad_D14_2 : 1; // 0xd14(0x01)
	char *c88cf8b3b6 : 1; // 0xd14(0x01)
	char pad_D14_4 : 2; // 0xd14(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd14(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd14(0x01)
	char bDisableClothSimulation : 1; // 0xd15(0x01)
	char pad_D15_1 : 2; // 0xd15(0x01)
	char bCollideWithEnvironment : 1; // 0xd15(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd15(0x01)
	char bLocalSpaceSimulation : 1; // 0xd15(0x01)
	char *186c36d696 : 1; // 0xd15(0x01)
	char bResetAfterTeleport : 1; // 0xd15(0x01)
	char pad_D16_0 : 1; // 0xd16(0x01)
	char bNoSkeletonUpdate : 1; // 0xd16(0x01)
	char bPauseAnims : 1; // 0xd16(0x01)
	char *e321c6819c : 1; // 0xd16(0x01)
	char bEnablePerPolyCollision : 1; // 0xd16(0x01)
	char *b39284674e : 1; // 0xd16(0x01)
	char *d4f8e0be1a : 1; // 0xd16(0x01)
	char *4a2d21f86d : 1; // 0xd16(0x01)
	char *e46c1d1db1 : 1; // 0xd17(0x01)
	char *d42c156e9b : 1; // 0xd17(0x01)
	char *cccca4cafe : 1; // 0xd17(0x01)
	char *1fecf92850 : 1; // 0xd17(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd17(0x01)
	char *c012ed566e : 1; // 0xd17(0x01)
	char pad_D17_6 : 2; // 0xd17(0x01)
	char *bd8057b0dc : 1; // 0xd18(0x01)
	char pad_D18_1 : 7; // 0xd18(0x01)
	char pad_D19_0 : 2; // 0xd19(0x01)
	char bDefaultLooping : 1; // 0xd19(0x01)
	char bDefaultPlaying : 1; // 0xd19(0x01)
	char pad_D19_4 : 4; // 0xd19(0x01)
	uint16 *e8a7b9de66; // 0xd1a(0x02)
	float ClothBlendWeight; // 0xd1c(0x04)
	struct FVector *dfd815ea46; // 0xd20(0x0c)
	char pad_D2C[0x4]; // 0xd2c(0x04)
	struct UBodySetup* BodySetup; // 0xd30(0x08)
	float TeleportDistanceThreshold; // 0xd38(0x04)
	float TeleportRotationThreshold; // 0xd3c(0x04)
	struct FVector *c599877e19; // 0xd40(0x0c)
	char pad_D4C[0x4]; // 0xd4c(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xd50(0x10)
	char pad_D60[0xe0]; // 0xd60(0xe0)
	struct UClass* *41d1d8804c; // 0xe40(0x08)
	char pad_E48[0x1e8]; // 0xe48(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1030(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1038(0x08)
	float DefaultPosition; // 0x1040(0x04)
	float DefaultPlayRate; // 0x1044(0x04)
	uint32 *e648f1c23a; // 0x1048(0x04)
	float *a1f019615b; // 0x104c(0x04)
	char pad_1050[0x100]; // 0x1050(0x100)

	float *9e55cd1127(); // Function Engine.SkeletalMeshComponent.*9e55cd1127 // Final|Native|Public|BlueprintCallable // @ game+0x6540fa4
	float *c95e2eb189(); // Function Engine.SkeletalMeshComponent.*c95e2eb189 // Final|Native|Public|BlueprintCallable // @ game+0x5821350
	enum class EAnimationMode *32a72275c6(); // Function Engine.SkeletalMeshComponent.*32a72275c6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6513334
	bool *578f9a271e(); // Function Engine.SkeletalMeshComponent.*578f9a271e // Final|Native|Public|BlueprintCallable // @ game+0x653c054
	void *88160de687(); // Function Engine.SkeletalMeshComponent.*88160de687 // Final|Native|Public|BlueprintCallable // @ game+0x6534ab8
	void *7c7a4f8d4b(); // Function Engine.SkeletalMeshComponent.*7c7a4f8d4b // Final|Native|Public|BlueprintCallable // @ game+0x6534b5c
	bool *82f85b462f(); // Function Engine.SkeletalMeshComponent.*82f85b462f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64fa8d4
	float *7a2fd6088c(); // Function Engine.SkeletalMeshComponent.*7a2fd6088c // Final|Native|Public|BlueprintCallable // @ game+0x652f1e0
	struct FName *d836f3cdcc(); // Function Engine.SkeletalMeshComponent.*d836f3cdcc // Final|Native|Public|BlueprintCallable // @ game+0x6510c30
	float *88b6545993(); // Function Engine.SkeletalMeshComponent.*88b6545993 // Final|Native|Public|BlueprintCallable // @ game+0x653a094
	float *a16076bca9(); // Function Engine.SkeletalMeshComponent.*a16076bca9 // Final|Native|Public|BlueprintCallable // @ game+0x6536e3c
	bool *37c1df285c(); // Function Engine.SkeletalMeshComponent.*37c1df285c // Final|Native|Public|BlueprintCallable // @ game+0x6521954
	bool *7a87ebfeb9(); // Function Engine.SkeletalMeshComponent.*7a87ebfeb9 // Final|Native|Public|BlueprintCallable // @ game+0x653bd90
	bool PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x652fd0c
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651a088
	struct UAnimationAsset* SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x669b74
	bool *3f2c53189b(); // Function Engine.SkeletalMeshComponent.*3f2c53189b // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64fa150
	bool *908191f82a(); // Function Engine.SkeletalMeshComponent.*908191f82a // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65364c4
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652203c
	struct UClass* SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x653789c
	bool *c3c91f087e(); // Function Engine.SkeletalMeshComponent.*c3c91f087e // Final|Native|Public|BlueprintCallable // @ game+0x65369c0
	struct FVector *2863de562e(); // Function Engine.SkeletalMeshComponent.*2863de562e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651bde0
	float *42a4fc1ad0(); // Function Engine.SkeletalMeshComponent.*42a4fc1ad0 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6514824
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6519940
	float SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0xb77464
	struct FPoseSnapshot *39e1d97951(); // Function Engine.SkeletalMeshComponent.*39e1d97951 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x65481c8
	void *74ff591f58(); // Function Engine.SkeletalMeshComponent.*74ff591f58 // Final|Native|Public|BlueprintCallable // @ game+0x64ff704
	bool *2fd908ba89(); // Function Engine.SkeletalMeshComponent.*2fd908ba89 // Final|Native|Public|BlueprintCallable // @ game+0x65402f8
	void *7bb96a0e6d(); // Function Engine.SkeletalMeshComponent.*7bb96a0e6d // Final|Native|Public|BlueprintCallable // @ game+0x6534e30
	bool *e2235034c0(); // Function Engine.SkeletalMeshComponent.*e2235034c0 // Final|Native|Public|BlueprintCallable // @ game+0x653687c
	bool *ce530fa306(); // Function Engine.SkeletalMeshComponent.*ce530fa306 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6522b38
	bool SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x654158c
	void *e93856bf3e(); // Function Engine.SkeletalMeshComponent.*e93856bf3e // Final|Native|Public|BlueprintCallable // @ game+0x654db3c
	bool Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0x669be8
	bool *1a786e57d5(); // Function Engine.SkeletalMeshComponent.*1a786e57d5 // Final|Native|Public|BlueprintCallable // @ game+0x6536668
	struct UAnimInstance* *71d3f55db1(); // Function Engine.SkeletalMeshComponent.*71d3f55db1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651a3cc
	bool *04bd387e61(); // Function Engine.SkeletalMeshComponent.*04bd387e61 // Final|Native|Public|BlueprintCallable // @ game+0x6521ad0
	bool *ee48004024(); // Function Engine.SkeletalMeshComponent.*ee48004024 // Final|Native|Public|BlueprintCallable // @ game+0x653a624
	void *baef9ab32e(); // Function Engine.SkeletalMeshComponent.*baef9ab32e // Final|Native|Public|BlueprintCallable // @ game+0x6512000
	struct UAnimInstance* *10273169ee(); // Function Engine.SkeletalMeshComponent.*10273169ee // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc68860
	bool *8afc579124(); // Function Engine.SkeletalMeshComponent.*8afc579124 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65203f8
	bool *8cc93862cf(); // Function Engine.SkeletalMeshComponent.*8cc93862cf // Final|Native|Public|BlueprintCallable // @ game+0x5770da8
	bool *0d7fe52d3f(); // Function Engine.SkeletalMeshComponent.*0d7fe52d3f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64faa68
	enum class EAnimationMode *18e31ec1ba(); // Function Engine.SkeletalMeshComponent.*18e31ec1ba // Final|Native|Public|BlueprintCallable // @ game+0x2f9ce4
	struct FName *946b36923d(); // Function Engine.SkeletalMeshComponent.*946b36923d // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x65036d4
	float *b3d8eb2cbb(); // Function Engine.SkeletalMeshComponent.*b3d8eb2cbb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6513c60
	bool *a847fc7087(); // Function Engine.SkeletalMeshComponent.*a847fc7087 // Final|Native|Public|BlueprintCallable // @ game+0x4ff604
	bool *3e6b6b7c05(); // Function Engine.SkeletalMeshComponent.*3e6b6b7c05 // Native|Public|BlueprintCallable // @ game+0x65406e4
	bool *a6e5e1b394(); // Function Engine.SkeletalMeshComponent.*a6e5e1b394 // Final|Native|Public|BlueprintCallable // @ game+0x654ee90
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x668aa4
	bool *4adf88a322(); // Function Engine.SkeletalMeshComponent.*4adf88a322 // Final|Native|Public|BlueprintCallable // @ game+0x65366fc
	bool *9323118453(); // Function Engine.SkeletalMeshComponent.*9323118453 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x4ff480
	void *7f10900457(); // Function Engine.SkeletalMeshComponent.*7f10900457 // Final|Native|Public|BlueprintCallable // @ game+0x6507b14
	struct FName *1c036a91e9(); // Function Engine.SkeletalMeshComponent.*1c036a91e9 // Final|Native|Public|BlueprintCallable // @ game+0x653bca4
	bool *6d7e22c6e6(); // Function Engine.SkeletalMeshComponent.*6d7e22c6e6 // Final|Native|Public|BlueprintCallable // @ game+0x653a4f4
	void *2c38e2c65f(); // Function Engine.SkeletalMeshComponent.*2c38e2c65f // Final|Native|Public|BlueprintCallable // @ game+0x6511fe8
	float *b21911ca74(); // Function Engine.SkeletalMeshComponent.*b21911ca74 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6519224
	struct FName *e816aee7a9(); // Function Engine.SkeletalMeshComponent.*e816aee7a9 // Native|Public|BlueprintCallable // @ game+0x65385d8
};

// Class Engine.*9f23a81057
// Size: 0x38 (Inherited: 0x30)
struct U*9f23a81057 : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.*7563a7fc65
// Size: 0x38 (Inherited: 0x38)
struct U*7563a7fc65 : U*9f23a81057 {
};

// Class Engine.*5c0419d42f
// Size: 0x30 (Inherited: 0x30)
struct U*5c0419d42f : UObject {
};

// Class Engine.*f23bfe8a1c
// Size: 0x48 (Inherited: 0x30)
struct U*f23bfe8a1c : UObject {
	char bCausedByWorld : 1; // 0x30(0x01)
	char bScaleMomentumByMass : 1; // 0x30(0x01)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char pad_30_3 : 5; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DamageImpulse; // 0x34(0x04)
	float DestructibleImpulse; // 0x38(0x04)
	float DestructibleDamageSpreadScale; // 0x3c(0x04)
	float DamageFalloff; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.MovementComponent
// Size: 0x250 (Inherited: 0x200)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x200(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x208(0x08)
	char pad_210[0x4]; // 0x210(0x04)
	struct FVector Velocity; // 0x214(0x0c)
	char bConstrainToPlane : 1; // 0x220(0x01)
	char bSnapToPlaneAtStart : 1; // 0x220(0x01)
	char pad_220_2 : 6; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	enum class EPlaneConstraintAxisSetting *a77cbf5800; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	struct FVector PlaneConstraintNormal; // 0x228(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x234(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x240(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x240(0x01)
	char bTickBeforeOwner : 1; // 0x240(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x240(0x01)
	char pad_240_4 : 4; // 0x240(0x01)
	char pad_241[0xf]; // 0x241(0x0f)

	float K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e683c
	struct APhysicsVolume* PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0x9d8068
	float K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6894
	void *e6f44122ff(); // Function Engine.MovementComponent.*e6f44122ff // Native|Public|BlueprintCallable // @ game+0x64f5b18
	struct FVector ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64d907c
	float *b4cb0012a1(); // Function Engine.MovementComponent.*b4cb0012a1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de8d8
	bool *b04193052d(); // Function Engine.MovementComponent.*b04193052d // Native|Public|BlueprintCallable // @ game+0x64f2ff4
	enum class EPlaneConstraintAxisSetting *c3de771e31(); // Function Engine.MovementComponent.*c3de771e31 // Native|Public|BlueprintCallable // @ game+0x64f2f60
	struct FVector *cbfd9eb4d4(); // Function Engine.MovementComponent.*cbfd9eb4d4 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64d9144
	bool *9c8f4b265c(); // Function Engine.MovementComponent.*9c8f4b265c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e319c
	struct APhysicsVolume* *e36ab2b188(); // Function Engine.MovementComponent.*e36ab2b188 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e18e0
	bool *3eb8132b76(); // Function Engine.MovementComponent.*3eb8132b76 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64e6e5c
	struct FVector *6fecebcb5c(); // Function Engine.MovementComponent.*6fecebcb5c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e196c
	struct FVector *2094bf75a9(); // Function Engine.MovementComponent.*2094bf75a9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f323c
	struct FVector *27b6012a40(); // Function Engine.MovementComponent.*27b6012a40 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f3198
	void *34e8851871(); // Function Engine.MovementComponent.*34e8851871 // Native|Public|BlueprintCallable // @ game+0x64f51b0
	struct USceneComponent* *3f3594939d(); // Function Engine.MovementComponent.*3f3594939d // Native|Public|BlueprintCallable // @ game+0x64f435c
	struct FVector *62cc96d62b(); // Function Engine.MovementComponent.*62cc96d62b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1944
	float *d7d499fbfa(); // Function Engine.MovementComponent.*d7d499fbfa // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e08c4
	struct FVector *a027f13766(); // Function Engine.MovementComponent.*a027f13766 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f308c
	struct FVector *f705c7d54e(); // Function Engine.MovementComponent.*f705c7d54e // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64d8fb4
	enum class EPlaneConstraintAxisSetting *e45e138b8a(); // Function Engine.MovementComponent.*e45e138b8a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e192c
};

// Class Engine.NavMovementComponent
// Size: 0x280 (Inherited: 0x250)
struct UNavMovementComponent : UMovementComponent {
	struct F*afffc9221e NavAgentProps; // 0x248(0x20)
	float *7b65d425cd; // 0x268(0x04)
	char *d2cfd1f855 : 1; // 0x26c(0x01)
	char bUseAccelerationForPaths : 1; // 0x26c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x26c(0x01)
	struct F*656446cb71 *1a07ad26f3; // 0x270(0x04)
	char pad_278_3 : 5; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)

	void *63853a7259(); // Function Engine.NavMovementComponent.*63853a7259 // Final|Native|Public|BlueprintCallable // @ game+0x64f5b30
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x64f54cc
	bool *e453ff855f(); // Function Engine.NavMovementComponent.*e453ff855f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3144
	bool IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3248
	bool *a617f7fb8d(); // Function Engine.NavMovementComponent.*a617f7fb8d // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3590
	bool *80b74fcbc2(); // Function Engine.NavMovementComponent.*80b74fcbc2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3964
	bool *d8d4d3d439(); // Function Engine.NavMovementComponent.*d8d4d3d439 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3270
};

// Class Engine.PawnMovementComponent
// Size: 0x290 (Inherited: 0x280)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *4e1d878be7; // 0x280(0x08)
	char pad_288[0x8]; // 0x288(0x08)

	struct FVector *1c570a1aae(); // Function Engine.PawnMovementComponent.*1c570a1aae // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e167c
	bool *96aa53ac22(); // Function Engine.PawnMovementComponent.*96aa53ac22 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d4580
	struct FVector *9cb1bf1b1b(); // Function Engine.PawnMovementComponent.*9cb1bf1b1b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0238
	struct FVector *533feeba94(); // Function Engine.PawnMovementComponent.*533feeba94 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d920c
	bool *05c9ee399f(); // Function Engine.PawnMovementComponent.*05c9ee399f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3568
	struct APawn* *4fe8686d15(); // Function Engine.PawnMovementComponent.*4fe8686d15 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1664
	struct FVector K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6808
};

// Class Engine.CharacterMovementComponent
// Size: 0x930 (Inherited: 0x290)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_290[0x8]; // 0x290(0x08)
	struct ACharacter* *850fe79414; // 0x298(0x08)
	char bApplyGravityWhileJumping : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float GravityScale; // 0x2a4(0x04)
	float MaxStepHeight; // 0x2a8(0x04)
	float JumpZVelocity; // 0x2ac(0x04)
	float JumpOffJumpZFactor; // 0x2b0(0x04)
	float *fa8f1fd3c5; // 0x2b4(0x04)
	float *6a63fdee84; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	float *abc0cd5685; // 0x2c0(0x04)
	float *73183d834f; // 0x2c4(0x04)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	enum class EMovementMode MovementMode; // 0x2d0(0x01)
	bool CustomMovementMode; // 0x2d1(0x01)
	char pad_2D2[0x1e]; // 0x2d2(0x1e)
	float GroundFriction; // 0x2f0(0x04)
	float MaxWalkSpeed; // 0x2f4(0x04)
	float MaxWalkSpeedCrouched; // 0x2f8(0x04)
	float MaxSwimSpeed; // 0x2fc(0x04)
	float MaxFlySpeed; // 0x300(0x04)
	float MaxCustomMovementSpeed; // 0x304(0x04)
	float MaxAcceleration; // 0x308(0x04)
	float BrakingFrictionFactor; // 0x30c(0x04)
	float BrakingFriction; // 0x310(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x314(0x01)
	char pad_314_1 : 7; // 0x314(0x01)
	char pad_315[0x3]; // 0x315(0x03)
	float BrakingDecelerationWalking; // 0x318(0x04)
	float BrakingDecelerationFalling; // 0x31c(0x04)
	float BrakingDecelerationSwimming; // 0x320(0x04)
	float BrakingDecelerationFlying; // 0x324(0x04)
	float AirControl; // 0x328(0x04)
	float AirControlBoostMultiplier; // 0x32c(0x04)
	float AirControlBoostVelocityThreshold; // 0x330(0x04)
	float FallingLateralFriction; // 0x334(0x04)
	float CrouchedHalfHeight; // 0x338(0x04)
	float PronedHalfHeight; // 0x33c(0x04)
	float PronedRadius; // 0x340(0x04)
	float Buoyancy; // 0x344(0x04)
	float PerchRadiusThreshold; // 0x348(0x04)
	float PerchAdditionalHeight; // 0x34c(0x04)
	struct FRotator RotationRate; // 0x350(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x35c(0x01)
	char bOrientRotationToMovement : 1; // 0x35c(0x01)
	char bSweepWhileNavWalking : 1; // 0x35c(0x01)
	char pad_35C_3 : 2; // 0x35c(0x01)
	char *3a41001e8f : 1; // 0x35c(0x01)
	char *181cbd7fbd : 1; // 0x35c(0x01)
	char bForceMaxAccel : 1; // 0x35c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x35d(0x01)
	char bForceNextFloorCheck : 1; // 0x35d(0x01)
	char *55d98c9816 : 1; // 0x35d(0x01)
	char bCanWalkOffLedges : 1; // 0x35d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x35d(0x01)
	char pad_35D_5 : 2; // 0x35d(0x01)
	char *a181fe0a7a : 1; // 0x35d(0x01)
	char *bc1853d4a4 : 1; // 0x35e(0x01)
	char pad_35E_1 : 7; // 0x35e(0x01)
	char pad_35F[0x1]; // 0x35f(0x01)
	struct USceneComponent* *dd5532d1f3; // 0x360(0x08)
	float MaxOutOfWaterStepHeight; // 0x368(0x04)
	float OutofWaterZ; // 0x36c(0x04)
	float Mass; // 0x370(0x04)
	bool bEnablePhysicsInteraction; // 0x374(0x01)
	bool bTouchForceScaledToMass; // 0x375(0x01)
	bool bPushForceScaledToMass; // 0x376(0x01)
	bool bPushForceUsingZOffset; // 0x377(0x01)
	bool bScalePushForceToVelocity; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	float StandingDownwardForceScale; // 0x37c(0x04)
	float InitialPushForceFactor; // 0x380(0x04)
	float PushForceFactor; // 0x384(0x04)
	float PushForcePointZOffsetFactor; // 0x388(0x04)
	float TouchForceFactor; // 0x38c(0x04)
	float MinTouchForce; // 0x390(0x04)
	float MaxTouchForce; // 0x394(0x04)
	float RepulsionForce; // 0x398(0x04)
	char bForceBraking : 1; // 0x39c(0x01)
	char pad_39C_1 : 7; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	float CrouchedSpeedMultiplier; // 0x3a0(0x04)
	float UpperImpactNormalScale; // 0x3a4(0x04)
	struct FVector Acceleration; // 0x3a8(0x0c)
	struct FVector *b38db9fa0a; // 0x3b4(0x0c)
	struct FQuat *cb13287acd; // 0x3c0(0x10)
	struct FVector *2326939532; // 0x3d0(0x0c)
	float *2c8a26d287; // 0x3dc(0x04)
	float *a5a6a835a3; // 0x3e0(0x04)
	float *21abb31899; // 0x3e4(0x04)
	struct FVector *3c6c846d6e; // 0x3e8(0x0c)
	struct FVector *e826a5d8b4; // 0x3f4(0x0c)
	float *c22b8bcc91; // 0x400(0x04)
	char pad_404[0x8]; // 0x404(0x08)
	float MaxSimulationTimeStep; // 0x40c(0x04)
	int32 MaxSimulationIterations; // 0x410(0x04)
	float MaxDepenetrationWithGeometry; // 0x414(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x418(0x04)
	float MaxDepenetrationWithPawn; // 0x41c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x420(0x04)
	float *e1309db822; // 0x424(0x04)
	float *62cdf6b6f5; // 0x428(0x04)
	float *32491f59b3; // 0x42c(0x04)
	float *a3c5a0cc2f; // 0x430(0x04)
	float *9a25d8eb73; // 0x434(0x04)
	float *ecdd5ac4d1; // 0x438(0x04)
	float *6b8c95142c; // 0x43c(0x04)
	float *7119fd2666; // 0x440(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float *416fcf627d; // 0x448(0x04)
	float *212ee42817; // 0x44c(0x04)
	float *bfd8190383; // 0x450(0x04)
	float *71f6b1e9a2; // 0x454(0x04)
	float LedgeCheckThreshold; // 0x458(0x04)
	float JumpOutOfWaterPitch; // 0x45c(0x04)
	struct F*722e4d89eb CurrentFloor; // 0x460(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4f8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4f9(0x01)
	enum class EMovementMode *7f8d102d5b; // 0x4fa(0x01)
	char pad_4FB[0x1]; // 0x4fb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityX : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityY : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4fc(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4fc(0x01)
	char bJustTeleported : 1; // 0x4fc(0x01)
	char *4daca329e5 : 1; // 0x4fc(0x01)
	char *6c90dcabf5 : 1; // 0x4fc(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4fd(0x01)
	char bNotifyApex : 1; // 0x4fd(0x01)
	char *10ced04b9c : 1; // 0x4fd(0x01)
	char bWantsToCrouch : 1; // 0x4fd(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4fd(0x01)
	char pad_4FD_5 : 3; // 0x4fd(0x01)
	char pad_4FE[0x2]; // 0x4fe(0x02)
	enum class EStanceMode StanceMode; // 0x500(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x501(0x01)
	char pad_502[0x2]; // 0x502(0x02)
	char bIgnoreBaseRotation : 1; // 0x504(0x01)
	char *38aadbe468 : 1; // 0x504(0x01)
	char bAlwaysCheckFloor : 1; // 0x504(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x504(0x01)
	char *e2a28f8307 : 1; // 0x504(0x01)
	char *d68f5f981a : 1; // 0x504(0x01)
	char bUseRVOAvoidance : 1; // 0x504(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x504(0x01)
	char pad_505[0xf]; // 0x505(0x0f)
	char *7b3f475677 : 1; // 0x514(0x01)
	char *104ee2c836 : 1; // 0x514(0x01)
	char *628968668d : 1; // 0x514(0x01)
	char pad_514_3 : 2; // 0x514(0x01)
	char bProjectNavMeshWalking : 1; // 0x514(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x514(0x01)
	char pad_514_7 : 1; // 0x514(0x01)
	char pad_515[0x13]; // 0x515(0x13)
	float AvoidanceConsiderationRadius; // 0x528(0x04)
	struct FVector *065ad3559c; // 0x52c(0x0c)
	int32 AvoidanceUID; // 0x538(0x04)
	struct F*056e48c16d AvoidanceGroup; // 0x53c(0x04)
	struct F*056e48c16d GroupsToAvoid; // 0x540(0x04)
	struct F*056e48c16d GroupsToIgnore; // 0x544(0x04)
	float AvoidanceWeight; // 0x548(0x04)
	struct FVector *2a911bb8e7; // 0x54c(0x0c)
	char pad_558[0xa8]; // 0x558(0xa8)
	float NavMeshProjectionInterval; // 0x600(0x04)
	float *d098fcb6a4; // 0x604(0x04)
	float NavMeshProjectionInterpSpeed; // 0x608(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x60c(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x610(0x04)
	float NavWalkingFloorDistTolerance; // 0x614(0x04)
	char pad_618[0xb0]; // 0x618(0xb0)
	struct F*76138ff06a *9a60267788; // 0x6c8(0x58)
	char pad_720[0x10]; // 0x720(0x10)
	float *22fd1c7889; // 0x730(0x04)
	char pad_734[0x4]; // 0x734(0x04)
	struct FRootMotionSourceGroup *0568a1fe71; // 0x738(0x100)
	char pad_838[0x98]; // 0x838(0x98)
	struct F*627659f0e8 *add4ad8474; // 0x8d0(0x40)
	struct FVector *c3deac0730; // 0x910(0x0c)
	bool *2c10e261b6; // 0x91c(0x01)
	char pad_91D[0x3]; // 0x91d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x920(0x01)
	char pad_920_1 : 7; // 0x920(0x01)
	char pad_921[0xf]; // 0x921(0x0f)

	struct F*056e48c16d *9fd6ee3699(); // Function Engine.CharacterMovementComponent.*9fd6ee3699 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64eefbc
	float *658ba87d09(); // Function Engine.CharacterMovementComponent.*658ba87d09 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0840
	bool *0c76887b2d(); // Function Engine.CharacterMovementComponent.*0c76887b2d // Final|Native|Public|BlueprintCallable // @ game+0x64eee9c
	float *2dac781daa(); // Function Engine.CharacterMovementComponent.*2dac781daa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2610
	float *fe0be86a58(); // Function Engine.CharacterMovementComponent.*fe0be86a58 // Final|Native|Public|BlueprintCallable // @ game+0x64f4b48
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x64d9ed8
	struct FVector AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d3bb0
	struct FVector *6c8dd965b4(); // Function Engine.CharacterMovementComponent.*6c8dd965b4 // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x64f4d54
	struct F*722e4d89eb *94f636ce1d(); // Function Engine.CharacterMovementComponent.*94f636ce1d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6310
	float *0452b20aef(); // Function Engine.CharacterMovementComponent.*0452b20aef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6a48
	struct FHitResult CapsuleTouched(); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x64d5b24
	float *7f595838bc(); // Function Engine.CharacterMovementComponent.*7f595838bc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcb98
	struct ACharacter* *53963c7cc3(); // Function Engine.CharacterMovementComponent.*53963c7cc3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd88c
	bool AddImpulse(); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d41f4
	int32 *147ef7dd14(); // Function Engine.CharacterMovementComponent.*147ef7dd14 // Final|Native|Public|BlueprintCallable // @ game+0x64eef30
	float *13f0640241(); // Function Engine.CharacterMovementComponent.*13f0640241 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e6868
	struct F*056e48c16d *a29777516d(); // Function Engine.CharacterMovementComponent.*a29777516d // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f15c0
	struct FVector *07353d85d0(); // Function Engine.CharacterMovementComponent.*07353d85d0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de514
	struct UPrimitiveComponent* *91171cfb26(); // Function Engine.CharacterMovementComponent.*91171cfb26 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e09f8
	float *7189be6350(); // Function Engine.CharacterMovementComponent.*7189be6350 // Final|Native|Public|BlueprintCallable // @ game+0x64f345c
	bool *e9bb4bf72b(); // Function Engine.CharacterMovementComponent.*e9bb4bf72b // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e39b4
	float *1824662e69(); // Function Engine.CharacterMovementComponent.*1824662e69 // Native|Public|BlueprintCallable // @ game+0x64d5720
	float *e7264375ff(); // Function Engine.CharacterMovementComponent.*e7264375ff // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57e54bc
	int32 *d87d4eadbf(); // Function Engine.CharacterMovementComponent.*d87d4eadbf // Final|Native|Public|BlueprintCallable // @ game+0x64f1534
	int32 *e20c938d2b(); // Function Engine.CharacterMovementComponent.*e20c938d2b // Final|Native|Public|BlueprintCallable // @ game+0x64f165c
	struct F*722e4d89eb *fff693c5d1(); // Function Engine.CharacterMovementComponent.*fff693c5d1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e5e6c
	float *f34d54f218(); // Function Engine.CharacterMovementComponent.*f34d54f218 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e086c
	float *52493b55a9(); // Function Engine.CharacterMovementComponent.*52493b55a9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0898
	float *6b112f30eb(); // Function Engine.CharacterMovementComponent.*6b112f30eb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e16d4
	struct F*056e48c16d *c321d72587(); // Function Engine.CharacterMovementComponent.*c321d72587 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f16e8
	float *6910913444(); // Function Engine.CharacterMovementComponent.*6910913444 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57a21a8
	float *d855a114c2(); // Function Engine.CharacterMovementComponent.*d855a114c2 // Final|Native|Public|BlueprintCallable // @ game+0x64f4ab0
	struct FVector *10628ed3f7(); // Function Engine.CharacterMovementComponent.*10628ed3f7 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64df444
	bool *9f0cb1dccd(); // Function Engine.CharacterMovementComponent.*9f0cb1dccd // Native|Public|BlueprintCallable // @ game+0x64f28b4
	void *3040c850fd(); // Function Engine.CharacterMovementComponent.*3040c850fd // Native|Public|BlueprintCallable // @ game+0x5344fc
	bool *ee2c7d3fc7(); // Function Engine.CharacterMovementComponent.*ee2c7d3fc7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3590
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintFunctionLibrary : UObject {

	struct FStringAssetReference MakeStringAssetReference(); // Function Engine.BlueprintFunctionLibrary.MakeStringAssetReference // Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x6529d74
};

// Class Engine.StaticMeshActor
// Size: 0x400 (Inherited: 0x3f0)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3f0(0x08)
	bool bStaticMeshReplicateMovement; // 0x3f8(0x01)
	enum class ENavDataGatheringMode *c609dcac1c; // 0x3f9(0x01)
	char pad_3FA[0x6]; // 0x3fa(0x06)
};

// Class Engine.HUD
// Size: 0x4d8 (Inherited: 0x3f0)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x3f0(0x08)
	char bLostFocusPaused : 1; // 0x3f8(0x01)
	char bShowHUD : 1; // 0x3f8(0x01)
	char bShowDebugInfo : 1; // 0x3f8(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x3f8(0x01)
	char bShowOverlays : 1; // 0x3f8(0x01)
	char bEnableDebugTextShadow : 1; // 0x3f8(0x01)
	char pad_3F8_6 : 2; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct TArray<struct AActor*> *ebd7d5061f; // 0x400(0x10)
	char pad_410[0x8]; // 0x410(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x418(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x428(0x10)
	struct UCanvas* Canvas; // 0x438(0x08)
	struct UCanvas* *0d29f139dd; // 0x440(0x08)
	struct TArray<struct F*3211ef0a69> *ecb7863718; // 0x448(0x10)
	struct UClass* *08814e006a; // 0x458(0x08)
	struct AActor* *af2f44f80d; // 0x460(0x08)
	char pad_468[0x70]; // 0x468(0x70)

	struct FName ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x64f4e00
	bool *230588c472(); // Function Engine.HUD.*230588c472 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dadf0
	bool *79b5cb8643(); // Function Engine.HUD.*79b5cb8643 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d373c
	struct FLinearColor *20afb725bc(); // Function Engine.HUD.*20afb725bc // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64da8a4
	struct FVector Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ea8b0
	float *237a6ec72d(); // Function Engine.HUD.*237a6ec72d // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e20c8
	struct FVector2D *c58acecd13(); // Function Engine.HUD.*c58acecd13 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64da1c4
	struct FName ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct APlayerController* *7eacfe0be3(); // Function Engine.HUD.*7eacfe0be3 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5805f80
	bool *8859b9196f(); // Function Engine.HUD.*8859b9196f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x64dc76c
	struct APawn* *1ac67b0b0c(); // Function Engine.HUD.*1ac67b0b0c // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x64e13a4
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0xd8afb0
	struct FName ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1dcd78
	float *d94ebbc912(); // Function Engine.HUD.*d94ebbc912 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dac14
	void *a86621049b(); // Function Engine.HUD.*a86621049b // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x64eab58
	bool *243680367d(); // Function Engine.HUD.*243680367d // Final|Native|Public|BlueprintCallable // @ game+0x64db5b8
	struct FVector Deproject(); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64d9884
	bool *6f61339728(); // Function Engine.HUD.*6f61339728 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x64ead0c
	struct FName ShowDebugToggleSubCategory(); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x64f4f54
	int32 AddHitBox(); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d402c
	struct UClass* ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x64f4e94
	float *00ad7eb6f8(); // Function Engine.HUD.*00ad7eb6f8 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d9f98
	struct FVector2D DrawTexture(); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64db0a8
	struct FName ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct FName ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1dcd78
	int32 ReceiveDrawHUD(); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool *71be62ac5d(); // Function Engine.HUD.*71be62ac5d // Final|Native|Public|BlueprintCallable // @ game+0x64da62c
};

// Class Engine.Brush
// Size: 0x428 (Inherited: 0x3f0)
struct ABrush : AActor {
	enum class *6e8770e217 *e507f4dc1d; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	struct FColor BrushColor; // 0x3f4(0x04)
	int32 PolyFlags; // 0x3f8(0x04)
	char *41f7cd1aa2 : 1; // 0x3fc(0x01)
	char *dec024378d : 1; // 0x3fc(0x01)
	char *9d800fe794 : 1; // 0x3fc(0x01)
	char *a42f9041c9 : 1; // 0x3fc(0x01)
	char pad_3FC_4 : 4; // 0x3fc(0x01)
	char pad_3FD[0x3]; // 0x3fd(0x03)
	struct UModel* Brush; // 0x400(0x08)
	struct UBrushComponent* BrushComponent; // 0x408(0x08)
	char *9daf5965a3 : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct TArray<struct F*9c7d57f967> *3c19074f41; // 0x418(0x10)
};

// Class Engine.Volume
// Size: 0x428 (Inherited: 0x428)
struct AVolume : ABrush {
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotify : UObject {
	char pad_30[0x10]; // 0x30(0x10)

	bool Received_Notify(); // Function Engine.AnimNotify.Received_Notify // Event|Public|BlueprintEvent|Const // @ game+0x1dcd78
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x64e0c68
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	char pad_60[0x10]; // 0x60(0x10)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	bool Received_NotifyTick(); // Function Engine.AnimNotifyState.Received_NotifyTick // Event|Public|BlueprintEvent|Const // @ game+0x1dcd78
	bool Received_NotifyBegin(); // Function Engine.AnimNotifyState.Received_NotifyBegin // Event|Public|BlueprintEvent|Const // @ game+0x1dcd78
	bool Received_NotifyEnd(); // Function Engine.AnimNotifyState.Received_NotifyEnd // Event|Public|BlueprintEvent|Const // @ game+0x1dcd78
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x64e0c68
};

// Class Engine.DataTable
// Size: 0x88 (Inherited: 0x30)
struct UDataTable : UObject {
	struct UScriptStruct* *6a0e474767; // 0x30(0x08)
	char pad_38[0x50]; // 0x38(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x450)
struct ACharacter : APawn {
	float *8282d7bae1; // 0x450(0x04)
	int32 JumpCurrentCount; // 0x454(0x04)
	struct UCharacterMovementComponent* CharacterMovement; // 0x458(0x08)
	bool *a08ccf36b9; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct UCapsuleComponent* CapsuleComponent; // 0x468(0x08)
	struct F*fdb76a0b2f *35d4fdbf05; // 0x470(0x48)
	bool *5487c0eb5a; // 0x4b8(0x01)
	char pad_4B9[0x3]; // 0x4b9(0x03)
	struct FVector *9503c1703e; // 0x4bc(0x0c)
	struct F*fdb76a0b2f *3aef46cc56; // 0x4c8(0x48)
	float JumpKeyHoldTime; // 0x510(0x04)
	char pad_514[0x4]; // 0x514(0x04)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x518(0x08)
	struct FQuat *9a1399a27e; // 0x520(0x10)
	int32 JumpMaxCount; // 0x530(0x04)
	float CrouchedEyeHeight; // 0x534(0x04)
	char bIsCrouched : 1; // 0x538(0x01)
	char pad_538_1 : 7; // 0x538(0x01)
	char pad_539[0x7]; // 0x539(0x07)
	struct USkeletalMeshComponent* Mesh; // 0x540(0x08)
	float JumpMaxHoldTime; // 0x548(0x04)
	float *2cfd1e1c0a; // 0x54c(0x04)
	char bPressedJump : 1; // 0x550(0x01)
	char *b6ecb6139d : 1; // 0x550(0x01)
	char *f24257721c : 1; // 0x550(0x01)
	char *7c13366d17 : 1; // 0x550(0x01)
	char *4fb6a4f581 : 1; // 0x550(0x01)
	char *6e32dcbd7c : 1; // 0x550(0x01)
	char *1330ddef84 : 1; // 0x550(0x01)
	char *4c2b4c8150 : 1; // 0x550(0x01)
	char bWasJumping : 1; // 0x551(0x01)
	char pad_551_1 : 7; // 0x551(0x01)
	char pad_552[0x6]; // 0x552(0x06)
	struct FMulticastDelegate OnReachedJumpApex; // 0x558(0x10)
	char pad_568[0x10]; // 0x568(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x578(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x588(0x10)
	struct FRootMotionSourceGroup *9e3b80c0bc; // 0x598(0x100)
	char pad_698[0x8]; // 0x698(0x08)
	struct F*627659f0e8 *f3302eb91e; // 0x6a0(0x40)
	struct TArray<struct F*9758e900e3> *2f15cfb895; // 0x6e0(0x10)
	struct F*a9dde184de *ed92183131; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	bool *c843ca3e4f(); // Function Engine.Character.*c843ca3e4f // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ec23c
	void *8a872d2897(); // Function Engine.Character.*8a872d2897 // Native|Public|BlueprintCallable // @ game+0x64f5ae8
	bool *8370e81c2a(); // Function Engine.Character.*8370e81c2a // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0xae9360
	float K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x64e9944
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x64d5a0c
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x61b4fc
	bool ServerMove(); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64eb8c0
	bool *82a7fc0378(); // Function Engine.Character.*82a7fc0378 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e37d8
	bool OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x1dcd78
	float *2ffe47f2b1(); // Function Engine.Character.*2ffe47f2b1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcbb0
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x64e3a8c
	float OnWalkingOffLedge(); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xcb0a74
	float ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x930fc8
	float *972000ab2b(); // Function Engine.Character.*972000ab2b // Native|Public|BlueprintCallable // @ game+0x64e9f58
	void *b4b3ca13a4(); // Function Engine.Character.*b4b3ca13a4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xc9e8a8
	bool *925fe8d3ea(); // Function Engine.Character.*925fe8d3ea // Native|Public|BlueprintCallable // @ game+0x64f3814
	struct UAnimMontage* *b84654cf54(); // Function Engine.Character.*b84654cf54 // Final|Native|Public|BlueprintCallable // @ game+0x64de53c
	struct FRotator *6d4709a5ef(); // Function Engine.Character.*6d4709a5ef // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcd78
	bool *edfb88bd75(); // Function Engine.Character.*edfb88bd75 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64d6120
	bool *9deef22338(); // Function Engine.Character.*9deef22338 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ec7bc
	struct FVector *8b6d00d4e5(); // Function Engine.Character.*8b6d00d4e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5774c6c
	struct FRotator *5c525c793d(); // Function Engine.Character.*5c525c793d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64d5614
	float K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct FHitResult OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x1dcd78
	bool LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64e8df4
	bool *a7355a3acf(); // Function Engine.Character.*a7355a3acf // Native|Public|BlueprintCallable // @ game+0x64f5f8c
	bool CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64d59e8
	bool *a56b7b5859(); // Function Engine.Character.*a56b7b5859 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ebcbc
	bool *21c34738dd(); // Function Engine.Character.*21c34738dd // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ecfc8
	bool K2_OnMovementModeChanged(); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x64d97a0
	bool *403a59b916(); // Function Engine.Character.*403a59b916 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64d64b4
	bool *2168d1ee10(); // Function Engine.Character.*2168d1ee10 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64d8a74
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x57a90e4
	bool *bfd2003b09(); // Function Engine.Character.*bfd2003b09 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e37b4
	void *bf5bca255c(); // Function Engine.Character.*bf5bca255c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x572032c
	float K2_OnStartCrouch(); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct UAnimMontage* *59137a9491(); // Function Engine.Character.*59137a9491 // Native|Public|BlueprintCallable // @ game+0x64f57dc
	bool *b10d651cf7(); // Function Engine.Character.*b10d651cf7 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ecc84
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x577cf1c
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2e04
	void *e33839d558(); // Function Engine.Character.*e33839d558 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x580d534
};

// Class Engine.Controller
// Size: 0x478 (Inherited: 0x3f0)
struct AController : AActor {
	char pad_3F0[0x10]; // 0x3f0(0x10)
	struct USceneComponent* TransformComponent; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)
	struct ACharacter* Character; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct APlayerState* PlayerState; // 0x420(0x08)
	struct FName StateName; // 0x428(0x08)
	char pad_430[0x14]; // 0x430(0x14)
	char *2037508fdb : 1; // 0x444(0x01)
	char *e4df4b351c : 1; // 0x444(0x01)
	char pad_444_2 : 6; // 0x444(0x01)
	char pad_445[0xb]; // 0x445(0x0b)
	struct APawn* Pawn; // 0x450(0x08)
	struct FRotator *86cbcf5377; // 0x458(0x0c)
	char pad_464[0x4]; // 0x464(0x04)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x468(0x10)

	struct FRotator *5029bb8f19(); // Function Engine.Controller.*5029bb8f19 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d7e8c
	bool *6b9f58d27f(); // Function Engine.Controller.*6b9f58d27f // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e9078
	bool *962f4aad33(); // Function Engine.Controller.*962f4aad33 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x93b2b4
	bool *a0460f48ea(); // Function Engine.Controller.*a0460f48ea // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e33dc
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x64f5b00
	bool *aff2b06803(); // Function Engine.Controller.*aff2b06803 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3798
	struct FRotator GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de088
	bool *ab6c7d5021(); // Function Engine.Controller.*ab6c7d5021 // Native|Public|BlueprintCallable // @ game+0x64f19a8
	struct APlayerController* *545f74ebe7(); // Function Engine.Controller.*545f74ebe7 // Final|Native|Public|BlueprintCallable // @ game+0x64d5d78
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x70c8cc
	struct AActor* ReceiveInstigatedAnyDamage(); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x1dcd78
	bool *05c9ee399f(); // Function Engine.Controller.*05c9ee399f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3518
	struct APawn* K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e68c0
	struct FRotator *dfeb0b0e7e(); // Function Engine.Controller.*dfeb0b0e7e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64f0858
	bool *c01988db06(); // Function Engine.Controller.*c01988db06 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e33b4
	void *4f8918160c(); // Function Engine.Controller.*4f8918160c // Native|Public|BlueprintCallable // @ game+0x64eafc0
	struct FRotator *b10cb0e752(); // Function Engine.Controller.*b10cb0e752 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de630
	bool *acd547e5d2(); // Function Engine.Controller.*acd547e5d2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3420
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x58036e8
	bool *3e765612de(); // Function Engine.Controller.*3e765612de // Native|Public|BlueprintCallable // @ game+0x57a7384
	struct AActor* *869d9be173(); // Function Engine.Controller.*869d9be173 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2814
	struct APawn* Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x575a098
	void *4405c697bf(); // Function Engine.Controller.*4405c697bf // Native|Public|BlueprintCallable // @ game+0x64eafa8
	void *116e3e6556(); // Function Engine.Controller.*116e3e6556 // Native|Public|BlueprintCallable // @ game+0x64f6024
	void *7315ed88c4(); // Function Engine.Controller.*7315ed88c4 // Native|Public|BlueprintCallable // @ game+0xc526f8
};

// Class Engine.SpringArmComponent
// Size: 0x500 (Inherited: 0x480)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x478(0x04)
	struct FVector SocketOffset; // 0x47c(0x0c)
	struct FVector TargetOffset; // 0x488(0x0c)
	float ProbeSize; // 0x494(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x498(0x01)
	char bDoCollisionTest : 1; // 0x49c(0x01)
	char bUsePawnControlRotation : 1; // 0x49c(0x01)
	char bInheritPitch : 1; // 0x49c(0x01)
	char bInheritYaw : 1; // 0x49c(0x01)
	char bInheritRoll : 1; // 0x49c(0x01)
	char bLockPitchLag : 1; // 0x49c(0x01)
	char bLockYawLag : 1; // 0x49c(0x01)
	char bLockRollLag : 1; // 0x49c(0x01)
	char bEnableCameraLag : 1; // 0x49d(0x01)
	char bEnableCameraRotationLag : 1; // 0x49d(0x01)
	char bUseCameraLagSubstepping : 1; // 0x49d(0x01)
	char bDrawDebugLagMarkers : 1; // 0x49d(0x01)
	float CameraLagSpeed; // 0x4a0(0x04)
	float CameraRotationLagSpeed; // 0x4a4(0x04)
	float CameraLagMaxTimeStep; // 0x4a8(0x04)
	float CameraLagMaxDistance; // 0x4ac(0x04)
	char pad_4B2[0x4e]; // 0x4b2(0x4e)
};

// Class Engine.PlayerController
// Size: 0x7b0 (Inherited: 0x478)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)
	struct APawn* *6a4cba1840; // 0x488(0x08)
	struct U*e3e1c98a8e* *ba4f6cd603; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)
	struct AHUD* *04081450f1; // 0x4a0(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x4a8(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4b0(0x08)
	bool *4ec6b44b0b; // 0x4b8(0x01)
	char pad_4B9[0x3]; // 0x4b9(0x03)
	struct FRotator TargetViewRotation; // 0x4bc(0x0c)
	char pad_4C8[0xc]; // 0x4c8(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4d4(0x04)
	struct TArray<struct AActor*> *1c7ef4d523; // 0x4d8(0x10)
	char pad_4E8[0x4]; // 0x4e8(0x04)
	float *ba0265b64d; // 0x4ec(0x04)
	struct FVector *1a41b5e739; // 0x4f0(0x0c)
	struct FRotator *86cb465afb; // 0x4fc(0x0c)
	int32 *44b280390c; // 0x508(0x04)
	char pad_50C[0x4]; // 0x50c(0x04)
	struct UCheatManager* CheatManager; // 0x510(0x08)
	struct UClass* CheatClass; // 0x518(0x08)
	struct UPlayerInput* PlayerInput; // 0x520(0x08)
	struct TArray<struct F*3715816a7a> *34d360a810; // 0x528(0x10)
	char pad_538[0x90]; // 0x538(0x90)
	char pad_5C8_0 : 3; // 0x5c8(0x01)
	char bPlayerIsWaiting : 1; // 0x5c8(0x01)
	char pad_5C8_4 : 4; // 0x5c8(0x01)
	char pad_5C9[0x3]; // 0x5c9(0x03)
	bool *81aa8c666f; // 0x5cc(0x01)
	char pad_5CD[0x3b]; // 0x5cd(0x3b)
	struct UNetConnection* *44f81e9eea; // 0x608(0x08)
	struct UNetConnection* NetConnection; // 0x610(0x08)
	char pad_618[0xc]; // 0x618(0x0c)
	float InputYawScale; // 0x624(0x04)
	float InputPitchScale; // 0x628(0x04)
	float InputRollScale; // 0x62c(0x04)
	char bShowMouseCursor : 1; // 0x630(0x01)
	char bEnableClickEvents : 1; // 0x630(0x01)
	char bEnableTouchEvents : 1; // 0x630(0x01)
	char bEnableMouseOverEvents : 1; // 0x630(0x01)
	char bEnableTouchOverEvents : 1; // 0x630(0x01)
	char bForceFeedbackEnabled : 1; // 0x630(0x01)
	char pad_630_6 : 2; // 0x630(0x01)
	char pad_631[0x7]; // 0x631(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x638(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x648(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x649(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x64a(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x64b(0x01)
	float HitResultTraceDistance; // 0x64c(0x04)
	char pad_650[0x80]; // 0x650(0x80)
	struct U*37a897c2a6* *306ff6bcbf; // 0x6d0(0x08)
	char pad_6D8_0 : 3; // 0x6d8(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6d8(0x01)
	char pad_6D8_4 : 4; // 0x6d8(0x01)
	char pad_6D9[0x17]; // 0x6d9(0x17)
	struct UTouchInterface* *df1d787aeb; // 0x6f0(0x08)
	char pad_6F8[0x40]; // 0x6f8(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x738(0x08)
	struct FVector SpawnLocation; // 0x740(0x0c)
	char pad_74C[0x4]; // 0x74c(0x04)
	bool *87b6227a52; // 0x750(0x01)
	char pad_751[0x1]; // 0x751(0x01)
	uint16 *efcb195a25; // 0x752(0x02)
	uint16 *d04a484e7d; // 0x754(0x02)
	char pad_756[0x2]; // 0x756(0x02)
	struct AActor* *f63237023a; // 0x758(0x08)
	struct AActor* *d886600ea5; // 0x760(0x08)
	char pad_768[0x48]; // 0x768(0x48)

	bool *ab46466854(); // Function Engine.PlayerController.*ab46466854 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d6c0c
	int32 *c9154578aa(); // Function Engine.PlayerController.*c9154578aa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d7634
	struct FString LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x64e91bc
	bool ServerUpdateLevelVisibility(); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6969f0
	bool *559f3a7288(); // Function Engine.PlayerController.*559f3a7288 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d7b8c
	int32 *662f19b64b(); // Function Engine.PlayerController.*662f19b64b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d7d64
	struct FName *51bb1b7e14(); // Function Engine.PlayerController.*51bb1b7e14 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ed290
	struct FUniqueNetIdRepl *d865da1570(); // Function Engine.PlayerController.*d865da1570 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d889c
	bool *b761367baa(); // Function Engine.PlayerController.*b761367baa // Native|Public|BlueprintCallable // @ game+0x64f4a18
	int32 *f9de26ecaa(); // Function Engine.PlayerController.*f9de26ecaa // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e283c
	float *7c562762e1(); // Function Engine.PlayerController.*7c562762e1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8334
	void *c859b2be62(); // Function Engine.PlayerController.*c859b2be62 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d6998
	bool *6a2f785a50(); // Function Engine.PlayerController.*6a2f785a50 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x64d8170
	struct FString SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x64f2994
	struct FName *9d5e26bec5(); // Function Engine.PlayerController.*9d5e26bec5 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x64d8254
	struct AHUD* *4468a93312(); // Function Engine.PlayerController.*4468a93312 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc43f78
	bool *b485fdf911(); // Function Engine.PlayerController.*b485fdf911 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64f61cc
	bool *c24283339d(); // Function Engine.PlayerController.*c24283339d // Final|Native|Public|BlueprintCallable // @ game+0x64ea72c
	float *ae6aff6c58(); // Function Engine.PlayerController.*ae6aff6c58 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64df650
	struct FName *13b471381b(); // Function Engine.PlayerController.*13b471381b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xc27108
	void *86157f4703(); // Function Engine.PlayerController.*86157f4703 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ed574
	struct FString SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x64f5c28
	struct FName *08dee7b7b4(); // Function Engine.PlayerController.*08dee7b7b4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcb09f4
	struct FRotator *5d0a47f76b(); // Function Engine.PlayerController.*5d0a47f76b // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x64d6f28
	struct FString *dd4eed6524(); // Function Engine.PlayerController.*dd4eed6524 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eb740
	void *92eb1c672a(); // Function Engine.PlayerController.*92eb1c672a // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ed528
	bool *97866029a2(); // Function Engine.PlayerController.*97866029a2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64ded9c
	struct FText *8c147ac969(); // Function Engine.PlayerController.*8c147ac969 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d8d58
	struct UCameraAnim* *d418e4d62b(); // Function Engine.PlayerController.*d418e4d62b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d80dc
	struct UObject* *acfb0a2a60(); // Function Engine.PlayerController.*acfb0a2a60 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d77c0
	void *78fabe42dc(); // Function Engine.PlayerController.*78fabe42dc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d80c4
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x57167f8
	struct FVector *4d8a0fc0f4(); // Function Engine.PlayerController.*4d8a0fc0f4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64e00f4
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x64eb004
	enum class EControllerHand *9de9eaecfe(); // Function Engine.PlayerController.*9de9eaecfe // Final|Native|Public|BlueprintCallable // @ game+0x64f1784
	bool *bbdb1bd24f(); // Function Engine.PlayerController.*bbdb1bd24f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ed708
	struct FUniqueNetIdRepl *43c33d58dd(); // Function Engine.PlayerController.*43c33d58dd // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ed814
	struct FName Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x64d58ac
	float *403bdd06e1(); // Function Engine.PlayerController.*403bdd06e1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d6ca4
	bool *c0318a1033(); // Function Engine.PlayerController.*c0318a1033 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dea74
	float *2d0548b040(); // Function Engine.PlayerController.*2d0548b040 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64df55c
	struct ASpectatorPawn* *adf056a575(); // Function Engine.PlayerController.*adf056a575 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2010
	void *bf4dab2329(); // Function Engine.PlayerController.*bf4dab2329 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d7b74
	struct UClass* *4fb67236ed(); // Function Engine.PlayerController.*4fb67236ed // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x64d8030
	bool *2ebb436600(); // Function Engine.PlayerController.*2ebb436600 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d74fc
	float AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x64d4a98
	void *795eba9f52(); // Function Engine.PlayerController.*795eba9f52 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ed7c8
	bool *d30eb8d01c(); // Function Engine.PlayerController.*d30eb8d01c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d7f98
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x64e9b50
	bool *8a4a5b5e1e(); // Function Engine.PlayerController.*8a4a5b5e1e // Net|NetReliableNative|Event|Public|NetClient // @ game+0xa106c0
	bool *61f8c21999(); // Function Engine.PlayerController.*61f8c21999 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e08f0
	struct FRotator *64beea8065(); // Function Engine.PlayerController.*64beea8065 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ee994
	void *0ef1f5ec13(); // Function Engine.PlayerController.*0ef1f5ec13 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d69c8
	void *1b5a3aa90c(); // Function Engine.PlayerController.*1b5a3aa90c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d69e0
	struct TArray<struct F*a13a530379> *56bb0f1181(); // Function Engine.PlayerController.*56bb0f1181 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d89b8
	void *dfe66674ee(); // Function Engine.PlayerController.*dfe66674ee // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d69f8
	bool *da0857f36b(); // Function Engine.PlayerController.*da0857f36b // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64debe4
	bool *7a4fd55871(); // Function Engine.PlayerController.*7a4fd55871 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64de904
	bool *23845e204c(); // Function Engine.PlayerController.*23845e204c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e32c0
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x57f4d0c
	struct FRotator *cf2959b8be(); // Function Engine.PlayerController.*cf2959b8be // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x64ed5c0
	struct APawn* ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x709a98
	struct FUniqueNetIdRepl *e1ca3da977(); // Function Engine.PlayerController.*e1ca3da977 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64ed130
	void *52b71b8a9e(); // Function Engine.PlayerController.*52b71b8a9e // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x64d69b0
	int32 *c4ae2f176a(); // Function Engine.PlayerController.*c4ae2f176a // Net|NetReliableNative|Event|Public|NetClient // @ game+0x796e60
	struct UObject* *1b6c599c99(); // Function Engine.PlayerController.*1b6c599c99 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d7988
	void *97ee96fbb0(); // Function Engine.PlayerController.*97ee96fbb0 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xd883b4
	void *e3d2d62e3b(); // Function Engine.PlayerController.*e3d2d62e3b // Final|Native|Public|BlueprintCallable // @ game+0x64d5f6c
	float *cd0ed7643e(); // Function Engine.PlayerController.*cd0ed7643e // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x64d7378
	struct FColor *bd7480c73b(); // Function Engine.PlayerController.*bd7480c73b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f08cc
	void *5853422cfa(); // Function Engine.PlayerController.*5853422cfa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64eb828
	struct FString *5fca0030f8(); // Function Engine.PlayerController.*5fca0030f8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d7ab0
	float *b5eb53ad0e(); // Function Engine.PlayerController.*b5eb53ad0e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfa7c
	struct F*19a0b3e5a0 *b3c21183d2(); // Function Engine.PlayerController.*b3c21183d2 // Final|Native|Public|BlueprintCallable // @ game+0x64ea420
	bool *35919963a5(); // Function Engine.PlayerController.*35919963a5 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64df0fc
	float *68dfc2b6f7(); // Function Engine.PlayerController.*68dfc2b6f7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfd38
	struct UTouchInterface* *b2390ab0a2(); // Function Engine.PlayerController.*b2390ab0a2 // Native|Public|BlueprintCallable // @ game+0x64d324c
	void *d2e6055c43(); // Function Engine.PlayerController.*d2e6055c43 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5720c38
	enum class EControllerHand *1c9682404c(); // Function Engine.PlayerController.*1c9682404c // Final|Native|Public|BlueprintCallable // @ game+0x64f5a50
	struct FName *7cab1cf9db(); // Function Engine.PlayerController.*7cab1cf9db // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eb68c
	struct FGuid *6025a956b9(); // Function Engine.PlayerController.*6025a956b9 // Final|Native|Public|HasDefaults // @ game+0x64d84f0
	int32 *efcf0317d0(); // Function Engine.PlayerController.*efcf0317d0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcab1fc
	float FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x64db9ac
	bool ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x64f5db8
	struct FRotator *16669cfe05(); // Function Engine.PlayerController.*16669cfe05 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0xc0776c
	void *5fce39e8de(); // Function Engine.PlayerController.*5fce39e8de // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64edbe4
	bool *827ed06000(); // Function Engine.PlayerController.*827ed06000 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64ea970
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x64d986c
	bool *0a98009ba2(); // Function Engine.PlayerController.*0a98009ba2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d6b74
	void *5350f7c24f(); // Function Engine.PlayerController.*5350f7c24f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64edb98
	bool *b66b4cd46b(); // Function Engine.PlayerController.*b66b4cd46b // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64def4c
	bool *04a52a0e21(); // Function Engine.PlayerController.*04a52a0e21 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64f62c0
	bool *eb438dd755(); // Function Engine.PlayerController.*eb438dd755 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfe3c
	int32 *703938c013(); // Function Engine.PlayerController.*703938c013 // Final|Native|Public|BlueprintCallable // @ game+0x64f2744
	bool StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x64f540c
	struct FGuid *affae98f27(); // Function Engine.PlayerController.*affae98f27 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d86c4
	float *0ef46105ab(); // Function Engine.PlayerController.*0ef46105ab // Net|Native|Event|Public|NetClient // @ game+0x64d7254
	void *4706b0dd25(); // Function Engine.PlayerController.*4706b0dd25 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xd9088c
	struct F*ac0997d4df *68263df898(); // Function Engine.PlayerController.*68263df898 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64edc7c
	bool *cf9e5e1026(); // Function Engine.PlayerController.*cf9e5e1026 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d6a90
	bool *94de0543e5(); // Function Engine.PlayerController.*94de0543e5 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x64d5fdc
	bool *d629fba752(); // Function Engine.PlayerController.*d629fba752 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64e9ab8
	float *b8a2b9a959(); // Function Engine.PlayerController.*b8a2b9a959 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64df798
	bool *4378cb5b7b(); // Function Engine.PlayerController.*4378cb5b7b // Native|Public|BlueprintCallable // @ game+0x64f4850
	bool *0cb5679844(); // Function Engine.PlayerController.*0cb5679844 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64d9b20
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x57aa7c8
	float AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x64d4edc
	int32 ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64ed974
	void *60d2f2e83e(); // Function Engine.PlayerController.*60d2f2e83e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d6a78
	struct F*ac0997d4df *3e63e83084(); // Function Engine.PlayerController.*3e63e83084 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xb8cedc
	struct FUniqueNetIdRepl *26ecccb14e(); // Function Engine.PlayerController.*26ecccb14e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d6e0c
	struct APawn* ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x64d7a1c
	struct APawn* *86c5638054(); // Function Engine.PlayerController.*86c5638054 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xc8eee0
	void *b41ac62737(); // Function Engine.PlayerController.*b41ac62737 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64eb874
	bool DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64d9a18
	void *bd105c49d6(); // Function Engine.PlayerController.*bd105c49d6 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x64edc30
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x64db78c
	bool *42c23c4926(); // Function Engine.PlayerController.*42c23c4926 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xb758fc
	struct TArray<struct F*7c60183dc5> *4e8d0e40c4(); // Function Engine.PlayerController.*4e8d0e40c4 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x64edaa0
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x5811958
	struct FVector *1c4adf6d0b(); // Function Engine.PlayerController.*1c4adf6d0b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dfb70
	bool *278a1612b5(); // Function Engine.PlayerController.*278a1612b5 // Native|Public|BlueprintCallable // @ game+0x64eff34
	struct FString SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x64eb5c8
	struct FString *a0b0a56a1d(); // Function Engine.PlayerController.*a0b0a56a1d // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x95531c
	struct FKey ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x64d8ecc
	struct FVector *68eef5585b(); // Function Engine.PlayerController.*68eef5585b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de7d4
	struct FName *271d361b1b(); // Function Engine.PlayerController.*271d361b1b // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0xb0ecf8
	float AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x64d5304
};

// Class Engine.Info
// Size: 0x3f0 (Inherited: 0x3f0)
struct AInfo : AActor {
};

// Class Engine.GameModeBase
// Size: 0x490 (Inherited: 0x3f0)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x3f0(0x10)
	struct UClass* GameSessionClass; // 0x400(0x08)
	struct UClass* GameStateClass; // 0x408(0x08)
	struct UClass* PlayerControllerClass; // 0x410(0x08)
	struct UClass* PlayerStateClass; // 0x418(0x08)
	struct FStringClassReference HUDClass; // 0x420(0x10)
	struct UClass* DefaultPawnClass; // 0x430(0x08)
	struct FStringClassReference SpectatorClass; // 0x438(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x448(0x08)
	struct AGameSession* GameSession; // 0x450(0x08)
	struct AGameStateBase* GameState; // 0x458(0x08)
	struct FText *ea2300ff97; // 0x460(0x18)
	char bUseSeamlessTravel : 1; // 0x478(0x01)
	char bStartPlayersAsSpectators : 1; // 0x478(0x01)
	char bPauseable : 1; // 0x478(0x01)
	char pad_478_3 : 5; // 0x478(0x01)
	char pad_479[0x17]; // 0x479(0x17)

	int32 *54f66c09c1(); // Function Engine.GameModeBase.*54f66c09c1 // Native|Public|BlueprintCallable // @ game+0x64e0dc0
	bool PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0xa0ee8c
	bool *ff7bd76d7c(); // Function Engine.GameModeBase.*ff7bd76d7c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57a6744
	struct AActor* RestartPlayerAtPlayerStart(); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x64eb14c
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xbb2944
	bool *ef6066069a(); // Function Engine.GameModeBase.*ef6066069a // Native|Public|BlueprintCallable // @ game+0x64d5e08
	struct AController* RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x64eb0b8
	int32 *b5028fdf32(); // Function Engine.GameModeBase.*b5028fdf32 // Native|Public|BlueprintCallable // @ game+0x64e0ea4
	struct APlayerController* InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xd61bec
	struct APawn* SpawnDefaultPawnFor(); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xc77978
	bool MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xc63264
	struct AActor* FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xc317d8
	struct APlayerController* K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct AActor* ChoosePlayerStart(); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xc726c4
	bool CanSpectate(); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x64d5a34
	struct UClass* GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xc8b5b8
	struct APawn* SpawnDefaultPawnAtTransform(); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xcb4988
	struct APlayerController* HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0xa0ef4c
	struct AController* InitStartSpot(); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xd561d0
	struct AController* K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct FTransform RestartPlayerAtTransform(); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64eb22c
	bool K2_OnChangeName(); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct AActor* *86e3800e25(); // Function Engine.GameModeBase.*86e3800e25 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x64e6428
	struct APlayerController* K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x1dcd78
	struct AController* K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void *3d35c0366a(); // Function Engine.GameModeBase.*3d35c0366a // Native|Public|BlueprintCallable // @ game+0x64e9918
	bool ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x64eac64
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x580d260
};

// Class Engine.GameMode
// Size: 0x4d0 (Inherited: 0x490)
struct AGameMode : AGameModeBase {
	struct FName *fdf168a227; // 0x490(0x08)
	char bDelayedStart : 1; // 0x498(0x01)
	char pad_498_1 : 7; // 0x498(0x01)
	char pad_499[0x3]; // 0x499(0x03)
	int32 NumSpectators; // 0x49c(0x04)
	int32 NumPlayers; // 0x4a0(0x04)
	int32 NumBots; // 0x4a4(0x04)
	float MinRespawnDelay; // 0x4a8(0x04)
	int32 NumTravellingPlayers; // 0x4ac(0x04)
	struct UClass* *e51b494abc; // 0x4b0(0x08)
	struct TArray<struct APlayerState*> *076b29c2b9; // 0x4b8(0x10)
	float *05697249b5; // 0x4c8(0x04)
	bool bHandleDedicatedServerReplays; // 0x4cc(0x01)
	char pad_4CD[0x3]; // 0x4cd(0x03)

	bool *4fa79e4abc(); // Function Engine.GameMode.*4fa79e4abc // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3448
	void *59744331f1(); // Function Engine.GameMode.*59744331f1 // Native|Public|BlueprintCallable // @ game+0x64db980
	bool *b85bd19301(); // Function Engine.GameMode.*b85bd19301 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e29a8
	struct FName K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x1dcd78
	struct FString Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x64eb3f0
	void *45c451c13d(); // Function Engine.GameMode.*45c451c13d // Native|Public|BlueprintCallable // @ game+0x64eafec
	void *088224d128(); // Function Engine.GameMode.*088224d128 // Native|Public|BlueprintCallable // @ game+0x57a5740
	struct FName *9baee83b47(); // Function Engine.GameMode.*9baee83b47 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0520
	float SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x64ef058
	bool ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xcbf4f8
	void *558b992273(); // Function Engine.GameMode.*558b992273 // Native|Public|BlueprintCallable // @ game+0x64d31fc
	bool ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0xaac330
};

// Class Engine.PlayerState
// Size: 0x488 (Inherited: 0x3f0)
struct APlayerState : AInfo {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct FString PlayerName; // 0x3f8(0x10)
	char pad_408[0x10]; // 0x408(0x10)
	int32 StartTime; // 0x418(0x04)
	bool Ping; // 0x41c(0x01)
	char pad_41D[0x7]; // 0x41d(0x07)
	char bIsSpectator : 1; // 0x424(0x01)
	char *d7a1fd552e : 1; // 0x424(0x01)
	char bIsABot : 1; // 0x424(0x01)
	char pad_424_3 : 1; // 0x424(0x01)
	char *6304b8eff5 : 1; // 0x424(0x01)
	char *7c4d44b809 : 1; // 0x424(0x01)
	char pad_424_6 : 2; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	int32 PlayerId; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FString *7f441a13dc; // 0x430(0x10)
	float Score; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct UClass* *e51b494abc; // 0x448(0x08)
	struct FUniqueNetIdRepl UniqueId; // 0x450(0x18)
	char pad_468[0x18]; // 0x468(0x18)
	bool *93f72aa7fc; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)

	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x57c9afc
	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0xd8afb0
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x58036e8
	struct APlayerState* ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x1dcd78
	struct APlayerState* ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x1dcd78
	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x70c8cc
};

// Class Engine.SkeletalMeshActor
// Size: 0x478 (Inherited: 0x3f0)
struct ASkeletalMeshActor : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	char bShouldDoAnimNotifies : 1; // 0x3f8(0x01)
	char bWakeOnLevelStart : 1; // 0x3f8(0x01)
	char pad_3F8_2 : 6; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x400(0x08)
	struct USkeletalMesh* *cc378d83c0; // 0x408(0x08)
	struct UPhysicsAsset* *89fe11466c; // 0x410(0x08)
	struct UMaterialInterface* *1e7caac314; // 0x418(0x08)
	struct UMaterialInterface* *db45004a8f; // 0x420(0x08)
	char pad_428[0x50]; // 0x428(0x50)

	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x70c8cc
	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x57c9afc
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x58036e8
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0xd8afb0
};

// Class Engine.DestructibleComponent
// Size: 0xd10 (Inherited: 0xc50)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc48(0x01)
	struct TArray<struct F*096817792e> FractureEffects; // 0xc50(0x10)
	bool bEnableHardSleeping; // 0xc60(0x01)
	char pad_C61_1 : 7; // 0xc61(0x01)
	char pad_C62[0x2]; // 0xc62(0x02)
	float LargeChunkThreshold; // 0xc64(0x04)
	char pad_C68[0x10]; // 0xc68(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xc78(0x10)
	char pad_C88[0x88]; // 0xc88(0x88)

	struct UDestructibleMesh* *4676ce6de9(); // Function Engine.DestructibleComponent.*4676ce6de9 // Final|Native|Public|BlueprintCallable // @ game+0x653b3b0
	bool *339d88c256(); // Function Engine.DestructibleComponent.*339d88c256 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fd9fc
	struct UDestructibleMesh* *c55dc2289f(); // Function Engine.DestructibleComponent.*c55dc2289f // Final|Native|Public|BlueprintCallable // @ game+0x651572c
	float *150c20fc0e(); // Function Engine.DestructibleComponent.*150c20fc0e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fc800
};

// Class Engine.SaveGame
// Size: 0x30 (Inherited: 0x30)
struct USaveGame : UObject {
};

// Class Engine.*ecc7e9561f
// Size: 0x9d0 (Inherited: 0x9b0)
struct U*ecc7e9561f : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x9a8(0x04)
	struct UBodySetup* *6d9ffc621f; // 0x9b0(0x08)
	char *5ad4a49835 : 1; // 0x9b8(0x01)
	char *b1a48519e8 : 1; // 0x9b8(0x01)
	char *d96fb7dd6c : 1; // 0x9b8(0x01)
	char pad_9BC_3 : 5; // 0x9bc(0x01)
	char pad_9BD[0x3]; // 0x9bd(0x03)
	struct UClass* AreaClass; // 0x9c0(0x08)
	char pad_9C8[0x8]; // 0x9c8(0x08)
};

// Class Engine.TargetPoint
// Size: 0x3f0 (Inherited: 0x3f0)
struct ATargetPoint : AActor {
};

// Class Engine.GameStateBase
// Size: 0x430 (Inherited: 0x3f0)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x3f0(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x3f8(0x08)
	struct UClass* SpectatorClass; // 0x400(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x408(0x10)
	bool *d506f7e5e4; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float *83b1d93eee; // 0x41c(0x04)
	float *c28d41fd4b; // 0x420(0x04)
	float *32844ee1a9; // 0x424(0x04)
	char pad_428[0x8]; // 0x428(0x08)

	float *a9952ba0bf(); // Function Engine.GameStateBase.*a9952ba0bf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5717e54
	bool *8cab2d71c2(); // Function Engine.GameStateBase.*8cab2d71c2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2980
	float *4b737c5214(); // Function Engine.GameStateBase.*4b737c5214 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0840
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0x5344fc
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0x57ca99c
	float *e8df0b00a7(); // Function Engine.GameStateBase.*e8df0b00a7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e19c0
	float *8ad83f8ecb(); // Function Engine.GameStateBase.*8ad83f8ecb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1a68
	bool *ff7bd76d7c(); // Function Engine.GameStateBase.*ff7bd76d7c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e29d0
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xbb2944
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0xca2ea8
	float *f0b4c46c31(); // Function Engine.GameStateBase.*f0b4c46c31 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57a35b4
};

// Class Engine.GameState
// Size: 0x450 (Inherited: 0x430)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x430(0x08)
	struct FName PreviousMatchState; // 0x438(0x08)
	int32 ElapsedTime; // 0x440(0x04)
	char pad_444[0xc]; // 0x444(0x0c)

	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x5770330
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0x64e9918
};

// Class Engine.BoxComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UBoxComponent : U*ecc7e9561f {
	struct FVector BoxExtent; // 0x9c8(0x0c)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	struct FVector *f1bf6a0bed(); // Function Engine.BoxComponent.*f1bf6a0bed // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651dc6c
	struct FVector *b9d99948c0(); // Function Engine.BoxComponent.*b9d99948c0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651b8ec
	bool *17de6d8a81(); // Function Engine.BoxComponent.*17de6d8a81 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6539224
};

// Class Engine.ProjectileMovementComponent
// Size: 0x310 (Inherited: 0x250)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x248(0x04)
	float MaxSpeed; // 0x24c(0x04)
	char bRotationFollowsVelocity : 1; // 0x250(0x01)
	char bShouldBounce : 1; // 0x250(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x250(0x01)
	char bForceSubStepping : 1; // 0x250(0x01)
	char bSimulationEnabled : 1; // 0x250(0x01)
	char bSweepCollision : 1; // 0x250(0x01)
	char bIsHomingProjectile : 1; // 0x250(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x250(0x01)
	char bIsSliding : 1; // 0x251(0x01)
	char bInterpMovement : 1; // 0x251(0x01)
	char bInterpRotation : 1; // 0x251(0x01)
	float PreviousHitTime; // 0x254(0x04)
	struct FVector PreviousHitNormal; // 0x258(0x0c)
	float ProjectileGravityScale; // 0x264(0x04)
	float *941c01e255; // 0x268(0x04)
	float Bounciness; // 0x26c(0x04)
	float Friction; // 0x270(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x274(0x04)
	float MinFrictionFraction; // 0x278(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x280(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x290(0x10)
	float HomingAccelerationMagnitude; // 0x2a0(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x2a4(0x08)
	float MaxSimulationTimeStep; // 0x2ac(0x04)
	int32 MaxSimulationIterations; // 0x2b0(0x04)
	int32 BounceAdditionalIterations; // 0x2b4(0x04)
	float InterpLocationTime; // 0x2b8(0x04)
	float InterpRotationTime; // 0x2bc(0x04)
	float InterpLocationMaxLagDistance; // 0x2c0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2c4(0x04)
	char pad_2C9[0x47]; // 0x2c9(0x47)

	struct FHitResult OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x1dcd78
	bool *bd4604da41(); // Function Engine.ProjectileMovementComponent.*bd4604da41 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x652282c
	struct FVector OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x1dcd78
	void *d542984fd9(); // Function Engine.ProjectileMovementComponent.*d542984fd9 // Native|Public|BlueprintCallable // @ game+0x57aa7b0
	struct USceneComponent* *40a4d84143(); // Function Engine.ProjectileMovementComponent.*40a4d84143 // Native|Public|BlueprintCallable // @ game+0x653e944
	struct FVector LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6525264
	bool *0e6e4bda92(); // Function Engine.ProjectileMovementComponent.*0e6e4bda92 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6521d90
	struct FVector *b1925dc644(); // Function Engine.ProjectileMovementComponent.*b1925dc644 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x65455a0
	struct FHitResult StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x654cfc8
	struct FRotator *a1edadaf82(); // Function Engine.ProjectileMovementComponent.*a1edadaf82 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x652cdf4
};

// Class Engine.CurveBase
// Size: 0x38 (Inherited: 0x30)
struct UCurveBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	float *66c74365d8(); // Function Engine.CurveBase.*66c74365d8 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2638
	float *01a35ccac8(); // Function Engine.CurveBase.*01a35ccac8 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2310
};

// Class Engine.GameUserSettings
// Size: 0x118 (Inherited: 0x30)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x30(0x01)
	bool bUseDynamicResolution; // 0x31(0x01)
	char pad_32[0x4e]; // 0x32(0x4e)
	uint32 ResolutionSizeX; // 0x80(0x04)
	uint32 ResolutionSizeY; // 0x84(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	int32 WindowPosX; // 0x90(0x04)
	int32 WindowPosY; // 0x94(0x04)
	int32 FullscreenMode; // 0x98(0x04)
	int32 LastConfirmedFullscreenMode; // 0x9c(0x04)
	int32 PreferredFullscreenMode; // 0xa0(0x04)
	uint32 Version; // 0xa4(0x04)
	int32 AudioQualityLevel; // 0xa8(0x04)
	float FrameRateLimit; // 0xac(0x04)
	char pad_B0[0x4]; // 0xb0(0x04)
	int32 DesiredScreenWidth; // 0xb4(0x04)
	bool bUseDesiredScreenHeight; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DesiredScreenHeight; // 0xbc(0x04)
	float LastRecommendedScreenWidth; // 0xc0(0x04)
	float LastRecommendedScreenHeight; // 0xc4(0x04)
	float LastCPUBenchmarkResult; // 0xc8(0x04)
	float LastGPUBenchmarkResult; // 0xcc(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xd0(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xe0(0x10)
	float LastGPUBenchmarkMultiplier; // 0xf0(0x04)
	bool bUseHDRDisplayOutput; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	int32 HDRDisplayOutputNits; // 0xf8(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xfc(0x01)
	bool bGPUDebug; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0x100(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x108(0x10)

	int32 *3fa07a2c15(); // Function Engine.GameUserSettings.*3fa07a2c15 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65603e4
	int32 *42adf84a10(); // Function Engine.GameUserSettings.*42adf84a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x655f9a8
	struct FIntPoint *8a20ad8cd1(); // Function Engine.GameUserSettings.*8a20ad8cd1 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x655fe3c
	bool LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x655e004
	int32 *41ac2628ab(); // Function Engine.GameUserSettings.*41ac2628ab // Final|Native|Public|BlueprintCallable // @ game+0x6569e5c
	float *053c3bb9c7(); // Function Engine.GameUserSettings.*053c3bb9c7 // Native|Public|BlueprintCallable // @ game+0x65618a8
	int32 *b7a04ffac6(); // Function Engine.GameUserSettings.*b7a04ffac6 // Final|Native|Public|BlueprintCallable // @ game+0x6569090
	bool *42946d5ee0(); // Function Engine.GameUserSettings.*42946d5ee0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65632b8
	bool *1a6266fca5(); // Function Engine.GameUserSettings.*1a6266fca5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x656ac60
	int32 *33c615124b(); // Function Engine.GameUserSettings.*33c615124b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x656253c
	void *39a5d552d0(); // Function Engine.GameUserSettings.*39a5d552d0 // Final|Native|Public|BlueprintCallable // @ game+0x6568f54
	int32 *e7d97d07ad(); // Function Engine.GameUserSettings.*e7d97d07ad // Final|Native|Public|BlueprintCallable // @ game+0x6569c54
	bool *1b557feea9(); // Function Engine.GameUserSettings.*1b557feea9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562db0
	int32 *639dffa7ed(); // Function Engine.GameUserSettings.*639dffa7ed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6561380
	bool *44991ed37a(); // Function Engine.GameUserSettings.*44991ed37a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65632dc
	float *febf6f3b86(); // Function Engine.GameUserSettings.*febf6f3b86 // Final|Native|Public|BlueprintCallable // @ game+0x656954c
	struct FIntPoint *4c04eab1f7(); // Function Engine.GameUserSettings.*4c04eab1f7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x656989c
	int32 GetResolutionScaleInformation(); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x65619b8
	bool *551ad5a02b(); // Function Engine.GameUserSettings.*551ad5a02b // Final|Native|Public|BlueprintCallable // @ game+0x6569ce0
	float *1883a41186(); // Function Engine.GameUserSettings.*1883a41186 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6561bb0
	int32 *7a9fb9af57(); // Function Engine.GameUserSettings.*7a9fb9af57 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562880
	int32 *86347b2bd7(); // Function Engine.GameUserSettings.*86347b2bd7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562894
	int32 *3ebc1d55ed(); // Function Engine.GameUserSettings.*3ebc1d55ed // Final|Native|Public|BlueprintCallable // @ game+0x6569928
	void *96553099cc(); // Function Engine.GameUserSettings.*96553099cc // Native|Public|BlueprintCallable // @ game+0xbfb6c8
	int32 *cdb9c52b4d(); // Function Engine.GameUserSettings.*cdb9c52b4d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x655f994
	enum class EWindowMode *a09c0e4ab2(); // Function Engine.GameUserSettings.*a09c0e4ab2 // Final|Native|Static|Public|BlueprintCallable // @ game+0xc6f448
	void *3b9d09fcec(); // Function Engine.GameUserSettings.*3b9d09fcec // Final|Native|Public|BlueprintCallable // @ game+0x655b730
	enum class EWindowMode *d468322917(); // Function Engine.GameUserSettings.*d468322917 // Final|Native|Public|BlueprintCallable // @ game+0x65691c4
	float *f140babb19(); // Function Engine.GameUserSettings.*f140babb19 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65603f8
	bool *ed58553e72(); // Function Engine.GameUserSettings.*ed58553e72 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562d8c
	void *afea566c1e(); // Function Engine.GameUserSettings.*afea566c1e // Native|Public|BlueprintCallable // @ game+0x5f883dc
	struct FIntPoint *8bd0d486a3(); // Function Engine.GameUserSettings.*8bd0d486a3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x655fe54
	bool *d2dcc0db36(); // Function Engine.GameUserSettings.*d2dcc0db36 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x412214
	enum class EWindowMode *fca58327d0(); // Function Engine.GameUserSettings.*fca58327d0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65608e8
	bool *4e0db130e4(); // Function Engine.GameUserSettings.*4e0db130e4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x655b2ec
	float *bd8d78e737(); // Function Engine.GameUserSettings.*bd8d78e737 // Final|Native|Public|BlueprintCallable // @ game+0x6569690
	int32 *625aed7dbe(); // Function Engine.GameUserSettings.*625aed7dbe // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6561db4
	int32 *288f53c0c3(); // Function Engine.GameUserSettings.*288f53c0c3 // Final|Native|Public|BlueprintCallable // @ game+0x655e388
	bool *518e9c9ba4(); // Function Engine.GameUserSettings.*518e9c9ba4 // Final|Native|Public|BlueprintCallable // @ game+0x6569004
	void *4d5ec9c010(); // Function Engine.GameUserSettings.*4d5ec9c010 // Native|Public|BlueprintCallable // @ game+0xacfc40
	struct FIntPoint *576b1ee454(); // Function Engine.GameUserSettings.*576b1ee454 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6561d90
	enum class EWindowMode *ade7a8eb7f(); // Function Engine.GameUserSettings.*ade7a8eb7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6561394
	float *7e207f2d19(); // Function Engine.GameUserSettings.*7e207f2d19 // Native|Public|BlueprintCallable // @ game+0x655fe10
	void *5646d1bc97(); // Function Engine.GameUserSettings.*5646d1bc97 // Native|Public|BlueprintCallable // @ game+0x6557bec
	int32 *9ad0171dd6(); // Function Engine.GameUserSettings.*9ad0171dd6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x655fbd4
	int32 *c2386c6a9d(); // Function Engine.GameUserSettings.*c2386c6a9d // Final|Native|Public|BlueprintCallable // @ game+0x6568e3c
	int32 *70413184d2(); // Function Engine.GameUserSettings.*70413184d2 // Final|Native|Public|BlueprintCallable // @ game+0x65694c0
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x57d80f8
	int32 *af951b2cd6(); // Function Engine.GameUserSettings.*af951b2cd6 // Final|Native|Public|BlueprintCallable // @ game+0x57ae994
	struct FIntPoint *ecd76f8120(); // Function Engine.GameUserSettings.*ecd76f8120 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x656090c
	struct UGameUserSettings* *dfe3eff084(); // Function Engine.GameUserSettings.*dfe3eff084 // Final|Native|Static|Public|BlueprintCallable // @ game+0x6560510
	float *c68bfff735(); // Function Engine.GameUserSettings.*c68bfff735 // Final|Native|Public|BlueprintCallable // @ game+0x656912c
	bool *9f1edd93aa(); // Function Engine.GameUserSettings.*9f1edd93aa // Final|Native|Public|BlueprintCallable // @ game+0x6557c04
	int32 *511dbb1516(); // Function Engine.GameUserSettings.*511dbb1516 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6560e0c
	int32 SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x65695fc
	void *1bdc89e63d(); // Function Engine.GameUserSettings.*1bdc89e63d // Final|Native|Public|BlueprintCallable // @ game+0x6568730
	bool *177680250c(); // Function Engine.GameUserSettings.*177680250c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562d54
	enum class EWindowMode *b847c10734(); // Function Engine.GameUserSettings.*b847c10734 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6560410
	bool *732707d3cd(); // Function Engine.GameUserSettings.*732707d3cd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6562d78
	int32 *2610d883f2(); // Function Engine.GameUserSettings.*2610d883f2 // Native|Public|BlueprintCallable // @ game+0x656942c
	void *f4e03bd257(); // Function Engine.GameUserSettings.*f4e03bd257 // Native|Public|BlueprintCallable // @ game+0xb43878
	bool *b5801bbd2f(); // Function Engine.GameUserSettings.*b5801bbd2f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6563274
	struct FIntPoint *faa773b54d(); // Function Engine.GameUserSettings.*faa773b54d // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x655fdf0
	float *28ad51e5eb(); // Function Engine.GameUserSettings.*28ad51e5eb // Native|Public|BlueprintCallable // @ game+0x6568ccc
	int32 *922ccd84f4(); // Function Engine.GameUserSettings.*922ccd84f4 // Final|Native|Public|BlueprintCallable // @ game+0x6568ec8
	bool *ae8bd0cce0(); // Function Engine.GameUserSettings.*ae8bd0cce0 // Native|Public|BlueprintCallable // @ game+0x57b44b8
};

// Class Engine.GameInstance
// Size: 0x1f0 (Inherited: 0x30)
struct UGameInstance : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct U*095debd2a0* *095debd2a0; // 0x38(0x08)
	char pad_40[0x80]; // 0x40(0x80)
	struct U*7e8b14b3a6* *7e8b14b3a6; // 0xc0(0x08)
	char pad_C8[0x38]; // 0xc8(0x38)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0x100(0x10)
	char pad_110[0xe0]; // 0x110(0xe0)

	int32 DebugCreatePlayer(); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x650b48c
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x1dcd78
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x1dcd78
	int32 DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x650b520
	enum class ETravelFailure HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x1dcd78
};

// Class Engine.TriggerBase
// Size: 0x3f8 (Inherited: 0x3f0)
struct ATriggerBase : AActor {
	struct U*ecc7e9561f* CollisionComponent; // 0x3f0(0x08)
};

// Class Engine.TriggerBox
// Size: 0x3f8 (Inherited: 0x3f8)
struct ATriggerBox : ATriggerBase {
};

// Class Engine.CapsuleComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UCapsuleComponent : U*ecc7e9561f {
	float CapsuleHalfHeight; // 0x9c8(0x04)
	float CapsuleRadius; // 0x9cc(0x04)
	float CapsuleHeight; // 0x9d0(0x04)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	bool *ddfefb99fd(); // Function Engine.CapsuleComponent.*ddfefb99fd // Final|Native|Public|BlueprintCallable // @ game+0x65395cc
	float *b352bc1860(); // Function Engine.CapsuleComponent.*b352bc1860 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651ba34
	struct FName *c1ae168066(); // Function Engine.CapsuleComponent.*c1ae168066 // Native|Public|BlueprintCallable // @ game+0x64f01bc
	float *5c5966e669(); // Function Engine.CapsuleComponent.*5c5966e669 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651ddf0
	float *156cc7bd6d(); // Function Engine.CapsuleComponent.*156cc7bd6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651b994
	float *d8d9e8ddda(); // Function Engine.CapsuleComponent.*d8d9e8ddda // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651bb68
	float *9a3a3845fe(); // Function Engine.CapsuleComponent.*9a3a3845fe // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x651dce8
	enum class ECollisionResponse *78fdfb4d17(); // Function Engine.CapsuleComponent.*78fdfb4d17 // Native|Public|BlueprintCallable // @ game+0x64f02e8
	float *d18ea0f521(); // Function Engine.CapsuleComponent.*d18ea0f521 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651dcd0
	float *5ad9e5ebdb(); // Function Engine.CapsuleComponent.*5ad9e5ebdb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651dcac
	bool *5cf3fa611a(); // Function Engine.CapsuleComponent.*5cf3fa611a // Final|Native|Public|BlueprintCallable // @ game+0x65396b8
	float *4daa1f5aaf(); // Function Engine.CapsuleComponent.*4daa1f5aaf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651bd9c
	bool *656ab9bef3(); // Function Engine.CapsuleComponent.*656ab9bef3 // Final|Native|Public|BlueprintCallable // @ game+0x6539438
	enum class ECollisionResponse *f0b5efc4d8(); // Function Engine.CapsuleComponent.*f0b5efc4d8 // Native|Public|BlueprintCallable // @ game+0x64f0250
	float *32f034ebd4(); // Function Engine.CapsuleComponent.*32f034ebd4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651dc94
	float *3bc6d21068(); // Function Engine.CapsuleComponent.*3bc6d21068 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651b948
	float *197503b2c5(); // Function Engine.CapsuleComponent.*197503b2c5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651b9e8
};

// Class Engine.PhysicsVolume
// Size: 0x440 (Inherited: 0x428)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x428(0x04)
	int32 Priority; // 0x42c(0x04)
	float FluidFriction; // 0x430(0x04)
	char bWaterVolume : 1; // 0x434(0x01)
	char bPhysicsOnContact : 1; // 0x434(0x01)
	char pad_434_2 : 6; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	bool *c1e105b0ce; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x800 (Inherited: 0x7b0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7b0(0x01)
	char *0b2402a34c : 1; // 0x7b0(0x01)
	char pad_7B0_2 : 6; // 0x7b0(0x01)
	char pad_7B1[0x7]; // 0x7b1(0x07)
	struct U*e8224a1e62* *9324a8bb8c; // 0x7b8(0x08)
	char pad_7C0[0x20]; // 0x7c0(0x20)
	float SpeedScale; // 0x7e0(0x04)
	float InitialMaxSpeed; // 0x7e4(0x04)
	float InitialAccel; // 0x7e8(0x04)
	float InitialDecel; // 0x7ec(0x04)
	char pad_7F0[0x10]; // 0x7f0(0x10)

	void *2e4653783e(); // Function Engine.DebugCameraController.*2e4653783e // Final|Native|Public|BlueprintCallable // @ game+0x64f5d54
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x64f4f3c
	struct AActor* *b67f45561f(); // Function Engine.DebugCameraController.*b67f45561f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e1c20
	float *de56c362d2(); // Function Engine.DebugCameraController.*de56c362d2 // Final|Native|Public|BlueprintCallable // @ game+0x64f2cf4
	struct APlayerController* ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct APlayerController* ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct FHitResult ReceiveOnActorSelected(); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1dcd78
};

// Class Engine.Channel
// Size: 0x70 (Inherited: 0x30)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x38]; // 0x38(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x70)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_78[0x2f8]; // 0x78(0x2f8)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	char pad_370[0x20]; // 0x370(0x20)
};

// Class Engine.NavigationObjectBase
// Size: 0x418 (Inherited: 0x3f0)
struct ANavigationObjectBase : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x3f8(0x08)
	struct UBillboardComponent* *6369e93122; // 0x400(0x08)
	struct UBillboardComponent* *83f6a9b2b9; // 0x408(0x08)
	char *9088118d89 : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
};

// Class Engine.PlayerStart
// Size: 0x420 (Inherited: 0x418)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x418(0x08)
};

// Class Engine.CheatManager
// Size: 0x80 (Inherited: 0x30)
struct UCheatManager : UObject {
	struct ADebugCameraController* *a08dd8a11c; // 0x30(0x08)
	struct UClass* DebugCameraControllerClass; // 0x38(0x08)
	char pad_40[0x40]; // 0x40(0x40)

	struct FName OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6567808
	float FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x655f804
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x57a0074
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x655e1e4
	struct FString CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x655b3b0
	void *795eba9f52(); // Function Engine.CheatManager.*795eba9f52 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6568df0
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x5759dc4
	struct FString Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x656ab9c
	struct FName StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x656a8e0
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x655de44
	void *f8b0d01959(); // Function Engine.CheatManager.*f8b0d01959 // Native|Protected|BlueprintCallable // @ game+0xbedc78
	float ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x655b314
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x656c370
	bool DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x655de5c
	struct FString ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x656c2ac
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x6566394
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x656ba4c
	struct UClass* DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x64d4f78
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x57d8110
	float BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x65597e4
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x6567d88
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x655dd94
	float DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x655df0c
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x6567f98
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x57d8060
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x656ba34
	struct FString BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x6559a00
	struct UClass* DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x5ea3d2c
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x6569ee8
	enum class ECollisionChannel DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x655ddac
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0x655def4
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0xbfb6c8
	float DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x655dcf8
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x655e1b4
	void *9377c54237(); // Function Engine.CheatManager.*9377c54237 // Native|Protected|BlueprintCallable // @ game+0x655e27c
	struct FName StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x656a84c
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1dcd78
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x655e1cc
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x655f7ec
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x57d80b8
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x6562ce8
	struct FString BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x6559720
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x6569380
	float SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x6569394
	struct FName ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x656c184
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x655dfec
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x73263c
	float Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x656a2b4
	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x57d80f8
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x656ac88
	struct UClass* ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x656c218
};

// Class Engine.*6df4f0aacf
// Size: 0x9c0 (Inherited: 0x9b0)
struct U*6df4f0aacf : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0x9b0(0x10)
};

// Class Engine.NavArea
// Size: 0x48 (Inherited: 0x30)
struct UNavArea : UObject {
	float DefaultCost; // 0x30(0x04)
	float FixedAreaEnteringCost; // 0x34(0x04)
	struct FColor DrawColor; // 0x38(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x3c(0x04)
	char bSupportsAgent0 : 1; // 0x40(0x01)
	char bSupportsAgent1 : 1; // 0x40(0x01)
	char bSupportsAgent2 : 1; // 0x40(0x01)
	char bSupportsAgent3 : 1; // 0x40(0x01)
	char bSupportsAgent4 : 1; // 0x40(0x01)
	char bSupportsAgent5 : 1; // 0x40(0x01)
	char bSupportsAgent6 : 1; // 0x40(0x01)
	char bSupportsAgent7 : 1; // 0x40(0x01)
	char bSupportsAgent8 : 1; // 0x41(0x01)
	char bSupportsAgent9 : 1; // 0x41(0x01)
	char bSupportsAgent10 : 1; // 0x41(0x01)
	char bSupportsAgent11 : 1; // 0x41(0x01)
	char bSupportsAgent12 : 1; // 0x41(0x01)
	char bSupportsAgent13 : 1; // 0x41(0x01)
	char bSupportsAgent14 : 1; // 0x41(0x01)
	char bSupportsAgent15 : 1; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x3f8 (Inherited: 0x3f0)
struct ALevelScriptActor : AActor {
	char *6600a3ea98 : 1; // 0x3f0(0x01)
	char pad_3F0_1 : 7; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)

	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool *278a1612b5(); // Function Engine.LevelScriptActor.*278a1612b5 // Native|Public|BlueprintCallable // @ game+0xb75200
	struct FIntVector WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x1dcd78
	bool *e55cf6f554(); // Function Engine.LevelScriptActor.*e55cf6f554 // Native|Public|BlueprintCallable // @ game+0x57de360
};

// Class Engine.ChildActorComponent
// Size: 0x4b0 (Inherited: 0x480)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x478(0x08)
	struct AActor* ChildActor; // 0x480(0x08)
	struct AActor* ChildActorTemplate; // 0x488(0x08)
	char pad_498[0x18]; // 0x498(0x18)

	struct UClass* *13873450fe(); // Function Engine.ChildActorComponent.*13873450fe // Final|Native|Public|BlueprintCallable // @ game+0x64efea4
};

// Class Engine.CameraComponent
// Size: 0xa70 (Inherited: 0x480)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x478(0x04)
	float OrthoWidth; // 0x47c(0x04)
	float OrthoNearClipPlane; // 0x480(0x04)
	float OrthoFarClipPlane; // 0x484(0x04)
	float AspectRatio; // 0x488(0x04)
	char bConstrainAspectRatio : 1; // 0x48c(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x48c(0x01)
	char bLockToHmd : 1; // 0x48c(0x01)
	char bUsePawnControlRotation : 1; // 0x48c(0x01)
	enum class ECameraProjectionMode ProjectionMode; // 0x490(0x01)
	float PostProcessBlendWeight; // 0x494(0x04)
	char pad_499_4 : 4; // 0x499(0x01)
	char pad_49A[0x6]; // 0x49a(0x06)
	struct FPostProcessSettings PostProcessSettings; // 0x4a0(0x570)
	char pad_A10[0x58]; // 0xa10(0x58)
	char bUseControllerViewRotation : 1; // 0xa68(0x01)
	char pad_A68_1 : 7; // 0xa68(0x01)
	char pad_A69[0x7]; // 0xa69(0x07)

	float *3243136986(); // Function Engine.CameraComponent.*3243136986 // Final|Native|Public|BlueprintCallable // @ game+0x6540cfc
	float *319ffc6c21(); // Function Engine.CameraComponent.*319ffc6c21 // Final|Native|Public|BlueprintCallable // @ game+0x6540c64
	bool *014a2540ed(); // Function Engine.CameraComponent.*014a2540ed // Final|Native|Public|BlueprintCallable // @ game+0x6545058
	float *83f44d6997(); // Function Engine.CameraComponent.*83f44d6997 // Final|Native|Public|BlueprintCallable // @ game+0x65417a4
	struct F*5cde951495 *1018ac5a95(); // Function Engine.CameraComponent.*1018ac5a95 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x65141a0
	bool *2af209604c(); // Function Engine.CameraComponent.*2af209604c // Final|Native|Public|BlueprintCallable // @ game+0x653a45c
	float *2ac6b59eb0(); // Function Engine.CameraComponent.*2ac6b59eb0 // Final|Native|Public|BlueprintCallable // @ game+0x6537cfc
	float *e3575fd8d0(); // Function Engine.CameraComponent.*e3575fd8d0 // Final|Native|Public|BlueprintCallable // @ game+0x653e784
	float *279e5ee7e9(); // Function Engine.CameraComponent.*279e5ee7e9 // Final|Native|Public|BlueprintCallable // @ game+0x64fb520
	enum class ECameraProjectionMode *23da1c6514(); // Function Engine.CameraComponent.*23da1c6514 // Final|Native|Public|BlueprintCallable // @ game+0x6541b30
	float *e404a296b4(); // Function Engine.CameraComponent.*e404a296b4 // Final|Native|Public|BlueprintCallable // @ game+0x653ca60
};

// Class Engine.Engine
// Size: 0xf30 (Inherited: 0x30)
struct UEngine : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FStringAssetReference TinyFontName; // 0x40(0x10)
	struct UFont* SmallFont; // 0x50(0x08)
	struct FStringAssetReference SmallFontName; // 0x58(0x10)
	struct UFont* *d5575fd1a5; // 0x68(0x08)
	struct FStringAssetReference MediumFontName; // 0x70(0x10)
	struct UFont* LargeFont; // 0x80(0x08)
	struct FStringAssetReference LargeFontName; // 0x88(0x10)
	struct UFont* *eb5965c5ca; // 0x98(0x08)
	struct FStringAssetReference SubtitleFontName; // 0xa0(0x10)
	struct TArray<struct UFont*> *6684f966fa; // 0xb0(0x10)
	float DisplayGamma; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0xc8(0x10)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0xd8(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0xe8(0x08)
	float MaxOcclusionPixelsFraction; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct UObject* *5d37fdbc39; // 0xf8(0x08)
	struct UTexture2D* DefaultTexture; // 0x100(0x08)
	int32 *a116c62737; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct FString LightingTexelDensityName; // 0x110(0x10)
	struct UTexture* WeightMapPlaceholderTexture; // 0x120(0x08)
	struct UMaterialInstanceDynamic* *43a400f78e; // 0x128(0x08)
	struct FString *7d46f4c031; // 0x130(0x10)
	struct FStringClassReference LevelScriptActorClassName; // 0x140(0x10)
	struct UMaterial* *2a7f86453a; // 0x150(0x08)
	struct FColor *92098a0da9; // 0x158(0x04)
	struct FColor *d4edb0cd71; // 0x15c(0x04)
	struct UClass* *0a729b2cf7; // 0x160(0x08)
	struct FStringClassReference AIControllerClassName; // 0x168(0x10)
	struct FStringAssetReference DefaultPhysMaterialName; // 0x178(0x10)
	struct UClass* *6fdc146635; // 0x188(0x08)
	struct UMaterial* LevelColorationLitMaterial; // 0x190(0x08)
	struct FColor *c2302d3d50; // 0x198(0x04)
	float MeshLODRange; // 0x19c(0x04)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x1a0(0x10)
	struct TArray<struct FString> *06f7de7a1f; // 0x1b0(0x10)
	char pad_1C0[0x18]; // 0x1c0(0x18)
	float MinLightMapDensity; // 0x1d8(0x04)
	char pad_1DC[0x4]; // 0x1dc(0x04)
	struct FStringAssetReference DebugMeshMaterialName; // 0x1e0(0x10)
	int32 *16613c20a8; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x1f8(0x10)
	float RenderLightMapDensityColorScale; // 0x208(0x04)
	char pad_20C[0x4]; // 0x20c(0x04)
	struct UTexture2D* *68954a0e95; // 0x210(0x08)
	struct FStringClassReference AvoidanceManagerClassName; // 0x218(0x10)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x228(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x238(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x240(0x10)
	struct UMaterial* *4e145c5e75; // 0x250(0x08)
	struct FStringClassReference AssetManagerClassName; // 0x258(0x10)
	float PrimitiveProbablyVisibleTime; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct UMaterial* VertexColorMaterial; // 0x270(0x08)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x278(0x10)
	struct FLinearColor LightingOnlyBrightness; // 0x288(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x298(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x2a8(0x10)
	struct UMaterialInstanceDynamic* *39ca5c3bcb; // 0x2b8(0x08)
	struct FColor *5a587410f9; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct UTexture2D* *8e6f7d16a9; // 0x2c8(0x08)
	struct FString VertexColorMaterialName; // 0x2d0(0x10)
	struct FColor *ab8b895c94; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct FStringAssetReference DefaultTextureName; // 0x2e8(0x10)
	char pad_2F8[0x50]; // 0x2f8(0x50)
	float NetClientTicksPerSecond; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct FStringClassReference ConsoleClassName; // 0x350(0x10)
	struct UAssetManager* AssetManager; // 0x360(0x08)
	struct FStringAssetReference ArrowMaterialName; // 0x368(0x10)
	struct UMaterial* *9d1254360e; // 0x378(0x08)
	struct TArray<struct F*79d333047c> StatColorMappings; // 0x380(0x10)
	struct UGameUserSettings* GameUserSettings; // 0x390(0x08)
	char bPauseOnLossOfFocus : 1; // 0x398(0x01)
	char pad_398_1 : 7; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	int32 MaxParticleResize; // 0x39c(0x04)
	struct FFloatRange SmoothedFrameRateRange; // 0x3a0(0x10)
	struct TArray<struct F*a26d903e83> ActiveStructRedirects; // 0x3b0(0x10)
	struct UMaterial* *7ace57a663; // 0x3c0(0x08)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x3c8(0x10)
	struct FStringAssetReference MiniFontTextureName; // 0x3d8(0x10)
	struct UClass* *54adc8e9b7; // 0x3e8(0x08)
	float *8d74b94f2c; // 0x3f0(0x04)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0x3f8(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x408(0x10)
	struct UTexture* DefaultDiffuseTexture; // 0x418(0x08)
	struct FString PlayOnConsoleSaveDir; // 0x420(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x430(0x10)
	struct UMaterial* *ec17bc7747; // 0x440(0x08)
	float FixedFrameRate; // 0x448(0x04)
	char bSubtitlesForcedOff : 1; // 0x44c(0x01)
	char pad_44C_1 : 7; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	struct UMaterialInstanceDynamic* *ae4f6d03a2; // 0x450(0x08)
	struct UTexture2D* *2897f70a3a; // 0x458(0x08)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x460(0x10)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0x470(0x10)
	struct UMaterial* *14f279bb49; // 0x480(0x08)
	struct UClass* *0578464ae5; // 0x488(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0x490(0x10)
	struct UTexture2D* *8d18d8f0e3; // 0x4a0(0x08)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x4a8(0x10)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x4b8(0x10)
	struct FString WireframeMaterialName; // 0x4c8(0x10)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x4d8(0x10)
	struct UTexture2D* *54b303e300; // 0x4e8(0x08)
	char bHardwareSurveyEnabled : 1; // 0x4f0(0x01)
	char pad_4F0_1 : 7; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	struct FColor *076b3a5e59; // 0x4f4(0x04)
	struct FStringAssetReference LightMapDensityTextureName; // 0x4f8(0x10)
	enum class *5bfc0775d8 *66a16761a7; // 0x508(0x01)
	char pad_509[0xf]; // 0x509(0x0f)
	struct UClass* *4d2f7e062f; // 0x518(0x08)
	struct TArray<struct F*5d92169511> ActiveGameNameRedirects; // 0x520(0x10)
	struct FString ShadedLevelColorationLitMaterialName; // 0x530(0x10)
	struct FStringClassReference GameViewportClientClassName; // 0x540(0x10)
	char bRenderLightMapDensityGrayscale : 1; // 0x550(0x01)
	char pad_550_1 : 7; // 0x550(0x01)
	char pad_551[0x3]; // 0x551(0x03)
	struct FColor *86c7fafaec; // 0x554(0x04)
	struct UTexture2D* MiniFontTexture; // 0x558(0x08)
	float NearClipPlane; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct FString *f2905c8f30; // 0x568(0x10)
	struct UClass* *3ae64d6909; // 0x578(0x08)
	struct UMaterialInstanceDynamic* *26117a141b; // 0x580(0x08)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x588(0x08)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x590(0x10)
	float MaxLightMapDensity; // 0x5a0(0x04)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct UGameViewportClient* GameViewport; // 0x5a8(0x08)
	struct UClass* *f01d850c6c; // 0x5b0(0x08)
	char bAllowMatureLanguage : 1; // 0x5b8(0x01)
	char pad_5B8_1 : 7; // 0x5b8(0x01)
	char pad_5B9[0x3]; // 0x5b9(0x03)
	float CameraRotationThreshold; // 0x5bc(0x04)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x5c0(0x10)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x5d0(0x10)
	struct FStringClassReference WorldSettingsClassName; // 0x5e0(0x10)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0x5f0(0x10)
	struct UMaterial* *228f144519; // 0x600(0x08)
	struct FColor *7fbd372b8c; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct FString LevelColorationUnlitMaterialName; // 0x610(0x10)
	struct FColor *64dcbccba7; // 0x620(0x04)
	float MaxPixelShaderAdditiveComplexityCount; // 0x624(0x04)
	struct UMaterial* *840a3e28dd; // 0x628(0x08)
	int32 MaximumLoopIterationCount; // 0x630(0x04)
	char pad_634[0x4]; // 0x634(0x04)
	struct UMaterialInstanceDynamic* *1f05e695fb; // 0x638(0x08)
	struct FColor *b2b0568658; // 0x640(0x04)
	char pad_644[0x4]; // 0x644(0x04)
	struct UClass* *94e76c0b64; // 0x648(0x08)
	struct UMaterial* *728c6c3f00; // 0x650(0x08)
	struct UMaterial* WireframeMaterial; // 0x658(0x08)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0x660(0x10)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0x670(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x680(0x08)
	int32 MaxParticleResizeWarn; // 0x688(0x04)
	float IdealLightMapDensity; // 0x68c(0x04)
	struct UMaterialInstanceDynamic* *8c82e4230b; // 0x690(0x08)
	char bCanBlueprintsTickByDefault : 1; // 0x698(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x698(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x698(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x698(0x01)
	char pad_698_4 : 1; // 0x698(0x01)
	char bSmoothFrameRate : 1; // 0x698(0x01)
	char bUseFixedFrameRate : 1; // 0x698(0x01)
	char pad_698_7 : 1; // 0x698(0x01)
	char pad_699[0x3]; // 0x699(0x03)
	struct FColor *6adb0523e6; // 0x69c(0x04)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0x6a0(0x10)
	char bSubtitlesEnabled : 1; // 0x6b0(0x01)
	char pad_6B0_1 : 7; // 0x6b0(0x01)
	char pad_6B1[0x3]; // 0x6b1(0x03)
	int32 *07c764073a; // 0x6b4(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x6b8(0x10)
	struct FLinearColor *df438f7d68; // 0x6c8(0x10)
	struct FLinearColor *a4766efbe6; // 0x6d8(0x10)
	struct FLinearColor *7851acd877; // 0x6e8(0x10)
	struct FLinearColor *c4c5215f57; // 0x6f8(0x10)
	bool *2a0a2d4f68; // 0x708(0x01)
	char pad_709[0x3]; // 0x709(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x70c(0x01)
	char *dbe8d54996 : 1; // 0x70c(0x01)
	char bSuppressMapWarnings : 1; // 0x70c(0x01)
	char bDisableAILogging : 1; // 0x70c(0x01)
	char pad_70C_4 : 4; // 0x70c(0x01)
	char pad_70D[0x3]; // 0x70d(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x710(0x04)
	struct FBox *79b02780b5; // 0x714(0x1c)
	char pad_730[0x4]; // 0x730(0x04)
	int32 *5d401516ab; // 0x734(0x04)
	char *c8c363118f : 1; // 0x738(0x01)
	char pad_738_1 : 7; // 0x738(0x01)
	char pad_739[0x7]; // 0x739(0x07)
	struct FString ParticleEventManagerClassPath; // 0x740(0x10)
	char pad_750[0x20]; // 0x750(0x20)
	float SelectionHighlightIntensity; // 0x770(0x04)
	float *66fa485314; // 0x774(0x04)
	float BSPSelectionHighlightIntensity; // 0x778(0x04)
	float HoverHighlightIntensity; // 0x77c(0x04)
	float *18588a0834; // 0x780(0x04)
	float PrimitiveBaseIntensity; // 0x784(0x04)
	float PrimitiveSelectedIntensity; // 0x788(0x04)
	float PrimitiveHoverIntensity; // 0x78c(0x04)
	char pad_790[0x290]; // 0x790(0x290)
	struct TArray<struct F*2dbfe53fec> ActivePluginRedirects; // 0xa20(0x10)
	float CameraTranslationThreshold; // 0xa30(0x04)
	struct FColor *bedef1c2e2; // 0xa34(0x04)
	struct TArray<struct F*be03b16f81> ActiveClassRedirects; // 0xa38(0x10)
	char pad_A48[0x8]; // 0xa48(0x08)
	struct FColor *d04cd288f8; // 0xa50(0x04)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0xa54(0x04)
	struct UMaterial* LevelColorationUnlitMaterial; // 0xa58(0x08)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0xa60(0x10)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0xa70(0x10)
	char pad_A80[0x1d0]; // 0xa80(0x1d0)
	struct TArray<struct F*ac3a1c14b3> NetDriverDefinitions; // 0xc50(0x10)
	struct TArray<struct FString> ServerActors; // 0xc60(0x10)
	struct TArray<struct FString> *65faad95f3; // 0xc70(0x10)
	char *0dabd9a1d1 : 1; // 0xc80(0x01)
	char pad_C80_1 : 7; // 0xc80(0x01)
	char pad_C81[0x7]; // 0xc81(0x07)
	struct FStringClassReference GameSingletonClassName; // 0xc88(0x10)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0xc98(0x01)
	char pad_C98_1 : 7; // 0xc98(0x01)
	char pad_C99[0x3]; // 0xc99(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0xc9c(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0xca0(0x01)
	char pad_CA0_1 : 7; // 0xca0(0x01)
	char pad_CA1[0x7]; // 0xca1(0x07)
	struct FStringClassReference GameUserSettingsClassName; // 0xca8(0x10)
	struct FString LevelColorationLitMaterialName; // 0xcb8(0x10)
	struct UMaterialInstanceDynamic* *34d0d906a6; // 0xcc8(0x08)
	struct FStringClassReference LocalPlayerClassName; // 0xcd0(0x10)
	struct TArray<struct F*7bed299cf3> *8744020533; // 0xce0(0x10)
	struct UClass* *0b327eac45; // 0xcf0(0x08)
	float MinDesiredFrameRate; // 0xcf8(0x04)
	char pad_CFC[0x4]; // 0xcfc(0x04)
	struct UTexture2D* *5512ddb13b; // 0xd00(0x08)
	struct UTextureCube* *139a25f293; // 0xd08(0x08)
	struct UMaterial* *16717bdf0d; // 0xd10(0x08)
	struct FStringClassReference NavigationSystemClassName; // 0xd18(0x10)
	struct F*1d97e2f35e PhysicErrorCorrection; // 0xd28(0x1c)
	char pad_D44[0x4]; // 0xd44(0x04)
	struct UMaterial* *c0e0776fba; // 0xd48(0x08)
	struct FStringAssetReference DefaultBokehTextureName; // 0xd50(0x10)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0xd60(0x10)
	float RenderLightMapDensityGrayscaleScale; // 0xd70(0x04)
	char pad_D74[0x14]; // 0xd74(0x14)
	int32 *d47b04d98a; // 0xd88(0x04)
	char pad_D8C[0x1a4]; // 0xd8c(0x1a4)
};

// Class Engine.*c2c4669a63
// Size: 0x40 (Inherited: 0x30)
struct U*c2c4669a63 : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x680 (Inherited: 0x40)
struct UGameViewportClient : U*c2c4669a63 {
	char pad_40[0x2e0]; // 0x40(0x2e0)
	struct TArray<struct F*fda7674ce5> *34de75708c; // 0x320(0x10)
	char pad_330[0x270]; // 0x330(0x270)
	struct UConsole* *8ac97c4fce; // 0x5a0(0x08)
	char pad_5A8[0x58]; // 0x5a8(0x58)
	struct UGameInstance* GameInstance; // 0x600(0x08)
	char pad_608[0x78]; // 0x608(0x78)

	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x6547ed4
	int32 SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x653a248
	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0x64e606c
};

// Class Engine.Console
// Size: 0x110 (Inherited: 0x30)
struct UConsole : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct ULocalPlayer* *25aa99e4de; // 0x40(0x08)
	struct UTexture2D* *c25a475780; // 0x48(0x08)
	struct UTexture2D* *09a2d0b96a; // 0x50(0x08)
	char pad_58[0x18]; // 0x58(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x70(0x10)
	char pad_80[0x90]; // 0x80(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c8 (Inherited: 0x30)
struct UNetDriver : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct FString NetConnectionClassName; // 0x38(0x10)
	int32 MaxDownloadSize; // 0x48(0x04)
	char bClampListenServerTickRate : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32 NetServerMaxTickRate; // 0x50(0x04)
	int32 MaxInternetClientRate; // 0x54(0x04)
	int32 MaxClientRate; // 0x58(0x04)
	float ServerTravelPause; // 0x5c(0x04)
	float SpawnPrioritySeconds; // 0x60(0x04)
	float RelevantTimeout; // 0x64(0x04)
	float KeepAliveTime; // 0x68(0x04)
	float InitialConnectTimeout; // 0x6c(0x04)
	float ConnectionTimeout; // 0x70(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x74(0x04)
	bool bNoTimeouts; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UNetConnection* *614083bb45; // 0x80(0x08)
	struct TArray<struct UNetConnection*> *a7669e53d2; // 0x88(0x10)
	char pad_98[0x28]; // 0x98(0x28)
	struct UWorld* World; // 0xc0(0x08)
	struct UPackage* *a40890d105; // 0xc8(0x08)
	char pad_D0[0x20]; // 0xd0(0x20)
	struct UClass* *349976212f; // 0xf0(0x08)
	struct UProperty* *603e7c60f1; // 0xf8(0x08)
	struct UProperty* *102db0a7dd; // 0x100(0x08)
	struct FName NetDriverName; // 0x108(0x08)
	char pad_110[0x8]; // 0x110(0x08)
	float Time; // 0x118(0x04)
	char pad_11C[0x3ac]; // 0x11c(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c8)
struct UDemoNetDriver : UNetDriver {
	char pad_4C8[0xf8]; // 0x4c8(0xf8)
	struct TMap<struct FString, struct F*ca62b3ee9d> *f53af746dc; // 0x5c0(0x50)
	char pad_610[0x430]; // 0x610(0x430)
	bool *250fd8a592; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.GameEngine
// Size: 0xf90 (Inherited: 0xf30)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf30(0x04)
	float ServerFlushLogInterval; // 0xf34(0x04)
	struct UGameInstance* GameInstance; // 0xf38(0x08)
	char pad_F40[0x40]; // 0xf40(0x40)
	struct TArray<struct UWorld*> *9f9543648a; // 0xf80(0x10)
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
struct UPlayer : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	int32 *e859f7f96e; // 0x40(0x04)
	int32 ConfiguredInternetSpeed; // 0x44(0x04)
	int32 ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.NetConnection
// Size: 0x65850 (Inherited: 0x50)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UClass* *f5d4b8f8cf; // 0x68(0x08)
	struct UPackageMap* PackageMap; // 0x70(0x08)
	struct TArray<struct UChannel*> *5b232f3ac5; // 0x78(0x10)
	struct TArray<struct AActor*> *3008bea0ae; // 0x88(0x10)
	struct AActor* ViewTarget; // 0x98(0x08)
	struct AActor* *d1679cf1be; // 0xa0(0x08)
	int32 *26af5d53fc; // 0xa8(0x04)
	char *75d8776e4c : 1; // 0xac(0x01)
	char pad_AC_1 : 1; // 0xac(0x01)
	char *ad6c4fa058 : 1; // 0xac(0x01)
	char pad_AC_3 : 5; // 0xac(0x01)
	char pad_AD[0x8b]; // 0xad(0x8b)
	struct TArray<struct UChannel*> *be2f9ef971; // 0x138(0x10)
	char pad_148[0x28]; // 0x148(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x170(0x18)
	char pad_188[0x68]; // 0x188(0x68)
	double *8efce3eca0; // 0x1f0(0x08)
	char pad_1F8[0x65538]; // 0x1f8(0x65538)
	struct TArray<struct UChannel*> *0f9ee5b029; // 0x65730(0x10)
	char pad_65740[0x110]; // 0x65740(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x48 (Inherited: 0x30)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*205de32a17> ChannelDetails; // 0x30(0x10)
	float Duration; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.GameSession
// Size: 0x408 (Inherited: 0x3f0)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x3f0(0x04)
	int32 MaxPlayers; // 0x3f4(0x04)
	int32 *2ad8f4e517; // 0x3f8(0x04)
	bool MaxSplitscreensPerConnection; // 0x3fc(0x01)
	bool bRequiresPushToTalk; // 0x3fd(0x01)
	char pad_3FE[0x2]; // 0x3fe(0x02)
	struct FName SessionName; // 0x400(0x08)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc30 (Inherited: 0xb50)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*4c863aba6e> PerInstanceSMData; // 0xb50(0x10)
	int32 InstancingRandomSeed; // 0xb60(0x04)
	int32 InstanceStartCullDistance; // 0xb64(0x04)
	int32 InstanceEndCullDistance; // 0xb68(0x04)
	char pad_B6C[0x4]; // 0xb6c(0x04)
	struct TArray<int32> *27d7b53530; // 0xb70(0x10)
	struct TArray<int32> *1e6d926d08; // 0xb80(0x10)
	char pad_B90[0x78]; // 0xb90(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xc08(0x08)
	bool *51ec92abde; // 0xc10(0x01)
	char pad_C11[0x3]; // 0xc11(0x03)
	int32 *5a45105c4b; // 0xc14(0x04)
	struct TArray<struct F*91c2e21207> *e45f5a1fc9; // 0xc18(0x10)
	char pad_C28[0x8]; // 0xc28(0x08)

	int32 *fb3e7943e7(); // Function Engine.InstancedStaticMeshComponent.*fb3e7943e7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fb32c
	bool *34858cee07(); // Function Engine.InstancedStaticMeshComponent.*34858cee07 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x653e298
	bool *74896c1b04(); // Function Engine.InstancedStaticMeshComponent.*74896c1b04 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65175f8
	void *f11665ac8b(); // Function Engine.InstancedStaticMeshComponent.*f11665ac8b // Native|Public|BlueprintCallable // @ game+0x89842c
	struct TArray<int32> *e3f589368d(); // Function Engine.InstancedStaticMeshComponent.*e3f589368d // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6517eec
	bool *a236834d4b(); // Function Engine.InstancedStaticMeshComponent.*a236834d4b // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x654f058
	bool *5fa70cdbed(); // Function Engine.InstancedStaticMeshComponent.*5fa70cdbed // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6517174
	int32 *a5fc070c25(); // Function Engine.InstancedStaticMeshComponent.*a5fc070c25 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64faeec
	struct TArray<int32> *e2a0483047(); // Function Engine.InstancedStaticMeshComponent.*e2a0483047 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6517d84
	int32 *5d18775563(); // Function Engine.InstancedStaticMeshComponent.*5d18775563 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6516f94
	bool *8f18d87416(); // Function Engine.InstancedStaticMeshComponent.*8f18d87416 // Native|Public|BlueprintCallable // @ game+0x65345bc
	int32 *b2a56a014a(); // Function Engine.InstancedStaticMeshComponent.*b2a56a014a // Final|Native|Public|BlueprintCallable // @ game+0x653adf8
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xd60 (Inherited: 0xc30)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C30[0x68]; // 0xc30(0x68)
	struct TArray<int32> *1ea986fdd9; // 0xc98(0x10)
	int32 *c1094df86a; // 0xca8(0x04)
	char pad_CAC[0x4]; // 0xcac(0x04)
	struct FBox *54127f44a0; // 0xcb0(0x1c)
	struct FBox *b92c55ee01; // 0xccc(0x1c)
	struct TArray<struct FBox> *135ab4ba4c; // 0xce8(0x10)
	char pad_CF8[0x20]; // 0xcf8(0x20)
	int32 *d51b7513be; // 0xd18(0x04)
	struct FBoxSphereBounds *492020ad6c; // 0xd1c(0x1c)
	char *e0205a426d : 1; // 0xd38(0x01)
	char *80d1f14af7 : 1; // 0xd38(0x01)
	char pad_D38_2 : 6; // 0xd38(0x01)
	char pad_D39[0x27]; // 0xd39(0x27)

	bool *1ad0bfab12(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*1ad0bfab12 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6534660
};

// Class Engine.*b3661966b1
// Size: 0xd60 (Inherited: 0xd60)
struct U*b3661966b1 : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xd58(0x04)
};

// Class Engine.NavLinkProxy
// Size: 0x440 (Inherited: 0x3f0)
struct ANavLinkProxy : AActor {
	char pad_3F0[0x10]; // 0x3f0(0x10)
	struct TArray<struct FNavigationLink> PointLinks; // 0x400(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks; // 0x410(0x10)
	struct UNavLinkCustomComponent* SmartLinkComp; // 0x420(0x08)
	bool *4ca76d14ea; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct FMulticastDelegate OnSmartLinkReached; // 0x430(0x10)

	struct AActor* *2be3a03e1b(); // Function Engine.NavLinkProxy.*2be3a03e1b // Final|Native|Public|BlueprintCallable // @ game+0x64eb360
	struct FVector ReceiveSmartLinkReached(); // Function Engine.NavLinkProxy.ReceiveSmartLinkReached // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1dcd78
	bool *b31ecb569a(); // Function Engine.NavLinkProxy.*b31ecb569a // Final|Native|Public|BlueprintCallable // @ game+0x64f3a00
	bool *77f910379c(); // Function Engine.NavLinkProxy.*77f910379c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e29f8
	void *2d23854a56(); // Function Engine.NavLinkProxy.*2d23854a56 // Final|Native|Public // @ game+0xb8a940
	bool *39772e22ca(); // Function Engine.NavLinkProxy.*39772e22ca // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e3940
};

// Class Engine.LocalPlayer
// Size: 0x290 (Inherited: 0x50)
struct ULocalPlayer : UPlayer {
	char pad_50[0x18]; // 0x50(0x18)
	struct UClass* *dba1add6cc; // 0x68(0x08)
	char pad_70[0x78]; // 0x70(0x78)
	char *c4e1796760 : 1; // 0xe8(0x01)
	char pad_E8_1 : 7; // 0xe8(0x01)
	char pad_E9[0x1a7]; // 0xe9(0x1a7)
};

// Class Engine.*987a7e4edb
// Size: 0x30 (Inherited: 0x30)
struct U*987a7e4edb : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1cc0 (Inherited: 0x3f0)
struct APlayerCameraManager : AActor {
	struct APlayerController* *337303fb79; // 0x3f0(0x08)
	struct USceneComponent* TransformComponent; // 0x3f8(0x08)
	char pad_400[0x4]; // 0x400(0x04)
	float ViewPitchMin; // 0x404(0x04)
	float ViewRollMin; // 0x408(0x04)
	char pad_40C[0x4]; // 0x40c(0x04)
	float DefaultOrthoWidth; // 0x410(0x04)
	char pad_414[0xc]; // 0x414(0x0c)
	struct F*4156116286 *3db2ea3e19; // 0x420(0x5c0)
	float FreeCamDistance; // 0x9e0(0x04)
	char pad_9E4[0xc]; // 0x9e4(0x0c)
	struct F*4156116286 *b9e38e345e; // 0x9f0(0x5c0)
	float ViewPitchMax; // 0xfb0(0x04)
	float ViewRollMax; // 0xfb4(0x04)
	float DefaultAspectRatio; // 0xfb8(0x04)
	float ViewYawMin; // 0xfbc(0x04)
	struct FVector FreeCamOffset; // 0xfc0(0x0c)
	char pad_FCC[0xc]; // 0xfcc(0x0c)
	float ViewYawMax; // 0xfd8(0x04)
	char pad_FDC[0x4]; // 0xfdc(0x04)
	struct F*8aa6907eaa ViewTarget; // 0xfe0(0x5d0)
	float DefaultFOV; // 0x15b0(0x04)
	char pad_15B4[0x4]; // 0x15b4(0x04)
	struct TArray<struct U*6f88f7780c*> *3ba8d1be87; // 0x15b8(0x10)
	char pad_15C8[0x10]; // 0x15c8(0x10)
	struct FVector ViewTargetOffset; // 0x15d8(0x0c)
	char pad_15E4[0x1c]; // 0x15e4(0x1c)
	struct TArray<struct UClass*> DefaultModifiers; // 0x1600(0x10)
	struct TArray<struct AEmitterCameraLensEffectBase*> *8de88dbdb2; // 0x1610(0x10)
	struct U*b78b10b0de* *31a29477e5; // 0x1620(0x08)
	struct U*6ec4247e64* *4f634c058f[0x08]; // 0x1628(0x40)
	struct TArray<struct FPostProcessSettings> *08ad61c413; // 0x1668(0x10)
	char pad_1678[0x10]; // 0x1678(0x10)
	struct TArray<struct U*6ec4247e64*> *618c273364; // 0x1688(0x10)
	struct TArray<struct U*6ec4247e64*> *9a08cca306; // 0x1698(0x10)
	struct ACameraActor* *a53a740657; // 0x16a8(0x08)
	char bIsOrthographic : 1; // 0x16b0(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x16b0(0x01)
	char pad_16B0_2 : 5; // 0x16b0(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x16b0(0x01)
	char pad_16B1[0x2f]; // 0x16b1(0x2f)
	struct F*8aa6907eaa *c127c2df70; // 0x16e0(0x5d0)
	char pad_1CB0[0x10]; // 0x1cb0(0x10)

	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x58036e8
	struct AEmitterCameraLensEffectBase* *e8095d1352(); // Function Engine.PlayerCameraManager.*e8095d1352 // Native|Public|BlueprintCallable // @ game+0x64d34c0
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0xd8afb0
	bool *2e8b0c44f7(); // Function Engine.PlayerCameraManager.*2e8b0c44f7 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f51e0
	void *c088fc72a2(); // Function Engine.PlayerCameraManager.*c088fc72a2 // Native|Public|BlueprintCallable // @ game+0x64f5954
	struct FVector *fb39f794ac(); // Function Engine.PlayerCameraManager.*fb39f794ac // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xaa484c
	bool *1f80dc24b8(); // Function Engine.PlayerCameraManager.*1f80dc24b8 // Native|Public|BlueprintCallable // @ game+0x64f56f8
	struct U*6f88f7780c* *425fe6edc8(); // Function Engine.PlayerCameraManager.*425fe6edc8 // Native|Public|BlueprintCallable // @ game+0x64dbc3c
	bool *525fdb233a(); // Function Engine.PlayerCameraManager.*525fdb233a // Native|Public|BlueprintCallable // @ game+0x64f5870
	struct U*6ec4247e64* *8bc8bf3569(); // Function Engine.PlayerCameraManager.*8bc8bf3569 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ea090
	bool *7b429467f1(); // Function Engine.PlayerCameraManager.*7b429467f1 // Native|Public|BlueprintCallable // @ game+0x64f54e4
	struct FVector PhotographyCameraModify(); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x64e9cfc
	float *b6fe6d34c7(); // Function Engine.PlayerCameraManager.*b6fe6d34c7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de7a8
	void *2aa021959f(); // Function Engine.PlayerCameraManager.*2aa021959f // Native|Public|BlueprintCallable // @ game+0x5769978
	bool BlueprintUpdateCamera(); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1dcd78
	bool *8e5bd58a3c(); // Function Engine.PlayerCameraManager.*8e5bd58a3c // Native|Public|BlueprintCallable // @ game+0x64f596c
	bool *60f87ce7b1(); // Function Engine.PlayerCameraManager.*60f87ce7b1 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f222c
	struct APlayerController* *7eacfe0be3(); // Function Engine.PlayerCameraManager.*7eacfe0be3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x57c69d0
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x70c8cc
	bool *21c6524708(); // Function Engine.PlayerCameraManager.*21c6524708 // Native|Public|BlueprintCallable // @ game+0x64f5614
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x57c9afc
	struct AEmitterCameraLensEffectBase* *16a0f6ce64(); // Function Engine.PlayerCameraManager.*16a0f6ce64 // Native|Public|BlueprintCallable // @ game+0x64eabd0
	struct UCameraShake* *81fbfd81fe(); // Function Engine.PlayerCameraManager.*81fbfd81fe // Native|Public|HasDefaults|BlueprintCallable // @ game+0xc07644
	struct FRotator *77a059e7d8(); // Function Engine.PlayerCameraManager.*77a059e7d8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd7b4
	bool *cb0d0af535(); // Function Engine.PlayerCameraManager.*cb0d0af535 // Native|Public|BlueprintCallable // @ game+0x64eac64
	struct U*6f88f7780c* *02258300bf(); // Function Engine.PlayerCameraManager.*02258300bf // Native|Public|BlueprintCallable // @ game+0x64d48dc
	bool *2afd20dc05(); // Function Engine.PlayerCameraManager.*2afd20dc05 // Native|Public|BlueprintCallable // @ game+0x64f557c
};

// Class Engine.PlayerInput
// Size: 0x490 (Inherited: 0x30)
struct UPlayerInput : UObject {
	char pad_30[0xf8]; // 0x30(0xf8)
	struct TArray<struct F*2717edfafa> DebugExecBindings; // 0x128(0x10)
	char pad_138[0x30]; // 0x138(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x168(0x10)
	char pad_178[0x318]; // 0x178(0x318)

	float SetGamePadSensitivity(); // Function Engine.PlayerInput.SetGamePadSensitivity // Final|Exec|Native|Public // @ game+0x64f1360
	float SetGamePadSensitivityOf(); // Function Engine.PlayerInput.SetGamePadSensitivityOf // Final|Exec|Native|Public // @ game+0x64f13f8
	struct FName InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x64e2be4
	struct FKey InvertAxisKey(); // Function Engine.PlayerInput.InvertAxisKey // Final|Exec|Native|Public // @ game+0x64e2c74
	struct FString SetBind(); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x64ef930
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // Final|Exec|Native|Public // @ game+0x64d5fc8
	float SetMouseSensitivity(); // Function Engine.PlayerInput.SetMouseSensitivity // Final|Exec|Native|Public // @ game+0x64f281c
	float SetGamePadDeadZone(); // Function Engine.PlayerInput.SetGamePadDeadZone // Final|Exec|Native|Public // @ game+0x64f118c
	float SetGamePadDeadZoneOf(); // Function Engine.PlayerInput.SetGamePadDeadZoneOf // Final|Exec|Native|Public // @ game+0x64f1224
};

// Class Engine.NavigationData
// Size: 0x598 (Inherited: 0x3f0)
struct ANavigationData : AActor {
	struct UPrimitiveComponent* RenderingComp; // 0x3f0(0x08)
	struct F*462177a17f *462177a17f; // 0x3f8(0x50)
	char *bac07b4450 : 1; // 0x448(0x01)
	char bForceRebuildOnLoad : 1; // 0x448(0x01)
	char bCanBeMainNavData : 1; // 0x448(0x01)
	char bCanSpawnOnRebuild : 1; // 0x448(0x01)
	char bRebuildAtRuntime : 1; // 0x448(0x01)
	char pad_448_5 : 3; // 0x448(0x01)
	char pad_449[0x3]; // 0x449(0x03)
	enum class ERuntimeGenerationType RuntimeGeneration; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	float ObservedPathsTickInterval; // 0x450(0x04)
	char *2ebe96be74 : 1; // 0x454(0x01)
	char pad_454_1 : 7; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
	uint32 DataVersion; // 0x458(0x04)
	char pad_45C[0xd4]; // 0x45c(0xd4)
	struct TArray<struct F*0d9672f37f> *d7200b38ad; // 0x530(0x10)
	char pad_540[0x58]; // 0x540(0x58)
};

// Class Engine.RecastNavMesh
// Size: 0x6b0 (Inherited: 0x598)
struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x598(0x01)
	char bDrawPolyEdges : 1; // 0x598(0x01)
	char bDrawFilledPolys : 1; // 0x598(0x01)
	char bDrawNavMeshEdges : 1; // 0x598(0x01)
	char *6c6c1af813 : 1; // 0x598(0x01)
	char *e038d03c15 : 1; // 0x598(0x01)
	char *562f95af0f : 1; // 0x598(0x01)
	char *9f56e33560 : 1; // 0x598(0x01)
	char *222ec416dc : 1; // 0x599(0x01)
	char *411252ef0e : 1; // 0x599(0x01)
	char *3fc58fe4e3 : 1; // 0x599(0x01)
	char *56901851bd : 1; // 0x599(0x01)
	char *976f67927b : 1; // 0x599(0x01)
	char *3a378a3576 : 1; // 0x599(0x01)
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x599(0x01)
	char *3186dc8861 : 1; // 0x599(0x01)
	char pad_59A[0x2]; // 0x59a(0x02)
	float DrawOffset; // 0x59c(0x04)
	char bFixedTilePoolSize : 1; // 0x5a0(0x01)
	char pad_5A0_1 : 7; // 0x5a0(0x01)
	char pad_5A1[0x3]; // 0x5a1(0x03)
	int32 TilePoolSize; // 0x5a4(0x04)
	float TileSizeUU; // 0x5a8(0x04)
	float CellSize; // 0x5ac(0x04)
	float CellHeight; // 0x5b0(0x04)
	float AgentRadius; // 0x5b4(0x04)
	float AgentHeight; // 0x5b8(0x04)
	float AgentMaxHeight; // 0x5bc(0x04)
	float AgentMaxSlope; // 0x5c0(0x04)
	float AgentMaxStepHeight; // 0x5c4(0x04)
	float MinRegionArea; // 0x5c8(0x04)
	float MergeRegionSize; // 0x5cc(0x04)
	float MaxSimplificationError; // 0x5d0(0x04)
	int32 MaxSimultaneousTileGenerationJobsCount; // 0x5d4(0x04)
	int32 TileNumberHardLimit; // 0x5d8(0x04)
	int32 *30c0de5171; // 0x5dc(0x04)
	int32 *880eefab19; // 0x5e0(0x04)
	int32 *02abe6f742; // 0x5e4(0x04)
	float DefaultDrawDistance; // 0x5e8(0x04)
	float DefaultMaxSearchNodes; // 0x5ec(0x04)
	float DefaultMaxHierarchicalSearchNodes; // 0x5f0(0x04)
	enum class ERecastPartitioning RegionPartitioning; // 0x5f4(0x01)
	enum class ERecastPartitioning LayerPartitioning; // 0x5f5(0x01)
	char pad_5F6[0x2]; // 0x5f6(0x02)
	int32 RegionChunkSplits; // 0x5f8(0x04)
	int32 LayerChunkSplits; // 0x5fc(0x04)
	char bSortNavigationAreasByCost : 1; // 0x600(0x01)
	char bPerformVoxelFiltering : 1; // 0x600(0x01)
	char bMarkLowHeightAreas : 1; // 0x600(0x01)
	char bDoFullyAsyncNavDataGathering : 1; // 0x600(0x01)
	char bUseBetterOffsetsFromCorners : 1; // 0x600(0x01)
	char bStoreEmptyTileLayers : 1; // 0x600(0x01)
	char bUseVirtualFilters : 1; // 0x600(0x01)
	char bAllowNavLinkAsPathEnd : 1; // 0x600(0x01)
	char pad_601[0x3]; // 0x601(0x03)
	bool bOnlySavedOnDS; // 0x604(0x01)
	char pad_605[0x3]; // 0x605(0x03)
	char bUseVoxelCache : 1; // 0x608(0x01)
	char pad_608_1 : 7; // 0x608(0x01)
	char pad_609[0x3]; // 0x609(0x03)
	float TileSetUpdateInterval; // 0x60c(0x04)
	float HeuristicScale; // 0x610(0x04)
	float VerticalDeviationFromGroundCompensation; // 0x614(0x04)
	char pad_618[0x98]; // 0x618(0x98)
};

// Class Engine.*095debd2a0
// Size: 0x40 (Inherited: 0x30)
struct U*095debd2a0 : UObject {
	struct TArray<struct F*94b0348d76> *fed618dac9; // 0x30(0x10)
};

// Class Engine.SceneCaptureComponent
// Size: 0x500 (Inherited: 0x480)
struct USceneCaptureComponent : USceneComponent {
	struct TArray<struct UPrimitiveComponent*> *ef56703d53; // 0x478(0x10)
	struct TArray<struct AActor*> HiddenActors; // 0x488(0x10)
	struct TArray<struct UPrimitiveComponent*> *331673c74c; // 0x498(0x10)
	struct TArray<struct AActor*> ShowOnlyActors; // 0x4a8(0x10)
	bool bIsLobbyCapture; // 0x4b8(0x01)
	bool bCaptureEveryFrame; // 0x4b9(0x01)
	bool bCaptureOnMovement; // 0x4ba(0x01)
	float LODDistanceFactor; // 0x4bc(0x04)
	float MaxViewDistanceOverride; // 0x4c0(0x04)
	int32 CaptureSortPriority; // 0x4c4(0x04)
	struct TArray<struct F*b7c981d2f2> ShowFlagSettings; // 0x4c8(0x10)
	char pad_4DF[0x21]; // 0x4df(0x21)

	struct AActor* *19e9f39c55(); // Function Engine.SceneCaptureComponent.*19e9f39c55 // Final|Native|Public|BlueprintCallable // @ game+0x652047c
	struct UPrimitiveComponent* *65ed61b800(); // Function Engine.SceneCaptureComponent.*65ed61b800 // Final|Native|Public|BlueprintCallable // @ game+0x652061c
	struct UPrimitiveComponent* *e17a9e386f(); // Function Engine.SceneCaptureComponent.*e17a9e386f // Final|Native|Public|BlueprintCallable // @ game+0x653493c
	struct AActor* *49d5d2a458(); // Function Engine.SceneCaptureComponent.*49d5d2a458 // Final|Native|Public|BlueprintCallable // @ game+0x6547c44
	int32 *1248442e38(); // Function Engine.SceneCaptureComponent.*1248442e38 // Final|Native|Public|BlueprintCallable // @ game+0x65397ec
	struct UPrimitiveComponent* *779e2d00c6(); // Function Engine.SceneCaptureComponent.*779e2d00c6 // Final|Native|Public|BlueprintCallable // @ game+0x6507b30
	struct AActor* *f3cad6b200(); // Function Engine.SceneCaptureComponent.*f3cad6b200 // Final|Native|Public|BlueprintCallable // @ game+0x65348ac
	struct UPrimitiveComponent* *4136dcbbf8(); // Function Engine.SceneCaptureComponent.*4136dcbbf8 // Final|Native|Public|BlueprintCallable // @ game+0x6547cd4
};

// Class Engine.SceneCaptureComponent2D
// Size: 0xb30 (Inherited: 0x500)
struct USceneCaptureComponent2D : USceneCaptureComponent {
	enum class ECameraProjectionMode ProjectionType; // 0x4f8(0x01)
	float FOVAngle; // 0x4fc(0x04)
	bool *0fe8ec7f05; // 0x500(0x01)
	float *3c48c0d9c6; // 0x504(0x04)
	float OrthoWidth; // 0x508(0x04)
	char pad_50E[0x2]; // 0x50e(0x02)
	struct UTextureRenderTarget2D* TextureTarget; // 0x510(0x08)
	enum class *b7ca9f4a0d CaptureSource; // 0x518(0x01)
	enum class *d1df128539 CompositeMode; // 0x519(0x01)
	char pad_51A[0x2]; // 0x51a(0x02)
	struct FLinearColor LightingOnlyBrightness; // 0x51c(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x52c(0x10)
	struct FLinearColor LightingOnlyCustomData; // 0x53c(0x10)
	float LightingOnlyCustomDataAlpha; // 0x54c(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x550(0x570)
	float PostProcessBlendWeight; // 0xac0(0x04)
	bool bUseCustomProjectionMatrix; // 0xac4(0x01)
	char pad_AC5[0xb]; // 0xac5(0x0b)
	struct FMatrix CustomProjectionMatrix; // 0xad0(0x40)
	char *32c0f2ecda : 1; // 0xb10(0x01)
	char pad_B10_1 : 7; // 0xb10(0x01)
	char pad_B11[0x3]; // 0xb11(0x03)
	bool bEnableClipPlane; // 0xb14(0x01)
	char pad_B15[0x3]; // 0xb15(0x03)
	struct FVector ClipPlaneBase; // 0xb18(0x0c)
	struct FVector ClipPlaneNormal; // 0xb24(0x0c)

	void CaptureScene(); // Function Engine.SceneCaptureComponent2D.CaptureScene // Final|Native|Public|BlueprintCallable // @ game+0x6507434
	float *279e5ee7e9(); // Function Engine.SceneCaptureComponent2D.*279e5ee7e9 // Final|Native|Public|BlueprintCallable // @ game+0x64fb748
};

// Class Engine.ArrowComponent
// Size: 0x9c0 (Inherited: 0x9b0)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor; // 0x9a8(0x04)
	float ArrowSize; // 0x9ac(0x04)
	bool bIsScreenSizeScaled; // 0x9b0(0x01)
	float ScreenSize; // 0x9b4(0x04)
	char bTreatAsASprite : 1; // 0x9b8(0x01)
	char pad_9BD_1 : 7; // 0x9bd(0x01)
	char pad_9BE[0x2]; // 0x9be(0x02)

	struct FLinearColor SetArrowColor(); // Function Engine.ArrowComponent.SetArrowColor // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6537c60
};

// Class Engine.NavModifierVolume
// Size: 0x438 (Inherited: 0x428)
struct ANavModifierVolume : AVolume {
	char pad_428[0x8]; // 0x428(0x08)
	struct UClass* AreaClass; // 0x430(0x08)

	struct UClass* *d8bfb93e76(); // Function Engine.NavModifierVolume.*d8bfb93e76 // Final|Native|Public|BlueprintCallable // @ game+0x64ee904
};

// Class Engine.ParticleSystemComponent
// Size: 0xc10 (Inherited: 0x9b0)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template; // 0x9a8(0x08)
	struct TArray<struct UMaterialInterface*> *00f7198f74; // 0x9b0(0x10)
	struct TArray<struct USkeletalMeshComponent*> *5a07e1add1; // 0x9c0(0x10)
	char pad_9D8_0 : 7; // 0x9d8(0x01)
	char bResetOnDetach : 1; // 0x9d0(0x01)
	char *ff8d451cae : 1; // 0x9d1(0x01)
	char bAllowRecycling : 1; // 0x9d1(0x01)
	char bAutoManageAttachment : 1; // 0x9d1(0x01)
	char *a2f085d08c : 1; // 0x9d1(0x01)
	char bOverrideLODMethod : 1; // 0x9d2(0x01)
	char *0ba5990fe1 : 1; // 0x9d2(0x01)
	char *7273167b2a : 1; // 0x9d2(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0x9d8(0x10)
	struct FMulticastDelegate OnParticleSpawn; // 0x9e8(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x9f8(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0xa08(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0xa18(0x10)
	struct FVector *133f54f9c1; // 0xa28(0x0c)
	struct FVector *03cebd95ff; // 0xa34(0x0c)
	float WarmupTime; // 0xa40(0x04)
	float *21f822f4fc; // 0xa44(0x04)
	char pad_A49[0x3]; // 0xa49(0x03)
	float SecondsBeforeInactive; // 0xa4c(0x04)
	char pad_A50[0x4]; // 0xa50(0x04)
	float *28094ea3db; // 0xa54(0x04)
	char pad_A58[0x8]; // 0xa58(0x08)
	enum class *d8246e725f LODMethod; // 0xa60(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0xa61(0x01)
	char pad_A62[0x16]; // 0xa62(0x16)
	struct TArray<struct U*e7dabfb57c*> *69abc3880d; // 0xa78(0x10)
	char pad_A88[0x60]; // 0xa88(0x60)
	float CustomTimeDilation; // 0xae8(0x04)
	char pad_AEC[0x4]; // 0xaec(0x04)
	struct FMulticastDelegate OnSystemFinished; // 0xaf0(0x10)
	struct USceneComponent* AutoAttachParent; // 0xb00(0x08)
	struct FName AutoAttachSocketName; // 0xb08(0x08)
	enum class EAttachLocation AutoAttachLocationType; // 0xb10(0x01)
	enum class EAttachmentRule AutoAttachLocationRule; // 0xb11(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0xb12(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0xb13(0x01)
	char pad_B14[0xfc]; // 0xb14(0xfc)

	enum class EAttachmentRule *af8f2729da(); // Function Engine.ParticleSystemComponent.*af8f2729da // Final|Native|Public|BlueprintCallable // @ game+0x64eecbc
	bool *9016027b91(); // Function Engine.ParticleSystemComponent.*9016027b91 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd13c
	int32 *8f3b7c4a62(); // Function Engine.ParticleSystemComponent.*8f3b7c4a62 // Native|Public|BlueprintCallable // @ game+0x64ef32c
	struct UParticleSystem* *23a60326d0(); // Function Engine.ParticleSystemComponent.*23a60326d0 // Final|Native|Public|BlueprintCallable // @ game+0x64f3cec
	struct UMaterialInterface* *8dd7e62706(); // Function Engine.ParticleSystemComponent.*8dd7e62706 // Final|Native|Public|BlueprintCallable // @ game+0x64f2668
	bool *4a5ebe8285(); // Function Engine.ParticleSystemComponent.*4a5ebe8285 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd280
	struct AActor* *5da5ae8752(); // Function Engine.ParticleSystemComponent.*5da5ae8752 // Final|Native|Public|BlueprintCallable // @ game+0x64ee1f8
	int32 *9c94a2ccab(); // Function Engine.ParticleSystemComponent.*9c94a2ccab // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ef7f4
	int32 *bb78f88ed2(); // Function Engine.ParticleSystemComponent.*bb78f88ed2 // Native|Public|BlueprintCallable // @ game+0x64ef6cc
	struct FVector *8fbddde934(); // Function Engine.ParticleSystemComponent.*8fbddde934 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f4670
	struct FVector *b5b49ed10a(); // Function Engine.ParticleSystemComponent.*b5b49ed10a // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ef0f4
	int32 *cc31ded515(); // Function Engine.ParticleSystemComponent.*cc31ded515 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0cf4
	struct UMaterialInstanceDynamic* *e0804ccf30(); // Function Engine.ParticleSystemComponent.*e0804ccf30 // Native|Public|BlueprintCallable // @ game+0x64d96b0
	float *5e90794424(); // Function Engine.ParticleSystemComponent.*5e90794424 // Final|Native|Public|BlueprintCallable // @ game+0x64f3fc4
	bool *91864b1bfc(); // Function Engine.ParticleSystemComponent.*91864b1bfc // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd3c4
	bool *81aa9c9e01(); // Function Engine.ParticleSystemComponent.*81aa9c9e01 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcffc
	float SetFloatParameter(); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x64f100c
	void *dcd1366a40(); // Function Engine.ParticleSystemComponent.*dcd1366a40 // Final|Native|Public|BlueprintCallable // @ game+0x64db998
	int32 *87d95bf46d(); // Function Engine.ParticleSystemComponent.*87d95bf46d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ef454
	int32 *5a5e9d1b9b(); // Function Engine.ParticleSystemComponent.*5a5e9d1b9b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ef590
	float *56ca8e695c(); // Function Engine.ParticleSystemComponent.*56ca8e695c // Final|Native|Public|BlueprintCallable // @ game+0x64d548c
	bool *ffaa140e86(); // Function Engine.ParticleSystemComponent.*ffaa140e86 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd504
	struct FVector *c5fef19fba(); // Function Engine.ParticleSystemComponent.*c5fef19fba // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64dbea0
	bool *d026be7050(); // Function Engine.ParticleSystemComponent.*d026be7050 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dcdc0
	int32 *d65be3badb(); // Function Engine.ParticleSystemComponent.*d65be3badb // Native|Public|HasDefaults|BlueprintCallable // @ game+0x64ef1f0
	enum class EAttachLocation *0a63d98f02(); // Function Engine.ParticleSystemComponent.*0a63d98f02 // Final|Native|Public|BlueprintCallable // @ game+0x64eeb74
	struct FLinearColor *2b029e7d25(); // Function Engine.ParticleSystemComponent.*2b029e7d25 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f05a0
	bool *d513b656ba(); // Function Engine.ParticleSystemComponent.*d513b656ba // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dceb8
	bool *4bf991f689(); // Function Engine.ParticleSystemComponent.*4bf991f689 // Native|Public|BlueprintCallable // @ game+0x64f0c48
	struct UMaterialInterface* *5a1c100be7(); // Function Engine.ParticleSystemComponent.*5a1c100be7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0aac
};

// Class Engine.DefaultPawn
// Size: 0x478 (Inherited: 0x450)
struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x450(0x04)
	float BaseLookUpRate; // 0x454(0x04)
	struct UPawnMovementComponent* MovementComponent; // 0x458(0x08)
	struct USphereComponent* CollisionComponent; // 0x460(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x468(0x08)
	char bAddDefaultMovementBindings : 1; // 0x470(0x01)
	char pad_470_1 : 7; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)

	float *b7bc4778c8(); // Function Engine.DefaultPawn.*b7bc4778c8 // Native|Public|BlueprintCallable // @ game+0x64e96ac
	float MoveRight(); // Function Engine.DefaultPawn.MoveRight // Native|Public|BlueprintCallable // @ game+0x64e9610
	float MoveForward(); // Function Engine.DefaultPawn.MoveForward // Native|Public|BlueprintCallable // @ game+0x64e9574
	float *100c4e8c95(); // Function Engine.DefaultPawn.*100c4e8c95 // Final|Native|Public|BlueprintCallable // @ game+0x64f5ef4
	float *f6d7ca130e(); // Function Engine.DefaultPawn.*f6d7ca130e // Final|Native|Public|BlueprintCallable // @ game+0x64e9280
};

// Class Engine.SpectatorPawn
// Size: 0x478 (Inherited: 0x478)
struct ASpectatorPawn : ADefaultPawn {
};

// Class Engine.FloatingPawnMovement
// Size: 0x2a0 (Inherited: 0x290)
struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x288(0x04)
	float Acceleration; // 0x28c(0x04)
	float Deceleration; // 0x290(0x04)
	float TurningBoost; // 0x294(0x04)
	char *764464ee1e : 1; // 0x298(0x01)
};

// Class Engine.SpectatorPawnMovement
// Size: 0x2b0 (Inherited: 0x2a0)
struct USpectatorPawnMovement : UFloatingPawnMovement {
	char *4c44f735ef : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0xf]; // 0x2a1(0x0f)
};

// Class Engine.SplineComponent
// Size: 0xaa0 (Inherited: 0x9b0)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves *224d387ba3; // 0x9a8(0x60)
	struct FInterpCurveVector SplineInfo; // 0xa08(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0xa20(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0xa38(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0xa50(0x18)
	bool bAllowSplineEditingPerInstance; // 0xa68(0x01)
	int32 *f8e649923a; // 0xa6c(0x04)
	bool *f2a977ad56; // 0xa70(0x01)
	bool *2893c957ff; // 0xa71(0x01)
	float *cdd4b1628c; // 0xa74(0x04)
	float Duration; // 0xa78(0x04)
	bool bStationaryEndpoints; // 0xa7c(0x01)
	bool *1e587541cf; // 0xa7d(0x01)
	bool *49d508f387; // 0xa7e(0x01)
	bool bInputSplinePointsToConstructionScript; // 0xa7f(0x01)
	bool bDrawDebug; // 0xa80(0x01)
	bool *c5ecf4ffed; // 0xa81(0x01)
	bool bLoopPositionOverride; // 0xa82(0x01)
	float *f6c05ad304; // 0xa84(0x04)
	struct FVector DefaultUpVector; // 0xa88(0x0c)
	char pad_A96[0xa]; // 0xa96(0x0a)

	struct FRotator *d673f600e5(); // Function Engine.SplineComponent.*d673f600e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651b1f8
	float *8ecb0fa226(); // Function Engine.SplineComponent.*8ecb0fa226 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65114bc
	struct FVector *fdf9e67fe7(); // Function Engine.SplineComponent.*fdf9e67fe7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fbaa8
	float *6ead38f785(); // Function Engine.SplineComponent.*6ead38f785 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651aee0
	struct FVector *7408da665f(); // Function Engine.SplineComponent.*7408da665f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6510cf4
	float *8b88c5dc14(); // Function Engine.SplineComponent.*8b88c5dc14 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6518694
	struct FRotator *13b012d465(); // Function Engine.SplineComponent.*13b012d465 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651b2f8
	struct FTransform *ce47968eb4(); // Function Engine.SplineComponent.*ce47968eb4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651d5d4
	struct FRotator *c6a9416911(); // Function Engine.SplineComponent.*c6a9416911 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65115c0
	struct FVector *3710f7f090(); // Function Engine.SplineComponent.*3710f7f090 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65117b8
	struct FVector *a9c9c456e5(); // Function Engine.SplineComponent.*a9c9c456e5 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65116f0
	struct FVector *8c35d1f7f5(); // Function Engine.SplineComponent.*8c35d1f7f5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65158b4
	bool *1660da9917(); // Function Engine.SplineComponent.*1660da9917 // Final|Native|Public|BlueprintCallable // @ game+0x65349dc
	bool *3195c7e671(); // Function Engine.SplineComponent.*3195c7e671 // Final|Native|Public|BlueprintCallable // @ game+0x6507e94
	bool *d87c8d6bad(); // Function Engine.SplineComponent.*d87c8d6bad // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6521ab8
	struct FVector *f4439078ed(); // Function Engine.SplineComponent.*f4439078ed // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518860
	struct FTransform *ce6002c659(); // Function Engine.SplineComponent.*ce6002c659 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651d8f4
	float *33bc2a12af(); // Function Engine.SplineComponent.*33bc2a12af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x65167cc
	struct FVector *4c7f033e12(); // Function Engine.SplineComponent.*4c7f033e12 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651eb28
	struct FVector *bed6cf0bd0(); // Function Engine.SplineComponent.*bed6cf0bd0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651e8a0
	struct FVector *7c17f0a4fe(); // Function Engine.SplineComponent.*7c17f0a4fe // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6515ab0
	float *6aa9eb9d3e(); // Function Engine.SplineComponent.*6aa9eb9d3e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651beb0
	void *94d245fc05(); // Function Engine.SplineComponent.*94d245fc05 // Final|Native|Public|BlueprintCallable // @ game+0x654f2d4
	struct FVector *8310eb6ecf(); // Function Engine.SplineComponent.*8310eb6ecf // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518570
	struct FVector *46b2142b51(); // Function Engine.SplineComponent.*46b2142b51 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651e9b0
	struct FLinearColor *66b7b68804(); // Function Engine.SplineComponent.*66b7b68804 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64f0858
	struct FVector *ade3704335(); // Function Engine.SplineComponent.*ade3704335 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fbe1c
	struct FVector *0934b4ef0b(); // Function Engine.SplineComponent.*0934b4ef0b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518b58
	struct FVector *a905ae0b50(); // Function Engine.SplineComponent.*a905ae0b50 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651eea8
	enum class ESplineCoordinateSpace *5e679265d5(); // Function Engine.SplineComponent.*5e679265d5 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65189b8
	enum class ESplinePointType *959750a15a(); // Function Engine.SplineComponent.*959750a15a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651bed8
	struct FVector *f3e6cc0da5(); // Function Engine.SplineComponent.*f3e6cc0da5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518570
	bool SetSplinePointType(); // Function Engine.SplineComponent.SetSplinePointType // Final|Native|Public|BlueprintCallable // @ game+0x6542d84
	bool *9608efba38(); // Function Engine.SplineComponent.*9608efba38 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64fb85c
	struct FVector *646a979561(); // Function Engine.SplineComponent.*646a979561 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651b65c
	bool AddSplinePoint(); // Function Engine.SplineComponent.AddSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fbb48
	struct FVector *746eb47343(); // Function Engine.SplineComponent.*746eb47343 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651334c
	bool *1a380c46df(); // Function Engine.SplineComponent.*1a380c46df // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64fbc90
	struct TArray<struct FVector> *19cbff31f5(); // Function Engine.SplineComponent.*19cbff31f5 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x654311c
	struct FRotator *f774fd53f0(); // Function Engine.SplineComponent.*f774fd53f0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ed98
	bool *403b71cbdf(); // Function Engine.SplineComponent.*403b71cbdf // Final|Native|Public|BlueprintCallable // @ game+0x653b938
	struct TArray<struct FVector> *1933a88fb1(); // Function Engine.SplineComponent.*1933a88fb1 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6542cb8
	bool *b8941565d3(); // Function Engine.SplineComponent.*b8941565d3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6543ff8
	bool *4bd1c9f850(); // Function Engine.SplineComponent.*4bd1c9f850 // Final|Native|Public|BlueprintCallable // @ game+0x6539e58
	struct FVector *f8859c177b(); // Function Engine.SplineComponent.*f8859c177b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6511398
	bool *2924338abc(); // Function Engine.SplineComponent.*2924338abc // Final|Native|Public|BlueprintCallable // @ game+0x6539f50
	struct FRotator *501b9a11ab(); // Function Engine.SplineComponent.*501b9a11ab // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651b3f4
	float *9e14956702(); // Function Engine.SplineComponent.*9e14956702 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651b0c0
	struct FVector *56f46e0ef4(); // Function Engine.SplineComponent.*56f46e0ef4 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6511a64
	struct FVector *1b5eaab969(); // Function Engine.SplineComponent.*1b5eaab969 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ad98
	float *4504979742(); // Function Engine.SplineComponent.*4504979742 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6510e18
	struct FRotator *eda55d2a75(); // Function Engine.SplineComponent.*eda55d2a75 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ecd8
	bool *f34dca8240(); // Function Engine.SplineComponent.*f34dca8240 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6542eb4
	struct FVector *7f0073e87c(); // Function Engine.SplineComponent.*7f0073e87c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ea70
	struct FVector *47ea0cb673(); // Function Engine.SplineComponent.*47ea0cb673 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ab64
	struct FVector *c7a047602a(); // Function Engine.SplineComponent.*c7a047602a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x65460cc
	bool *256a13f2fc(); // Function Engine.SplineComponent.*256a13f2fc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x653fc44
	struct FVector *7ec8746925(); // Function Engine.SplineComponent.*7ec8746925 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518d54
	bool *c4855fe4f1(); // Function Engine.SplineComponent.*c4855fe4f1 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64fb978
	struct FVector *8a52c93cee(); // Function Engine.SplineComponent.*8a52c93cee // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651e1e8
	struct FVector *b453b9e47e(); // Function Engine.SplineComponent.*b453b9e47e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6518c58
	struct FTransform *03a69497f9(); // Function Engine.SplineComponent.*03a69497f9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651d748
	struct FVector *6bb1fc9463(); // Function Engine.SplineComponent.*6bb1fc9463 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651b714
	struct FVector *c80b104bf3(); // Function Engine.SplineComponent.*c80b104bf3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651e0b4
	struct FVector *4c5972a9ee(); // Function Engine.SplineComponent.*4c5972a9ee // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6515678
	struct FVector *5ff9d6f2ec(); // Function Engine.SplineComponent.*5ff9d6f2ec // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65159b4
	float *569d25225d(); // Function Engine.SplineComponent.*569d25225d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6515dec
	bool *ff1b454d4c(); // Function Engine.SplineComponent.*ff1b454d4c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6544184
	bool *fb6ac9935d(); // Function Engine.SplineComponent.*fb6ac9935d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6544ecc
	struct FVector *1c8bc77998(); // Function Engine.SplineComponent.*1c8bc77998 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651dfb4
	int32 GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651938c
	float *25a54483b3(); // Function Engine.SplineComponent.*25a54483b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x651afd4
	struct FVector *df6beb22a8(); // Function Engine.SplineComponent.*df6beb22a8 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6510ec4
	struct FTransform *735d907566(); // Function Engine.SplineComponent.*735d907566 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x65118dc
	struct FVector *79680f8e7c(); // Function Engine.SplineComponent.*79680f8e7c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651e7e0
	struct FVector *4d42091b21(); // Function Engine.SplineComponent.*4d42091b21 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651b7e8
	enum class ESplineCoordinateSpace *bbab5ff12a(); // Function Engine.SplineComponent.*bbab5ff12a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x653b16c
	struct FVector *eda3f2865f(); // Function Engine.SplineComponent.*eda3f2865f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651c6f8
	struct FLinearColor *a14ead8189(); // Function Engine.SplineComponent.*a14ead8189 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x64f0858
	struct FVector *cb028b19c9(); // Function Engine.SplineComponent.*cb028b19c9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651ac64
	struct FVector *92b5343530(); // Function Engine.SplineComponent.*92b5343530 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x651c7f8
};

// Class Engine.MaterialInterface
// Size: 0x78 (Inherited: 0x30)
struct UMaterialInterface : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x38(0x08)
	char pad_40[0x8]; // 0x40(0x08)
	struct F*5f515f80fd LightmassSettings; // 0x48(0x14)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct TArray<struct F*ec346d410d> *500d5753a1; // 0x60(0x10)
	char pad_70[0x8]; // 0x70(0x08)

	struct UPhysicalMaterial* *ea747ae92c(); // Function Engine.MaterialInterface.*ea747ae92c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e16f8
	struct UMaterial* *dab70eafa3(); // Function Engine.MaterialInterface.*dab70eafa3 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x64dcd50
};

// Class Engine.MaterialInstance
// Size: 0x1e8 (Inherited: 0x78)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0x78(0x08)
	struct UMaterialInterface* Parent; // 0x80(0x08)
	char *eaf1df3c01 : 1; // 0x88(0x01)
	char *72e525d9b9 : 1; // 0x88(0x01)
	char pad_88_2 : 1; // 0x88(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x88(0x01)
	char pad_88_4 : 4; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct TArray<struct F*2f1f908113> FontParameterValues; // 0x90(0x10)
	struct TArray<struct F*40219917e5> ScalarParameterValues; // 0xa0(0x10)
	struct TArray<struct F*a504c41607> TextureParameterValues; // 0xb0(0x10)
	struct TArray<struct F*ded523a6c8> VectorParameterValues; // 0xc0(0x10)
	bool bOverrideBaseProperties; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xd4(0x24)
	char pad_F8[0xf0]; // 0xf8(0xf0)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x1e8 (Inherited: 0x1e8)
struct UMaterialInstanceConstant : UMaterialInstance {
};

// Class Engine.MaterialExpression
// Size: 0x68 (Inherited: 0x30)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x30(0x08)
	struct UMaterialFunction* Function; // 0x38(0x08)
	struct FString Desc; // 0x40(0x10)
	struct FColor BorderColor; // 0x50(0x04)
	char *cea6bfdf23 : 1; // 0x54(0x01)
	char *bd8ba0fbe0 : 1; // 0x54(0x01)
	char *557ea9fb7b : 1; // 0x54(0x01)
	char *ae1d26f90d : 1; // 0x54(0x01)
	char *9e48e7b9cf : 1; // 0x54(0x01)
	char *eb86d6d948 : 1; // 0x54(0x01)
	char *40d454dad4 : 1; // 0x54(0x01)
	char *90211ea547 : 1; // 0x54(0x01)
	char *f80a46dfc4 : 1; // 0x55(0x01)
	char *895388f7c0 : 1; // 0x55(0x01)
	char *8316a56514 : 1; // 0x55(0x01)
	char pad_55_3 : 5; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	struct TArray<struct FExpressionOutput> Outputs; // 0x58(0x10)
};

// Class Engine.*2f7623087a
// Size: 0x68 (Inherited: 0x68)
struct U*2f7623087a : UMaterialExpression {
};

// Class Engine.*f8e25a8f91
// Size: 0x68 (Inherited: 0x68)
struct U*f8e25a8f91 : UMaterialExpression {
};

// Class Engine.*528374bf77
// Size: 0x30 (Inherited: 0x30)
struct U*528374bf77 : UObject {

	void Activate(); // Function Engine.*528374bf77.Activate // Native|Public|BlueprintCallable // @ game+0x57ccdf4
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x3b8 (Inherited: 0x2b0)
struct UBlueprintGeneratedClass : UClass {
	int32 NumReplicatedProperties; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)
	struct TArray<struct U*f9ce876360*> *ba400071f6; // 0x2b8(0x10)
	struct TArray<struct UActorComponent*> *3cf3d68327; // 0x2c8(0x10)
	struct TArray<struct U*bd91982c84*> *196fc7dd02; // 0x2d8(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x2e8(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x2f0(0x08)
	struct UStructProperty* *1720bc2967; // 0x2f8(0x08)
	struct UFunction* *ebc54076cf; // 0x300(0x08)
	struct TArray<struct F*a3aa512dca> FastCallPairs; // 0x308(0x10)
	bool *b4339b2bed; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct TMap<struct FName, struct F*1489c052de> *8f11984777; // 0x320(0x50)
	bool *fafb82cdff; // 0x370(0x01)
	char pad_371[0x47]; // 0x371(0x47)
};

// Class Engine.CameraActor
// Size: 0x990 (Inherited: 0x3f0)
struct ACameraActor : AActor {
	enum class EAutoReceiveInput *0307a8293d; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct UCameraComponent* CameraComponent; // 0x3f8(0x08)
	struct USceneComponent* SceneComponent; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)
	char bConstrainAspectRatio : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float AspectRatio; // 0x414(0x04)
	float FOVAngle; // 0x418(0x04)
	float PostProcessBlendWeight; // 0x41c(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x420(0x570)

	int32 *3333a6d15b(); // Function Engine.CameraActor.*3333a6d15b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64dccf8
};

// Class Engine.UserDefinedStruct
// Size: 0x100 (Inherited: 0xf0)
struct UUserDefinedStruct : UScriptStruct {
	struct FGuid Guid; // 0xf0(0x10)
};

// Class Engine.AISystemBase
// Size: 0x50 (Inherited: 0x30)
struct UAISystemBase : UObject {
	struct FStringClassReference AISystemClassName; // 0x30(0x10)
	struct FName AISystemModuleName; // 0x40(0x08)
	bool bInstantiateAISystemOnClient; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class Engine.*10128294dc
// Size: 0x50 (Inherited: 0x30)
struct U*10128294dc : UObject {
	struct TArray<struct F*6c9a74e1a9> Areas; // 0x30(0x10)
	struct F*0fdc6dd237 IncludeFlags; // 0x40(0x04)
	struct F*0fdc6dd237 ExcludeFlags; // 0x44(0x04)
	char pad_48[0x8]; // 0x48(0x08)
};

// Class Engine.*6080c6b78b
// Size: 0x40 (Inherited: 0x30)
struct U*6080c6b78b : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.Model
// Size: 0x568 (Inherited: 0x30)
struct UModel : UObject {
	char pad_30[0x538]; // 0x30(0x538)
};

// Class Engine.*99e10d1a78
// Size: 0x30 (Inherited: 0x30)
struct U*99e10d1a78 : UObject {
};

// Class Engine.*a31a367d3b
// Size: 0x30 (Inherited: 0x30)
struct U*a31a367d3b : UObject {
};

// Class Engine.EdGraphNode
// Size: 0xa8 (Inherited: 0x30)
struct UEdGraphNode : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins; // 0x40(0x10)
	int32 *453eb07774; // 0x50(0x04)
	int32 *e8a7c66564; // 0x54(0x04)
	int32 *41bb7e52ed; // 0x58(0x04)
	int32 *8ee5020f45; // 0x5c(0x04)
	char *2c238b1825 : 1; // 0x60(0x01)
	char pad_60_1 : 7; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct FString NodeComment; // 0x68(0x10)
	bool *fd61023e55; // 0x78(0x01)
	bool *ae1d26f90d; // 0x79(0x01)
	bool *60f8cb15f4; // 0x7a(0x01)
	char pad_7B[0x1]; // 0x7b(0x01)
	int32 *93a1fb6944; // 0x7c(0x04)
	struct FString *df390b77be; // 0x80(0x10)
	struct FGuid NodeGuid; // 0x90(0x10)
	enum class ENodeAdvancedPins *0aa90830dc; // 0xa0(0x01)
	enum class ENodeEnabledState *9b625cf000; // 0xa1(0x01)
	bool *2e79c61b80; // 0xa2(0x01)
	bool bIsNodeEnabled; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x148 (Inherited: 0x30)
struct UEdGraphPin_Deprecated : UObject {
	struct FString PinName; // 0x30(0x10)
	struct FString PinToolTip; // 0x40(0x10)
	enum class EEdGraphPinDirection Direction; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct F*dcaec3c3e2 PinType; // 0x58(0x80)
	struct FString DefaultValue; // 0xd8(0x10)
	struct FString *89bfb03fc3; // 0xe8(0x10)
	struct UObject* *a79607a05b; // 0xf8(0x08)
	struct FText *7bd11a9b4a; // 0x100(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> *e9dc81a250; // 0x118(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> *1934011d8f; // 0x128(0x10)
	struct UEdGraphPin_Deprecated* *2ddfa7bea5; // 0x138(0x08)
	struct UEdGraphPin_Deprecated* *9a0ee59ff0; // 0x140(0x08)
};

// Class Engine.*40ddb9dd5e
// Size: 0x30 (Inherited: 0x30)
struct U*40ddb9dd5e : UInterface {
};

// Class Engine.Level
// Size: 0x330 (Inherited: 0x30)
struct ULevel : UObject {
	char pad_30[0x48]; // 0x30(0x48)
	bool *863c6a3c52; // 0x78(0x01)
	char pad_79_0 : 2; // 0x79(0x01)
	char *d629bf8c8b : 1; // 0x79(0x01)
	char bIsVisible : 1; // 0x79(0x01)
	char bLocked : 1; // 0x79(0x01)
	char *d752c4753f : 1; // 0x79(0x01)
	char pad_79_6 : 2; // 0x79(0x01)
	char pad_7A[0x46]; // 0x7a(0x46)
	struct ALevelScriptActor* LevelScriptActor; // 0xc0(0x08)
	struct TArray<struct FGuid> *e58b8f8bd9; // 0xc8(0x10)
	char pad_D8[0x8]; // 0xd8(0x08)
	struct ANavigationObjectBase* *a3f1f8c9bf; // 0xe0(0x08)
	struct FGuid *75e39f3690; // 0xe8(0x10)
	struct UMapBuildDataRegistry* *65a9a6cf12; // 0xf8(0x08)
	char pad_100[0x8]; // 0x100(0x08)
	struct TArray<struct U*83352a2b89*> *7aa5102cd3; // 0x108(0x10)
	struct FIntVector *bea6ba621d; // 0x118(0x0c)
	char pad_124[0x4]; // 0x124(0x04)
	struct ANavigationObjectBase* *f01e8b66cf; // 0x128(0x08)
	char pad_130[0x8]; // 0x130(0x08)
	struct UModel* Model; // 0x138(0x08)
	char pad_140[0x8]; // 0x140(0x08)
	float *372f07566a; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UWorld* *16f61c64e0; // 0x150(0x08)
	int32 *752abb6ca7; // 0x158(0x04)
	char pad_15C[0x4]; // 0x15c(0x04)
	struct TArray<struct FVector> *1b020b5803; // 0x160(0x10)
	char pad_170[0x80]; // 0x170(0x80)
	float *3496d6af4a; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct U*9a60b08820* ActorCluster; // 0x1f8(0x08)
	struct TArray<struct U*e52d54c0e0*> *6eb75bf41b; // 0x200(0x10)
	char pad_210[0x8]; // 0x210(0x08)
	int32 *8b1a426e8e; // 0x218(0x04)
	char pad_21C[0xe4]; // 0x21c(0xe4)
	struct AWorldSettings* WorldSettings; // 0x300(0x08)
	char pad_308[0x8]; // 0x308(0x08)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x310(0x10)
	char pad_320[0x10]; // 0x320(0x10)
};

// Class Engine.*067b0e25b7
// Size: 0x30 (Inherited: 0x30)
struct U*067b0e25b7 : UInterface {
};

// Class Engine.AmbientSound
// Size: 0x3f8 (Inherited: 0x3f0)
struct AAmbientSound : AActor {
	struct UAudioComponent* AudioComponent; // 0x3f0(0x08)

	float AdjustVolume(); // Function Engine.AmbientSound.AdjustVolume // Final|Native|Public|BlueprintCallable // @ game+0x64d53a0
	float FadeOut(); // Function Engine.AmbientSound.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0x64dbb38
	float *46088c3b7b(); // Function Engine.AmbientSound.*46088c3b7b // Final|Native|Public|BlueprintCallable // @ game+0x64dba48
	float Play(); // Function Engine.AmbientSound.Play // Final|Native|Public|BlueprintCallable // @ game+0x64e9ec0
	void Stop(); // Function Engine.AmbientSound.Stop // Final|Native|Public|BlueprintCallable // @ game+0x64f54a0
};

// Class Engine.AutoBenchSettings
// Size: 0x48 (Inherited: 0x30)
struct UAutoBenchSettings : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct F*cc01e78d73> Settings; // 0x38(0x10)
};

// Class Engine.AutoBenchControlActor
// Size: 0x3f0 (Inherited: 0x3f0)
struct AAutoBenchControlActor : AActor {
};

// Class Engine.*c03ab1e88c
// Size: 0x30 (Inherited: 0x30)
struct U*c03ab1e88c : UObject {
};

// Class Engine.*5351691cca
// Size: 0x30 (Inherited: 0x30)
struct U*5351691cca : UInterface {
};

// Class Engine.BillboardComponent
// Size: 0x9d0 (Inherited: 0x9b0)
struct UBillboardComponent : UPrimitiveComponent {
	struct UTexture2D* Sprite; // 0x9a8(0x08)
	char bIsScreenSizeScaled : 1; // 0x9b0(0x01)
	float ScreenSize; // 0x9b4(0x04)
	float U; // 0x9b8(0x04)
	float UL; // 0x9bc(0x04)
	float V; // 0x9c0(0x04)
	float VL; // 0x9c4(0x04)
	struct FColor Color; // 0x9c8(0x04)

	int32 *b34a91956b(); // Function Engine.BillboardComponent.*b34a91956b // Native|Public|BlueprintCallable // @ game+0x64f3b2c
	int32 *5a310660a0(); // Function Engine.BillboardComponent.*5a310660a0 // Native|Public|BlueprintCallable // @ game+0x64f41ec
	bool SetColor(); // Function Engine.BillboardComponent.SetColor // Final|Native|Public|HasDefaults // @ game+0x64f03c8
	struct UTexture2D* *73296e1372(); // Function Engine.BillboardComponent.*73296e1372 // Native|Public|BlueprintCallable // @ game+0x64f3a98
};

// Class Engine.*1d5d887209
// Size: 0x30 (Inherited: 0x30)
struct U*1d5d887209 : UInterface {
};

// Class Engine.StaticMesh
// Size: 0x178 (Inherited: 0x30)
struct UStaticMesh : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	int32 MinLOD; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct UMaterialInterface*> Materials; // 0x50(0x10)
	struct TArray<struct F*9b3c03c912> StaticMaterials; // 0x60(0x10)
	float *65706d282d; // 0x70(0x04)
	int32 LightMapResolution; // 0x74(0x04)
	int32 *9ed26776d4; // 0x78(0x04)
	float *2927a40459; // 0x7c(0x04)
	struct UBodySetup* BodySetup; // 0x80(0x08)
	int32 *3c7ddc148a; // 0x88(0x04)
	char *4c18bc5776 : 1; // 0x8c(0x01)
	char *bdcbbf1dd0 : 1; // 0x8c(0x01)
	char bStripComplexCollisionForConsole : 1; // 0x8c(0x01)
	char *1c6acdad28 : 1; // 0x8c(0x01)
	char bRequiresAreaWeightedSampling : 1; // 0x8c(0x01)
	char pad_8C_5 : 3; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	float LpvBiasMultiplier; // 0x90(0x04)
	bool *72b429015b; // 0x94(0x01)
	char pad_95[0x33]; // 0x95(0x33)
	struct TArray<struct U*c90fb310e3*> Sockets; // 0xc8(0x10)
	char pad_D8[0x10]; // 0xd8(0x10)
	struct FVector *70f0883a57; // 0xe8(0x0c)
	struct FVector *a395dacd15; // 0xf4(0x0c)
	struct FBoxSphereBounds *12c825a915; // 0x100(0x1c)
	bool *3b56ad7171; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
	int32 *46b6d7aa69; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x128(0x10)
	struct UNavCollision* NavCollision; // 0x138(0x08)
	struct F*9156f9f612 *9dbf5c9c9c; // 0x140(0x28)
	struct TArray<struct UMaterialInstanceConstant*> *7949b827cb; // 0x168(0x10)

	struct FBox *a8ad6da3c5(); // Function Engine.StaticMesh.*a8ad6da3c5 // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd648
	struct FBoxSphereBounds *3fdb8d2cbb(); // Function Engine.StaticMesh.*3fdb8d2cbb // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64dd754
	int32 *237c992952(); // Function Engine.StaticMesh.*237c992952 // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0de8
	int32 *10b99163ef(); // Function Engine.StaticMesh.*10b99163ef // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e0d78
};

// Class Engine.*fd5ad6fe6e
// Size: 0x590 (Inherited: 0x480)
struct U*fd5ad6fe6e : USceneComponent {
	struct FVector Extents; // 0x478(0x0c)
	struct FVector FadeExtents_Neg; // 0x484(0x0c)
	struct FVector FadeExtents_Pos; // 0x490(0x0c)
	bool bOutdoorTransition; // 0x49c(0x01)
	float VolumeAlpha; // 0x4a0(0x04)
	float Brightness; // 0x4a4(0x04)
	float SkyIntensity; // 0x4a8(0x04)
	int32 Priority; // 0x4ac(0x04)
	struct F*8f50c6ced6 AmbientCube2; // 0x4b0(0xc8)
	char pad_57D[0x13]; // 0x57d(0x13)

	void *b8587251c4(); // Function Engine.*fd5ad6fe6e.*b8587251c4 // Final|Native|Public // @ game+0xb8a940
};

// Class Engine.GIVolumesContainerComponent
// Size: 0x490 (Inherited: 0x480)
struct UGIVolumesContainerComponent : USceneComponent {
	char pad_480[0x10]; // 0x480(0x10)
};

// Class Engine.BoxGIVolume
// Size: 0x3f8 (Inherited: 0x3f0)
struct ABoxGIVolume : AActor {
	struct U*fd5ad6fe6e* VolumeComponent; // 0x3f0(0x08)
};

// Class Engine.BrushShape
// Size: 0x428 (Inherited: 0x428)
struct ABrushShape : ABrush {
};

// Class Engine.AudioVolume
// Size: 0x470 (Inherited: 0x428)
struct AAudioVolume : AVolume {
	float Priority; // 0x428(0x04)
	char bEnabled : 1; // 0x42c(0x01)
	char pad_42C_1 : 7; // 0x42c(0x01)
	char pad_42D[0x3]; // 0x42d(0x03)
	struct FReverbSettings Settings; // 0x430(0x18)
	struct F*391dcb41c3 AmbientZoneSettings; // 0x448(0x24)
	char pad_46C[0x4]; // 0x46c(0x04)

	struct FReverbSettings SetReverbSettings(); // Function Engine.AudioVolume.SetReverbSettings // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f3940
	bool *ae23d1077e(); // Function Engine.AudioVolume.*ae23d1077e // Final|Native|Public|BlueprintCallable // @ game+0x64f0dc4
	float SetPriority(); // Function Engine.AudioVolume.SetPriority // Final|Native|Public|BlueprintCallable // @ game+0x64f33c4
	struct F*391dcb41c3 *402694ef73(); // Function Engine.AudioVolume.*402694ef73 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x64f1adc
	void OnRep_bEnabled(); // Function Engine.AudioVolume.OnRep_bEnabled // Final|Native|Private // @ game+0x57aa2c4
};

// Class Engine.BlockingVolume
// Size: 0x428 (Inherited: 0x428)
struct ABlockingVolume : AVolume {
};

// Class Engine.CameraBlockingVolume
// Size: 0x428 (Inherited: 0x428)
struct ACameraBlockingVolume : AVolume {
};

// Class Engine.CullDistanceVolume
// Size: 0x450 (Inherited: 0x428)
struct ACullDistanceVolume : AVolume {
	struct TArray<struct F*dcfd236c03> CullDistances; // 0x428(0x10)
	char bEnabled : 1; // 0x438(0x01)
	char pad_438_1 : 7; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	float CullDistanceForLODActor; // 0x43c(0x04)
	float CullDistanceForLODActorTooFar; // 0x440(0x04)
	bool bUseActorBound; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float IgnoreActorBoundSize; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
};

// Class Engine.LevelStreamingVolume
// Size: 0x440 (Inherited: 0x428)
struct ALevelStreamingVolume : AVolume {
	struct TArray<struct FName> StreamingLevelNames; // 0x428(0x10)
	char bEditorPreVisOnly : 1; // 0x438(0x01)
	char bDisabled : 1; // 0x438(0x01)
	char pad_438_2 : 6; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	enum class *7d7353c297 StreamingUsage; // 0x43c(0x01)
	char pad_43D[0x3]; // 0x43d(0x03)
};

// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x428 (Inherited: 0x428)
struct ALightmassCharacterIndirectDetailVolume : AVolume {
};

// Class Engine.LightmassImportanceVolume
// Size: 0x428 (Inherited: 0x428)
struct ALightmassImportanceVolume : AVolume {
};

// Class Engine.MeshMergeCullingVolume
// Size: 0x428 (Inherited: 0x428)
struct AMeshMergeCullingVolume : AVolume {
};

// Class Engine.NavMeshBoundsVolume
// Size: 0x430 (Inherited: 0x428)
struct ANavMeshBoundsVolume : AVolume {
	struct FNavAgentSelector SupportedAgents; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
};

// Class Engine.DefaultPhysicsVolume
// Size: 0x440 (Inherited: 0x440)
struct ADefaultPhysicsVolume : APhysicsVolume {
};

// Class Engine.KillZVolume
// Size: 0x440 (Inherited: 0x440)
struct AKillZVolume : APhysicsVolume {
};

// Class Engine.PainCausingVolume
// Size: 0x468 (Inherited: 0x440)
struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x440(0x01)
	char pad_440_1 : 7; // 0x440(0x01)
	char pad_441[0x3]; // 0x441(0x03)
	float DamagePerSec; // 0x444(0x04)
	struct UClass* DamageType; // 0x448(0x08)
	float PainInterval; // 0x450(0x04)
	char bEntryPain : 1; // 0x454(0x01)
	char *d23089194a : 1; // 0x454(0x01)
	char pad_454_2 : 6; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
	struct AController* *a06dab2416; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)
};

// Class Engine.BlendableInterface
// Size: 0x30 (Inherited: 0x30)
struct UBlendableInterface : UInterface {
};

// Class Engine.Scene
// Size: 0x30 (Inherited: 0x30)
struct UScene : UObject {
};

// Class Engine.*92425e8a49
// Size: 0x30 (Inherited: 0x30)
struct U*92425e8a49 : UInterface {
};

// Class Engine.PostProcessVolume
// Size: 0x9b0 (Inherited: 0x428)
struct APostProcessVolume : AVolume {
	char pad_428[0x8]; // 0x428(0x08)
	struct FPostProcessSettings Settings; // 0x430(0x570)
	float Priority; // 0x9a0(0x04)
	float BlendRadius; // 0x9a4(0x04)
	float BlendWeight; // 0x9a8(0x04)
	char bEnabled : 1; // 0x9ac(0x01)
	char bUnbound : 1; // 0x9ac(0x01)
	char pad_9AC_2 : 6; // 0x9ac(0x01)
	char pad_9AD[0x3]; // 0x9ad(0x03)

	float *c9d474ee9d(); // Function Engine.PostProcessVolume.*c9d474ee9d // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x64f603c
	float *279e5ee7e9(); // Function Engine.PostProcessVolume.*279e5ee7e9 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x64d4984
};

// Class Engine.PrecomputedVisibilityOverrideVolume
// Size: 0x458 (Inherited: 0x428)
struct APrecomputedVisibilityOverrideVolume : AVolume {
	struct TArray<struct AActor*> OverrideVisibleActors; // 0x428(0x10)
	struct TArray<struct AActor*> OverrideInvisibleActors; // 0x438(0x10)
	struct TArray<struct FName> OverrideInvisibleLevels; // 0x448(0x10)
};

// Class Engine.PrecomputedVisibilityVolume
// Size: 0x428 (Inherited: 0x428)
struct APrecomputedVisibilityVolume : AVolume {
};

// Class Engine.TriggerVolume
// Size: 0x428 (Inherited: 0x428)
struct ATriggerVolume : AVolume {
};

// Class Engine.*f914516f16
// Size: 0x30 (Inherited: 0x30)
struct U*f914516f16 : UInterface {
};

// Class Engine.CameraShake
// Size: 0x170 (Inherited: 0x30)
struct UCameraShake : UObject {
	char *b704adf1d7 : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *3494df5f25; // 0x34(0x04)
	float *abaaa2b446; // 0x38(0x04)
	float *8fa9951745; // 0x3c(0x04)
	struct F*2f8ce11fce *082d0a181c; // 0x40(0x24)
	struct F*1b91ec26de *5b7a8129a5; // 0x64(0x24)
	struct F*e34584cb7c *2282ddc178; // 0x88(0x0c)
	float AnimPlayRate; // 0x94(0x04)
	float *f2b647a17e; // 0x98(0x04)
	float *bc412c6d67; // 0x9c(0x04)
	float *624c126bbe; // 0xa0(0x04)
	float *7f3f2c4230; // 0xa4(0x04)
	struct UCameraAnim* Anim; // 0xa8(0x08)
	char bRandomAnimSegment : 1; // 0xb0(0x01)
	char pad_B0_1 : 7; // 0xb0(0x01)
	char pad_B1[0x17]; // 0xb1(0x17)
	struct APlayerCameraManager* CameraOwner; // 0xc8(0x08)
	char pad_D0[0x88]; // 0xd0(0x88)
	float ShakeScale; // 0x158(0x04)
	float OscillatorTimeRemaining; // 0x15c(0x04)
	struct U*6ec4247e64* AnimInst; // 0x160(0x08)
	char pad_168[0x8]; // 0x168(0x08)

	bool ReceiveIsFinished(); // Function Engine.CameraShake.ReceiveIsFinished // Native|Event|Public|BlueprintEvent|Const // @ game+0xd907f4
	float ReceivePlayShake(); // Function Engine.CameraShake.ReceivePlayShake // Event|Public|BlueprintEvent // @ game+0x1dcd78
	bool ReceiveStopShake(); // Function Engine.CameraShake.ReceiveStopShake // Event|Public|BlueprintEvent // @ game+0x1dcd78
	struct F*5cde951495 BlueprintUpdateCameraShake(); // Function Engine.CameraShake.BlueprintUpdateCameraShake // Event|Public|HasOutParms|BlueprintEvent // @ game+0x1dcd78
};

// Class Engine.*37a897c2a6
// Size: 0x290 (Inherited: 0x200)
struct U*37a897c2a6 : UActorComponent {
	char pad_200[0x70]; // 0x200(0x70)
	struct TArray<struct F*526a26a06d> *526a26a06d; // 0x270(0x10)
	char pad_280[0x10]; // 0x280(0x10)

	bool *4e1e11b6f1(); // Function Engine.*37a897c2a6.*4e1e11b6f1 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64e303c
	bool *5c6989adde(); // Function Engine.*37a897c2a6.*5c6989adde // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64e303c
	enum class EEndPlayReason OnInputOwnerEndPlayed(); // Function Engine.*37a897c2a6.OnInputOwnerEndPlayed // Final|Native|Private // @ game+0x64e9768
	float *fd267e57f5(); // Function Engine.*37a897c2a6.*fd267e57f5 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64de10c
	struct FVector *d0cf4daf38(); // Function Engine.*37a897c2a6.*d0cf4daf38 // Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64de3fc
	float *e4664e535a(); // Function Engine.*37a897c2a6.*e4664e535a // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64de214
	float *8f23584155(); // Function Engine.*37a897c2a6.*8f23584155 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64de32c
	bool *3eafaa8a5c(); // Function Engine.*37a897c2a6.*3eafaa8a5c // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64e303c
	float *444e3d14dd(); // Function Engine.*37a897c2a6.*444e3d14dd // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x64de10c
	bool *45b87fdbeb(); // Function Engine.*37a897c2a6.*45b87fdbeb // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2414
};

// Class Engine.CurveFloat
// Size: 0xb0 (Inherited: 0x38)
struct UCurveFloat : UCurveBase {
	struct FRichCurve *aa79e9f954; // 0x38(0x70)
	bool *03e61e74a0; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)

	float *df1965b3ab(); // Function Engine.CurveFloat.*df1965b3ab // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de588
	float *6e95764d2e(); // Function Engine.CurveFloat.*6e95764d2e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xa753b8
};

// Class Engine.DecalActor
// Size: 0x3f8 (Inherited: 0x3f0)
struct ADecalActor : AActor {
	struct UDecalComponent* Decal; // 0x3f0(0x08)

	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(); // Function Engine.DecalActor.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x5774aa4
	struct UMaterialInterface* *08eaa25dbb(); // Function Engine.DecalActor.*08eaa25dbb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64de560
	struct UMaterialInterface* *8c06158828(); // Function Engine.DecalActor.*8c06158828 // Final|Native|Public|BlueprintCallable // @ game+0x64f0b20
};

// Class Engine.DestructibleActor
// Size: 0x410 (Inherited: 0x3f0)
struct ADestructibleActor : AActor {
	struct UDestructibleComponent* DestructibleComponent; // 0x3f0(0x08)
	char bAffectNavigation : 1; // 0x3f8(0x01)
	char pad_3F8_1 : 7; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct FMulticastDelegate OnActorFracture; // 0x400(0x10)
};

// Class Engine.DistanceFieldCapture
// Size: 0x3f8 (Inherited: 0x3f0)
struct ADistanceFieldCapture : AActor {
	struct U*04412402be* CaptureComponent; // 0x3f0(0x08)
};

// Class Engine.DocumentationActor
// Size: 0x3f8 (Inherited: 0x3f0)
struct ADocumentationActor : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
};

// Class Engine.Emitter
// Size: 0x440 (Inherited: 0x3f0)
struct AEmitter : AActor {
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x3f0(0x08)
	char *fe9f93d03d : 1; // 0x3f8(0x01)
	char bPostUpdateTickGroup : 1; // 0x3f8(0x01)
	char *d244e51257 : 1; // 0x3f8(0x01)
	char pad_3F8_3 : 5; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct FMulticastDelegate OnParticleSpawn; // 0x400(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x410(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0x420(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0x430(0x10)

	void OnRep_bCurrentlyActive(); // Function Engine.Emitter.OnRep_bCurrentlyActive // Native|Public // @ game+0x57c9afc
	void *4c6494a5d4(); // Function Engine.Emitter.*4c6494a5d4 // Final|Native|Public|BlueprintCallable // @ game+0x64f5d04
	void Activate(); // Function Engine.Emitter.Activate // Final|Native|Public|BlueprintCallable // @ game+0x64d3214
	float SetFloatParameter(); // Function Engine.Emitter.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x64f0f18
	struct AActor* *5da5ae8752(); // Function Engine.Emitter.*5da5ae8752 // Final|Native|Public|BlueprintCallable // @ game+0x64ee108
	bool IsActive(); // Function Engine.Emitter.IsActive // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64e2d58
	void Deactivate(); // Function Engine.Emitter.Deactivate // Final|Native|Public|BlueprintCallable // @ game+0x64d9838
	struct UParticleSystemComponent* OnParticleSystemFinished(); // Function Engine.Emitter.OnParticleSystemFinished // Native|Public // @ game+0x571f4e4
	struct UMaterialInterface* *8dd7e62706(); // Function Engine.Emitter.*8dd7e62706 // Final|Native|Public|BlueprintCallable // @ game+0x64f2578
	struct FVector *8fbddde934(); // Function Engine.Emitter.*8fbddde934 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f4570
	struct UParticleSystem* *23a60326d0(); // Function Engine.Emitter.*23a60326d0 // Native|Public|BlueprintCallable // @ game+0x580a62c
	struct FLinearColor *2b029e7d25(); // Function Engine.Emitter.*2b029e7d25 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x64f04ac
};

// Class Engine.EmitterCameraLensEffectBase
// Size: 0x4b0 (Inherited: 0x440)
