// Class ORCA.ORCAManager
// Size: 0x468 (Inherited: 0x3f0)
struct AORCAManager : AActor {
	char pad_3F0[0x50]; // 0x3f0(0x50)
	struct FString *12671cc458; // 0x440(0x10)
	float NeighborDist; // 0x450(0x04)
	int32 MaxNeighbors; // 0x454(0x04)
	float TimeHorizon; // 0x458(0x04)
	float Radius; // 0x45c(0x04)
	float MaxSpeed; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
};

