// BlueprintGeneratedClass BP_DefaultTslSingleton.BP_DefaultTslSingleton_C
// Size: 0x12f0 (Inherited: 0x12f0)
struct UBP_DefaultTslSingleton_C : U*74815e3a6d {
	struct U*5e2ebdb193* *ea907fb669; // 0xf0(0x08)
	struct TArray<struct F*92f70ecce2> *21e966cd62; // 0xf8(0x10)
	struct TMap<struct FString, struct FString> *ef66ecf06f; // 0x108(0x50)
	struct U*329f829c14* *329f829c14; // 0x158(0x08)
	struct UDataTable* *db00e31a18; // 0x160(0x08)
	struct UDataTable* *c9131c0f74; // 0x168(0x08)
	struct TMap<struct FName, struct F*7894219696> *0ef5c8d06a; // 0x170(0x50)
	struct UDataTable* *10c2cfbdd8; // 0x1c0(0x08)
	struct UDataTable* *2c4d45b311; // 0x1c8(0x08)
	struct UClass* *933948adc2; // 0x1d0(0x08)
	struct UClass* *38b0a7d8f7; // 0x1d8(0x08)
	struct FStringAssetReference *282ce08aa2; // 0x1e0(0x10)
	struct UDataTable* *f8fe4de915; // 0x1f0(0x08)
	struct UDataTable* *97b1ce1aca; // 0x1f8(0x08)
	struct UDataTable* *30727c410c; // 0x200(0x08)
	struct FStringAssetReference *601a260489; // 0x208(0x10)
	struct FStringClassReference *39d65a9d20; // 0x218(0x10)
	struct FStringClassReference *a82ed5e12a; // 0x228(0x10)
	struct FStringAssetReference *ab2136bb96; // 0x238(0x10)
	struct UUniqueWeaponDataAsset* UniqueWeaponDataAsset; // 0x248(0x08)
	struct UDataTable* *fb9675995b; // 0x250(0x08)
	struct FStringAssetReference *b7abb581cc; // 0x258(0x10)
	struct UDataTable* *21dad14c3d; // 0x268(0x08)
	struct FStringAssetReference *71733e3c85; // 0x270(0x10)
	struct FStringAssetReference *671df9b6d5; // 0x280(0x10)
	struct UClass* *ea7dfe6d47; // 0x290(0x08)
	struct FStringClassReference *c8ee8d3eff; // 0x298(0x10)
	struct UStaticMesh* *b9ae5bf7b8; // 0x2a8(0x20)
	struct UDataTable* *f9e897b401; // 0x2c8(0x08)
	struct UStringTable* *dc0a7a1ba0; // 0x2d0(0x08)
	struct F*ff6ea3da5e *53f767930f; // 0x2d8(0xc40)
	float *9341e3fe0d; // 0xf18(0x04)
	float *43162f28d7; // 0xf1c(0x04)
	float *beafd4ebd9; // 0xf20(0x04)
	struct TArray<struct F*7f4f3c1b84> *c8453caeb4; // 0xf28(0x10)
	struct TArray<struct FName> *576a65099a; // 0xf38(0x10)
	struct UClass* *a4ed0e64e5; // 0xf48(0x20)
	struct UClass* *0bd5c25efa; // 0xf68(0x08)
	struct UClass* *bc416e398d; // 0xf70(0x08)
	struct U*e3490ef9b0* *f4f7b0ca12; // 0xf78(0x08)
	struct UTslPubgIdAssetManager* *fbc790ba07; // 0xf80(0x08)
	struct UClass* *0bd4228107; // 0xf88(0x08)
	struct U*5ccb342f74* *f664db8643; // 0xf90(0x08)
	struct U*577d29ab35* *9491ea97b5; // 0xf98(0x08)
	struct U*79e6580d44* *f951fd759c; // 0xfa0(0x08)
	struct F*a23f92d3b8 *0db60420d0; // 0xfa8(0x340)
	struct UDataTable* *1ed5c0c46f; // 0x12e8(0x08)

	struct UClass* *899bd74b39(); // Function TslGame.*74815e3a6d.*899bd74b39 // Final|Native|Public|Const // @ game+0x5b97dfc
	float *6d904ce90c(); // Function TslGame.*74815e3a6d.*6d904ce90c // Final|Native|Public // @ game+0x5b98ad4
	struct UDataTable* *4fb43bf948(); // Function TslGame.*74815e3a6d.*4fb43bf948 // Final|Native|Public|Const // @ game+0x5b98a64
	struct F*ff6ea3da5e *82eab27fbe(); // Function TslGame.*74815e3a6d.*82eab27fbe // Final|Native|Public // @ game+0x5b98a7c
	float *811b0b8d21(); // Function TslGame.*74815e3a6d.*811b0b8d21 // Final|Native|Public // @ game+0x5b98abc
	void *f73bdcc947(); // Function TslGame.*74815e3a6d.*f73bdcc947 // Final|Native|Private // @ game+0x5b9d188
};

