// BlueprintGeneratedClass BP_DBX_LGD.BP_DBX_LGD_C
// Size: 0x1098 (Inherited: 0x1098)
struct ABP_DBX_LGD_C : ABP_DBX_C {
	struct UBoxComponent* PlayerBlockingVolume; // 0x1018(0x08)
	struct USphereComponent* PassengerBRCollision; // 0x1020(0x08)
	struct USphereComponent* PassengerBLCollision; // 0x1028(0x08)
	struct USphereComponent* PassengerFRCollision; // 0x1030(0x08)
	struct USphereComponent* DriverCollision; // 0x1038(0x08)
	struct UStaticMeshComponent* WindscreenFront; // 0x1040(0x08)
	struct U*af901fa0ff* MaterialClipVolume; // 0x1048(0x08)
	struct UStaticMeshComponent* WeaponCollisionComponent; // 0x1050(0x08)
	struct USphereComponent* Sphere3; // 0x1058(0x08)
	struct U*dd198cebe7* PassengerBRSeat; // 0x1060(0x08)
	struct USphereComponent* Sphere2; // 0x1068(0x08)
	struct U*dd198cebe7* PassengerBLSeat; // 0x1070(0x08)
	struct USphereComponent* Sphere1; // 0x1078(0x08)
	struct U*dd198cebe7* PassengerFRSeat; // 0x1080(0x08)
	struct USphereComponent* Sphere; // 0x1088(0x08)
	struct U*dd198cebe7* DriverSeat; // 0x1090(0x08)
};

