// BlueprintGeneratedClass BP_FireEffectController_JerryCan.BP_FireEffectController_JerryCan_C
// Size: 0x5e8 (Inherited: 0x5e8)
struct ABP_FireEffectController_JerryCan_C : ATslEffectController {
	struct U*5ba17ce34b* SimpleCollision; // 0x400(0x08)
	struct USceneComponent* SceneRoot; // 0x418(0x08)
	struct TArray<struct FVector> *346f5f7f6a; // 0x420(0x10)
	int32 *95dcf7e515; // 0x430(0x04)
	int32 *478e0c681e; // 0x434(0x04)
	int32 *7552a3ed8f; // 0x438(0x04)
	int32 *64cdab115d; // 0x43c(0x04)
	int32 *091d01abd1; // 0x440(0x04)
	int32 *0ce3471ee8; // 0x444(0x04)
	float *3436cea470; // 0x448(0x04)
	struct FName *6e2261c51f; // 0x450(0x08)
	float *199ed3943f; // 0x458(0x04)
	float *9b0ec5a428; // 0x45c(0x04)
	float *5ab0ac2e28; // 0x460(0x04)
	float *34d9beedeb; // 0x464(0x04)
	float *9ccfa34f5d; // 0x468(0x04)
	float SphereRadius; // 0x46c(0x04)
	float *50a60d3ff5; // 0x470(0x04)
	float *00cb4a6203; // 0x474(0x04)
	struct UClass* *7fb18dbe1a; // 0x478(0x08)
	bool *20e1de596b; // 0x480(0x01)
	float *0a2a85b4e0; // 0x484(0x04)
	float *126819af03; // 0x488(0x04)
	float *607437f5a1; // 0x48c(0x04)
	float *dcbe0f23c7; // 0x490(0x04)
	bool *85de186608; // 0x494(0x01)
	float DamageTickInterval; // 0x498(0x04)
	float DamagePerTick; // 0x49c(0x04)
	struct UClass* *0ad023d030; // 0x4a0(0x08)
	struct TArray<struct USphereComponent*> *e75d9f5a60; // 0x4c0(0x10)
	struct TArray<struct USphereComponent*> *721b4b773d; // 0x4d0(0x10)
	struct TArray<struct USphereComponent*> *5b282ce393; // 0x4e0(0x10)
	struct TArray<struct ATslDamageField*> *24ae37f1d9; // 0x4f0(0x10)
	struct TArray<struct ACharacter*> *b03f7a696b; // 0x500(0x10)
	struct USphereComponent* *54570083bd; // 0x5d0(0x08)

	float *1f5c368674(); // Function TslGame.TslEffectController.*1f5c368674 // Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults // @ game+0x5b7d294
	float *e7500ba813(); // Function TslGame.TslEffectController.*e7500ba813 // Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults // @ game+0x5b36f00
	float *1e0a05cf03(); // Function TslGame.TslEffectController.*1e0a05cf03 // Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults // @ game+0x5b7d414
	float *7059537ac3(); // Function TslGame.TslEffectController.*7059537ac3 // Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults // @ game+0x5b7d594
	struct AActor* OnTakeDamage(); // Function TslGame.TslEffectController.OnTakeDamage // Final|Native|Public // @ game+0x5b86dc0
	void *add941941b(); // Function TslGame.TslEffectController.*add941941b // Final|Native|Public|BlueprintCallable // @ game+0x5b7dbe8
	float *2eef254fd8(); // Function TslGame.TslEffectController.*2eef254fd8 // Final|Native|Public|HasDefaults // @ game+0x5b7dbfc
	void *a5aa4af65d(); // Function TslGame.TslEffectController.*a5aa4af65d // Final|Native|Public // @ game+0x5b8a938
};

