// BlueprintGeneratedClass BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C
// Size: 0x480 (Inherited: 0x440)
struct ABP_MasteryPose_FlareArmBend_C : ABP_MasteryPose_C {
	struct F*a6c93df757 UberGraphFrame; // 0x440(0x08)
	struct UPointLightComponent* PointLight1; // 0x448(0x08)
	struct USpotLightComponent* LobbySpotLight; // 0x450(0x08)
	struct USpotLightComponent* spotlight; // 0x458(0x08)
	struct UPointLightComponent* PointLight; // 0x460(0x08)
	struct UParticleSystemComponent* ParticleSystemPlayerCard; // 0x468(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x470(0x08)
	struct USkeletalMeshComponent* FlareMesh; // 0x478(0x08)

	void UserConstructionScript(); // Function BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void AttachObjects(); // Function BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C.AttachObjects // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void ExecuteUbergraph_BP_MasteryPose_FlareArmBend(int32 CallFunc_Array_Add_ReturnValue); // Function BP_MasteryPose_FlareArmBend.BP_MasteryPose_FlareArmBend_C.ExecuteUbergraph_BP_MasteryPose_FlareArmBend // HasDefaults // @ game+0x20a5d0
};

