// WidgetBlueprintGeneratedClass BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C
// Size: 0x7e8 (Inherited: 0x700)
struct UBP_PcSystemMenuWidget_C : U*a3d102c587 {
	struct F*a6c93df757 UberGraphFrame; // 0x700(0x08)
	struct U*9c8bfa0aee* GuideConsoleFocusList; // 0x708(0x08)
	struct U*9c8bfa0aee* GuideConsoleNormalFocusSystemMenu; // 0x710(0x08)
	struct U*9c8bfa0aee* GuideReportPopup; // 0x718(0x08)
	struct U*9c8bfa0aee* VanishingAnim; // 0x720(0x08)
	struct U*9c8bfa0aee* EmergingAnim; // 0x728(0x08)
	struct UImage* BackgroundGradient; // 0x730(0x08)
	struct UImage* BG; // 0x738(0x08)
	struct UBackgroundBlur* Blur; // 0x740(0x08)
	struct U*36cff032b6* ButtonTos; // 0x748(0x08)
	struct UBP_PcSystemMenuButtonWidget_C* ExitToDesktopButton; // 0x750(0x08)
	struct UBP_PcSystemMenuButtonWidget_C* KeyGuideButton; // 0x758(0x08)
	struct UBP_GamepadKeyIconWidget_C* KeyIconRB_Left; // 0x760(0x08)
	struct U*0eba8c881f* KeyIconRB_Left_PlatformSwitcher; // 0x768(0x08)
	struct UBP_PcSystemMenuButtonWidget_C* LeaveMatchButton; // 0x770(0x08)
	struct UCanvasPanel* MainCanvasPanel; // 0x778(0x08)
	struct UBP_PcSystemMenuButtonWidget_C* MatchLogButton; // 0x780(0x08)
	struct UImage* OutGame_PanImage; // 0x788(0x08)
	struct UButton* RatingsButton; // 0x790(0x08)
	struct UBP_PcSystemMenuButtonWidget_C* RestartLobbyButton; // 0x798(0x08)
	struct UBP_PcSystemMenuButtonWidget_C* ResumeButton; // 0x7a0(0x08)
	struct UBP_PcSystemMenuButtonWidget_C* SettingsButton; // 0x7a8(0x08)
	struct U*0eba8c881f* SwitcherKeyIconTos; // 0x7b0(0x08)
	struct UBorder* SystemMenuBorder; // 0x7b8(0x08)
	struct UVerticalBox* SystemMenuVerticalBox; // 0x7c0(0x08)
	struct U*0eba8c881f* TslUniversalInputVisibilitySwitcher_5; // 0x7c8(0x08)
	struct UUI_TeamManagementAndMissionList_C* UI_TeamManagementAndMissionList; // 0x7d0(0x08)
	struct UTextBlock* VersionInfoText; // 0x7d8(0x08)
	struct F*2ef3a887d0 BlockKeyBindingTimer; // 0x7e0(0x08)

	void PanelConstruct(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.PanelConstruct // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void CheckIfCompetitiveMode(bool CallFunc_IsValid_ReturnValue2, bool CallFunc__d19da177ef_ReturnValue, bool CallFunc_Contains_ReturnValue); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.CheckIfCompetitiveMode // Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure // @ game+0x20a5d0
	void CheckLeaveGameStatus(bool IsLeaveUnsafe, struct ATslGameState* CallFunc__830fc3e3f6_ReturnValue, struct ATslPlayerController* CallFunc__d496387316_ReturnValue, bool CallFunc__b69b4c5064_ReturnValue, int32 CallFunc__5cb2b6dfc3_ReturnValue, bool CallFunc__29c7de62d6_ReturnValue, struct ATslHUD* CallFunc__f88f07be0a_ReturnValue, bool CallFunc__cad30ea9bd_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanOR_ReturnValue); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.CheckLeaveGameStatus // Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure // @ game+0x20a5d0
	void QuitToDesktop(enum class *62cdf2ca7f NewParam, bool CallFunc__055a659f43_ReturnValue, struct UGameInstance* CallFunc__3d5915f3a5_ReturnValue, struct UTslGameInstance* K2Node_DynamicCast_AsTsl_Game_Instance, bool K2Node_DynamicCast_bSuccess, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue, struct AHUD* CallFunc__6db76a3a17_ReturnValue, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD, bool K2Node_DynamicCast_bSuccess2); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.QuitToDesktop // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void GotoLobby(enum class *62cdf2ca7f InPopupButtonID, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue, bool CallFunc__055a659f43_ReturnValue, struct AHUD* CallFunc__6db76a3a17_ReturnValue, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD, bool K2Node_DynamicCast_bSuccess); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.GotoLobby // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void EnableMenuButtons(bool bEnable); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.EnableMenuButtons // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void OnVanishingAnimFinished(struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue, struct AHUD* CallFunc__6db76a3a17_ReturnValue, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD, bool K2Node_DynamicCast_bSuccess); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.OnVanishingAnimFinished // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void HideWidget(DelegateProperty K2Node_CreateDelegate_OutputDelegate, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue, struct AHUD* CallFunc__6db76a3a17_ReturnValue, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD, bool K2Node_DynamicCast_bSuccess, struct ALobbyHUD* K2Node_DynamicCast_AsLobby_HUD, bool K2Node_DynamicCast_bSuccess2); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.HideWidget // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void BndEvt__TeamManagementButton_K2Node_ComponentBoundEvent_36_OnClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__TeamManagementButton_K2Node_ComponentBoundEvent_36_OnClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void Construct(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.Construct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void Destruct(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.Destruct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void BndEvt__EmergingAnim_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__EmergingAnim_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__EmergingAnim_K2Node_ComponentBoundEvent_2_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__EmergingAnim_K2Node_ComponentBoundEvent_2_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__VanishingAnim_K2Node_ComponentBoundEvent_3_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__VanishingAnim_K2Node_ComponentBoundEvent_3_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__VanishingAnim_K2Node_ComponentBoundEvent_4_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__VanishingAnim_K2Node_ComponentBoundEvent_4_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void NotifySystemMenuEnter(enum class ESystemMenuButtonType eType); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.NotifySystemMenuEnter // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void Custom Event_1(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.Custom Event_1 // BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void Custom Event_2(float Scale); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.Custom Event_2 // BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void NotifyEnableMenuButtons(bool bEnable); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.NotifyEnableMenuButtons // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void NotifyHideWidget(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.NotifyHideWidget // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void BndEvt__RatingsButton_K2Node_ComponentBoundEvent_99_OnButtonClickedEvent__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__RatingsButton_K2Node_ComponentBoundEvent_99_OnButtonClickedEvent__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void ToggleRBPos(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.ToggleRBPos // BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void PreConstruct(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.PreConstruct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void BndEvt__ResumeButton_K2Node_ComponentBoundEvent_42_OnTslButtonClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__ResumeButton_K2Node_ComponentBoundEvent_42_OnTslButtonClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__SettingsButton_K2Node_ComponentBoundEvent_124_OnTslButtonClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__SettingsButton_K2Node_ComponentBoundEvent_124_OnTslButtonClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__KeyGuideButton_K2Node_ComponentBoundEvent_174_OnTslButtonClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__KeyGuideButton_K2Node_ComponentBoundEvent_174_OnTslButtonClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__MatchLogButton_K2Node_ComponentBoundEvent_239_OnTslButtonClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__MatchLogButton_K2Node_ComponentBoundEvent_239_OnTslButtonClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__RestartLobbyButton_K2Node_ComponentBoundEvent_302_OnTslButtonClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__RestartLobbyButton_K2Node_ComponentBoundEvent_302_OnTslButtonClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__LeaveMatchButton_K2Node_ComponentBoundEvent_365_OnTslButtonClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__LeaveMatchButton_K2Node_ComponentBoundEvent_365_OnTslButtonClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void BndEvt__ExitToDesktopButton_K2Node_ComponentBoundEvent_428_OnTslButtonClicked__DelegateSignature(); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.BndEvt__ExitToDesktopButton_K2Node_ComponentBoundEvent_428_OnTslButtonClicked__DelegateSignature // BlueprintEvent // @ game+0x20a5d0
	void ExecuteUbergraph_BP_PcSystemMenuWidget(struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue3, struct AHUD* CallFunc__6db76a3a17_ReturnValue3, struct ATslBaseHUD* CallFunc__6b66da3e10_ReturnValue, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD3, bool K2Node_DynamicCast_bSuccess3, bool CallFunc_IsValid_ReturnValue5, struct UUserWidget* CallFunc_GetWidget_ReturnValue, struct U*f52ccbf327* K2Node_DynamicCast_As_f_52ccbf_328, bool K2Node_DynamicCast_bSuccess4, struct ATslBaseHUD* CallFunc__6b66da3e10_ReturnValue2, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue4, bool CallFunc_IsValid_ReturnValue6, struct AHUD* CallFunc__6db76a3a17_ReturnValue4, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD4, bool K2Node_DynamicCast_bSuccess5, struct ATslBaseHUD* CallFunc__6b66da3e10_ReturnValue3, struct ATslBaseHUD* CallFunc__6b66da3e10_ReturnValue4, bool CallFunc_IsValid_ReturnValue7, bool CallFunc_IsValid_ReturnValue8, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue5, struct AHUD* CallFunc__6db76a3a17_ReturnValue5, DelegateProperty _d8b1f23a78_OutputDelegate2, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD5, bool K2Node_DynamicCast_bSuccess6, enum class ESlateVisibility ___byte_Variable, float K2Node_CustomEvent_Scale, bool CallFunc__17d991acd0_ReturnValue, float CallFunc_Abs_ReturnValue, struct FText ___text_Variable6, bool CallFunc__d99ec0791c_ReturnValue, enum class ESlateVisibility ___byte_Variable2, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue6, struct AHUD* CallFunc__6db76a3a17_ReturnValue6, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD6, bool K2Node_DynamicCast_bSuccess7, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue7, struct AHUD* CallFunc__6db76a3a17_ReturnValue7, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD7, bool K2Node_DynamicCast_bSuccess8, DelegateProperty _d8b1f23a78_OutputDelegate3, struct ATslPlayerController* CallFunc__d496387316_ReturnValue2, struct APlayerController* CallFunc_GetOwningPlayer_ReturnValue8, bool CallFunc_IsValid_ReturnValue9, struct AHUD* CallFunc__6db76a3a17_ReturnValue8, struct ATslHUD* K2Node_DynamicCast_AsTsl_HUD8, bool K2Node_DynamicCast_bSuccess9, bool CallFunc__469e7dafa7_ReturnValue2, bool CallFunc__c704448ead_ReturnValue2, bool CallFunc__daf1e56f8d_ReturnValue2, bool CallFunc_BooleanOR_ReturnValue2, struct FString K2Node_Select_Default, struct FText K2Node_Select2_Default, struct ATslPlayerController* CallFunc__d496387316_ReturnValue3, bool CallFunc_IsValid_ReturnValue10, bool CallFunc__daf1e56f8d_ReturnValue3, bool CallFunc__2b00c85453_ReturnValue2, bool CallFunc__c704448ead_ReturnValue3, bool CallFunc__469e7dafa7_ReturnValue3, bool ___bool_Variable4, bool CallFunc_BooleanOR_ReturnValue3, bool ___bool_Variable5, bool CallFunc_BooleanOR_ReturnValue4, bool CallFunc__daf1e56f8d_ReturnValue4, bool CallFunc_IsValid_ReturnValue12, bool CallFunc__469e7dafa7_ReturnValue4, bool CallFunc__c704448ead_ReturnValue4, DelegateProperty _d8b1f23a78_OutputDelegate5, bool CallFunc_BooleanOR_ReturnValue5, bool CallFunc_BooleanOR_ReturnValue6, struct FText K2Node_Select4_Default, struct FText K2Node_Select5_Default, bool ___bool_Variable6, struct ATslGameState* CallFunc__830fc3e3f6_ReturnValue4, enum class EGameModeType CallFunc__cad9a90b2f_ReturnValue4, struct FString K2Node_Select6_Default, bool CallFunc__055a659f43_ReturnValue7, bool CallFunc__055a659f43_ReturnValue8, DelegateProperty _d8b1f23a78_OutputDelegate6, enum class ETslPlatformGroupBranch_BPOnly CallFunc__4e9f4a0173_PlatformGroupBranch, enum class ETslPlatformGroupBranch_BPOnly CallFunc__4e9f4a0173_PlatformGroupBranch2, bool _62618e47cd2_CmpSuccess, bool _62618e47cd3_CmpSuccess); // Function BP_PcSystemMenuWidget.BP_PcSystemMenuWidget_C.ExecuteUbergraph_BP_PcSystemMenuWidget // HasDefaults // @ game+0x20a5d0
};

