// WidgetBlueprintGeneratedClass BP_PcOptionCategoryGroupWidget.BP_PcOptionCategoryGroupWidget_C
// Size: 0x4b8 (Inherited: 0x4b8)
struct UBP_PcOptionCategoryGroupWidget_C : U*da74c6a458 {
	struct FName *b23feec699; // 0x418(0x08)
	struct FName *6fdc6928dd; // 0x420(0x08)
	struct FName CategoryName; // 0x428(0x08)
	bool *daf30ebfc2; // 0x430(0x01)
	struct U*8bb837196a* *d610e596b4; // 0x438(0x08)
	struct F*62d95f3263 DisplayNameText_Binder; // 0x440(0x20)
	struct F*c0b2c1bc8a ItemWidgetsVerticalBox_Binder; // 0x460(0x28)
	struct UButton* HoverHighlightButton; // 0x488(0x08)
	struct UImage* TooltipIconImage; // 0x490(0x08)
	struct FLinearColor ColorNormal; // 0x498(0x10)
	struct FLinearColor ColorTooltipIconHighlighted; // 0x4a8(0x10)

	void OnCloudOptionTooltipDeactivated(); // Function TslGame.*da74c6a458.OnCloudOptionTooltipDeactivated // Final|Native|Public // @ game+0x5bb9584
	void OnCloudOptionTooltipActivated(); // Function TslGame.*da74c6a458.OnCloudOptionTooltipActivated // Final|Native|Public // @ game+0x5bb9570
};

