// Class Engine.Actor
// Size: 0x3f0 (Inherited: 0x30)
struct AActor : UObject {
	float NetUpdateFrequency; // 0x30(0x04)
	char pad_34[0xc]; // 0x34(0x0c)
	struct FMulticastDelegate OnEndCursorOver; // 0x40(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x50(0x10)
	char pad_60_0 : 3; // 0x60(0x01)
	char *afc0b607c1 : 1; // 0x60(0x01)
	char pad_60_4 : 4; // 0x60(0x01)
	char pad_61_0 : 1; // 0x61(0x01)
	char *195141a832 : 1; // 0x61(0x01)
	char bReplicates : 1; // 0x61(0x01)
	char pad_61_3 : 5; // 0x61(0x01)
	char pad_62[0x6]; // 0x62(0x06)
	struct FName *dc8dad45d2; // 0x68(0x08)
	enum class ENetRole RemoteRole; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct AActor* Owner; // 0x78(0x08)
	struct FRepMovement ReplicatedMovement; // 0x80(0x34)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct F*163cdb3029 *4998573317; // 0xb8(0x40)
	enum class ENetRole Role; // 0xf8(0x01)
	char pad_F9[0x1]; // 0xf9(0x01)
	char bHidden : 1; // 0xfa(0x01)
	char *ccd23c4d11 : 1; // 0xfa(0x01)
	char *00c044e8f3 : 1; // 0xfa(0x01)
	char bOnlyRelevantToOwner : 1; // 0xfa(0x01)
	char bAlwaysRelevant : 1; // 0xfa(0x01)
	char *0b52d4980d : 1; // 0xfa(0x01)
	char *581c4aea8e : 1; // 0xfa(0x01)
	char *00a5818f10 : 1; // 0xfa(0x01)
	char *578ce01c9c : 1; // 0xfb(0x01)
	char pad_FB_1 : 1; // 0xfb(0x01)
	char *dc908ea105 : 1; // 0xfb(0x01)
	char bNetUseOwnerRelevancy : 1; // 0xfb(0x01)
	char *e59ae21b72 : 1; // 0xfb(0x01)
	char pad_FB_5 : 1; // 0xfb(0x01)
	char *42194894c7 : 1; // 0xfb(0x01)
	char pad_FB_7 : 1; // 0xfb(0x01)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x100(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x110(0x01)
	char bCanBeDamaged : 1; // 0x110(0x01)
	char *48c13dc856 : 1; // 0x110(0x01)
	char *b6f52fdcb3 : 1; // 0x110(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x110(0x01)
	char *ff1816ff9e : 1; // 0x110(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x110(0x01)
	char *a9f513e55a : 1; // 0x110(0x01)
	char *07bc7fef21 : 1; // 0x111(0x01)
	char pad_111_1 : 7; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)
	struct TArray<struct AMatineeActor*> *24dd036ec9; // 0x118(0x10)
	char pad_128[0x10]; // 0x128(0x10)
	float *f4ec68df5a; // 0x138(0x04)
	float NetPriority; // 0x13c(0x04)
	char pad_140[0x4]; // 0x140(0x04)
	char *72b47ba3cd : 1; // 0x144(0x01)
	char pad_144_1 : 4; // 0x144(0x01)
	char *8b1bf7449f : 1; // 0x144(0x01)
	char *d253d94f65 : 1; // 0x144(0x01)
	char *3b999d2d7a : 1; // 0x144(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x145(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x146(0x01)
	char pad_147[0x1]; // 0x147(0x01)
	int32 *403c4f6ec5; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x150(0x10)
	char pad_160[0x8]; // 0x160(0x08)
	struct TArray<struct FName> Tags; // 0x168(0x10)
	float MinNetUpdateFrequency; // 0x178(0x04)
	char pad_17C[0xc]; // 0x17c(0x0c)
	struct U*89f9a84286* *89f9a84286; // 0x188(0x08)
	struct APawn* Instigator; // 0x190(0x08)
	struct FMulticastDelegate OnClicked; // 0x198(0x10)
	float NetCullDistanceSquared; // 0x1a8(0x04)
	float CustomTimeDilation; // 0x1ac(0x04)
	struct USceneComponent* RootComponent; // 0x1b0(0x08)
	struct TArray<struct FName> Layers; // 0x1b8(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x1c8(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x1d8(0x01)
	char pad_1D9[0x3]; // 0x1d9(0x03)
	struct FGuid DestructibleId; // 0x1dc(0x10)
	bool bIsDestroyedVersion; // 0x1ec(0x01)
	bool RemoveFromLevelLOD; // 0x1ed(0x01)
	char pad_1EE[0x2]; // 0x1ee(0x02)
	struct F*b3a779a928 PrimaryActorTick; // 0x1f0(0x58)
	char pad_248[0x4]; // 0x248(0x04)
	float InitialLifeSpan; // 0x24c(0x04)
	struct FMulticastDelegate OnInputTouchLeave; // 0x250(0x10)
	struct UChildActorComponent* *18ff5b3923; // 0x260(0x08)
	struct FMulticastDelegate OnInputTouchEnter; // 0x268(0x10)
	enum class *d729d3c5a5 InputConsumeOption; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)
	struct FMulticastDelegate OnBeginCursorOver; // 0x280(0x10)
	struct TArray<struct AActor*> Children; // 0x290(0x10)
	int32 *c2b5fafb50; // 0x2a0(0x04)
	char pad_2A4[0x54]; // 0x2a4(0x54)
	struct FMulticastDelegate OnTakePointDamage; // 0x2f8(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x308(0x10)
	struct FMulticastDelegate OnActorHit; // 0x318(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x328(0x10)
	enum class EAutoReceiveInput *aaa4c6b0aa; // 0x338(0x01)
	char pad_339[0x3]; // 0x339(0x03)
	struct AActor* ParentComponentActor; // 0x33c(0x08)
	char pad_344[0x4]; // 0x344(0x04)
	struct FMulticastDelegate OnDestroyed; // 0x348(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x358(0x10)
	char pad_368[0x58]; // 0x368(0x58)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x3c0(0x10)
	uint64 *59b4fa8b00; // 0x3d0(0x08)
	struct FMulticastDelegate OnReleased; // 0x3d8(0x10)
	char pad_3E8[0x8]; // 0x3e8(0x08)

	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xe6fc80
	struct FVector *d5ff08bf52(); // Function Engine.Actor.*d5ff08bf52 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68946e8
	struct APlayerController* K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct TArray<struct UActorComponent*> *efaba219b2(); // Function Engine.Actor.*efaba219b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896340
	enum class ENetRole *d4b72b197e(); // Function Engine.Actor.*d4b72b197e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899fb8
	bool DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x689211c
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ea54
	bool K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x689ffe0
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x525484
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x689e4b8
	void *5f8251239e(); // Function Engine.Actor.*5f8251239e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68941f8
	bool K2_AttachRootComponentTo(); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x689d9f8
	float *5c41a9b3d8(); // Function Engine.Actor.*5c41a9b3d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897cf0
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FVector *058a798681(); // Function Engine.Actor.*058a798681 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a6634
	struct FHitResult ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	struct FVector *72d1ab0701(); // Function Engine.Actor.*72d1ab0701 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a66d4
	bool K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c0c8
	struct UMaterialInstanceDynamic* *b999b3d1c3(); // Function Engine.Actor.*b999b3d1c3 // Final|Native|Public|BlueprintCallable // @ game+0x68a15b4
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FKey ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *221e5b49fe(); // Function Engine.Actor.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x68abb70
	bool *75f3114c08(); // Function Engine.Actor.*75f3114c08 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b298
	float *cdc7b91d6d(); // Function Engine.Actor.*cdc7b91d6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689a478
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdcda54
	enum class ETickingGroup *814a121c39(); // Function Engine.Actor.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x68ac0d8
	float *118a22ba37(); // Function Engine.Actor.*118a22ba37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897de4
	struct UActorComponent* *0d0c513b2c(); // Function Engine.Actor.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x68a3184
	struct AActor* *c4fee2a50d(); // Function Engine.Actor.*c4fee2a50d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894f98
	bool K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c4cc
	bool *4bc88286ff(); // Function Engine.Actor.*4bc88286ff // Final|Native|Public|BlueprintCallable // @ game+0x68a6338
	float *7cff7fa404(); // Function Engine.Actor.*7cff7fa404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689abc4
	struct UClass* GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6899354
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb4995c
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *0533b13c90(); // Function Engine.Actor.*0533b13c90 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6894d84
	struct FVector *f4f472a4df(); // Function Engine.Actor.*f4f472a4df // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68949d8
	struct UActorComponent* *f3429ceb97(); // Function Engine.Actor.*f3429ceb97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896158
	struct FVector *eb66fec44e(); // Function Engine.Actor.*eb66fec44e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6894964
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5a98aa4
	struct FVector *bbf004721b(); // Function Engine.Actor.*bbf004721b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6898400
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x4de458
	struct AActor* ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FName MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a1630
	float *5d41351842(); // Function Engine.Actor.*5d41351842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68977b4
	float *76f4a54e31(); // Function Engine.Actor.*76f4a54e31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894998
	struct USceneComponent* *6c12a1a971(); // Function Engine.Actor.*6c12a1a971 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ef14
	float *14c0f68ea4(); // Function Engine.Actor.*14c0f68ea4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6896cc0
	enum class ETouchIndex ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	float *52068fadb9(); // Function Engine.Actor.*52068fadb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897714
	struct FRotator *e45fc9ffc9(); // Function Engine.Actor.*e45fc9ffc9 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68945dc
	bool GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689440c
	enum class ETouchIndex ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x20a5d0
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x68a6774
	bool *d57fbe8fc6(); // Function Engine.Actor.*d57fbe8fc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b1e4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb4eb28
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *891a15da22(); // Function Engine.Actor.*891a15da22 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a0f7c
	bool K2_SetActorLocation(); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f5e8
	struct AController* *8ee0b9e990(); // Function Engine.Actor.*8ee0b9e990 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898620
	float ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x689420c
	struct FName *bda82fb76a(); // Function Engine.Actor.*bda82fb76a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894fbc
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *de9d01b3f6(); // Function Engine.Actor.*de9d01b3f6 // Final|Native|Public|BlueprintCallable // @ game+0x689de78
	struct FName *209c054b22(); // Function Engine.Actor.*209c054b22 // Final|Native|Public|BlueprintCallable // @ game+0x68ad250
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x688db3c
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fbdc
	struct AActor* *541a06a744(); // Function Engine.Actor.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x68a305c
	float *7311615d4b(); // Function Engine.Actor.*7311615d4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68949b0
	void *65fa332f56(); // Function Engine.Actor.*65fa332f56 // Native|Public|BlueprintCallable // @ game+0x68adf58
	struct APlayerController* *0f7b3f99fd(); // Function Engine.Actor.*0f7b3f99fd // Native|Public|BlueprintCallable // @ game+0x6893c70
	bool K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c87c
	bool *bad918d000(); // Function Engine.Actor.*bad918d000 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68ae61c
	struct TArray<struct AActor*> *383cbfbf66(); // Function Engine.Actor.*383cbfbf66 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6895000
	float *48b2b80fa1(); // Function Engine.Actor.*48b2b80fa1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68986d0
	float *511ef00739(); // Function Engine.Actor.*511ef00739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896a78
	bool *83d2d5c58f(); // Function Engine.Actor.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ba04
	struct FVector *806c296001(); // Function Engine.Actor.*806c296001 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689e990
	struct FVector *a0012f52a9(); // Function Engine.Actor.*a0012f52a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689480c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xab1c94
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void GetTransform(struct FTransform ReturnValue); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xc6f6d4
	void *b7511d0ed8(enum class *ecdd115207 LocationRule, enum class *ecdd115207 RotationRule, enum class *ecdd115207 ScaleRule); // Function Engine.Actor.*b7511d0ed8 // Final|Native|Public|BlueprintCallable // @ game+0x689e620
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *1206b0a740(struct FVector ReturnValue); // Function Engine.Actor.*1206b0a740 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6894840
	void *f221ff8513(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6234cb0
	void *dd10056177(struct APawn* ReturnValue); // Function Engine.Actor.*dd10056177 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898608
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *45e9b736d8(bool ReturnValue); // Function Engine.Actor.*45e9b736d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68945b4
	void *e22a09fc3d(struct AActor* ReturnValue); // Function Engine.Actor.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899744
	void *d93dde83f1(struct UClass* ComponentClass, struct TArray<struct UActorComponent*> ReturnValue); // Function Engine.Actor.*d93dde83f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896250
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fa04
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c6a4
	void *057be55286(struct AActor* ReturnValue); // Function Engine.Actor.*057be55286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68997d8
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68995b4
	void *1357a6903c(float TickInterval); // Function Engine.Actor.*1357a6903c // Final|Native|Public|BlueprintCallable // @ game+0x68a6808
	void *ce1958648c(struct AActor* OtherActor, float ReturnValue); // Function Engine.Actor.*ce1958648c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896b18
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xcf4d04
	void AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform RelativeTransform, struct UObject* ComponentTemplateContext, struct UActorComponent* ReturnValue); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xc18b48
	void K2_AddActorLocalTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c2a0
	void ReceiveAnyDamage(float Damage, struct U*0ad023d030* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fdb4
	void K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x689db78
	void K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689bef0
	void *d85c70de6e(); // Function Engine.Actor.*d85c70de6e // Final|Native|Public|BlueprintCallable // @ game+0x689a744
	void *ef270d1a10(); // Function Engine.Actor.*ef270d1a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68997fc
	void *685e3b5cc9(); // Function Engine.Actor.*685e3b5cc9 // Native|Public|BlueprintCallable // @ game+0x68a9fd8
	void *581f8985e1(); // Function Engine.Actor.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x689e4d0
	void *32ee7138ab(); // Function Engine.Actor.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x68ac1f0
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ab8c
	void K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a00e0
	void *91da404789(); // Function Engine.Actor.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0xd1a1d4
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x68921b0
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x68a63d0
	void K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f7cc
	void *87d1cdd662(); // Function Engine.Actor.*87d1cdd662 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68abc08
	void *461623950c(); // Function Engine.Actor.*461623950c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b200
};

// Class Engine.AnimInstance
// Size: 0x3a8 (Inherited: 0x30)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct USkeleton* *a7e4906ff1; // 0x38(0x08)
	enum class *0accfd5352 *8ba26f4fbf; // 0x40(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x41(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x42(0x01)
	bool *c74b442f59; // 0x43(0x01)
	bool bWarnAboutBlueprintUsage; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x48(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x58(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x68(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x78(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x88(0x10)
	char pad_98[0x60]; // 0x98(0x60)
	bool *206a771f46; // 0xf8(0x01)
	char pad_F9[0x9f]; // 0xf9(0x9f)
	struct TArray<struct FAnimNotifyEvent> *6fc5b1d0be; // 0x198(0x10)
	char pad_1A8[0x200]; // 0x1a8(0x200)

	void *92ce4ee977(int32 MachineIndex, int32 TransitionIndex, float ReturnValue); // Function Engine.AnimInstance.*92ce4ee977 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cf8c0
	void *324fdf8f8a(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.*324fdf8f8a // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68e04ac
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *0e59f382aa(struct FName InSyncGroupName, struct F*c74ca801af ReturnValue); // Function Engine.AnimInstance.*0e59f382aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d4ad8
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *d213c50b7f(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, bool ReturnValue); // Function Engine.AnimInstance.*d213c50b7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68da5d4
	void *8e3bfbd48a(int32 MachineIndex, int32 TransitionIndex, float ReturnValue); // Function Engine.AnimInstance.*8e3bfbd48a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cfcc8
	void *cebaa7cd2c(struct FName SnapshotName); // Function Engine.AnimInstance.*cebaa7cd2c // Native|Public|BlueprintCallable // @ game+0x68edaf0
	void GetAnimAssetPlayerTimeFromEnd(struct UAnimationAsset* AnimAsset, float CurrentTime, float ReturnValue); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cb314
	void Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, float ReturnValue); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x33ba78
	void *3d7951dd37(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.*3d7951dd37 // Final|Native|Public|BlueprintCallable // @ game+0x68e5160
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *5e07a11f21(struct FName SyncGroup, struct FName MarkerName, bool ReturnValue); // Function Engine.AnimInstance.*5e07a11f21 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d8400
	void *7daaaa5771(int32 AssetPlayerIndex, float ReturnValue); // Function Engine.AnimInstance.*7daaaa5771 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68ced58
	void *46b80b3a59(struct UAnimMontage* Montage, float ReturnValue); // Function Engine.AnimInstance.*46b80b3a59 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68e4d44
	void *2fdfd7cfe3(struct AActor* ReturnValue); // Function Engine.AnimInstance.*2fdfd7cfe3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xca75dc
	void GetStateWeight(int32 MachineIndex, int32 StateIndex, float ReturnValue); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68d45b4
	void *003dacf78a(); // Function Engine.AnimInstance.*003dacf78a // Final|Native|Public|BlueprintCallable // @ game+0x68bfe38
	void *6bd52ed5b9(); // Function Engine.AnimInstance.*6bd52ed5b9 // Native|Public|BlueprintCallable // @ game+0xc16928
	void *7aeb896e6e(); // Function Engine.AnimInstance.*7aeb896e6e // Final|Native|Public|BlueprintCallable // @ game+0x69056dc
	void *8c261f57d4(); // Function Engine.AnimInstance.*8c261f57d4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68d2bd0
	void *be4d7059c2(); // Function Engine.AnimInstance.*be4d7059c2 // Final|Native|Public|BlueprintCallable // @ game+0x68e4ff0
	void *28886e519b(); // Function Engine.AnimInstance.*28886e519b // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x33bf58
	void *bcdca57f0a(); // Function Engine.AnimInstance.*bcdca57f0a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cce7c
	void *a38a5ce007(); // Function Engine.AnimInstance.*a38a5ce007 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68e4c04
	void *f56ecdaa87(); // Function Engine.AnimInstance.*f56ecdaa87 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6907354
	void *0a8f8d6319(); // Function Engine.AnimInstance.*0a8f8d6319 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68e04ac
	void *917921a2e3(); // Function Engine.AnimInstance.*917921a2e3 // Final|Native|Public|BlueprintCallable // @ game+0x68e4e84
	void GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x68cb1a0
	void *8681bde224(); // Function Engine.AnimInstance.*8681bde224 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6900710
	void PlaySlotAnimationAsDynamicMontage(); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x68e8c6c
	void *97a3af276c(); // Function Engine.AnimInstance.*97a3af276c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cf3e0
	void *40e1f5f43a(); // Function Engine.AnimInstance.*40e1f5f43a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cf0f8
	void *e064ffea5e(); // Function Engine.AnimInstance.*e064ffea5e // Final|Native|Public|BlueprintCallable // @ game+0x68e4f60
	void *757538402e(); // Function Engine.AnimInstance.*757538402e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x91e460
	void *39919f124d(); // Function Engine.AnimInstance.*39919f124d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68e4ca4
	void *7eeea6c74e(); // Function Engine.AnimInstance.*7eeea6c74e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x91e180
	void *a977510087(); // Function Engine.AnimInstance.*a977510087 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d9e90
	void *add693e1df(struct UAnimMontage* Montage, struct FName ReturnValue); // Function Engine.AnimInstance.*add693e1df // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68e4b68
	void *dcbdf49e66(struct UAnimMontage* Montage, bool ReturnValue); // Function Engine.AnimInstance.*dcbdf49e66 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68e4de4
	void *af34a038d7(int32 MachineIndex, int32 StateIndex, float ReturnValue); // Function Engine.AnimInstance.*af34a038d7 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68d29c8
	void *9c44837415(struct UAnimMontage* Montage, float ReturnValue); // Function Engine.AnimInstance.*9c44837415 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68e4ac8
	void *ce83b031d9(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder, bool ReturnValue); // Function Engine.AnimInstance.*ce83b031d9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68dab30
	void GetAnimAssetPlayerTimeFromEndFraction(struct UAnimationAsset* AnimAsset, float CurrentTime, float ReturnValue); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x68cb418
	void *8844726dd1(int32 AssetPlayerIndex, float ReturnValue); // Function Engine.AnimInstance.*8844726dd1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cef10
	void *b38c1f41c3(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.*b38c1f41c3 // Final|Native|Public|BlueprintCallable // @ game+0x68f8904
	void GetAnimAssetPlayerTimeFraction(struct UAnimationAsset* AnimAsset, float CurrentTime, float ReturnValue); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x68cb234
	void *a908599b82(int32 AssetPlayerIndex, float ReturnValue); // Function Engine.AnimInstance.*a908599b82 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68ce9c0
	void *04dc1a777c(struct FVector Velocity, struct FRotator BaseRotation, float ReturnValue); // Function Engine.AnimInstance.*04dc1a777c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68bcbb4
	void PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32 LoopCount, float ReturnValue); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x68e8a48
	void *f30cd63cdb(struct UAnimMontage* ReturnValue); // Function Engine.AnimInstance.*f30cd63cdb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68cc9f4
	void *8859b811a6(enum class *0accfd5352 Value); // Function Engine.AnimInstance.*8859b811a6 // Final|Native|Public|BlueprintCallable // @ game+0x68fa7bc
	void *d3925db7cd(int32 MachineIndex, int32 StateIndex, float ReturnValue); // Function Engine.AnimInstance.*d3925db7cd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68d2dec
	void *6abb6cfc88(int32 AssetPlayerIndex, float ReturnValue); // Function Engine.AnimInstance.*6abb6cfc88 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x91de58
	void *ae69dc5c64(struct FName SyncGroup, struct FName MarkerName, float OutMarkerTime, bool ReturnValue); // Function Engine.AnimInstance.*ae69dc5c64 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68d51a0
	void *5940d5128c(); // Function Engine.AnimInstance.*5940d5128c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d1cb8
	void GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68ccddc
	void *2ed9c97cc9(); // Function Engine.AnimInstance.*2ed9c97cc9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdadfd4
	void *c2413b9bde(); // Function Engine.AnimInstance.*c2413b9bde // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68cfac8
	void *c19b394f7e(); // Function Engine.AnimInstance.*c19b394f7e // Final|Native|Public|BlueprintCallable // @ game+0x68e5080
	void *0e6503e701(); // Function Engine.AnimInstance.*0e6503e701 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x68ceb8c
	void *4e9f00b274(); // Function Engine.AnimInstance.*4e9f00b274 // Native|Public|BlueprintCallable // @ game+0xbeaa18
	void *cce7bb269a(); // Function Engine.AnimInstance.*cce7bb269a // Native|Public|BlueprintCallable // @ game+0x33c738
	void *c96507ca7c(); // Function Engine.AnimInstance.*c96507ca7c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x91e638
};

// Class Engine.ActorComponent
// Size: 0x200 (Inherited: 0x30)
struct UActorComponent : UObject {
	char pad_30[0xf0]; // 0x30(0xf0)
	struct F*8d4039fc59 PrimaryComponentTick; // 0x120(0x58)
	struct TArray<struct FName> ComponentTags; // 0x178(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x188(0x10)
	char pad_198_0 : 3; // 0x198(0x01)
	char bReplicates : 1; // 0x198(0x01)
	char bNetAddressable : 1; // 0x198(0x01)
	char *42cccbce92 : 1; // 0x198(0x01)
	char pad_198_6 : 2; // 0x198(0x01)
	char pad_199[0x1]; // 0x199(0x01)
	char pad_19A_0 : 2; // 0x19a(0x01)
	char bCreatedByConstructionScript : 1; // 0x19a(0x01)
	char bInstanceComponent : 1; // 0x19a(0x01)
	char bAutoActivate : 1; // 0x19a(0x01)
	char *37789dceb0 : 1; // 0x19a(0x01)
	char *d6b476b16b : 1; // 0x19a(0x01)
	char pad_19A_7 : 1; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	struct FGuid DestructibleId; // 0x19c(0x10)
	bool bIsDestroyedVersion; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	char *5a62c75e8c : 1; // 0x1b0(0x01)
	char pad_1B0_1 : 2; // 0x1b0(0x01)
	char bIsEditorOnly : 1; // 0x1b0(0x01)
	char pad_1B0_4 : 4; // 0x1b0(0x01)
	char pad_1B1[0x4]; // 0x1b1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1b5(0x01)
	enum class EPendingCreationType *4795e00ee8; // 0x1b6(0x01)
	char pad_1B7[0x9]; // 0x1b7(0x09)
	struct TArray<struct FSimpleMemberReference> *98e040a793; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1d0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1e0(0x10)
	char pad_1F0[0x9]; // 0x1f0(0x09)
	char *195141a832 : 1; // 0x1f9(0x01)
	char pad_1F9_1 : 7; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)

	void *61bb7392aa(); // Function Engine.ActorComponent.*61bb7392aa // Native|Public|BlueprintCallable // @ game+0x68a6244
	void *05866bcfcb(); // Function Engine.ActorComponent.*05866bcfcb // Final|Native|Public|BlueprintCallable // @ game+0x68a9f44
	void Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xe76c58
	void *c4952b0099(); // Function Engine.ActorComponent.*c4952b0099 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896200
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0x6323a08
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x68a1b90
	void *f52554acee(); // Function Engine.ActorComponent.*f52554acee // Final|Native|Public|BlueprintCallable // @ game+0x68a8a88
	void *541a06a744(); // Function Engine.ActorComponent.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x68a30f0
	void ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *814a121c39(); // Function Engine.ActorComponent.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x68ac164
	void *0d0c513b2c(); // Function Engine.ActorComponent.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x68a3218
	void *9eb2ac36d0(); // Function Engine.ActorComponent.*9eb2ac36d0 // Native|Public|BlueprintCallable // @ game+0x5b4fe54
	void *6f8bd4c74b(); // Function Engine.ActorComponent.*6f8bd4c74b // Native|Public|BlueprintCallable // @ game+0x68a6e3c
	void *e22a09fc3d(); // Function Engine.ActorComponent.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xccfa04
	void IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b4fe6c
	void *d4c659a949(); // Function Engine.ActorComponent.*d4c659a949 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68911b0
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x688dbd0
	void *f221ff8513(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x688dc64
	void *2e369dcd8d(bool ReturnValue); // Function Engine.ActorComponent.*2e369dcd8d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b27c
	void *32ee7138ab(bool bTickableWhenPaused); // Function Engine.ActorComponent.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x68ac288
	void *581f8985e1(struct UObject* Object); // Function Engine.ActorComponent.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x689e568
	void *77f9b41839(bool bEnabled); // Function Engine.ActorComponent.*77f9b41839 // Native|Public|BlueprintCallable // @ game+0x68a89f0
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *3ae845f2b7(bool ReturnValue); // Function Engine.ActorComponent.*3ae845f2b7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b3c0
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x20a5d0
};

// Class Engine.Pawn
// Size: 0x450 (Inherited: 0x3f0)
struct APawn : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	char bUseControllerRotationPitch : 1; // 0x3f8(0x01)
	char bUseControllerRotationYaw : 1; // 0x3f8(0x01)
	char bUseControllerRotationRoll : 1; // 0x3f8(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x3f8(0x01)
	char pad_3F8_4 : 4; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	float BaseEyeHeight; // 0x3fc(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x400(0x01)
	enum class EAutoPossessAI *e0e3a12db9; // 0x401(0x01)
	char pad_402[0x6]; // 0x402(0x06)
	struct UClass* AIControllerClass; // 0x408(0x08)
	struct AController* *2f9c3272b2; // 0x410(0x08)
	struct AController* Controller; // 0x418(0x08)
	uint16 *021ce32c67; // 0x420(0x02)
	char pad_422[0x6]; // 0x422(0x06)
	struct APlayerState* PlayerState; // 0x428(0x08)
	char pad_430[0x4]; // 0x430(0x04)
	struct FVector *c0934ea168; // 0x434(0x0c)
	struct FVector *d20d64241b; // 0x440(0x0c)
	char pad_44C[0x4]; // 0x44c(0x04)

	void *c30d7bf87e(); // Function Engine.Pawn.*c30d7bf87e // Native|Public|BlueprintCallable // @ game+0x68ad434
	struct AController* ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct AController* GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68964ec
	struct FVector K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6899afc
	bool *7d02763a00(); // Function Engine.Pawn.*7d02763a00 // Final|Native|Public|BlueprintCallable // @ game+0x68a7ecc
	struct AActor* *9559952bce(); // Function Engine.Pawn.*9559952bce // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a1dd8
	bool *116ac9743d(); // Function Engine.Pawn.*116ac9743d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688d358
	float AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x688c264
	struct FVector *c87325b52a(); // Function Engine.Pawn.*c87325b52a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6898f64
	bool *8dcd001cb7(); // Function Engine.Pawn.*8dcd001cb7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b1e2d0
	struct UPawnMovementComponent* *09ea1f63ee(); // Function Engine.Pawn.*09ea1f63ee // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5aec368
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0xb2ebc4
	bool *5a76ea52e7(); // Function Engine.Pawn.*5a76ea52e7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a11d4
	bool *ec5c491810(); // Function Engine.Pawn.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b98c
	struct AActor* *f92d1c6c4c(); // Function Engine.Pawn.*f92d1c6c4c // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6898e2c
	bool *c9d088b372(); // Function Engine.Pawn.*c9d088b372 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b3ec
	struct FVector *d2bc061ca3(); // Function Engine.Pawn.*d2bc061ca3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68986a8
	struct FVector *a7b2c687f7(); // Function Engine.Pawn.*a7b2c687f7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6899afc
	struct FVector *b4938e18ab(); // Function Engine.Pawn.*b4938e18ab // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68915c8
	struct FRotator *cb88bbbff9(); // Function Engine.Pawn.*cb88bbbff9 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68950e8
	float AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x688c1c8
	void *5f4189de1b(); // Function Engine.Pawn.*5f4189de1b // Native|Public|BlueprintCallable // @ game+0x5ae7cb0
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x5b63af8
	bool *3c5cc3769a(); // Function Engine.Pawn.*3c5cc3769a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd124c4
	float AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x688c12c
	struct AController* ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68964b8
};

// Class Engine.DataAsset
// Size: 0x38 (Inherited: 0x30)
struct UDataAsset : UObject {
	struct UClass* *cdb62082ca; // 0x30(0x08)
};

// Class Engine.SceneComponent
// Size: 0x470 (Inherited: 0x200)
struct USceneComponent : UActorComponent {
	char pad_200[0x28]; // 0x200(0x28)
	struct FName *cb3fc8827c; // 0x228(0x08)
	char pad_230_0 : 1; // 0x230(0x01)
	char bReplicatesAttachmentReference : 1; // 0x230(0x01)
	char bReplicatesAttachment : 1; // 0x230(0x01)
	char *70c5e7a9b6 : 1; // 0x230(0x01)
	char pad_230_4 : 1; // 0x230(0x01)
	char bAbsoluteLocation : 1; // 0x230(0x01)
	char bAbsoluteRotation : 1; // 0x230(0x01)
	char bAbsoluteScale : 1; // 0x230(0x01)
	char bVisible : 1; // 0x231(0x01)
	char bHiddenInGame : 1; // 0x231(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x231(0x01)
	char *1dac92158a : 1; // 0x231(0x01)
	char bUseAttachParentBound : 1; // 0x231(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x231(0x01)
	char pad_231_6 : 2; // 0x231(0x01)
	char pad_232_0 : 3; // 0x232(0x01)
	char bAbsoluteTranslation : 1; // 0x232(0x01)
	char pad_232_4 : 4; // 0x232(0x01)
	char pad_233[0x1]; // 0x233(0x01)
	struct APhysicsVolume* PhysicsVolume; // 0x234(0x08)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct USceneComponent* AttachParent; // 0x240(0x08)
	struct FVector *bf3a460e85; // 0x248(0x0c)
	char pad_254[0x34]; // 0x254(0x34)
	enum class *92a8d5bca4 DetailMode; // 0x288(0x01)
	char pad_289[0x5f]; // 0x289(0x5f)
	struct FVector RelativeScale3D; // 0x2e8(0x0c)
	enum class EComponentMobility Mobility; // 0x2f4(0x01)
	char pad_2F5[0x3]; // 0x2f5(0x03)
	SetProperty *912139fe50; // 0x2f8(0x50)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x348(0x10)
	char pad_358[0x4]; // 0x358(0x04)
	struct FVector RelativeTranslation; // 0x35c(0x0c)
	struct FRotator RelativeRotation; // 0x368(0x0c)
	struct FVector RelativeLocation; // 0x374(0x0c)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x380(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x390(0x10)
	char pad_3A0[0xd0]; // 0x3a0(0xd0)

	void K2_SetWorldLocation(); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a0770
	void *30399f17ac(); // Function Engine.SceneComponent.*30399f17ac // Final|Native|Public|BlueprintCallable // @ game+0x68a9a9c
	void K2_SetRelativeTransform(); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a0544
	void *a82e4c11f1(); // Function Engine.SceneComponent.*a82e4c11f1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a0948
	void K2_SetRelativeLocation(); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xc78dc8
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689d084
	void *0281884c9e(bool ShouldReplicate); // Function Engine.SceneComponent.*0281884c9e // Final|Native|Public|BlueprintCallable // @ game+0x68a9e0c
	void *9269d42730(struct FVector ReturnValue); // Function Engine.SceneComponent.*9269d42730 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6899fcc
	void *8f25590c73(struct FVector ReturnValue); // Function Engine.SceneComponent.*8f25590c73 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6896218
	void *431ade8cc7(struct FRotator ReturnValue); // Function Engine.SceneComponent.*431ade8cc7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689eb5c
	void *e1a45b5fe3(struct FVector ReturnValue); // Function Engine.SceneComponent.*e1a45b5fe3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xcb8b48
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x3cd610
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689d41c
	void *0f8df46b26(struct TArray<struct FName> ReturnValue); // Function Engine.SceneComponent.*0f8df46b26 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894eb4
	void *cc0c29c29b(struct USceneComponent* InParent, struct FName InSocketName, bool ReturnValue); // Function Engine.SceneComponent.*cc0c29c29b // Final|Native|Public|BlueprintCallable // @ game+0x68ad32c
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689d250
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x6892028
	void K2_AddWorldTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689d7cc
	void *b4af2a3e8b(enum class *ecdd115207 LocationRule, enum class *ecdd115207 RotationRule, enum class *ecdd115207 ScaleRule, bool bCallModify); // Function Engine.SceneComponent.*b4af2a3e8b // Final|Native|Public|BlueprintCallable // @ game+0xd373a4
	void *63635bbd26(bool ShouldReplicate); // Function Engine.SceneComponent.*63635bbd26 // Final|Native|Public|BlueprintCallable // @ game+0x68a9ea8
	void OnRep_Visibility(bool Param0); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x68a1c70
	void K2_AddLocalTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689ce58
	void IsVisible(bool ReturnValue); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689bdd8
	void *d843f2564c(); // Function Engine.SceneComponent.*d843f2564c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689225c
	void *3e34911a72(); // Function Engine.SceneComponent.*3e34911a72 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68acf20
	void K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689cc80
	void *dd99459d4b(); // Function Engine.SceneComponent.*dd99459d4b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689a128
	void *b499c4ea3e(); // Function Engine.SceneComponent.*b499c4ea3e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894fe8
	void *5828b2e365(); // Function Engine.SceneComponent.*5828b2e365 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689a348
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xd5c578
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xc198c0
	void *f756a0f59d(); // Function Engine.SceneComponent.*f756a0f59d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6896c1c
	void *f54ed8c40b(); // Function Engine.SceneComponent.*f54ed8c40b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6895cf8
	void *47a7ed7776(); // Function Engine.SceneComponent.*47a7ed7776 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899170
	void *2203da3c3b(); // Function Engine.SceneComponent.*2203da3c3b // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68999ec
	void *af76098df3(); // Function Engine.SceneComponent.*af76098df3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe87edc
	void K2_AttachTo(); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x689dcf8
	void *cae9ec1747(); // Function Engine.SceneComponent.*cae9ec1747 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689a9bc
	void *860e529060(); // Function Engine.SceneComponent.*860e529060 // Final|Native|Public|BlueprintCallable // @ game+0x68a32f4
	void *6899b690c6(); // Function Engine.SceneComponent.*6899b690c6 // Final|Native|Public|BlueprintCallable // @ game+0x68a6100
	void *91da404789(); // Function Engine.SceneComponent.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0x689e098
	void *a16ae93b8c(); // Function Engine.SceneComponent.*a16ae93b8c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6899f60
	void *007b399f94(); // Function Engine.SceneComponent.*007b399f94 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b254
	void *b9705d1983(); // Function Engine.SceneComponent.*b9705d1983 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689a1e0
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a0b78
	void *76907d1282(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.*76907d1282 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a0314
	void *8c7d8b49f7(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*> Children); // Function Engine.SceneComponent.*8c7d8b49f7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6895d98
	void *05a07db4bd(struct FVector ReturnValue); // Function Engine.SceneComponent.*05a07db4bd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ebe0
	void ToggleVisibility(bool bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x68ae0bc
	void *bac6a64c08(struct FName InSocketName, struct FRotator ReturnValue); // Function Engine.SceneComponent.*bac6a64c08 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689a290
	void *51f025391d(struct FName BoneName, bool ReturnValue); // Function Engine.SceneComponent.*51f025391d // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b942b8
	void K2_SetWorldTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a0d50
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xd5c578
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xce84f4
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689d5f4
	void *1f50dc4b23(struct APhysicsVolume* ReturnValue); // Function Engine.SceneComponent.*1f50dc4b23 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899d58
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xd38680
	void K2_GetComponentToWorld(struct FTransform ReturnValue); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ec24
	void *d6ea9645a8(struct FVector NewScale3D); // Function Engine.SceneComponent.*d6ea9645a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0xd59f0c
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689caa8
};

// Class Engine.PrimitiveComponent
// Size: 0x9b0 (Inherited: 0x470)
struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x470(0x04)
	float LDMaxDrawDistance; // 0x474(0x04)
	float CachedMaxDrawDistance; // 0x478(0x04)
	enum class *4c2c3fa7ba *eb729ee19c; // 0x47c(0x01)
	enum class *4c2c3fa7ba *4abdb2d2ee; // 0x47d(0x01)
	char pad_47E[0x2]; // 0x47e(0x02)
	char pad_480_0 : 3; // 0x480(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x480(0x01)
	char bGenerateOverlapEvents : 1; // 0x480(0x01)
	char bMultiBodyOverlap : 1; // 0x480(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x480(0x01)
	char bTraceComplexOnMove : 1; // 0x480(0x01)
	char bDisableForceFromCharacter : 1; // 0x481(0x01)
	char bReturnMaterialOnMove : 1; // 0x481(0x01)
	char *09f6c4c3d1 : 1; // 0x481(0x01)
	char bAllowCullDistanceVolume : 1; // 0x481(0x01)
	char bImportantMesh : 1; // 0x481(0x01)
	char bOverrideCullingDistances : 1; // 0x481(0x01)
	char pad_481_6 : 2; // 0x481(0x01)
	char pad_482[0x2]; // 0x482(0x02)
	float HLODScreenSize; // 0x484(0x04)
	char *6d95e74c7f : 1; // 0x488(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x488(0x01)
	char bRenderInMainPass : 1; // 0x488(0x01)
	char bRenderInMono : 1; // 0x488(0x01)
	char bOwnerNoSee : 1; // 0x488(0x01)
	char bOnlyOwnerSee : 1; // 0x488(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x488(0x01)
	char bUseAsOccluder : 1; // 0x488(0x01)
	char bForceAsOccluder : 1; // 0x489(0x01)
	char bForceOcclusionQuerying : 1; // 0x489(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x489(0x01)
	char *2ec0cf6207 : 1; // 0x489(0x01)
	char bForceMipStreaming : 1; // 0x489(0x01)
	char *105359d223 : 1; // 0x489(0x01)
	char pad_489_6 : 1; // 0x489(0x01)
	char CastShadow : 1; // 0x489(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x48a(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x48a(0x01)
	char bCastDynamicShadow : 1; // 0x48a(0x01)
	char bCastStaticShadow : 1; // 0x48a(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x48a(0x01)
	char bSelfShadowOnly : 1; // 0x48a(0x01)
	char bCastFarShadow : 1; // 0x48a(0x01)
	char bCastInsetShadow : 1; // 0x48a(0x01)
	char bCastCinematicShadow : 1; // 0x48b(0x01)
	char bCastHiddenShadow : 1; // 0x48b(0x01)
	char bCastShadowAsTwoSided : 1; // 0x48b(0x01)
	char bLightAsIfStatic : 1; // 0x48b(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x48b(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x48b(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x48b(0x01)
	char bIgnoreRadialImpulse : 1; // 0x48b(0x01)
	char bIgnoreRadialForce : 1; // 0x48c(0x01)
	char bApplyImpulseOnDamage : 1; // 0x48c(0x01)
	char bSyncBodySleep : 1; // 0x48c(0x01)
	char *1e5038da00 : 1; // 0x48c(0x01)
	char *0f77398d5f : 1; // 0x48c(0x01)
	char *c1c03669ea : 1; // 0x48c(0x01)
	char bRenderCustomDepth : 1; // 0x48c(0x01)
	char pad_48C_7 : 1; // 0x48c(0x01)
	char pad_48D_0 : 7; // 0x48d(0x01)
	char *7ea77ae49c : 1; // 0x48d(0x01)
	char *d5b1d4efdd : 1; // 0x48e(0x01)
	char *634898d6e3 : 1; // 0x48e(0x01)
	char pad_48E_2 : 6; // 0x48e(0x01)
	char pad_48F[0x1]; // 0x48f(0x01)
	enum class EDecalChannel DecalChannel; // 0x490(0x01)
	enum class *c276e29a27 IndoorOutdoorMask; // 0x491(0x01)
	struct FLightingChannels LightingChannels; // 0x492(0x03)
	enum class *5e872d5d99 IndirectLightingCacheQuality; // 0x495(0x01)
	bool CustomDepthStencilValue; // 0x496(0x01)
	enum class *e33f967072 CustomDepthStencilWriteMask; // 0x497(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x498(0x10)
	int32 TranslucencySortPriority; // 0x4a8(0x04)
	int32 *bc309c15af; // 0x4ac(0x04)
	char pad_4B0[0x4]; // 0x4b0(0x04)
	float LpvBiasMultiplier; // 0x4b4(0x04)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct FBodyInstance BodyInstance; // 0x4c0(0x240)
	char pad_700[0x8]; // 0x700(0x08)
	enum class EHasCustomNavigableGeometry *36f10e7fa8; // 0x708(0x01)
	char pad_709[0x3b]; // 0x709(0x3b)
	float BoundsScale; // 0x744(0x04)
	float *990edc28ca; // 0x748(0x04)
	float *680d1c60d0; // 0x74c(0x04)
	float *ba01ced785; // 0x750(0x04)
	enum class *7235c251e5 CanBeCharacterBase; // 0x754(0x01)
	char pad_755[0x1]; // 0x755(0x01)
	enum class *7235c251e5 CanCharacterStepUpOn; // 0x756(0x01)
	char pad_757[0x1]; // 0x757(0x01)
	struct TArray<struct AActor*> *23831abfcf; // 0x758(0x10)
	struct TArray<struct UPrimitiveComponent*> *0c87b28730; // 0x768(0x10)
	char pad_778[0xb8]; // 0x778(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x830(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x840(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x850(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x860(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x870(0x10)
	char pad_880[0x10]; // 0x880(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x890(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x8a0(0x10)
	struct FMulticastDelegate OnClicked; // 0x8b0(0x10)
	struct FMulticastDelegate OnReleased; // 0x8c0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x8d0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x8e0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x8f0(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x900(0x10)
	char pad_910[0x28]; // 0x910(0x28)
	struct UPrimitiveComponent* *aef56929f8; // 0x938(0x08)
	struct UPrimitiveComponent* *0cf5ac713e; // 0x940(0x08)
	struct F*254b7d2b0f *162fbfca55; // 0x948(0x58)
	char pad_9A0[0x10]; // 0x9a0(0x10)

	bool *e9db8211c2(); // Function Engine.PrimitiveComponent.*e9db8211c2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689efa0
	bool *5ba0e047ef(); // Function Engine.PrimitiveComponent.*5ba0e047ef // Native|Public|BlueprintCallable // @ game+0x68a6bcc
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x68916a0
	bool *83d2d5c58f(); // Function Engine.PrimitiveComponent.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689baa4
	int32 *2355b14434(); // Function Engine.PrimitiveComponent.*2355b14434 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68991a8
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x6891854
	float *64501b49de(); // Function Engine.PrimitiveComponent.*64501b49de // Final|Native|Public|BlueprintCallable // @ game+0x68a7d90
	float *52312be303(); // Function Engine.PrimitiveComponent.*52312be303 // Final|Native|Public|BlueprintCallable // @ game+0x68a8cb8
	void *28aecd6f59(); // Function Engine.PrimitiveComponent.*28aecd6f59 // Final|Native|Public|BlueprintCallable // @ game+0x688eaf0
	float SetMassScale(); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x68aa7b4
	struct FVector *523a890fe3(); // Function Engine.PrimitiveComponent.*523a890fe3 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6899c20
	struct FName AddForceAtLocation(); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688c958
	struct FName *4696406aa4(); // Function Engine.PrimitiveComponent.*4696406aa4 // Final|Native|Public|BlueprintCallable // @ game+0x6896078
	bool *d97262aee0(); // Function Engine.PrimitiveComponent.*d97262aee0 // Native|Public|BlueprintCallable // @ game+0x68aae58
	bool AddImpulse(); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688ceb8
	bool *d81824b167(); // Function Engine.PrimitiveComponent.*d81824b167 // Final|Native|Public|BlueprintCallable // @ game+0x689af54
	enum class ECollisionResponse *53ce351ab3(); // Function Engine.PrimitiveComponent.*53ce351ab3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68960b0
	bool SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a6acc
	bool SetPhysicsMaxAngularVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x68ab22c
	void *2457fa2026(struct TArray<struct F*0f151f07b7> ReturnValue); // Function Engine.PrimitiveComponent.*2457fa2026 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68992dc
	void *c547ccf43f(struct FName BoneName, struct FVector ReturnValue); // Function Engine.PrimitiveComponent.*c547ccf43f // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6895bd4
	void *2a28a4ceb1(int32 Value); // Function Engine.PrimitiveComponent.*2a28a4ceb1 // Final|Native|Public|BlueprintCallable // @ game+0x68a8d50
	void *b8614f6ee8(int32 ElementIndex, struct UMaterialInterface* ReturnValue); // Function Engine.PrimitiveComponent.*b8614f6ee8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689891c
	void GetPhysicsLinearVelocity(struct FName BoneName, struct FVector ReturnValue); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xd7db10
	void *c0fc59eca2(float InMassScale); // Function Engine.PrimitiveComponent.*c0fc59eca2 // Native|Public|BlueprintCallable // @ game+0x68a6938
	void *48b0674a6b(struct AActor* Actor, bool bShouldIgnore); // Function Engine.PrimitiveComponent.*48b0674a6b // Final|Native|Public|BlueprintCallable // @ game+0x689ae74
	void *2726371f61(bool InUseCCD, struct FName BoneName); // Function Engine.PrimitiveComponent.*2726371f61 // Native|Public|BlueprintCallable // @ game+0x68ac74c
	void *8e06d61cd2(enum class ECollisionEnabled NewType); // Function Engine.PrimitiveComponent.*8e06d61cd2 // Native|Public|BlueprintCallable // @ game+0xd049a8
	void *7d15f33df8(bool bSimulate); // Function Engine.PrimitiveComponent.*7d15f33df8 // Native|Public|BlueprintCallable // @ game+0xd844d0
	void *2fcd5dc4f1(struct UPrimitiveComponent* OtherComp, bool ReturnValue); // Function Engine.PrimitiveComponent.*2fcd5dc4f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689bb44
	void *af2cc12a58(struct APawn* Pawn, bool ReturnValue); // Function Engine.PrimitiveComponent.*af2cc12a58 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x688e470
	void *6147859fcb(int32 FaceIndex, struct UMaterialInterface* ReturnValue); // Function Engine.PrimitiveComponent.*6147859fcb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68989c0
	void *b8cf4b4c35(bool bValue); // Function Engine.PrimitiveComponent.*b8cf4b4c35 // Final|Native|Public|BlueprintCallable // @ game+0x68ab990
	void *e13e475844(struct F*705bbdf923 ReturnValue); // Function Engine.PrimitiveComponent.*e13e475844 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ad90
	void SetCollisionObjectType(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x68a8484
	void *c32c2b30ad(struct FVector Origin, float Radius, float Strength, enum class *cb41f937c0 Falloff, bool bVelChange); // Function Engine.PrimitiveComponent.*c32c2b30ad // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688d8cc
	void *3a3aa0f9aa(enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.*3a3aa0f9aa // Native|Public|BlueprintCallable // @ game+0x68a85b0
	void *7f0b02410b(enum class EDOFMode ConstraintMode); // Function Engine.PrimitiveComponent.*7f0b02410b // Native|Public|BlueprintCallable // @ game+0x68a8b20
	void *714e0a606e(enum class *e33f967072 WriteMaskBit); // Function Engine.PrimitiveComponent.*714e0a606e // Final|Native|Public|BlueprintCallable // @ game+0x68a8de0
	void *90432a4b88(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.*90432a4b88 // Native|Public|BlueprintCallable // @ game+0x68ab198
	void *b735fad47e(int32 NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.*b735fad47e // Final|Native|Public|BlueprintCallable // @ game+0x68ac4a8
	void *4fedb1a6a3(enum class EDOFMode LockedAxis); // Function Engine.PrimitiveComponent.*4fedb1a6a3 // Native|Public|BlueprintCallable // @ game+0x68aa418
	void *e87bee575d(bool bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.*e87bee575d // Final|Native|Public|BlueprintCallable // @ game+0x68aaef0
	void *aaacbbdb6c(); // Function Engine.PrimitiveComponent.*aaacbbdb6c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5aa7820
	void *78d8a0af1f(); // Function Engine.PrimitiveComponent.*78d8a0af1f // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68ace4c
	void SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a8114
	void *19a69f011f(); // Function Engine.PrimitiveComponent.*19a69f011f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6895ecc
	void *0de970a16f(); // Function Engine.PrimitiveComponent.*0de970a16f // Final|Native|Public|BlueprintCallable // @ game+0x68a2d38
	void SetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xd518b8
	void AddAngularImpulse(); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688bf44
	void AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688cff8
	void SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0xda7178
	void *74fc74b263(); // Function Engine.PrimitiveComponent.*74fc74b263 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689885c
	void *bd0ec46553(); // Function Engine.PrimitiveComponent.*bd0ec46553 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a69d4
	void SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x68a1810
	void *48305203f7(); // Function Engine.PrimitiveComponent.*48305203f7 // Native|Public|BlueprintCallable // @ game+0x68aa898
	void *d260a6c731(); // Function Engine.PrimitiveComponent.*d260a6c731 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896050
	void *47ec021dd1(); // Function Engine.PrimitiveComponent.*47ec021dd1 // Native|Public|BlueprintCallable // @ game+0x68a32ac
	void *40b80e1f86(); // Function Engine.PrimitiveComponent.*40b80e1f86 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894f54
	void *04a08b51bb(); // Function Engine.PrimitiveComponent.*04a08b51bb // Native|Public|BlueprintCallable // @ game+0x5b1f11c
	void CreateAndSetMaterialInstanceDynamic(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x68917b0
	void *7614d2f54e(); // Function Engine.PrimitiveComponent.*7614d2f54e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b6e4
	void *603b323c81(); // Function Engine.PrimitiveComponent.*603b323c81 // Final|Native|Public|BlueprintCallable // @ game+0x688eb0c
	void *448cf7e0f2(); // Function Engine.PrimitiveComponent.*448cf7e0f2 // Native|Public|BlueprintCallable // @ game+0x68ae3a0
	void *0f1b74141b(); // Function Engine.PrimitiveComponent.*0f1b74141b // Final|Native|Public|BlueprintCallable // @ game+0x68ab040
	void AddTorque(); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x688dcf8
	void K2_LineTraceComponent(bool bShowTrace, struct FVector HitLocation, struct FVector HitNormal, struct FName BoneName, struct FHitResult OutHit, bool ReturnValue); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f030
	void *2e26aaaf30(struct FName InCollisionProfileName); // Function Engine.PrimitiveComponent.*2e26aaaf30 // Native|Public|BlueprintCallable // @ game+0x68a851c
	void GetPhysicsAngularVelocity(struct FName BoneName, struct FVector ReturnValue); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6899b70
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> InOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x689967c
	void GetMass(float ReturnValue); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898830
	void *09ce12ba0b(struct FName BoneName, float MassInKg, bool bOverrideMass); // Function Engine.PrimitiveComponent.*09ce12ba0b // Native|Public|BlueprintCallable // @ game+0x68aa688
	void *85d8176587(bool ReturnValue); // Function Engine.PrimitiveComponent.*85d8176587 // Native|Public|BlueprintCallable // @ game+0x689b22c
	void *6cbdd1633c(bool bValue); // Function Engine.PrimitiveComponent.*6cbdd1633c // Final|Native|Public|BlueprintCallable // @ game+0x68aba24
	void *90cc3021c0(bool bValue); // Function Engine.PrimitiveComponent.*90cc3021c0 // Final|Native|Public|BlueprintCallable // @ game+0x68abab8
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors, struct UClass* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6899484
	void *083545280a(struct TArray<struct UPrimitiveComponent*> ReturnValue); // Function Engine.PrimitiveComponent.*083545280a // Final|Native|Public|BlueprintCallable // @ game+0x6891728
	void SetPhysicsAngularVelocity(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xd43d1c
	void *8022a6e53e(struct FVector Origin, float Radius, float Strength, enum class *cb41f937c0 Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.*8022a6e53e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688d6f8
	void *67e552295b(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.*67e552295b // Native|Public|BlueprintCallable // @ game+0x68a8648
	void *f1e65a30d8(struct FVector InputVector, struct FName BoneName, struct FVector ReturnValue); // Function Engine.PrimitiveComponent.*f1e65a30d8 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68a37b8
	void AddForceAtLocationLocal(struct FVector force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688caa4
	void *6e71cecd23(struct FName BoneName, struct FVector ReturnValue); // Function Engine.PrimitiveComponent.*6e71cecd23 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68978b4
	void CreateDynamicMaterialInstance(int32 ElementIndex, struct UMaterialInterface* SourceMaterial, struct UMaterialInstanceDynamic* ReturnValue); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x6891944
	void *95fc0388db(bool ReturnValue); // Function Engine.PrimitiveComponent.*95fc0388db // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689effc
	void AddForce(); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688c818
	void *99eb55293a(); // Function Engine.PrimitiveComponent.*99eb55293a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896028
	void *419ebb4754(); // Function Engine.PrimitiveComponent.*419ebb4754 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689efcc
	void *638da52b6d(); // Function Engine.PrimitiveComponent.*638da52b6d // Final|Native|Public|BlueprintCallable // @ game+0x68a7fe8
	void SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x68aa37c
};

// Class Engine.MeshComponent
// Size: 0xab0 (Inherited: 0x9b0)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x9a8(0x10)
	char pad_9C0[0xf0]; // 0x9c0(0xf0)

	struct TArray<struct UMaterialInterface*> *9bc7eb317f(); // Function Engine.MeshComponent.*9bc7eb317f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898b98
	bool *7c084373ce(); // Function Engine.MeshComponent.*7c084373ce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b8bc
	int32 *372cae974e(); // Function Engine.MeshComponent.*372cae974e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898a64
	struct TArray<struct FName> *e12aafe669(); // Function Engine.MeshComponent.*e12aafe669 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898b0c
	float *dd190eacfc(); // Function Engine.MeshComponent.*dd190eacfc // Final|Native|Public|BlueprintCallable // @ game+0xca8604
	struct FVector *00ffa1d77b(); // Function Engine.MeshComponent.*00ffa1d77b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xc968ac
};

// Class Engine.StaticMeshComponent
// Size: 0xb50 (Inherited: 0xab0)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xab0(0x04)
	int32 *9f0fda2ed8; // 0xab4(0x04)
	bool bOverrideMinLOD; // 0xab8(0x01)
	char pad_AB9[0x3]; // 0xab9(0x03)
	int32 MinLOD; // 0xabc(0x04)
	struct UStaticMesh* StaticMesh; // 0xac0(0x08)
	bool bOverrideWireframeColor; // 0xac8(0x01)
	char pad_AC9[0x3]; // 0xac9(0x03)
	struct FColor WireframeColorOverride; // 0xacc(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xad0(0x10)
	char *138a858590 : 1; // 0xae0(0x01)
	char *c1a735b803 : 1; // 0xae0(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xae0(0x01)
	char *b431fce4a2 : 1; // 0xae0(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xae0(0x01)
	char bOverrideLightMapRes : 1; // 0xae0(0x01)
	char pad_AE0_6 : 2; // 0xae0(0x01)
	char pad_AE1[0x3]; // 0xae1(0x03)
	int32 OverriddenLightMapRes; // 0xae4(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xae8(0x01)
	char pad_AE8_1 : 7; // 0xae8(0x01)
	char pad_AE9[0x3]; // 0xae9(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xaec(0x04)
	float StreamingDistanceMultiplier; // 0xaf0(0x04)
	int32 *12d8adf087; // 0xaf4(0x04)
	char *402c8627cc : 1; // 0xaf8(0x01)
	char pad_AF8_1 : 7; // 0xaf8(0x01)
	char pad_AF9[0x7]; // 0xaf9(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xb00(0x10)
	struct TArray<struct F*87fceb50c7> *5ff7bc7629; // 0xb10(0x10)
	struct TArray<struct F*8760f7f7d5> *ad72999b02; // 0xb20(0x10)
	bool *24446b5829; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	struct F*2ca2c467d8 LightmassSettings; // 0xb34(0x18)
	char pad_B4C[0x4]; // 0xb4c(0x04)

	int32 *11ee32cc52(); // Function Engine.StaticMeshComponent.*11ee32cc52 // Final|Native|Public|BlueprintCallable // @ game+0x68a92d4
	struct FVector *8243903fcf(); // Function Engine.StaticMeshComponent.*8243903fcf // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6898728
	bool SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x633465c
	struct UStaticMesh* OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x68a1bc8
};

// Class Engine.SkinnedMeshComponent
// Size: 0xc50 (Inherited: 0xab0)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xab0(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xab8(0x08)
	char pad_AC0[0x60]; // 0xac0(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb20(0x01)
	char pad_B20_1 : 7; // 0xb20(0x01)
	char pad_B21[0x7]; // 0xb21(0x07)
	struct TArray<struct FBoxSphereBounds> *7e707d842a; // 0xb28(0x10)
	char pad_B38[0x20]; // 0xb38(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xb58(0x08)
	int32 ForcedLodModel; // 0xb60(0x04)
	int32 MinLodModel; // 0xb64(0x04)
	char pad_B68[0x10]; // 0xb68(0x10)
	struct TArray<struct F*716b1d68f9> LODInfo; // 0xb78(0x10)
	float StreamingDistanceMultiplier; // 0xb88(0x04)
	struct FColor WireframeColor; // 0xb8c(0x04)
	char *3f2cd63a77 : 1; // 0xb90(0x01)
	char *f9ca417f7f : 1; // 0xb90(0x01)
	char bDisableMorphTarget : 1; // 0xb90(0x01)
	char *490444df87 : 1; // 0xb90(0x01)
	char pad_B90_4 : 4; // 0xb90(0x01)
	char pad_B91[0x17]; // 0xb91(0x17)
	char bPerBoneMotionBlur : 1; // 0xba8(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xba8(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xba8(0x01)
	char bSyncAttachParentLOD : 1; // 0xba8(0x01)
	char pad_BA8_4 : 4; // 0xba8(0x01)
	char pad_BA9[0x3]; // 0xba9(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xbac(0x01)
	char pad_BAD[0x3]; // 0xbad(0x03)
	char *6f302faed4 : 1; // 0xbb0(0x01)
	char *71246305c4 : 1; // 0xbb0(0x01)
	char *8f160de05a : 1; // 0xbb0(0x01)
	char pad_BB0_3 : 5; // 0xbb0(0x01)
	char pad_BB1[0x3]; // 0xbb1(0x03)
	bool *f69c993587; // 0xbb4(0x01)
	char pad_BB5[0x3]; // 0xbb5(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xbb8(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xbb8(0x01)
	char pad_BB8_2 : 6; // 0xbb8(0x01)
	char pad_BB9[0x3]; // 0xbb9(0x03)
	char bRenderStatic : 1; // 0xbbc(0x01)
	char pad_BBC_1 : 7; // 0xbbc(0x01)
	char pad_BBD[0x3]; // 0xbbd(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xbc0(0x04)
	char *b1a1d2d22b : 1; // 0xbc4(0x01)
	char pad_BC4_1 : 7; // 0xbc4(0x01)
	char pad_BC5[0xf]; // 0xbc5(0x0f)
	struct FBoxSphereBounds *e8d742ebf8; // 0xbd4(0x1c)
	bool *4378cc44ba; // 0xbf0(0x01)
	bool bEnableUpdateRateOptimizations; // 0xbf1(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xbf2(0x01)
	char pad_BF3[0x4e]; // 0xbf3(0x4e)
	bool *55af0130d7; // 0xc41(0x01)
	bool *78147857b9; // 0xc42(0x01)
	char pad_C43[0xd]; // 0xc43(0x0d)

	int32 *4394f2b79a(); // Function Engine.SkinnedMeshComponent.*4394f2b79a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d146c
	struct FName *838df13444(); // Function Engine.SkinnedMeshComponent.*838df13444 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d1d10
	bool *026700c446(); // Function Engine.SkinnedMeshComponent.*026700c446 // Final|Native|Public|BlueprintCallable // @ game+0x68f21ac
	bool *68bb8d275b(); // Function Engine.SkinnedMeshComponent.*68bb8d275b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68b8d14
	float *ba1220499b(); // Function Engine.SkinnedMeshComponent.*ba1220499b // Final|Native|Public|BlueprintCallable // @ game+0x68f1c58
	int32 *e158c5febe(); // Function Engine.SkinnedMeshComponent.*e158c5febe // Final|Native|Public|BlueprintCallable // @ game+0x68f8718
	struct USkinnedMeshComponent* *8f2840426b(); // Function Engine.SkinnedMeshComponent.*8f2840426b // Final|Native|Public|BlueprintCallable // @ game+0x68f85e8
	struct FName *c3e2b97429(); // Function Engine.SkinnedMeshComponent.*c3e2b97429 // Final|Native|Public|BlueprintCallable // @ game+0x690737c
	int32 *4314e5075f(); // Function Engine.SkinnedMeshComponent.*4314e5075f // Final|Native|Public|BlueprintCallable // @ game+0x68c0260
	struct FRotator *cd65a7e2a2(); // Function Engine.SkinnedMeshComponent.*cd65a7e2a2 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6906d70
	bool *10e2fc0989(); // Function Engine.SkinnedMeshComponent.*10e2fc0989 // Final|Native|Public|BlueprintCallable // @ game+0x68d9f5c
	int32 GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68cbc54
	struct FName *eac8bd7d31(); // Function Engine.SkinnedMeshComponent.*eac8bd7d31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d427c
	int32 *d05921b40e(); // Function Engine.SkinnedMeshComponent.*d05921b40e // Final|Native|Public|BlueprintCallable // @ game+0x68f5958
	struct FName *fbe2178ccc(); // Function Engine.SkinnedMeshComponent.*fbe2178ccc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68cbf10
	bool *1f742918c4(); // Function Engine.SkinnedMeshComponent.*1f742918c4 // Final|Native|Public|BlueprintCallable // @ game+0x68f20fc
	struct FName *8612ed82dd(); // Function Engine.SkinnedMeshComponent.*8612ed82dd // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68c894c
	enum class *b8ba79008c *a26716e360(); // Function Engine.SkinnedMeshComponent.*a26716e360 // Final|Native|Public|BlueprintCallable // @ game+0x68d88b8
	bool *dafdadd3ee(); // Function Engine.SkinnedMeshComponent.*dafdadd3ee // Native|Public|BlueprintCallable // @ game+0x68f9648
	bool SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x68faa10
	struct FRotator *ebb6e42b77(); // Function Engine.SkinnedMeshComponent.*ebb6e42b77 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6907144
	struct TArray<struct F*f86f4b653b> SetSkinWeightOverride(); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68fabbc
	struct TArray<struct FLinearColor> *f9a2b14326(); // Function Engine.SkinnedMeshComponent.*f9a2b14326 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68fdd3c
	int32 *fa9a237ed2(); // Function Engine.SkinnedMeshComponent.*fa9a237ed2 // Final|Native|Public|BlueprintCallable // @ game+0x68bfefc
	bool *b1f7e668fd(); // Function Engine.SkinnedMeshComponent.*b1f7e668fd // Final|Native|Public|BlueprintCallable // @ game+0x68fa578
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1150 (Inherited: 0xc50)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xc50(0x08)
	struct UClass* AnimClass; // 0xc58(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xc60(0x08)
	struct TArray<struct UAnimInstance*> *03c8c15a34; // 0xc68(0x10)
	struct UAnimInstance* *20e7dd5deb; // 0xc78(0x08)
	struct F*26e8fbfd7d AnimationData; // 0xc80(0x18)
	char pad_C98[0x30]; // 0xc98(0x30)
	struct TArray<struct FTransform> *9848550080; // 0xcc8(0x10)
	struct TArray<struct FTransform> *394e69fb9f; // 0xcd8(0x10)
	char pad_CE8[0x20]; // 0xce8(0x20)
	float GlobalAnimRateScale; // 0xd08(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd0c(0x01)
	enum class *05c097b6a7 PhysicsTransformUpdateMode; // 0xd0d(0x01)
	char pad_D0E[0x1]; // 0xd0e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd0f(0x01)
	char pad_D10[0x4]; // 0xd10(0x04)
	char pad_D14_0 : 1; // 0xd14(0x01)
	char *c4bdbb1cf4 : 1; // 0xd14(0x01)
	char pad_D14_2 : 1; // 0xd14(0x01)
	char *6421e28158 : 1; // 0xd14(0x01)
	char pad_D14_4 : 2; // 0xd14(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd14(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd14(0x01)
	char bDisableClothSimulation : 1; // 0xd15(0x01)
	char pad_D15_1 : 2; // 0xd15(0x01)
	char bCollideWithEnvironment : 1; // 0xd15(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd15(0x01)
	char bLocalSpaceSimulation : 1; // 0xd15(0x01)
	char *9d44ba5ec9 : 1; // 0xd15(0x01)
	char bResetAfterTeleport : 1; // 0xd15(0x01)
	char pad_D16_0 : 1; // 0xd16(0x01)
	char bNoSkeletonUpdate : 1; // 0xd16(0x01)
	char bPauseAnims : 1; // 0xd16(0x01)
	char *ed86ed2e15 : 1; // 0xd16(0x01)
	char bEnablePerPolyCollision : 1; // 0xd16(0x01)
	char *c01750e849 : 1; // 0xd16(0x01)
	char *83c65effe5 : 1; // 0xd16(0x01)
	char *240877b930 : 1; // 0xd16(0x01)
	char *c9d93e6eb3 : 1; // 0xd17(0x01)
	char *0aa5f65cc4 : 1; // 0xd17(0x01)
	char *764f80ac00 : 1; // 0xd17(0x01)
	char *f76af3c9c8 : 1; // 0xd17(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd17(0x01)
	char *ff27a462a4 : 1; // 0xd17(0x01)
	char pad_D17_6 : 2; // 0xd17(0x01)
	char *67eb3862bf : 1; // 0xd18(0x01)
	char pad_D18_1 : 7; // 0xd18(0x01)
	char pad_D19_0 : 2; // 0xd19(0x01)
	char bDefaultLooping : 1; // 0xd19(0x01)
	char bDefaultPlaying : 1; // 0xd19(0x01)
	char pad_D19_4 : 4; // 0xd19(0x01)
	uint16 *fb5365b7ee; // 0xd1a(0x02)
	float ClothBlendWeight; // 0xd1c(0x04)
	struct FVector *0e1553491d; // 0xd20(0x0c)
	char pad_D2C[0x4]; // 0xd2c(0x04)
	struct UBodySetup* BodySetup; // 0xd30(0x08)
	float TeleportDistanceThreshold; // 0xd38(0x04)
	float TeleportRotationThreshold; // 0xd3c(0x04)
	struct FVector *bf2f3285e7; // 0xd40(0x0c)
	char pad_D4C[0x4]; // 0xd4c(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xd50(0x10)
	char pad_D60[0xe0]; // 0xd60(0xe0)
	struct UClass* *cf624e37bc; // 0xe40(0x08)
	char pad_E48[0x1e8]; // 0xe48(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1030(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1038(0x08)
	float DefaultPosition; // 0x1040(0x04)
	float DefaultPlayRate; // 0x1044(0x04)
	uint32 *f2bafb289a; // 0x1048(0x04)
	float *9553518a1b; // 0x104c(0x04)
	char pad_1050[0x100]; // 0x1050(0x100)

	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d24c4
	struct FName *0419cb3ccb(); // Function Engine.SkeletalMeshComponent.*0419cb3ccb // Final|Native|Public|BlueprintCallable // @ game+0x68c8f54
	struct UAnimationAsset* SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x4a9938
	float *b948b16a82(); // Function Engine.SkeletalMeshComponent.*b948b16a82 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68cca18
	bool SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x68f9d14
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68da594
	float *1ad9295ccf(); // Function Engine.SkeletalMeshComponent.*1ad9295ccf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68cbe24
	bool *50e0bcf134(); // Function Engine.SkeletalMeshComponent.*50e0bcf134 // Final|Native|Public|BlueprintCallable // @ game+0x690740c
	void *003dacf78a(); // Function Engine.SkeletalMeshComponent.*003dacf78a // Final|Native|Public|BlueprintCallable // @ game+0x68bfe4c
	void *c9ffb0a8f1(); // Function Engine.SkeletalMeshComponent.*c9ffb0a8f1 // Final|Native|Public|BlueprintCallable // @ game+0x69060b8
	void *3dac8111a3(); // Function Engine.SkeletalMeshComponent.*3dac8111a3 // Final|Native|Public|BlueprintCallable // @ game+0x68ca30c
	struct FVector *c1dca80d01(); // Function Engine.SkeletalMeshComponent.*c1dca80d01 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68d4248
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d1f6c
	void *aaaa810782(); // Function Engine.SkeletalMeshComponent.*aaaa810782 // Final|Native|Public|BlueprintCallable // @ game+0x68ed4bc
	struct UAnimInstance* *c11c201962(); // Function Engine.SkeletalMeshComponent.*c11c201962 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcf2b14
	void *b8e56f4e02(); // Function Engine.SkeletalMeshComponent.*b8e56f4e02 // Final|Native|Public|BlueprintCallable // @ game+0x68ed144
	float *f4e23cce99(); // Function Engine.SkeletalMeshComponent.*f4e23cce99 // Final|Native|Public|BlueprintCallable // @ game+0x68f972c
	struct FPoseSnapshot *8681bde224(); // Function Engine.SkeletalMeshComponent.*8681bde224 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6900808
	bool *f469fdb44b(); // Function Engine.SkeletalMeshComponent.*f469fdb44b // Final|Native|Public|BlueprintCallable // @ game+0x68f4788
	enum class EAnimationMode *8cafec350a(); // Function Engine.SkeletalMeshComponent.*8cafec350a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68cb4f8
	enum class EAnimationMode *df14d2ab1e(); // Function Engine.SkeletalMeshComponent.*df14d2ab1e // Final|Native|Public|BlueprintCallable // @ game+0x4a9a2c
	float *7be67dd09b(); // Function Engine.SkeletalMeshComponent.*7be67dd09b // Final|Native|Public|BlueprintCallable // @ game+0x68e786c
	bool *205990b035(); // Function Engine.SkeletalMeshComponent.*205990b035 // Final|Native|Public|BlueprintCallable // @ game+0x68eed88
	bool *61816ece05(); // Function Engine.SkeletalMeshComponent.*61816ece05 // Final|Native|Public|BlueprintCallable // @ game+0x68eef08
	bool *ab93cff151(); // Function Engine.SkeletalMeshComponent.*ab93cff151 // Final|Native|Public|BlueprintCallable // @ game+0x68eecf4
	bool *fe54059013(); // Function Engine.SkeletalMeshComponent.*fe54059013 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68db168
	bool *37cb4dcade(); // Function Engine.SkeletalMeshComponent.*37cb4dcade // Final|Native|Public|BlueprintCallable // @ game+0x68f2c28
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x4a99ac
	float *b5ab3112e7(); // Function Engine.SkeletalMeshComponent.*b5ab3112e7 // Final|Native|Public|BlueprintCallable // @ game+0x68f27c8
	bool *e2357a32d5(); // Function Engine.SkeletalMeshComponent.*e2357a32d5 // Final|Native|Public|BlueprintCallable // @ game+0x68f2d58
	struct UAnimInstance* *85a1ba9962(); // Function Engine.SkeletalMeshComponent.*85a1ba9962 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d2808
	struct FName *2e33e16a05(); // Function Engine.SkeletalMeshComponent.*2e33e16a05 // Final|Native|Public|BlueprintCallable // @ game+0x68f43d8
	bool *df6d5c3668(); // Function Engine.SkeletalMeshComponent.*df6d5c3668 // Final|Native|Public|BlueprintCallable // @ game+0x68f44c4
	bool *b0b3ecdf76(); // Function Engine.SkeletalMeshComponent.*b0b3ecdf76 // Final|Native|Public|BlueprintCallable // @ game+0x68d9eac
	void *cb275501dc(); // Function Engine.SkeletalMeshComponent.*cb275501dc // Final|Native|Public|BlueprintCallable // @ game+0x68ed1e8
	bool *06a4843213(); // Function Engine.SkeletalMeshComponent.*06a4843213 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68b2dc4
	bool *958b26bc5a(); // Function Engine.SkeletalMeshComponent.*958b26bc5a // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x9afb58
	void *216855f3f1(); // Function Engine.SkeletalMeshComponent.*216855f3f1 // Final|Native|Public|BlueprintCallable // @ game+0x68b7a60
	bool PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x68e83ac
	float *b7e5815bfd(); // Function Engine.SkeletalMeshComponent.*b7e5815bfd // Final|Native|Public|BlueprintCallable // @ game+0x68ef4c8
	bool *590bc738cc(); // Function Engine.SkeletalMeshComponent.*590bc738cc // Native|Public|BlueprintCallable // @ game+0x68f8e6c
	struct FName *cb270d2b61(); // Function Engine.SkeletalMeshComponent.*cb270d2b61 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68bba30
	void *ccd384fcae(); // Function Engine.SkeletalMeshComponent.*ccd384fcae // Final|Native|Public|BlueprintCallable // @ game+0x68ca324
	bool *9b6a2e03c1(); // Function Engine.SkeletalMeshComponent.*9b6a2e03c1 // Final|Native|Public|BlueprintCallable // @ game+0xbee1d8
	float SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0xd52b38
	bool *1e1fba0baa(); // Function Engine.SkeletalMeshComponent.*1e1fba0baa // Final|Native|Public|BlueprintCallable // @ game+0x68da028
	bool *2b1d6ec9be(); // Function Engine.SkeletalMeshComponent.*2b1d6ec9be // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68eeb50
	struct FName *b19e6db2c0(); // Function Engine.SkeletalMeshComponent.*b19e6db2c0 // Native|Public|BlueprintCallable // @ game+0x68f0d0c
	struct UClass* SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x68eff28
	float *8c46bc1c4b(); // Function Engine.SkeletalMeshComponent.*8c46bc1c4b // Final|Native|Public|BlueprintCallable // @ game+0x68cc5a0
	bool *45cb1ffac9(); // Function Engine.SkeletalMeshComponent.*45cb1ffac9 // Final|Native|Public|BlueprintCallable // @ game+0x5ae8688
	bool *dbb8691526(); // Function Engine.SkeletalMeshComponent.*dbb8691526 // Final|Native|Public|BlueprintCallable // @ game+0x68ef04c
	bool *1bc40094b4(); // Function Engine.SkeletalMeshComponent.*1bc40094b4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d8770
	float *a73016fcab(); // Function Engine.SkeletalMeshComponent.*a73016fcab // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d1370
	bool *b38c1f41c3(); // Function Engine.SkeletalMeshComponent.*b38c1f41c3 // Final|Native|Public|BlueprintCallable // @ game+0x68f89e4
	bool Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0x4a98c4
	bool *a9d045c57e(); // Function Engine.SkeletalMeshComponent.*a9d045c57e // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68b2494
	bool *ea3ca52eca(); // Function Engine.SkeletalMeshComponent.*ea3ca52eca // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68b2c30
};

// Class Engine.LightComponentBase
// Size: 0x4a0 (Inherited: 0x470)
struct ULightComponentBase : USceneComponent {
	struct FGuid *a686b10c5d; // 0x468(0x10)
	float Brightness; // 0x478(0x04)
	float Intensity; // 0x47c(0x04)
	struct FColor LightColor; // 0x480(0x04)
	char bAffectsWorld : 1; // 0x484(0x01)
	char CastShadows : 1; // 0x484(0x01)
	char CastStaticShadows : 1; // 0x484(0x01)
	char CastDynamicShadows : 1; // 0x484(0x01)
	char bAffectTranslucentLighting : 1; // 0x484(0x01)
	char bCastVolumetricShadow : 1; // 0x484(0x01)
	float IndirectLightingIntensity; // 0x488(0x04)
	float VolumetricScatteringIntensity; // 0x48c(0x04)
	bool *8f19adf142; // 0x490(0x01)
	char pad_495_6 : 2; // 0x495(0x01)
	char pad_496[0xa]; // 0x496(0x0a)

	void *be965cf688(); // Function Engine.LightComponentBase.*be965cf688 // Final|Native|Public|BlueprintCallable // @ game+0x68f22f4
	void *fde7343060(); // Function Engine.LightComponentBase.*fde7343060 // Final|Native|Public|BlueprintCallable // @ game+0x68f2260
	void *5cae41be78(); // Function Engine.LightComponentBase.*5cae41be78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68d08c8
};

// Class Engine.LightComponent
// Size: 0x590 (Inherited: 0x4a0)
struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x498(0x04)
	float MaxDrawDistance; // 0x49c(0x04)
	float *787d5d6e14; // 0x4a0(0x04)
	char bUseTemperature : 1; // 0x4a4(0x01)
	int32 ShadowMapChannel; // 0x4a8(0x04)
	float MinRoughness; // 0x4b0(0x04)
	float ShadowResolutionScale; // 0x4b4(0x04)
	float ShadowBias; // 0x4b8(0x04)
	float ShadowSharpen; // 0x4bc(0x04)
	float ContactShadowLength; // 0x4c0(0x04)
	char InverseSquaredFalloff : 1; // 0x4c4(0x01)
	char CastTranslucentShadows : 1; // 0x4c4(0x01)
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x4c4(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x4c4(0x01)
	char pad_4C4_5 : 3; // 0x4c4(0x01)
	char pad_4C5[0x3]; // 0x4c5(0x03)
	struct FLightingChannels LightingChannels; // 0x4c8(0x03)
	char pad_4CB[0x5]; // 0x4cb(0x05)
	struct UMaterialInterface* LightFunctionMaterial; // 0x4d0(0x08)
	struct FVector LightFunctionScale; // 0x4d8(0x0c)
	char pad_4E4[0x4]; // 0x4e4(0x04)
	struct U*cf31a3bb9b* IESTexture; // 0x4e8(0x08)
	char bUseIESBrightness : 1; // 0x4f0(0x01)
	char pad_4F0_1 : 7; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	float IESBrightnessScale; // 0x4f4(0x04)
	float LightFunctionFadeDistance; // 0x4f8(0x04)
	float DisabledBrightness; // 0x4fc(0x04)
	char bEnableLightShaftBloom : 1; // 0x500(0x01)
	char pad_500_1 : 7; // 0x500(0x01)
	char pad_501[0x3]; // 0x501(0x03)
	float BloomScale; // 0x504(0x04)
	float BloomThreshold; // 0x508(0x04)
	struct FColor BloomTint; // 0x50c(0x04)
	bool bUseRayTracedDistanceFieldShadows; // 0x510(0x01)
	char pad_511[0x3]; // 0x511(0x03)
	float RayStartOffsetDepthScale; // 0x514(0x04)
	char pad_518[0x78]; // 0x518(0x78)

	void *5ca15ddb64(); // Function Engine.LightComponent.*5ca15ddb64 // Final|Native|Public|BlueprintCallable // @ game+0x68f7448
	void SetIntensity(); // Function Engine.LightComponent.SetIntensity // Final|Native|Public|BlueprintCallable // @ game+0x68f6ca4
	void *63cb3ee82f(); // Function Engine.LightComponent.*63cb3ee82f // Final|Native|Public|BlueprintCallable // @ game+0x68f74e0
	void *96c92cd704(); // Function Engine.LightComponent.*96c92cd704 // Final|Native|Public|BlueprintCallable // @ game+0x68f63a4
	void *6e138f82c4(); // Function Engine.LightComponent.*6e138f82c4 // Final|Native|Public|BlueprintCallable // @ game+0x68f0b34
	void *18a784e23c(); // Function Engine.LightComponent.*18a784e23c // Final|Native|Public|BlueprintCallable // @ game+0x68f0bcc
	void *46e3ca3f4d(); // Function Engine.LightComponent.*46e3ca3f4d // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68f7570
	void *258006e252(); // Function Engine.LightComponent.*258006e252 // Final|Native|Public|BlueprintCallable // @ game+0x68f45f8
	void *bce07c35db(); // Function Engine.LightComponent.*bce07c35db // Final|Native|Public|BlueprintCallable // @ game+0x68fe3a8
	void *f46513e72c(); // Function Engine.LightComponent.*f46513e72c // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68f0c64
	void *32714f25cf(); // Function Engine.LightComponent.*32714f25cf // Final|Native|Public|BlueprintCallable // @ game+0x68eeabc
	void *219ca27b92(); // Function Engine.LightComponent.*219ca27b92 // Final|Native|Public|BlueprintCallable // @ game+0x68fcc24
	void *cbc79675bf(); // Function Engine.LightComponent.*cbc79675bf // Final|Native|Public|BlueprintCallable // @ game+0x68ee9ec
	void *a5a07d6e2d(); // Function Engine.LightComponent.*a5a07d6e2d // Final|Native|Public|BlueprintCallable // @ game+0x68f64f0
	void *c0e895a11e(); // Function Engine.LightComponent.*c0e895a11e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68f715c
	void *bfb5d300ac(); // Function Engine.LightComponent.*bfb5d300ac // Final|Native|Public|BlueprintCallable // @ game+0x68f73b0
};

// Class Engine.PointLightComponent
// Size: 0x5b0 (Inherited: 0x590)
struct UPointLightComponent : ULightComponent {
	float Radius; // 0x588(0x04)
	float AttenuationRadius; // 0x58c(0x04)
	char bUseInverseSquaredFalloff : 1; // 0x590(0x01)
	float LightFalloffExponent; // 0x594(0x04)
	float SourceRadius; // 0x598(0x04)
	float SourceLength; // 0x59c(0x04)
	struct F*d176fa0a45 LightmassSettings; // 0x5a0(0x0c)

	void *80f81e4215(float bNewValue); // Function Engine.PointLightComponent.*80f81e4215 // Final|Native|Public|BlueprintCallable // @ game+0x68fb0f4
	void *5a24c02c9d(float NewValue); // Function Engine.PointLightComponent.*5a24c02c9d // Final|Native|Public|BlueprintCallable // @ game+0x68fb05c
	void *485d6ff949(float NewLightFalloffExponent); // Function Engine.PointLightComponent.*485d6ff949 // Final|Native|Public|BlueprintCallable // @ game+0x68f7318
	void SetAttenuationRadius(float NewRadius); // Function Engine.PointLightComponent.SetAttenuationRadius // Final|Native|Public|BlueprintCallable // @ game+0x68f07e8
};

// Class Engine.SpotLightComponent
// Size: 0x5c0 (Inherited: 0x5b0)
struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x5b0(0x04)
	float OuterConeAngle; // 0x5b4(0x04)
	float *5fa0a48a2c; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)

	void *af3a4a82b2(float NewOuterConeAngle); // Function Engine.SpotLightComponent.*af3a4a82b2 // Final|Native|Public|BlueprintCallable // @ game+0x68f951c
	void *6410d64b8b(float NewInnerConeAngle); // Function Engine.SpotLightComponent.*6410d64b8b // Final|Native|Public|BlueprintCallable // @ game+0x68f6620
};

// Class Engine.*fc2452f674
// Size: 0x38 (Inherited: 0x30)
struct U*fc2452f674 : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.*ee34789f9a
// Size: 0x38 (Inherited: 0x38)
struct U*ee34789f9a : U*fc2452f674 {
};

// Class Engine.*803292ecaa
// Size: 0x30 (Inherited: 0x30)
struct U*803292ecaa : UObject {
};

// Class Engine.*0ad023d030
// Size: 0x48 (Inherited: 0x30)
struct U*0ad023d030 : UObject {
	char bCausedByWorld : 1; // 0x30(0x01)
	char bScaleMomentumByMass : 1; // 0x30(0x01)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char pad_30_3 : 5; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DamageImpulse; // 0x34(0x04)
	float DestructibleImpulse; // 0x38(0x04)
	float DestructibleDamageSpreadScale; // 0x3c(0x04)
	float DamageFalloff; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.MovementComponent
// Size: 0x250 (Inherited: 0x200)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x200(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x208(0x08)
	char pad_210[0x4]; // 0x210(0x04)
	struct FVector Velocity; // 0x214(0x0c)
	char bConstrainToPlane : 1; // 0x220(0x01)
	char bSnapToPlaneAtStart : 1; // 0x220(0x01)
	char pad_220_2 : 6; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	enum class EPlaneConstraintAxisSetting *d76c010af6; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	struct FVector PlaneConstraintNormal; // 0x228(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x234(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x240(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x240(0x01)
	char bTickBeforeOwner : 1; // 0x240(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x240(0x01)
	char pad_240_4 : 4; // 0x240(0x01)
	char pad_241[0xf]; // 0x241(0x0f)

	void *c2ac81da0f(); // Function Engine.MovementComponent.*c2ac81da0f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896ce8
	void *b83a90d09d(); // Function Engine.MovementComponent.*b83a90d09d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899d7c
	void *3d7e8f3f5f(); // Function Engine.MovementComponent.*3d7e8f3f5f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b5e8
	void *0f8844a2ec(); // Function Engine.MovementComponent.*0f8844a2ec // Native|Public|BlueprintCallable // @ game+0x68ad41c
	void *db92e1435e(); // Function Engine.MovementComponent.*db92e1435e // Native|Public|BlueprintCallable // @ game+0x68add84
	void *55451031c8(); // Function Engine.MovementComponent.*55451031c8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898cd4
	void *852b92179c(); // Function Engine.MovementComponent.*852b92179c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68ab598
	void *164ca92a58(); // Function Engine.MovementComponent.*164ca92a58 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68ab48c
	void *87d489219e(); // Function Engine.MovementComponent.*87d489219e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6899dbc
	void *3d190c2b6f(); // Function Engine.MovementComponent.*3d190c2b6f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68ab63c
	void K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ec8c
	void *1d3512d465(); // Function Engine.MovementComponent.*1d3512d465 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68914c8
	void *9c2738870a(); // Function Engine.MovementComponent.*9c2738870a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f39c
	void *d4fa247c58(struct FVector ReturnValue); // Function Engine.MovementComponent.*d4fa247c58 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6899d94
	void *1f50dc4b23(struct APhysicsVolume* ReturnValue); // Function Engine.MovementComponent.*1f50dc4b23 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899d30
	void K2_GetModifiedMaxSpeed(float ReturnValue); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ece4
	void *2b7152691b(struct FVector Direction, struct FVector ReturnValue); // Function Engine.MovementComponent.*2b7152691b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6891338
	void ConstrainLocationToPlane(struct FVector Location, struct FVector ReturnValue); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6891400
	void PhysicsVolumeChanged(struct APhysicsVolume* Param0); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0xc788fc
	void *12a8e3120c(enum class EPlaneConstraintAxisSetting NewAxisSetting); // Function Engine.MovementComponent.*12a8e3120c // Native|Public|BlueprintCallable // @ game+0x68ab360
	void *581d945228(struct USceneComponent* NewUpdatedComponent); // Function Engine.MovementComponent.*581d945228 // Native|Public|BlueprintCallable // @ game+0x68ac6b8
	void *0b63448c67(bool bEnabled); // Function Engine.MovementComponent.*0b63448c67 // Native|Public|BlueprintCallable // @ game+0x68ab3f4
};

// Class Engine.NavMovementComponent
// Size: 0x280 (Inherited: 0x250)
struct UNavMovementComponent : UMovementComponent {
	struct F*ae60ea2542 NavAgentProps; // 0x248(0x20)
	float *2e58ec43d4; // 0x268(0x04)
	char *83fb68c948 : 1; // 0x26c(0x01)
	char bUseAccelerationForPaths : 1; // 0x26c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x26c(0x01)
	struct F*060c159331 *a415b23328; // 0x270(0x04)
	char pad_278_3 : 5; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)

	void *927cff7993(); // Function Engine.NavMovementComponent.*927cff7993 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b9dc
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x68ad738
	void *07aed04f02(); // Function Engine.NavMovementComponent.*07aed04f02 // Final|Native|Public|BlueprintCallable // @ game+0x68add9c
	void *63df202894(); // Function Engine.NavMovementComponent.*63df202894 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b590
	void IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b694
	void *538e672bae(); // Function Engine.NavMovementComponent.*538e672bae // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b6bc
	void *b7c59c950e(); // Function Engine.NavMovementComponent.*b7c59c950e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689bdb0
};

// Class Engine.PawnMovementComponent
// Size: 0x290 (Inherited: 0x280)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *99875154bc; // 0x280(0x08)
	char pad_288[0x8]; // 0x288(0x08)

	void *ec5c491810(bool ReturnValue); // Function Engine.PawnMovementComponent.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b9b4
	void *74bbcbd06c(struct FVector WorldVector, bool bForce); // Function Engine.PawnMovementComponent.*74bbcbd06c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688d144
	void *8efd791461(struct FVector ReturnValue); // Function Engine.PawnMovementComponent.*8efd791461 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6899acc
	void *6f20605fa3(struct FVector ReturnValue); // Function Engine.PawnMovementComponent.*6f20605fa3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6898648
	void *e1674e808d(struct FVector ReturnValue); // Function Engine.PawnMovementComponent.*e1674e808d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6891590
	void K2_GetInputVector(struct FVector ReturnValue); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ec58
	void *2d3b0c617b(struct APawn* ReturnValue); // Function Engine.PawnMovementComponent.*2d3b0c617b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899ab4
};

// Class Engine.CharacterMovementComponent
// Size: 0x930 (Inherited: 0x290)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_290[0x8]; // 0x290(0x08)
	struct ACharacter* *479080a547; // 0x298(0x08)
	char bApplyGravityWhileJumping : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float GravityScale; // 0x2a4(0x04)
	float MaxStepHeight; // 0x2a8(0x04)
	float JumpZVelocity; // 0x2ac(0x04)
	float JumpOffJumpZFactor; // 0x2b0(0x04)
	float *83e8ebe44b; // 0x2b4(0x04)
	float *722c71f33c; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	float *82b606161e; // 0x2c0(0x04)
	float *fdb6771fd8; // 0x2c4(0x04)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	enum class EMovementMode MovementMode; // 0x2d0(0x01)
	bool CustomMovementMode; // 0x2d1(0x01)
	char pad_2D2[0x1e]; // 0x2d2(0x1e)
	float GroundFriction; // 0x2f0(0x04)
	float MaxWalkSpeed; // 0x2f4(0x04)
	float MaxWalkSpeedCrouched; // 0x2f8(0x04)
	float MaxSwimSpeed; // 0x2fc(0x04)
	float MaxFlySpeed; // 0x300(0x04)
	float MaxCustomMovementSpeed; // 0x304(0x04)
	float MaxAcceleration; // 0x308(0x04)
	float BrakingFrictionFactor; // 0x30c(0x04)
	float BrakingFriction; // 0x310(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x314(0x01)
	char pad_314_1 : 7; // 0x314(0x01)
	char pad_315[0x3]; // 0x315(0x03)
	float BrakingDecelerationWalking; // 0x318(0x04)
	float BrakingDecelerationFalling; // 0x31c(0x04)
	float BrakingDecelerationSwimming; // 0x320(0x04)
	float BrakingDecelerationFlying; // 0x324(0x04)
	float AirControl; // 0x328(0x04)
	float AirControlBoostMultiplier; // 0x32c(0x04)
	float AirControlBoostVelocityThreshold; // 0x330(0x04)
	float FallingLateralFriction; // 0x334(0x04)
	float CrouchedHalfHeight; // 0x338(0x04)
	float PronedHalfHeight; // 0x33c(0x04)
	float PronedRadius; // 0x340(0x04)
	float Buoyancy; // 0x344(0x04)
	float PerchRadiusThreshold; // 0x348(0x04)
	float PerchAdditionalHeight; // 0x34c(0x04)
	struct FRotator RotationRate; // 0x350(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x35c(0x01)
	char bOrientRotationToMovement : 1; // 0x35c(0x01)
	char bSweepWhileNavWalking : 1; // 0x35c(0x01)
	char pad_35C_3 : 2; // 0x35c(0x01)
	char *26cb6c84f1 : 1; // 0x35c(0x01)
	char *507ceb7bfc : 1; // 0x35c(0x01)
	char bForceMaxAccel : 1; // 0x35c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x35d(0x01)
	char bForceNextFloorCheck : 1; // 0x35d(0x01)
	char *19469483f8 : 1; // 0x35d(0x01)
	char bCanWalkOffLedges : 1; // 0x35d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x35d(0x01)
	char pad_35D_5 : 2; // 0x35d(0x01)
	char *11b8c860ec : 1; // 0x35d(0x01)
	char *7f0c890fda : 1; // 0x35e(0x01)
	char pad_35E_1 : 7; // 0x35e(0x01)
	char pad_35F[0x1]; // 0x35f(0x01)
	struct USceneComponent* *6d8897b5ca; // 0x360(0x08)
	float MaxOutOfWaterStepHeight; // 0x368(0x04)
	float OutofWaterZ; // 0x36c(0x04)
	float Mass; // 0x370(0x04)
	bool bEnablePhysicsInteraction; // 0x374(0x01)
	bool bTouchForceScaledToMass; // 0x375(0x01)
	bool bPushForceScaledToMass; // 0x376(0x01)
	bool bPushForceUsingZOffset; // 0x377(0x01)
	bool bScalePushForceToVelocity; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	float StandingDownwardForceScale; // 0x37c(0x04)
	float InitialPushForceFactor; // 0x380(0x04)
	float PushForceFactor; // 0x384(0x04)
	float PushForcePointZOffsetFactor; // 0x388(0x04)
	float TouchForceFactor; // 0x38c(0x04)
	float MinTouchForce; // 0x390(0x04)
	float MaxTouchForce; // 0x394(0x04)
	float RepulsionForce; // 0x398(0x04)
	char bForceBraking : 1; // 0x39c(0x01)
	char pad_39C_1 : 7; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	float CrouchedSpeedMultiplier; // 0x3a0(0x04)
	float UpperImpactNormalScale; // 0x3a4(0x04)
	struct FVector Acceleration; // 0x3a8(0x0c)
	struct FVector *eabc6b4d63; // 0x3b4(0x0c)
	struct FQuat *e96b7385d6; // 0x3c0(0x10)
	struct FVector *fed5f456bc; // 0x3d0(0x0c)
	float *8259a7a9d5; // 0x3dc(0x04)
	float *02e850e002; // 0x3e0(0x04)
	float *b407c9150e; // 0x3e4(0x04)
	struct FVector *3d04d1faed; // 0x3e8(0x0c)
	struct FVector *39b9fae469; // 0x3f4(0x0c)
	float *b94abc4f0d; // 0x400(0x04)
	char pad_404[0x8]; // 0x404(0x08)
	float MaxSimulationTimeStep; // 0x40c(0x04)
	int32 MaxSimulationIterations; // 0x410(0x04)
	float MaxDepenetrationWithGeometry; // 0x414(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x418(0x04)
	float MaxDepenetrationWithPawn; // 0x41c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x420(0x04)
	float *1d1c9d5d1a; // 0x424(0x04)
	float *4157bdca5f; // 0x428(0x04)
	float *ba1516f1be; // 0x42c(0x04)
	float *9f28b14cad; // 0x430(0x04)
	float *66dc603436; // 0x434(0x04)
	float *07991836b8; // 0x438(0x04)
	float *64d8e8110c; // 0x43c(0x04)
	float *5ef0e2e35c; // 0x440(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float *92e20fcab4; // 0x448(0x04)
	float *4fab791991; // 0x44c(0x04)
	float *86042875b9; // 0x450(0x04)
	float *188976dd19; // 0x454(0x04)
	float LedgeCheckThreshold; // 0x458(0x04)
	float JumpOutOfWaterPitch; // 0x45c(0x04)
	struct F*29683cadec CurrentFloor; // 0x460(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4f8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4f9(0x01)
	enum class EMovementMode *faf788f025; // 0x4fa(0x01)
	char pad_4FB[0x1]; // 0x4fb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityX : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityY : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4fc(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4fc(0x01)
	char bJustTeleported : 1; // 0x4fc(0x01)
	char *70c3d30791 : 1; // 0x4fc(0x01)
	char *acfd118ae1 : 1; // 0x4fc(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4fd(0x01)
	char bNotifyApex : 1; // 0x4fd(0x01)
	char *4321e5bacf : 1; // 0x4fd(0x01)
	char bWantsToCrouch : 1; // 0x4fd(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4fd(0x01)
	char pad_4FD_5 : 3; // 0x4fd(0x01)
	char pad_4FE[0x2]; // 0x4fe(0x02)
	enum class EStanceMode StanceMode; // 0x500(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x501(0x01)
	char pad_502[0x2]; // 0x502(0x02)
	char bIgnoreBaseRotation : 1; // 0x504(0x01)
	char *8670edea6f : 1; // 0x504(0x01)
	char bAlwaysCheckFloor : 1; // 0x504(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x504(0x01)
	char *e403872825 : 1; // 0x504(0x01)
	char *b1ee1c3f93 : 1; // 0x504(0x01)
	char bUseRVOAvoidance : 1; // 0x504(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x504(0x01)
	char pad_505[0xf]; // 0x505(0x0f)
	char *fe38a4d374 : 1; // 0x514(0x01)
	char *b6480ff259 : 1; // 0x514(0x01)
	char *4683070ca7 : 1; // 0x514(0x01)
	char pad_514_3 : 2; // 0x514(0x01)
	char bProjectNavMeshWalking : 1; // 0x514(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x514(0x01)
	char pad_514_7 : 1; // 0x514(0x01)
	char pad_515[0x13]; // 0x515(0x13)
	float AvoidanceConsiderationRadius; // 0x528(0x04)
	struct FVector *3430170cc5; // 0x52c(0x0c)
	int32 AvoidanceUID; // 0x538(0x04)
	struct F*c4bee3ea12 AvoidanceGroup; // 0x53c(0x04)
	struct F*c4bee3ea12 GroupsToAvoid; // 0x540(0x04)
	struct F*c4bee3ea12 GroupsToIgnore; // 0x544(0x04)
	float AvoidanceWeight; // 0x548(0x04)
	struct FVector *914bfba552; // 0x54c(0x0c)
	char pad_558[0xa8]; // 0x558(0xa8)
	float NavMeshProjectionInterval; // 0x600(0x04)
	float *8118c9d009; // 0x604(0x04)
	float NavMeshProjectionInterpSpeed; // 0x608(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x60c(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x610(0x04)
	float NavWalkingFloorDistTolerance; // 0x614(0x04)
	char pad_618[0xb0]; // 0x618(0xb0)
	struct F*4bffd29219 *a41d0f03b5; // 0x6c8(0x58)
	char pad_720[0x10]; // 0x720(0x10)
	float *035b3a9f9f; // 0x730(0x04)
	char pad_734[0x4]; // 0x734(0x04)
	struct FRootMotionSourceGroup *c7539c9e11; // 0x738(0x100)
	char pad_838[0x98]; // 0x838(0x98)
	struct F*515b98ffe7 *bd0a57294d; // 0x8d0(0x40)
	struct FVector *4c2486a6db; // 0x910(0x0c)
	bool *5fec1080f0; // 0x91c(0x01)
	char pad_91D[0x3]; // 0x91d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x920(0x01)
	char pad_920_1 : 7; // 0x920(0x01)
	char pad_921[0xf]; // 0x921(0x0f)

	float *9d924ae134(); // Function Engine.CharacterMovementComponent.*9d924ae134 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898ca8
	struct ACharacter* *44975c26ea(); // Function Engine.CharacterMovementComponent.*44975c26ea // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6895c84
	struct FVector *b93a5543f3(); // Function Engine.CharacterMovementComponent.*b93a5543f3 // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x68acfc0
	int32 *4ed3e42e4c(); // Function Engine.CharacterMovementComponent.*4ed3e42e4c // Final|Native|Public|BlueprintCallable // @ game+0x68a9844
	float *db0f1d6afd(); // Function Engine.CharacterMovementComponent.*db0f1d6afd // Final|Native|Public|BlueprintCallable // @ game+0x68acd1c
	struct FVector *ca70c823be(); // Function Engine.CharacterMovementComponent.*ca70c823be // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689690c
	bool AddImpulse(); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688cdb8
	struct F*29683cadec *f667569445(); // Function Engine.CharacterMovementComponent.*f667569445 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689e75c
	int32 *e102887b62(); // Function Engine.CharacterMovementComponent.*e102887b62 // Final|Native|Public|BlueprintCallable // @ game+0x68a971c
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x6892244
	void *e27d511e10(); // Function Engine.CharacterMovementComponent.*e27d511e10 // Native|Public|BlueprintCallable // @ game+0x688ea9c
	struct F*c4bee3ea12 *97cd786904(); // Function Engine.CharacterMovementComponent.*97cd786904 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68a731c
	struct FVector *f54e2f4333(); // Function Engine.CharacterMovementComponent.*f54e2f4333 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6897854
	float *8ac3f8d562(); // Function Engine.CharacterMovementComponent.*8ac3f8d562 // Native|Public|BlueprintCallable // @ game+0x688e250
	float *c2656bf395(); // Function Engine.CharacterMovementComponent.*c2656bf395 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898c50
	struct F*c4bee3ea12 *0c71812783(); // Function Engine.CharacterMovementComponent.*0c71812783 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68a97a8
	float *4db894fcba(); // Function Engine.CharacterMovementComponent.*4db894fcba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689aa60
	float *f3efc6a197(); // Function Engine.CharacterMovementComponent.*f3efc6a197 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b5d7b0
	int32 *865b67218d(); // Function Engine.CharacterMovementComponent.*865b67218d // Final|Native|Public|BlueprintCallable // @ game+0x68a7290
	float *e383b11c62(); // Function Engine.CharacterMovementComponent.*e383b11c62 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ef88
	struct F*29683cadec *55d6bf611b(); // Function Engine.CharacterMovementComponent.*55d6bf611b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689e2b8
	bool *44e088037d(); // Function Engine.CharacterMovementComponent.*44e088037d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b9dc
	struct UPrimitiveComponent* *52d57aeb3a(); // Function Engine.CharacterMovementComponent.*52d57aeb3a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898e08
	float *cbcc333929(); // Function Engine.CharacterMovementComponent.*cbcc333929 // Final|Native|Public|BlueprintCallable // @ game+0x68ab85c
	bool *5eaed47ac8(); // Function Engine.CharacterMovementComponent.*5eaed47ac8 // Final|Native|Public|BlueprintCallable // @ game+0x68a71fc
	float *e2444abdb4(); // Function Engine.CharacterMovementComponent.*e2444abdb4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898c24
	float *7e042cca5d(); // Function Engine.CharacterMovementComponent.*7e042cca5d // Final|Native|Public|BlueprintCallable // @ game+0x68acdb4
	bool *e948ff09df(); // Function Engine.CharacterMovementComponent.*e948ff09df // Native|Public|BlueprintCallable // @ game+0x68aacb4
	float *a0ef2db392(); // Function Engine.CharacterMovementComponent.*a0ef2db392 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894f3c
	struct FHitResult CapsuleTouched(); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x688e654
	struct FVector AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688c774
	struct F*c4bee3ea12 *0fddc8929b(); // Function Engine.CharacterMovementComponent.*0fddc8929b // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68a98d0
	float *98562927be(); // Function Engine.CharacterMovementComponent.*98562927be // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898c7c
	float *1471005205(); // Function Engine.CharacterMovementComponent.*1471005205 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899b24
	float *f6cb9100e3(); // Function Engine.CharacterMovementComponent.*f6cb9100e3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ecb8
	bool *8faddce97d(); // Function Engine.CharacterMovementComponent.*8faddce97d // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x689be00
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintFunctionLibrary : UObject {
};

// Class Engine.StaticMeshActor
// Size: 0x400 (Inherited: 0x3f0)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3f0(0x08)
	bool bStaticMeshReplicateMovement; // 0x3f8(0x01)
	enum class ENavDataGatheringMode *44a20f5dab; // 0x3f9(0x01)
	char pad_3FA[0x6]; // 0x3fa(0x06)
};

// Class Engine.HUD
// Size: 0x4d8 (Inherited: 0x3f0)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x3f0(0x08)
	char bLostFocusPaused : 1; // 0x3f8(0x01)
	char bShowHUD : 1; // 0x3f8(0x01)
	char bShowDebugInfo : 1; // 0x3f8(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x3f8(0x01)
	char bShowOverlays : 1; // 0x3f8(0x01)
	char bEnableDebugTextShadow : 1; // 0x3f8(0x01)
	char pad_3F8_6 : 2; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct TArray<struct AActor*> *38b709293a; // 0x400(0x10)
	char pad_410[0x8]; // 0x410(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x418(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x428(0x10)
	struct UCanvas* Canvas; // 0x438(0x08)
	struct UCanvas* *f5943f676e; // 0x440(0x08)
	struct TArray<struct F*ed6dead525> *f79181af34; // 0x448(0x10)
	struct UClass* *6e615585cd; // 0x458(0x08)
	struct AActor* *fcbd63a8dd; // 0x460(0x08)
	char pad_468[0x70]; // 0x468(0x70)

	struct FVector2D DrawTexture(); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6893414
	struct FName ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct UFont* *62432812ee(float Param10, bool Param11); // Function Engine.HUD.*62432812ee // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x688c300
	void *34fff8859f(struct APawn* ReturnValue); // Function Engine.HUD.*34fff8859f // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x68997b4
	void ReceiveHitBoxClick(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void ShowDebug(struct FName Param0); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x68ad06c
	void *f44a827629(struct UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition); // Function Engine.HUD.*f44a827629 // Final|Native|Public|BlueprintCallable // @ game+0x6893924
	void Deproject(float ScreenX, float ScreenY, struct FVector WorldPosition, struct FVector WorldDirection); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6891bf0
	void ReceiveHitBoxRelease(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *0779b85564(struct FString Text, struct FLinearColor TextColor, float ScreenX, float ScreenY, struct UFont* Font, float Scale, bool bScalePosition); // Function Engine.HUD.*0779b85564 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x689315c
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0x5aa9ca0
	void ReceiveDrawHUD(int32 SizeX, int32 SizeY); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *f76c6f11ba(struct APlayerController* ReturnValue); // Function Engine.HUD.*f76c6f11ba // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5b7eb64
	void AddHitBox(struct FVector2D Position, struct FVector2D Size, struct FName InName, bool bConsumesInput, int32 Priority); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x688cbf0
	void ShowDebugToggleSubCategory(struct FName Param0); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x68ad1c0
	void ShowDebugForReticleTargetToggle(struct UClass* Param0); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x68ad100
	void *c08cd3997f(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition); // Function Engine.HUD.*c08cd3997f // Final|Native|Public|BlueprintCallable // @ game+0x6892998
	void *9b849b7b63(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale); // Function Engine.HUD.*9b849b7b63 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6892530
	void *8452ca1193(); // Function Engine.HUD.*8452ca1193 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6892c10
	void *cfe6b2110e(); // Function Engine.HUD.*cfe6b2110e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6892304
	void *957a89d132(); // Function Engine.HUD.*957a89d132 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x6894afc
	void *c2fb95ac2b(); // Function Engine.HUD.*c2fb95ac2b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6892f80
	void *50b363f367(); // Function Engine.HUD.*50b363f367 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x68a2f7c
	void *6ae72bf9b6(); // Function Engine.HUD.*6ae72bf9b6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x689a518
	void Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68a2b20
	void ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *82ab454e02(); // Function Engine.HUD.*82ab454e02 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x68a2dc8
};

// Class Engine.Brush
// Size: 0x428 (Inherited: 0x3f0)
struct ABrush : AActor {
	enum class *e0edfbd9de *8e17fb69f0; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	struct FColor BrushColor; // 0x3f4(0x04)
	int32 PolyFlags; // 0x3f8(0x04)
	char *7d8414377d : 1; // 0x3fc(0x01)
	char *f77657c03b : 1; // 0x3fc(0x01)
	char *8751e5918e : 1; // 0x3fc(0x01)
	char *ac8f2c7a93 : 1; // 0x3fc(0x01)
	char pad_3FC_4 : 4; // 0x3fc(0x01)
	char pad_3FD[0x3]; // 0x3fd(0x03)
	struct UModel* Brush; // 0x400(0x08)
	struct UBrushComponent* BrushComponent; // 0x408(0x08)
	char *98b8ef6f05 : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct TArray<struct F*26d590dcc1> *1211ef514c; // 0x418(0x10)
};

// Class Engine.Volume
// Size: 0x428 (Inherited: 0x428)
struct AVolume : ABrush {
	enum class *e0edfbd9de *8e17fb69f0; // 0x3f0(0x01)
	struct FColor BrushColor; // 0x3f4(0x04)
	int32 PolyFlags; // 0x3f8(0x04)
	char *7d8414377d : 1; // 0x3fc(0x01)
	char *f77657c03b : 1; // 0x3fc(0x01)
	char *8751e5918e : 1; // 0x3fc(0x01)
	char *ac8f2c7a93 : 1; // 0x3fc(0x01)
	struct UModel* Brush; // 0x400(0x08)
	struct UBrushComponent* BrushComponent; // 0x408(0x08)
	char *98b8ef6f05 : 1; // 0x410(0x01)
	struct TArray<struct F*26d590dcc1> *1211ef514c; // 0x418(0x10)
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotify : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	char pad_60[0x10]; // 0x60(0x10)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.DataTable
// Size: 0x88 (Inherited: 0x30)
struct UDataTable : UObject {
	struct UScriptStruct* *eb864fa0b1; // 0x30(0x08)
	char pad_38[0x50]; // 0x38(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x450)
struct ACharacter : APawn {
	char bPressedJump : 1; // 0x450(0x01)
	char *0a07f40284 : 1; // 0x450(0x01)
	char *883f2946bb : 1; // 0x450(0x01)
	char *1bbc584058 : 1; // 0x450(0x01)
	char *5e33d65440 : 1; // 0x450(0x01)
	char *2551a88bff : 1; // 0x450(0x01)
	char *0da443813f : 1; // 0x450(0x01)
	char *3a904bf932 : 1; // 0x450(0x01)
	char bWasJumping : 1; // 0x451(0x01)
	char pad_451_1 : 7; // 0x451(0x01)
	char pad_452[0x6]; // 0x452(0x06)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x458(0x08)
	struct F*d11a7f4b1f *4233f49e69; // 0x460(0x48)
	struct UCapsuleComponent* CapsuleComponent; // 0x4a8(0x08)
	int32 JumpMaxCount; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct USkeletalMeshComponent* Mesh; // 0x4b8(0x08)
	int32 JumpCurrentCount; // 0x4c0(0x04)
	float JumpMaxHoldTime; // 0x4c4(0x04)
	bool *95854913ff; // 0x4c8(0x01)
	char pad_4C9[0x7]; // 0x4c9(0x07)
	struct F*d11a7f4b1f *e8a3c062a0; // 0x4d0(0x48)
	float JumpKeyHoldTime; // 0x518(0x04)
	char pad_51C[0x4]; // 0x51c(0x04)
	struct FQuat *9c95665d3c; // 0x520(0x10)
	float *3ac7aa90de; // 0x530(0x04)
	char pad_534[0x4]; // 0x534(0x04)
	struct UCharacterMovementComponent* CharacterMovement; // 0x538(0x08)
	float CrouchedEyeHeight; // 0x540(0x04)
	char bIsCrouched : 1; // 0x544(0x01)
	char pad_544_1 : 7; // 0x544(0x01)
	char pad_545[0x3]; // 0x545(0x03)
	bool *33347614fc; // 0x548(0x01)
	char pad_549[0x3]; // 0x549(0x03)
	struct FVector *05ff5e346b; // 0x54c(0x0c)
	float *e4eda111d4; // 0x558(0x04)
	char pad_55C[0x4]; // 0x55c(0x04)
	struct FMulticastDelegate OnReachedJumpApex; // 0x560(0x10)
	char pad_570[0x10]; // 0x570(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x580(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x590(0x10)
	struct FRootMotionSourceGroup *eae265d390; // 0x5a0(0x100)
	struct F*515b98ffe7 *f5b54daaa1; // 0x6a0(0x40)
	struct TArray<struct F*2a96cdbee5> *f84fd203c5; // 0x6e0(0x10)
	struct F*0e21200897 *882a7f71ac; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	void *fb2473c60b(float Param0, struct FRootMotionSourceGroup Param1, bool Param2, float Param3, struct FVector Param4, struct FVector_NetQuantizeNormal Param5, float Param6, struct UPrimitiveComponent* Param7, struct FName Param8, bool Param9, bool Param10, bool Param11); // Function Engine.Character.*fb2473c60b // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x758378
	void *b022a0a31e(float Param0, struct FVector_NetQuantize10 Param1, bool Param2); // Function Engine.Character.*b022a0a31e // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a52cc
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x7593e8
	void *af5e11930f(); // Function Engine.Character.*af5e11930f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x688e144
	void *cc63ed914a(); // Function Engine.Character.*cc63ed914a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a4540
	void OnWalkingOffLedge(); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xd81c1c
	void Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x6891b24
	void *6a0e5b0286(); // Function Engine.Character.*6a0e5b0286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689bc24
	void *7e163b451c(); // Function Engine.Character.*7e163b451c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f044
	void *221e5b49fe(); // Function Engine.Character.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x68abb70
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x689bed8
	void *ab9f13facc(); // Function Engine.Character.*ab9f13facc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894f80
	void *39955aa1ce(); // Function Engine.Character.*39955aa1ce // Native|Public|BlueprintCallable // @ game+0x68a21c8
	void *ca090c119f(); // Function Engine.Character.*ca090c119f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6895148
	void *1ce0ccef36(); // Function Engine.Character.*1ce0ccef36 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a4f88
	void *22fdf8e2aa(); // Function Engine.Character.*22fdf8e2aa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a4ac0
	void CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x688e518
	void *ae290b6270(); // Function Engine.Character.*ae290b6270 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f02c
	float K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *185bf39c1e(); // Function Engine.Character.*185bf39c1e // Native|Public|BlueprintCallable // @ game+0x68ae1f8
	float ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x7e2b0c
	bool *940da471e0(); // Function Engine.Character.*940da471e0 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x688ec80
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x75b180
	float K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a1090
	bool K2_OnMovementModeChanged(); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FVector *2442a24805(); // Function Engine.Character.*2442a24805 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6895190
	void *dd8777b92b(); // Function Engine.Character.*dd8777b92b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x624a54
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b1a22c
	struct UAnimMontage* *3f5ff0d280(); // Function Engine.Character.*3f5ff0d280 // Native|Public|BlueprintCallable // @ game+0x68ada48
	struct UAnimMontage* *109287e492(); // Function Engine.Character.*109287e492 // Final|Native|Public|BlueprintCallable // @ game+0x6896934
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x5b61e10
	bool *74ba8d35b7(); // Function Engine.Character.*74ba8d35b7 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x758e48
	void *f183d7ae68(); // Function Engine.Character.*f183d7ae68 // Native|Public|BlueprintCallable // @ game+0x68add54
	bool ServerMove(); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a3bc4
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x688e53c
	bool *426bbcfd1b(); // Function Engine.Character.*426bbcfd1b // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x7599bc
	struct FHitResult OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x20a5d0
	bool *1add8d4ff4(); // Function Engine.Character.*1add8d4ff4 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a3fc0
	bool OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	float K2_OnStartCrouch(); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *7f16fa6b8f(); // Function Engine.Character.*7f16fa6b8f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689bc00
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x5af3d88
};

// Class Engine.Controller
// Size: 0x470 (Inherited: 0x3f0)
struct AController : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct APlayerState* PlayerState; // 0x3f8(0x08)
	struct USceneComponent* TransformComponent; // 0x400(0x08)
	struct APawn* Pawn; // 0x408(0x08)
	char pad_410[0x18]; // 0x410(0x18)
	struct ACharacter* Character; // 0x428(0x08)
	struct FName StateName; // 0x430(0x08)
	char pad_438[0x18]; // 0x438(0x18)
	char *ac76c176b5 : 1; // 0x450(0x01)
	char *8f126e4c4b : 1; // 0x450(0x01)
	char pad_450_2 : 6; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	struct FRotator *67a18bfbf4; // 0x454(0x0c)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x460(0x10)

	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x622188
	void *cfc621cd2f(); // Function Engine.Controller.*cfc621cd2f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689bbe4
	void *78d24b5032(); // Function Engine.Controller.*78d24b5032 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0xd7e7a4
	void *4a6a8f3046(); // Function Engine.Controller.*4a6a8f3046 // Native|Public|BlueprintCallable // @ game+0x68a9c28
	void K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ed10
	void *ea60ba9b64(); // Function Engine.Controller.*ea60ba9b64 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a8bb8
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x68add6c
	void *7e3667efd8(bool ReturnValue); // Function Engine.Controller.*7e3667efd8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b86c
	void *8e4ab02dd2(bool ReturnValue); // Function Engine.Controller.*8e4ab02dd2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b800
	void *ec5c491810(bool ReturnValue); // Function Engine.Controller.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b964
	void *21b6505060(); // Function Engine.Controller.*21b6505060 // Native|Public|BlueprintCallable // @ game+0x68a32ac
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x5b63af8
	void *3dcfe68cdd(struct AActor* ReturnValue); // Function Engine.Controller.*3dcfe68cdd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ac64
	void *5d41444446(struct APlayerController* ReturnValue); // Function Engine.Controller.*5d41444446 // Final|Native|Public|BlueprintCallable // @ game+0x688e8a8
	void *e13b76f42a(struct AActor* Other, struct FVector ViewPoint, bool bAlternateChecks, bool ReturnValue); // Function Engine.Controller.*e13b76f42a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68a1314
	void *2c0d9f2569(struct FVector Param0, struct FRotator Param1); // Function Engine.Controller.*2c0d9f2569 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6890588
	void *c997c1061d(bool bNewLookInput); // Function Engine.Controller.*c997c1061d // Native|Public|BlueprintCallable // @ game+0x68a9b90
	void *bdd7417b98(); // Function Engine.Controller.*bdd7417b98 // Native|Public|BlueprintCallable // @ game+0x68a32c4
	void GetControlRotation(struct FRotator ReturnValue); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6896480
	void *b9246aa8a1(struct FRotator ReturnValue); // Function Engine.Controller.*b9246aa8a1 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6896a40
	void *00bc40e59f(); // Function Engine.Controller.*00bc40e59f // Native|Public|BlueprintCallable // @ game+0x68a32dc
	void Possess(struct APawn* InPawn); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x5ad02f0
	void *4efb158107(bool ReturnValue); // Function Engine.Controller.*4efb158107 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b828
	void *0b8dd02f61(); // Function Engine.Controller.*0b8dd02f61 // Native|Public|BlueprintCallable // @ game+0x688ea9c
	void ReceiveInstigatedAnyDamage(float Damage, struct U*0ad023d030* DamageType, struct AActor* DamagedActor, struct AActor* DamageCauser); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x20a5d0
};

// Class Engine.SpringArmComponent
// Size: 0x4f0 (Inherited: 0x470)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x468(0x04)
	struct FVector SocketOffset; // 0x46c(0x0c)
	struct FVector TargetOffset; // 0x478(0x0c)
	float ProbeSize; // 0x484(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x488(0x01)
	char bDoCollisionTest : 1; // 0x48c(0x01)
	char bUsePawnControlRotation : 1; // 0x48c(0x01)
	char bInheritPitch : 1; // 0x48c(0x01)
	char bInheritYaw : 1; // 0x48c(0x01)
	char bInheritRoll : 1; // 0x48c(0x01)
	char bLockPitchLag : 1; // 0x48c(0x01)
	char bLockYawLag : 1; // 0x48c(0x01)
	char bLockRollLag : 1; // 0x48c(0x01)
	char bEnableCameraLag : 1; // 0x48d(0x01)
	char bEnableCameraRotationLag : 1; // 0x48d(0x01)
	char bUseCameraLagSubstepping : 1; // 0x48d(0x01)
	char bDrawDebugLagMarkers : 1; // 0x48d(0x01)
	float CameraLagSpeed; // 0x490(0x04)
	float CameraRotationLagSpeed; // 0x494(0x04)
	float CameraLagMaxTimeStep; // 0x498(0x04)
	float CameraLagMaxDistance; // 0x49c(0x04)
	char pad_4A2[0x4e]; // 0x4a2(0x4e)
};

// Class Engine.PlayerController
// Size: 0x7a0 (Inherited: 0x470)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)
	struct APawn* *b84c005177; // 0x480(0x08)
	struct U*56292a4ba0* *b61860ece1; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
	struct AHUD* *ae70eed463; // 0x498(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x4a0(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4a8(0x08)
	bool *2381123a8f; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	struct FRotator TargetViewRotation; // 0x4b4(0x0c)
	char pad_4C0[0xc]; // 0x4c0(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4cc(0x04)
	struct TArray<struct AActor*> *8954a8e936; // 0x4d0(0x10)
	char pad_4E0[0x4]; // 0x4e0(0x04)
	float *c35bd652f0; // 0x4e4(0x04)
	struct FVector *87054d570e; // 0x4e8(0x0c)
	struct FRotator *648c282ed2; // 0x4f4(0x0c)
	int32 *b6892fc048; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct UCheatManager* CheatManager; // 0x508(0x08)
	struct UClass* CheatClass; // 0x510(0x08)
	struct UPlayerInput* PlayerInput; // 0x518(0x08)
	struct TArray<struct F*444f71f5b9> *a23dbcc48d; // 0x520(0x10)
	char pad_530[0x90]; // 0x530(0x90)
	char pad_5C0_0 : 3; // 0x5c0(0x01)
	char bPlayerIsWaiting : 1; // 0x5c0(0x01)
	char pad_5C0_4 : 4; // 0x5c0(0x01)
	char pad_5C1[0x3]; // 0x5c1(0x03)
	bool *ed1b53c175; // 0x5c4(0x01)
	char pad_5C5[0x3b]; // 0x5c5(0x3b)
	struct UNetConnection* *a47c378a48; // 0x600(0x08)
	struct UNetConnection* NetConnection; // 0x608(0x08)
	char pad_610[0xc]; // 0x610(0x0c)
	float InputYawScale; // 0x61c(0x04)
	float InputPitchScale; // 0x620(0x04)
	float InputRollScale; // 0x624(0x04)
	char bShowMouseCursor : 1; // 0x628(0x01)
	char bEnableClickEvents : 1; // 0x628(0x01)
	char bEnableTouchEvents : 1; // 0x628(0x01)
	char bEnableMouseOverEvents : 1; // 0x628(0x01)
	char bEnableTouchOverEvents : 1; // 0x628(0x01)
	char bForceFeedbackEnabled : 1; // 0x628(0x01)
	char pad_628_6 : 2; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x630(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x640(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x641(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x642(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x643(0x01)
	float HitResultTraceDistance; // 0x644(0x04)
	char pad_648[0x80]; // 0x648(0x80)
	struct U*89f9a84286* *d266a16c01; // 0x6c8(0x08)
	char pad_6D0_0 : 3; // 0x6d0(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6d0(0x01)
	char pad_6D0_4 : 4; // 0x6d0(0x01)
	char pad_6D1[0x17]; // 0x6d1(0x17)
	struct UTouchInterface* *703c33e737; // 0x6e8(0x08)
	char pad_6F0[0x40]; // 0x6f0(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x730(0x08)
	struct FVector SpawnLocation; // 0x738(0x0c)
	char pad_744[0x4]; // 0x744(0x04)
	bool *d0584e6155; // 0x748(0x01)
	char pad_749[0x1]; // 0x749(0x01)
	uint16 *040aa881fb; // 0x74a(0x02)
	uint16 *d1b605cbb0; // 0x74c(0x02)
	char pad_74E[0x2]; // 0x74e(0x02)
	struct AActor* *164573ddac; // 0x750(0x08)
	struct AActor* *dd0398ab0a; // 0x758(0x08)
	char pad_760[0x40]; // 0x760(0x40)

	void *9bc79729ce(); // Function Engine.PlayerController.*9bc79729ce // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6896d14
	void *6db76a3a17(); // Function Engine.PlayerController.*6db76a3a17 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xced41c
	void *1bb1630d13(); // Function Engine.PlayerController.*1bb1630d13 // Native|Public|BlueprintCallable // @ game+0x688beb0
	void *754b16dc40(); // Function Engine.PlayerController.*754b16dc40 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689a460
	void SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x68aad94
	void FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x6893d30
	void *492c0dfb10(); // Function Engine.PlayerController.*492c0dfb10 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x68908bc
	void *7d26778a3d(); // Function Engine.PlayerController.*7d26778a3d // Final|Native|Public|HasDefaults // @ game+0x6890b58
	void *64bae42b40(); // Function Engine.PlayerController.*64bae42b40 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a6cf4
	void *ba0fe87a17(); // Function Engine.PlayerController.*ba0fe87a17 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6890008
	void *4c8f98c6b1(); // Function Engine.PlayerController.*4c8f98c6b1 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x688f9f8
	void AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x688de34
	void *67e47f555a(); // Function Engine.PlayerController.*67e47f555a // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f014
	bool *fc5c98289c(); // Function Engine.PlayerController.*fc5c98289c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f1f4
	struct FName *66cb3b1abb(); // Function Engine.PlayerController.*66cb3b1abb // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a3990
	bool *27d9967514(); // Function Engine.PlayerController.*27d9967514 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x68a1d28
	void *a36a90c259(); // Function Engine.PlayerController.*a36a90c259 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xeb9900
	bool *1c8a42dada(); // Function Engine.PlayerController.*1c8a42dada // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68971ac
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x5b808ec
	void *ace4896d72(); // Function Engine.PlayerController.*ace4896d72 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5b21038
	bool *c741e7b156(); // Function Engine.PlayerController.*c741e7b156 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68a2be0
	struct FKey ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x6891250
	struct FName *b650a3c66a(); // Function Engine.PlayerController.*b650a3c66a // Net|NetReliableNative|Event|Public|NetClient // @ game+0x82a728
	bool *065c841a85(); // Function Engine.PlayerController.*065c841a85 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68ae528
	void *dc78805044(); // Function Engine.PlayerController.*dc78805044 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5b20d34
	int32 *337748a8a4(); // Function Engine.PlayerController.*337748a8a4 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x689ac8c
	int32 *600eb14c1b(); // Function Engine.PlayerController.*600eb14c1b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xdb57c0
	struct F*badb9cc575 *b2ff9a6f9b(); // Function Engine.PlayerController.*b2ff9a6f9b // Final|Native|Public|BlueprintCallable // @ game+0x68a2690
	void *64bd60d6ad(); // Function Engine.PlayerController.*64bd60d6ad // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5aaa798
	void *9cd6096020(); // Function Engine.PlayerController.*9cd6096020 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xeb0644
	struct FVector *1cdcd7de79(); // Function Engine.PlayerController.*1cdcd7de79 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6898504
	struct F*12ea908fc3 *da7f49c34f(); // Function Engine.PlayerController.*da7f49c34f // Net|NetReliableNative|Event|Public|NetClient // @ game+0xde40c4
	int32 *5e803224a0(); // Function Engine.PlayerController.*5e803224a0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x4af564
	int32 *d12287e8bd(); // Function Engine.PlayerController.*d12287e8bd // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688fcb4
	void *413a74fc4a(); // Function Engine.PlayerController.*413a74fc4a // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5888
	bool *017f81fff0(); // Function Engine.PlayerController.*017f81fff0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xd91d94
	struct FName *18f0867bd1(); // Function Engine.PlayerController.*18f0867bd1 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5594
	bool ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x68ae024
	bool *dba1cb64a2(); // Function Engine.PlayerController.*dba1cb64a2 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x688eb3c
	struct FName *e4e3fd3561(); // Function Engine.PlayerController.*e4e3fd3561 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0xc708cc
	struct TArray<struct F*e276d3ecaf> *b4cc95ff22(); // Function Engine.PlayerController.*b4cc95ff22 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6891020
	bool *646923e85b(); // Function Engine.PlayerController.*646923e85b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xb8d154
	float *926d6135f4(); // Function Engine.PlayerController.*926d6135f4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x689099c
	void *8775495bb7(); // Function Engine.PlayerController.*8775495bb7 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f074
	bool *77388303a1(); // Function Engine.PlayerController.*77388303a1 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x68907d8
	bool StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x68ad678
	float *c32dee1b26(); // Function Engine.PlayerController.*c32dee1b26 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6898148
	void *a0484bb951(); // Function Engine.PlayerController.*a0484bb951 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x63ce24
	struct FName *a1a43b96bb(); // Function Engine.PlayerController.*a1a43b96bb // Net|NetReliableNative|Event|Public|NetClient // @ game+0x68903cc
	int32 *0846d613e3(); // Function Engine.PlayerController.*0846d613e3 // Final|Native|Public|BlueprintCallable // @ game+0x68aab44
	struct FText *6b86f87435(); // Function Engine.PlayerController.*6b86f87435 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x68910dc
	struct FUniqueNetIdRepl *be5ef35171(); // Function Engine.PlayerController.*be5ef35171 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5434
	struct FString SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x68a38cc
	struct APawn* ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0xd064ac
	bool *c32597ff8f(); // Function Engine.PlayerController.*c32597ff8f // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x689750c
	struct F*12ea908fc3 *99deb6a5df(); // Function Engine.PlayerController.*99deb6a5df // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a5fdc
	struct FRotator *f6b10b700f(); // Function Engine.PlayerController.*f6b10b700f // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x68a5920
	void *6ca8f81f82(); // Function Engine.PlayerController.*6ca8f81f82 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5ef8
	float *551859c184(); // Function Engine.PlayerController.*551859c184 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6897ba8
	void *be8df9dac5(); // Function Engine.PlayerController.*be8df9dac5 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a5f90
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x6893b10
	bool *29fe5019a0(); // Function Engine.PlayerController.*29fe5019a0 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5a68
	float *9330da061e(); // Function Engine.PlayerController.*9330da061e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689796c
	enum class EControllerHand *d85a21b831(); // Function Engine.PlayerController.*d85a21b831 // Final|Native|Public|BlueprintCallable // @ game+0x68adcbc
	bool *48c46e979b(); // Function Engine.PlayerController.*48c46e979b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f28c
	void *50dd42b97f(); // Function Engine.PlayerController.*50dd42b97f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5b28
	void *4f029e8b42(); // Function Engine.PlayerController.*4f029e8b42 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x68907c0
	bool *fac0fe6371(); // Function Engine.PlayerController.*fac0fe6371 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x689735c
	float *3a17d02d0a(); // Function Engine.PlayerController.*3a17d02d0a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897e8c
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x5b5e458
	struct FString *515ca9bd09(); // Function Engine.PlayerController.*515ca9bd09 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a3a44
	int32 ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a5cd4
	struct FColor *b2cd120b3b(); // Function Engine.PlayerController.*b2cd120b3b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a8c2c
	bool *202ea03278(); // Function Engine.PlayerController.*202ea03278 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6896e84
	void *68b9f2b1c8(); // Function Engine.PlayerController.*68b9f2b1c8 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a3b78
	bool *b8ad63a8db(); // Function Engine.PlayerController.*b8ad63a8db // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6898d00
	struct FUniqueNetIdRepl *6bececdfa5(); // Function Engine.PlayerController.*6bececdfa5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f48c
	bool DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6891d84
	struct APawn* *a3ff594db9(); // Function Engine.PlayerController.*a3ff594db9 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xd86e98
	bool *1b581f5708(); // Function Engine.PlayerController.*1b581f5708 // Native|Public|BlueprintCallable // @ game+0x68acabc
	struct UClass* *c063f400fc(); // Function Engine.PlayerController.*c063f400fc // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x689072c
	bool *7badcea36e(); // Function Engine.PlayerController.*7badcea36e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688fb7c
	struct FRotator *c0bfdc5bc7(); // Function Engine.PlayerController.*c0bfdc5bc7 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x8cb744
	bool *30ed96f4e7(); // Function Engine.PlayerController.*30ed96f4e7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68ae434
	float AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x688d65c
	struct FName Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x688e3dc
	struct FGuid *ff56e2228f(); // Function Engine.PlayerController.*ff56e2228f // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6890d2c
	struct FVector *07e9ba9cd5(); // Function Engine.PlayerController.*07e9ba9cd5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6896be4
	struct FUniqueNetIdRepl *631d4dd4e1(); // Function Engine.PlayerController.*631d4dd4e1 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5b74
	bool ServerUpdateLevelVisibility(); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xc71054
	enum class EControllerHand *ed7a62c23a(); // Function Engine.PlayerController.*ed7a62c23a // Final|Native|Public|BlueprintCallable // @ game+0x68a996c
	bool *c680b04a41(); // Function Engine.PlayerController.*c680b04a41 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6891e8c
	struct APawn* ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x689009c
	bool *504cc5b5ec(); // Function Engine.PlayerController.*504cc5b5ec // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6896ff4
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x5b22824
	struct UCameraAnim* *1da0c51c15(); // Function Engine.PlayerController.*1da0c51c15 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x623c3b4
	int32 *7843cf5b19(); // Function Engine.PlayerController.*7843cf5b19 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6890460
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x5af4204
	bool *1c0be40025(); // Function Engine.PlayerController.*1c0be40025 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b70c
	struct FRotator *de5cdb845e(); // Function Engine.PlayerController.*de5cdb845e // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x688f5a8
	bool *994d9585e4(); // Function Engine.PlayerController.*994d9585e4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6890694
	void *f12676d8d9(); // Function Engine.PlayerController.*f12676d8d9 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a58d4
	void *30f65c03fa(); // Function Engine.PlayerController.*30f65c03fa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a5f44
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x5ae7824
	void *3c955a30f1(); // Function Engine.PlayerController.*3c955a30f1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f05c
	bool *5a504151cb(); // Function Engine.PlayerController.*5a504151cb // Native|Public|BlueprintCallable // @ game+0x68a8294
	float *42ab205675(); // Function Engine.PlayerController.*42ab205675 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6897a60
	void *45753d8258(); // Function Engine.PlayerController.*45753d8258 // Final|Native|Public|BlueprintCallable // @ game+0x688eab4
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x68a1dc0
	bool *83fe00935b(); // Function Engine.PlayerController.*83fe00935b // Native|Public|BlueprintCallable // @ game+0x68acc84
	struct FString SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x68ade94
	bool *f02dad65dc(); // Function Engine.PlayerController.*f02dad65dc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f110
	struct FUniqueNetIdRepl *8b49197eab(); // Function Engine.PlayerController.*8b49197eab // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6890f04
	float *98b518ef28(); // Function Engine.PlayerController.*98b518ef28 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f324
	float AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x688daa0
	void *586f1ffdba(); // Function Engine.PlayerController.*586f1ffdba // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688f0f8
	void *ec4658b026(); // Function Engine.PlayerController.*ec4658b026 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x68a3b2c
	struct FString LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x68a1458
	struct UObject* *cc6aa4203e(); // Function Engine.PlayerController.*cc6aa4203e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x688fe40
	bool *599d38076c(); // Function Engine.PlayerController.*599d38076c // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x68901f4
	bool *240d2c5a52(); // Function Engine.PlayerController.*240d2c5a52 // Final|Native|Public|BlueprintCallable // @ game+0x68a299c
	struct FVector *7ad5457e5d(); // Function Engine.PlayerController.*7ad5457e5d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6897f80
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x6893af8
	bool *f41bd4c807(); // Function Engine.PlayerController.*f41bd4c807 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x689824c
	struct FString *3f159e81eb(); // Function Engine.PlayerController.*3f159e81eb // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0xb83afc
	struct FString *50dacbc7ed(); // Function Engine.PlayerController.*50dacbc7ed // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6890130
	float *17b1db61f7(); // Function Engine.PlayerController.*17b1db61f7 // Net|Native|Event|Public|NetClient // @ game+0x688f8d4
	struct TArray<struct F*956690b004> *a4df4a4cc6(); // Function Engine.PlayerController.*a4df4a4cc6 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x68a5e00
};

// Class Engine.Info
// Size: 0x3f0 (Inherited: 0x3f0)
struct AInfo : AActor {
	float NetUpdateFrequency; // 0x30(0x04)
	struct FMulticastDelegate OnEndCursorOver; // 0x40(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x50(0x10)
	char pad_414_0 : 3; // 0x414(0x01)
	char *afc0b607c1 : 1; // 0x60(0x01)
	char *195141a832 : 1; // 0x61(0x01)
	char bReplicates : 1; // 0x61(0x01)
	struct FName *dc8dad45d2; // 0x68(0x08)
	enum class ENetRole RemoteRole; // 0x70(0x01)
	struct AActor* Owner; // 0x78(0x08)
	struct FRepMovement ReplicatedMovement; // 0x80(0x34)
	struct F*163cdb3029 *4998573317; // 0xb8(0x40)
	enum class ENetRole Role; // 0xf8(0x01)
	char bHidden : 1; // 0xfa(0x01)
	char *ccd23c4d11 : 1; // 0xfa(0x01)
	char *00c044e8f3 : 1; // 0xfa(0x01)
	char bOnlyRelevantToOwner : 1; // 0xfa(0x01)
	char bAlwaysRelevant : 1; // 0xfa(0x01)
	char *0b52d4980d : 1; // 0xfa(0x01)
	char *581c4aea8e : 1; // 0xfa(0x01)
	char *00a5818f10 : 1; // 0xfa(0x01)
	char *578ce01c9c : 1; // 0xfb(0x01)
	char *dc908ea105 : 1; // 0xfb(0x01)
	char bNetUseOwnerRelevancy : 1; // 0xfb(0x01)
	char *e59ae21b72 : 1; // 0xfb(0x01)
	char *42194894c7 : 1; // 0xfb(0x01)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x100(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x110(0x01)
	char bCanBeDamaged : 1; // 0x110(0x01)
	char *48c13dc856 : 1; // 0x110(0x01)
	char *b6f52fdcb3 : 1; // 0x110(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x110(0x01)
	char *ff1816ff9e : 1; // 0x110(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x110(0x01)
	char *a9f513e55a : 1; // 0x110(0x01)
	char *07bc7fef21 : 1; // 0x111(0x01)
	struct TArray<struct AMatineeActor*> *24dd036ec9; // 0x118(0x10)
	float *f4ec68df5a; // 0x138(0x04)
	float NetPriority; // 0x13c(0x04)
	char *72b47ba3cd : 1; // 0x144(0x01)
	char *8b1bf7449f : 1; // 0x144(0x01)
	char *d253d94f65 : 1; // 0x144(0x01)
	char *3b999d2d7a : 1; // 0x144(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x145(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x146(0x01)
	int32 *403c4f6ec5; // 0x148(0x04)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x150(0x10)
	struct TArray<struct FName> Tags; // 0x168(0x10)
	float MinNetUpdateFrequency; // 0x178(0x04)
	struct U*89f9a84286* *89f9a84286; // 0x188(0x08)
	struct APawn* Instigator; // 0x190(0x08)
	struct FMulticastDelegate OnClicked; // 0x198(0x10)
	float NetCullDistanceSquared; // 0x1a8(0x04)
	float CustomTimeDilation; // 0x1ac(0x04)
	struct USceneComponent* RootComponent; // 0x1b0(0x08)
	struct TArray<struct FName> Layers; // 0x1b8(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x1c8(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x1d8(0x01)
	struct FGuid DestructibleId; // 0x1dc(0x10)
	bool bIsDestroyedVersion; // 0x1ec(0x01)
	bool RemoveFromLevelLOD; // 0x1ed(0x01)
	struct F*b3a779a928 PrimaryActorTick; // 0x1f0(0x58)
	float InitialLifeSpan; // 0x24c(0x04)
	struct FMulticastDelegate OnInputTouchLeave; // 0x250(0x10)
	struct UChildActorComponent* *18ff5b3923; // 0x260(0x08)
	struct FMulticastDelegate OnInputTouchEnter; // 0x268(0x10)
	enum class *d729d3c5a5 InputConsumeOption; // 0x278(0x01)
	struct FMulticastDelegate OnBeginCursorOver; // 0x280(0x10)
	struct TArray<struct AActor*> Children; // 0x290(0x10)
	int32 *c2b5fafb50; // 0x2a0(0x04)
	struct FMulticastDelegate OnTakePointDamage; // 0x2f8(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x308(0x10)
	struct FMulticastDelegate OnActorHit; // 0x318(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x328(0x10)
	enum class EAutoReceiveInput *aaa4c6b0aa; // 0x338(0x01)
	struct AActor* ParentComponentActor; // 0x33c(0x08)
	struct FMulticastDelegate OnDestroyed; // 0x348(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x358(0x10)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x3c0(0x10)
	uint64 *59b4fa8b00; // 0x3d0(0x08)
	struct FMulticastDelegate OnReleased; // 0x3d8(0x10)

	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xe6fc80
	struct FVector *d5ff08bf52(); // Function Engine.Actor.*d5ff08bf52 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68946e8
	struct APlayerController* K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct TArray<struct UActorComponent*> *efaba219b2(); // Function Engine.Actor.*efaba219b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896340
	enum class ENetRole *d4b72b197e(); // Function Engine.Actor.*d4b72b197e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899fb8
	bool DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x689211c
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ea54
	bool K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x689ffe0
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x525484
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x689e4b8
	void *5f8251239e(); // Function Engine.Actor.*5f8251239e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68941f8
	bool K2_AttachRootComponentTo(); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x689d9f8
	float *5c41a9b3d8(); // Function Engine.Actor.*5c41a9b3d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897cf0
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FVector *058a798681(); // Function Engine.Actor.*058a798681 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a6634
	struct FHitResult ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	struct FVector *72d1ab0701(); // Function Engine.Actor.*72d1ab0701 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a66d4
	bool K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c0c8
	struct UMaterialInstanceDynamic* *b999b3d1c3(); // Function Engine.Actor.*b999b3d1c3 // Final|Native|Public|BlueprintCallable // @ game+0x68a15b4
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FKey ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *221e5b49fe(); // Function Engine.Actor.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x68abb70
	bool *75f3114c08(); // Function Engine.Actor.*75f3114c08 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b298
	float *cdc7b91d6d(); // Function Engine.Actor.*cdc7b91d6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689a478
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdcda54
	enum class ETickingGroup *814a121c39(); // Function Engine.Actor.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x68ac0d8
	float *118a22ba37(); // Function Engine.Actor.*118a22ba37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897de4
	struct UActorComponent* *0d0c513b2c(); // Function Engine.Actor.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x68a3184
	struct AActor* *c4fee2a50d(); // Function Engine.Actor.*c4fee2a50d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894f98
	bool K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c4cc
	bool *4bc88286ff(); // Function Engine.Actor.*4bc88286ff // Final|Native|Public|BlueprintCallable // @ game+0x68a6338
	float *7cff7fa404(); // Function Engine.Actor.*7cff7fa404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689abc4
	struct UClass* GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6899354
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb4995c
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *0533b13c90(); // Function Engine.Actor.*0533b13c90 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6894d84
	struct FVector *f4f472a4df(); // Function Engine.Actor.*f4f472a4df // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68949d8
	struct UActorComponent* *f3429ceb97(); // Function Engine.Actor.*f3429ceb97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896158
	struct FVector *eb66fec44e(); // Function Engine.Actor.*eb66fec44e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6894964
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5a98aa4
	struct FVector *bbf004721b(); // Function Engine.Actor.*bbf004721b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6898400
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x4de458
	struct AActor* ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FName MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a1630
	float *5d41351842(); // Function Engine.Actor.*5d41351842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68977b4
	float *76f4a54e31(); // Function Engine.Actor.*76f4a54e31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894998
	struct USceneComponent* *6c12a1a971(); // Function Engine.Actor.*6c12a1a971 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ef14
	float *14c0f68ea4(); // Function Engine.Actor.*14c0f68ea4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6896cc0
	enum class ETouchIndex ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	float *52068fadb9(); // Function Engine.Actor.*52068fadb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897714
	struct FRotator *e45fc9ffc9(); // Function Engine.Actor.*e45fc9ffc9 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68945dc
	bool GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689440c
	enum class ETouchIndex ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x20a5d0
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x68a6774
	bool *d57fbe8fc6(); // Function Engine.Actor.*d57fbe8fc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b1e4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb4eb28
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *891a15da22(); // Function Engine.Actor.*891a15da22 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a0f7c
	bool K2_SetActorLocation(); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f5e8
	struct AController* *8ee0b9e990(); // Function Engine.Actor.*8ee0b9e990 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898620
	float ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x689420c
	struct FName *bda82fb76a(); // Function Engine.Actor.*bda82fb76a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894fbc
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *de9d01b3f6(); // Function Engine.Actor.*de9d01b3f6 // Final|Native|Public|BlueprintCallable // @ game+0x689de78
	struct FName *209c054b22(); // Function Engine.Actor.*209c054b22 // Final|Native|Public|BlueprintCallable // @ game+0x68ad250
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x688db3c
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fbdc
	struct AActor* *541a06a744(); // Function Engine.Actor.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x68a305c
	float *7311615d4b(); // Function Engine.Actor.*7311615d4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68949b0
	void *65fa332f56(); // Function Engine.Actor.*65fa332f56 // Native|Public|BlueprintCallable // @ game+0x68adf58
	struct APlayerController* *0f7b3f99fd(); // Function Engine.Actor.*0f7b3f99fd // Native|Public|BlueprintCallable // @ game+0x6893c70
	bool K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c87c
	bool *bad918d000(); // Function Engine.Actor.*bad918d000 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68ae61c
	struct TArray<struct AActor*> *383cbfbf66(); // Function Engine.Actor.*383cbfbf66 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6895000
	float *48b2b80fa1(); // Function Engine.Actor.*48b2b80fa1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68986d0
	float *511ef00739(); // Function Engine.Actor.*511ef00739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896a78
	bool *83d2d5c58f(); // Function Engine.Actor.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ba04
	struct FVector *806c296001(); // Function Engine.Actor.*806c296001 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689e990
	struct FVector *a0012f52a9(); // Function Engine.Actor.*a0012f52a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689480c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xab1c94
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void GetTransform(struct FTransform ReturnValue); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xc6f6d4
	void *b7511d0ed8(enum class *ecdd115207 LocationRule, enum class *ecdd115207 RotationRule, enum class *ecdd115207 ScaleRule); // Function Engine.Actor.*b7511d0ed8 // Final|Native|Public|BlueprintCallable // @ game+0x689e620
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *1206b0a740(struct FVector ReturnValue); // Function Engine.Actor.*1206b0a740 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6894840
	void *f221ff8513(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6234cb0
	void *dd10056177(struct APawn* ReturnValue); // Function Engine.Actor.*dd10056177 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898608
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *45e9b736d8(bool ReturnValue); // Function Engine.Actor.*45e9b736d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68945b4
	void *e22a09fc3d(struct AActor* ReturnValue); // Function Engine.Actor.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899744
	void *d93dde83f1(struct UClass* ComponentClass, struct TArray<struct UActorComponent*> ReturnValue); // Function Engine.Actor.*d93dde83f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896250
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fa04
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c6a4
	void *057be55286(struct AActor* ReturnValue); // Function Engine.Actor.*057be55286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68997d8
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68995b4
	void *1357a6903c(float TickInterval); // Function Engine.Actor.*1357a6903c // Final|Native|Public|BlueprintCallable // @ game+0x68a6808
	void *ce1958648c(struct AActor* OtherActor, float ReturnValue); // Function Engine.Actor.*ce1958648c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896b18
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xcf4d04
	void AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform RelativeTransform, struct UObject* ComponentTemplateContext, struct UActorComponent* ReturnValue); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xc18b48
	void K2_AddActorLocalTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c2a0
	void ReceiveAnyDamage(float Damage, struct U*0ad023d030* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fdb4
	void K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x689db78
	void K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689bef0
	void *d85c70de6e(); // Function Engine.Actor.*d85c70de6e // Final|Native|Public|BlueprintCallable // @ game+0x689a744
	void *ef270d1a10(); // Function Engine.Actor.*ef270d1a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68997fc
	void *685e3b5cc9(); // Function Engine.Actor.*685e3b5cc9 // Native|Public|BlueprintCallable // @ game+0x68a9fd8
	void *581f8985e1(); // Function Engine.Actor.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x689e4d0
	void *32ee7138ab(); // Function Engine.Actor.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x68ac1f0
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ab8c
	void K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a00e0
	void *91da404789(); // Function Engine.Actor.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0xd1a1d4
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x68921b0
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x68a63d0
	void K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f7cc
	void *87d1cdd662(); // Function Engine.Actor.*87d1cdd662 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68abc08
	void *461623950c(); // Function Engine.Actor.*461623950c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b200
};

// Class Engine.GameModeBase
// Size: 0x490 (Inherited: 0x3f0)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x3f0(0x10)
	struct UClass* GameSessionClass; // 0x400(0x08)
	struct UClass* GameStateClass; // 0x408(0x08)
	struct UClass* PlayerControllerClass; // 0x410(0x08)
	struct UClass* PlayerStateClass; // 0x418(0x08)
	struct FStringClassReference HUDClass; // 0x420(0x10)
	struct UClass* DefaultPawnClass; // 0x430(0x08)
	struct FStringClassReference SpectatorClass; // 0x438(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x448(0x08)
	struct AGameSession* GameSession; // 0x450(0x08)
	struct AGameStateBase* GameState; // 0x458(0x08)
	struct FText *36bef0b8bb; // 0x460(0x18)
	char bUseSeamlessTravel : 1; // 0x478(0x01)
	char bStartPlayersAsSpectators : 1; // 0x478(0x01)
	char bPauseable : 1; // 0x478(0x01)
	char pad_478_3 : 5; // 0x478(0x01)
	char pad_479[0x17]; // 0x479(0x17)

	struct AActor* FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xd4c9b0
	void *a7b4935b36(); // Function Engine.GameModeBase.*a7b4935b36 // Native|Public|BlueprintCallable // @ game+0xa5922c
	bool MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xd62434
	bool *d4e79c9423(); // Function Engine.GameModeBase.*d4e79c9423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b1e2d0
	struct AActor* *0640ebc54a(); // Function Engine.GameModeBase.*0640ebc54a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x689e874
	bool ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x68a2ed4
	bool PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0xafa474
	struct APlayerController* InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xe88c38
	struct APawn* SpawnDefaultPawnFor(); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xd7d6f0
	bool *ea3038b0fd(); // Function Engine.GameModeBase.*ea3038b0fd // Native|Public|BlueprintCallable // @ game+0x688e938
	struct APlayerController* HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0xafa534
	struct AController* RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x68a33bc
	struct AController* K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x20a5d0
	int32 *ccb74fed66(); // Function Engine.GameModeBase.*ccb74fed66 // Native|Public|BlueprintCallable // @ game+0x68992b4
	int32 *82ff0fcd4e(); // Function Engine.GameModeBase.*82ff0fcd4e // Native|Public|BlueprintCallable // @ game+0x68991d0
	struct FTransform RestartPlayerAtTransform(); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a3530
	struct AActor* RestartPlayerAtPlayerStart(); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x68a3450
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x5b856f0
	struct UClass* GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xd9c500
	struct AController* K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct APlayerController* K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct AActor* ChoosePlayerStart(); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xd3d1b8
	void CanSpectate(struct APlayerController* Viewer, struct APlayerState* ViewTarget, bool ReturnValue); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x688e564
	void SpawnDefaultPawnAtTransform(struct AController* NewPlayer, struct FTransform SpawnTransform, struct APawn* ReturnValue); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xdceaa8
	void K2_OnSwapPlayerControllers(struct APlayerController* OldPC, struct APlayerController* NewPC); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	void K2_OnChangeName(struct AController* Other, struct FString NewName, bool bNameChange); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void InitStartSpot(struct AActor* StartSpot, struct AController* NewPlayer); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xe7afe8
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xc9d95c
};

// Class Engine.GameMode
// Size: 0x4d0 (Inherited: 0x490)
struct AGameMode : AGameModeBase {
	struct FName *bb64d0d946; // 0x490(0x08)
	char bDelayedStart : 1; // 0x498(0x01)
	char pad_498_1 : 7; // 0x498(0x01)
	char pad_499[0x3]; // 0x499(0x03)
	int32 NumSpectators; // 0x49c(0x04)
	int32 NumPlayers; // 0x4a0(0x04)
	int32 NumBots; // 0x4a4(0x04)
	float MinRespawnDelay; // 0x4a8(0x04)
	int32 NumTravellingPlayers; // 0x4ac(0x04)
	struct UClass* *db19159cfc; // 0x4b0(0x08)
	struct TArray<struct APlayerState*> *a6accb8e63; // 0x4b8(0x10)
	float *9df405dde0; // 0x4c8(0x04)
	bool bHandleDedicatedServerReplays; // 0x4cc(0x01)
	char pad_4CD[0x3]; // 0x4cd(0x03)

	struct FName *9b6ffe7a3d(); // Function Engine.GameMode.*9b6ffe7a3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898904
	void *8430b4980a(); // Function Engine.GameMode.*8430b4980a // Native|Public|BlueprintCallable // @ game+0x6893d04
	void *765398c9d4(); // Function Engine.GameMode.*765398c9d4 // Native|Public|BlueprintCallable // @ game+0x68a3308
	bool ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0xbad358
	struct FString Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x68a36f4
	bool *20e3515243(); // Function Engine.GameMode.*20e3515243 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b894
	struct FName K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	bool ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xddbe08
	void *ba4aa21903(); // Function Engine.GameMode.*ba4aa21903 // Native|Public|BlueprintCallable // @ game+0x5b1d334
	bool *3f89f1978b(); // Function Engine.GameMode.*3f89f1978b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689adf8
	float SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x68a73b8
	void *cf4f0d8a8f(); // Function Engine.GameMode.*cf4f0d8a8f // Native|Public|BlueprintCallable // @ game+0x5ae4888
};

// Class Engine.PlayerState
// Size: 0x488 (Inherited: 0x3f0)
struct APlayerState : AInfo {
	int32 PlayerId; // 0x3f0(0x04)
	char bIsSpectator : 1; // 0x3f4(0x01)
	char *27105a3b1d : 1; // 0x3f4(0x01)
	char bIsABot : 1; // 0x3f4(0x01)
	char pad_3F4_3 : 1; // 0x3f4(0x01)
	char *e0a90482a6 : 1; // 0x3f4(0x01)
	char *37ab395502 : 1; // 0x3f4(0x01)
	char pad_3F4_6 : 2; // 0x3f4(0x01)
	char pad_3F5[0x13]; // 0x3f5(0x13)
	float Score; // 0x408(0x04)
	int32 StartTime; // 0x40c(0x04)
	struct FString *bd04ae9cde; // 0x410(0x10)
	char pad_420[0x8]; // 0x420(0x08)
	struct FString PlayerName; // 0x428(0x10)
	bool Ping; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct FUniqueNetIdRepl UniqueId; // 0x440(0x18)
	char pad_458[0x8]; // 0x458(0x08)
	struct UClass* *db19159cfc; // 0x460(0x08)
	char pad_468[0x18]; // 0x468(0x18)
	bool *4253d56a24; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)

	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0x5aa9ca0
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x5b7bde4
	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x5b419d0
	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x5b7bdcc
	void ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	void ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x20a5d0
};

// Class Engine.TargetPoint
// Size: 0x3f0 (Inherited: 0x3f0)
struct ATargetPoint : AActor {
	float NetUpdateFrequency; // 0x30(0x04)
	struct FMulticastDelegate OnEndCursorOver; // 0x40(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x50(0x10)
	char pad_414_0 : 3; // 0x414(0x01)
	char *afc0b607c1 : 1; // 0x60(0x01)
	char *195141a832 : 1; // 0x61(0x01)
	char bReplicates : 1; // 0x61(0x01)
	struct FName *dc8dad45d2; // 0x68(0x08)
	enum class ENetRole RemoteRole; // 0x70(0x01)
	struct AActor* Owner; // 0x78(0x08)
	struct FRepMovement ReplicatedMovement; // 0x80(0x34)
	struct F*163cdb3029 *4998573317; // 0xb8(0x40)
	enum class ENetRole Role; // 0xf8(0x01)
	char bHidden : 1; // 0xfa(0x01)
	char *ccd23c4d11 : 1; // 0xfa(0x01)
	char *00c044e8f3 : 1; // 0xfa(0x01)
	char bOnlyRelevantToOwner : 1; // 0xfa(0x01)
	char bAlwaysRelevant : 1; // 0xfa(0x01)
	char *0b52d4980d : 1; // 0xfa(0x01)
	char *581c4aea8e : 1; // 0xfa(0x01)
	char *00a5818f10 : 1; // 0xfa(0x01)
	char *578ce01c9c : 1; // 0xfb(0x01)
	char *dc908ea105 : 1; // 0xfb(0x01)
	char bNetUseOwnerRelevancy : 1; // 0xfb(0x01)
	char *e59ae21b72 : 1; // 0xfb(0x01)
	char *42194894c7 : 1; // 0xfb(0x01)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x100(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x110(0x01)
	char bCanBeDamaged : 1; // 0x110(0x01)
	char *48c13dc856 : 1; // 0x110(0x01)
	char *b6f52fdcb3 : 1; // 0x110(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x110(0x01)
	char *ff1816ff9e : 1; // 0x110(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x110(0x01)
	char *a9f513e55a : 1; // 0x110(0x01)
	char *07bc7fef21 : 1; // 0x111(0x01)
	struct TArray<struct AMatineeActor*> *24dd036ec9; // 0x118(0x10)
	float *f4ec68df5a; // 0x138(0x04)
	float NetPriority; // 0x13c(0x04)
	char *72b47ba3cd : 1; // 0x144(0x01)
	char *8b1bf7449f : 1; // 0x144(0x01)
	char *d253d94f65 : 1; // 0x144(0x01)
	char *3b999d2d7a : 1; // 0x144(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x145(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x146(0x01)
	int32 *403c4f6ec5; // 0x148(0x04)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x150(0x10)
	struct TArray<struct FName> Tags; // 0x168(0x10)
	float MinNetUpdateFrequency; // 0x178(0x04)
	struct U*89f9a84286* *89f9a84286; // 0x188(0x08)
	struct APawn* Instigator; // 0x190(0x08)
	struct FMulticastDelegate OnClicked; // 0x198(0x10)
	float NetCullDistanceSquared; // 0x1a8(0x04)
	float CustomTimeDilation; // 0x1ac(0x04)
	struct USceneComponent* RootComponent; // 0x1b0(0x08)
	struct TArray<struct FName> Layers; // 0x1b8(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x1c8(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x1d8(0x01)
	struct FGuid DestructibleId; // 0x1dc(0x10)
	bool bIsDestroyedVersion; // 0x1ec(0x01)
	bool RemoveFromLevelLOD; // 0x1ed(0x01)
	struct F*b3a779a928 PrimaryActorTick; // 0x1f0(0x58)
	float InitialLifeSpan; // 0x24c(0x04)
	struct FMulticastDelegate OnInputTouchLeave; // 0x250(0x10)
	struct UChildActorComponent* *18ff5b3923; // 0x260(0x08)
	struct FMulticastDelegate OnInputTouchEnter; // 0x268(0x10)
	enum class *d729d3c5a5 InputConsumeOption; // 0x278(0x01)
	struct FMulticastDelegate OnBeginCursorOver; // 0x280(0x10)
	struct TArray<struct AActor*> Children; // 0x290(0x10)
	int32 *c2b5fafb50; // 0x2a0(0x04)
	struct FMulticastDelegate OnTakePointDamage; // 0x2f8(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x308(0x10)
	struct FMulticastDelegate OnActorHit; // 0x318(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x328(0x10)
	enum class EAutoReceiveInput *aaa4c6b0aa; // 0x338(0x01)
	struct AActor* ParentComponentActor; // 0x33c(0x08)
	struct FMulticastDelegate OnDestroyed; // 0x348(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x358(0x10)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x3c0(0x10)
	uint64 *59b4fa8b00; // 0x3d0(0x08)
	struct FMulticastDelegate OnReleased; // 0x3d8(0x10)

	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xe6fc80
	struct FVector *d5ff08bf52(); // Function Engine.Actor.*d5ff08bf52 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68946e8
	struct APlayerController* K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct TArray<struct UActorComponent*> *efaba219b2(); // Function Engine.Actor.*efaba219b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896340
	enum class ENetRole *d4b72b197e(); // Function Engine.Actor.*d4b72b197e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899fb8
	bool DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x689211c
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ea54
	bool K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x689ffe0
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x525484
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x689e4b8
	void *5f8251239e(); // Function Engine.Actor.*5f8251239e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68941f8
	bool K2_AttachRootComponentTo(); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x689d9f8
	float *5c41a9b3d8(); // Function Engine.Actor.*5c41a9b3d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897cf0
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FVector *058a798681(); // Function Engine.Actor.*058a798681 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a6634
	struct FHitResult ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	struct FVector *72d1ab0701(); // Function Engine.Actor.*72d1ab0701 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a66d4
	bool K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c0c8
	struct UMaterialInstanceDynamic* *b999b3d1c3(); // Function Engine.Actor.*b999b3d1c3 // Final|Native|Public|BlueprintCallable // @ game+0x68a15b4
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FKey ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *221e5b49fe(); // Function Engine.Actor.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x68abb70
	bool *75f3114c08(); // Function Engine.Actor.*75f3114c08 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b298
	float *cdc7b91d6d(); // Function Engine.Actor.*cdc7b91d6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689a478
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdcda54
	enum class ETickingGroup *814a121c39(); // Function Engine.Actor.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x68ac0d8
	float *118a22ba37(); // Function Engine.Actor.*118a22ba37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897de4
	struct UActorComponent* *0d0c513b2c(); // Function Engine.Actor.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x68a3184
	struct AActor* *c4fee2a50d(); // Function Engine.Actor.*c4fee2a50d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894f98
	bool K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c4cc
	bool *4bc88286ff(); // Function Engine.Actor.*4bc88286ff // Final|Native|Public|BlueprintCallable // @ game+0x68a6338
	float *7cff7fa404(); // Function Engine.Actor.*7cff7fa404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689abc4
	struct UClass* GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6899354
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb4995c
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *0533b13c90(); // Function Engine.Actor.*0533b13c90 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6894d84
	struct FVector *f4f472a4df(); // Function Engine.Actor.*f4f472a4df // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68949d8
	struct UActorComponent* *f3429ceb97(); // Function Engine.Actor.*f3429ceb97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896158
	struct FVector *eb66fec44e(); // Function Engine.Actor.*eb66fec44e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6894964
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5a98aa4
	struct FVector *bbf004721b(); // Function Engine.Actor.*bbf004721b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6898400
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x4de458
	struct AActor* ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FName MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a1630
	float *5d41351842(); // Function Engine.Actor.*5d41351842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68977b4
	float *76f4a54e31(); // Function Engine.Actor.*76f4a54e31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894998
	struct USceneComponent* *6c12a1a971(); // Function Engine.Actor.*6c12a1a971 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ef14
	float *14c0f68ea4(); // Function Engine.Actor.*14c0f68ea4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6896cc0
	enum class ETouchIndex ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	float *52068fadb9(); // Function Engine.Actor.*52068fadb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6897714
	struct FRotator *e45fc9ffc9(); // Function Engine.Actor.*e45fc9ffc9 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68945dc
	bool GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689440c
	enum class ETouchIndex ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x20a5d0
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x68a6774
	bool *d57fbe8fc6(); // Function Engine.Actor.*d57fbe8fc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b1e4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb4eb28
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *891a15da22(); // Function Engine.Actor.*891a15da22 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a0f7c
	bool K2_SetActorLocation(); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f5e8
	struct AController* *8ee0b9e990(); // Function Engine.Actor.*8ee0b9e990 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898620
	float ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x689420c
	struct FName *bda82fb76a(); // Function Engine.Actor.*bda82fb76a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6894fbc
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x20a5d0
	bool *de9d01b3f6(); // Function Engine.Actor.*de9d01b3f6 // Final|Native|Public|BlueprintCallable // @ game+0x689de78
	struct FName *209c054b22(); // Function Engine.Actor.*209c054b22 // Final|Native|Public|BlueprintCallable // @ game+0x68ad250
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x688db3c
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fbdc
	struct AActor* *541a06a744(); // Function Engine.Actor.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x68a305c
	float *7311615d4b(); // Function Engine.Actor.*7311615d4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68949b0
	void *65fa332f56(); // Function Engine.Actor.*65fa332f56 // Native|Public|BlueprintCallable // @ game+0x68adf58
	struct APlayerController* *0f7b3f99fd(); // Function Engine.Actor.*0f7b3f99fd // Native|Public|BlueprintCallable // @ game+0x6893c70
	bool K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c87c
	bool *bad918d000(); // Function Engine.Actor.*bad918d000 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68ae61c
	struct TArray<struct AActor*> *383cbfbf66(); // Function Engine.Actor.*383cbfbf66 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6895000
	float *48b2b80fa1(); // Function Engine.Actor.*48b2b80fa1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68986d0
	float *511ef00739(); // Function Engine.Actor.*511ef00739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896a78
	bool *83d2d5c58f(); // Function Engine.Actor.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ba04
	struct FVector *806c296001(); // Function Engine.Actor.*806c296001 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689e990
	struct FVector *a0012f52a9(); // Function Engine.Actor.*a0012f52a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689480c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xab1c94
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void GetTransform(struct FTransform ReturnValue); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xc6f6d4
	void *b7511d0ed8(enum class *ecdd115207 LocationRule, enum class *ecdd115207 RotationRule, enum class *ecdd115207 ScaleRule); // Function Engine.Actor.*b7511d0ed8 // Final|Native|Public|BlueprintCallable // @ game+0x689e620
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *1206b0a740(struct FVector ReturnValue); // Function Engine.Actor.*1206b0a740 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6894840
	void *f221ff8513(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6234cb0
	void *dd10056177(struct APawn* ReturnValue); // Function Engine.Actor.*dd10056177 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898608
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *45e9b736d8(bool ReturnValue); // Function Engine.Actor.*45e9b736d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68945b4
	void *e22a09fc3d(struct AActor* ReturnValue); // Function Engine.Actor.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899744
	void *d93dde83f1(struct UClass* ComponentClass, struct TArray<struct UActorComponent*> ReturnValue); // Function Engine.Actor.*d93dde83f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896250
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fa04
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c6a4
	void *057be55286(struct AActor* ReturnValue); // Function Engine.Actor.*057be55286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68997d8
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68995b4
	void *1357a6903c(float TickInterval); // Function Engine.Actor.*1357a6903c // Final|Native|Public|BlueprintCallable // @ game+0x68a6808
	void *ce1958648c(struct AActor* OtherActor, float ReturnValue); // Function Engine.Actor.*ce1958648c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896b18
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xcf4d04
	void AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform RelativeTransform, struct UObject* ComponentTemplateContext, struct UActorComponent* ReturnValue); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xc18b48
	void K2_AddActorLocalTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689c2a0
	void ReceiveAnyDamage(float Damage, struct U*0ad023d030* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689fdb4
	void K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x689db78
	void K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689bef0
	void *d85c70de6e(); // Function Engine.Actor.*d85c70de6e // Final|Native|Public|BlueprintCallable // @ game+0x689a744
	void *ef270d1a10(); // Function Engine.Actor.*ef270d1a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68997fc
	void *685e3b5cc9(); // Function Engine.Actor.*685e3b5cc9 // Native|Public|BlueprintCallable // @ game+0x68a9fd8
	void *581f8985e1(); // Function Engine.Actor.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x689e4d0
	void *32ee7138ab(); // Function Engine.Actor.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x68ac1f0
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x689ab8c
	void K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68a00e0
	void *91da404789(); // Function Engine.Actor.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0xd1a1d4
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x68921b0
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x68a63d0
	void K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x689f7cc
	void *87d1cdd662(); // Function Engine.Actor.*87d1cdd662 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x68abc08
	void *461623950c(); // Function Engine.Actor.*461623950c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689b200
};

// Class Engine.SkeletalMeshActor
// Size: 0x478 (Inherited: 0x3f0)
struct ASkeletalMeshActor : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	char bShouldDoAnimNotifies : 1; // 0x3f8(0x01)
	char bWakeOnLevelStart : 1; // 0x3f8(0x01)
	char pad_3F8_2 : 6; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x400(0x08)
	struct USkeletalMesh* *78ac740bab; // 0x408(0x08)
	struct UPhysicsAsset* *c076d8455d; // 0x410(0x08)
	struct UMaterialInterface* *30be61bd2f; // 0x418(0x08)
	struct UMaterialInterface* *a44e49c1f5; // 0x420(0x08)
	char pad_428[0x50]; // 0x428(0x50)

	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x5b7bdcc
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x5b7bde4
	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x5b419d0
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0x5aa9ca0
};

// Class Engine.DestructibleComponent
// Size: 0xd10 (Inherited: 0xc50)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc48(0x01)
	struct TArray<struct F*ab298b5726> FractureEffects; // 0xc50(0x10)
	bool bEnableHardSleeping; // 0xc60(0x01)
	char pad_C61_1 : 7; // 0xc61(0x01)
	char pad_C62[0x2]; // 0xc62(0x02)
	float LargeChunkThreshold; // 0xc64(0x04)
	char pad_C68[0x10]; // 0xc68(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xc78(0x10)
	char pad_C88[0x88]; // 0xc88(0x88)

	void *81619df15f(struct UDestructibleMesh* NewMesh); // Function Engine.DestructibleComponent.*81619df15f // Final|Native|Public|BlueprintCallable // @ game+0x68f3ae4
	void *c2a51a8aea(struct UDestructibleMesh* ReturnValue); // Function Engine.DestructibleComponent.*c2a51a8aea // Final|Native|Public|BlueprintCallable // @ game+0x68cd904
	void *15c3764f94(float BaseDamage, struct FVector HurtOrigin, float DamageRadius, float ImpulseStrength, bool bFullDamage); // Function Engine.DestructibleComponent.*15c3764f94 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68b5d58
	void *78cda25b7e(float DamageAmount, struct FVector HitLocation, struct FVector ImpulseDir, float ImpulseStrength); // Function Engine.DestructibleComponent.*78cda25b7e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68b4b5c
};

// Class Engine.SaveGame
// Size: 0x30 (Inherited: 0x30)
struct USaveGame : UObject {
};

// Class Engine.*a3b7e4d578
// Size: 0x9d0 (Inherited: 0x9b0)
struct U*a3b7e4d578 : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x9a8(0x04)
	struct UBodySetup* *03f0c31ef3; // 0x9b0(0x08)
	char *97e70e56df : 1; // 0x9b8(0x01)
	char *caf3bcb1ba : 1; // 0x9b8(0x01)
	char *25b1d2d4e0 : 1; // 0x9b8(0x01)
	char pad_9BC_3 : 5; // 0x9bc(0x01)
	char pad_9BD[0x3]; // 0x9bd(0x03)
	struct UClass* AreaClass; // 0x9c0(0x08)
	char pad_9C8[0x8]; // 0x9c8(0x08)
};

// Class Engine.GameStateBase
// Size: 0x430 (Inherited: 0x3f0)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x3f0(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x3f8(0x08)
	struct UClass* SpectatorClass; // 0x400(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x408(0x10)
	bool *d3c2be67c8; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float *97f1b2a6ec; // 0x41c(0x04)
	float *ad4174af37; // 0x420(0x04)
	float *f4803290f8; // 0x424(0x04)
	char pad_428[0x8]; // 0x428(0x08)

	void *30eff713e8(float ReturnValue); // Function Engine.GameStateBase.*30eff713e8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6898c7c
	void *c19ec27f91(); // Function Engine.GameStateBase.*c19ec27f91 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899eb8
	void *2ae46ac202(); // Function Engine.GameStateBase.*2ae46ac202 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6899e10
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0xb69170
	void *8c90983c69(); // Function Engine.GameStateBase.*8c90983c69 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b1ac28
	void *9c5ebaa37b(); // Function Engine.GameStateBase.*9c5ebaa37b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a87f48
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0x5b44a8c
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0xbffd48
	void *d4e79c9423(); // Function Engine.GameStateBase.*d4e79c9423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ae20
	void *9816c4a151(); // Function Engine.GameStateBase.*9816c4a151 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689add0
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xc9d95c
};

// Class Engine.GameState
// Size: 0x450 (Inherited: 0x430)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x430(0x08)
	struct FName PreviousMatchState; // 0x438(0x08)
	int32 ElapsedTime; // 0x440(0x04)
	char pad_444[0xc]; // 0x444(0x0c)

	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x5ae7cb0
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0xa5922c
};

// Class Engine.BoxComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UBoxComponent : U*a3b7e4d578 {
	struct FVector BoxExtent; // 0x9c8(0x0c)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	struct FVector *0211fba5c3(); // Function Engine.BoxComponent.*0211fba5c3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68d6130
	bool *f4af67cd92(); // Function Engine.BoxComponent.*f4af67cd92 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x68f1958
	struct FVector *6ed44cdd4c(); // Function Engine.BoxComponent.*6ed44cdd4c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68d3d54
};

// Class Engine.ProjectileMovementComponent
// Size: 0x310 (Inherited: 0x250)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x248(0x04)
	float MaxSpeed; // 0x24c(0x04)
	char bRotationFollowsVelocity : 1; // 0x250(0x01)
	char bShouldBounce : 1; // 0x250(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x250(0x01)
	char bForceSubStepping : 1; // 0x250(0x01)
	char bSimulationEnabled : 1; // 0x250(0x01)
	char bSweepCollision : 1; // 0x250(0x01)
	char bIsHomingProjectile : 1; // 0x250(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x250(0x01)
	char bIsSliding : 1; // 0x251(0x01)
	char bInterpMovement : 1; // 0x251(0x01)
	char bInterpRotation : 1; // 0x251(0x01)
	float PreviousHitTime; // 0x254(0x04)
	struct FVector PreviousHitNormal; // 0x258(0x0c)
	float ProjectileGravityScale; // 0x264(0x04)
	float *00c93b38f7; // 0x268(0x04)
	float Bounciness; // 0x26c(0x04)
	float Friction; // 0x270(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x274(0x04)
	float MinFrictionFraction; // 0x278(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x280(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x290(0x10)
	float HomingAccelerationMagnitude; // 0x2a0(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x2a4(0x08)
	float MaxSimulationTimeStep; // 0x2ac(0x04)
	int32 MaxSimulationIterations; // 0x2b0(0x04)
	int32 BounceAdditionalIterations; // 0x2b4(0x04)
	float InterpLocationTime; // 0x2b8(0x04)
	float InterpRotationTime; // 0x2bc(0x04)
	float InterpLocationMaxLagDistance; // 0x2c0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2c4(0x04)
	char pad_2C9[0x47]; // 0x2c9(0x47)

	struct FVector OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x20a5d0
	struct USceneComponent* *682b698b23(); // Function Engine.ProjectileMovementComponent.*682b698b23 // Native|Public|BlueprintCallable // @ game+0x68f7030
	struct FHitResult OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x20a5d0
	bool *417e40db25(); // Function Engine.ProjectileMovementComponent.*417e40db25 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68da2e8
	struct FVector LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68dd894
	struct FHitResult StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6905614
	struct FRotator *b0b3c27e08(); // Function Engine.ProjectileMovementComponent.*b0b3c27e08 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68e55a8
	void *8a3fcb4372(); // Function Engine.ProjectileMovementComponent.*8a3fcb4372 // Native|Public|BlueprintCallable // @ game+0x5b2280c
	struct FVector *ddf11306f9(); // Function Engine.ProjectileMovementComponent.*ddf11306f9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68fdbf8
	bool *d1c2c36cc0(); // Function Engine.ProjectileMovementComponent.*d1c2c36cc0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68dad58
};

// Class Engine.CurveBase
// Size: 0x38 (Inherited: 0x30)
struct UCurveBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.GameUserSettings
// Size: 0x118 (Inherited: 0x30)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x30(0x01)
	bool bUseDynamicResolution; // 0x31(0x01)
	char pad_32[0x4e]; // 0x32(0x4e)
	uint32 ResolutionSizeX; // 0x80(0x04)
	uint32 ResolutionSizeY; // 0x84(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	int32 WindowPosX; // 0x90(0x04)
	int32 WindowPosY; // 0x94(0x04)
	int32 FullscreenMode; // 0x98(0x04)
	int32 LastConfirmedFullscreenMode; // 0x9c(0x04)
	int32 PreferredFullscreenMode; // 0xa0(0x04)
	uint32 Version; // 0xa4(0x04)
	int32 AudioQualityLevel; // 0xa8(0x04)
	float FrameRateLimit; // 0xac(0x04)
	char pad_B0[0x4]; // 0xb0(0x04)
	int32 DesiredScreenWidth; // 0xb4(0x04)
	bool bUseDesiredScreenHeight; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DesiredScreenHeight; // 0xbc(0x04)
	float LastRecommendedScreenWidth; // 0xc0(0x04)
	float LastRecommendedScreenHeight; // 0xc4(0x04)
	float LastCPUBenchmarkResult; // 0xc8(0x04)
	float LastGPUBenchmarkResult; // 0xcc(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xd0(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xe0(0x10)
	float LastGPUBenchmarkMultiplier; // 0xf0(0x04)
	bool bUseHDRDisplayOutput; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	int32 HDRDisplayOutputNits; // 0xf8(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xfc(0x01)
	bool bGPUDebug; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0x100(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x108(0x10)

	void *f09878a527(bool bEnable, int32 DisplayNits); // Function Engine.GameUserSettings.*f09878a527 // Final|Native|Public|BlueprintCallable // @ game+0x6916a34
	void *7a77ec6483(bool ReturnValue); // Function Engine.GameUserSettings.*7a77ec6483 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x69233ec
	void *62bb0b9181(struct FIntPoint ReturnValue); // Function Engine.GameUserSettings.*62bb0b9181 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6919130
	void *16010d7314(bool ReturnValue); // Function Engine.GameUserSettings.*16010d7314 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x33a5e4
	void *a5e93d4853(bool bEnable); // Function Engine.GameUserSettings.*a5e93d4853 // Final|Native|Public|BlueprintCallable // @ game+0x692246c
	void *54584e1936(bool ReturnValue); // Function Engine.GameUserSettings.*54584e1936 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691bb00
	void *e3a237f6aa(int32 ReturnValue); // Function Engine.GameUserSettings.*e3a237f6aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691b0b8
	void *d62db2618b(); // Function Engine.GameUserSettings.*d62db2618b // Native|Public|BlueprintCallable // @ game+0xaf237c
	void *50d117aec6(float CurrentScaleNormalized, float CurrentScaleValue, float MinScaleValue, float MaxScaleValue); // Function Engine.GameUserSettings.*50d117aec6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x691a3d4
	void *52b88c9c83(); // Function Engine.GameUserSettings.*52b88c9c83 // Native|Public|BlueprintCallable // @ game+0x5b2cc64
	void *13d64b82da(float NewLimit); // Function Engine.GameUserSettings.*13d64b82da // Final|Native|Public|BlueprintCallable // @ game+0x692194c
	void *34bb69adfa(); // Function Engine.GameUserSettings.*34bb69adfa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6918c34
	void *f18a34db27(); // Function Engine.GameUserSettings.*f18a34db27 // Final|Native|Public|BlueprintCallable // @ game+0x6913b28
	void *bf934dae7a(); // Function Engine.GameUserSettings.*bf934dae7a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691b59c
	void *b6b6477ce1(); // Function Engine.GameUserSettings.*b6b6477ce1 // Native|Public|BlueprintCallable // @ game+0x691a0cc
	void *7398906ef8(); // Function Engine.GameUserSettings.*7398906ef8 // Final|Native|Public|BlueprintCallable // @ game+0x69219e4
	void *4deaae310e(); // Function Engine.GameUserSettings.*4deaae310e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x69183f8
	void *9685e14f57(); // Function Engine.GameUserSettings.*9685e14f57 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x69136e4
	void LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x69166b0
	void *4338d69a5b(); // Function Engine.GameUserSettings.*4338d69a5b // Final|Native|Public|BlueprintCallable // @ game+0x69216e8
	void *bc9926799e(); // Function Engine.GameUserSettings.*bc9926799e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6922028
	void *a8e280c616(); // Function Engine.GameUserSettings.*a8e280c616 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691badc
	void *ae46e29729(); // Function Engine.GameUserSettings.*ae46e29729 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6919bb8
	void *f90938b578(); // Function Engine.GameUserSettings.*f90938b578 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6918660
	void *56639da4d9(); // Function Engine.GameUserSettings.*56639da4d9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x691a5b4
	void *21dcbf64ef(); // Function Engine.GameUserSettings.*21dcbf64ef // Native|Public|BlueprintCallable // @ game+0x5b2cd14
	void *ab471d586e(); // Function Engine.GameUserSettings.*ab471d586e // Native|Public|BlueprintCallable // @ game+0x5b4fec4
	void *4c79fccc09(); // Function Engine.GameUserSettings.*4c79fccc09 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691a5d8
	void *a609aa78e1(); // Function Engine.GameUserSettings.*a609aa78e1 // Final|Native|Public|BlueprintCallable // @ game+0x6921824
	void *56cb0d0526(); // Function Engine.GameUserSettings.*56cb0d0526 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6918678
	void *4f7c4e69be(); // Function Engine.GameUserSettings.*4f7c4e69be // Final|Native|Public|BlueprintCallable // @ game+0x6920f78
	void *67e0825c74(); // Function Engine.GameUserSettings.*67e0825c74 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6918c08
	void *d6b3133478(); // Function Engine.GameUserSettings.*d6b3133478 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691ad60
	void *a14804f3fa(); // Function Engine.GameUserSettings.*a14804f3fa // Final|Native|Public|BlueprintCallable // @ game+0x6921cd8
	void *c71c9b8280(); // Function Engine.GameUserSettings.*c71c9b8280 // Final|Native|Public|BlueprintCallable // @ game+0x69220b4
	void *281d60d9bd(); // Function Engine.GameUserSettings.*281d60d9bd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6919630
	void *a498d39449(); // Function Engine.GameUserSettings.*a498d39449 // Final|Native|Public|BlueprintCallable // @ game+0x69218b0
	void GetResolutionScaleInformation(); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x691a1dc
	void *da4f81d627(); // Function Engine.GameUserSettings.*da4f81d627 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x69181cc
	void *a7688da407(); // Function Engine.GameUserSettings.*a7688da407 // Final|Native|Public|BlueprintCallable // @ game+0x6921e1c
	void *5ad2ec17ad(); // Function Engine.GameUserSettings.*5ad2ec17ad // Final|Native|Public|BlueprintCallable // @ game+0x69225e8
	void *7968528a88(); // Function Engine.GameUserSettings.*7968528a88 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6919ba4
	void *4c94344049(); // Function Engine.GameUserSettings.*4c94344049 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691b5d4
	void *5c14849ddf(float ReturnValue); // Function Engine.GameUserSettings.*5c14849ddf // Native|Public|BlueprintCallable // @ game+0x6918634
	void *e183b3cb37(int32 Value); // Function Engine.GameUserSettings.*e183b3cb37 // Native|Public|BlueprintCallable // @ game+0x68f297c
	void *3db9445308(int32 Value); // Function Engine.GameUserSettings.*3db9445308 // Final|Native|Public|BlueprintCallable // @ game+0x5b26fec
	void *92dcc7d375(struct FIntPoint ReturnValue); // Function Engine.GameUserSettings.*92dcc7d375 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6918614
	void *b5a9c7fe3c(); // Function Engine.GameUserSettings.*b5a9c7fe3c // Native|Public|BlueprintCallable // @ game+0x5b4feac
	void *d9d0600777(bool ReturnValue); // Function Engine.GameUserSettings.*d9d0600777 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691b578
	void *a27483cae9(bool bCheckForCommandLineOverrides); // Function Engine.GameUserSettings.*a27483cae9 // Final|Native|Public|BlueprintCallable // @ game+0x690ffd4
	void *4b36d81370(enum class EWindowMode ReturnValue); // Function Engine.GameUserSettings.*4b36d81370 // Final|Native|Static|Public|BlueprintCallable // @ game+0xd03934
	void *2120c68df5(int32 WorkScale, float CPUMultiplier, float GPUMultiplier); // Function Engine.GameUserSettings.*2120c68df5 // Native|Public|BlueprintCallable // @ game+0x69214ec
	void *0a1ea4b6ce(struct UGameUserSettings* ReturnValue); // Function Engine.GameUserSettings.*0a1ea4b6ce // Final|Native|Static|Public|BlueprintCallable // @ game+0x6918d34
	void *5405e8f3e5(); // Function Engine.GameUserSettings.*5405e8f3e5 // Final|Native|Public|BlueprintCallable // @ game+0x6921774
	void *3292c1651c(enum class EWindowMode ReturnValue); // Function Engine.GameUserSettings.*3292c1651c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691910c
	void *9786fe7e17(int32 Value); // Function Engine.GameUserSettings.*9786fe7e17 // Final|Native|Public|BlueprintCallable // @ game+0x692165c
	void *d55782ad36(int32 Value); // Function Engine.GameUserSettings.*d55782ad36 // Final|Native|Public|BlueprintCallable // @ game+0x6921c4c
	void SetResolutionScaleValue(int32 NewScaleValue); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x6921d88
	void *d319a7ba30(bool ReturnValue); // Function Engine.GameUserSettings.*d319a7ba30 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691ba98
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x5b4fe54
	void *179e926ab3(int32 Value); // Function Engine.GameUserSettings.*179e926ab3 // Final|Native|Public|BlueprintCallable // @ game+0x69223e0
	void *a70fd254a1(int32 ReturnValue); // Function Engine.GameUserSettings.*a70fd254a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691b0a4
	void *a36569de53(bool ReturnValue); // Function Engine.GameUserSettings.*a36569de53 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x691b5b0
	void *7216dd5245(); // Function Engine.GameUserSettings.*7216dd5245 // Native|Public|BlueprintCallable // @ game+0x6323a08
	void *871e12b97e(int32 ReturnValue); // Function Engine.GameUserSettings.*871e12b97e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x69181b8
	void *274fd91604(float ReturnValue); // Function Engine.GameUserSettings.*274fd91604 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6918c1c
};

// Class Engine.GameInstance
// Size: 0x1f0 (Inherited: 0x30)
struct UGameInstance : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	struct U*bd40d2e124* *bd40d2e124; // 0x48(0x08)
	struct U*d3391c2860* *d3391c2860; // 0x50(0x08)
	char pad_58[0xa8]; // 0x58(0xa8)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0x100(0x10)
	char pad_110[0xe0]; // 0x110(0xe0)

	void DebugCreatePlayer(int32 Param0); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x68c37b0
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x20a5d0
	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void HandleTravelError(enum class ETravelFailure FailureType); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void DebugRemovePlayer(int32 Param0); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x68c3844
	void HandleNetworkError(enum class ENetworkFailure FailureType, bool bIsServer); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x20a5d0
};

// Class Engine.TriggerBase
// Size: 0x3f8 (Inherited: 0x3f0)
struct ATriggerBase : AActor {
	struct U*a3b7e4d578* CollisionComponent; // 0x3f0(0x08)
};

// Class Engine.TriggerBox
// Size: 0x3f8 (Inherited: 0x3f8)
struct ATriggerBox : ATriggerBase {
	struct U*a3b7e4d578* CollisionComponent; // 0x3f0(0x08)
};

// Class Engine.CapsuleComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UCapsuleComponent : U*a3b7e4d578 {
	float CapsuleHalfHeight; // 0x9c8(0x04)
	float CapsuleRadius; // 0x9cc(0x04)
	float CapsuleHeight; // 0x9d0(0x04)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	struct FName *2e26aaaf30(); // Function Engine.CapsuleComponent.*2e26aaaf30 // Native|Public|BlueprintCallable // @ game+0x68a851c
	float *ef518e2bd2(); // Function Engine.CapsuleComponent.*ef518e2bd2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68d3e9c
	bool *bc3968cb8f(); // Function Engine.CapsuleComponent.*bc3968cb8f // Final|Native|Public|BlueprintCallable // @ game+0x68f1d00
	float *011d593501(); // Function Engine.CapsuleComponent.*011d593501 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d3dfc
	bool *26dc85d144(); // Function Engine.CapsuleComponent.*26dc85d144 // Final|Native|Public|BlueprintCallable // @ game+0x68f1dec
	float *bdde07625c(); // Function Engine.CapsuleComponent.*bdde07625c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d4204
	float *f8205dfbb2(); // Function Engine.CapsuleComponent.*f8205dfbb2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d6170
	float *0875f2063a(); // Function Engine.CapsuleComponent.*0875f2063a // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68d62b4
	bool *1e1f900e13(); // Function Engine.CapsuleComponent.*1e1f900e13 // Final|Native|Public|BlueprintCallable // @ game+0x68f1b6c
	enum class ECollisionResponse *3a3aa0f9aa(); // Function Engine.CapsuleComponent.*3a3aa0f9aa // Native|Public|BlueprintCallable // @ game+0x68a85b0
	float *2c7d490376(); // Function Engine.CapsuleComponent.*2c7d490376 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68d61ac
	float *9b7bc42e76(); // Function Engine.CapsuleComponent.*9b7bc42e76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d3db0
	enum class ECollisionResponse *67e552295b(); // Function Engine.CapsuleComponent.*67e552295b // Native|Public|BlueprintCallable // @ game+0x68a8648
	float *e181a1cfbd(); // Function Engine.CapsuleComponent.*e181a1cfbd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d6158
	float *e4b72b64f4(); // Function Engine.CapsuleComponent.*e4b72b64f4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d6194
	float *aed5587e4f(); // Function Engine.CapsuleComponent.*aed5587e4f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68d3e50
	float *a34ddecc70(); // Function Engine.CapsuleComponent.*a34ddecc70 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x68d3fd0
};

// Class Engine.PhysicsVolume
// Size: 0x440 (Inherited: 0x428)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x428(0x04)
	int32 Priority; // 0x42c(0x04)
	float FluidFriction; // 0x430(0x04)
	char bWaterVolume : 1; // 0x434(0x01)
	char bPhysicsOnContact : 1; // 0x434(0x01)
	char pad_434_2 : 6; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	bool *dd9a04a32f; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x7f0 (Inherited: 0x7a0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7a0(0x01)
	char *76e211aeb5 : 1; // 0x7a0(0x01)
	char pad_7A0_2 : 6; // 0x7a0(0x01)
	char pad_7A1[0x7]; // 0x7a1(0x07)
	struct U*dd9d99e533* *148f44aecb; // 0x7a8(0x08)
	char pad_7B0[0x20]; // 0x7b0(0x20)
	float SpeedScale; // 0x7d0(0x04)
	float InitialMaxSpeed; // 0x7d4(0x04)
	float InitialAccel; // 0x7d8(0x04)
	float InitialDecel; // 0x7dc(0x04)
	char pad_7E0[0x10]; // 0x7e0(0x10)

	void ReceiveOnActivate(struct APlayerController* OriginalPC); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x68ad1a8
	void *75c4cb893b(); // Function Engine.DebugCameraController.*75c4cb893b // Final|Native|Public|BlueprintCallable // @ game+0x68adfc0
	void *f6b8be8510(struct AActor* ReturnValue); // Function Engine.DebugCameraController.*f6b8be8510 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689a070
	void *35c773a147(float NewSpeedScale); // Function Engine.DebugCameraController.*35c773a147 // Final|Native|Public|BlueprintCallable // @ game+0x68ab0f4
	void ReceiveOnActorSelected(struct AActor* NewSelectedActor, struct FVector SelectHitLocation, struct FVector SelectHitNormal, struct FHitResult Hit); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	void ReceiveOnDeactivate(struct APlayerController* RestoredPC); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x20a5d0
};

// Class Engine.Channel
// Size: 0x70 (Inherited: 0x30)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x38]; // 0x38(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x70)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_78[0x2f8]; // 0x78(0x2f8)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_378[0x18]; // 0x378(0x18)
};

// Class Engine.NavigationObjectBase
// Size: 0x418 (Inherited: 0x3f0)
struct ANavigationObjectBase : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x3f8(0x08)
	struct UBillboardComponent* *1e66e18c2d; // 0x400(0x08)
	struct UBillboardComponent* *7b636d7ee5; // 0x408(0x08)
	char *0cf4674479 : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
};

// Class Engine.PlayerStart
// Size: 0x420 (Inherited: 0x418)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x418(0x08)
};

// Class Engine.CheatManager
// Size: 0x80 (Inherited: 0x30)
struct UCheatManager : UObject {
	struct ADebugCameraController* *7d926fcff8; // 0x30(0x08)
	struct UClass* DebugCameraControllerClass; // 0x38(0x08)
	char pad_40[0x40]; // 0x40(0x40)

	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x5b4fe54
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x6922a40
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x6916680
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0x5b2cc64
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x525484
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x6916394
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x691637c
	void *50dd42b97f(); // Function Engine.CheatManager.*50dd42b97f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6921610
	struct FString ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x6924a38
	struct FString Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x6923328
	void *700af58636(); // Function Engine.CheatManager.*700af58636 // Native|Protected|BlueprintCallable // @ game+0x6916698
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x6918010
	struct UClass* ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x69249a4
	float DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x69162e0
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x69241d8
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x5ad00a8
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x6921ba0
	float FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x6918028
	struct UClass* DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x69165ec
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x5b4fe94
	struct UClass* DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x6234cb0
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x5b4fe14
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x69205d0
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x691b50c
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x6916860
	struct FString CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x69137a8
	bool DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x691645c
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x6916878
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x6916444
	float SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x6921bb4
	struct FString BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x6911b18
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x69207e0
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x69241c0
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x5b45400
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x6916890
	struct FName StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x692306c
	enum class ECollisionChannel DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x69163ac
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x20a5d0
	void *3854a48cf0(); // Function Engine.CheatManager.*3854a48cf0 // Native|Protected|BlueprintCallable // @ game+0x6916928
	struct FName StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x6922fd8
	struct FName ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x6924910
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x5b44fe8
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0xab1c94
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x6923414
	struct FString BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x6911df8
	float ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x691370c
	float DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x691650c
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x6922674
	struct FName OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6920050
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0x69164f4
	float BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x6911bdc
};

// Class Engine.*e915f35194
// Size: 0x9c0 (Inherited: 0x9b0)
struct U*e915f35194 : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0x9b0(0x10)
};

// Class Engine.NavArea
// Size: 0x48 (Inherited: 0x30)
struct UNavArea : UObject {
	float DefaultCost; // 0x30(0x04)
	float FixedAreaEnteringCost; // 0x34(0x04)
	struct FColor DrawColor; // 0x38(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x3c(0x04)
	char bSupportsAgent0 : 1; // 0x40(0x01)
	char bSupportsAgent1 : 1; // 0x40(0x01)
	char bSupportsAgent2 : 1; // 0x40(0x01)
	char bSupportsAgent3 : 1; // 0x40(0x01)
	char bSupportsAgent4 : 1; // 0x40(0x01)
	char bSupportsAgent5 : 1; // 0x40(0x01)
	char bSupportsAgent6 : 1; // 0x40(0x01)
	char bSupportsAgent7 : 1; // 0x40(0x01)
	char bSupportsAgent8 : 1; // 0x41(0x01)
	char bSupportsAgent9 : 1; // 0x41(0x01)
	char bSupportsAgent10 : 1; // 0x41(0x01)
	char bSupportsAgent11 : 1; // 0x41(0x01)
	char bSupportsAgent12 : 1; // 0x41(0x01)
	char bSupportsAgent13 : 1; // 0x41(0x01)
	char bSupportsAgent14 : 1; // 0x41(0x01)
	char bSupportsAgent15 : 1; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x3f8 (Inherited: 0x3f0)
struct ALevelScriptActor : AActor {
	char *a7ca75b064 : 1; // 0x3f0(0x01)
	char pad_3F0_1 : 7; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)

	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x20a5d0
	void WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	void *5a504151cb(); // Function Engine.LevelScriptActor.*5a504151cb // Native|Public|BlueprintCallable // @ game+0xb8c748
	void *dcb17fb5d9(); // Function Engine.LevelScriptActor.*dcb17fb5d9 // Native|Public|BlueprintCallable // @ game+0x5b55e54
};

// Class Engine.ChildActorComponent
// Size: 0x4a0 (Inherited: 0x470)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x468(0x08)
	struct AActor* ChildActor; // 0x470(0x08)
	struct AActor* ChildActorTemplate; // 0x478(0x08)
	char pad_488[0x18]; // 0x488(0x18)

	struct UClass* *a0eca42e03(); // Function Engine.ChildActorComponent.*a0eca42e03 // Final|Native|Public|BlueprintCallable // @ game+0x68a8204
};

// Class Engine.CameraComponent
// Size: 0xa60 (Inherited: 0x470)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x468(0x04)
	float OrthoWidth; // 0x46c(0x04)
	float OrthoNearClipPlane; // 0x470(0x04)
	float OrthoFarClipPlane; // 0x474(0x04)
	float AspectRatio; // 0x478(0x04)
	char bConstrainAspectRatio : 1; // 0x47c(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x47c(0x01)
	char bLockToHmd : 1; // 0x47c(0x01)
	char bUsePawnControlRotation : 1; // 0x47c(0x01)
	enum class ECameraProjectionMode ProjectionMode; // 0x480(0x01)
	float PostProcessBlendWeight; // 0x484(0x04)
	char pad_489_4 : 4; // 0x489(0x01)
	char pad_48A[0x6]; // 0x48a(0x06)
	struct FPostProcessSettings PostProcessSettings; // 0x490(0x570)
	char pad_A00[0x58]; // 0xa00(0x58)
	char bUseControllerViewRotation : 1; // 0xa58(0x01)
	char pad_A58_1 : 7; // 0xa58(0x01)
	char pad_A59[0x7]; // 0xa59(0x07)

	void *3e8a28e83e(); // Function Engine.CameraComponent.*3e8a28e83e // Final|Native|Public|BlueprintCallable // @ game+0x68fd6b0
	void *ed3ee02381(); // Function Engine.CameraComponent.*ed3ee02381 // Final|Native|Public|BlueprintCallable // @ game+0x68f0388
	void *2cfadfbbf2(); // Function Engine.CameraComponent.*2cfadfbbf2 // Final|Native|Public|BlueprintCallable // @ game+0x68f2b90
	void *65b65a3f19(); // Function Engine.CameraComponent.*65b65a3f19 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x68cc37c
	void *1dc2d160f2(); // Function Engine.CameraComponent.*1dc2d160f2 // Final|Native|Public|BlueprintCallable // @ game+0x68f5194
	void *052965d968(); // Function Engine.CameraComponent.*052965d968 // Final|Native|Public|BlueprintCallable // @ game+0x68f9484
	void *cb2bddba68(); // Function Engine.CameraComponent.*cb2bddba68 // Final|Native|Public|BlueprintCallable // @ game+0x68fa2b8
	void *fc57e66de9(); // Function Engine.CameraComponent.*fc57e66de9 // Final|Native|Public|BlueprintCallable // @ game+0x68f9f2c
	void *a634495c79(); // Function Engine.CameraComponent.*a634495c79 // Final|Native|Public|BlueprintCallable // @ game+0x68f6e70
	void *47a266b8d3(); // Function Engine.CameraComponent.*47a266b8d3 // Final|Native|Public|BlueprintCallable // @ game+0x68f93ec
	void *fa132a0246(); // Function Engine.CameraComponent.*fa132a0246 // Final|Native|Public|BlueprintCallable // @ game+0x68b387c
};

// Class Engine.Engine
// Size: 0xf60 (Inherited: 0x30)
struct UEngine : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FStringAssetReference TinyFontName; // 0x40(0x10)
	struct UFont* SmallFont; // 0x50(0x08)
	struct FStringAssetReference SmallFontName; // 0x58(0x10)
	struct UFont* *507343f03f; // 0x68(0x08)
	struct FStringAssetReference MediumFontName; // 0x70(0x10)
	struct UFont* LargeFont; // 0x80(0x08)
	struct FStringAssetReference LargeFontName; // 0x88(0x10)
	struct UFont* *ae8c533874; // 0x98(0x08)
	struct FStringAssetReference SubtitleFontName; // 0xa0(0x10)
	struct TArray<struct UFont*> *bf37e23aad; // 0xb0(0x10)
	struct UClass* *bca32af458; // 0xc0(0x08)
	float RenderLightMapDensityGrayscaleScale; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct TArray<struct F*7decbe1dec> ActivePluginRedirects; // 0xd0(0x10)
	struct UMaterial* WireframeMaterial; // 0xe0(0x08)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0xe8(0x08)
	struct FColor *e67cf9003a; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0xf8(0x10)
	struct UClass* *398beed366; // 0x108(0x08)
	float RenderLightMapDensityColorScale; // 0x110(0x04)
	char bRenderLightMapDensityGrayscale : 1; // 0x114(0x01)
	char pad_114_1 : 7; // 0x114(0x01)
	char pad_115[0x3]; // 0x115(0x03)
	struct FColor *aea916ce36; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x120(0x10)
	struct UTexture2D* *6f11af224f; // 0x130(0x08)
	float MinDesiredFrameRate; // 0x138(0x04)
	char pad_13C[0x4]; // 0x13c(0x04)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x140(0x10)
	struct TArray<struct F*4fc053d54d> StatColorMappings; // 0x150(0x10)
	struct FColor *f3e6f5bfd3; // 0x160(0x04)
	char pad_164[0x4]; // 0x164(0x04)
	struct FStringClassReference GameViewportClientClassName; // 0x168(0x10)
	float CameraTranslationThreshold; // 0x178(0x04)
	struct FColor *5a2eee72e8; // 0x17c(0x04)
	struct FStringClassReference ConsoleClassName; // 0x180(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x190(0x10)
	float IdealLightMapDensity; // 0x1a0(0x04)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0x1a8(0x10)
	float PrimitiveProbablyVisibleTime; // 0x1b8(0x04)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x1bc(0x04)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0x1c0(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x1d0(0x08)
	struct UClass* *5df25eabe1; // 0x1d8(0x08)
	struct FStringAssetReference DefaultPhysMaterialName; // 0x1e0(0x10)
	struct UAssetManager* AssetManager; // 0x1f0(0x08)
	struct FString LevelColorationUnlitMaterialName; // 0x1f8(0x10)
	float MaxLightMapDensity; // 0x208(0x04)
	char pad_20C[0x8]; // 0x20c(0x08)
	struct FLinearColor LightingOnlyBrightness; // 0x214(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x224(0x10)
	char pad_234[0x4]; // 0x234(0x04)
	struct TArray<struct F*ca6e9f58f0> *665f43cd1a; // 0x238(0x10)
	struct FColor *52674cf283; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x250(0x10)
	struct FStringClassReference AIControllerClassName; // 0x260(0x10)
	struct UTexture2D* *acefe7e29a; // 0x270(0x08)
	struct F*a670be9e73 PhysicErrorCorrection; // 0x278(0x1c)
	char pad_294[0x4]; // 0x294(0x04)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x298(0x10)
	float NearClipPlane; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x2b0(0x10)
	float *8650eed282; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct FStringClassReference GameUserSettingsClassName; // 0x2c8(0x10)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x2d8(0x10)
	char pad_2E8[0x8]; // 0x2e8(0x08)
	struct UClass* *eac8e4cb12; // 0x2f0(0x08)
	struct FColor *8630e54ec6; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct FString *9c43f6ae30; // 0x300(0x10)
	struct UMaterialInstanceDynamic* *c9913ab955; // 0x310(0x08)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x318(0x10)
	struct FStringClassReference AvoidanceManagerClassName; // 0x328(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x338(0x04)
	char pad_33C[0x54]; // 0x33c(0x54)
	float NetClientTicksPerSecond; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	struct FString ShadedLevelColorationLitMaterialName; // 0x398(0x10)
	struct UMaterial* *e6d19dd636; // 0x3a8(0x08)
	int32 MaxParticleResizeWarn; // 0x3b0(0x04)
	char bSubtitlesEnabled : 1; // 0x3b4(0x01)
	char pad_3B4_1 : 7; // 0x3b4(0x01)
	char pad_3B5[0x3]; // 0x3b5(0x03)
	struct UMaterialInstanceDynamic* *2fc3307afc; // 0x3b8(0x08)
	struct UMaterial* *38f7dc552f; // 0x3c0(0x08)
	char bSubtitlesForcedOff : 1; // 0x3c8(0x01)
	char pad_3C8_1 : 7; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct FStringAssetReference LightMapDensityTextureName; // 0x3d0(0x10)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0x3e0(0x10)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0x3f0(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x400(0x10)
	float MeshLODRange; // 0x410(0x04)
	struct FColor *707f925d4e; // 0x414(0x04)
	struct UClass* *f097998e2e; // 0x418(0x08)
	int32 MaximumLoopIterationCount; // 0x420(0x04)
	char bHardwareSurveyEnabled : 1; // 0x424(0x01)
	char pad_424_1 : 7; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	float DisplayGamma; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0x430(0x10)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x440(0x10)
	int32 *ffcb6d7674; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)
	struct UTexture2D* DefaultTexture; // 0x458(0x08)
	struct FStringClassReference WorldSettingsClassName; // 0x460(0x10)
	struct FString VertexColorMaterialName; // 0x470(0x10)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0x480(0x10)
	char bCanBlueprintsTickByDefault : 1; // 0x490(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x490(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x490(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x490(0x01)
	char pad_490_4 : 1; // 0x490(0x01)
	char bSmoothFrameRate : 1; // 0x490(0x01)
	char bUseFixedFrameRate : 1; // 0x490(0x01)
	char pad_490_7 : 1; // 0x490(0x01)
	char pad_491[0x7]; // 0x491(0x07)
	struct UMaterialInstanceDynamic* *7e0f4b06ea; // 0x498(0x08)
	struct UMaterialInstanceDynamic* *d3f16fe233; // 0x4a0(0x08)
	struct FStringClassReference AssetManagerClassName; // 0x4a8(0x10)
	struct FStringClassReference LevelScriptActorClassName; // 0x4b8(0x10)
	struct UMaterialInstanceDynamic* *c12f2d2c67; // 0x4c8(0x08)
	struct TArray<struct F*53e10b7853> ActiveStructRedirects; // 0x4d0(0x10)
	struct FColor *0726a044a7; // 0x4e0(0x04)
	char pad_4E4[0x4]; // 0x4e4(0x04)
	struct UTexture* WeightMapPlaceholderTexture; // 0x4e8(0x08)
	struct FColor *e415b10ea1; // 0x4f0(0x04)
	char pad_4F4[0x4]; // 0x4f4(0x04)
	struct FString WireframeMaterialName; // 0x4f8(0x10)
	struct UClass* *ad8296b465; // 0x508(0x08)
	struct UClass* *802217e7fd; // 0x510(0x08)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x518(0x10)
	struct FString LightingTexelDensityName; // 0x528(0x10)
	struct UObject* *c09072c920; // 0x538(0x08)
	struct UTexture* DefaultDiffuseTexture; // 0x540(0x08)
	struct TArray<struct FString> *93075208c5; // 0x548(0x10)
	char pad_558[0x18]; // 0x558(0x18)
	struct UMaterial* *eae6f63fae; // 0x570(0x08)
	struct UTextureCube* *27c2cc10e6; // 0x578(0x08)
	struct UMaterial* *ab703d8f59; // 0x580(0x08)
	struct TArray<struct F*0ae4a8d9ad> ActiveGameNameRedirects; // 0x588(0x10)
	struct UTexture2D* *4da9fb7bb4; // 0x598(0x08)
	char bAllowMatureLanguage : 1; // 0x5a0(0x01)
	char pad_5A0_1 : 7; // 0x5a0(0x01)
	char pad_5A1[0x3]; // 0x5a1(0x03)
	float CameraRotationThreshold; // 0x5a4(0x04)
	struct UMaterialInstanceDynamic* *72154a0386; // 0x5a8(0x08)
	struct UMaterial* RemoveSurfaceMaterial; // 0x5b0(0x08)
	struct UMaterial* *4bb7c31cac; // 0x5b8(0x08)
	struct UGameUserSettings* GameUserSettings; // 0x5c0(0x08)
	struct FStringAssetReference MiniFontTextureName; // 0x5c8(0x10)
	struct TArray<struct FString> AdditionalFontNames; // 0x5d8(0x10)
	struct FColor *d70aaca090; // 0x5e8(0x04)
	struct FColor *563b988ac5; // 0x5ec(0x04)
	struct UClass* *493183b606; // 0x5f0(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x5f8(0x10)
	int32 *1869c29680; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct FString PlayOnConsoleSaveDir; // 0x610(0x10)
	struct UMaterialInstanceDynamic* *254455a899; // 0x620(0x08)
	float MaxOcclusionPixelsFraction; // 0x628(0x04)
	char pad_62C[0x4]; // 0x62c(0x04)
	struct FString LevelColorationLitMaterialName; // 0x630(0x10)
	struct UGameViewportClient* GameViewport; // 0x640(0x08)
	char bPauseOnLossOfFocus : 1; // 0x648(0x01)
	char pad_648_1 : 7; // 0x648(0x01)
	char pad_649[0x3]; // 0x649(0x03)
	int32 MaxParticleResize; // 0x64c(0x04)
	struct UMaterial* VertexColorMaterial; // 0x650(0x08)
	struct UTexture2D* *b064f85396; // 0x658(0x08)
	struct FString *2a2ef25c03; // 0x660(0x10)
	struct UMaterial* *9eae766840; // 0x670(0x08)
	struct UMaterial* LevelColorationLitMaterial; // 0x678(0x08)
	struct FStringClassReference NavigationSystemClassName; // 0x680(0x10)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x690(0x10)
	struct FLinearColor *3102132612; // 0x6a0(0x10)
	struct FLinearColor *bde2361a9e; // 0x6b0(0x10)
	struct FLinearColor *51c458ade6; // 0x6c0(0x10)
	struct FLinearColor *5ec7359838; // 0x6d0(0x10)
	bool *c803f0265e; // 0x6e0(0x01)
	char pad_6E1[0x3]; // 0x6e1(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x6e4(0x01)
	char *752ed78a39 : 1; // 0x6e4(0x01)
	char bSuppressMapWarnings : 1; // 0x6e4(0x01)
	char bDisableAILogging : 1; // 0x6e4(0x01)
	char pad_6E4_4 : 4; // 0x6e4(0x01)
	char pad_6E5[0x3]; // 0x6e5(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x6e8(0x04)
	struct FBox *bd784f0e4c; // 0x6ec(0x1c)
	char pad_708[0x4]; // 0x708(0x04)
	int32 *b6f2f8e636; // 0x70c(0x04)
	char *bdad3e99f4 : 1; // 0x710(0x01)
	char pad_710_1 : 7; // 0x710(0x01)
	char pad_711[0x7]; // 0x711(0x07)
	struct FString ParticleEventManagerClassPath; // 0x718(0x10)
	char pad_728[0x28]; // 0x728(0x28)
	float SelectionHighlightIntensity; // 0x750(0x04)
	float *c80ce80761; // 0x754(0x04)
	float BSPSelectionHighlightIntensity; // 0x758(0x04)
	float HoverHighlightIntensity; // 0x75c(0x04)
	float *dd881ac63c; // 0x760(0x04)
	float PrimitiveBaseIntensity; // 0x764(0x04)
	float PrimitiveSelectedIntensity; // 0x768(0x04)
	float PrimitiveHoverIntensity; // 0x76c(0x04)
	char pad_770[0x290]; // 0x770(0x290)
	struct UTexture2D* MiniFontTexture; // 0xa00(0x08)
	struct UMaterial* *3af804f5e4; // 0xa08(0x08)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0xa10(0x10)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0xa20(0x10)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0xa30(0x10)
	struct UMaterial* *3c832889f7; // 0xa40(0x08)
	struct FStringClassReference GameSingletonClassName; // 0xa48(0x10)
	struct FColor *244e026abb; // 0xa58(0x04)
	char pad_A5C[0x4]; // 0xa5c(0x04)
	struct UMaterial* *64c29e4c8e; // 0xa60(0x08)
	struct UClass* *86033d1ce7; // 0xa68(0x08)
	struct FStringAssetReference ArrowMaterialName; // 0xa70(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0xa80(0x10)
	char pad_A90[0x1d0]; // 0xa90(0x1d0)
	struct TArray<struct F*71c8b5597f> NetDriverDefinitions; // 0xc60(0x10)
	struct TArray<struct FString> ServerActors; // 0xc70(0x10)
	struct TArray<struct FString> *2ce8af1bee; // 0xc80(0x10)
	char *e86f62ac90 : 1; // 0xc90(0x01)
	char pad_C90_1 : 7; // 0xc90(0x01)
	char pad_C91[0x7]; // 0xc91(0x07)
	struct UTexture2D* *724b637f77; // 0xc98(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0xca0(0x10)
	struct FFloatRange SmoothedFrameRateRange; // 0xcb0(0x10)
	float FixedFrameRate; // 0xcc0(0x04)
	char pad_CC4[0x4]; // 0xcc4(0x04)
	struct UMaterial* DebugMeshMaterial; // 0xcc8(0x08)
	enum class *dcab1bab62 *20eca73099; // 0xcd0(0x01)
	char pad_CD1[0x7]; // 0xcd1(0x07)
	struct UMaterial* LevelColorationUnlitMaterial; // 0xcd8(0x08)
	struct FStringAssetReference DebugMeshMaterialName; // 0xce0(0x10)
	struct FStringClassReference LocalPlayerClassName; // 0xcf0(0x10)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0xd00(0x10)
	float MinLightMapDensity; // 0xd10(0x04)
	char pad_D14[0x4]; // 0xd14(0x04)
	struct FStringAssetReference DefaultTextureName; // 0xd18(0x10)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0xd28(0x10)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0xd38(0x01)
	char pad_D38_1 : 7; // 0xd38(0x01)
	char pad_D39[0x3]; // 0xd39(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0xd3c(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0xd40(0x01)
	char pad_D40_1 : 7; // 0xd40(0x01)
	char pad_D41[0x7]; // 0xd41(0x07)
	struct UMaterial* *2364035723; // 0xd48(0x08)
	struct UMaterial* *ed6cf214e5; // 0xd50(0x08)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0xd58(0x10)
	struct FColor *93d8306f3e; // 0xd68(0x04)
	int32 *0a40c80458; // 0xd6c(0x04)
	struct FStringAssetReference DefaultBokehTextureName; // 0xd70(0x10)
	struct TArray<struct F*c345caf06a> ActiveClassRedirects; // 0xd80(0x10)
	struct UTexture2D* *8f60aed062; // 0xd90(0x08)
	char pad_D98[0x18]; // 0xd98(0x18)
	int32 *d6c76d00bb; // 0xdb0(0x04)
	char pad_DB4[0x1ac]; // 0xdb4(0x1ac)
};

// Class Engine.*9f9daacaf2
// Size: 0x40 (Inherited: 0x30)
struct U*9f9daacaf2 : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x670 (Inherited: 0x40)
struct UGameViewportClient : U*9f9daacaf2 {
	char pad_40[0xf8]; // 0x40(0xf8)
	struct UConsole* *d90abf5355; // 0x138(0x08)
	char pad_140[0x250]; // 0x140(0x250)
	struct TArray<struct F*c7179e5679> *fc61f1b873; // 0x390(0x10)
	char pad_3A0[0x58]; // 0x3a0(0x58)
	struct UGameInstance* GameInstance; // 0x3f8(0x08)
	char pad_400[0x270]; // 0x400(0x270)

	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0xcf4d04
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x68b2688
	int32 SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x68f297c
};

// Class Engine.Console
// Size: 0x110 (Inherited: 0x30)
struct UConsole : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct ULocalPlayer* *5524a3c76c; // 0x40(0x08)
	struct UTexture2D* *f4becc10a3; // 0x48(0x08)
	struct UTexture2D* *75070b6094; // 0x50(0x08)
	char pad_58[0x18]; // 0x58(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x70(0x10)
	char pad_80[0x90]; // 0x80(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c8 (Inherited: 0x30)
struct UNetDriver : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct FString NetConnectionClassName; // 0x38(0x10)
	int32 MaxDownloadSize; // 0x48(0x04)
	char bClampListenServerTickRate : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32 NetServerMaxTickRate; // 0x50(0x04)
	int32 MaxInternetClientRate; // 0x54(0x04)
	int32 MaxClientRate; // 0x58(0x04)
	float ServerTravelPause; // 0x5c(0x04)
	float SpawnPrioritySeconds; // 0x60(0x04)
	float RelevantTimeout; // 0x64(0x04)
	float KeepAliveTime; // 0x68(0x04)
	float InitialConnectTimeout; // 0x6c(0x04)
	float ConnectionTimeout; // 0x70(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x74(0x04)
	bool bNoTimeouts; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UNetConnection* *7d547c567d; // 0x80(0x08)
	struct TArray<struct UNetConnection*> *e5213003a6; // 0x88(0x10)
	char pad_98[0x28]; // 0x98(0x28)
	struct UWorld* World; // 0xc0(0x08)
	struct UPackage* *08f3ae6a9a; // 0xc8(0x08)
	char pad_D0[0x20]; // 0xd0(0x20)
	struct UClass* *cac88d6246; // 0xf0(0x08)
	struct UProperty* *ea450d9b76; // 0xf8(0x08)
	struct UProperty* *662b5c1bdb; // 0x100(0x08)
	struct FName NetDriverName; // 0x108(0x08)
	char pad_110[0x8]; // 0x110(0x08)
	float Time; // 0x118(0x04)
	char pad_11C[0x3ac]; // 0x11c(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c8)
struct UDemoNetDriver : UNetDriver {
	char pad_4C8[0xf8]; // 0x4c8(0xf8)
	struct TMap<struct FString, struct F*2c11a2a2dc> *0468103a99; // 0x5c0(0x50)
	char pad_610[0x430]; // 0x610(0x430)
	bool *0efb4f545b; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc30 (Inherited: 0xb50)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*00296bd9df> PerInstanceSMData; // 0xb50(0x10)
	int32 InstancingRandomSeed; // 0xb60(0x04)
	int32 InstanceStartCullDistance; // 0xb64(0x04)
	int32 InstanceEndCullDistance; // 0xb68(0x04)
	char pad_B6C[0x4]; // 0xb6c(0x04)
	struct TArray<int32> *8ac0f5c877; // 0xb70(0x10)
	struct TArray<int32> *779539efbd; // 0xb80(0x10)
	char pad_B90[0x78]; // 0xb90(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xc08(0x08)
	bool *b3b71326a9; // 0xc10(0x01)
	char pad_C11[0x3]; // 0xc11(0x03)
	int32 *9ff5d4ad59; // 0xc14(0x04)
	struct TArray<struct F*cf35bf3a14> *a62ebc8109; // 0xc18(0x10)
	char pad_C28[0x8]; // 0xc28(0x08)

	int32 *af6477ee17(); // Function Engine.InstancedStaticMeshComponent.*af6477ee17 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68b3248
	bool *91e4299bf1(); // Function Engine.InstancedStaticMeshComponent.*91e4299bf1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68f68e8
	bool *068cda575c(); // Function Engine.InstancedStaticMeshComponent.*068cda575c // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x69075d4
	int32 *6676b9aa35(); // Function Engine.InstancedStaticMeshComponent.*6676b9aa35 // Final|Native|Public|BlueprintCallable // @ game+0x68f352c
	struct TArray<int32> *e298126c80(); // Function Engine.InstancedStaticMeshComponent.*e298126c80 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68d0038
	int32 *be3ae800fc(); // Function Engine.InstancedStaticMeshComponent.*be3ae800fc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68b3688
	void *f58b7ec745(); // Function Engine.InstancedStaticMeshComponent.*f58b7ec745 // Native|Public|BlueprintCallable // @ game+0x5b21038
	int32 *4b502e7200(); // Function Engine.InstancedStaticMeshComponent.*4b502e7200 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68cf0e0
	bool *cf01ee4c9a(); // Function Engine.InstancedStaticMeshComponent.*cf01ee4c9a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68cf2c0
	bool *765b562637(); // Function Engine.InstancedStaticMeshComponent.*765b562637 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68cf744
	struct TArray<int32> *a978c20ae5(); // Function Engine.InstancedStaticMeshComponent.*a978c20ae5 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68cfed0
	bool *e1ee01c104(); // Function Engine.InstancedStaticMeshComponent.*e1ee01c104 // Native|Public|BlueprintCallable // @ game+0x68ecc48
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xd60 (Inherited: 0xc30)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C30[0x68]; // 0xc30(0x68)
	struct TArray<int32> *5476f2f76f; // 0xc98(0x10)
	int32 *e097f8dc22; // 0xca8(0x04)
	char pad_CAC[0x4]; // 0xcac(0x04)
	struct FBox *73116382bf; // 0xcb0(0x1c)
	struct FBox *0a7014d240; // 0xccc(0x1c)
	struct TArray<struct FBox> *36aef9bc89; // 0xce8(0x10)
	char pad_CF8[0x20]; // 0xcf8(0x20)
	int32 *03b06dfb87; // 0xd18(0x04)
	struct FBoxSphereBounds *df22e79645; // 0xd1c(0x1c)
	char *515f2592b9 : 1; // 0xd38(0x01)
	char *d571b06104 : 1; // 0xd38(0x01)
	char pad_D38_2 : 6; // 0xd38(0x01)
	char pad_D39[0x27]; // 0xd39(0x27)

	bool *0c79aede64(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*0c79aede64 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68eccec
};

// Class Engine.GameEngine
// Size: 0xfc0 (Inherited: 0xf60)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf58(0x04)
	float ServerFlushLogInterval; // 0xf5c(0x04)
	struct UGameInstance* GameInstance; // 0xf60(0x08)
	char pad_F70[0x38]; // 0xf70(0x38)
	struct TArray<struct UWorld*> *7be9bd717a; // 0xfa8(0x10)
	char pad_FB8[0x8]; // 0xfb8(0x08)
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
struct UPlayer : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	int32 *c8c4b728e8; // 0x40(0x04)
	int32 ConfiguredInternetSpeed; // 0x44(0x04)
	int32 ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.NetConnection
// Size: 0x65850 (Inherited: 0x50)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UClass* *7cc253e76a; // 0x68(0x08)
	struct UPackageMap* PackageMap; // 0x70(0x08)
	struct TArray<struct UChannel*> *e44c91181f; // 0x78(0x10)
	struct TArray<struct AActor*> *274863db2e; // 0x88(0x10)
	struct AActor* ViewTarget; // 0x98(0x08)
	struct AActor* *5e3a3b3f66; // 0xa0(0x08)
	int32 *260ba92558; // 0xa8(0x04)
	char *f5fadd2d69 : 1; // 0xac(0x01)
	char pad_AC_1 : 1; // 0xac(0x01)
	char *1194f7a57c : 1; // 0xac(0x01)
	char pad_AC_3 : 5; // 0xac(0x01)
	char pad_AD[0x8b]; // 0xad(0x8b)
	struct TArray<struct UChannel*> *8a96153c21; // 0x138(0x10)
	char pad_148[0x28]; // 0x148(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x170(0x18)
	char pad_188[0x68]; // 0x188(0x68)
	double *a564cf33c7; // 0x1f0(0x08)
	char pad_1F8[0x65538]; // 0x1f8(0x65538)
	struct TArray<struct UChannel*> *c638db3738; // 0x65730(0x10)
	char pad_65740[0x110]; // 0x65740(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x48 (Inherited: 0x30)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*ef998f31f9> ChannelDetails; // 0x30(0x10)
	float Duration; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.GameSession
// Size: 0x408 (Inherited: 0x3f0)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x3f0(0x04)
	int32 MaxPlayers; // 0x3f4(0x04)
	int32 *b4f47afb15; // 0x3f8(0x04)
	bool MaxSplitscreensPerConnection; // 0x3fc(0x01)
	bool bRequiresPushToTalk; // 0x3fd(0x01)
	char pad_3FE[0x2]; // 0x3fe(0x02)
	struct FName SessionName; // 0x400(0x08)
};

// Class Engine.*6915f10115
// Size: 0xd60 (Inherited: 0xd60)
struct U*6915f10115 : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xd58(0x04)
};

// Class Engine.NavLinkProxy
// Size: 0x440 (Inherited: 0x3f0)
struct ANavLinkProxy : AActor {
	char pad_3F0[0x10]; // 0x3f0(0x10)
	struct TArray<struct FNavigationLink> PointLinks; // 0x400(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks; // 0x410(0x10)
	struct UNavLinkCustomComponent* SmartLinkComp; // 0x420(0x08)
	bool *4a699c1124; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct FMulticastDelegate OnSmartLinkReached; // 0x430(0x10)

	struct FVector ReceiveSmartLinkReached(); // Function Engine.NavLinkProxy.ReceiveSmartLinkReached // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
	bool *8e0ffa0cec(); // Function Engine.NavLinkProxy.*8e0ffa0cec // Final|Native|Public|BlueprintCallable // @ game+0x68abd5c
	struct AActor* *65cee31bae(); // Function Engine.NavLinkProxy.*65cee31bae // Final|Native|Public|BlueprintCallable // @ game+0x68a3664
	bool *d4d460f675(); // Function Engine.NavLinkProxy.*d4d460f675 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689bd8c
	bool *8a49c9c7d5(); // Function Engine.NavLinkProxy.*8a49c9c7d5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x689ae48
	void *213ddab35f(); // Function Engine.NavLinkProxy.*213ddab35f // Final|Native|Public // @ game+0xcc1968
};

// Class Engine.LocalPlayer
// Size: 0x290 (Inherited: 0x50)
struct ULocalPlayer : UPlayer {
	char pad_50[0x28]; // 0x50(0x28)
	struct UClass* *cf7a7c7fa4; // 0x78(0x08)
	char pad_80[0x90]; // 0x80(0x90)
	char *4f02c33d6e : 1; // 0x110(0x01)
	char pad_110_1 : 7; // 0x110(0x01)
	char pad_111[0x17f]; // 0x111(0x17f)
};

// Class Engine.NavModifierVolume
// Size: 0x438 (Inherited: 0x428)
struct ANavModifierVolume : AVolume {
	char pad_428[0x8]; // 0x428(0x08)
	struct UClass* AreaClass; // 0x430(0x08)

	void *b0af645c38(); // Function Engine.NavModifierVolume.*b0af645c38 // Final|Native|Public|BlueprintCallable // @ game+0x68a6c64
};

// Class Engine.*995c5bd3c5
// Size: 0x30 (Inherited: 0x30)
struct U*995c5bd3c5 : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1d00 (Inherited: 0x3f0)
struct APlayerCameraManager : AActor {
	struct APlayerController* *cbb1abb503; // 0x3f0(0x08)
	struct USceneComponent* TransformComponent; // 0x3f8(0x08)
	struct F*67dd5045be *973c315985; // 0x400(0x5e0)
	char pad_9E0[0x18]; // 0x9e0(0x18)
	float DefaultOrthoWidth; // 0x9f8(0x04)
	char pad_9FC[0x4]; // 0x9fc(0x04)
	float DefaultAspectRatio; // 0xa00(0x04)
	char pad_A04[0x4]; // 0xa04(0x04)
	struct TArray<struct UClass*> DefaultModifiers; // 0xa08(0x10)
	float ViewYawMin; // 0xa18(0x04)
	char pad_A1C[0xc]; // 0xa1c(0x0c)
	float FreeCamDistance; // 0xa28(0x04)
	char pad_A2C[0x10]; // 0xa2c(0x10)
	struct FVector ViewTargetOffset; // 0xa3c(0x0c)
	char pad_A48[0x8]; // 0xa48(0x08)
	struct F*506119bf4d *afbcd45916; // 0xa50(0x5d0)
	char pad_1020[0x14]; // 0x1020(0x14)
	float ViewRollMin; // 0x1034(0x04)
	char pad_1038[0x4]; // 0x1038(0x04)
	float ViewPitchMax; // 0x103c(0x04)
	struct TArray<struct U*5ff6efacd0*> *61fd6ce2ce; // 0x1040(0x10)
	char pad_1050[0x10]; // 0x1050(0x10)
	struct F*506119bf4d *086e7720b6; // 0x1060(0x5d0)
	float ViewPitchMin; // 0x1630(0x04)
	struct FVector FreeCamOffset; // 0x1634(0x0c)
	float DefaultFOV; // 0x1640(0x04)
	char pad_1644[0xc]; // 0x1644(0x0c)
	struct F*67dd5045be ViewTarget; // 0x1650(0x5e0)
	struct TArray<struct AEmitterCameraLensEffectBase*> *400b25e039; // 0x1c30(0x10)
	struct U*f2efdc3e42* *cd0bb6c040; // 0x1c40(0x08)
	struct U*d3f66f5eff* *366f414e61[0x08]; // 0x1c48(0x40)
	struct TArray<struct FPostProcessSettings> *5ecc4759ed; // 0x1c88(0x10)
	char pad_1C98[0x10]; // 0x1c98(0x10)
	struct TArray<struct U*d3f66f5eff*> *550f662a17; // 0x1ca8(0x10)
	struct TArray<struct U*d3f66f5eff*> *2bbafcfe72; // 0x1cb8(0x10)
	struct ACameraActor* *7a77fb1011; // 0x1cc8(0x08)
	char bIsOrthographic : 1; // 0x1cd0(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x1cd0(0x01)
	char pad_1CD0_2 : 5; // 0x1cd0(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1cd0(0x01)
	char pad_1CD1[0x3]; // 0x1cd1(0x03)
	float ViewYawMax; // 0x1cd4(0x04)
	char pad_1CD8[0x20]; // 0x1cd8(0x20)
	float ViewRollMax; // 0x1cf8(0x04)
	char pad_1CFC[0x4]; // 0x1cfc(0x04)

	void *d72ed20b0c(struct UClass* ShakeClass, float Scale); // Function Engine.PlayerCameraManager.*d72ed20b0c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x8cace4
	void *d36a44000d(); // Function Engine.PlayerCameraManager.*d36a44000d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6895bac
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5aa9ca0
	void *78e591ace3(); // Function Engine.PlayerCameraManager.*78e591ace3 // Native|Public|BlueprintCallable // @ game+0x68ad750
	void *2a26303c57(); // Function Engine.PlayerCameraManager.*2a26303c57 // Native|Public|BlueprintCallable // @ game+0x6893fc0
	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5b7bde4
	void *b292c5da71(); // Function Engine.PlayerCameraManager.*b292c5da71 // Native|Public|BlueprintCallable // @ game+0x68adbd8
	void *69965e09a8(); // Function Engine.PlayerCameraManager.*69965e09a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68aa548
	void *2988a7cb08(); // Function Engine.PlayerCameraManager.*2988a7cb08 // Native|Public|BlueprintCallable // @ game+0x68a2ed4
	void *665cee3c9b(); // Function Engine.PlayerCameraManager.*665cee3c9b // Native|Public|BlueprintCallable // @ game+0x688c084
	void PhotographyCameraModify(); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x68a1f6c
	void *8c09008e7d(); // Function Engine.PlayerCameraManager.*8c09008e7d // Native|Public|BlueprintCallable // @ game+0x688d4a0
	void *bb6cf3b047(); // Function Engine.PlayerCameraManager.*bb6cf3b047 // Native|Public|BlueprintCallable // @ game+0x68adadc
	void *f2772d70c2(); // Function Engine.PlayerCameraManager.*f2772d70c2 // Native|Public|BlueprintCallable // @ game+0x68ad880
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5b7bdcc
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5b419d0
	void *8b2eaca224(); // Function Engine.PlayerCameraManager.*8b2eaca224 // Native|Public|BlueprintCallable // @ game+0x68ad7e8
	void *7fd72b3b48(); // Function Engine.PlayerCameraManager.*7fd72b3b48 // Native|Public|BlueprintCallable // @ game+0x68ad964
	void *a2a77b6a01(); // Function Engine.PlayerCameraManager.*a2a77b6a01 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68ad44c
	void *2fbc2ae8e6(); // Function Engine.PlayerCameraManager.*2fbc2ae8e6 // Native|Public|BlueprintCallable // @ game+0x68a2e40
	void *71d0b4dd39(enum class ECameraAnimPlaySpace PlaySpace, struct FRotator UserPlaySpaceRot, struct U*d3f66f5eff* ReturnValue); // Function Engine.PlayerCameraManager.*71d0b4dd39 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x68a2300
	void *9335482b6a(); // Function Engine.PlayerCameraManager.*9335482b6a // Native|Public|BlueprintCallable // @ game+0x688ead8
	void *f76c6f11ba(struct APlayerController* ReturnValue); // Function Engine.PlayerCameraManager.*f76c6f11ba // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5b3ea54
	void *d3c1b5233d(struct FVector ReturnValue); // Function Engine.PlayerCameraManager.*d3c1b5233d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x33a9ec
	void *cf60453f72(); // Function Engine.PlayerCameraManager.*cf60453f72 // Native|Public|BlueprintCallable // @ game+0x68adbc0
	void *5ca65a21f0(float ReturnValue); // Function Engine.PlayerCameraManager.*5ca65a21f0 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6896bb8
	void BlueprintUpdateCamera(struct AActor* CameraTarget, struct FVector NewCameraLocation, struct FRotator NewCameraRotation, float NewCameraFOV, bool ReturnValue); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x20a5d0
};

// Class Engine.PlayerInput
// Size: 0x490 (Inherited: 0x30)
struct UPlayerInput : UObject {
	char pad_30[0xf8]; // 0x30(0xf8)
	struct TArray<struct F*bddce5acd0> DebugExecBindings; // 0x128(0x10)
	char pad_138[0x30]; // 0x138(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x168(0x10)
	char pad_178[0x318]; // 0x178(0x318)

	struct FName InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x689b034
	struct FString SetBind(); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x68a7c90
