// WidgetBlueprintGeneratedClass HoldableKeyImageWIdgetBP.HoldableKeyImageWidgetBP_C
// Size: 0x4d0 (Inherited: 0x4d0)
struct UHoldableKeyImageWidgetBP_C : U*6c72c8fd80 {
	struct UImage* KeyboardHoldSpinner; // 0x470(0x08)
	struct U*d519ef66f2* KeyboardHoldSpinnerPanel; // 0x478(0x08)
	struct UImage* MouseHoldSpinner; // 0x480(0x08)
	struct U*d519ef66f2* MouseHoldSpinnerPanel; // 0x488(0x08)
	struct UImage* DoubleTapImage; // 0x490(0x08)
	struct UImage* HoldTriangleImage; // 0x498(0x08)
	struct U*9c8bfa0aee* HoldAnimation; // 0x4a0(0x08)
	struct UMaterialParameterCollection* InteractionHoldMPC; // 0x4a8(0x08)
	float HoldDuration; // 0x4b0(0x04)
	float *ce46de861d; // 0x4b4(0x04)
	bool *b77fa48714; // 0x4b8(0x01)
	bool *1b77394d6a; // 0x4b9(0x01)
	bool *06fea4f588; // 0x4ba(0x01)
	enum class EKeyboardKeyIconDisplayType DisplayType; // 0x4bb(0x01)
	struct FName ActionName; // 0x4c0(0x08)

	bool HoldKeyboard(); // Function TslGame.*6c72c8fd80.HoldKeyboard // Final|Native|Protected // @ game+0x5a86ec8
};

