// BlueprintGeneratedClass M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C
// Size: 0x4a8 (Inherited: 0x478)
struct AM_Flashbang_Blind_01_BP_C : ATslPostProcessEffect {
	struct F*a6c93df757 UberGraphFrame; // 0x478(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x480(0x08)
	float _____1______0_AFF6D5134D79CE6B543B1D8991A51AF6; // 0x488(0x04)
	enum class ETimelineDirection _____1__Direction_AFF6D5134D79CE6B543B1D8991A51AF6; // 0x48c(0x01)
	char pad_48D[0x3]; // 0x48d(0x03)
	struct UTimelineComponent* АР„З|·xЗ_2; // 0x490(0x08)
	float _____0______0_2FD5CA0D48A747A9C536689E48D8A2F7; // 0x498(0x04)
	enum class ETimelineDirection _____0__Direction_2FD5CA0D48A747A9C536689E48D8A2F7; // 0x49c(0x01)
	char pad_49D[0x3]; // 0x49d(0x03)
	struct UTimelineComponent* АР„З|·xЗ_1; // 0x4a0(0x08)

	void UserConstructionScript(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x20a5d0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x20a5d0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x20a5d0
	void АР„З|·xЗ_(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.АР„З|·xЗ_ // BlueprintEvent // @ game+0x20a5d0
	void ReceiveBeginPlay(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	void ExecuteUbergraph_M_Flashbang_Blind_01_BP(); // Function M_Flashbang_Blind_01_BP.M_Flashbang_Blind_01_BP_C.ExecuteUbergraph_M_Flashbang_Blind_01_BP //  // @ game+0x20a5d0
};

