// BlueprintGeneratedClass P_Environment_Smoke_03_BP_Lobby.P_Environment_Smoke_03_BP_Lobby_C
// Size: 0x584 (Inherited: 0x510)
struct AP_Environment_Smoke_03_BP_Lobby_C : ATslParticleEnvironment {
	struct FVector SpawnBoxMax; // 0x510(0x0c)
	struct FVector SpawnBoxMin; // 0x51c(0x0c)
	struct FVector Color; // 0x528(0x0c)
	float SpawnRate; // 0x534(0x04)
	struct FVector SizeMax; // 0x538(0x0c)
	struct FVector SizeMin; // 0x544(0x0c)
	struct FVector VelocityMax; // 0x550(0x0c)
	struct FVector VelocityMin; // 0x55c(0x0c)
	float LifeTime; // 0x568(0x04)
	float LifeTimeLow; // 0x56c(0x04)
	float PannerTime; // 0x570(0x04)
	float PannerTimeLow; // 0x574(0x04)
	float Alpha; // 0x578(0x04)
	float RotationRateMax; // 0x57c(0x04)
	float RotationRateMin; // 0x580(0x04)
};

