// WidgetBlueprintGeneratedClass RichTextBlockWidget.RichTextBlockWidget_C
// Size: 0x650 (Inherited: 0x650)
struct URichTextBlockWidget_C : UTslRichTextBlock {
	struct FText *d98ceb8ab9; // 0x418(0x18)
	struct TMap<struct FString, struct F*feed846651> *4f86022916; // 0x430(0x50)
	struct FSlateFontInfo FontInfo; // 0x480(0x68)
	struct FSlateColor *3a365a80dc; // 0x4e8(0x28)
	struct FVector2D *b678334218; // 0x510(0x08)
	struct FLinearColor *4b5afa515a; // 0x518(0x10)
	float *d5b79ffbd0; // 0x528(0x04)
	bool *a6bad57440; // 0x52c(0x01)
	float *d3e257b478; // 0x530(0x04)
	enum class *d58a605dcf *253cd5f7d9; // 0x534(0x01)
	bool *c0d99407a2; // 0x535(0x01)
	enum class EVerticalAlignment *98507602d8; // 0x537(0x01)
	struct FSlateChildSize *e82bf78ba8; // 0x538(0x08)
	float *6bc82862ef; // 0x540(0x04)
	struct FSlateChildSize *437cc85083; // 0x544(0x08)
	struct FVector2D *60d734f4bb; // 0x54c(0x08)
	struct UVerticalBox* MainVerticalBox; // 0x558(0x08)
	struct TArray<struct USpacer*> *c0723ebe81; // 0x560(0x10)
	struct TArray<struct UHorizontalBox*> *e7504a760f; // 0x570(0x10)
	struct TArray<struct UTextBlock*> *cbd697f24d; // 0x580(0x10)
	struct TArray<struct UImage*> *4831d65dc3; // 0x590(0x10)
	struct TArray<struct USizeBox*> *ff8d5e0dfe; // 0x5a0(0x10)
	struct TArray<struct UOverlay*> *ea2fd9cd56; // 0x5b0(0x10)
	struct UHorizontalBox* *4a410cb865; // 0x5c0(0x08)
	struct UClass* KeyIconWidgetClass; // 0x5d8(0x08)
	struct TMap<struct FName, struct F*0e386b8768> *f8485fd752; // 0x5f8(0x50)

	void UpdateText(); // Function TslGame.TslRichTextBlock.UpdateText // Final|Native|Public|BlueprintCallable // @ game+0x5a9ada0
};

