// BlueprintGeneratedClass StatMapLocations.StatMapLocations_C
// Size: 0x4bc (Inherited: 0x3f0)
struct AStatMapLocations_C : AActor {
	struct F*a6c93df757 UberGraphFrame; // 0x3f0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3f8(0x08)
	int32 CurrentLocationNumber; // 0x400(0x04)
	char pad_404[0xc]; // 0x404(0x0c)
	struct FTransform CurrentTransform; // 0x410(0x30)
	float DelayBeforeStatCheck; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct TArray<struct FString> BeginConsoleCommands; // 0x448(0x10)
	struct TArray<struct FString> StatGroups; // 0x458(0x10)
	float DelayTimeAfterTeleport; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct TArray<struct FString> StatCounterNames; // 0x470(0x10)
	struct TArray<struct FString> StatCycleNames; // 0x480(0x10)
	struct UStatLocationsWidget_C* StatsWidget; // 0x490(0x08)
	struct TArray<struct FString> StatsOutputArray; // 0x498(0x10)
	struct TArray<struct FTransform> MapLocations; // 0x4a8(0x10)
	float StartupDelay; // 0x4b8(0x04)

	void AppendStatDataToColumnNames(); // Function StatMapLocations.StatMapLocations_C.AppendStatDataToColumnNames // Public|HasOutParms|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void GetCurrentLevelLocations(); // Function StatMapLocations.StatMapLocations_C.GetCurrentLevelLocations // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void GetMapLocations(struct FVector CallFunc_MakeVector_ReturnValue2, struct FVector CallFunc_MakeVector_ReturnValue3, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, int32 ___int_Loop_Counter_Variable3, struct FRotator CallFunc_MakeRotator_ReturnValue, bool CallFunc__045254c93f_ReturnValue3, int32 CallFunc__f53d173295_ReturnValue3, struct FRotator CallFunc_MakeRotator_ReturnValue2, struct FRotator CallFunc_MakeRotator_ReturnValue3); // Function StatMapLocations.StatMapLocations_C.GetMapLocations // Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void CreateStatWidget(struct UStatLocationsWidget_C* CallFunc_Create_ReturnValue); // Function StatMapLocations.StatMapLocations_C.CreateStatWidget // Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void GatherStats(struct TArray<struct FString> Output, struct TArray<struct FString> outputString, int32 ___int_Loop_Counter_Variable, int32 CallFunc__f53d173295_ReturnValue, int32 ___int_Array_Index_Variable, int32 ___int_Array_Index_Variable2, struct FString CallFunc_Array_Get_Item, struct TArray<int32> CallFunc__5efdbe93a1_CallCounts, struct TArray<float> CallFunc__5efdbe93a1_InclusiveAvg, struct TArray<float> CallFunc__5efdbe93a1_InclusiveMax, bool CallFunc__5efdbe93a1_ReturnValue, int32 CallFunc__34ad69eaa1_ReturnValue, float CallFunc_Array_Get_Item2, float CallFunc_Array_Get_Item3, struct FString CallFunc__e22fa5e649_ReturnValue, struct FString CallFunc__e22fa5e649_ReturnValue2, struct FString CallFunc__a4f37e3e14_ReturnValue, struct FString CallFunc__a4f37e3e14_ReturnValue2, int32 CallFunc_Array_Get_Item4, struct FString CallFunc__cc353e651f_ReturnValue, int32 ___int_Loop_Counter_Variable2, struct FString CallFunc__a4f37e3e14_ReturnValue3, struct FString CallFunc__a4f37e3e14_ReturnValue4, bool CallFunc__045254c93f_ReturnValue, struct FString CallFunc__a4f37e3e14_ReturnValue5, struct FString CallFunc__a4f37e3e14_ReturnValue6, int32 CallFunc__f53d173295_ReturnValue2, struct FString CallFunc__a4f37e3e14_ReturnValue7, struct FString CallFunc__a4f37e3e14_ReturnValue8, int32 CallFunc_Array_Add_ReturnValue, struct FString CallFunc_Array_Get_Item5, struct TArray<int32> CallFunc__5efdbe93a1_CallCounts2, struct TArray<float> CallFunc__5efdbe93a1_InclusiveAvg2, struct TArray<float> CallFunc__5efdbe93a1_InclusiveMax2, bool CallFunc__5efdbe93a1_ReturnValue2, int32 CallFunc__34ad69eaa1_ReturnValue2, float CallFunc_Array_Get_Item6, bool CallFunc__045254c93f_ReturnValue2, struct FString CallFunc__e22fa5e649_ReturnValue3, struct FString CallFunc__a4f37e3e14_ReturnValue9, float CallFunc_Array_Get_Item7, int32 CallFunc_Array_Get_Item8); // Function StatMapLocations.StatMapLocations_C.GatherStats // Public|HasOutParms|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void SetCurrentTransform(); // Function StatMapLocations.StatMapLocations_C.SetCurrentTransform // Public|HasDefaults|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void CheckPlayerTransform(); // Function StatMapLocations.StatMapLocations_C.CheckPlayerTransform // Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void MoveToDebugLocation(); // Function StatMapLocations.StatMapLocations_C.MoveToDebugLocation // Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void UserConstructionScript(); // Function StatMapLocations.StatMapLocations_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void ReceiveBeginPlay(); // Function StatMapLocations.StatMapLocations_C.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x20a5d0
	void SetUp(); // Function StatMapLocations.StatMapLocations_C.SetUp // BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void StatMapLocations(); // Function StatMapLocations.StatMapLocations_C.StatMapLocations // BlueprintCallable|BlueprintEvent // @ game+0x20a5d0
	void ExecuteUbergraph_StatMapLocations(int32 ___int_Array_Index_Variable2, int32 ___int_Loop_Counter_Variable, int32 CallFunc__f53d173295_ReturnValue, int32 ___int_Array_Index_Variable3, int32 ___int_Loop_Counter_Variable2, int32 CallFunc__f53d173295_ReturnValue2, int32 ___int_Loop_Counter_Variable3, int32 CallFunc__f53d173295_ReturnValue3, int32 ___int_Array_Index_Variable4, int32 ___int_Loop_Counter_Variable4, int32 CallFunc__f53d173295_ReturnValue4, struct FString CallFunc__cc353e651f_ReturnValue, struct FString CallFunc__a4f37e3e14_ReturnValue, struct FString CallFunc_MoveToDebugLocation_OutMoveLocation, struct FString CallFunc__a4f37e3e14_ReturnValue2, int32 CallFunc__f53d173295_ReturnValue5, struct TArray<struct AAirborneEjectionArea*> CallFunc_GetAllActorsOfClass_OutActors, int32 ___int_Array_Index_Variable5, int32 CallFunc__34ad69eaa1_ReturnValue, struct AAirborneEjectionArea* CallFunc_Array_Get_Item, struct TArray<struct ATslPassBluezoneArea*> CallFunc_GetAllActorsOfClass_OutActors2, struct TArray<struct ATslBlueZoneCreateArea*> CallFunc_GetAllActorsOfClass_OutActors3, struct ATslPassBluezoneArea* CallFunc_Array_Get_Item2, struct ATslBlueZoneCreateArea* CallFunc_Array_Get_Item3, int32 CallFunc__34ad69eaa1_ReturnValue2, int32 CallFunc__34ad69eaa1_ReturnValue3, bool CallFunc__045254c93f_ReturnValue, bool CallFunc__045254c93f_ReturnValue2, struct FString CallFunc_Array_Get_Item4, int32 CallFunc__34ad69eaa1_ReturnValue4, bool CallFunc__045254c93f_ReturnValue3, struct APawn* CallFunc_GetPlayerPawn_ReturnValue, struct ATslCharacter* K2Node_DynamicCast_AsTsl_Character, bool K2Node_DynamicCast_bSuccess, struct UTslCharacterMovement* CallFunc__62cd8daba9_ReturnValue, struct APawn* CallFunc_GetPlayerPawn_ReturnValue2, bool CallFunc__055a659f43_ReturnValue, int32 ___int_Loop_Counter_Variable5, bool CallFunc__045254c93f_ReturnValue4, int32 CallFunc__f53d173295_ReturnValue6, struct FString CallFunc_Array_Get_Item5, float CallFunc__9082a5ac7b_ReturnValue, struct FString CallFunc_Split_LeftS, struct FString CallFunc_Split_RightS, bool CallFunc_Split_ReturnValue, int32 CallFunc_Round_ReturnValue, struct FString CallFunc__a4f37e3e14_ReturnValue3, int32 CallFunc_Max_ReturnValue, int32 CallFunc__34ad69eaa1_ReturnValue5, struct FString CallFunc__cc1b42f995_ReturnValue, bool CallFunc__045254c93f_ReturnValue5, struct TArray<struct FString> CallFunc_GatherStats_Output, struct FString CallFunc__38b336b91a_ReturnValue, struct FString CallFunc__a4f37e3e14_ReturnValue4, struct FString CallFunc__cc353e651f_ReturnValue2, int32 CallFunc__34ad69eaa1_ReturnValue6, struct FString CallFunc__a4f37e3e14_ReturnValue5, bool CallFunc__045254c93f_ReturnValue6, struct FString CallFunc__a4f37e3e14_ReturnValue6); // Function StatMapLocations.StatMapLocations_C.ExecuteUbergraph_StatMapLocations //  // @ game+0x20a5d0
};

