// WidgetBlueprintGeneratedClass StepperWidget.StepperWidget_C
// Size: 0x500 (Inherited: 0x500)
struct UStepperWidget_C : U*3aba8326b9 {
	struct UButton* LeftArrowButton; // 0x490(0x08)
	struct UButton* RightArrowButton; // 0x498(0x08)
	struct UTextBlock* StepperText; // 0x4a0(0x08)
	struct UHorizontalBox* IndicatorHorizontalBox; // 0x4a8(0x08)
	float *16358ed107; // 0x4b0(0x04)
	float *92211aa532; // 0x4b4(0x04)
	float *9ff0badc7b; // 0x4b8(0x04)
	float *a79a2ba828; // 0x4bc(0x04)
	struct UClass* *0e9e37a82b; // 0x4c0(0x08)

	void OnClickRight(); // Function TslGame.*3aba8326b9.OnClickRight // Final|Native|Private // @ game+0x5af1b4c
	void OnClickLeft(); // Function TslGame.*3aba8326b9.OnClickLeft // Final|Native|Private // @ game+0x5af1b38
};

