// WidgetBlueprintGeneratedClass W_RecoilInfoRow.W_RecoilInfoRow_C
// Size: 0x2d4 (Inherited: 0x258)
struct UW_RecoilInfoRow_C : UUserWidget {
	struct F*a6c93df757 UberGraphFrame; // 0x258(0x08)
	struct UImage* Image_1; // 0x260(0x08)
	struct UTextBlock* TextBlock_ID; // 0x268(0x08)
	struct UTextBlock* TextBlock_RDH; // 0x270(0x08)
	struct UTextBlock* TextBlock_RDV; // 0x278(0x08)
	struct UTextBlock* TextBlock_RH; // 0x280(0x08)
	struct UTextBlock* TextBlock_RRV; // 0x288(0x08)
	struct UTextBlock* TextBlock_RTH; // 0x290(0x08)
	struct UTextBlock* TextBlock_RTV; // 0x298(0x08)
	struct UTextBlock* TextBlock_RV; // 0x2a0(0x08)
	struct UTextBlock* TextBlock_RVal; // 0x2a8(0x08)
	int32 ID; // 0x2b0(0x04)
	float RVal; // 0x2b4(0x04)
	float RV; // 0x2b8(0x04)
	float RH; // 0x2bc(0x04)
	float RTV; // 0x2c0(0x04)
	float RTH; // 0x2c4(0x04)
	float RRV; // 0x2c8(0x04)
	float RDV; // 0x2cc(0x04)
	float RDH; // 0x2d0(0x04)

	void Construct(); // Function W_RecoilInfoRow.W_RecoilInfoRow_C.Construct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x20a5d0
	struct FText ExecuteUbergraph_W_RecoilInfoRow(); // Function W_RecoilInfoRow.W_RecoilInfoRow_C.ExecuteUbergraph_W_RecoilInfoRow // HasDefaults // @ game+0x20a5d0
};

