// Class ZipUtility.*ef65632b93
// Size: 0x30 (Inherited: 0x30)
struct U*ef65632b93 : UInterface {
};

// Class ZipUtility.*f8cd485fe1
// Size: 0x78 (Inherited: 0x30)
struct U*f8cd485fe1 : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	enum class *ca5a863db4 CompressionFormat; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString file; // 0x40(0x10)
	struct FString DestinationFolder; // 0x50(0x10)
	int32 *ac89c610b6; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct UObject* Callback; // 0x68(0x08)
	bool *e9800c940e; // 0x70(0x01)
	bool *888850b64a; // 0x71(0x01)
	bool *c0ec5a68a2; // 0x72(0x01)
	char pad_73[0x5]; // 0x73(0x05)
};

// Class ZipUtility.*d9eb82f508
// Size: 0x30 (Inherited: 0x30)
struct U*d9eb82f508 : UBlueprintFunctionLibrary {
};

// Class ZipUtility.*33af3168cb
// Size: 0xe0 (Inherited: 0x30)
struct U*33af3168cb : UObject {
	char pad_30[0xb0]; // 0x30(0xb0)
};

