// Enum ChromaSDKPlugin.EChromaSDKStreamStatusEnum
enum class EChromaSDKStreamStatusEnum : uint8 {
	READY,
	AUTHORIZING,
	BROADCASTING,
	WATCHING,
	NOT_AUTHORIZED,
	BROADCAST_DUPLICATE,
	SERVICE_OFFLINE,
	EChromaSDKStreamStatusEnum_MAX,
};

// Enum ChromaSDKPlugin.*fc366d2d6f
enum class *fc366d2d6f : uint8 {
	*9149ec3553,
	*a371292f1a,
	*c9a4f979f0,
	*f633d9f430,
	*5e4b43c25c,
	*811e9c908e,
	*78d2a1fc0f,
	*fc366d2d6f_MAX,
};

// Enum ChromaSDKPlugin.*ae4c647294
enum class *ae4c647294 : uint8 {
	*59e01d86f5,
	*de0da118d4,
	*449fcc9242,
	*c1d786cb03,
	*bb9d63db54,
	*ae4c647294_MAX,
};

// Enum ChromaSDKPlugin.*14182697a9
enum class *14182697a9 : uint8 {
	*2184db1ee4,
	*f2324f8cd4,
	*111440a796,
	*1d7c611471,
	*f8f14b7a74,
	*f0b71d4e2c,
	*027e4bbf8e,
	*a3f9ce2883,
	*67f2bf160e,
	*194648dff4,
	*dfad206de1,
	*244702fb84,
	*e21e332fef,
	*4adec3632d,
	*c658300a8a,
	*dbbe853771,
	*79ff372456,
	*025884a92d,
	*85d5a54372,
	*5eb47396b1,
	*46c8efaeff,
	*8200b16cf3,
	*37097f3e6d,
	*14182697a9_MAX,
};

// Enum ChromaSDKPlugin.*c11d089240
enum class *c11d089240 : uint8 {
	*0f36dba89a,
	*9dc3ed6669,
	*173c5ae849,
	*36ac7f6584,
	*6a7bbfbaf4,
	*5219bc8e06,
	*1c1fba578a,
	*4946b4abe6,
	*40f0f9dbce,
	*dccfab61bd,
	*dbfddc94d2,
	*a9e27efac8,
	*0b76526161,
	*da68af9eca,
	*21f0ff189d,
	*a6b867010d,
	*6a9dbd8ace,
	*791eebdab3,
	*2a18229d3b,
	*0e3f51be12,
	*1febd2471f,
	*2b7001b0ae,
	*c6e716b5f5,
	*7d365ec1d8,
	*72a2823002,
	*6ee965f2be,
	*079876a12c,
	*3322e6222a,
	*b429a70392,
	*67a5d98e99,
	*dc24299239,
	*823d38b417,
	*159040a7d3,
	*a89a495d50,
	*97f499f5ec,
	*bcb2ef3444,
	*6efc55415e,
	*0e0749cbe7,
	*fb4896996a,
	*68d626c432,
	*f6e04bf6d9,
	*50af533026,
	*c6d8df5b85,
	*fa2ecff86b,
	*e51765ee58,
	*cc15e48b0e,
	*a6b8ed17ef,
	*855c69c8c8,
	*6ec649bdfb,
	*03eb797582,
	*c35a767ed6,
	*7166790509,
	*e9c8070088,
	*6c83f99d5a,
	*de2dac53bf,
	*37638dede9,
	*b3655a7df5,
	*37dfbe0c4f,
	*ca0bb5e01a,
	*1d8013c852,
	*39c4338b0e,
	*308e7d6df3,
	*190a723066,
	*c96e2ef838,
	*b94f6b1c53,
	*bb155371a8,
	*5a6c592666,
	*abf8cfa0ae,
	*df1680ecd5,
	*577bb05827,
	*31579e9b6a,
	*07980eec3d,
	*e955723102,
	*e1d8ac8245,
	*52deef0ec4,
	*99ac7027bc,
	*aeb863f252,
	*c0d571ca18,
	*a68369cde7,
	*058710e6f8,
	*8af50d3d2a,
	*825be646d2,
	*3ccae8fb60,
	*188be3ce8d,
	*31a5870351,
	*a5b86f3d48,
	*ea78fd3d3b,
	*01b74ef7d7,
	*fd8673ffb7,
	*2890e63c4c,
	*c7a4f45b1f,
	*e75128b667,
	*eaa8f69d23,
	*6ee9c15e73,
	*4907763618,
	*8b8b9521bf,
	*dcb80bb432,
	*f25988b412,
	*7524bab46b,
	*086cb656b1,
	*59f9db3ab2,
	*2c0d9a5fc6,
	*7845528eb2,
	*4984cb487f,
	*4ff9ba927b,
	*5e9ea413c1,
	*606464f6b8,
	*a9d366ff5a,
	*eb884d2ef0,
	*b9d6354b6c,
	*1ef88cbc5f,
	*11b1e5bfe7,
	*299e5e779f,
	*499a1cb620,
	*60a4af0c0e,
	*13f2716511,
	*398bf25b9e,
	*94e487c90d,
	*9e7b9784c3,
	*54a3aba2d2,
	*0d545c8b1e,
	*d4670cb2eb,
	*33c9e2c503,
	*f63a62b909,
	*374704cd5f,
	*a0fda61adf,
	*c11d089240_MAX,
};

// Enum ChromaSDKPlugin.*4699735d70
enum class *4699735d70 : uint8 {
	*d08222aae5,
	*8a7d32b2c5,
	*5bde23e9bb,
	*c3ec63b241,
	*134093409b,
	*fbbe9f51ca,
	*a317c90c67,
	*4699735d70_MAX,
};

// Enum ChromaSDKPlugin.*497e2ebe78
enum class *497e2ebe78 : uint8 {
	*5bde23e9bb,
	*c3ec63b241,
	*134093409b,
	*a317c90c67,
	*497e2ebe78_MAX,
};

// Enum ChromaSDKPlugin.*3dc45ab119
enum class *3dc45ab119 : uint8 {
	*d08222aae5,
	*8a7d32b2c5,
	*fbbe9f51ca,
	*a317c90c67,
	*3dc45ab119_MAX,
};

// Enum ChromaSDKPlugin.*5a41cc27f6
enum class *5a41cc27f6 : uint8 {
	*0982494f88,
	*d8b3ec7c15,
	*a317c90c67,
	*5a41cc27f6_MAX,
};

// ScriptStruct ChromaSDKPlugin.*44e6c1b289
// Size: 0x10 (Inherited: 0x00)
struct F*44e6c1b289 {
	struct TArray<struct F*25f4b6d698> Effects; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*25f4b6d698
// Size: 0x38 (Inherited: 0x00)
struct F*25f4b6d698 {
	struct FString Animation; // 0x00(0x10)
	bool State; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 PrimaryColor; // 0x14(0x04)
	int32 SecondaryColor; // 0x18(0x04)
	int32 Speed; // 0x1c(0x04)
	enum class *ae4c647294 Blend; // 0x20(0x01)
	enum class *fc366d2d6f Mode; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct F*204ffed0d6 FrameIndex; // 0x28(0x10)
};

// ScriptStruct ChromaSDKPlugin.*204ffed0d6
// Size: 0x10 (Inherited: 0x00)
struct F*204ffed0d6 {
	struct TArray<int32> *9f9ddd3667; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*45f640f239
// Size: 0x48 (Inherited: 0x00)
struct F*45f640f239 {
	struct FString Title; // 0x00(0x10)
	struct FString Description; // 0x10(0x10)
	struct FString *ff738b3b6e; // 0x20(0x10)
	struct FString *82d694cf49; // 0x30(0x10)
	int32 *b5c142a8da; // 0x40(0x04)
	int32 Category; // 0x44(0x04)
};

// ScriptStruct ChromaSDKPlugin.*b118a24760
// Size: 0x18 (Inherited: 0x00)
struct F*b118a24760 {
	struct TArray<struct F*688b3842da> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*688b3842da
// Size: 0x10 (Inherited: 0x00)
struct F*688b3842da {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*e094bf5f58
// Size: 0x18 (Inherited: 0x00)
struct F*e094bf5f58 {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*7b536fe20a
// Size: 0x14 (Inherited: 0x00)
struct F*7b536fe20a {
	int32 Result; // 0x00(0x04)
	struct F*09ef82d921 EffectId; // 0x04(0x10)
};

// ScriptStruct ChromaSDKPlugin.*09ef82d921
// Size: 0x10 (Inherited: 0x00)
struct F*09ef82d921 {
	char pad_0[0x10]; // 0x00(0x10)
};

