// Class Engine.Actor
// Size: 0x3e8 (Inherited: 0x30)
struct AActor : UObject {
	struct FMulticastDelegate OnActorBeginOverlap; // 0x30(0x10)
	char pad_40[0xc]; // 0x40(0x0c)
	char pad_4C_0 : 3; // 0x4c(0x01)
	char *afc0b607c1 : 1; // 0x4c(0x01)
	char pad_4C_4 : 4; // 0x4c(0x01)
	char pad_4D_0 : 1; // 0x4d(0x01)
	char *195141a832 : 1; // 0x4d(0x01)
	char bReplicates : 1; // 0x4d(0x01)
	char pad_4D_3 : 5; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	struct FName *dc8dad45d2; // 0x50(0x08)
	enum class ENetRole RemoteRole; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct AActor* Owner; // 0x60(0x08)
	struct FRepMovement ReplicatedMovement; // 0x68(0x34)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct F*163cdb3029 *4998573317; // 0xa0(0x40)
	char bHidden : 1; // 0xe0(0x01)
	char *ccd23c4d11 : 1; // 0xe0(0x01)
	char *00c044e8f3 : 1; // 0xe0(0x01)
	char bOnlyRelevantToOwner : 1; // 0xe0(0x01)
	char bAlwaysRelevant : 1; // 0xe0(0x01)
	char *0b52d4980d : 1; // 0xe0(0x01)
	char *581c4aea8e : 1; // 0xe0(0x01)
	char *00a5818f10 : 1; // 0xe0(0x01)
	char *578ce01c9c : 1; // 0xe1(0x01)
	char pad_E1_1 : 1; // 0xe1(0x01)
	char *dc908ea105 : 1; // 0xe1(0x01)
	char bNetUseOwnerRelevancy : 1; // 0xe1(0x01)
	char *e59ae21b72 : 1; // 0xe1(0x01)
	char pad_E1_5 : 1; // 0xe1(0x01)
	char *42194894c7 : 1; // 0xe1(0x01)
	char pad_E1_7 : 1; // 0xe1(0x01)
	char pad_E2[0x6]; // 0xe2(0x06)
	struct FMulticastDelegate OnInputTouchEnter; // 0xe8(0x10)
	char pad_F8[0x4]; // 0xf8(0x04)
	struct FGuid DestructibleId; // 0xfc(0x10)
	bool bIsDestroyedVersion; // 0x10c(0x01)
	bool RemoveFromLevelLOD; // 0x10d(0x01)
	char pad_10E[0x2]; // 0x10e(0x02)
	struct F*b3a779a928 PrimaryActorTick; // 0x110(0x58)
	struct TArray<struct FName> Tags; // 0x168(0x10)
	struct FMulticastDelegate OnReleased; // 0x178(0x10)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x188(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x198(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x1a8(0x01)
	char bAutoDestroyWhenFinished : 1; // 0x1a9(0x01)
	char bCanBeDamaged : 1; // 0x1a9(0x01)
	char *48c13dc856 : 1; // 0x1a9(0x01)
	char *b6f52fdcb3 : 1; // 0x1a9(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x1a9(0x01)
	char *ff1816ff9e : 1; // 0x1a9(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x1a9(0x01)
	char *a9f513e55a : 1; // 0x1a9(0x01)
	char *07bc7fef21 : 1; // 0x1aa(0x01)
	char pad_1AA_1 : 7; // 0x1aa(0x01)
	char pad_1AB[0x5]; // 0x1ab(0x05)
	struct FMulticastDelegate OnBeginCursorOver; // 0x1b0(0x10)
	struct FMulticastDelegate OnClicked; // 0x1c0(0x10)
	enum class ENetRole Role; // 0x1d0(0x01)
	char pad_1D1[0x3]; // 0x1d1(0x03)
	float MinNetUpdateFrequency; // 0x1d4(0x04)
	enum class EAutoReceiveInput *aaa4c6b0aa; // 0x1d8(0x01)
	char pad_1D9[0x7]; // 0x1d9(0x07)
	struct APawn* Instigator; // 0x1e0(0x08)
	float *f4ec68df5a; // 0x1e8(0x04)
	char pad_1EC[0x54]; // 0x1ec(0x54)
	char *72b47ba3cd : 1; // 0x240(0x01)
	char pad_240_1 : 4; // 0x240(0x01)
	char *8b1bf7449f : 1; // 0x240(0x01)
	char *d253d94f65 : 1; // 0x240(0x01)
	char *3b999d2d7a : 1; // 0x240(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x241(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x242(0x01)
	char pad_243[0x65]; // 0x243(0x65)
	int32 *c2b5fafb50; // 0x2a8(0x04)
	float NetUpdateFrequency; // 0x2ac(0x04)
	char pad_2B0[0x8]; // 0x2b0(0x08)
	struct TArray<struct AActor*> Children; // 0x2b8(0x10)
	struct USceneComponent* RootComponent; // 0x2c8(0x08)
	struct FMulticastDelegate OnInputTouchBegin; // 0x2d0(0x10)
	float InitialLifeSpan; // 0x2e0(0x04)
	int32 *403c4f6ec5; // 0x2e4(0x04)
	uint64 *59b4fa8b00; // 0x2e8(0x08)
	char pad_2F0[0x8]; // 0x2f0(0x08)
	struct FMulticastDelegate OnTakePointDamage; // 0x2f8(0x10)
	struct U*89f9a84286* *89f9a84286; // 0x308(0x08)
	struct FMulticastDelegate OnInputTouchLeave; // 0x310(0x10)
	float NetCullDistanceSquared; // 0x320(0x04)
	char pad_324[0x4]; // 0x324(0x04)
	struct FMulticastDelegate OnEndCursorOver; // 0x328(0x10)
	struct TArray<struct AMatineeActor*> *24dd036ec9; // 0x338(0x10)
	struct FMulticastDelegate OnActorHit; // 0x348(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x358(0x10)
	char pad_368[0x8]; // 0x368(0x08)
	struct FMulticastDelegate OnActorEndOverlap; // 0x370(0x10)
	struct TArray<struct FName> Layers; // 0x380(0x10)
	float CustomTimeDilation; // 0x390(0x04)
	float NetPriority; // 0x394(0x04)
	struct FMulticastDelegate OnInputTouchEnd; // 0x398(0x10)
	struct AActor* ParentComponentActor; // 0x3a8(0x08)
	struct FMulticastDelegate OnDestroyed; // 0x3b0(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3c0(0x10)
	char pad_3D0[0x2]; // 0x3d0(0x02)
	enum class *d729d3c5a5 InputConsumeOption; // 0x3d2(0x01)
	char pad_3D3[0x1]; // 0x3d3(0x01)
	struct UChildActorComponent* *18ff5b3923; // 0x3d4(0x08)
	char pad_3DC[0xc]; // 0x3dc(0x0c)

	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xf2034c
	void *541a06a744(); // Function Engine.Actor.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x6bc7a60
	void K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *efaba219b2(); // Function Engine.Actor.*efaba219b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbacc8
	void K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc0b0c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xb3e014
	void GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd13998
	void AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6bb2440
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x5e923c
	void *ce1958648c(); // Function Engine.Actor.*ce1958648c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb488
	void *5f8251239e(); // Function Engine.Actor.*5f8251239e // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb8b60
	void *eb66fec44e(); // Function Engine.Actor.*eb66fec44e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb92dc
	void *806c296001(); // Function Engine.Actor.*806c296001 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc33d4
	void ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *511ef00739(); // Function Engine.Actor.*511ef00739 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb3e8
	void ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x3b43ac
	void *bbf004721b(); // Function Engine.Actor.*bbf004721b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbcd70
	void *4bc88286ff(); // Function Engine.Actor.*4bc88286ff // Final|Native|Public|BlueprintCallable // @ game+0x6bcadac
	void K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc4408
	void ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *45e9b736d8(); // Function Engine.Actor.*45e9b736d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8f1c
	void *75f3114c08(); // Function Engine.Actor.*75f3114c08 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfca4
	void *f221ff8513(); // Function Engine.Actor.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6bb2568
	void K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc12c0
	void *814a121c39(); // Function Engine.Actor.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x6bd0b4c
	void GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf598
	void K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc47b8
	void *c4fee2a50d(); // Function Engine.Actor.*c4fee2a50d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9918
	void *0d0c513b2c(); // Function Engine.Actor.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x6bc7b88
	void K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc49e4
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x6bb6b18
	void GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdcc4
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x3b43ac
	void *5d41351842(); // Function Engine.Actor.*5d41351842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc124
	void ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *0533b13c90(); // Function Engine.Actor.*0533b13c90 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9704
	void K2_AttachRootComponentTo(); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x6bc243c
	void *f3429ceb97(); // Function Engine.Actor.*f3429ceb97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaae0
	void DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x6bb6a84
	void SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5d9e520
	void *de9d01b3f6(); // Function Engine.Actor.*de9d01b3f6 // Final|Native|Public|BlueprintCallable // @ game+0x6bc28bc
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x4feee4
	void ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *f4f472a4df(); // Function Engine.Actor.*f4f472a4df // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9350
	void *32ee7138ab(); // Function Engine.Actor.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x6bd0c64
	void *76f4a54e31(); // Function Engine.Actor.*76f4a54e31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9310
	void *b999b3d1c3(); // Function Engine.Actor.*b999b3d1c3 // Final|Native|Public|BlueprintCallable // @ game+0x6bc5fb8
	void *cdc7b91d6d(); // Function Engine.Actor.*cdc7b91d6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbee84
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x3b43ac
	void *7cff7fa404(); // Function Engine.Actor.*7cff7fa404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf5d0
	void *e45fc9ffc9(); // Function Engine.Actor.*e45fc9ffc9 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8f44
	void MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc6034
	void ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x3b43ac
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x6bcb1e8
	void *d57fbe8fc6(); // Function Engine.Actor.*d57fbe8fc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfbf0
	void *52068fadb9(); // Function Engine.Actor.*52068fadb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc084
	void K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *891a15da22(); // Function Engine.Actor.*891a15da22 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc5980
	void *209c054b22(); // Function Engine.Actor.*209c054b22 // Final|Native|Public|BlueprintCallable // @ game+0x6bd1cc4
	void GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb8d74
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bb8b74
	void *bda82fb76a(); // Function Engine.Actor.*bda82fb76a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb993c
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *221e5b49fe(); // Function Engine.Actor.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x6bd05e4
	void *d4b72b197e(); // Function Engine.Actor.*d4b72b197e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe9c4
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbef084
	void *581f8985e1(); // Function Engine.Actor.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x6bc2f14
	void *72d1ab0701(); // Function Engine.Actor.*72d1ab0701 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcb148
	void *058a798681(); // Function Engine.Actor.*058a798681 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcb0a8
	void K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc10e8
	void *d5ff08bf52(); // Function Engine.Actor.*d5ff08bf52 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9050
	void *14c0f68ea4(); // Function Engine.Actor.*14c0f68ea4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bbb630
	void *bad918d000(); // Function Engine.Actor.*bad918d000 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bd3090
	void *383cbfbf66(); // Function Engine.Actor.*383cbfbf66 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9980
	void *48b2b80fa1(); // Function Engine.Actor.*48b2b80fa1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd040
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6bc2efc
	void *83d2d5c58f(); // Function Engine.Actor.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0448
	void K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc4ae4
	void K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x6bc25bc
	void *a0012f52a9(); // Function Engine.Actor.*a0012f52a9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb917c
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc0934
	void *65fa332f56(); // Function Engine.Actor.*65fa332f56 // Native|Public|BlueprintCallable // @ game+0x6bd29cc
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *1206b0a740(); // Function Engine.Actor.*1206b0a740 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb91b0
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xd9c07c
	void *7311615d4b(); // Function Engine.Actor.*7311615d4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9328
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void K2_SetActorLocation(); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc3fec
	void *e22a09fc3d(); // Function Engine.Actor.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe0b4
	void *d93dde83f1(); // Function Engine.Actor.*d93dde83f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbabd8
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc34a4
	void *b7511d0ed8(); // Function Engine.Actor.*b7511d0ed8 // Final|Native|Public|BlueprintCallable // @ game+0x6bc3064
	void *057be55286(); // Function Engine.Actor.*057be55286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe154
	void GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdf24
	void *1357a6903c(); // Function Engine.Actor.*1357a6903c // Final|Native|Public|BlueprintCallable // @ game+0x6bcb27c
	void K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc0f10
	void ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe7ec88
	void *6c12a1a971(); // Function Engine.Actor.*6c12a1a971 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc3910
	void K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc45e0
	void ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void K2_AddActorLocalTransform(); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc0ce4
	void *87d1cdd662(); // Function Engine.Actor.*87d1cdd662 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6bd067c
	void *91da404789(); // Function Engine.Actor.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0xdc0668
	void *5c41a9b3d8(); // Function Engine.Actor.*5c41a9b3d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc660
	void *ef270d1a10(); // Function Engine.Actor.*ef270d1a10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe178
	void *685e3b5cc9(); // Function Engine.Actor.*685e3b5cc9 // Native|Public|BlueprintCallable // @ game+0x6bcea4c
	void *0f7b3f99fd(); // Function Engine.Actor.*0f7b3f99fd // Native|Public|BlueprintCallable // @ game+0x6bb85d8
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x6bcae44
	void *d85c70de6e(); // Function Engine.Actor.*d85c70de6e // Final|Native|Public|BlueprintCallable // @ game+0x6bbf150
	void AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xca0ab4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xbf35f4
	void *118a22ba37(); // Function Engine.Actor.*118a22ba37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc754
	void K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc41d0
	void *dd10056177(); // Function Engine.Actor.*dd10056177 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbcf78
	void *8ee0b9e990(); // Function Engine.Actor.*8ee0b9e990 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbcf90
	void *461623950c(); // Function Engine.Actor.*461623950c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfc0c
};

// Class Engine.AnimInstance
// Size: 0x3a8 (Inherited: 0x30)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct USkeleton* *a7e4906ff1; // 0x38(0x08)
	enum class *0accfd5352 *8ba26f4fbf; // 0x40(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x41(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x42(0x01)
	bool *c74b442f59; // 0x43(0x01)
	bool bWarnAboutBlueprintUsage; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x48(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x58(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x68(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x78(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x88(0x10)
	char pad_98[0x60]; // 0x98(0x60)
	bool *206a771f46; // 0xf8(0x01)
	char pad_F9[0x9f]; // 0xf9(0x9f)
	struct TArray<struct FAnimNotifyEvent> *6fc5b1d0be; // 0x198(0x10)
	char pad_1A8[0x200]; // 0x1a8(0x200)

	void *92ce4ee977(); // Function Engine.AnimInstance.*92ce4ee977 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf4408
	void *324fdf8f8a(); // Function Engine.AnimInstance.*324fdf8f8a // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6c04fb8
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *0e59f382aa(); // Function Engine.AnimInstance.*0e59f382aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf95e4
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *d213c50b7f(); // Function Engine.AnimInstance.*d213c50b7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bff0e0
	void *8e3bfbd48a(); // Function Engine.AnimInstance.*8e3bfbd48a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf4810
	void *cebaa7cd2c(); // Function Engine.AnimInstance.*cebaa7cd2c // Native|Public|BlueprintCallable // @ game+0x6c12614
	void GetAnimAssetPlayerTimeFromEnd(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6befe8c
	void Montage_Play(); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x7ae390
	void *3d7951dd37(); // Function Engine.AnimInstance.*3d7951dd37 // Final|Native|Public|BlueprintCallable // @ game+0x6c09c6c
	void BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *5e07a11f21(); // Function Engine.AnimInstance.*5e07a11f21 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfcf0c
	void *7daaaa5771(); // Function Engine.AnimInstance.*7daaaa5771 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf38a0
	void *46b80b3a59(); // Function Engine.AnimInstance.*46b80b3a59 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c09850
	void *2fdfd7cfe3(); // Function Engine.AnimInstance.*2fdfd7cfe3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd45910
	void GetStateWeight(); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf9028
	void *003dacf78a(); // Function Engine.AnimInstance.*003dacf78a // Final|Native|Public|BlueprintCallable // @ game+0x6be48ac
	void *6bd52ed5b9(); // Function Engine.AnimInstance.*6bd52ed5b9 // Native|Public|BlueprintCallable // @ game+0x7addb8
	void *7aeb896e6e(); // Function Engine.AnimInstance.*7aeb896e6e // Final|Native|Public|BlueprintCallable // @ game+0x6c2a218
	void *8c261f57d4(); // Function Engine.AnimInstance.*8c261f57d4 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf7644
	void *be4d7059c2(); // Function Engine.AnimInstance.*be4d7059c2 // Final|Native|Public|BlueprintCallable // @ game+0x6c09afc
	void *28886e519b(); // Function Engine.AnimInstance.*28886e519b // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x7afab0
	void *bcdca57f0a(); // Function Engine.AnimInstance.*bcdca57f0a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf19f4
	void *a38a5ce007(); // Function Engine.AnimInstance.*a38a5ce007 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c09710
	void *f56ecdaa87(); // Function Engine.AnimInstance.*f56ecdaa87 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c2be90
	void *0a8f8d6319(); // Function Engine.AnimInstance.*0a8f8d6319 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x6c04fb8
	void *917921a2e3(); // Function Engine.AnimInstance.*917921a2e3 // Final|Native|Public|BlueprintCallable // @ game+0x6c09990
	void GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6befd18
	void *8681bde224(); // Function Engine.AnimInstance.*8681bde224 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c2524c
	void PlaySlotAnimationAsDynamicMontage(); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x6c0d778
	void *97a3af276c(); // Function Engine.AnimInstance.*97a3af276c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf3f28
	void *40e1f5f43a(); // Function Engine.AnimInstance.*40e1f5f43a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf3c40
	void *e064ffea5e(); // Function Engine.AnimInstance.*e064ffea5e // Final|Native|Public|BlueprintCallable // @ game+0x6c09a6c
	void *757538402e(); // Function Engine.AnimInstance.*757538402e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x48f9c8
	void *39919f124d(); // Function Engine.AnimInstance.*39919f124d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c097b0
	void *7eeea6c74e(); // Function Engine.AnimInstance.*7eeea6c74e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xc85460
	void *a977510087(); // Function Engine.AnimInstance.*a977510087 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfe99c
	void *add693e1df(); // Function Engine.AnimInstance.*add693e1df // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c09674
	void *dcbdf49e66(); // Function Engine.AnimInstance.*dcbdf49e66 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c098f0
	void *af34a038d7(); // Function Engine.AnimInstance.*af34a038d7 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf743c
	void *9c44837415(); // Function Engine.AnimInstance.*9c44837415 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c095d4
	void *ce83b031d9(); // Function Engine.AnimInstance.*ce83b031d9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bff63c
	void GetAnimAssetPlayerTimeFromEndFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6beff90
	void *8844726dd1(); // Function Engine.AnimInstance.*8844726dd1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf3a58
	void *b38c1f41c3(); // Function Engine.AnimInstance.*b38c1f41c3 // Final|Native|Public|BlueprintCallable // @ game+0x6c1d428
	void GetAnimAssetPlayerTimeFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6befdac
	void *a908599b82(); // Function Engine.AnimInstance.*a908599b82 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf3508
	void *04dc1a777c(); // Function Engine.AnimInstance.*04dc1a777c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6be1628
	void PlaySlotAnimation(); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x6c0d554
	void *f30cd63cdb(); // Function Engine.AnimInstance.*f30cd63cdb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf156c
	void *8859b811a6(); // Function Engine.AnimInstance.*8859b811a6 // Final|Native|Public|BlueprintCallable // @ game+0x6c1f2e0
	void *d3925db7cd(); // Function Engine.AnimInstance.*d3925db7cd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf7860
	void *6abb6cfc88(); // Function Engine.AnimInstance.*6abb6cfc88 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xc852a0
	void *ae69dc5c64(); // Function Engine.AnimInstance.*ae69dc5c64 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf9cac
	void *5940d5128c(); // Function Engine.AnimInstance.*5940d5128c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf672c
	void GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf1954
	void *2ed9c97cc9(); // Function Engine.AnimInstance.*2ed9c97cc9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe5e10c
	void *c2413b9bde(); // Function Engine.AnimInstance.*c2413b9bde // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf4610
	void *c19b394f7e(); // Function Engine.AnimInstance.*c19b394f7e // Final|Native|Public|BlueprintCallable // @ game+0x6c09b8c
	void *0e6503e701(); // Function Engine.AnimInstance.*0e6503e701 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bf36d4
	void *4e9f00b274(); // Function Engine.AnimInstance.*4e9f00b274 // Native|Public|BlueprintCallable // @ game+0x5cee54
	void *cce7bb269a(); // Function Engine.AnimInstance.*cce7bb269a // Native|Public|BlueprintCallable // @ game+0x7b019c
	void *c96507ca7c(); // Function Engine.AnimInstance.*c96507ca7c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x48ec8c
};

// Class Engine.ActorComponent
// Size: 0x200 (Inherited: 0x30)
struct UActorComponent : UObject {
	char pad_30[0xf0]; // 0x30(0xf0)
	struct F*8d4039fc59 PrimaryComponentTick; // 0x120(0x58)
	struct TArray<struct FName> ComponentTags; // 0x178(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x188(0x10)
	char pad_198_0 : 3; // 0x198(0x01)
	char bReplicates : 1; // 0x198(0x01)
	char bNetAddressable : 1; // 0x198(0x01)
	char *42cccbce92 : 1; // 0x198(0x01)
	char pad_198_6 : 2; // 0x198(0x01)
	char pad_199[0x1]; // 0x199(0x01)
	char pad_19A_0 : 2; // 0x19a(0x01)
	char bCreatedByConstructionScript : 1; // 0x19a(0x01)
	char bInstanceComponent : 1; // 0x19a(0x01)
	char bAutoActivate : 1; // 0x19a(0x01)
	char *37789dceb0 : 1; // 0x19a(0x01)
	char *d6b476b16b : 1; // 0x19a(0x01)
	char pad_19A_7 : 1; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	struct FGuid DestructibleId; // 0x19c(0x10)
	bool bIsDestroyedVersion; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	char *5a62c75e8c : 1; // 0x1b0(0x01)
	char pad_1B0_1 : 2; // 0x1b0(0x01)
	char bIsEditorOnly : 1; // 0x1b0(0x01)
	char pad_1B0_4 : 4; // 0x1b0(0x01)
	char pad_1B1[0x4]; // 0x1b1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1b5(0x01)
	enum class EPendingCreationType *4795e00ee8; // 0x1b6(0x01)
	char pad_1B7[0x9]; // 0x1b7(0x09)
	struct TArray<struct FSimpleMemberReference> *98e040a793; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1d0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1e0(0x10)
	char pad_1F0[0x9]; // 0x1f0(0x09)
	char *195141a832 : 1; // 0x1f9(0x01)
	char pad_1F9_1 : 7; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)

	void *61bb7392aa(); // Function Engine.ActorComponent.*61bb7392aa // Native|Public|BlueprintCallable // @ game+0x6bcacb8
	void *05866bcfcb(); // Function Engine.ActorComponent.*05866bcfcb // Final|Native|Public|BlueprintCallable // @ game+0x6bce9b8
	void Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xf274cc
	void *c4952b0099(); // Function Engine.ActorComponent.*c4952b0099 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbab88
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0x6631ff4
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x6bc6594
	void *f52554acee(); // Function Engine.ActorComponent.*f52554acee // Final|Native|Public|BlueprintCallable // @ game+0x6bcd4fc
	void *541a06a744(); // Function Engine.ActorComponent.*541a06a744 // Native|Public|BlueprintCallable // @ game+0x6bc7af4
	void ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *814a121c39(); // Function Engine.ActorComponent.*814a121c39 // Final|Native|Public|BlueprintCallable // @ game+0x6bd0bd8
	void *0d0c513b2c(); // Function Engine.ActorComponent.*0d0c513b2c // Native|Public|BlueprintCallable // @ game+0x6bc7c1c
	void *9eb2ac36d0(); // Function Engine.ActorComponent.*9eb2ac36d0 // Native|Public|BlueprintCallable // @ game+0x5e55b2c
	void *6f8bd4c74b(); // Function Engine.ActorComponent.*6f8bd4c74b // Native|Public|BlueprintCallable // @ game+0x6bcb8b0
	void *e22a09fc3d(); // Function Engine.ActorComponent.*e22a09fc3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd6d5b0
	void IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e55b44
	void *d4c659a949(); // Function Engine.ActorComponent.*d4c659a949 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5b18
	void AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6bb24d4
	void *f221ff8513(); // Function Engine.ActorComponent.*f221ff8513 // Native|Public|BlueprintCallable // @ game+0x6bb25fc
	void *2e369dcd8d(); // Function Engine.ActorComponent.*2e369dcd8d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfc88
	void *32ee7138ab(); // Function Engine.ActorComponent.*32ee7138ab // Final|Native|Public|BlueprintCallable // @ game+0x6bd0cfc
	void *581f8985e1(); // Function Engine.ActorComponent.*581f8985e1 // Final|Native|Public|BlueprintCallable // @ game+0x6bc2fac
	void *77f9b41839(); // Function Engine.ActorComponent.*77f9b41839 // Native|Public|BlueprintCallable // @ game+0x6bcd464
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *3ae845f2b7(); // Function Engine.ActorComponent.*3ae845f2b7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfe04
	void ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x3b43ac
};

// Class Engine.Pawn
// Size: 0x448 (Inherited: 0x3e8)
struct APawn : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	char bUseControllerRotationPitch : 1; // 0x3f0(0x01)
	char bUseControllerRotationYaw : 1; // 0x3f0(0x01)
	char bUseControllerRotationRoll : 1; // 0x3f0(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x3f0(0x01)
	char pad_3F0_4 : 4; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	float BaseEyeHeight; // 0x3f4(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x3f8(0x01)
	enum class EAutoPossessAI *e0e3a12db9; // 0x3f9(0x01)
	char pad_3FA[0x6]; // 0x3fa(0x06)
	struct UClass* AIControllerClass; // 0x400(0x08)
	uint16 *021ce32c67; // 0x408(0x02)
	char pad_40A[0x6]; // 0x40a(0x06)
	struct AController* *2f9c3272b2; // 0x410(0x08)
	struct AController* Controller; // 0x418(0x08)
	struct APlayerState* PlayerState; // 0x420(0x08)
	char pad_428[0x4]; // 0x428(0x04)
	struct FVector *c0934ea168; // 0x42c(0x0c)
	struct FVector *d20d64241b; // 0x438(0x0c)
	char pad_444[0x4]; // 0x444(0x04)

	void *c30d7bf87e(); // Function Engine.Pawn.*c30d7bf87e // Native|Public|BlueprintCallable // @ game+0x6bd1ea8
	void ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae74
	void K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe508
	void *7d02763a00(); // Function Engine.Pawn.*7d02763a00 // Final|Native|Public|BlueprintCallable // @ game+0x6bcc940
	void *9559952bce(); // Function Engine.Pawn.*9559952bce // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc67dc
	void *116ac9743d(); // Function Engine.Pawn.*116ac9743d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb1c5c
	void AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x6bb0b68
	void *c87325b52a(); // Function Engine.Pawn.*c87325b52a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd8d4
	void *8dcd001cb7(); // Function Engine.Pawn.*8dcd001cb7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e23fa0
	void *09ea1f63ee(); // Function Engine.Pawn.*09ea1f63ee // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5df1e6c
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0x7c9f8c
	void *5a76ea52e7(); // Function Engine.Pawn.*5a76ea52e7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc5bd8
	void *ec5c491810(); // Function Engine.Pawn.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc03d0
	void *f92d1c6c4c(); // Function Engine.Pawn.*f92d1c6c4c // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6bbd79c
	void *c9d088b372(); // Function Engine.Pawn.*c9d088b372 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfe30
	void *d2bc061ca3(); // Function Engine.Pawn.*d2bc061ca3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd018
	void *a7b2c687f7(); // Function Engine.Pawn.*a7b2c687f7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe508
	void *b4938e18ab(); // Function Engine.Pawn.*b4938e18ab // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb5f30
	void *cb88bbbff9(); // Function Engine.Pawn.*cb88bbbff9 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9a68
	void AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x6bb0acc
	void *5f4189de1b(); // Function Engine.Pawn.*5f4189de1b // Native|Public|BlueprintCallable // @ game+0x5ded7a0
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x5e6994c
	void *3c5cc3769a(); // Function Engine.Pawn.*3c5cc3769a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdb8d00
	void AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x6bb0a30
	void ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae40
};

// Class Engine.DataAsset
// Size: 0x38 (Inherited: 0x30)
struct UDataAsset : UObject {
	struct UClass* *cdb62082ca; // 0x30(0x08)
};

// Class Engine.SceneComponent
// Size: 0x470 (Inherited: 0x200)
struct USceneComponent : UActorComponent {
	struct FName *cb3fc8827c; // 0x200(0x08)
	char pad_208[0x38]; // 0x208(0x38)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x240(0x10)
	char pad_250_0 : 1; // 0x250(0x01)
	char bReplicatesAttachmentReference : 1; // 0x250(0x01)
	char bReplicatesAttachment : 1; // 0x250(0x01)
	char *70c5e7a9b6 : 1; // 0x250(0x01)
	char pad_250_4 : 1; // 0x250(0x01)
	char bAbsoluteLocation : 1; // 0x250(0x01)
	char bAbsoluteRotation : 1; // 0x250(0x01)
	char bAbsoluteScale : 1; // 0x250(0x01)
	char bVisible : 1; // 0x251(0x01)
	char bHiddenInGame : 1; // 0x251(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x251(0x01)
	char *1dac92158a : 1; // 0x251(0x01)
	char bUseAttachParentBound : 1; // 0x251(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x251(0x01)
	char pad_251_6 : 2; // 0x251(0x01)
	char pad_252_0 : 3; // 0x252(0x01)
	char bAbsoluteTranslation : 1; // 0x252(0x01)
	char pad_252_4 : 4; // 0x252(0x01)
	char pad_253[0x1]; // 0x253(0x01)
	struct APhysicsVolume* PhysicsVolume; // 0x254(0x08)
	char pad_25C[0x24]; // 0x25c(0x24)
	struct FVector RelativeLocation; // 0x280(0x0c)
	char pad_28C[0x28]; // 0x28c(0x28)
	struct FVector *bf3a460e85; // 0x2b4(0x0c)
	char pad_2C0[0x20]; // 0x2c0(0x20)
	struct USceneComponent* AttachParent; // 0x2e0(0x08)
	struct FRotator RelativeRotation; // 0x2e8(0x0c)
	char pad_2F4[0xd]; // 0x2f4(0x0d)
	enum class *92a8d5bca4 DetailMode; // 0x301(0x01)
	char pad_302[0x2]; // 0x302(0x02)
	struct FVector RelativeScale3D; // 0x304(0x0c)
	enum class EComponentMobility Mobility; // 0x310(0x01)
	char pad_311[0x7]; // 0x311(0x07)
	SetProperty *912139fe50; // 0x318(0x50)
	char pad_368[0x8]; // 0x368(0x08)
	struct FVector RelativeTranslation; // 0x370(0x0c)
	char pad_37C[0x4]; // 0x37c(0x04)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x380(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x390(0x10)
	char pad_3A0[0xd0]; // 0x3a0(0xd0)

	void K2_SetWorldLocation(); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc5174
	void *30399f17ac(); // Function Engine.SceneComponent.*30399f17ac // Final|Native|Public|BlueprintCallable // @ game+0x6bce510
	void K2_SetRelativeTransform(); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc4f48
	void *a82e4c11f1(); // Function Engine.SceneComponent.*a82e4c11f1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc534c
	void K2_SetRelativeLocation(); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xd18bb4
	void K2_AddRelativeLocation(); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc1ac8
	void *0281884c9e(); // Function Engine.SceneComponent.*0281884c9e // Final|Native|Public|BlueprintCallable // @ game+0x6bce880
	void *9269d42730(); // Function Engine.SceneComponent.*9269d42730 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe9d8
	void *8f25590c73(); // Function Engine.SceneComponent.*8f25590c73 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaba0
	void *431ade8cc7(); // Function Engine.SceneComponent.*431ade8cc7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc35b4
	void *e1a45b5fe3(); // Function Engine.SceneComponent.*e1a45b5fe3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd56d60
	void K2_SetRelativeRotation(); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x8d7bb8
	void K2_AddWorldOffset(); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc1e60
	void *0f8df46b26(); // Function Engine.SceneComponent.*0f8df46b26 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9834
	void *cc0c29c29b(); // Function Engine.SceneComponent.*cc0c29c29b // Final|Native|Public|BlueprintCallable // @ game+0x6bd1da0
	void K2_AddRelativeRotation(); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc1c94
	void DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x6bb6990
	void K2_AddWorldTransform(); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc2210
	void *b4af2a3e8b(); // Function Engine.SceneComponent.*b4af2a3e8b // Final|Native|Public|BlueprintCallable // @ game+0xde2890
	void *63635bbd26(); // Function Engine.SceneComponent.*63635bbd26 // Final|Native|Public|BlueprintCallable // @ game+0x6bce91c
	void OnRep_Visibility(); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x6bc6674
	void K2_AddLocalTransform(); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc189c
	void IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc081c
	void *d843f2564c(); // Function Engine.SceneComponent.*d843f2564c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6bc4
	void *3e34911a72(); // Function Engine.SceneComponent.*3e34911a72 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd1994
	void K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc16c4
	void *dd99459d4b(); // Function Engine.SceneComponent.*dd99459d4b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbeb34
	void *b499c4ea3e(); // Function Engine.SceneComponent.*b499c4ea3e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9968
	void *5828b2e365(); // Function Engine.SceneComponent.*5828b2e365 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbed54
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xe078ac
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xca1b10
	void *f756a0f59d(); // Function Engine.SceneComponent.*f756a0f59d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb58c
	void *f54ed8c40b(); // Function Engine.SceneComponent.*f54ed8c40b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba680
	void *47a7ed7776(); // Function Engine.SceneComponent.*47a7ed7776 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdae0
	void *2203da3c3b(); // Function Engine.SceneComponent.*2203da3c3b // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe3f8
	void *af76098df3(); // Function Engine.SceneComponent.*af76098df3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xf3c5fc
	void K2_AttachTo(); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x6bc273c
	void *cae9ec1747(); // Function Engine.SceneComponent.*cae9ec1747 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf3c8
	void *860e529060(); // Function Engine.SceneComponent.*860e529060 // Final|Native|Public|BlueprintCallable // @ game+0x6bc7cf8
	void *6899b690c6(); // Function Engine.SceneComponent.*6899b690c6 // Final|Native|Public|BlueprintCallable // @ game+0x6bcab74
	void *91da404789(); // Function Engine.SceneComponent.*91da404789 // Final|Native|Public|BlueprintCallable // @ game+0x6bc2adc
	void *a16ae93b8c(); // Function Engine.SceneComponent.*a16ae93b8c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe96c
	void *007b399f94(); // Function Engine.SceneComponent.*007b399f94 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfc60
	void *b9705d1983(); // Function Engine.SceneComponent.*b9705d1983 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbebec
	void K2_SetWorldRotation(); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc557c
	void *76907d1282(); // Function Engine.SceneComponent.*76907d1282 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc4d18
	void *8c7d8b49f7(); // Function Engine.SceneComponent.*8c7d8b49f7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba720
	void *05a07db4bd(); // Function Engine.SceneComponent.*05a07db4bd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc3638
	void ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x6bd2b30
	void *bac6a64c08(); // Function Engine.SceneComponent.*bac6a64c08 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbec9c
	void *51f025391d(); // Function Engine.SceneComponent.*51f025391d // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e9a128
	void K2_SetWorldTransform(); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc5754
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xe078ac
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xd8de90
	void K2_AddWorldRotation(); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc2038
	void *1f50dc4b23(); // Function Engine.SceneComponent.*1f50dc4b23 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe764
	void SetVisibility(); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xde39c0
	void K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc367c
	void *d6ea9645a8(); // Function Engine.SceneComponent.*d6ea9645a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0xe05860
	void K2_AddLocalOffset(); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc14ec
};

// Class Engine.PrimitiveComponent
// Size: 0x9b0 (Inherited: 0x470)
struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x470(0x04)
	float LDMaxDrawDistance; // 0x474(0x04)
	float CachedMaxDrawDistance; // 0x478(0x04)
	enum class *4c2c3fa7ba *eb729ee19c; // 0x47c(0x01)
	enum class *4c2c3fa7ba *4abdb2d2ee; // 0x47d(0x01)
	char pad_47E[0x2]; // 0x47e(0x02)
	char pad_480_0 : 3; // 0x480(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x480(0x01)
	char bGenerateOverlapEvents : 1; // 0x480(0x01)
	char bMultiBodyOverlap : 1; // 0x480(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x480(0x01)
	char bTraceComplexOnMove : 1; // 0x480(0x01)
	char bDisableForceFromCharacter : 1; // 0x481(0x01)
	char bReturnMaterialOnMove : 1; // 0x481(0x01)
	char *09f6c4c3d1 : 1; // 0x481(0x01)
	char bAllowCullDistanceVolume : 1; // 0x481(0x01)
	char bImportantMesh : 1; // 0x481(0x01)
	char bOverrideCullingDistances : 1; // 0x481(0x01)
	char pad_481_6 : 2; // 0x481(0x01)
	char pad_482[0x2]; // 0x482(0x02)
	float HLODScreenSize; // 0x484(0x04)
	char *6d95e74c7f : 1; // 0x488(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x488(0x01)
	char bRenderInMainPass : 1; // 0x488(0x01)
	char bRenderInMono : 1; // 0x488(0x01)
	char bOwnerNoSee : 1; // 0x488(0x01)
	char bOnlyOwnerSee : 1; // 0x488(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x488(0x01)
	char bUseAsOccluder : 1; // 0x488(0x01)
	char bForceAsOccluder : 1; // 0x489(0x01)
	char bForceOcclusionQuerying : 1; // 0x489(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x489(0x01)
	char *2ec0cf6207 : 1; // 0x489(0x01)
	char bForceMipStreaming : 1; // 0x489(0x01)
	char *105359d223 : 1; // 0x489(0x01)
	char pad_489_6 : 1; // 0x489(0x01)
	char CastShadow : 1; // 0x489(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x48a(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x48a(0x01)
	char bCastDynamicShadow : 1; // 0x48a(0x01)
	char bCastStaticShadow : 1; // 0x48a(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x48a(0x01)
	char bSelfShadowOnly : 1; // 0x48a(0x01)
	char bCastFarShadow : 1; // 0x48a(0x01)
	char bCastInsetShadow : 1; // 0x48a(0x01)
	char bCastCinematicShadow : 1; // 0x48b(0x01)
	char bCastHiddenShadow : 1; // 0x48b(0x01)
	char bCastShadowAsTwoSided : 1; // 0x48b(0x01)
	char bLightAsIfStatic : 1; // 0x48b(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x48b(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x48b(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x48b(0x01)
	char bIgnoreRadialImpulse : 1; // 0x48b(0x01)
	char bIgnoreRadialForce : 1; // 0x48c(0x01)
	char bApplyImpulseOnDamage : 1; // 0x48c(0x01)
	char bSyncBodySleep : 1; // 0x48c(0x01)
	char *1e5038da00 : 1; // 0x48c(0x01)
	char *0f77398d5f : 1; // 0x48c(0x01)
	char *c1c03669ea : 1; // 0x48c(0x01)
	char bRenderCustomDepth : 1; // 0x48c(0x01)
	char pad_48C_7 : 1; // 0x48c(0x01)
	char pad_48D_0 : 7; // 0x48d(0x01)
	char *7ea77ae49c : 1; // 0x48d(0x01)
	char *d5b1d4efdd : 1; // 0x48e(0x01)
	char *634898d6e3 : 1; // 0x48e(0x01)
	char pad_48E_2 : 6; // 0x48e(0x01)
	char pad_48F[0x1]; // 0x48f(0x01)
	enum class EDecalChannel DecalChannel; // 0x490(0x01)
	enum class *c276e29a27 IndoorOutdoorMask; // 0x491(0x01)
	struct FLightingChannels LightingChannels; // 0x492(0x03)
	enum class *5e872d5d99 IndirectLightingCacheQuality; // 0x495(0x01)
	bool CustomDepthStencilValue; // 0x496(0x01)
	enum class *e33f967072 CustomDepthStencilWriteMask; // 0x497(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x498(0x10)
	int32 TranslucencySortPriority; // 0x4a8(0x04)
	int32 *bc309c15af; // 0x4ac(0x04)
	char pad_4B0[0x4]; // 0x4b0(0x04)
	float LpvBiasMultiplier; // 0x4b4(0x04)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct FBodyInstance BodyInstance; // 0x4c0(0x240)
	char pad_700[0x8]; // 0x700(0x08)
	enum class EHasCustomNavigableGeometry *36f10e7fa8; // 0x708(0x01)
	char pad_709[0x3b]; // 0x709(0x3b)
	float BoundsScale; // 0x744(0x04)
	float *990edc28ca; // 0x748(0x04)
	float *680d1c60d0; // 0x74c(0x04)
	float *ba01ced785; // 0x750(0x04)
	enum class *7235c251e5 CanBeCharacterBase; // 0x754(0x01)
	char pad_755[0x1]; // 0x755(0x01)
	enum class *7235c251e5 CanCharacterStepUpOn; // 0x756(0x01)
	char pad_757[0x1]; // 0x757(0x01)
	struct TArray<struct AActor*> *23831abfcf; // 0x758(0x10)
	struct TArray<struct UPrimitiveComponent*> *0c87b28730; // 0x768(0x10)
	char pad_778[0xb8]; // 0x778(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x830(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x840(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x850(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x860(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x870(0x10)
	char pad_880[0x10]; // 0x880(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x890(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x8a0(0x10)
	struct FMulticastDelegate OnClicked; // 0x8b0(0x10)
	struct FMulticastDelegate OnReleased; // 0x8c0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x8d0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x8e0(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x8f0(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x900(0x10)
	char pad_910[0x28]; // 0x910(0x28)
	struct UPrimitiveComponent* *aef56929f8; // 0x938(0x08)
	struct UPrimitiveComponent* *0cf5ac713e; // 0x940(0x08)
	struct F*254b7d2b0f *162fbfca55; // 0x948(0x58)
	char pad_9A0[0x10]; // 0x9a0(0x10)

	void *e9db8211c2(); // Function Engine.PrimitiveComponent.*e9db8211c2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc39a4
	void *5ba0e047ef(); // Function Engine.PrimitiveComponent.*5ba0e047ef // Native|Public|BlueprintCallable // @ game+0x6bcb640
	void CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x6bb6008
	void *83d2d5c58f(); // Function Engine.PrimitiveComponent.*83d2d5c58f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc04e8
	void *2355b14434(); // Function Engine.PrimitiveComponent.*2355b14434 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdb18
	void CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x6bb61bc
	void *64501b49de(); // Function Engine.PrimitiveComponent.*64501b49de // Final|Native|Public|BlueprintCallable // @ game+0x6bcc804
	void *52312be303(); // Function Engine.PrimitiveComponent.*52312be303 // Final|Native|Public|BlueprintCallable // @ game+0x6bcd72c
	void *28aecd6f59(); // Function Engine.PrimitiveComponent.*28aecd6f59 // Final|Native|Public|BlueprintCallable // @ game+0x6bb3488
	void SetMassScale(); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x6bcf228
	void *523a890fe3(); // Function Engine.PrimitiveComponent.*523a890fe3 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbe62c
	void AddForceAtLocation(); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb125c
	void *4696406aa4(); // Function Engine.PrimitiveComponent.*4696406aa4 // Final|Native|Public|BlueprintCallable // @ game+0x6bbaa00
	void *d97262aee0(); // Function Engine.PrimitiveComponent.*d97262aee0 // Native|Public|BlueprintCallable // @ game+0x6bcf8cc
	void AddImpulse(); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb17bc
	void *d81824b167(); // Function Engine.PrimitiveComponent.*d81824b167 // Final|Native|Public|BlueprintCallable // @ game+0x6bbf960
	void *53ce351ab3(); // Function Engine.PrimitiveComponent.*53ce351ab3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaa38
	void SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcb540
	void SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x6bcfca0
	void *2457fa2026(); // Function Engine.PrimitiveComponent.*2457fa2026 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdc4c
	void *c547ccf43f(); // Function Engine.PrimitiveComponent.*c547ccf43f // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bba554
	void *2a28a4ceb1(); // Function Engine.PrimitiveComponent.*2a28a4ceb1 // Final|Native|Public|BlueprintCallable // @ game+0x6bcd7c4
	void *b8614f6ee8(); // Function Engine.PrimitiveComponent.*b8614f6ee8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd28c
	void GetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xe28794
	void *c0fc59eca2(); // Function Engine.PrimitiveComponent.*c0fc59eca2 // Native|Public|BlueprintCallable // @ game+0x6bcb3ac
	void *48b0674a6b(); // Function Engine.PrimitiveComponent.*48b0674a6b // Final|Native|Public|BlueprintCallable // @ game+0x6bbf880
	void *2726371f61(); // Function Engine.PrimitiveComponent.*2726371f61 // Native|Public|BlueprintCallable // @ game+0x6bd11c0
	void *8e06d61cd2(); // Function Engine.PrimitiveComponent.*8e06d61cd2 // Native|Public|BlueprintCallable // @ game+0xdac440
	void *7d15f33df8(); // Function Engine.PrimitiveComponent.*7d15f33df8 // Native|Public|BlueprintCallable // @ game+0xe31a58
	void *2fcd5dc4f1(); // Function Engine.PrimitiveComponent.*2fcd5dc4f1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0588
	void *af2cc12a58(); // Function Engine.PrimitiveComponent.*af2cc12a58 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2e08
	void *6147859fcb(); // Function Engine.PrimitiveComponent.*6147859fcb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd330
	void *b8cf4b4c35(); // Function Engine.PrimitiveComponent.*b8cf4b4c35 // Final|Native|Public|BlueprintCallable // @ game+0x6bd0404
	void *e13e475844(); // Function Engine.PrimitiveComponent.*e13e475844 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf79c
	void SetCollisionObjectType(); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x6bccef8
	void *c32c2b30ad(); // Function Engine.PrimitiveComponent.*c32c2b30ad // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb21d0
	void *3a3aa0f9aa(); // Function Engine.PrimitiveComponent.*3a3aa0f9aa // Native|Public|BlueprintCallable // @ game+0x6bcd024
	void *7f0b02410b(); // Function Engine.PrimitiveComponent.*7f0b02410b // Native|Public|BlueprintCallable // @ game+0x6bcd594
	void *714e0a606e(); // Function Engine.PrimitiveComponent.*714e0a606e // Final|Native|Public|BlueprintCallable // @ game+0x6bcd854
	void *90432a4b88(); // Function Engine.PrimitiveComponent.*90432a4b88 // Native|Public|BlueprintCallable // @ game+0x6bcfc0c
	void *b735fad47e(); // Function Engine.PrimitiveComponent.*b735fad47e // Final|Native|Public|BlueprintCallable // @ game+0x6bd0f1c
	void *4fedb1a6a3(); // Function Engine.PrimitiveComponent.*4fedb1a6a3 // Native|Public|BlueprintCallable // @ game+0x6bcee8c
	void *e87bee575d(); // Function Engine.PrimitiveComponent.*e87bee575d // Final|Native|Public|BlueprintCallable // @ game+0x6bcf964
	void *aaacbbdb6c(); // Function Engine.PrimitiveComponent.*aaacbbdb6c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5dad1c4
	void *78d8a0af1f(); // Function Engine.PrimitiveComponent.*78d8a0af1f // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bd18c0
	void SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bccb88
	void *19a69f011f(); // Function Engine.PrimitiveComponent.*19a69f011f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba854
	void *0de970a16f(); // Function Engine.PrimitiveComponent.*0de970a16f // Final|Native|Public|BlueprintCallable // @ game+0x6bc773c
	void SetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xa915f4
	void AddAngularImpulse(); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb0848
	void AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb18fc
	void SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0xe55f8c
	void *74fc74b263(); // Function Engine.PrimitiveComponent.*74fc74b263 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd1cc
	void *bd0ec46553(); // Function Engine.PrimitiveComponent.*bd0ec46553 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bcb448
	void SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x6bc6214
	void *48305203f7(); // Function Engine.PrimitiveComponent.*48305203f7 // Native|Public|BlueprintCallable // @ game+0x6bcf30c
	void *d260a6c731(); // Function Engine.PrimitiveComponent.*d260a6c731 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba9d8
	void *47ec021dd1(); // Function Engine.PrimitiveComponent.*47ec021dd1 // Native|Public|BlueprintCallable // @ game+0x6bc7cb0
	void *40b80e1f86(); // Function Engine.PrimitiveComponent.*40b80e1f86 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb98d4
	void *04a08b51bb(); // Function Engine.PrimitiveComponent.*04a08b51bb // Native|Public|BlueprintCallable // @ game+0x5e24dec
	void CreateAndSetMaterialInstanceDynamic(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x6bb6118
	void *7614d2f54e(); // Function Engine.PrimitiveComponent.*7614d2f54e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0128
	void *603b323c81(); // Function Engine.PrimitiveComponent.*603b323c81 // Final|Native|Public|BlueprintCallable // @ game+0x6bb34a4
	void *448cf7e0f2(); // Function Engine.PrimitiveComponent.*448cf7e0f2 // Native|Public|BlueprintCallable // @ game+0x6bd2e14
	void *0f1b74141b(); // Function Engine.PrimitiveComponent.*0f1b74141b // Final|Native|Public|BlueprintCallable // @ game+0x6bcfab4
	void AddTorque(); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb2690
	void K2_LineTraceComponent(); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc3a34
	void *2e26aaaf30(); // Function Engine.PrimitiveComponent.*2e26aaaf30 // Native|Public|BlueprintCallable // @ game+0x6bccf90
	void GetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bbe57c
	void GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdfec
	void GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd1a0
	void *09ce12ba0b(); // Function Engine.PrimitiveComponent.*09ce12ba0b // Native|Public|BlueprintCallable // @ game+0x6bcf0fc
	void *85d8176587(); // Function Engine.PrimitiveComponent.*85d8176587 // Native|Public|BlueprintCallable // @ game+0x6bbfc38
	void *6cbdd1633c(); // Function Engine.PrimitiveComponent.*6cbdd1633c // Final|Native|Public|BlueprintCallable // @ game+0x6bd0498
	void *90cc3021c0(); // Function Engine.PrimitiveComponent.*90cc3021c0 // Final|Native|Public|BlueprintCallable // @ game+0x6bd052c
	void GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbddf4
	void *083545280a(); // Function Engine.PrimitiveComponent.*083545280a // Final|Native|Public|BlueprintCallable // @ game+0x6bb6090
	void SetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xa95790
	void *8022a6e53e(); // Function Engine.PrimitiveComponent.*8022a6e53e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb1ffc
	void *67e552295b(); // Function Engine.PrimitiveComponent.*67e552295b // Native|Public|BlueprintCallable // @ game+0x6bcd0bc
	void *f1e65a30d8(); // Function Engine.PrimitiveComponent.*f1e65a30d8 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc81a4
	void AddForceAtLocationLocal(); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb13a8
	void *6e71cecd23(); // Function Engine.PrimitiveComponent.*6e71cecd23 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc224
	void CreateDynamicMaterialInstance(); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x6bb62ac
	void *95fc0388db(); // Function Engine.PrimitiveComponent.*95fc0388db // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc3a00
	void AddForce(); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb111c
	void *99eb55293a(); // Function Engine.PrimitiveComponent.*99eb55293a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba9b0
	void *419ebb4754(); // Function Engine.PrimitiveComponent.*419ebb4754 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc39d0
	void *638da52b6d(); // Function Engine.PrimitiveComponent.*638da52b6d // Final|Native|Public|BlueprintCallable // @ game+0x6bcca5c
	void SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x6bcedf0
};

// Class Engine.MeshComponent
// Size: 0xab0 (Inherited: 0x9b0)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x9a8(0x10)
	char pad_9C0[0xf0]; // 0x9c0(0xf0)

	void *9bc7eb317f(); // Function Engine.MeshComponent.*9bc7eb317f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd508
	void *7c084373ce(); // Function Engine.MeshComponent.*7c084373ce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0300
	void *372cae974e(); // Function Engine.MeshComponent.*372cae974e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd3d4
	void *e12aafe669(); // Function Engine.MeshComponent.*e12aafe669 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd47c
	void *dd190eacfc(); // Function Engine.MeshComponent.*dd190eacfc // Final|Native|Public|BlueprintCallable // @ game+0x9d5474
	void *00ffa1d77b(); // Function Engine.MeshComponent.*00ffa1d77b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x9d4cd8
};

// Class Engine.StaticMeshComponent
// Size: 0xb50 (Inherited: 0xab0)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xab0(0x04)
	int32 *9f0fda2ed8; // 0xab4(0x04)
	bool bOverrideMinLOD; // 0xab8(0x01)
	char pad_AB9[0x3]; // 0xab9(0x03)
	int32 MinLOD; // 0xabc(0x04)
	struct UStaticMesh* StaticMesh; // 0xac0(0x08)
	bool bOverrideWireframeColor; // 0xac8(0x01)
	char pad_AC9[0x3]; // 0xac9(0x03)
	struct FColor WireframeColorOverride; // 0xacc(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xad0(0x10)
	char *138a858590 : 1; // 0xae0(0x01)
	char *c1a735b803 : 1; // 0xae0(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xae0(0x01)
	char *b431fce4a2 : 1; // 0xae0(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xae0(0x01)
	char bOverrideLightMapRes : 1; // 0xae0(0x01)
	char pad_AE0_6 : 2; // 0xae0(0x01)
	char pad_AE1[0x3]; // 0xae1(0x03)
	int32 OverriddenLightMapRes; // 0xae4(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xae8(0x01)
	char pad_AE8_1 : 7; // 0xae8(0x01)
	char pad_AE9[0x3]; // 0xae9(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xaec(0x04)
	float StreamingDistanceMultiplier; // 0xaf0(0x04)
	int32 *12d8adf087; // 0xaf4(0x04)
	char *402c8627cc : 1; // 0xaf8(0x01)
	char pad_AF8_1 : 7; // 0xaf8(0x01)
	char pad_AF9[0x7]; // 0xaf9(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xb00(0x10)
	struct TArray<struct F*87fceb50c7> *5ff7bc7629; // 0xb10(0x10)
	struct TArray<struct F*8760f7f7d5> *ad72999b02; // 0xb20(0x10)
	bool *24446b5829; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	struct F*2ca2c467d8 LightmassSettings; // 0xb34(0x18)
	char pad_B4C[0x4]; // 0xb4c(0x04)

	void *11ee32cc52(); // Function Engine.StaticMeshComponent.*11ee32cc52 // Final|Native|Public|BlueprintCallable // @ game+0x6bcdd48
	void *8243903fcf(); // Function Engine.StaticMeshComponent.*8243903fcf // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd098
	void SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x6642cd8
	void OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x6bc65cc
};

// Class Engine.SkinnedMeshComponent
// Size: 0xc50 (Inherited: 0xab0)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xab0(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xab8(0x08)
	char pad_AC0[0x60]; // 0xac0(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb20(0x01)
	char pad_B20_1 : 7; // 0xb20(0x01)
	char pad_B21[0x7]; // 0xb21(0x07)
	struct TArray<struct FBoxSphereBounds> *7e707d842a; // 0xb28(0x10)
	char pad_B38[0x20]; // 0xb38(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xb58(0x08)
	int32 ForcedLodModel; // 0xb60(0x04)
	int32 MinLodModel; // 0xb64(0x04)
	char pad_B68[0x10]; // 0xb68(0x10)
	struct TArray<struct F*716b1d68f9> LODInfo; // 0xb78(0x10)
	float StreamingDistanceMultiplier; // 0xb88(0x04)
	struct FColor WireframeColor; // 0xb8c(0x04)
	char *3f2cd63a77 : 1; // 0xb90(0x01)
	char *f9ca417f7f : 1; // 0xb90(0x01)
	char bDisableMorphTarget : 1; // 0xb90(0x01)
	char *490444df87 : 1; // 0xb90(0x01)
	char pad_B90_4 : 4; // 0xb90(0x01)
	char pad_B91[0x17]; // 0xb91(0x17)
	char bPerBoneMotionBlur : 1; // 0xba8(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xba8(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xba8(0x01)
	char bSyncAttachParentLOD : 1; // 0xba8(0x01)
	char pad_BA8_4 : 4; // 0xba8(0x01)
	char pad_BA9[0x3]; // 0xba9(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xbac(0x01)
	char pad_BAD[0x3]; // 0xbad(0x03)
	char *6f302faed4 : 1; // 0xbb0(0x01)
	char *71246305c4 : 1; // 0xbb0(0x01)
	char *8f160de05a : 1; // 0xbb0(0x01)
	char pad_BB0_3 : 5; // 0xbb0(0x01)
	char pad_BB1[0x3]; // 0xbb1(0x03)
	bool *f69c993587; // 0xbb4(0x01)
	char pad_BB5[0x3]; // 0xbb5(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xbb8(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xbb8(0x01)
	char pad_BB8_2 : 6; // 0xbb8(0x01)
	char pad_BB9[0x3]; // 0xbb9(0x03)
	char bRenderStatic : 1; // 0xbbc(0x01)
	char pad_BBC_1 : 7; // 0xbbc(0x01)
	char pad_BBD[0x3]; // 0xbbd(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xbc0(0x04)
	char *b1a1d2d22b : 1; // 0xbc4(0x01)
	char pad_BC4_1 : 7; // 0xbc4(0x01)
	char pad_BC5[0xf]; // 0xbc5(0x0f)
	struct FBoxSphereBounds *e8d742ebf8; // 0xbd4(0x1c)
	bool *4378cc44ba; // 0xbf0(0x01)
	bool bEnableUpdateRateOptimizations; // 0xbf1(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xbf2(0x01)
	char pad_BF3[0x4e]; // 0xbf3(0x4e)
	bool *55af0130d7; // 0xc41(0x01)
	bool *78147857b9; // 0xc42(0x01)
	char pad_C43[0xd]; // 0xc43(0x0d)

	void *4394f2b79a(); // Function Engine.SkinnedMeshComponent.*4394f2b79a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf5fb4
	void *838df13444(); // Function Engine.SkinnedMeshComponent.*838df13444 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf6784
	void *026700c446(); // Function Engine.SkinnedMeshComponent.*026700c446 // Final|Native|Public|BlueprintCallable // @ game+0x6c16cd0
	void *68bb8d275b(); // Function Engine.SkinnedMeshComponent.*68bb8d275b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bdd788
	void *ba1220499b(); // Function Engine.SkinnedMeshComponent.*ba1220499b // Final|Native|Public|BlueprintCallable // @ game+0x6c1677c
	void *e158c5febe(); // Function Engine.SkinnedMeshComponent.*e158c5febe // Final|Native|Public|BlueprintCallable // @ game+0x6c1d23c
	void *8f2840426b(); // Function Engine.SkinnedMeshComponent.*8f2840426b // Final|Native|Public|BlueprintCallable // @ game+0x6c1d10c
	void *c3e2b97429(); // Function Engine.SkinnedMeshComponent.*c3e2b97429 // Final|Native|Public|BlueprintCallable // @ game+0x6c2beb8
	void *4314e5075f(); // Function Engine.SkinnedMeshComponent.*4314e5075f // Final|Native|Public|BlueprintCallable // @ game+0x6be4cd4
	void *cd65a7e2a2(); // Function Engine.SkinnedMeshComponent.*cd65a7e2a2 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c2b8ac
	void *10e2fc0989(); // Function Engine.SkinnedMeshComponent.*10e2fc0989 // Final|Native|Public|BlueprintCallable // @ game+0x6bfea68
	void GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf07cc
	void *eac8bd7d31(); // Function Engine.SkinnedMeshComponent.*eac8bd7d31 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8cf0
	void *d05921b40e(); // Function Engine.SkinnedMeshComponent.*d05921b40e // Final|Native|Public|BlueprintCallable // @ game+0x6c1a47c
	void *fbe2178ccc(); // Function Engine.SkinnedMeshComponent.*fbe2178ccc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0a88
	void *1f742918c4(); // Function Engine.SkinnedMeshComponent.*1f742918c4 // Final|Native|Public|BlueprintCallable // @ game+0x6c16c20
	void *8612ed82dd(); // Function Engine.SkinnedMeshComponent.*8612ed82dd // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bed4c4
	void *a26716e360(); // Function Engine.SkinnedMeshComponent.*a26716e360 // Final|Native|Public|BlueprintCallable // @ game+0x6bfd3c4
	void *dafdadd3ee(); // Function Engine.SkinnedMeshComponent.*dafdadd3ee // Native|Public|BlueprintCallable // @ game+0x6c1e16c
	void SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x6c1f534
	void *ebb6e42b77(); // Function Engine.SkinnedMeshComponent.*ebb6e42b77 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c2bc80
	void SetSkinWeightOverride(); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c1f6e0
	void *f9a2b14326(); // Function Engine.SkinnedMeshComponent.*f9a2b14326 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c22860
	void *fa9a237ed2(); // Function Engine.SkinnedMeshComponent.*fa9a237ed2 // Final|Native|Public|BlueprintCallable // @ game+0x6be4970
	void *b1f7e668fd(); // Function Engine.SkinnedMeshComponent.*b1f7e668fd // Final|Native|Public|BlueprintCallable // @ game+0x6c1f09c
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1150 (Inherited: 0xc50)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xc50(0x08)
	struct UClass* AnimClass; // 0xc58(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xc60(0x08)
	struct TArray<struct UAnimInstance*> *03c8c15a34; // 0xc68(0x10)
	struct UAnimInstance* *20e7dd5deb; // 0xc78(0x08)
	struct F*26e8fbfd7d AnimationData; // 0xc80(0x18)
	char pad_C98[0x30]; // 0xc98(0x30)
	struct TArray<struct FTransform> *9848550080; // 0xcc8(0x10)
	struct TArray<struct FTransform> *394e69fb9f; // 0xcd8(0x10)
	char pad_CE8[0x20]; // 0xce8(0x20)
	float GlobalAnimRateScale; // 0xd08(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd0c(0x01)
	enum class *05c097b6a7 PhysicsTransformUpdateMode; // 0xd0d(0x01)
	char pad_D0E[0x1]; // 0xd0e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd0f(0x01)
	char pad_D10[0x4]; // 0xd10(0x04)
	char pad_D14_0 : 1; // 0xd14(0x01)
	char *c4bdbb1cf4 : 1; // 0xd14(0x01)
	char pad_D14_2 : 1; // 0xd14(0x01)
	char *6421e28158 : 1; // 0xd14(0x01)
	char pad_D14_4 : 2; // 0xd14(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd14(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd14(0x01)
	char bDisableClothSimulation : 1; // 0xd15(0x01)
	char pad_D15_1 : 2; // 0xd15(0x01)
	char bCollideWithEnvironment : 1; // 0xd15(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd15(0x01)
	char bLocalSpaceSimulation : 1; // 0xd15(0x01)
	char *9d44ba5ec9 : 1; // 0xd15(0x01)
	char bResetAfterTeleport : 1; // 0xd15(0x01)
	char pad_D16_0 : 1; // 0xd16(0x01)
	char bNoSkeletonUpdate : 1; // 0xd16(0x01)
	char bPauseAnims : 1; // 0xd16(0x01)
	char *ed86ed2e15 : 1; // 0xd16(0x01)
	char bEnablePerPolyCollision : 1; // 0xd16(0x01)
	char *c01750e849 : 1; // 0xd16(0x01)
	char *83c65effe5 : 1; // 0xd16(0x01)
	char *240877b930 : 1; // 0xd16(0x01)
	char *c9d93e6eb3 : 1; // 0xd17(0x01)
	char *0aa5f65cc4 : 1; // 0xd17(0x01)
	char *764f80ac00 : 1; // 0xd17(0x01)
	char *f76af3c9c8 : 1; // 0xd17(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd17(0x01)
	char *ff27a462a4 : 1; // 0xd17(0x01)
	char pad_D17_6 : 2; // 0xd17(0x01)
	char *67eb3862bf : 1; // 0xd18(0x01)
	char pad_D18_1 : 7; // 0xd18(0x01)
	char pad_D19_0 : 2; // 0xd19(0x01)
	char bDefaultLooping : 1; // 0xd19(0x01)
	char bDefaultPlaying : 1; // 0xd19(0x01)
	char pad_D19_4 : 4; // 0xd19(0x01)
	uint16 *fb5365b7ee; // 0xd1a(0x02)
	float ClothBlendWeight; // 0xd1c(0x04)
	struct FVector *0e1553491d; // 0xd20(0x0c)
	char pad_D2C[0x4]; // 0xd2c(0x04)
	struct UBodySetup* BodySetup; // 0xd30(0x08)
	float TeleportDistanceThreshold; // 0xd38(0x04)
	float TeleportRotationThreshold; // 0xd3c(0x04)
	struct FVector *bf2f3285e7; // 0xd40(0x0c)
	char pad_D4C[0x4]; // 0xd4c(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xd50(0x10)
	char pad_D60[0xe0]; // 0xd60(0xe0)
	struct UClass* *cf624e37bc; // 0xe40(0x08)
	char pad_E48[0x1e8]; // 0xe48(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1030(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1038(0x08)
	float DefaultPosition; // 0x1040(0x04)
	float DefaultPlayRate; // 0x1044(0x04)
	uint32 *f2bafb289a; // 0x1048(0x04)
	float *9553518a1b; // 0x104c(0x04)
	char pad_1050[0x100]; // 0x1050(0x100)

	void GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf6f38
	void *0419cb3ccb(); // Function Engine.SkeletalMeshComponent.*0419cb3ccb // Final|Native|Public|BlueprintCallable // @ game+0x6bedacc
	void SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x5cc020
	void *b948b16a82(); // Function Engine.SkeletalMeshComponent.*b948b16a82 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bf1590
	void SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x6c1e838
	void IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bff0a0
	void *1ad9295ccf(); // Function Engine.SkeletalMeshComponent.*1ad9295ccf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf099c
	void *50e0bcf134(); // Function Engine.SkeletalMeshComponent.*50e0bcf134 // Final|Native|Public|BlueprintCallable // @ game+0x6c2bf48
	void *003dacf78a(); // Function Engine.SkeletalMeshComponent.*003dacf78a // Final|Native|Public|BlueprintCallable // @ game+0x6be48c0
	void *c9ffb0a8f1(); // Function Engine.SkeletalMeshComponent.*c9ffb0a8f1 // Final|Native|Public|BlueprintCallable // @ game+0x6c2abf4
	void *3dac8111a3(); // Function Engine.SkeletalMeshComponent.*3dac8111a3 // Final|Native|Public|BlueprintCallable // @ game+0x6beee84
	void *c1dca80d01(); // Function Engine.SkeletalMeshComponent.*c1dca80d01 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8cbc
	void GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf69e0
	void *aaaa810782(); // Function Engine.SkeletalMeshComponent.*aaaa810782 // Final|Native|Public|BlueprintCallable // @ game+0x6c11fc8
	void *c11c201962(); // Function Engine.SkeletalMeshComponent.*c11c201962 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd99ec4
	void *b8e56f4e02(); // Function Engine.SkeletalMeshComponent.*b8e56f4e02 // Final|Native|Public|BlueprintCallable // @ game+0x6c11c50
	void *f4e23cce99(); // Function Engine.SkeletalMeshComponent.*f4e23cce99 // Final|Native|Public|BlueprintCallable // @ game+0x6c1e250
	void *8681bde224(); // Function Engine.SkeletalMeshComponent.*8681bde224 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c25344
	void *f469fdb44b(); // Function Engine.SkeletalMeshComponent.*f469fdb44b // Final|Native|Public|BlueprintCallable // @ game+0x6c192ac
	void *8cafec350a(); // Function Engine.SkeletalMeshComponent.*8cafec350a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0070
	void *df14d2ab1e(); // Function Engine.SkeletalMeshComponent.*df14d2ab1e // Final|Native|Public|BlueprintCallable // @ game+0x5cbea0
	void *7be67dd09b(); // Function Engine.SkeletalMeshComponent.*7be67dd09b // Final|Native|Public|BlueprintCallable // @ game+0x6c0c378
	void *205990b035(); // Function Engine.SkeletalMeshComponent.*205990b035 // Final|Native|Public|BlueprintCallable // @ game+0x6c138ac
	void *61816ece05(); // Function Engine.SkeletalMeshComponent.*61816ece05 // Final|Native|Public|BlueprintCallable // @ game+0x6c13a2c
	void *ab93cff151(); // Function Engine.SkeletalMeshComponent.*ab93cff151 // Final|Native|Public|BlueprintCallable // @ game+0x6c13818
	void *fe54059013(); // Function Engine.SkeletalMeshComponent.*fe54059013 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bffc74
	void *37cb4dcade(); // Function Engine.SkeletalMeshComponent.*37cb4dcade // Final|Native|Public|BlueprintCallable // @ game+0x6c1774c
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x5cc00c
	void *b5ab3112e7(); // Function Engine.SkeletalMeshComponent.*b5ab3112e7 // Final|Native|Public|BlueprintCallable // @ game+0x6c172ec
	void *e2357a32d5(); // Function Engine.SkeletalMeshComponent.*e2357a32d5 // Final|Native|Public|BlueprintCallable // @ game+0x6c1787c
	void *85a1ba9962(); // Function Engine.SkeletalMeshComponent.*85a1ba9962 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf727c
	void *2e33e16a05(); // Function Engine.SkeletalMeshComponent.*2e33e16a05 // Final|Native|Public|BlueprintCallable // @ game+0x6c18efc
	void *df6d5c3668(); // Function Engine.SkeletalMeshComponent.*df6d5c3668 // Final|Native|Public|BlueprintCallable // @ game+0x6c18fe8
	void *b0b3ecdf76(); // Function Engine.SkeletalMeshComponent.*b0b3ecdf76 // Final|Native|Public|BlueprintCallable // @ game+0x6bfe9b8
	void *cb275501dc(); // Function Engine.SkeletalMeshComponent.*cb275501dc // Final|Native|Public|BlueprintCallable // @ game+0x6c11cf4
	void *06a4843213(); // Function Engine.SkeletalMeshComponent.*06a4843213 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd7838
	void *958b26bc5a(); // Function Engine.SkeletalMeshComponent.*958b26bc5a // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xa16c88
	void *216855f3f1(); // Function Engine.SkeletalMeshComponent.*216855f3f1 // Final|Native|Public|BlueprintCallable // @ game+0x6bdc4d4
	void PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x6c0ceb8
	void *b7e5815bfd(); // Function Engine.SkeletalMeshComponent.*b7e5815bfd // Final|Native|Public|BlueprintCallable // @ game+0x6c13fec
	void *590bc738cc(); // Function Engine.SkeletalMeshComponent.*590bc738cc // Native|Public|BlueprintCallable // @ game+0x6c1d990
	void *cb270d2b61(); // Function Engine.SkeletalMeshComponent.*cb270d2b61 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6be04a4
	void *ccd384fcae(); // Function Engine.SkeletalMeshComponent.*ccd384fcae // Final|Native|Public|BlueprintCallable // @ game+0x6beee9c
	void *9b6a2e03c1(); // Function Engine.SkeletalMeshComponent.*9b6a2e03c1 // Final|Native|Public|BlueprintCallable // @ game+0xc7cdd0
	void SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0x5cbf54
	void *1e1fba0baa(); // Function Engine.SkeletalMeshComponent.*1e1fba0baa // Final|Native|Public|BlueprintCallable // @ game+0x6bfeb34
	void *2b1d6ec9be(); // Function Engine.SkeletalMeshComponent.*2b1d6ec9be // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c13674
	void *b19e6db2c0(); // Function Engine.SkeletalMeshComponent.*b19e6db2c0 // Native|Public|BlueprintCallable // @ game+0x6c15830
	void SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x6c14a4c
	void *8c46bc1c4b(); // Function Engine.SkeletalMeshComponent.*8c46bc1c4b // Final|Native|Public|BlueprintCallable // @ game+0x6bf1118
	void *45cb1ffac9(); // Function Engine.SkeletalMeshComponent.*45cb1ffac9 // Final|Native|Public|BlueprintCallable // @ game+0x5dee178
	void *dbb8691526(); // Function Engine.SkeletalMeshComponent.*dbb8691526 // Final|Native|Public|BlueprintCallable // @ game+0x6c13b70
	void *1bc40094b4(); // Function Engine.SkeletalMeshComponent.*1bc40094b4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfd27c
	void *a73016fcab(); // Function Engine.SkeletalMeshComponent.*a73016fcab // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf5eb8
	void *b38c1f41c3(); // Function Engine.SkeletalMeshComponent.*b38c1f41c3 // Final|Native|Public|BlueprintCallable // @ game+0x6c1d508
	void Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0x5cc094
	void *a9d045c57e(); // Function Engine.SkeletalMeshComponent.*a9d045c57e // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bd6f08
	void *ea3ca52eca(); // Function Engine.SkeletalMeshComponent.*ea3ca52eca // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd76a4
};

// Class Engine.LightComponentBase
// Size: 0x4a0 (Inherited: 0x470)
struct ULightComponentBase : USceneComponent {
	struct FGuid *a686b10c5d; // 0x468(0x10)
	float Brightness; // 0x478(0x04)
	float Intensity; // 0x47c(0x04)
	struct FColor LightColor; // 0x480(0x04)
	char bAffectsWorld : 1; // 0x484(0x01)
	char CastShadows : 1; // 0x484(0x01)
	char CastStaticShadows : 1; // 0x484(0x01)
	char CastDynamicShadows : 1; // 0x484(0x01)
	char bAffectTranslucentLighting : 1; // 0x484(0x01)
	char bCastVolumetricShadow : 1; // 0x484(0x01)
	float IndirectLightingIntensity; // 0x488(0x04)
	float VolumetricScatteringIntensity; // 0x48c(0x04)
	bool *8f19adf142; // 0x490(0x01)
	char pad_495_6 : 2; // 0x495(0x01)
	char pad_496[0xa]; // 0x496(0x0a)

	void *be965cf688(); // Function Engine.LightComponentBase.*be965cf688 // Final|Native|Public|BlueprintCallable // @ game+0x6c16e18
	void *fde7343060(); // Function Engine.LightComponentBase.*fde7343060 // Final|Native|Public|BlueprintCallable // @ game+0x6c16d84
	void *5cae41be78(); // Function Engine.LightComponentBase.*5cae41be78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf5410
};

// Class Engine.LightComponent
// Size: 0x590 (Inherited: 0x4a0)
struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x498(0x04)
	float MaxDrawDistance; // 0x49c(0x04)
	float *787d5d6e14; // 0x4a0(0x04)
	char bUseTemperature : 1; // 0x4a4(0x01)
	int32 ShadowMapChannel; // 0x4a8(0x04)
	float MinRoughness; // 0x4b0(0x04)
	float ShadowResolutionScale; // 0x4b4(0x04)
	float ShadowBias; // 0x4b8(0x04)
	float ShadowSharpen; // 0x4bc(0x04)
	float ContactShadowLength; // 0x4c0(0x04)
	char InverseSquaredFalloff : 1; // 0x4c4(0x01)
	char CastTranslucentShadows : 1; // 0x4c4(0x01)
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x4c4(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x4c4(0x01)
	char pad_4C4_5 : 3; // 0x4c4(0x01)
	char pad_4C5[0x3]; // 0x4c5(0x03)
	struct FLightingChannels LightingChannels; // 0x4c8(0x03)
	char pad_4CB[0x5]; // 0x4cb(0x05)
	struct UMaterialInterface* LightFunctionMaterial; // 0x4d0(0x08)
	struct FVector LightFunctionScale; // 0x4d8(0x0c)
	char pad_4E4[0x4]; // 0x4e4(0x04)
	struct U*cf31a3bb9b* IESTexture; // 0x4e8(0x08)
	char bUseIESBrightness : 1; // 0x4f0(0x01)
	char pad_4F0_1 : 7; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	float IESBrightnessScale; // 0x4f4(0x04)
	float LightFunctionFadeDistance; // 0x4f8(0x04)
	float DisabledBrightness; // 0x4fc(0x04)
	char bEnableLightShaftBloom : 1; // 0x500(0x01)
	char pad_500_1 : 7; // 0x500(0x01)
	char pad_501[0x3]; // 0x501(0x03)
	float BloomScale; // 0x504(0x04)
	float BloomThreshold; // 0x508(0x04)
	struct FColor BloomTint; // 0x50c(0x04)
	bool bUseRayTracedDistanceFieldShadows; // 0x510(0x01)
	char pad_511[0x3]; // 0x511(0x03)
	float RayStartOffsetDepthScale; // 0x514(0x04)
	char pad_518[0x78]; // 0x518(0x78)

	void *5ca15ddb64(); // Function Engine.LightComponent.*5ca15ddb64 // Final|Native|Public|BlueprintCallable // @ game+0x6c1bf6c
	void SetIntensity(); // Function Engine.LightComponent.SetIntensity // Final|Native|Public|BlueprintCallable // @ game+0x6c1b7c8
	void *63cb3ee82f(); // Function Engine.LightComponent.*63cb3ee82f // Final|Native|Public|BlueprintCallable // @ game+0x6c1c004
	void *96c92cd704(); // Function Engine.LightComponent.*96c92cd704 // Final|Native|Public|BlueprintCallable // @ game+0x6c1aec8
	void *6e138f82c4(); // Function Engine.LightComponent.*6e138f82c4 // Final|Native|Public|BlueprintCallable // @ game+0x6c15658
	void *18a784e23c(); // Function Engine.LightComponent.*18a784e23c // Final|Native|Public|BlueprintCallable // @ game+0x6c156f0
	void *46e3ca3f4d(); // Function Engine.LightComponent.*46e3ca3f4d // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c1c094
	void *258006e252(); // Function Engine.LightComponent.*258006e252 // Final|Native|Public|BlueprintCallable // @ game+0x6c1911c
	void *bce07c35db(); // Function Engine.LightComponent.*bce07c35db // Final|Native|Public|BlueprintCallable // @ game+0x6c22ecc
	void *f46513e72c(); // Function Engine.LightComponent.*f46513e72c // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c15788
	void *32714f25cf(); // Function Engine.LightComponent.*32714f25cf // Final|Native|Public|BlueprintCallable // @ game+0x6c135e0
	void *219ca27b92(); // Function Engine.LightComponent.*219ca27b92 // Final|Native|Public|BlueprintCallable // @ game+0x6c21748
	void *cbc79675bf(); // Function Engine.LightComponent.*cbc79675bf // Final|Native|Public|BlueprintCallable // @ game+0x6c13510
	void *a5a07d6e2d(); // Function Engine.LightComponent.*a5a07d6e2d // Final|Native|Public|BlueprintCallable // @ game+0x6c1b014
	void *c0e895a11e(); // Function Engine.LightComponent.*c0e895a11e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c1bc80
	void *bfb5d300ac(); // Function Engine.LightComponent.*bfb5d300ac // Final|Native|Public|BlueprintCallable // @ game+0x6c1bed4
};

// Class Engine.PointLightComponent
// Size: 0x5b0 (Inherited: 0x590)
struct UPointLightComponent : ULightComponent {
	float Radius; // 0x588(0x04)
	float AttenuationRadius; // 0x58c(0x04)
	char bUseInverseSquaredFalloff : 1; // 0x590(0x01)
	float LightFalloffExponent; // 0x594(0x04)
	float SourceRadius; // 0x598(0x04)
	float SourceLength; // 0x59c(0x04)
	struct F*d176fa0a45 LightmassSettings; // 0x5a0(0x0c)

	void *80f81e4215(); // Function Engine.PointLightComponent.*80f81e4215 // Final|Native|Public|BlueprintCallable // @ game+0x6c1fc18
	void *5a24c02c9d(); // Function Engine.PointLightComponent.*5a24c02c9d // Final|Native|Public|BlueprintCallable // @ game+0x6c1fb80
	void *485d6ff949(); // Function Engine.PointLightComponent.*485d6ff949 // Final|Native|Public|BlueprintCallable // @ game+0x6c1be3c
	void SetAttenuationRadius(); // Function Engine.PointLightComponent.SetAttenuationRadius // Final|Native|Public|BlueprintCallable // @ game+0x6c1530c
};

// Class Engine.SpotLightComponent
// Size: 0x5c0 (Inherited: 0x5b0)
struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x5b0(0x04)
	float OuterConeAngle; // 0x5b4(0x04)
	float *5fa0a48a2c; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)

	void *af3a4a82b2(); // Function Engine.SpotLightComponent.*af3a4a82b2 // Final|Native|Public|BlueprintCallable // @ game+0x6c1e040
	void *6410d64b8b(); // Function Engine.SpotLightComponent.*6410d64b8b // Final|Native|Public|BlueprintCallable // @ game+0x6c1b144
};

// Class Engine.*fc2452f674
// Size: 0x38 (Inherited: 0x30)
struct U*fc2452f674 : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.*ee34789f9a
// Size: 0x38 (Inherited: 0x38)
struct U*ee34789f9a : U*fc2452f674 {
};

// Class Engine.*803292ecaa
// Size: 0x30 (Inherited: 0x30)
struct U*803292ecaa : UObject {
};

// Class Engine.*0ad023d030
// Size: 0x48 (Inherited: 0x30)
struct U*0ad023d030 : UObject {
	char bCausedByWorld : 1; // 0x30(0x01)
	char bScaleMomentumByMass : 1; // 0x30(0x01)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char pad_30_3 : 5; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DamageImpulse; // 0x34(0x04)
	float DestructibleImpulse; // 0x38(0x04)
	float DestructibleDamageSpreadScale; // 0x3c(0x04)
	float DamageFalloff; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.MovementComponent
// Size: 0x250 (Inherited: 0x200)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x200(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x208(0x08)
	char pad_210[0x4]; // 0x210(0x04)
	struct FVector Velocity; // 0x214(0x0c)
	char bConstrainToPlane : 1; // 0x220(0x01)
	char bSnapToPlaneAtStart : 1; // 0x220(0x01)
	char pad_220_2 : 6; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	enum class EPlaneConstraintAxisSetting *d76c010af6; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	struct FVector PlaneConstraintNormal; // 0x228(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x234(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x240(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x240(0x01)
	char bTickBeforeOwner : 1; // 0x240(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x240(0x01)
	char pad_240_4 : 4; // 0x240(0x01)
	char pad_241[0xf]; // 0x241(0x0f)

	void *c2ac81da0f(); // Function Engine.MovementComponent.*c2ac81da0f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb658
	void *b83a90d09d(); // Function Engine.MovementComponent.*b83a90d09d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe788
	void *3d7e8f3f5f(); // Function Engine.MovementComponent.*3d7e8f3f5f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc002c
	void *0f8844a2ec(); // Function Engine.MovementComponent.*0f8844a2ec // Native|Public|BlueprintCallable // @ game+0x6bd1e90
	void *db92e1435e(); // Function Engine.MovementComponent.*db92e1435e // Native|Public|BlueprintCallable // @ game+0x6bd27f8
	void *55451031c8(); // Function Engine.MovementComponent.*55451031c8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd644
	void *852b92179c(); // Function Engine.MovementComponent.*852b92179c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd000c
	void *164ca92a58(); // Function Engine.MovementComponent.*164ca92a58 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcff00
	void *87d489219e(); // Function Engine.MovementComponent.*87d489219e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe7c8
	void *3d190c2b6f(); // Function Engine.MovementComponent.*3d190c2b6f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd00b0
	void K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc36e4
	void *1d3512d465(); // Function Engine.MovementComponent.*1d3512d465 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5e30
	void *9c2738870a(); // Function Engine.MovementComponent.*9c2738870a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc3da0
	void *d4fa247c58(); // Function Engine.MovementComponent.*d4fa247c58 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe7a0
	void *1f50dc4b23(); // Function Engine.MovementComponent.*1f50dc4b23 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe73c
	void K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc373c
	void *2b7152691b(); // Function Engine.MovementComponent.*2b7152691b // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5ca0
	void ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb5d68
	void PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0xd18624
	void *12a8e3120c(); // Function Engine.MovementComponent.*12a8e3120c // Native|Public|BlueprintCallable // @ game+0x6bcfdd4
	void *581d945228(); // Function Engine.MovementComponent.*581d945228 // Native|Public|BlueprintCallable // @ game+0x6bd112c
	void *0b63448c67(); // Function Engine.MovementComponent.*0b63448c67 // Native|Public|BlueprintCallable // @ game+0x6bcfe68
};

// Class Engine.NavMovementComponent
// Size: 0x280 (Inherited: 0x250)
struct UNavMovementComponent : UMovementComponent {
	struct F*ae60ea2542 NavAgentProps; // 0x248(0x20)
	float *2e58ec43d4; // 0x268(0x04)
	char *83fb68c948 : 1; // 0x26c(0x01)
	char bUseAccelerationForPaths : 1; // 0x26c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x26c(0x01)
	struct F*060c159331 *a415b23328; // 0x270(0x04)
	char pad_278_3 : 5; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)

	void *927cff7993(); // Function Engine.NavMovementComponent.*927cff7993 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0420
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x6bd21ac
	void *07aed04f02(); // Function Engine.NavMovementComponent.*07aed04f02 // Final|Native|Public|BlueprintCallable // @ game+0x6bd2810
	void *63df202894(); // Function Engine.NavMovementComponent.*63df202894 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbffd4
	void IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc00d8
	void *538e672bae(); // Function Engine.NavMovementComponent.*538e672bae // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0100
	void *b7c59c950e(); // Function Engine.NavMovementComponent.*b7c59c950e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc07f4
};

// Class Engine.PawnMovementComponent
// Size: 0x290 (Inherited: 0x280)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *99875154bc; // 0x280(0x08)
	char pad_288[0x8]; // 0x288(0x08)

	void *ec5c491810(); // Function Engine.PawnMovementComponent.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc03f8
	void *74bbcbd06c(); // Function Engine.PawnMovementComponent.*74bbcbd06c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb1a48
	void *8efd791461(); // Function Engine.PawnMovementComponent.*8efd791461 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe4d8
	void *6f20605fa3(); // Function Engine.PawnMovementComponent.*6f20605fa3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbcfb8
	void *e1674e808d(); // Function Engine.PawnMovementComponent.*e1674e808d // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb5ef8
	void K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc36b0
	void *2d3b0c617b(); // Function Engine.PawnMovementComponent.*2d3b0c617b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe4c0
};

// Class Engine.CharacterMovementComponent
// Size: 0x930 (Inherited: 0x290)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_290[0x8]; // 0x290(0x08)
	struct ACharacter* *479080a547; // 0x298(0x08)
	char bApplyGravityWhileJumping : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float GravityScale; // 0x2a4(0x04)
	float MaxStepHeight; // 0x2a8(0x04)
	float JumpZVelocity; // 0x2ac(0x04)
	float JumpOffJumpZFactor; // 0x2b0(0x04)
	float *83e8ebe44b; // 0x2b4(0x04)
	float *722c71f33c; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	float *82b606161e; // 0x2c0(0x04)
	float *fdb6771fd8; // 0x2c4(0x04)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	enum class EMovementMode MovementMode; // 0x2d0(0x01)
	bool CustomMovementMode; // 0x2d1(0x01)
	char pad_2D2[0x1e]; // 0x2d2(0x1e)
	float GroundFriction; // 0x2f0(0x04)
	float MaxWalkSpeed; // 0x2f4(0x04)
	float MaxWalkSpeedCrouched; // 0x2f8(0x04)
	float MaxSwimSpeed; // 0x2fc(0x04)
	float MaxFlySpeed; // 0x300(0x04)
	float MaxCustomMovementSpeed; // 0x304(0x04)
	float MaxAcceleration; // 0x308(0x04)
	float BrakingFrictionFactor; // 0x30c(0x04)
	float BrakingFriction; // 0x310(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x314(0x01)
	char pad_314_1 : 7; // 0x314(0x01)
	char pad_315[0x3]; // 0x315(0x03)
	float BrakingDecelerationWalking; // 0x318(0x04)
	float BrakingDecelerationFalling; // 0x31c(0x04)
	float BrakingDecelerationSwimming; // 0x320(0x04)
	float BrakingDecelerationFlying; // 0x324(0x04)
	float AirControl; // 0x328(0x04)
	float AirControlBoostMultiplier; // 0x32c(0x04)
	float AirControlBoostVelocityThreshold; // 0x330(0x04)
	float FallingLateralFriction; // 0x334(0x04)
	float CrouchedHalfHeight; // 0x338(0x04)
	float PronedHalfHeight; // 0x33c(0x04)
	float PronedRadius; // 0x340(0x04)
	float Buoyancy; // 0x344(0x04)
	float PerchRadiusThreshold; // 0x348(0x04)
	float PerchAdditionalHeight; // 0x34c(0x04)
	struct FRotator RotationRate; // 0x350(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x35c(0x01)
	char bOrientRotationToMovement : 1; // 0x35c(0x01)
	char bSweepWhileNavWalking : 1; // 0x35c(0x01)
	char pad_35C_3 : 2; // 0x35c(0x01)
	char *26cb6c84f1 : 1; // 0x35c(0x01)
	char *507ceb7bfc : 1; // 0x35c(0x01)
	char bForceMaxAccel : 1; // 0x35c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x35d(0x01)
	char bForceNextFloorCheck : 1; // 0x35d(0x01)
	char *19469483f8 : 1; // 0x35d(0x01)
	char bCanWalkOffLedges : 1; // 0x35d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x35d(0x01)
	char pad_35D_5 : 2; // 0x35d(0x01)
	char *11b8c860ec : 1; // 0x35d(0x01)
	char *7f0c890fda : 1; // 0x35e(0x01)
	char pad_35E_1 : 7; // 0x35e(0x01)
	char pad_35F[0x1]; // 0x35f(0x01)
	struct USceneComponent* *6d8897b5ca; // 0x360(0x08)
	float MaxOutOfWaterStepHeight; // 0x368(0x04)
	float OutofWaterZ; // 0x36c(0x04)
	float Mass; // 0x370(0x04)
	bool bEnablePhysicsInteraction; // 0x374(0x01)
	bool bTouchForceScaledToMass; // 0x375(0x01)
	bool bPushForceScaledToMass; // 0x376(0x01)
	bool bPushForceUsingZOffset; // 0x377(0x01)
	bool bScalePushForceToVelocity; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	float StandingDownwardForceScale; // 0x37c(0x04)
	float InitialPushForceFactor; // 0x380(0x04)
	float PushForceFactor; // 0x384(0x04)
	float PushForcePointZOffsetFactor; // 0x388(0x04)
	float TouchForceFactor; // 0x38c(0x04)
	float MinTouchForce; // 0x390(0x04)
	float MaxTouchForce; // 0x394(0x04)
	float RepulsionForce; // 0x398(0x04)
	char bForceBraking : 1; // 0x39c(0x01)
	char pad_39C_1 : 7; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	float CrouchedSpeedMultiplier; // 0x3a0(0x04)
	float UpperImpactNormalScale; // 0x3a4(0x04)
	struct FVector Acceleration; // 0x3a8(0x0c)
	struct FVector *eabc6b4d63; // 0x3b4(0x0c)
	struct FQuat *e96b7385d6; // 0x3c0(0x10)
	struct FVector *fed5f456bc; // 0x3d0(0x0c)
	float *8259a7a9d5; // 0x3dc(0x04)
	float *02e850e002; // 0x3e0(0x04)
	float *b407c9150e; // 0x3e4(0x04)
	struct FVector *3d04d1faed; // 0x3e8(0x0c)
	struct FVector *39b9fae469; // 0x3f4(0x0c)
	float *b94abc4f0d; // 0x400(0x04)
	char pad_404[0x8]; // 0x404(0x08)
	float MaxSimulationTimeStep; // 0x40c(0x04)
	int32 MaxSimulationIterations; // 0x410(0x04)
	float MaxDepenetrationWithGeometry; // 0x414(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x418(0x04)
	float MaxDepenetrationWithPawn; // 0x41c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x420(0x04)
	float *1d1c9d5d1a; // 0x424(0x04)
	float *4157bdca5f; // 0x428(0x04)
	float *ba1516f1be; // 0x42c(0x04)
	float *9f28b14cad; // 0x430(0x04)
	float *66dc603436; // 0x434(0x04)
	float *07991836b8; // 0x438(0x04)
	float *64d8e8110c; // 0x43c(0x04)
	float *5ef0e2e35c; // 0x440(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float *92e20fcab4; // 0x448(0x04)
	float *4fab791991; // 0x44c(0x04)
	float *86042875b9; // 0x450(0x04)
	float *188976dd19; // 0x454(0x04)
	float LedgeCheckThreshold; // 0x458(0x04)
	float JumpOutOfWaterPitch; // 0x45c(0x04)
	struct F*29683cadec CurrentFloor; // 0x460(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4f8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4f9(0x01)
	enum class EMovementMode *faf788f025; // 0x4fa(0x01)
	char pad_4FB[0x1]; // 0x4fb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityX : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityY : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4fc(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4fc(0x01)
	char bJustTeleported : 1; // 0x4fc(0x01)
	char *70c3d30791 : 1; // 0x4fc(0x01)
	char *acfd118ae1 : 1; // 0x4fc(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4fd(0x01)
	char bNotifyApex : 1; // 0x4fd(0x01)
	char *4321e5bacf : 1; // 0x4fd(0x01)
	char bWantsToCrouch : 1; // 0x4fd(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4fd(0x01)
	char pad_4FD_5 : 3; // 0x4fd(0x01)
	char pad_4FE[0x2]; // 0x4fe(0x02)
	enum class EStanceMode StanceMode; // 0x500(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x501(0x01)
	char pad_502[0x2]; // 0x502(0x02)
	char bIgnoreBaseRotation : 1; // 0x504(0x01)
	char *8670edea6f : 1; // 0x504(0x01)
	char bAlwaysCheckFloor : 1; // 0x504(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x504(0x01)
	char *e403872825 : 1; // 0x504(0x01)
	char *b1ee1c3f93 : 1; // 0x504(0x01)
	char bUseRVOAvoidance : 1; // 0x504(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x504(0x01)
	char pad_505[0xf]; // 0x505(0x0f)
	char *fe38a4d374 : 1; // 0x514(0x01)
	char *b6480ff259 : 1; // 0x514(0x01)
	char *4683070ca7 : 1; // 0x514(0x01)
	char pad_514_3 : 2; // 0x514(0x01)
	char bProjectNavMeshWalking : 1; // 0x514(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x514(0x01)
	char pad_514_7 : 1; // 0x514(0x01)
	char pad_515[0x13]; // 0x515(0x13)
	float AvoidanceConsiderationRadius; // 0x528(0x04)
	struct FVector *3430170cc5; // 0x52c(0x0c)
	int32 AvoidanceUID; // 0x538(0x04)
	struct F*c4bee3ea12 AvoidanceGroup; // 0x53c(0x04)
	struct F*c4bee3ea12 GroupsToAvoid; // 0x540(0x04)
	struct F*c4bee3ea12 GroupsToIgnore; // 0x544(0x04)
	float AvoidanceWeight; // 0x548(0x04)
	struct FVector *914bfba552; // 0x54c(0x0c)
	char pad_558[0xa8]; // 0x558(0xa8)
	float NavMeshProjectionInterval; // 0x600(0x04)
	float *8118c9d009; // 0x604(0x04)
	float NavMeshProjectionInterpSpeed; // 0x608(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x60c(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x610(0x04)
	float NavWalkingFloorDistTolerance; // 0x614(0x04)
	char pad_618[0xb0]; // 0x618(0xb0)
	struct F*4bffd29219 *a41d0f03b5; // 0x6c8(0x58)
	char pad_720[0x10]; // 0x720(0x10)
	float *035b3a9f9f; // 0x730(0x04)
	char pad_734[0x4]; // 0x734(0x04)
	struct FRootMotionSourceGroup *c7539c9e11; // 0x738(0x100)
	char pad_838[0x98]; // 0x838(0x98)
	struct F*515b98ffe7 *bd0a57294d; // 0x8d0(0x40)
	struct FVector *4c2486a6db; // 0x910(0x0c)
	bool *5fec1080f0; // 0x91c(0x01)
	char pad_91D[0x3]; // 0x91d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x920(0x01)
	char pad_920_1 : 7; // 0x920(0x01)
	char pad_921[0xf]; // 0x921(0x0f)

	void *9d924ae134(); // Function Engine.CharacterMovementComponent.*9d924ae134 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd618
	void *44975c26ea(); // Function Engine.CharacterMovementComponent.*44975c26ea // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba604
	void *b93a5543f3(); // Function Engine.CharacterMovementComponent.*b93a5543f3 // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x6bd1a34
	void *4ed3e42e4c(); // Function Engine.CharacterMovementComponent.*4ed3e42e4c // Final|Native|Public|BlueprintCallable // @ game+0x6bce2b8
	void *db0f1d6afd(); // Function Engine.CharacterMovementComponent.*db0f1d6afd // Final|Native|Public|BlueprintCallable // @ game+0x6bd1790
	void *ca70c823be(); // Function Engine.CharacterMovementComponent.*ca70c823be // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb294
	void AddImpulse(); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb16bc
	void *f667569445(); // Function Engine.CharacterMovementComponent.*f667569445 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc31a0
	void *e102887b62(); // Function Engine.CharacterMovementComponent.*e102887b62 // Final|Native|Public|BlueprintCallable // @ game+0x6bce190
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x6bb6bac
	void *e27d511e10(); // Function Engine.CharacterMovementComponent.*e27d511e10 // Native|Public|BlueprintCallable // @ game+0x6bb3434
	void *97cd786904(); // Function Engine.CharacterMovementComponent.*97cd786904 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bcbd90
	void *f54e2f4333(); // Function Engine.CharacterMovementComponent.*f54e2f4333 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc1c4
	void *8ac3f8d562(); // Function Engine.CharacterMovementComponent.*8ac3f8d562 // Native|Public|BlueprintCallable // @ game+0x6bb2be8
	void *c2656bf395(); // Function Engine.CharacterMovementComponent.*c2656bf395 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd5c0
	void *0c71812783(); // Function Engine.CharacterMovementComponent.*0c71812783 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bce21c
	void *4db894fcba(); // Function Engine.CharacterMovementComponent.*4db894fcba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf46c
	void *f3efc6a197(); // Function Engine.CharacterMovementComponent.*f3efc6a197 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e635a8
	void *865b67218d(); // Function Engine.CharacterMovementComponent.*865b67218d // Final|Native|Public|BlueprintCallable // @ game+0x6bcbd04
	void *e383b11c62(); // Function Engine.CharacterMovementComponent.*e383b11c62 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc398c
	void *55d6bf611b(); // Function Engine.CharacterMovementComponent.*55d6bf611b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc2cfc
	void *44e088037d(); // Function Engine.CharacterMovementComponent.*44e088037d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0420
	void *52d57aeb3a(); // Function Engine.CharacterMovementComponent.*52d57aeb3a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd778
	void *cbcc333929(); // Function Engine.CharacterMovementComponent.*cbcc333929 // Final|Native|Public|BlueprintCallable // @ game+0x6bd02d0
	void *5eaed47ac8(); // Function Engine.CharacterMovementComponent.*5eaed47ac8 // Final|Native|Public|BlueprintCallable // @ game+0x6bcbc70
	void *e2444abdb4(); // Function Engine.CharacterMovementComponent.*e2444abdb4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd594
	void *7e042cca5d(); // Function Engine.CharacterMovementComponent.*7e042cca5d // Final|Native|Public|BlueprintCallable // @ game+0x6bd1828
	void *e948ff09df(); // Function Engine.CharacterMovementComponent.*e948ff09df // Native|Public|BlueprintCallable // @ game+0x6bcf728
	void *a0ef2db392(); // Function Engine.CharacterMovementComponent.*a0ef2db392 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb98bc
	void CapsuleTouched(); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x6bb2fec
	void AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb1078
	void *0fddc8929b(); // Function Engine.CharacterMovementComponent.*0fddc8929b // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bce344
	void *98562927be(); // Function Engine.CharacterMovementComponent.*98562927be // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd5ec
	void *1471005205(); // Function Engine.CharacterMovementComponent.*1471005205 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe530
	void *f6cb9100e3(); // Function Engine.CharacterMovementComponent.*f6cb9100e3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc3710
	void *8faddce97d(); // Function Engine.CharacterMovementComponent.*8faddce97d // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0844
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintFunctionLibrary : UObject {

	void MakeStringAssetReference(); // Function Engine.BlueprintFunctionLibrary.MakeStringAssetReference // Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x6c07034
};

// Class Engine.StaticMeshActor
// Size: 0x3f8 (Inherited: 0x3e8)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3e8(0x08)
	bool bStaticMeshReplicateMovement; // 0x3f0(0x01)
	enum class ENavDataGatheringMode *44a20f5dab; // 0x3f1(0x01)
	char pad_3F2[0x6]; // 0x3f2(0x06)
};

// Class Engine.HUD
// Size: 0x4d0 (Inherited: 0x3e8)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x3e8(0x08)
	char bLostFocusPaused : 1; // 0x3f0(0x01)
	char bShowHUD : 1; // 0x3f0(0x01)
	char bShowDebugInfo : 1; // 0x3f0(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x3f0(0x01)
	char bShowOverlays : 1; // 0x3f0(0x01)
	char bEnableDebugTextShadow : 1; // 0x3f0(0x01)
	char pad_3F0_6 : 2; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct TArray<struct AActor*> *38b709293a; // 0x3f8(0x10)
	char pad_408[0x8]; // 0x408(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x410(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x420(0x10)
	struct UCanvas* Canvas; // 0x430(0x08)
	struct UCanvas* *f5943f676e; // 0x438(0x08)
	struct TArray<struct F*ed6dead525> *f79181af34; // 0x440(0x10)
	struct UClass* *6e615585cd; // 0x450(0x08)
	struct AActor* *fcbd63a8dd; // 0x458(0x08)
	char pad_460[0x70]; // 0x460(0x70)

	void DrawTexture(); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb7d7c
	void ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *62432812ee(); // Function Engine.HUD.*62432812ee // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bb0c04
	void *34fff8859f(); // Function Engine.HUD.*34fff8859f // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe130
	void ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x6bd1ae0
	void *f44a827629(); // Function Engine.HUD.*f44a827629 // Final|Native|Public|BlueprintCallable // @ game+0x6bb828c
	void Deproject(); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb6558
	void ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *0779b85564(); // Function Engine.HUD.*0779b85564 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb7ac4
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0x5daf644
	void ReceiveDrawHUD(); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *f76c6f11ba(); // Function Engine.HUD.*f76c6f11ba // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5e8493c
	void AddHitBox(); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb14f4
	void ShowDebugToggleSubCategory(); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x6bd1c34
	void ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x6bd1b74
	void *c08cd3997f(); // Function Engine.HUD.*c08cd3997f // Final|Native|Public|BlueprintCallable // @ game+0x6bb7300
	void *9b849b7b63(); // Function Engine.HUD.*9b849b7b63 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb6e98
	void *8452ca1193(); // Function Engine.HUD.*8452ca1193 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb7578
	void *cfe6b2110e(); // Function Engine.HUD.*cfe6b2110e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb6c6c
	void *957a89d132(); // Function Engine.HUD.*957a89d132 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x6bb947c
	void *c2fb95ac2b(); // Function Engine.HUD.*c2fb95ac2b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb78e8
	void *50b363f367(); // Function Engine.HUD.*50b363f367 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bc7980
	void *6ae72bf9b6(); // Function Engine.HUD.*6ae72bf9b6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbef24
	void Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc7524
	void ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *82ab454e02(); // Function Engine.HUD.*82ab454e02 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bc77cc
};

// Class Engine.Brush
// Size: 0x420 (Inherited: 0x3e8)
struct ABrush : AActor {
	enum class *e0edfbd9de *8e17fb69f0; // 0x3e8(0x01)
	char pad_3E9[0x3]; // 0x3e9(0x03)
	struct FColor BrushColor; // 0x3ec(0x04)
	int32 PolyFlags; // 0x3f0(0x04)
	char *7d8414377d : 1; // 0x3f4(0x01)
	char *f77657c03b : 1; // 0x3f4(0x01)
	char *8751e5918e : 1; // 0x3f4(0x01)
	char *ac8f2c7a93 : 1; // 0x3f4(0x01)
	char pad_3F4_4 : 4; // 0x3f4(0x01)
	char pad_3F5[0x3]; // 0x3f5(0x03)
	struct UModel* Brush; // 0x3f8(0x08)
	struct UBrushComponent* BrushComponent; // 0x400(0x08)
	char *98b8ef6f05 : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct TArray<struct F*26d590dcc1> *1211ef514c; // 0x410(0x10)
};

// Class Engine.Volume
// Size: 0x420 (Inherited: 0x420)
struct AVolume : ABrush {
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotify : UObject {
	char pad_30[0x10]; // 0x30(0x10)

	void Received_Notify(); // Function Engine.AnimNotify.Received_Notify // Event|Public|BlueprintEvent|Const // @ game+0x3b43ac
	void GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x6bbd9e8
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	char pad_60[0x10]; // 0x60(0x10)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	void Received_NotifyTick(); // Function Engine.AnimNotifyState.Received_NotifyTick // Event|Public|BlueprintEvent|Const // @ game+0x3b43ac
	void Received_NotifyEnd(); // Function Engine.AnimNotifyState.Received_NotifyEnd // Event|Public|BlueprintEvent|Const // @ game+0x3b43ac
	void Received_NotifyBegin(); // Function Engine.AnimNotifyState.Received_NotifyBegin // Event|Public|BlueprintEvent|Const // @ game+0x3b43ac
	void GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x6bbd9e8
};

// Class Engine.DataTable
// Size: 0x88 (Inherited: 0x30)
struct UDataTable : UObject {
	struct UScriptStruct* *eb864fa0b1; // 0x30(0x08)
	char pad_38[0x50]; // 0x38(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x448)
struct ACharacter : APawn {
	struct UCapsuleComponent* CapsuleComponent; // 0x448(0x08)
	struct F*d11a7f4b1f *e8a3c062a0; // 0x450(0x48)
	int32 JumpMaxCount; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x4a0(0x08)
	float JumpKeyHoldTime; // 0x4a8(0x04)
	float *e4eda111d4; // 0x4ac(0x04)
	struct F*d11a7f4b1f *4233f49e69; // 0x4b0(0x48)
	int32 JumpCurrentCount; // 0x4f8(0x04)
	char pad_4FC[0x4]; // 0x4fc(0x04)
	struct USkeletalMeshComponent* Mesh; // 0x500(0x08)
	struct FVector *05ff5e346b; // 0x508(0x0c)
	char bPressedJump : 1; // 0x514(0x01)
	char *0a07f40284 : 1; // 0x514(0x01)
	char *883f2946bb : 1; // 0x514(0x01)
	char *1bbc584058 : 1; // 0x514(0x01)
	char *5e33d65440 : 1; // 0x514(0x01)
	char *2551a88bff : 1; // 0x514(0x01)
	char *0da443813f : 1; // 0x514(0x01)
	char *3a904bf932 : 1; // 0x514(0x01)
	char bWasJumping : 1; // 0x515(0x01)
	char pad_515_1 : 7; // 0x515(0x01)
	char pad_516[0x2]; // 0x516(0x02)
	bool *33347614fc; // 0x518(0x01)
	bool *95854913ff; // 0x519(0x01)
	char pad_51A[0x2]; // 0x51a(0x02)
	float CrouchedEyeHeight; // 0x51c(0x04)
	char bIsCrouched : 1; // 0x520(0x01)
	char pad_520_1 : 7; // 0x520(0x01)
	char pad_521[0xf]; // 0x521(0x0f)
	struct FQuat *9c95665d3c; // 0x530(0x10)
	float *3ac7aa90de; // 0x540(0x04)
	char pad_544[0x4]; // 0x544(0x04)
	struct UCharacterMovementComponent* CharacterMovement; // 0x548(0x08)
	float JumpMaxHoldTime; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	struct FMulticastDelegate OnReachedJumpApex; // 0x558(0x10)
	char pad_568[0x10]; // 0x568(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x578(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x588(0x10)
	struct FRootMotionSourceGroup *eae265d390; // 0x598(0x100)
	char pad_698[0x8]; // 0x698(0x08)
	struct F*515b98ffe7 *f5b54daaa1; // 0x6a0(0x40)
	struct TArray<struct F*2a96cdbee5> *f84fd203c5; // 0x6e0(0x10)
	struct F*0e21200897 *882a7f71ac; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	void *fb2473c60b(); // Function Engine.Character.*fb2473c60b // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x98276c
	void *b022a0a31e(); // Function Engine.Character.*b022a0a31e // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc9cb8
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x98203c
	void *af5e11930f(); // Function Engine.Character.*af5e11930f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb2adc
	void *cc63ed914a(); // Function Engine.Character.*cc63ed914a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc8f2c
	void OnWalkingOffLedge(); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xe2f088
	void Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x6bb648c
	void *6a0e5b0286(); // Function Engine.Character.*6a0e5b0286 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0668
	void *7e163b451c(); // Function Engine.Character.*7e163b451c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb39c4
	void *221e5b49fe(); // Function Engine.Character.*221e5b49fe // Native|Public|BlueprintCallable // @ game+0x6bd05e4
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x6bc091c
	void *ab9f13facc(); // Function Engine.Character.*ab9f13facc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9900
	void *39955aa1ce(); // Function Engine.Character.*39955aa1ce // Native|Public|BlueprintCallable // @ game+0x6bc6bcc
	void *ca090c119f(); // Function Engine.Character.*ca090c119f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9ac8
	void *1ce0ccef36(); // Function Engine.Character.*1ce0ccef36 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc9974
	void *22fdf8e2aa(); // Function Engine.Character.*22fdf8e2aa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc94ac
	void CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb2eb0
	void *ae290b6270(); // Function Engine.Character.*ae290b6270 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x71ed74
	void K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *185bf39c1e(); // Function Engine.Character.*185bf39c1e // Native|Public|BlueprintCallable // @ game+0x6bd2c6c
	void ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x70e89c
	void *940da471e0(); // Function Engine.Character.*940da471e0 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6bb3618
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0xafcb64
	void K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc5a94
	void K2_OnMovementModeChanged(); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *2442a24805(); // Function Engine.Character.*2442a24805 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9b10
	void *dd8777b92b(); // Function Engine.Character.*dd8777b92b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5d96998
	void IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e1fde8
	void *3f5ff0d280(); // Function Engine.Character.*3f5ff0d280 // Native|Public|BlueprintCallable // @ game+0x6bd24bc
	void *109287e492(); // Function Engine.Character.*109287e492 // Final|Native|Public|BlueprintCallable // @ game+0x6bbb2bc
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x5e67c64
	void *74ba8d35b7(); // Function Engine.Character.*74ba8d35b7 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x981b38
	void *f183d7ae68(); // Function Engine.Character.*f183d7ae68 // Native|Public|BlueprintCallable // @ game+0x6bd27c8
	void ServerMove(); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc85b0
	void CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x6bb2ed4
	void *426bbcfd1b(); // Function Engine.Character.*426bbcfd1b // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x97fb7c
	void OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x3b43ac
	void *1add8d4ff4(); // Function Engine.Character.*1add8d4ff4 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc89ac
	void OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x3b43ac
	void K2_OnStartCrouch(); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *7f16fa6b8f(); // Function Engine.Character.*7f16fa6b8f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0644
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x5df9944
};

// Class Engine.Controller
// Size: 0x470 (Inherited: 0x3e8)
struct AController : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct APlayerState* PlayerState; // 0x3f0(0x08)
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct USceneComponent* TransformComponent; // 0x400(0x08)
	struct FName StateName; // 0x408(0x08)
	struct FRotator *67a18bfbf4; // 0x410(0x0c)
	char pad_41C[0xc]; // 0x41c(0x0c)
	struct APawn* Pawn; // 0x428(0x08)
	char *ac76c176b5 : 1; // 0x430(0x01)
	char *8f126e4c4b : 1; // 0x430(0x01)
	char pad_430_2 : 6; // 0x430(0x01)
	char pad_431[0x1f]; // 0x431(0x1f)
	struct ACharacter* Character; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x460(0x10)

	void *2c0d9f2569(); // Function Engine.Controller.*2c0d9f2569 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bb4f08
	void *cfc621cd2f(); // Function Engine.Controller.*cfc621cd2f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0628
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0xdec59c
	void *4a6a8f3046(); // Function Engine.Controller.*4a6a8f3046 // Native|Public|BlueprintCallable // @ game+0x6bce69c
	void *5d41444446(); // Function Engine.Controller.*5d41444446 // Final|Native|Public|BlueprintCallable // @ game+0x6bb3240
	void *ea60ba9b64(); // Function Engine.Controller.*ea60ba9b64 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bcd62c
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x6bd27e0
	void *7e3667efd8(); // Function Engine.Controller.*7e3667efd8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc02b0
	void *8e4ab02dd2(); // Function Engine.Controller.*8e4ab02dd2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0244
	void *ec5c491810(); // Function Engine.Controller.*ec5c491810 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc03a8
	void *21b6505060(); // Function Engine.Controller.*21b6505060 // Native|Public|BlueprintCallable // @ game+0x6bc7cb0
	void *78d24b5032(); // Function Engine.Controller.*78d24b5032 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0xe29928
	void *3dcfe68cdd(); // Function Engine.Controller.*3dcfe68cdd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf670
	void *e13b76f42a(); // Function Engine.Controller.*e13b76f42a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc5d18
	void K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc3768
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x683138
	void *c997c1061d(); // Function Engine.Controller.*c997c1061d // Native|Public|BlueprintCallable // @ game+0x6bce604
	void *bdd7417b98(); // Function Engine.Controller.*bdd7417b98 // Native|Public|BlueprintCallable // @ game+0x6bc7cc8
	void GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae08
	void *b9246aa8a1(); // Function Engine.Controller.*b9246aa8a1 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb3b0
	void *00bc40e59f(); // Function Engine.Controller.*00bc40e59f // Native|Public|BlueprintCallable // @ game+0x6bc7ce0
	void Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x5dd5d48
	void *4efb158107(); // Function Engine.Controller.*4efb158107 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc026c
	void *0b8dd02f61(); // Function Engine.Controller.*0b8dd02f61 // Native|Public|BlueprintCallable // @ game+0x6bb3434
	void ReceiveInstigatedAnyDamage(); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x3b43ac
};

// Class Engine.SpringArmComponent
// Size: 0x4f0 (Inherited: 0x470)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x468(0x04)
	struct FVector SocketOffset; // 0x46c(0x0c)
	struct FVector TargetOffset; // 0x478(0x0c)
	float ProbeSize; // 0x484(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x488(0x01)
	char bDoCollisionTest : 1; // 0x48c(0x01)
	char bUsePawnControlRotation : 1; // 0x48c(0x01)
	char bInheritPitch : 1; // 0x48c(0x01)
	char bInheritYaw : 1; // 0x48c(0x01)
	char bInheritRoll : 1; // 0x48c(0x01)
	char bLockPitchLag : 1; // 0x48c(0x01)
	char bLockYawLag : 1; // 0x48c(0x01)
	char bLockRollLag : 1; // 0x48c(0x01)
	char bEnableCameraLag : 1; // 0x48d(0x01)
	char bEnableCameraRotationLag : 1; // 0x48d(0x01)
	char bUseCameraLagSubstepping : 1; // 0x48d(0x01)
	char bDrawDebugLagMarkers : 1; // 0x48d(0x01)
	float CameraLagSpeed; // 0x490(0x04)
	float CameraRotationLagSpeed; // 0x494(0x04)
	float CameraLagMaxTimeStep; // 0x498(0x04)
	float CameraLagMaxDistance; // 0x49c(0x04)
	char pad_4A2[0x4e]; // 0x4a2(0x4e)
};

// Class Engine.PlayerController
// Size: 0x7a0 (Inherited: 0x470)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)
	struct APawn* *b84c005177; // 0x480(0x08)
	struct U*56292a4ba0* *b61860ece1; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
	struct AHUD* *ae70eed463; // 0x498(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x4a0(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4a8(0x08)
	bool *2381123a8f; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	struct FRotator TargetViewRotation; // 0x4b4(0x0c)
	char pad_4C0[0xc]; // 0x4c0(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4cc(0x04)
	struct TArray<struct AActor*> *8954a8e936; // 0x4d0(0x10)
	char pad_4E0[0x4]; // 0x4e0(0x04)
	float *c35bd652f0; // 0x4e4(0x04)
	struct FVector *87054d570e; // 0x4e8(0x0c)
	struct FRotator *648c282ed2; // 0x4f4(0x0c)
	int32 *b6892fc048; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct UCheatManager* CheatManager; // 0x508(0x08)
	struct UClass* CheatClass; // 0x510(0x08)
	struct UPlayerInput* PlayerInput; // 0x518(0x08)
	struct TArray<struct F*444f71f5b9> *a23dbcc48d; // 0x520(0x10)
	char pad_530[0x90]; // 0x530(0x90)
	char pad_5C0_0 : 3; // 0x5c0(0x01)
	char bPlayerIsWaiting : 1; // 0x5c0(0x01)
	char pad_5C0_4 : 4; // 0x5c0(0x01)
	char pad_5C1[0x3]; // 0x5c1(0x03)
	bool *ed1b53c175; // 0x5c4(0x01)
	char pad_5C5[0x3b]; // 0x5c5(0x3b)
	struct UNetConnection* *a47c378a48; // 0x600(0x08)
	struct UNetConnection* NetConnection; // 0x608(0x08)
	char pad_610[0xc]; // 0x610(0x0c)
	float InputYawScale; // 0x61c(0x04)
	float InputPitchScale; // 0x620(0x04)
	float InputRollScale; // 0x624(0x04)
	char bShowMouseCursor : 1; // 0x628(0x01)
	char bEnableClickEvents : 1; // 0x628(0x01)
	char bEnableTouchEvents : 1; // 0x628(0x01)
	char bEnableMouseOverEvents : 1; // 0x628(0x01)
	char bEnableTouchOverEvents : 1; // 0x628(0x01)
	char bForceFeedbackEnabled : 1; // 0x628(0x01)
	char pad_628_6 : 2; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x630(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x640(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x641(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x642(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x643(0x01)
	float HitResultTraceDistance; // 0x644(0x04)
	char pad_648[0x80]; // 0x648(0x80)
	struct U*89f9a84286* *d266a16c01; // 0x6c8(0x08)
	char pad_6D0_0 : 3; // 0x6d0(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6d0(0x01)
	char pad_6D0_4 : 4; // 0x6d0(0x01)
	char pad_6D1[0x17]; // 0x6d1(0x17)
	struct UTouchInterface* *703c33e737; // 0x6e8(0x08)
	char pad_6F0[0x40]; // 0x6f0(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x730(0x08)
	struct FVector SpawnLocation; // 0x738(0x0c)
	char pad_744[0x4]; // 0x744(0x04)
	bool *d0584e6155; // 0x748(0x01)
	char pad_749[0x1]; // 0x749(0x01)
	uint16 *040aa881fb; // 0x74a(0x02)
	uint16 *d1b605cbb0; // 0x74c(0x02)
	char pad_74E[0x2]; // 0x74e(0x02)
	struct AActor* *164573ddac; // 0x750(0x08)
	struct AActor* *dd0398ab0a; // 0x758(0x08)
	char pad_760[0x40]; // 0x760(0x40)

	void *9bc79729ce(); // Function Engine.PlayerController.*9bc79729ce // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb684
	void *6db76a3a17(); // Function Engine.PlayerController.*6db76a3a17 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd92d5c
	void *1bb1630d13(); // Function Engine.PlayerController.*1bb1630d13 // Native|Public|BlueprintCallable // @ game+0x6bb07b4
	void *754b16dc40(); // Function Engine.PlayerController.*754b16dc40 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbee6c
	void SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x6bcf808
	void FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x6bb8698
	void *492c0dfb10(); // Function Engine.PlayerController.*492c0dfb10 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x6bb5224
	void *7d26778a3d(); // Function Engine.PlayerController.*7d26778a3d // Final|Native|Public|HasDefaults // @ game+0x6bb54c0
	void *64bae42b40(); // Function Engine.PlayerController.*64bae42b40 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcb768
	void *ba0fe87a17(); // Function Engine.PlayerController.*ba0fe87a17 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb4988
	void *4c8f98c6b1(); // Function Engine.PlayerController.*4c8f98c6b1 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6bb4378
	void AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x6bb27cc
	void *67e47f555a(); // Function Engine.PlayerController.*67e47f555a // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb39ac
	void *fc5c98289c(); // Function Engine.PlayerController.*fc5c98289c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb3b74
	void *66cb3b1abb(); // Function Engine.PlayerController.*66cb3b1abb // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc837c
	void *27d9967514(); // Function Engine.PlayerController.*27d9967514 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bc672c
	void *a36a90c259(); // Function Engine.PlayerController.*a36a90c259 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xf6d3dc
	void *1c8a42dada(); // Function Engine.PlayerController.*1c8a42dada // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbbb1c
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x5e866c4
	void *ace4896d72(); // Function Engine.PlayerController.*ace4896d72 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5e26ce4
	void *c741e7b156(); // Function Engine.PlayerController.*c741e7b156 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc75e4
	void ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x6bb5bb8
	void *b650a3c66a(); // Function Engine.PlayerController.*b650a3c66a // Net|NetReliableNative|Event|Public|NetClient // @ game+0x68225c
	void *065c841a85(); // Function Engine.PlayerController.*065c841a85 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bd2f9c
	void *dc78805044(); // Function Engine.PlayerController.*dc78805044 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5e269e0
	void *337748a8a4(); // Function Engine.PlayerController.*337748a8a4 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf698
	void *600eb14c1b(); // Function Engine.PlayerController.*600eb14c1b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xe65e6c
	void *b2ff9a6f9b(); // Function Engine.PlayerController.*b2ff9a6f9b // Final|Native|Public|BlueprintCallable // @ game+0x6bc7094
	void *64bd60d6ad(); // Function Engine.PlayerController.*64bd60d6ad // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5db013c
	void *9cd6096020(); // Function Engine.PlayerController.*9cd6096020 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xf64494
	void *1cdcd7de79(); // Function Engine.PlayerController.*1cdcd7de79 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbce74
	void *da7f49c34f(); // Function Engine.PlayerController.*da7f49c34f // Net|NetReliableNative|Event|Public|NetClient // @ game+0xe94d9c
	void *5e803224a0(); // Function Engine.PlayerController.*5e803224a0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x57c1d8
	void *d12287e8bd(); // Function Engine.PlayerController.*d12287e8bd // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb4634
	void *413a74fc4a(); // Function Engine.PlayerController.*413a74fc4a // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bca2fc
	void *017f81fff0(); // Function Engine.PlayerController.*017f81fff0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xe3f4bc
	void *18f0867bd1(); // Function Engine.PlayerController.*18f0867bd1 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc9f80
	void ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x6bd2a98
	void *dba1cb64a2(); // Function Engine.PlayerController.*dba1cb64a2 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bb34d4
	void *e4e3fd3561(); // Function Engine.PlayerController.*e4e3fd3561 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0xd16254
	void *b4cc95ff22(); // Function Engine.PlayerController.*b4cc95ff22 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb5988
	void *646923e85b(); // Function Engine.PlayerController.*646923e85b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcace4c
	void *926d6135f4(); // Function Engine.PlayerController.*926d6135f4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb5304
	void *8775495bb7(); // Function Engine.PlayerController.*8775495bb7 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb39f4
	void *77388303a1(); // Function Engine.PlayerController.*77388303a1 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x6bb5140
	void StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x6bd20ec
	void *c32dee1b26(); // Function Engine.PlayerController.*c32dee1b26 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbcab8
	void *a0484bb951(); // Function Engine.PlayerController.*a0484bb951 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0xa9b990
	void *a1a43b96bb(); // Function Engine.PlayerController.*a1a43b96bb // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb4d4c
	void *0846d613e3(); // Function Engine.PlayerController.*0846d613e3 // Final|Native|Public|BlueprintCallable // @ game+0x6bcf5b8
	void *6b86f87435(); // Function Engine.PlayerController.*6b86f87435 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb5a44
	void *be5ef35171(); // Function Engine.PlayerController.*be5ef35171 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc9e20
	void SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x6bc82b8
	void ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0xdadc10
	void *c32597ff8f(); // Function Engine.PlayerController.*c32597ff8f // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbbe7c
	void *99deb6a5df(); // Function Engine.PlayerController.*99deb6a5df // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bcaa50
	void *f6b10b700f(); // Function Engine.PlayerController.*f6b10b700f // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x6bca394
	void *6ca8f81f82(); // Function Engine.PlayerController.*6ca8f81f82 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bca96c
	void *551859c184(); // Function Engine.PlayerController.*551859c184 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc518
	void *be8df9dac5(); // Function Engine.PlayerController.*be8df9dac5 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bcaa04
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x6bb8478
	void *29fe5019a0(); // Function Engine.PlayerController.*29fe5019a0 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bca4dc
	void *9330da061e(); // Function Engine.PlayerController.*9330da061e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc2dc
	void *d85a21b831(); // Function Engine.PlayerController.*d85a21b831 // Final|Native|Public|BlueprintCallable // @ game+0x6bd2730
	void *48c46e979b(); // Function Engine.PlayerController.*48c46e979b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb3c0c
	void *50dd42b97f(); // Function Engine.PlayerController.*50dd42b97f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bca59c
	void *4f029e8b42(); // Function Engine.PlayerController.*4f029e8b42 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5e3d088
	void *fac0fe6371(); // Function Engine.PlayerController.*fac0fe6371 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbbccc
	void *3a17d02d0a(); // Function Engine.PlayerController.*3a17d02d0a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc7fc
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x5e64268
	void *515ca9bd09(); // Function Engine.PlayerController.*515ca9bd09 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc8430
	void ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bca748
	void *b2cd120b3b(); // Function Engine.PlayerController.*b2cd120b3b // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcd6a0
	void *202ea03278(); // Function Engine.PlayerController.*202ea03278 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb7f4
	void *68b9f2b1c8(); // Function Engine.PlayerController.*68b9f2b1c8 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bc8564
	void *b8ad63a8db(); // Function Engine.PlayerController.*b8ad63a8db // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd670
	void *6bececdfa5(); // Function Engine.PlayerController.*6bececdfa5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb3e0c
	void DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb66ec
	void *a3ff594db9(); // Function Engine.PlayerController.*a3ff594db9 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xe3465c
	void *1b581f5708(); // Function Engine.PlayerController.*1b581f5708 // Native|Public|BlueprintCallable // @ game+0x6bd1530
	void *c063f400fc(); // Function Engine.PlayerController.*c063f400fc // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x6bb50ac
	void *7badcea36e(); // Function Engine.PlayerController.*7badcea36e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb44fc
	void *c0bfdc5bc7(); // Function Engine.PlayerController.*c0bfdc5bc7 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x70cc8c
	void *30ed96f4e7(); // Function Engine.PlayerController.*30ed96f4e7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bd2ea8
	void AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x6bb1f60
	void Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x6bb2d74
	void *ff56e2228f(); // Function Engine.PlayerController.*ff56e2228f // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bb5694
	void *07e9ba9cd5(); // Function Engine.PlayerController.*07e9ba9cd5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb554
	void *631d4dd4e1(); // Function Engine.PlayerController.*631d4dd4e1 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bca5e8
	void ServerUpdateLevelVisibility(); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xd15c94
	void *ed7a62c23a(); // Function Engine.PlayerController.*ed7a62c23a // Final|Native|Public|BlueprintCallable // @ game+0x6bce3e0
	void *c680b04a41(); // Function Engine.PlayerController.*c680b04a41 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb67f4
	void ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb4a1c
	void *504cc5b5ec(); // Function Engine.PlayerController.*504cc5b5ec // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb964
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x5e2848c
	void *1da0c51c15(); // Function Engine.PlayerController.*1da0c51c15 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6547084
	void *7843cf5b19(); // Function Engine.PlayerController.*7843cf5b19 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb4de0
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x5df9dc0
	void *1c0be40025(); // Function Engine.PlayerController.*1c0be40025 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc0150
	void *de5cdb845e(); // Function Engine.PlayerController.*de5cdb845e // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x6bb3f28
	void *994d9585e4(); // Function Engine.PlayerController.*994d9585e4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb5014
	void *f12676d8d9(); // Function Engine.PlayerController.*f12676d8d9 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bca348
	void *30f65c03fa(); // Function Engine.PlayerController.*30f65c03fa // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bca9b8
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x5ded27c
	void *3c955a30f1(); // Function Engine.PlayerController.*3c955a30f1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb39dc
	void *5a504151cb(); // Function Engine.PlayerController.*5a504151cb // Native|Public|BlueprintCallable // @ game+0x6bccd08
	void *42ab205675(); // Function Engine.PlayerController.*42ab205675 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc3d0
	void *45753d8258(); // Function Engine.PlayerController.*45753d8258 // Final|Native|Public|BlueprintCallable // @ game+0x6bb344c
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x6bc67c4
	void *83fe00935b(); // Function Engine.PlayerController.*83fe00935b // Native|Public|BlueprintCallable // @ game+0x6bd16f8
	void SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x6bd2908
	void *f02dad65dc(); // Function Engine.PlayerController.*f02dad65dc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb3a90
	void *8b49197eab(); // Function Engine.PlayerController.*8b49197eab // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb586c
	void *98b518ef28(); // Function Engine.PlayerController.*98b518ef28 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb3ca4
	void AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x6bb23a4
	void *586f1ffdba(); // Function Engine.PlayerController.*586f1ffdba // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb3a78
	void *ec4658b026(); // Function Engine.PlayerController.*ec4658b026 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x6bc8518
	void LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x6bc5e5c
	void *cc6aa4203e(); // Function Engine.PlayerController.*cc6aa4203e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb47c0
	void *599d38076c(); // Function Engine.PlayerController.*599d38076c // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6bb4b74
	void *240d2c5a52(); // Function Engine.PlayerController.*240d2c5a52 // Final|Native|Public|BlueprintCallable // @ game+0x6bc73a0
	void *7ad5457e5d(); // Function Engine.PlayerController.*7ad5457e5d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbc8f0
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x6bb8460
	void *f41bd4c807(); // Function Engine.PlayerController.*f41bd4c807 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbcbbc
	void *3f159e81eb(); // Function Engine.PlayerController.*3f159e81eb // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0xb16bf4
	void *50dacbc7ed(); // Function Engine.PlayerController.*50dacbc7ed // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6bb4ab0
	void *17b1db61f7(); // Function Engine.PlayerController.*17b1db61f7 // Net|Native|Event|Public|NetClient // @ game+0x6bb4254
	void *a4df4a4cc6(); // Function Engine.PlayerController.*a4df4a4cc6 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6bca874
};

// Class Engine.Info
// Size: 0x3e8 (Inherited: 0x3e8)
struct AInfo : AActor {
};

// Class Engine.GameModeBase
// Size: 0x488 (Inherited: 0x3e8)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x3e8(0x10)
	struct UClass* GameSessionClass; // 0x3f8(0x08)
	struct UClass* GameStateClass; // 0x400(0x08)
	struct UClass* PlayerControllerClass; // 0x408(0x08)
	struct UClass* PlayerStateClass; // 0x410(0x08)
	struct FStringClassReference HUDClass; // 0x418(0x10)
	struct UClass* DefaultPawnClass; // 0x428(0x08)
	struct FStringClassReference SpectatorClass; // 0x430(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x440(0x08)
	struct AGameSession* GameSession; // 0x448(0x08)
	struct AGameStateBase* GameState; // 0x450(0x08)
	struct FText *36bef0b8bb; // 0x458(0x18)
	char bUseSeamlessTravel : 1; // 0x470(0x01)
	char bStartPlayersAsSpectators : 1; // 0x470(0x01)
	char bPauseable : 1; // 0x470(0x01)
	char pad_470_3 : 5; // 0x470(0x01)
	char pad_471[0x17]; // 0x471(0x17)

	void FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xdf7858
	void *a7b4935b36(); // Function Engine.GameModeBase.*a7b4935b36 // Native|Public|BlueprintCallable // @ game+0x965010
	void MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xe0bc70
	void *d4e79c9423(); // Function Engine.GameModeBase.*d4e79c9423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e23fa0
	void *0640ebc54a(); // Function Engine.GameModeBase.*0640ebc54a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6bc32b8
	void ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x6bc78d8
	void PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0xc90fc0
	void InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xf3d14c
	void SpawnDefaultPawnFor(); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xe283c8
	void *ea3038b0fd(); // Function Engine.GameModeBase.*ea3038b0fd // Native|Public|BlueprintCallable // @ game+0x6bb32d0
	void HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0xc91080
	void RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x6bc7da8
	void K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *ccb74fed66(); // Function Engine.GameModeBase.*ccb74fed66 // Native|Public|BlueprintCallable // @ game+0x6bbdc24
	void *82ff0fcd4e(); // Function Engine.GameModeBase.*82ff0fcd4e // Native|Public|BlueprintCallable // @ game+0x6bbdb40
	void RestartPlayerAtTransform(); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bc7f1c
	void RestartPlayerAtPlayerStart(); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x6bc7e3c
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x5e8b4e0
	void GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xe4b440
	void K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ChoosePlayerStart(); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xaf4510
	void CanSpectate(); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x6bb2efc
	void SpawnDefaultPawnAtTransform(); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xe7fd4c
	void K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x3b43ac
	void K2_OnChangeName(); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void InitStartSpot(); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xf2bb0c
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xd3e39c
};

// Class Engine.GameMode
// Size: 0x4c8 (Inherited: 0x488)
struct AGameMode : AGameModeBase {
	struct FName *bb64d0d946; // 0x488(0x08)
	char bDelayedStart : 1; // 0x490(0x01)
	char pad_490_1 : 7; // 0x490(0x01)
	char pad_491[0x3]; // 0x491(0x03)
	int32 NumSpectators; // 0x494(0x04)
	int32 NumPlayers; // 0x498(0x04)
	int32 NumBots; // 0x49c(0x04)
	float MinRespawnDelay; // 0x4a0(0x04)
	int32 NumTravellingPlayers; // 0x4a4(0x04)
	struct UClass* *db19159cfc; // 0x4a8(0x08)
	struct TArray<struct APlayerState*> *a6accb8e63; // 0x4b0(0x10)
	float *9df405dde0; // 0x4c0(0x04)
	bool bHandleDedicatedServerReplays; // 0x4c4(0x01)
	char pad_4C5[0x3]; // 0x4c5(0x03)

	void *9b6ffe7a3d(); // Function Engine.GameMode.*9b6ffe7a3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd274
	void *8430b4980a(); // Function Engine.GameMode.*8430b4980a // Native|Public|BlueprintCallable // @ game+0x6bb866c
	void *765398c9d4(); // Function Engine.GameMode.*765398c9d4 // Native|Public|BlueprintCallable // @ game+0xd6ea3c
	void ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0xc38fa4
	void Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x6bc80e0
	void *20e3515243(); // Function Engine.GameMode.*20e3515243 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc02d8
	void K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x3b43ac
	void ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xe8c8d8
	void *ba4aa21903(); // Function Engine.GameMode.*ba4aa21903 // Native|Public|BlueprintCallable // @ game+0x5e22fbc
	void *3f89f1978b(); // Function Engine.GameMode.*3f89f1978b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf804
	void SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x6bcbe2c
	void *cf4f0d8a8f(); // Function Engine.GameMode.*cf4f0d8a8f // Native|Public|BlueprintCallable // @ game+0x6bb0764
};

// Class Engine.PlayerState
// Size: 0x480 (Inherited: 0x3e8)
struct APlayerState : AInfo {
	char pad_3E8[0x10]; // 0x3e8(0x10)
	int32 StartTime; // 0x3f8(0x04)
	bool Ping; // 0x3fc(0x01)
	char pad_3FD[0x3]; // 0x3fd(0x03)
	int32 PlayerId; // 0x400(0x04)
	char pad_404[0x4]; // 0x404(0x04)
	struct UClass* *db19159cfc; // 0x408(0x08)
	char bIsSpectator : 1; // 0x410(0x01)
	char *27105a3b1d : 1; // 0x410(0x01)
	char bIsABot : 1; // 0x410(0x01)
	char pad_410_3 : 1; // 0x410(0x01)
	char *e0a90482a6 : 1; // 0x410(0x01)
	char *37ab395502 : 1; // 0x410(0x01)
	char pad_410_6 : 2; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float Score; // 0x414(0x04)
	char pad_418[0x8]; // 0x418(0x08)
	struct FString *bd04ae9cde; // 0x420(0x10)
	char pad_430[0x8]; // 0x430(0x08)
	struct FString PlayerName; // 0x438(0x10)
	struct FUniqueNetIdRepl UniqueId; // 0x448(0x18)
	char pad_460[0x18]; // 0x460(0x18)
	bool *4253d56a24; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)

	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0x5daf644
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x5e81ba4
	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x5e4766c
	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x5e81b8c
	void ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x3b43ac
	void ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x3b43ac
};

// Class Engine.TargetPoint
// Size: 0x3e8 (Inherited: 0x3e8)
struct ATargetPoint : AActor {
};

// Class Engine.SkeletalMeshActor
// Size: 0x470 (Inherited: 0x3e8)
struct ASkeletalMeshActor : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	char bShouldDoAnimNotifies : 1; // 0x3f0(0x01)
	char bWakeOnLevelStart : 1; // 0x3f0(0x01)
	char pad_3F0_2 : 6; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x3f8(0x08)
	struct USkeletalMesh* *78ac740bab; // 0x400(0x08)
	struct UPhysicsAsset* *c076d8455d; // 0x408(0x08)
	struct UMaterialInterface* *30be61bd2f; // 0x410(0x08)
	struct UMaterialInterface* *a44e49c1f5; // 0x418(0x08)
	char pad_420[0x50]; // 0x420(0x50)

	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x5e81b8c
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x5e81ba4
	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x5e4766c
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0x5daf644
};

// Class Engine.DestructibleComponent
// Size: 0xd10 (Inherited: 0xc50)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc48(0x01)
	struct TArray<struct F*ab298b5726> FractureEffects; // 0xc50(0x10)
	bool bEnableHardSleeping; // 0xc60(0x01)
	char pad_C61_1 : 7; // 0xc61(0x01)
	char pad_C62[0x2]; // 0xc62(0x02)
	float LargeChunkThreshold; // 0xc64(0x04)
	char pad_C68[0x10]; // 0xc68(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xc78(0x10)
	char pad_C88[0x88]; // 0xc88(0x88)

	void *81619df15f(); // Function Engine.DestructibleComponent.*81619df15f // Final|Native|Public|BlueprintCallable // @ game+0x6c18608
	void *c2a51a8aea(); // Function Engine.DestructibleComponent.*c2a51a8aea // Final|Native|Public|BlueprintCallable // @ game+0x6bf2464
	void *15c3764f94(); // Function Engine.DestructibleComponent.*15c3764f94 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bda7cc
	void *78cda25b7e(); // Function Engine.DestructibleComponent.*78cda25b7e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd95d0
};

// Class Engine.SaveGame
// Size: 0x30 (Inherited: 0x30)
struct USaveGame : UObject {
};

// Class Engine.*a3b7e4d578
// Size: 0x9d0 (Inherited: 0x9b0)
struct U*a3b7e4d578 : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x9a8(0x04)
	struct UBodySetup* *03f0c31ef3; // 0x9b0(0x08)
	char *97e70e56df : 1; // 0x9b8(0x01)
	char *caf3bcb1ba : 1; // 0x9b8(0x01)
	char *25b1d2d4e0 : 1; // 0x9b8(0x01)
	char pad_9BC_3 : 5; // 0x9bc(0x01)
	char pad_9BD[0x3]; // 0x9bd(0x03)
	struct UClass* AreaClass; // 0x9c0(0x08)
	char pad_9C8[0x8]; // 0x9c8(0x08)
};

// Class Engine.GameStateBase
// Size: 0x428 (Inherited: 0x3e8)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x3e8(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x3f0(0x08)
	struct UClass* SpectatorClass; // 0x3f8(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x400(0x10)
	bool *d3c2be67c8; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float *97f1b2a6ec; // 0x414(0x04)
	float *ad4174af37; // 0x418(0x04)
	float *f4803290f8; // 0x41c(0x04)
	char pad_420[0x8]; // 0x420(0x08)

	void *30eff713e8(); // Function Engine.GameStateBase.*30eff713e8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd5ec
	void *c19ec27f91(); // Function Engine.GameStateBase.*c19ec27f91 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe8c4
	void *2ae46ac202(); // Function Engine.GameStateBase.*2ae46ac202 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe81c
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0x7da004
	void *8c90983c69(); // Function Engine.GameStateBase.*8c90983c69 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e20814
	void *9c5ebaa37b(); // Function Engine.GameStateBase.*9c5ebaa37b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e9ec10
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0x5e4a710
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0x9b0f38
	void *d4e79c9423(); // Function Engine.GameStateBase.*d4e79c9423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf82c
	void *9816c4a151(); // Function Engine.GameStateBase.*9816c4a151 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf7dc
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xd3e39c
};

// Class Engine.GameState
// Size: 0x448 (Inherited: 0x428)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x428(0x08)
	struct FName PreviousMatchState; // 0x430(0x08)
	int32 ElapsedTime; // 0x438(0x04)
	char pad_43C[0xc]; // 0x43c(0x0c)

	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x5ded7a0
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0x965010
};

// Class Engine.BoxComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UBoxComponent : U*a3b7e4d578 {
	struct FVector BoxExtent; // 0x9c8(0x0c)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	void *0211fba5c3(); // Function Engine.BoxComponent.*0211fba5c3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfac3c
	void *f4af67cd92(); // Function Engine.BoxComponent.*f4af67cd92 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c1647c
	void *6ed44cdd4c(); // Function Engine.BoxComponent.*6ed44cdd4c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf87c8
};

// Class Engine.ProjectileMovementComponent
// Size: 0x310 (Inherited: 0x250)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x248(0x04)
	float MaxSpeed; // 0x24c(0x04)
	char bRotationFollowsVelocity : 1; // 0x250(0x01)
	char bShouldBounce : 1; // 0x250(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x250(0x01)
	char bForceSubStepping : 1; // 0x250(0x01)
	char bSimulationEnabled : 1; // 0x250(0x01)
	char bSweepCollision : 1; // 0x250(0x01)
	char bIsHomingProjectile : 1; // 0x250(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x250(0x01)
	char bIsSliding : 1; // 0x251(0x01)
	char bInterpMovement : 1; // 0x251(0x01)
	char bInterpRotation : 1; // 0x251(0x01)
	float PreviousHitTime; // 0x254(0x04)
	struct FVector PreviousHitNormal; // 0x258(0x0c)
	float ProjectileGravityScale; // 0x264(0x04)
	float *00c93b38f7; // 0x268(0x04)
	float Bounciness; // 0x26c(0x04)
	float Friction; // 0x270(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x274(0x04)
	float MinFrictionFraction; // 0x278(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x280(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x290(0x10)
	float HomingAccelerationMagnitude; // 0x2a0(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x2a4(0x08)
	float MaxSimulationTimeStep; // 0x2ac(0x04)
	int32 MaxSimulationIterations; // 0x2b0(0x04)
	int32 BounceAdditionalIterations; // 0x2b4(0x04)
	float InterpLocationTime; // 0x2b8(0x04)
	float InterpRotationTime; // 0x2bc(0x04)
	float InterpLocationMaxLagDistance; // 0x2c0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2c4(0x04)
	char pad_2C9[0x47]; // 0x2c9(0x47)

	void OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x3b43ac
	void *682b698b23(); // Function Engine.ProjectileMovementComponent.*682b698b23 // Native|Public|BlueprintCallable // @ game+0x6c1bb54
	void OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x3b43ac
	void *417e40db25(); // Function Engine.ProjectileMovementComponent.*417e40db25 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfedf4
	void LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c023a0
	void StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c2a150
	void *b0b3c27e08(); // Function Engine.ProjectileMovementComponent.*b0b3c27e08 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c0a0b4
	void *8a3fcb4372(); // Function Engine.ProjectileMovementComponent.*8a3fcb4372 // Native|Public|BlueprintCallable // @ game+0x5e28474
	void *ddf11306f9(); // Function Engine.ProjectileMovementComponent.*ddf11306f9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c2271c
	void *d1c2c36cc0(); // Function Engine.ProjectileMovementComponent.*d1c2c36cc0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bff864
};

// Class Engine.CurveBase
// Size: 0x38 (Inherited: 0x30)
struct UCurveBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	void *f290a1e402(); // Function Engine.CurveBase.*f290a1e402 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf494
	void *3997d7aa5d(); // Function Engine.CurveBase.*3997d7aa5d // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf16c
};

// Class Engine.GameUserSettings
// Size: 0x118 (Inherited: 0x30)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x30(0x01)
	bool bUseDynamicResolution; // 0x31(0x01)
	char pad_32[0x4e]; // 0x32(0x4e)
	uint32 ResolutionSizeX; // 0x80(0x04)
	uint32 ResolutionSizeY; // 0x84(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	int32 WindowPosX; // 0x90(0x04)
	int32 WindowPosY; // 0x94(0x04)
	int32 FullscreenMode; // 0x98(0x04)
	int32 LastConfirmedFullscreenMode; // 0x9c(0x04)
	int32 PreferredFullscreenMode; // 0xa0(0x04)
	uint32 Version; // 0xa4(0x04)
	int32 AudioQualityLevel; // 0xa8(0x04)
	float FrameRateLimit; // 0xac(0x04)
	char pad_B0[0x4]; // 0xb0(0x04)
	int32 DesiredScreenWidth; // 0xb4(0x04)
	bool bUseDesiredScreenHeight; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DesiredScreenHeight; // 0xbc(0x04)
	float LastRecommendedScreenWidth; // 0xc0(0x04)
	float LastRecommendedScreenHeight; // 0xc4(0x04)
	float LastCPUBenchmarkResult; // 0xc8(0x04)
	float LastGPUBenchmarkResult; // 0xcc(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xd0(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xe0(0x10)
	float LastGPUBenchmarkMultiplier; // 0xf0(0x04)
	bool bUseHDRDisplayOutput; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	int32 HDRDisplayOutputNits; // 0xf8(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xfc(0x01)
	bool bGPUDebug; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0x100(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x108(0x10)

	void *f09878a527(); // Function Engine.GameUserSettings.*f09878a527 // Final|Native|Public|BlueprintCallable // @ game+0x6c3b6b0
	void *7a77ec6483(); // Function Engine.GameUserSettings.*7a77ec6483 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c480fc
	void *62bb0b9181(); // Function Engine.GameUserSettings.*62bb0b9181 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3ddac
	void *16010d7314(); // Function Engine.GameUserSettings.*16010d7314 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xb74de4
	void *a5e93d4853(); // Function Engine.GameUserSettings.*a5e93d4853 // Final|Native|Public|BlueprintCallable // @ game+0x6c4717c
	void *54584e1936(); // Function Engine.GameUserSettings.*54584e1936 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c4077c
	void *e3a237f6aa(); // Function Engine.GameUserSettings.*e3a237f6aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3fd34
	void *d62db2618b(); // Function Engine.GameUserSettings.*d62db2618b // Native|Public|BlueprintCallable // @ game+0x9464a4
	void *50d117aec6(); // Function Engine.GameUserSettings.*50d117aec6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3f050
	void *52b88c9c83(); // Function Engine.GameUserSettings.*52b88c9c83 // Native|Public|BlueprintCallable // @ game+0x5e328cc
	void *13d64b82da(); // Function Engine.GameUserSettings.*13d64b82da // Final|Native|Public|BlueprintCallable // @ game+0x6c465c8
	void *34bb69adfa(); // Function Engine.GameUserSettings.*34bb69adfa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3d8b0
	void *f18a34db27(); // Function Engine.GameUserSettings.*f18a34db27 // Final|Native|Public|BlueprintCallable // @ game+0x6c387d4
	void *bf934dae7a(); // Function Engine.GameUserSettings.*bf934dae7a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c40218
	void *b6b6477ce1(); // Function Engine.GameUserSettings.*b6b6477ce1 // Native|Public|BlueprintCallable // @ game+0x6c3ed48
	void *7398906ef8(); // Function Engine.GameUserSettings.*7398906ef8 // Final|Native|Public|BlueprintCallable // @ game+0x6c46660
	void *4deaae310e(); // Function Engine.GameUserSettings.*4deaae310e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3d074
	void *9685e14f57(); // Function Engine.GameUserSettings.*9685e14f57 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c38390
	void LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x6c3b32c
	void *4338d69a5b(); // Function Engine.GameUserSettings.*4338d69a5b // Final|Native|Public|BlueprintCallable // @ game+0x6c46364
	void *bc9926799e(); // Function Engine.GameUserSettings.*bc9926799e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c46d38
	void *a8e280c616(); // Function Engine.GameUserSettings.*a8e280c616 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c40758
	void *ae46e29729(); // Function Engine.GameUserSettings.*ae46e29729 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3e834
	void *f90938b578(); // Function Engine.GameUserSettings.*f90938b578 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6c3d2dc
	void *56639da4d9(); // Function Engine.GameUserSettings.*56639da4d9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3f230
	void *21dcbf64ef(); // Function Engine.GameUserSettings.*21dcbf64ef // Native|Public|BlueprintCallable // @ game+0x5e3297c
	void *ab471d586e(); // Function Engine.GameUserSettings.*ab471d586e // Native|Public|BlueprintCallable // @ game+0x5e55b9c
	void *4c79fccc09(); // Function Engine.GameUserSettings.*4c79fccc09 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3f254
	void *a609aa78e1(); // Function Engine.GameUserSettings.*a609aa78e1 // Final|Native|Public|BlueprintCallable // @ game+0x6c464a0
	void *56cb0d0526(); // Function Engine.GameUserSettings.*56cb0d0526 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3d2f4
	void *4f7c4e69be(); // Function Engine.GameUserSettings.*4f7c4e69be // Final|Native|Public|BlueprintCallable // @ game+0x6c45bf4
	void *67e0825c74(); // Function Engine.GameUserSettings.*67e0825c74 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3d884
	void *d6b3133478(); // Function Engine.GameUserSettings.*d6b3133478 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3f9dc
	void *a14804f3fa(); // Function Engine.GameUserSettings.*a14804f3fa // Final|Native|Public|BlueprintCallable // @ game+0x6c469e8
	void *c71c9b8280(); // Function Engine.GameUserSettings.*c71c9b8280 // Final|Native|Public|BlueprintCallable // @ game+0x6c46dc4
	void *281d60d9bd(); // Function Engine.GameUserSettings.*281d60d9bd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3e2ac
	void *a498d39449(); // Function Engine.GameUserSettings.*a498d39449 // Final|Native|Public|BlueprintCallable // @ game+0x6c4652c
	void GetResolutionScaleInformation(); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3ee58
	void *da4f81d627(); // Function Engine.GameUserSettings.*da4f81d627 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3ce48
	void *a7688da407(); // Function Engine.GameUserSettings.*a7688da407 // Final|Native|Public|BlueprintCallable // @ game+0x6c46b2c
	void *5ad2ec17ad(); // Function Engine.GameUserSettings.*5ad2ec17ad // Final|Native|Public|BlueprintCallable // @ game+0x6c472f8
	void *7968528a88(); // Function Engine.GameUserSettings.*7968528a88 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3e820
	void *4c94344049(); // Function Engine.GameUserSettings.*4c94344049 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c40250
	void *5c14849ddf(); // Function Engine.GameUserSettings.*5c14849ddf // Native|Public|BlueprintCallable // @ game+0x6c3d2b0
	void *e183b3cb37(); // Function Engine.GameUserSettings.*e183b3cb37 // Native|Public|BlueprintCallable // @ game+0x6c468c8
	void *3db9445308(); // Function Engine.GameUserSettings.*3db9445308 // Final|Native|Public|BlueprintCallable // @ game+0x5e2cc54
	void *92dcc7d375(); // Function Engine.GameUserSettings.*92dcc7d375 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6c3d290
	void *b5a9c7fe3c(); // Function Engine.GameUserSettings.*b5a9c7fe3c // Native|Public|BlueprintCallable // @ game+0xbf35f4
	void *d9d0600777(); // Function Engine.GameUserSettings.*d9d0600777 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c401f4
	void *a27483cae9(); // Function Engine.GameUserSettings.*a27483cae9 // Final|Native|Public|BlueprintCallable // @ game+0x6c34c80
	void *4b36d81370(); // Function Engine.GameUserSettings.*4b36d81370 // Final|Native|Static|Public|BlueprintCallable // @ game+0xdab3cc
	void *2120c68df5(); // Function Engine.GameUserSettings.*2120c68df5 // Native|Public|BlueprintCallable // @ game+0x6c46168
	void *0a1ea4b6ce(); // Function Engine.GameUserSettings.*0a1ea4b6ce // Final|Native|Static|Public|BlueprintCallable // @ game+0x6c3d9b0
	void *5405e8f3e5(); // Function Engine.GameUserSettings.*5405e8f3e5 // Final|Native|Public|BlueprintCallable // @ game+0x6c463f0
	void *3292c1651c(); // Function Engine.GameUserSettings.*3292c1651c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3dd88
	void *9786fe7e17(); // Function Engine.GameUserSettings.*9786fe7e17 // Final|Native|Public|BlueprintCallable // @ game+0x6c462d8
	void *d55782ad36(); // Function Engine.GameUserSettings.*d55782ad36 // Final|Native|Public|BlueprintCallable // @ game+0x6c4695c
	void SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x6c46a98
	void *d319a7ba30(); // Function Engine.GameUserSettings.*d319a7ba30 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c40714
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x5e55b2c
	void *179e926ab3(); // Function Engine.GameUserSettings.*179e926ab3 // Final|Native|Public|BlueprintCallable // @ game+0x6c470f0
	void *a70fd254a1(); // Function Engine.GameUserSettings.*a70fd254a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3fd20
	void *a36569de53(); // Function Engine.GameUserSettings.*a36569de53 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c4022c
	void *7216dd5245(); // Function Engine.GameUserSettings.*7216dd5245 // Native|Public|BlueprintCallable // @ game+0x6631ff4
	void *871e12b97e(); // Function Engine.GameUserSettings.*871e12b97e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3ce34
	void *274fd91604(); // Function Engine.GameUserSettings.*274fd91604 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6c3d898
};

// Class Engine.GameInstance
// Size: 0x1f0 (Inherited: 0x30)
struct UGameInstance : UObject {
	char pad_30[0x80]; // 0x30(0x80)
	struct U*d3391c2860* *d3391c2860; // 0xb0(0x08)
	char pad_B8[0x18]; // 0xb8(0x18)
	struct U*bd40d2e124* *bd40d2e124; // 0xd0(0x08)
	char pad_D8[0x30]; // 0xd8(0x30)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0x108(0x10)
	char pad_118[0xd8]; // 0x118(0xd8)

	void DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x6be83bc
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x3b43ac
	void HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void DebugCreatePlayer(); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x6be8328
	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x3b43ac
};

// Class Engine.TriggerBase
// Size: 0x3f0 (Inherited: 0x3e8)
struct ATriggerBase : AActor {
	struct U*a3b7e4d578* CollisionComponent; // 0x3e8(0x08)
};

// Class Engine.TriggerBox
// Size: 0x3f0 (Inherited: 0x3f0)
struct ATriggerBox : ATriggerBase {
};

// Class Engine.CapsuleComponent
// Size: 0x9e0 (Inherited: 0x9d0)
struct UCapsuleComponent : U*a3b7e4d578 {
	float CapsuleHalfHeight; // 0x9c8(0x04)
	float CapsuleRadius; // 0x9cc(0x04)
	float CapsuleHeight; // 0x9d0(0x04)
	char pad_9DC[0x4]; // 0x9dc(0x04)

	void *2e26aaaf30(); // Function Engine.CapsuleComponent.*2e26aaaf30 // Native|Public|BlueprintCallable // @ game+0x6bccf90
	void *ef518e2bd2(); // Function Engine.CapsuleComponent.*ef518e2bd2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8910
	void *bc3968cb8f(); // Function Engine.CapsuleComponent.*bc3968cb8f // Final|Native|Public|BlueprintCallable // @ game+0x6c16824
	void *011d593501(); // Function Engine.CapsuleComponent.*011d593501 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8870
	void *26dc85d144(); // Function Engine.CapsuleComponent.*26dc85d144 // Final|Native|Public|BlueprintCallable // @ game+0x6c16910
	void *bdde07625c(); // Function Engine.CapsuleComponent.*bdde07625c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8c78
	void *f8205dfbb2(); // Function Engine.CapsuleComponent.*f8205dfbb2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfac7c
	void *0875f2063a(); // Function Engine.CapsuleComponent.*0875f2063a // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfadc0
	void *1e1f900e13(); // Function Engine.CapsuleComponent.*1e1f900e13 // Final|Native|Public|BlueprintCallable // @ game+0x6c16690
	void *3a3aa0f9aa(); // Function Engine.CapsuleComponent.*3a3aa0f9aa // Native|Public|BlueprintCallable // @ game+0x6bcd024
	void *2c7d490376(); // Function Engine.CapsuleComponent.*2c7d490376 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfacb8
	void *9b7bc42e76(); // Function Engine.CapsuleComponent.*9b7bc42e76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8824
	void *67e552295b(); // Function Engine.CapsuleComponent.*67e552295b // Native|Public|BlueprintCallable // @ game+0x6bcd0bc
	void *e181a1cfbd(); // Function Engine.CapsuleComponent.*e181a1cfbd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfac64
	void *e4b72b64f4(); // Function Engine.CapsuleComponent.*e4b72b64f4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfaca0
	void *aed5587e4f(); // Function Engine.CapsuleComponent.*aed5587e4f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf88c4
	void *a34ddecc70(); // Function Engine.CapsuleComponent.*a34ddecc70 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8a44
};

// Class Engine.PhysicsVolume
// Size: 0x438 (Inherited: 0x420)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x420(0x04)
	int32 Priority; // 0x424(0x04)
	float FluidFriction; // 0x428(0x04)
	char bWaterVolume : 1; // 0x42c(0x01)
	char bPhysicsOnContact : 1; // 0x42c(0x01)
	char pad_42C_2 : 6; // 0x42c(0x01)
	char pad_42D[0x3]; // 0x42d(0x03)
	bool *dd9a04a32f; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x7f0 (Inherited: 0x7a0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7a0(0x01)
	char *76e211aeb5 : 1; // 0x7a0(0x01)
	char pad_7A0_2 : 6; // 0x7a0(0x01)
	char pad_7A1[0x7]; // 0x7a1(0x07)
	struct U*dd9d99e533* *148f44aecb; // 0x7a8(0x08)
	char pad_7B0[0x20]; // 0x7b0(0x20)
	float SpeedScale; // 0x7d0(0x04)
	float InitialMaxSpeed; // 0x7d4(0x04)
	float InitialAccel; // 0x7d8(0x04)
	float InitialDecel; // 0x7dc(0x04)
	char pad_7E0[0x10]; // 0x7e0(0x10)

	void ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x6bd1c1c
	void *75c4cb893b(); // Function Engine.DebugCameraController.*75c4cb893b // Final|Native|Public|BlueprintCallable // @ game+0x6bd2a34
	void *f6b8be8510(); // Function Engine.DebugCameraController.*f6b8be8510 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbea7c
	void *35c773a147(); // Function Engine.DebugCameraController.*35c773a147 // Final|Native|Public|BlueprintCallable // @ game+0x6bcfb68
	void ReceiveOnActorSelected(); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x3b43ac
	void ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x3b43ac
};

// Class Engine.Channel
// Size: 0x70 (Inherited: 0x30)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x38]; // 0x38(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x70)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_78[0x2f8]; // 0x78(0x2f8)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	char pad_370[0x20]; // 0x370(0x20)
};

// Class Engine.NavigationObjectBase
// Size: 0x410 (Inherited: 0x3e8)
struct ANavigationObjectBase : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x3f0(0x08)
	struct UBillboardComponent* *1e66e18c2d; // 0x3f8(0x08)
	struct UBillboardComponent* *7b636d7ee5; // 0x400(0x08)
	char *0cf4674479 : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
};

// Class Engine.PlayerStart
// Size: 0x418 (Inherited: 0x410)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x410(0x08)
};

// Class Engine.CheatManager
// Size: 0x80 (Inherited: 0x30)
struct UCheatManager : UObject {
	struct ADebugCameraController* *7d926fcff8; // 0x30(0x08)
	struct UClass* DebugCameraControllerClass; // 0x38(0x08)
	char pad_40[0x40]; // 0x40(0x40)

	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x5e55b2c
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x6c47750
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x6bd29cc
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0x5e328cc
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x5e55ad4
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x6c3b028
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x6c25050
	void *50dd42b97f(); // Function Engine.CheatManager.*50dd42b97f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6c4628c
	void ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x6c49718
	void Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x6c48038
	void *700af58636(); // Function Engine.CheatManager.*700af58636 // Native|Protected|BlueprintCallable // @ game+0x6c3b314
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x6c3cc8c
	void ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x6c49684
	void DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x6c3af8c
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0xf2034c
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x5dd5b00
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x6c4681c
	void FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x6c3cca4
	void DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x6c3b280
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x5e55b84
	void DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x653f980
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x5e55aec
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x6c4524c
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x6c40188
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x6c3b4dc
	void CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x6c38454
	void DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x6c3b0f0
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x6c3b4f4
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x6c3b0d8
	void SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x6c46830
	void BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x6c367c4
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x6c4545c
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0xd9c07c
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x5e4b084
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x6c3b50c
	void StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x6c47d7c
	void DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x6c3b040
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void *3854a48cf0(); // Function Engine.CheatManager.*3854a48cf0 // Native|Protected|BlueprintCallable // @ game+0x6c3b5a4
	void StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x6c47ce8
	void ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x6c495f0
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x5e4ac6c
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x6c497dc
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x6c48124
	void BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x6c36aa4
	void ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x6c383b8
	void DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x6c3b1a0
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x6c47384
	void OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6c44ccc
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0x6c3b188
	void BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x6c36888
};

// Class Engine.*e915f35194
// Size: 0x9c0 (Inherited: 0x9b0)
struct U*e915f35194 : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0x9b0(0x10)
};

// Class Engine.NavArea
// Size: 0x48 (Inherited: 0x30)
struct UNavArea : UObject {
	float DefaultCost; // 0x30(0x04)
	float FixedAreaEnteringCost; // 0x34(0x04)
	struct FColor DrawColor; // 0x38(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x3c(0x04)
	char bSupportsAgent0 : 1; // 0x40(0x01)
	char bSupportsAgent1 : 1; // 0x40(0x01)
	char bSupportsAgent2 : 1; // 0x40(0x01)
	char bSupportsAgent3 : 1; // 0x40(0x01)
	char bSupportsAgent4 : 1; // 0x40(0x01)
	char bSupportsAgent5 : 1; // 0x40(0x01)
	char bSupportsAgent6 : 1; // 0x40(0x01)
	char bSupportsAgent7 : 1; // 0x40(0x01)
	char bSupportsAgent8 : 1; // 0x41(0x01)
	char bSupportsAgent9 : 1; // 0x41(0x01)
	char bSupportsAgent10 : 1; // 0x41(0x01)
	char bSupportsAgent11 : 1; // 0x41(0x01)
	char bSupportsAgent12 : 1; // 0x41(0x01)
	char bSupportsAgent13 : 1; // 0x41(0x01)
	char bSupportsAgent14 : 1; // 0x41(0x01)
	char bSupportsAgent15 : 1; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x3f0 (Inherited: 0x3e8)
struct ALevelScriptActor : AActor {
	char *a7ca75b064 : 1; // 0x3e8(0x01)
	char pad_3E8_1 : 7; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)

	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x3b43ac
	void *5a504151cb(); // Function Engine.LevelScriptActor.*5a504151cb // Native|Public|BlueprintCallable // @ game+0xcac510
	void *dcb17fb5d9(); // Function Engine.LevelScriptActor.*dcb17fb5d9 // Native|Public|BlueprintCallable // @ game+0x5e5bb2c
};

// Class Engine.ChildActorComponent
// Size: 0x4a0 (Inherited: 0x470)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x468(0x08)
	struct AActor* ChildActor; // 0x470(0x08)
	struct AActor* ChildActorTemplate; // 0x478(0x08)
	char pad_488[0x18]; // 0x488(0x18)

	void *a0eca42e03(); // Function Engine.ChildActorComponent.*a0eca42e03 // Final|Native|Public|BlueprintCallable // @ game+0x6bccc78
};

// Class Engine.CameraComponent
// Size: 0xa60 (Inherited: 0x470)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x468(0x04)
	float OrthoWidth; // 0x46c(0x04)
	float OrthoNearClipPlane; // 0x470(0x04)
	float OrthoFarClipPlane; // 0x474(0x04)
	float AspectRatio; // 0x478(0x04)
	char bConstrainAspectRatio : 1; // 0x47c(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x47c(0x01)
	char bLockToHmd : 1; // 0x47c(0x01)
	char bUsePawnControlRotation : 1; // 0x47c(0x01)
	enum class ECameraProjectionMode ProjectionMode; // 0x480(0x01)
	float PostProcessBlendWeight; // 0x484(0x04)
	char pad_489_4 : 4; // 0x489(0x01)
	char pad_48A[0x6]; // 0x48a(0x06)
	struct FPostProcessSettings PostProcessSettings; // 0x490(0x570)
	char pad_A00[0x58]; // 0xa00(0x58)
	char bUseControllerViewRotation : 1; // 0xa58(0x01)
	char pad_A58_1 : 7; // 0xa58(0x01)
	char pad_A59[0x7]; // 0xa59(0x07)

	void *3e8a28e83e(); // Function Engine.CameraComponent.*3e8a28e83e // Final|Native|Public|BlueprintCallable // @ game+0x6c221d4
	void *ed3ee02381(); // Function Engine.CameraComponent.*ed3ee02381 // Final|Native|Public|BlueprintCallable // @ game+0x6c14eac
	void *2cfadfbbf2(); // Function Engine.CameraComponent.*2cfadfbbf2 // Final|Native|Public|BlueprintCallable // @ game+0x6c176b4
	void *65b65a3f19(); // Function Engine.CameraComponent.*65b65a3f19 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bf0ef4
	void *1dc2d160f2(); // Function Engine.CameraComponent.*1dc2d160f2 // Final|Native|Public|BlueprintCallable // @ game+0x6c19cb8
	void *052965d968(); // Function Engine.CameraComponent.*052965d968 // Final|Native|Public|BlueprintCallable // @ game+0x6c1dfa8
	void *cb2bddba68(); // Function Engine.CameraComponent.*cb2bddba68 // Final|Native|Public|BlueprintCallable // @ game+0x6c1eddc
	void *fc57e66de9(); // Function Engine.CameraComponent.*fc57e66de9 // Final|Native|Public|BlueprintCallable // @ game+0x6c1ea50
	void *a634495c79(); // Function Engine.CameraComponent.*a634495c79 // Final|Native|Public|BlueprintCallable // @ game+0x6c1b994
	void *47a266b8d3(); // Function Engine.CameraComponent.*47a266b8d3 // Final|Native|Public|BlueprintCallable // @ game+0x6c1df10
	void *fa132a0246(); // Function Engine.CameraComponent.*fa132a0246 // Final|Native|Public|BlueprintCallable // @ game+0x6bd82f0
};

// Class Engine.Engine
// Size: 0xf60 (Inherited: 0x30)
struct UEngine : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FStringAssetReference TinyFontName; // 0x40(0x10)
	struct UFont* SmallFont; // 0x50(0x08)
	struct FStringAssetReference SmallFontName; // 0x58(0x10)
	struct UFont* *507343f03f; // 0x68(0x08)
	struct FStringAssetReference MediumFontName; // 0x70(0x10)
	struct UFont* LargeFont; // 0x80(0x08)
	struct FStringAssetReference LargeFontName; // 0x88(0x10)
	struct UFont* *ae8c533874; // 0x98(0x08)
	struct FStringAssetReference SubtitleFontName; // 0xa0(0x10)
	struct TArray<struct UFont*> *bf37e23aad; // 0xb0(0x10)
	int32 *1869c29680; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct FStringAssetReference DefaultBokehTextureName; // 0xc8(0x10)
	struct UMaterial* *3c832889f7; // 0xd8(0x08)
	struct UTexture2D* *6f11af224f; // 0xe0(0x08)
	char bAllowMatureLanguage : 1; // 0xe8(0x01)
	char pad_E8_1 : 7; // 0xe8(0x01)
	char pad_E9[0x3]; // 0xe9(0x03)
	float CameraRotationThreshold; // 0xec(0x04)
	struct TArray<struct F*0ae4a8d9ad> ActiveGameNameRedirects; // 0xf0(0x10)
	struct FString LevelColorationUnlitMaterialName; // 0x100(0x10)
	struct UMaterialInstanceDynamic* *2fc3307afc; // 0x110(0x08)
	enum class *dcab1bab62 *20eca73099; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
	struct FStringClassReference ConsoleClassName; // 0x120(0x10)
	char bCanBlueprintsTickByDefault : 1; // 0x130(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x130(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x130(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x130(0x01)
	char pad_130_4 : 1; // 0x130(0x01)
	char bSmoothFrameRate : 1; // 0x130(0x01)
	char bUseFixedFrameRate : 1; // 0x130(0x01)
	char pad_130_7 : 1; // 0x130(0x01)
	char pad_131[0x7]; // 0x131(0x07)
	struct FString *9c43f6ae30; // 0x138(0x10)
	struct F*a670be9e73 PhysicErrorCorrection; // 0x148(0x1c)
	float DisplayGamma; // 0x164(0x04)
	struct UClass* *f097998e2e; // 0x168(0x08)
	struct UMaterial* LevelColorationLitMaterial; // 0x170(0x08)
	struct FFloatRange SmoothedFrameRateRange; // 0x178(0x10)
	struct FColor *f3e6f5bfd3; // 0x188(0x04)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct TArray<struct FString> *93075208c5; // 0x190(0x10)
	char pad_1A0[0x18]; // 0x1a0(0x18)
	struct FStringAssetReference ArrowMaterialName; // 0x1b8(0x10)
	struct UClass* *5df25eabe1; // 0x1c8(0x08)
	struct UTexture2D* *acefe7e29a; // 0x1d0(0x08)
	struct UMaterialInstanceDynamic* *c12f2d2c67; // 0x1d8(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0x1e0(0x10)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0x1f0(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x200(0x08)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x208(0x10)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0x218(0x10)
	struct FColor *8630e54ec6; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct FStringAssetReference MiniFontTextureName; // 0x230(0x10)
	float PrimitiveProbablyVisibleTime; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x248(0x08)
	float IdealLightMapDensity; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct UGameUserSettings* GameUserSettings; // 0x258(0x08)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x260(0x10)
	struct UTextureCube* *27c2cc10e6; // 0x270(0x08)
	float *8650eed282; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0x280(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x290(0x10)
	struct FString WireframeMaterialName; // 0x2a0(0x10)
	struct UClass* *398beed366; // 0x2b0(0x08)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x2b8(0x10)
	struct FStringClassReference LocalPlayerClassName; // 0x2c8(0x10)
	struct FStringClassReference GameViewportClientClassName; // 0x2d8(0x10)
	struct FStringClassReference LevelScriptActorClassName; // 0x2e8(0x10)
	struct FStringClassReference AIControllerClassName; // 0x2f8(0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x308(0x10)
	char bRenderLightMapDensityGrayscale : 1; // 0x318(0x01)
	char pad_318_1 : 7; // 0x318(0x01)
	char pad_319[0x7]; // 0x319(0x07)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0x320(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x330(0x10)
	struct UMaterialInstanceDynamic* *7e0f4b06ea; // 0x340(0x08)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0x348(0x10)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x358(0x10)
	char bSubtitlesEnabled : 1; // 0x368(0x01)
	char pad_368_1 : 7; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x370(0x08)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x378(0x04)
	struct FColor *d70aaca090; // 0x37c(0x04)
	float NetClientTicksPerSecond; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct FStringAssetReference LightMapDensityTextureName; // 0x388(0x10)
	int32 *ffcb6d7674; // 0x398(0x04)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x39c(0x10)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x3b0(0x10)
	struct TArray<struct F*7decbe1dec> ActivePluginRedirects; // 0x3c0(0x10)
	char pad_3D0[0x8]; // 0x3d0(0x08)
	char bHardwareSurveyEnabled : 1; // 0x3d8(0x01)
	char pad_3D8_1 : 7; // 0x3d8(0x01)
	char pad_3D9[0x7]; // 0x3d9(0x07)
	struct UMaterialInstanceDynamic* *254455a899; // 0x3e0(0x08)
	struct UClass* *86033d1ce7; // 0x3e8(0x08)
	struct UClass* *bca32af458; // 0x3f0(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x3f8(0x10)
	struct FColor *52674cf283; // 0x408(0x04)
	char pad_40C[0x4]; // 0x40c(0x04)
	struct UMaterial* VertexColorMaterial; // 0x410(0x08)
	struct TArray<struct F*53e10b7853> ActiveStructRedirects; // 0x418(0x10)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0x428(0x10)
	struct UClass* *493183b606; // 0x438(0x08)
	struct FColor *5a2eee72e8; // 0x440(0x04)
	int32 *0a40c80458; // 0x444(0x04)
	struct UMaterial* *64c29e4c8e; // 0x448(0x08)
	float MeshLODRange; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x458(0x10)
	struct UMaterialInstanceDynamic* *72154a0386; // 0x468(0x08)
	float MaxPixelShaderAdditiveComplexityCount; // 0x470(0x04)
	char pad_474[0x54]; // 0x474(0x54)
	struct FStringClassReference GameSingletonClassName; // 0x4c8(0x10)
	float MaxOcclusionPixelsFraction; // 0x4d8(0x04)
	char pad_4DC[0x4]; // 0x4dc(0x04)
	struct UMaterial* *38f7dc552f; // 0x4e0(0x08)
	struct FString *2a2ef25c03; // 0x4e8(0x10)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x4f8(0x10)
	struct UObject* *c09072c920; // 0x508(0x08)
	struct UMaterial* DebugMeshMaterial; // 0x510(0x08)
	struct FColor *707f925d4e; // 0x518(0x04)
	char pad_51C[0x4]; // 0x51c(0x04)
	struct FStringAssetReference DefaultTextureName; // 0x520(0x10)
	struct FString PlayOnConsoleSaveDir; // 0x530(0x10)
	struct TArray<struct F*ca6e9f58f0> *665f43cd1a; // 0x540(0x10)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0x550(0x10)
	struct FColor *563b988ac5; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct FStringClassReference AvoidanceManagerClassName; // 0x568(0x10)
	struct UTexture2D* *8f60aed062; // 0x578(0x08)
	struct UClass* *eac8e4cb12; // 0x580(0x08)
	struct UGameViewportClient* GameViewport; // 0x588(0x08)
	struct UMaterial* *e6d19dd636; // 0x590(0x08)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x598(0x10)
	struct UMaterial* *eae6f63fae; // 0x5a8(0x08)
	struct FString VertexColorMaterialName; // 0x5b0(0x10)
	struct UMaterial* *9eae766840; // 0x5c0(0x08)
	char bSubtitlesForcedOff : 1; // 0x5c8(0x01)
	char pad_5C8_1 : 7; // 0x5c8(0x01)
	char pad_5C9[0x7]; // 0x5c9(0x07)
	struct UMaterial* *ed6cf214e5; // 0x5d0(0x08)
	struct UTexture* WeightMapPlaceholderTexture; // 0x5d8(0x08)
	struct FStringClassReference AssetManagerClassName; // 0x5e0(0x10)
	struct UTexture2D* *724b637f77; // 0x5f0(0x08)
	struct TArray<struct F*c345caf06a> ActiveClassRedirects; // 0x5f8(0x10)
	struct FStringClassReference WorldSettingsClassName; // 0x608(0x10)
	struct FString LevelColorationLitMaterialName; // 0x618(0x10)
	struct FColor *93d8306f3e; // 0x628(0x04)
	float RenderLightMapDensityGrayscaleScale; // 0x62c(0x04)
	float MinLightMapDensity; // 0x630(0x04)
	struct FColor *0726a044a7; // 0x634(0x04)
	struct FLinearColor LightingOnlyBrightness; // 0x638(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x648(0x10)
	float FixedFrameRate; // 0x658(0x04)
	char pad_65C[0x4]; // 0x65c(0x04)
	struct FString ShadedLevelColorationLitMaterialName; // 0x660(0x10)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x670(0x01)
	char pad_670_1 : 7; // 0x670(0x01)
	char pad_671[0x3]; // 0x671(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0x674(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x678(0x01)
	char pad_678_1 : 7; // 0x678(0x01)
	char pad_679[0x7]; // 0x679(0x07)
	struct UClass* *ad8296b465; // 0x680(0x08)
	struct UMaterial* *ab703d8f59; // 0x688(0x08)
	struct UMaterial* WireframeMaterial; // 0x690(0x08)
	struct UAssetManager* AssetManager; // 0x698(0x08)
	struct UMaterialInstanceDynamic* *d3f16fe233; // 0x6a0(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x6a8(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x6b8(0x08)
	float CameraTranslationThreshold; // 0x6c0(0x04)
	char pad_6C4[0x4]; // 0x6c4(0x04)
	struct UMaterial* *4bb7c31cac; // 0x6c8(0x08)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x6d0(0x10)
	struct FColor *e67cf9003a; // 0x6e0(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x6e4(0x10)
	struct FLinearColor *3102132612; // 0x6f4(0x10)
	struct FLinearColor *bde2361a9e; // 0x704(0x10)
	struct FLinearColor *51c458ade6; // 0x714(0x10)
	struct FLinearColor *5ec7359838; // 0x724(0x10)
	bool *c803f0265e; // 0x734(0x01)
	char pad_735[0x3]; // 0x735(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x738(0x01)
	char *752ed78a39 : 1; // 0x738(0x01)
	char bSuppressMapWarnings : 1; // 0x738(0x01)
	char bDisableAILogging : 1; // 0x738(0x01)
	char pad_738_4 : 4; // 0x738(0x01)
	char pad_739[0x3]; // 0x739(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x73c(0x04)
	struct FBox *bd784f0e4c; // 0x740(0x1c)
	char pad_75C[0x4]; // 0x75c(0x04)
	int32 *b6f2f8e636; // 0x760(0x04)
	char *bdad3e99f4 : 1; // 0x764(0x01)
	char pad_764_1 : 7; // 0x764(0x01)
	char pad_765[0x3]; // 0x765(0x03)
	struct FString ParticleEventManagerClassPath; // 0x768(0x10)
	char pad_778[0x28]; // 0x778(0x28)
	float SelectionHighlightIntensity; // 0x7a0(0x04)
	float *c80ce80761; // 0x7a4(0x04)
	float BSPSelectionHighlightIntensity; // 0x7a8(0x04)
	float HoverHighlightIntensity; // 0x7ac(0x04)
	float *dd881ac63c; // 0x7b0(0x04)
	float PrimitiveBaseIntensity; // 0x7b4(0x04)
	float PrimitiveSelectedIntensity; // 0x7b8(0x04)
	float PrimitiveHoverIntensity; // 0x7bc(0x04)
	char pad_7C0[0x290]; // 0x7c0(0x290)
	char bPauseOnLossOfFocus : 1; // 0xa50(0x01)
	char pad_A50_1 : 7; // 0xa50(0x01)
	char pad_A51[0x3]; // 0xa51(0x03)
	int32 MaxParticleResize; // 0xa54(0x04)
	struct FString LightingTexelDensityName; // 0xa58(0x10)
	float MaxLightMapDensity; // 0xa68(0x04)
	char pad_A6C[0x4]; // 0xa6c(0x04)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0xa70(0x10)
	struct UTexture2D* DefaultTexture; // 0xa80(0x08)
	struct UTexture2D* MiniFontTexture; // 0xa88(0x08)
	int32 MaxParticleResizeWarn; // 0xa90(0x04)
	char pad_A94[0xc]; // 0xa94(0x0c)
	float MinDesiredFrameRate; // 0xaa0(0x04)
	char pad_AA4[0x1dc]; // 0xaa4(0x1dc)
	struct TArray<struct F*71c8b5597f> NetDriverDefinitions; // 0xc80(0x10)
	struct TArray<struct FString> ServerActors; // 0xc90(0x10)
	struct TArray<struct FString> *2ce8af1bee; // 0xca0(0x10)
	char *e86f62ac90 : 1; // 0xcb0(0x01)
	char pad_CB0_1 : 7; // 0xcb0(0x01)
	char pad_CB1[0x7]; // 0xcb1(0x07)
	struct UTexture2D* *4da9fb7bb4; // 0xcb8(0x08)
	struct UTexture* DefaultDiffuseTexture; // 0xcc0(0x08)
	struct UClass* *802217e7fd; // 0xcc8(0x08)
	struct FColor *aea916ce36; // 0xcd0(0x04)
	float RenderLightMapDensityColorScale; // 0xcd4(0x04)
	struct UMaterialInstanceDynamic* *c9913ab955; // 0xcd8(0x08)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0xce0(0x10)
	int32 MaximumLoopIterationCount; // 0xcf0(0x04)
	char pad_CF4[0x4]; // 0xcf4(0x04)
	struct FStringClassReference GameUserSettingsClassName; // 0xcf8(0x10)
	struct FStringAssetReference DebugMeshMaterialName; // 0xd08(0x10)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0xd18(0x10)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0xd28(0x10)
	struct UMaterial* *2364035723; // 0xd38(0x08)
	struct TArray<struct F*4fc053d54d> StatColorMappings; // 0xd40(0x10)
	struct FStringClassReference NavigationSystemClassName; // 0xd50(0x10)
	struct FColor *e415b10ea1; // 0xd60(0x04)
	char pad_D64[0x4]; // 0xd64(0x04)
	struct FStringAssetReference DefaultPhysMaterialName; // 0xd68(0x10)
	struct FColor *244e026abb; // 0xd78(0x04)
	float NearClipPlane; // 0xd7c(0x04)
	struct UTexture2D* *b064f85396; // 0xd80(0x08)
	struct UMaterial* *3af804f5e4; // 0xd88(0x08)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0xd90(0x10)
	char pad_DA0[0x18]; // 0xda0(0x18)
	int32 *d6c76d00bb; // 0xdb8(0x04)
	char pad_DBC[0x1a4]; // 0xdbc(0x1a4)
};

// Class Engine.*9f9daacaf2
// Size: 0x40 (Inherited: 0x30)
struct U*9f9daacaf2 : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x670 (Inherited: 0x40)
struct UGameViewportClient : U*9f9daacaf2 {
	char pad_40[0xa8]; // 0x40(0xa8)
	struct TArray<struct F*c7179e5679> *fc61f1b873; // 0xe8(0x10)
	char pad_F8[0x220]; // 0xf8(0x220)
	struct UConsole* *d90abf5355; // 0x318(0x08)
	char pad_320[0x348]; // 0x320(0x348)
	struct UGameInstance* GameInstance; // 0x668(0x08)

	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0x6c124a8
	void SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x6c174a0
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x6c25050
};

// Class Engine.Console
// Size: 0x110 (Inherited: 0x30)
struct UConsole : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct ULocalPlayer* *5524a3c76c; // 0x40(0x08)
	struct UTexture2D* *f4becc10a3; // 0x48(0x08)
	struct UTexture2D* *75070b6094; // 0x50(0x08)
	char pad_58[0x18]; // 0x58(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x70(0x10)
	char pad_80[0x90]; // 0x80(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c8 (Inherited: 0x30)
struct UNetDriver : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct FString NetConnectionClassName; // 0x38(0x10)
	int32 MaxDownloadSize; // 0x48(0x04)
	char bClampListenServerTickRate : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32 NetServerMaxTickRate; // 0x50(0x04)
	int32 MaxInternetClientRate; // 0x54(0x04)
	int32 MaxClientRate; // 0x58(0x04)
	float ServerTravelPause; // 0x5c(0x04)
	float SpawnPrioritySeconds; // 0x60(0x04)
	float RelevantTimeout; // 0x64(0x04)
	float KeepAliveTime; // 0x68(0x04)
	float InitialConnectTimeout; // 0x6c(0x04)
	float ConnectionTimeout; // 0x70(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x74(0x04)
	bool bNoTimeouts; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UNetConnection* *7d547c567d; // 0x80(0x08)
	struct TArray<struct UNetConnection*> *e5213003a6; // 0x88(0x10)
	char pad_98[0x28]; // 0x98(0x28)
	struct UWorld* World; // 0xc0(0x08)
	struct UPackage* *08f3ae6a9a; // 0xc8(0x08)
	char pad_D0[0x20]; // 0xd0(0x20)
	struct UClass* *cac88d6246; // 0xf0(0x08)
	struct UProperty* *ea450d9b76; // 0xf8(0x08)
	struct UProperty* *662b5c1bdb; // 0x100(0x08)
	struct FName NetDriverName; // 0x108(0x08)
	char pad_110[0x8]; // 0x110(0x08)
	float Time; // 0x118(0x04)
	char pad_11C[0x3ac]; // 0x11c(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c8)
struct UDemoNetDriver : UNetDriver {
	char pad_4C8[0xf8]; // 0x4c8(0xf8)
	struct TMap<struct FString, struct F*2c11a2a2dc> *0468103a99; // 0x5c0(0x50)
	char pad_610[0x430]; // 0x610(0x430)
	bool *0efb4f545b; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc30 (Inherited: 0xb50)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*00296bd9df> PerInstanceSMData; // 0xb50(0x10)
	int32 InstancingRandomSeed; // 0xb60(0x04)
	int32 InstanceStartCullDistance; // 0xb64(0x04)
	int32 InstanceEndCullDistance; // 0xb68(0x04)
	char pad_B6C[0x4]; // 0xb6c(0x04)
	struct TArray<int32> *8ac0f5c877; // 0xb70(0x10)
	struct TArray<int32> *779539efbd; // 0xb80(0x10)
	char pad_B90[0x78]; // 0xb90(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xc08(0x08)
	bool *b3b71326a9; // 0xc10(0x01)
	char pad_C11[0x3]; // 0xc11(0x03)
	int32 *9ff5d4ad59; // 0xc14(0x04)
	struct TArray<struct F*cf35bf3a14> *a62ebc8109; // 0xc18(0x10)
	char pad_C28[0x8]; // 0xc28(0x08)

	void *af6477ee17(); // Function Engine.InstancedStaticMeshComponent.*af6477ee17 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd7cbc
	void *91e4299bf1(); // Function Engine.InstancedStaticMeshComponent.*91e4299bf1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c1b40c
	void *068cda575c(); // Function Engine.InstancedStaticMeshComponent.*068cda575c // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c2c110
	void *6676b9aa35(); // Function Engine.InstancedStaticMeshComponent.*6676b9aa35 // Final|Native|Public|BlueprintCallable // @ game+0x6c18050
	void *e298126c80(); // Function Engine.InstancedStaticMeshComponent.*e298126c80 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf4b80
	void *be3ae800fc(); // Function Engine.InstancedStaticMeshComponent.*be3ae800fc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd80fc
	void *f58b7ec745(); // Function Engine.InstancedStaticMeshComponent.*f58b7ec745 // Native|Public|BlueprintCallable // @ game+0x5e26ce4
	void *4b502e7200(); // Function Engine.InstancedStaticMeshComponent.*4b502e7200 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf3c28
	void *cf01ee4c9a(); // Function Engine.InstancedStaticMeshComponent.*cf01ee4c9a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf3e08
	void *765b562637(); // Function Engine.InstancedStaticMeshComponent.*765b562637 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf428c
	void *a978c20ae5(); // Function Engine.InstancedStaticMeshComponent.*a978c20ae5 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf4a18
	void *e1ee01c104(); // Function Engine.InstancedStaticMeshComponent.*e1ee01c104 // Native|Public|BlueprintCallable // @ game+0x6c11754
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xd60 (Inherited: 0xc30)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C30[0x68]; // 0xc30(0x68)
	struct TArray<int32> *5476f2f76f; // 0xc98(0x10)
	int32 *e097f8dc22; // 0xca8(0x04)
	char pad_CAC[0x4]; // 0xcac(0x04)
	struct FBox *73116382bf; // 0xcb0(0x1c)
	struct FBox *0a7014d240; // 0xccc(0x1c)
	struct TArray<struct FBox> *36aef9bc89; // 0xce8(0x10)
	char pad_CF8[0x20]; // 0xcf8(0x20)
	int32 *03b06dfb87; // 0xd18(0x04)
	struct FBoxSphereBounds *df22e79645; // 0xd1c(0x1c)
	char *515f2592b9 : 1; // 0xd38(0x01)
	char *d571b06104 : 1; // 0xd38(0x01)
	char pad_D38_2 : 6; // 0xd38(0x01)
	char pad_D39[0x27]; // 0xd39(0x27)

	void *0c79aede64(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*0c79aede64 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c117f8
};

// Class Engine.GameEngine
// Size: 0xfc0 (Inherited: 0xf60)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf60(0x04)
	float ServerFlushLogInterval; // 0xf64(0x04)
	struct UGameInstance* GameInstance; // 0xf68(0x08)
	char pad_F70[0x40]; // 0xf70(0x40)
	struct TArray<struct UWorld*> *7be9bd717a; // 0xfb0(0x10)
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
struct UPlayer : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	int32 *c8c4b728e8; // 0x40(0x04)
	int32 ConfiguredInternetSpeed; // 0x44(0x04)
	int32 ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.NetConnection
// Size: 0x65850 (Inherited: 0x50)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UClass* *7cc253e76a; // 0x68(0x08)
	struct UPackageMap* PackageMap; // 0x70(0x08)
	struct TArray<struct UChannel*> *e44c91181f; // 0x78(0x10)
	struct TArray<struct AActor*> *274863db2e; // 0x88(0x10)
	struct AActor* ViewTarget; // 0x98(0x08)
	struct AActor* *5e3a3b3f66; // 0xa0(0x08)
	int32 *260ba92558; // 0xa8(0x04)
	char *f5fadd2d69 : 1; // 0xac(0x01)
	char pad_AC_1 : 1; // 0xac(0x01)
	char *1194f7a57c : 1; // 0xac(0x01)
	char pad_AC_3 : 5; // 0xac(0x01)
	char pad_AD[0x8b]; // 0xad(0x8b)
	struct TArray<struct UChannel*> *8a96153c21; // 0x138(0x10)
	char pad_148[0x28]; // 0x148(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x170(0x18)
	char pad_188[0x68]; // 0x188(0x68)
	double *a564cf33c7; // 0x1f0(0x08)
	char pad_1F8[0x65538]; // 0x1f8(0x65538)
	struct TArray<struct UChannel*> *c638db3738; // 0x65730(0x10)
	char pad_65740[0x110]; // 0x65740(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x48 (Inherited: 0x30)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*ef998f31f9> ChannelDetails; // 0x30(0x10)
	float Duration; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.GameSession
// Size: 0x400 (Inherited: 0x3e8)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x3e8(0x04)
	int32 MaxPlayers; // 0x3ec(0x04)
	int32 *b4f47afb15; // 0x3f0(0x04)
	bool MaxSplitscreensPerConnection; // 0x3f4(0x01)
	bool bRequiresPushToTalk; // 0x3f5(0x01)
	char pad_3F6[0x2]; // 0x3f6(0x02)
	struct FName SessionName; // 0x3f8(0x08)
};

// Class Engine.*6915f10115
// Size: 0xd60 (Inherited: 0xd60)
struct U*6915f10115 : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xd58(0x04)
};

// Class Engine.NavLinkProxy
// Size: 0x438 (Inherited: 0x3e8)
struct ANavLinkProxy : AActor {
	char pad_3E8[0x10]; // 0x3e8(0x10)
	struct TArray<struct FNavigationLink> PointLinks; // 0x3f8(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks; // 0x408(0x10)
	struct UNavLinkCustomComponent* SmartLinkComp; // 0x418(0x08)
	bool *4a699c1124; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct FMulticastDelegate OnSmartLinkReached; // 0x428(0x10)

	void ReceiveSmartLinkReached(); // Function Engine.NavLinkProxy.ReceiveSmartLinkReached // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x3b43ac
	void *8e0ffa0cec(); // Function Engine.NavLinkProxy.*8e0ffa0cec // Final|Native|Public|BlueprintCallable // @ game+0x6bd07d0
	void *65cee31bae(); // Function Engine.NavLinkProxy.*65cee31bae // Final|Native|Public|BlueprintCallable // @ game+0x6bc8050
	void *d4d460f675(); // Function Engine.NavLinkProxy.*d4d460f675 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bc07d0
	void *8a49c9c7d5(); // Function Engine.NavLinkProxy.*8a49c9c7d5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf854
	void *213ddab35f(); // Function Engine.NavLinkProxy.*213ddab35f // Final|Native|Public // @ game+0xd5ebb0
};

// Class Engine.LocalPlayer
// Size: 0x290 (Inherited: 0x50)
struct ULocalPlayer : UPlayer {
	char pad_50[0x8]; // 0x50(0x08)
	struct UClass* *cf7a7c7fa4; // 0x58(0x08)
	char pad_60[0x14]; // 0x60(0x14)
	char *4f02c33d6e : 1; // 0x74(0x01)
	char pad_74_1 : 7; // 0x74(0x01)
	char pad_75[0x21b]; // 0x75(0x21b)
};

// Class Engine.NavModifierVolume
// Size: 0x430 (Inherited: 0x420)
struct ANavModifierVolume : AVolume {
	char pad_420[0x8]; // 0x420(0x08)
	struct UClass* AreaClass; // 0x428(0x08)

	void *b0af645c38(); // Function Engine.NavModifierVolume.*b0af645c38 // Final|Native|Public|BlueprintCallable // @ game+0x6bcb6d8
};

// Class Engine.*995c5bd3c5
// Size: 0x30 (Inherited: 0x30)
struct U*995c5bd3c5 : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1cb0 (Inherited: 0x3e8)
struct APlayerCameraManager : AActor {
	struct APlayerController* *cbb1abb503; // 0x3e8(0x08)
	struct USceneComponent* TransformComponent; // 0x3f0(0x08)
	float DefaultAspectRatio; // 0x3f8(0x04)
	char pad_3FC[0xc]; // 0x3fc(0x0c)
	struct TArray<struct UClass*> DefaultModifiers; // 0x408(0x10)
	char pad_418[0x4]; // 0x418(0x04)
	float DefaultOrthoWidth; // 0x41c(0x04)
	char pad_420[0x4]; // 0x420(0x04)
	float DefaultFOV; // 0x424(0x04)
	struct FVector FreeCamOffset; // 0x428(0x0c)
	char pad_434[0x2c]; // 0x434(0x2c)
	float FreeCamDistance; // 0x460(0x04)
	char pad_464[0x1c]; // 0x464(0x1c)
	struct F*67dd5045be *973c315985; // 0x480(0x5d0)
	struct F*67dd5045be ViewTarget; // 0xa50(0x5d0)
	char pad_1020[0x8]; // 0x1020(0x08)
	struct TArray<struct U*5ff6efacd0*> *61fd6ce2ce; // 0x1028(0x10)
	float ViewPitchMin; // 0x1038(0x04)
	float ViewRollMax; // 0x103c(0x04)
	float ViewYawMax; // 0x1040(0x04)
	char pad_1044[0xc]; // 0x1044(0x0c)
	struct F*506119bf4d *afbcd45916; // 0x1050(0x5c0)
	struct FVector ViewTargetOffset; // 0x1610(0x0c)
	float ViewPitchMax; // 0x161c(0x04)
	char pad_1620[0x8]; // 0x1620(0x08)
	struct TArray<struct AEmitterCameraLensEffectBase*> *400b25e039; // 0x1628(0x10)
	struct U*f2efdc3e42* *cd0bb6c040; // 0x1638(0x08)
	struct U*d3f66f5eff* *366f414e61[0x08]; // 0x1640(0x40)
	struct TArray<struct FPostProcessSettings> *5ecc4759ed; // 0x1680(0x10)
	char pad_1690[0x10]; // 0x1690(0x10)
	struct TArray<struct U*d3f66f5eff*> *550f662a17; // 0x16a0(0x10)
	struct TArray<struct U*d3f66f5eff*> *2bbafcfe72; // 0x16b0(0x10)
	struct ACameraActor* *7a77fb1011; // 0x16c0(0x08)
	char bIsOrthographic : 1; // 0x16c8(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x16c8(0x01)
	char pad_16C8_2 : 5; // 0x16c8(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x16c8(0x01)
	char pad_16C9[0x7]; // 0x16c9(0x07)
	struct F*506119bf4d *086e7720b6; // 0x16d0(0x5c0)
	float ViewYawMin; // 0x1c90(0x04)
	float ViewRollMin; // 0x1c94(0x04)
	char pad_1C98[0x18]; // 0x1c98(0x18)

	void *d72ed20b0c(); // Function Engine.PlayerCameraManager.*d72ed20b0c // Native|Public|HasDefaults|BlueprintCallable // @ game+0xe07604
	void *d36a44000d(); // Function Engine.PlayerCameraManager.*d36a44000d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba52c
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5daf644
	void *78e591ace3(); // Function Engine.PlayerCameraManager.*78e591ace3 // Native|Public|BlueprintCallable // @ game+0x6bd21c4
	void *2a26303c57(); // Function Engine.PlayerCameraManager.*2a26303c57 // Native|Public|BlueprintCallable // @ game+0x6bb8928
	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5e81ba4
	void *b292c5da71(); // Function Engine.PlayerCameraManager.*b292c5da71 // Native|Public|BlueprintCallable // @ game+0x6bd264c
	void *69965e09a8(); // Function Engine.PlayerCameraManager.*69965e09a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcefbc
	void *2988a7cb08(); // Function Engine.PlayerCameraManager.*2988a7cb08 // Native|Public|BlueprintCallable // @ game+0x6bc78d8
	void *665cee3c9b(); // Function Engine.PlayerCameraManager.*665cee3c9b // Native|Public|BlueprintCallable // @ game+0x6bb0988
	void PhotographyCameraModify(); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x6bc6970
	void *8c09008e7d(); // Function Engine.PlayerCameraManager.*8c09008e7d // Native|Public|BlueprintCallable // @ game+0x6bb1da4
	void *bb6cf3b047(); // Function Engine.PlayerCameraManager.*bb6cf3b047 // Native|Public|BlueprintCallable // @ game+0x6bd2550
	void *f2772d70c2(); // Function Engine.PlayerCameraManager.*f2772d70c2 // Native|Public|BlueprintCallable // @ game+0x6bd22f4
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5e81b8c
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5e4766c
	void *8b2eaca224(); // Function Engine.PlayerCameraManager.*8b2eaca224 // Native|Public|BlueprintCallable // @ game+0x6bd225c
	void *7fd72b3b48(); // Function Engine.PlayerCameraManager.*7fd72b3b48 // Native|Public|BlueprintCallable // @ game+0x6bd23d8
	void *a2a77b6a01(); // Function Engine.PlayerCameraManager.*a2a77b6a01 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd1ec0
	void *2fbc2ae8e6(); // Function Engine.PlayerCameraManager.*2fbc2ae8e6 // Native|Public|BlueprintCallable // @ game+0x6bc7844
	void *71d0b4dd39(); // Function Engine.PlayerCameraManager.*71d0b4dd39 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bc6d04
	void *9335482b6a(); // Function Engine.PlayerCameraManager.*9335482b6a // Native|Public|BlueprintCallable // @ game+0x6bb3470
	void *f76c6f11ba(); // Function Engine.PlayerCameraManager.*f76c6f11ba // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5e44708
	void *d3c1b5233d(); // Function Engine.PlayerCameraManager.*d3c1b5233d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xbdbdc0
	void *cf60453f72(); // Function Engine.PlayerCameraManager.*cf60453f72 // Native|Public|BlueprintCallable // @ game+0x6bd2634
	void *5ca65a21f0(); // Function Engine.PlayerCameraManager.*5ca65a21f0 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb528
	void BlueprintUpdateCamera(); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x3b43ac
};

// Class Engine.PlayerInput
// Size: 0x490 (Inherited: 0x30)
struct UPlayerInput : UObject {
	char pad_30[0xf8]; // 0x30(0xf8)
	struct TArray<struct F*bddce5acd0> DebugExecBindings; // 0x128(0x10)
	char pad_138[0x30]; // 0x138(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x168(0x10)
	char pad_178[0x318]; // 0x178(0x318)

	void InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x6bbfa40
	void SetBind(); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x6bcc704
	void SetGamePadSensitivity(); // Function Engine.PlayerInput.SetGamePadSensitivity // Final|Exec|Native|Public // @ game+0x6bcdfbc
	void SetGamePadSensitivityOf(); // Function Engine.PlayerInput.SetGamePadSensitivityOf // Final|Exec|Native|Public // @ game+0x6bce054
	void InvertAxisKey(); // Function Engine.PlayerInput.InvertAxisKey // Final|Exec|Native|Public // @ game+0x6bbfad0
	void SetMouseSensitivity(); // Function Engine.PlayerInput.SetMouseSensitivity // Final|Exec|Native|Public // @ game+0x6bcf690
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // Final|Exec|Native|Public // @ game+0x6bb34c0
	void SetGamePadDeadZoneOf(); // Function Engine.PlayerInput.SetGamePadDeadZoneOf // Final|Exec|Native|Public // @ game+0x6bcde80
	void SetGamePadDeadZone(); // Function Engine.PlayerInput.SetGamePadDeadZone // Final|Exec|Native|Public // @ game+0x6bcdde8
};

// Class Engine.NavigationData
// Size: 0x590 (Inherited: 0x3e8)
struct ANavigationData : AActor {
	struct UPrimitiveComponent* RenderingComp; // 0x3e8(0x08)
	struct F*b03cbfc63f *b03cbfc63f; // 0x3f0(0x50)
	char *21cfea8d56 : 1; // 0x440(0x01)
	char bForceRebuildOnLoad : 1; // 0x440(0x01)
	char bCanBeMainNavData : 1; // 0x440(0x01)
	char bCanSpawnOnRebuild : 1; // 0x440(0x01)
	char bRebuildAtRuntime : 1; // 0x440(0x01)
	char pad_440_5 : 3; // 0x440(0x01)
	char pad_441[0x3]; // 0x441(0x03)
	enum class ERuntimeGenerationType RuntimeGeneration; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float ObservedPathsTickInterval; // 0x448(0x04)
	char *43ae6d3f0e : 1; // 0x44c(0x01)
	char pad_44C_1 : 7; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	uint32 DataVersion; // 0x450(0x04)
	char pad_454[0xd4]; // 0x454(0xd4)
	struct TArray<struct F*75098b10ea> *2281fe7f4c; // 0x528(0x10)
	char pad_538[0x58]; // 0x538(0x58)
};

// Class Engine.RecastNavMesh
// Size: 0x6a0 (Inherited: 0x590)
struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x590(0x01)
	char bDrawPolyEdges : 1; // 0x590(0x01)
	char bDrawFilledPolys : 1; // 0x590(0x01)
	char bDrawNavMeshEdges : 1; // 0x590(0x01)
	char *708a7537c9 : 1; // 0x590(0x01)
	char *50d90c672d : 1; // 0x590(0x01)
	char *6d5769461c : 1; // 0x590(0x01)
	char *c8a29ed159 : 1; // 0x590(0x01)
	char *9f8b9279b7 : 1; // 0x591(0x01)
	char *d3e52b9f11 : 1; // 0x591(0x01)
	char *0ff14a8c0d : 1; // 0x591(0x01)
	char *d2bbad073c : 1; // 0x591(0x01)
	char *47a88b9dae : 1; // 0x591(0x01)
	char *441f51f755 : 1; // 0x591(0x01)
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x591(0x01)
	char *70a3c0c34e : 1; // 0x591(0x01)
	char pad_592[0x2]; // 0x592(0x02)
	float DrawOffset; // 0x594(0x04)
	char bFixedTilePoolSize : 1; // 0x598(0x01)
	char pad_598_1 : 7; // 0x598(0x01)
	char pad_599[0x3]; // 0x599(0x03)
	int32 TilePoolSize; // 0x59c(0x04)
	float TileSizeUU; // 0x5a0(0x04)
	float CellSize; // 0x5a4(0x04)
	float CellHeight; // 0x5a8(0x04)
	float AgentRadius; // 0x5ac(0x04)
	float AgentHeight; // 0x5b0(0x04)
	float AgentMaxHeight; // 0x5b4(0x04)
	float AgentMaxSlope; // 0x5b8(0x04)
	float AgentMaxStepHeight; // 0x5bc(0x04)
	float MinRegionArea; // 0x5c0(0x04)
	float MergeRegionSize; // 0x5c4(0x04)
	float MaxSimplificationError; // 0x5c8(0x04)
	int32 MaxSimultaneousTileGenerationJobsCount; // 0x5cc(0x04)
	int32 TileNumberHardLimit; // 0x5d0(0x04)
	int32 *0c09f61618; // 0x5d4(0x04)
	int32 *28e081ec92; // 0x5d8(0x04)
	int32 *0f30d1176b; // 0x5dc(0x04)
	float DefaultDrawDistance; // 0x5e0(0x04)
	float DefaultMaxSearchNodes; // 0x5e4(0x04)
	float DefaultMaxHierarchicalSearchNodes; // 0x5e8(0x04)
	enum class ERecastPartitioning RegionPartitioning; // 0x5ec(0x01)
	enum class ERecastPartitioning LayerPartitioning; // 0x5ed(0x01)
	char pad_5EE[0x2]; // 0x5ee(0x02)
	int32 RegionChunkSplits; // 0x5f0(0x04)
	int32 LayerChunkSplits; // 0x5f4(0x04)
	char bSortNavigationAreasByCost : 1; // 0x5f8(0x01)
	char bPerformVoxelFiltering : 1; // 0x5f8(0x01)
	char bMarkLowHeightAreas : 1; // 0x5f8(0x01)
	char bDoFullyAsyncNavDataGathering : 1; // 0x5f8(0x01)
	char bUseBetterOffsetsFromCorners : 1; // 0x5f8(0x01)
	char bStoreEmptyTileLayers : 1; // 0x5f8(0x01)
	char bUseVirtualFilters : 1; // 0x5f8(0x01)
	char bAllowNavLinkAsPathEnd : 1; // 0x5f8(0x01)
	char pad_5F9[0x3]; // 0x5f9(0x03)
	bool bOnlySavedOnDS; // 0x5fc(0x01)
	char pad_5FD[0x3]; // 0x5fd(0x03)
	char bUseVoxelCache : 1; // 0x600(0x01)
	char pad_600_1 : 7; // 0x600(0x01)
	char pad_601[0x3]; // 0x601(0x03)
	float TileSetUpdateInterval; // 0x604(0x04)
	float HeuristicScale; // 0x608(0x04)
	float VerticalDeviationFromGroundCompensation; // 0x60c(0x04)
	char pad_610[0x90]; // 0x610(0x90)
};

// Class Engine.*d3391c2860
// Size: 0x40 (Inherited: 0x30)
struct U*d3391c2860 : UObject {
	struct TArray<struct F*f5f971c5f4> *d787c9ce41; // 0x30(0x10)
};

// Class Engine.SceneCaptureComponent
// Size: 0x4f0 (Inherited: 0x470)
struct USceneCaptureComponent : USceneComponent {
	struct TArray<struct UPrimitiveComponent*> *a55671e4ad; // 0x468(0x10)
	struct TArray<struct AActor*> HiddenActors; // 0x478(0x10)
	struct TArray<struct UPrimitiveComponent*> *5e2f7446e7; // 0x488(0x10)
	struct TArray<struct AActor*> ShowOnlyActors; // 0x498(0x10)
	bool bIsLobbyCapture; // 0x4a8(0x01)
	bool bCaptureEveryFrame; // 0x4a9(0x01)
	bool bCaptureOnMovement; // 0x4aa(0x01)
	float LODDistanceFactor; // 0x4ac(0x04)
	float MaxViewDistanceOverride; // 0x4b0(0x04)
	int32 CaptureSortPriority; // 0x4b4(0x04)
	struct TArray<struct F*bf651cc96c> ShowFlagSettings; // 0x4b8(0x10)
	char pad_4CF[0x21]; // 0x4cf(0x21)

	void *686a777b09(); // Function Engine.SceneCaptureComponent.*686a777b09 // Final|Native|Public|BlueprintCallable // @ game+0x6c24dc0
	void *cacba93904(); // Function Engine.SceneCaptureComponent.*cacba93904 // Final|Native|Public|BlueprintCallable // @ game+0x6bfd4a0
	void *f2b9b733b4(); // Function Engine.SceneCaptureComponent.*f2b9b733b4 // Final|Native|Public|BlueprintCallable // @ game+0x6bfd300
	void *285c968333(); // Function Engine.SceneCaptureComponent.*285c968333 // Final|Native|Public|BlueprintCallable // @ game+0x6c24e50
	void *39c0448a3e(); // Function Engine.SceneCaptureComponent.*39c0448a3e // Final|Native|Public|BlueprintCallable // @ game+0x6c11a44
	void *2855d80aae(); // Function Engine.SceneCaptureComponent.*2855d80aae // Final|Native|Public|BlueprintCallable // @ game+0x6be48dc
	void *ae55650540(); // Function Engine.SceneCaptureComponent.*ae55650540 // Final|Native|Public|BlueprintCallable // @ game+0x6c16a44
	void *d5048fe3b3(); // Function Engine.SceneCaptureComponent.*d5048fe3b3 // Final|Native|Public|BlueprintCallable // @ game+0x6c11ad4
};

// Class Engine.SceneCaptureComponent2D
// Size: 0xb20 (Inherited: 0x4f0)
struct USceneCaptureComponent2D : USceneCaptureComponent {
	enum class ECameraProjectionMode ProjectionType; // 0x4e8(0x01)
	float FOVAngle; // 0x4ec(0x04)
	bool *782eac5acb; // 0x4f0(0x01)
	float *6ebb74f736; // 0x4f4(0x04)
	float OrthoWidth; // 0x4f8(0x04)
	char pad_4FE[0x2]; // 0x4fe(0x02)
	struct UTextureRenderTarget2D* TextureTarget; // 0x500(0x08)
	enum class *e151b8259b CaptureSource; // 0x508(0x01)
	enum class *307db859c9 CompositeMode; // 0x509(0x01)
	char pad_50A[0x2]; // 0x50a(0x02)
	struct FLinearColor LightingOnlyBrightness; // 0x50c(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x51c(0x10)
	struct FLinearColor LightingOnlyCustomData; // 0x52c(0x10)
	float LightingOnlyCustomDataAlpha; // 0x53c(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x540(0x570)
	float PostProcessBlendWeight; // 0xab0(0x04)
	bool bUseCustomProjectionMatrix; // 0xab4(0x01)
	char pad_AB5[0xb]; // 0xab5(0x0b)
	struct FMatrix CustomProjectionMatrix; // 0xac0(0x40)
	char *b0939a7f5b : 1; // 0xb00(0x01)
	char pad_B00_1 : 7; // 0xb00(0x01)
	char pad_B01[0x3]; // 0xb01(0x03)
	bool bEnableClipPlane; // 0xb04(0x01)
	char pad_B05[0x3]; // 0xb05(0x03)
	struct FVector ClipPlaneBase; // 0xb08(0x0c)
	struct FVector ClipPlaneNormal; // 0xb14(0x0c)

	void CaptureScene(); // Function Engine.SceneCaptureComponent2D.CaptureScene // Final|Native|Public|BlueprintCallable // @ game+0x6be41e0
	void *fa132a0246(); // Function Engine.SceneCaptureComponent2D.*fa132a0246 // Final|Native|Public|BlueprintCallable // @ game+0x6bd8518
};

// Class Engine.ArrowComponent
// Size: 0x9c0 (Inherited: 0x9b0)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor; // 0x9a8(0x04)
	float ArrowSize; // 0x9ac(0x04)
	bool bIsScreenSizeScaled; // 0x9b0(0x01)
	float ScreenSize; // 0x9b4(0x04)
	char bTreatAsASprite : 1; // 0x9b8(0x01)
	char pad_9BD_1 : 7; // 0x9bd(0x01)
	char pad_9BE[0x2]; // 0x9be(0x02)

	void SetArrowColor(); // Function Engine.ArrowComponent.SetArrowColor // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6c14e10
};

// Class Engine.ParticleSystemComponent
// Size: 0xc10 (Inherited: 0x9b0)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template; // 0x9a8(0x08)
	struct TArray<struct UMaterialInterface*> *4f88ae3996; // 0x9b0(0x10)
	struct TArray<struct USkeletalMeshComponent*> *22954ea390; // 0x9c0(0x10)
	char pad_9D8_0 : 7; // 0x9d8(0x01)
	char bResetOnDetach : 1; // 0x9d0(0x01)
	char *112625e667 : 1; // 0x9d1(0x01)
	char bAllowRecycling : 1; // 0x9d1(0x01)
	char bAutoManageAttachment : 1; // 0x9d1(0x01)
	char *461c11236d : 1; // 0x9d1(0x01)
	char bOverrideLODMethod : 1; // 0x9d2(0x01)
	char *0a78c3b57e : 1; // 0x9d2(0x01)
	char *8677cee406 : 1; // 0x9d2(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0x9d8(0x10)
	struct FMulticastDelegate OnParticleSpawn; // 0x9e8(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x9f8(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0xa08(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0xa18(0x10)
	struct FVector *7a6bef834a; // 0xa28(0x0c)
	struct FVector *a7f8a33a6f; // 0xa34(0x0c)
	float WarmupTime; // 0xa40(0x04)
	float *73dfda32c6; // 0xa44(0x04)
	char pad_A49[0x3]; // 0xa49(0x03)
	float SecondsBeforeInactive; // 0xa4c(0x04)
	char pad_A50[0x4]; // 0xa50(0x04)
	float *5e0dc69810; // 0xa54(0x04)
	char pad_A58[0x8]; // 0xa58(0x08)
	enum class *f6a419821d LODMethod; // 0xa60(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0xa61(0x01)
	char pad_A62[0x16]; // 0xa62(0x16)
	struct TArray<struct U*9051dbf3fc*> *3c1efb0fc5; // 0xa78(0x10)
	char pad_A88[0x60]; // 0xa88(0x60)
	float CustomTimeDilation; // 0xae8(0x04)
	char pad_AEC[0x4]; // 0xaec(0x04)
	struct FMulticastDelegate OnSystemFinished; // 0xaf0(0x10)
	struct USceneComponent* AutoAttachParent; // 0xb00(0x08)
	struct FName AutoAttachSocketName; // 0xb08(0x08)
	enum class EAttachLocation AutoAttachLocationType; // 0xb10(0x01)
	enum class EAttachmentRule AutoAttachLocationRule; // 0xb11(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0xb12(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0xb13(0x01)
	char pad_B14[0xfc]; // 0xb14(0xfc)

	void *67c3e5d699(); // Function Engine.ParticleSystemComponent.*67c3e5d699 // Native|Public|BlueprintCallable // @ game+0x6bcda1c
	void *69906718ab(); // Function Engine.ParticleSystemComponent.*69906718ab // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcc5c8
	void *863f6b2e73(); // Function Engine.ParticleSystemComponent.*863f6b2e73 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9c30
	void *17005cd81d(); // Function Engine.ParticleSystemComponent.*17005cd81d // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba27c
	void *d1dcac6896(); // Function Engine.ParticleSystemComponent.*d1dcac6896 // Final|Native|Public|BlueprintCallable // @ game+0x6bb2954
	void *50fe310c8a(); // Function Engine.ParticleSystemComponent.*50fe310c8a // Native|Public|BlueprintCallable // @ game+0x6bcc100
	void *0c18dcbb66(); // Function Engine.ParticleSystemComponent.*0c18dcbb66 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcd374
	void *7b9f2ccae9(); // Function Engine.ParticleSystemComponent.*7b9f2ccae9 // Native|Public|BlueprintCallable // @ game+0x6bb639c
	void *1ce0c10461(); // Function Engine.ParticleSystemComponent.*1ce0c10461 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd1440
	void *8700c3e848(); // Function Engine.ParticleSystemComponent.*8700c3e848 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9b38
	void *bb3edb14e0(); // Function Engine.ParticleSystemComponent.*bb3edb14e0 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9ff8
	void *24f8677596(); // Function Engine.ParticleSystemComponent.*24f8677596 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcc364
	void *9cf76baf38(); // Function Engine.ParticleSystemComponent.*9cf76baf38 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcbec8
	void *8816fb0374(); // Function Engine.ParticleSystemComponent.*8816fb0374 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9eb4
	void *abec3701c0(); // Function Engine.ParticleSystemComponent.*abec3701c0 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbd82c
	void *1a1fdc7786(); // Function Engine.ParticleSystemComponent.*1a1fdc7786 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcbfc4
	void SetFloatParameter(); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0xe54424
	void *e30b532a71(); // Function Engine.ParticleSystemComponent.*e30b532a71 // Final|Native|Public|BlueprintCallable // @ game+0x6bd0d94
	void *033547d67c(); // Function Engine.ParticleSystemComponent.*033547d67c // Final|Native|Public|BlueprintCallable // @ game+0x6bd0abc
	void *3a45f42ea4(); // Function Engine.ParticleSystemComponent.*3a45f42ea4 // Final|Native|Public|BlueprintCallable // @ game+0x6bcafcc
	void *9a31e112a2(); // Function Engine.ParticleSystemComponent.*9a31e112a2 // Final|Native|Public|BlueprintCallable // @ game+0x6bcba90
	void *16d053f3c6(); // Function Engine.ParticleSystemComponent.*16d053f3c6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbda74
	void *d8490665a4(); // Function Engine.ParticleSystemComponent.*d8490665a4 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9d74
	void *9b43a7d6ec(); // Function Engine.ParticleSystemComponent.*9b43a7d6ec // Final|Native|Public|BlueprintCallable // @ game+0x6bb8684
	void *068b48e0cf(); // Function Engine.ParticleSystemComponent.*068b48e0cf // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bb8b8c
	void *64f27bdd51(); // Function Engine.ParticleSystemComponent.*64f27bdd51 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba13c
	void *c5ffab40d8(); // Function Engine.ParticleSystemComponent.*c5ffab40d8 // Native|Public|BlueprintCallable // @ game+0x6bcc4a0
	void *72f8053368(); // Function Engine.ParticleSystemComponent.*72f8053368 // Final|Native|Public|BlueprintCallable // @ game+0x6bcf4dc
	void *1fa968ce8d(); // Function Engine.ParticleSystemComponent.*1fa968ce8d // Final|Native|Public|BlueprintCallable // @ game+0x6bcb948
	void *0fc943db31(); // Function Engine.ParticleSystemComponent.*0fc943db31 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcc228
};

// Class Engine.DefaultPawn
// Size: 0x470 (Inherited: 0x448)
struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x448(0x04)
	float BaseLookUpRate; // 0x44c(0x04)
	struct UPawnMovementComponent* MovementComponent; // 0x450(0x08)
	struct USphereComponent* CollisionComponent; // 0x458(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x460(0x08)
	char bAddDefaultMovementBindings : 1; // 0x468(0x01)
	char pad_468_1 : 7; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)

	void MoveForward(); // Function Engine.DefaultPawn.MoveForward // Native|Public|BlueprintCallable // @ game+0x6bc6214
	void *00acc3c2ee(); // Function Engine.DefaultPawn.*00acc3c2ee // Final|Native|Public|BlueprintCallable // @ game+0x6bc5f20
	void MoveRight(); // Function Engine.DefaultPawn.MoveRight // Native|Public|BlueprintCallable // @ game+0x6bc62b0
	void *d161ce5221(); // Function Engine.DefaultPawn.*d161ce5221 // Native|Public|BlueprintCallable // @ game+0x6bc634c
	void *6a5455acb9(); // Function Engine.DefaultPawn.*6a5455acb9 // Final|Native|Public|BlueprintCallable // @ game+0x6bd2bd4
};

// Class Engine.SpectatorPawn
// Size: 0x470 (Inherited: 0x470)
struct ASpectatorPawn : ADefaultPawn {
};

// Class Engine.FloatingPawnMovement
// Size: 0x2a0 (Inherited: 0x290)
struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x288(0x04)
	float Acceleration; // 0x28c(0x04)
	float Deceleration; // 0x290(0x04)
	float TurningBoost; // 0x294(0x04)
	char *a1107499df : 1; // 0x298(0x01)
};

// Class Engine.SpectatorPawnMovement
// Size: 0x2b0 (Inherited: 0x2a0)
struct USpectatorPawnMovement : UFloatingPawnMovement {
	char *07c46bc655 : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0xf]; // 0x2a1(0x0f)
};

// Class Engine.SplineComponent
// Size: 0xaa0 (Inherited: 0x9b0)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves *af20761ba1; // 0x9a8(0x60)
	struct FInterpCurveVector SplineInfo; // 0xa08(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0xa20(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0xa38(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0xa50(0x18)
	bool bAllowSplineEditingPerInstance; // 0xa68(0x01)
	int32 *c94fdb6f50; // 0xa6c(0x04)
	bool *74a06f3a21; // 0xa70(0x01)
	bool *2ae54133a6; // 0xa71(0x01)
	float *de8108c325; // 0xa74(0x04)
	float Duration; // 0xa78(0x04)
	bool bStationaryEndpoints; // 0xa7c(0x01)
	bool *ed5304d631; // 0xa7d(0x01)
	bool *892474e663; // 0xa7e(0x01)
	bool bInputSplinePointsToConstructionScript; // 0xa7f(0x01)
	bool bDrawDebug; // 0xa80(0x01)
	bool *62034b8d2c; // 0xa81(0x01)
	bool bLoopPositionOverride; // 0xa82(0x01)
	float *2dff64e046; // 0xa84(0x04)
	struct FVector DefaultUpVector; // 0xa88(0x0c)
	char pad_A96[0xa]; // 0xa96(0x0a)

	void *cf680803a3(); // Function Engine.SplineComponent.*cf680803a3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf2b24
	void *a3e04ebb78(); // Function Engine.SplineComponent.*a3e04ebb78 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee45c
	void *f915afe236(); // Function Engine.SplineComponent.*f915afe236 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bcd62c
	void *52e254e8f9(); // Function Engine.SplineComponent.*52e254e8f9 // Final|Native|Public|BlueprintCallable // @ game+0x6be4c40
	void *134a78950f(); // Function Engine.SplineComponent.*134a78950f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf7f9c
	void *92f2f40b5b(); // Function Engine.SplineComponent.*92f2f40b5b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd8a60
	void *aabffd98cf(); // Function Engine.SplineComponent.*aabffd98cf // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf80d4
	void *f3814e00f1(); // Function Engine.SplineComponent.*f3814e00f1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee58c
	void *ea5851529e(); // Function Engine.SplineComponent.*ea5851529e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee654
	void GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5df1360
	void *ad1164c994(); // Function Engine.SplineComponent.*ad1164c994 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf5204
	void *1b9bf47c06(); // Function Engine.SplineComponent.*1b9bf47c06 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf7eb0
	void SetSplinePointType(); // Function Engine.SplineComponent.SetSplinePointType // Final|Native|Public|BlueprintCallable // @ game+0x6c1ff00
	void *ac013a29ee(); // Function Engine.SplineComponent.*ac013a29ee // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf26ec
	void *fb34d6ec15(); // Function Engine.SplineComponent.*fb34d6ec15 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee900
	void *79c62cca3e(); // Function Engine.SplineComponent.*79c62cca3e // Final|Native|Public|BlueprintCallable // @ game+0x6c18b90
	void *153ec0a3ad(); // Function Engine.SplineComponent.*153ec0a3ad // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf85f0
	void *c39fb27d0a(); // Function Engine.SplineComponent.*c39fb27d0a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bedcb4
	void *4e0299c96f(); // Function Engine.SplineComponent.*4e0299c96f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfaf84
	void *c219d560c2(); // Function Engine.SplineComponent.*c219d560c2 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf97b0
	void *83706fa678(); // Function Engine.SplineComponent.*83706fa678 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfbe78
	void *a843ad36b5(); // Function Engine.SplineComponent.*a843ad36b5 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c22048
	void *826b637896(); // Function Engine.SplineComponent.*826b637896 // Final|Native|Public|BlueprintCallable // @ game+0x6c11b74
	void *04febd64a1(); // Function Engine.SplineComponent.*04febd64a1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfa8c4
	void *73fe9828cf(); // Function Engine.SplineComponent.*73fe9828cf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8db4
	void *4d7aca9cf9(); // Function Engine.SplineComponent.*4d7aca9cf9 // Final|Native|Public|BlueprintCallable // @ game+0x6c2c38c
	void *81f38254ef(); // Function Engine.SplineComponent.*81f38254ef // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfa5a4
	void *282f0d95b1(); // Function Engine.SplineComponent.*282f0d95b1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf54f4
	void *c90272e158(); // Function Engine.SplineComponent.*c90272e158 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c21300
	void *c06887c798(); // Function Engine.SplineComponent.*c06887c798 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf5204
	void *aab9f24cfc(); // Function Engine.SplineComponent.*aab9f24cfc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c183c4
	void *97d19dcf2a(); // Function Engine.SplineComponent.*97d19dcf2a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf3460
	void *ef1c9a40e0(); // Function Engine.SplineComponent.*ef1c9a40e0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfb7b0
	void *e05ece5e57(); // Function Engine.SplineComponent.*e05ece5e57 // Final|Native|Public|BlueprintCallable // @ game+0x6c171a8
	void *6473859118(); // Function Engine.SplineComponent.*6473859118 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf7dbc
	void *85900ff67f(); // Function Engine.SplineComponent.*85900ff67f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfba40
	void *2322fbe20b(); // Function Engine.SplineComponent.*2322fbe20b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf25ec
	void *50ee2e4e25(); // Function Engine.SplineComponent.*50ee2e4e25 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd8bec
	void *a24bcc5994(); // Function Engine.SplineComponent.*a24bcc5994 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf57ec
	void *90b7823df0(); // Function Engine.SplineComponent.*90b7823df0 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee358
	void *e1a48fec25(); // Function Engine.SplineComponent.*e1a48fec25 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfb084
	void *6b6775bd9f(); // Function Engine.SplineComponent.*6b6775bd9f // Final|Native|Public|BlueprintCallable // @ game+0x6c170b0
	void *86e26430bb(); // Function Engine.SplineComponent.*86e26430bb // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c1ce54
	void *e08e3e9858(); // Function Engine.SplineComponent.*e08e3e9858 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfbd68
	void *4ccf21d8b5(); // Function Engine.SplineComponent.*4ccf21d8b5 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c21174
	void *045b3f530f(); // Function Engine.SplineComponent.*045b3f530f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf58ec
	void *2e3858f9b1(); // Function Engine.SplineComponent.*2e3858f9b1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf59e8
	void *2d313357bc(); // Function Engine.SplineComponent.*2d313357bc // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf82d0
	void *17025220de(); // Function Engine.SplineComponent.*17025220de // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf7a40
	void *c42fa2dbce(); // Function Engine.SplineComponent.*c42fa2dbce // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf7b40
	void *23206032f9(); // Function Engine.SplineComponent.*23206032f9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfb1b8
	void *d6f8495c97(); // Function Engine.SplineComponent.*d6f8495c97 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf96b0
	void *3502332269(); // Function Engine.SplineComponent.*3502332269 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8d8c
	void *91fae90d35(); // Function Engine.SplineComponent.*91fae90d35 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfb980
	void *cfba33f05d(); // Function Engine.SplineComponent.*cfba33f05d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf86c4
	void *8fa5d6c60f(); // Function Engine.SplineComponent.*8fa5d6c60f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf8538
	void *7f66e1fbac(); // Function Engine.SplineComponent.*7f66e1fbac // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfbca8
	void *e8e6a3b352(); // Function Engine.SplineComponent.*e8e6a3b352 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf27e8
	void *54fd7af9bc(); // Function Engine.SplineComponent.*54fd7af9bc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bedb90
	void *9117ec8f3d(); // Function Engine.SplineComponent.*9117ec8f3d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfb870
	void AddSplinePoint(); // Function Engine.SplineComponent.AddSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd8918
	void *a90398e5f8(); // Function Engine.SplineComponent.*a90398e5f8 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf564c
	void *ef63e4ad53(); // Function Engine.SplineComponent.*ef63e4ad53 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c20298
	void *c7e0ec4ec0(); // Function Engine.SplineComponent.*c7e0ec4ec0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf5328
	void *d542bd1ed8(); // Function Engine.SplineComponent.*d542bd1ed8 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6c23248
	void *4d353239e7(); // Function Engine.SplineComponent.*4d353239e7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bd8878
	void *167f699d6d(); // Function Engine.SplineComponent.*167f699d6d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf0088
	void *c7ff5ca2be(); // Function Engine.SplineComponent.*c7ff5ca2be // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf23b0
	void *197e8ca22e(); // Function Engine.SplineComponent.*197e8ca22e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bedd60
	void *1cb7eba1c5(); // Function Engine.SplineComponent.*1cb7eba1c5 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bd862c
	void *32f0fbfd82(); // Function Engine.SplineComponent.*32f0fbfd82 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c1fe34
	void *a2c24d66e7(); // Function Engine.SplineComponent.*a2c24d66e7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6bcd62c
	void *7ee73e99c7(); // Function Engine.SplineComponent.*7ee73e99c7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfeb1c
	void *eabc4a062e(); // Function Engine.SplineComponent.*eabc4a062e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee778
	void *cf31a1909e(); // Function Engine.SplineComponent.*cf31a1909e // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6c20030
	void *914680d4fd(); // Function Engine.SplineComponent.*914680d4fd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfbaf8
	void *c8b1123aa1(); // Function Engine.SplineComponent.*c8b1123aa1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bee234
	void *44a8c2bd34(); // Function Engine.SplineComponent.*44a8c2bd34 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bfa718
	void *15c36c3b51(); // Function Engine.SplineComponent.*15c36c3b51 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf7c74
	void *33d4210dce(); // Function Engine.SplineComponent.*33d4210dce // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bf81d4
	void *3ca671b930(); // Function Engine.SplineComponent.*3ca671b930 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bd8748
};

// Class Engine.MaterialInterface
// Size: 0x78 (Inherited: 0x30)
struct UMaterialInterface : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x38(0x08)
	char pad_40[0x8]; // 0x40(0x08)
	struct F*ed15892812 LightmassSettings; // 0x48(0x14)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct TArray<struct F*4843f69936> *8d79f2f236; // 0x60(0x10)
	char pad_70[0x8]; // 0x70(0x08)

	void *e8253b8049(); // Function Engine.MaterialInterface.*e8253b8049 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbe554
	void *aed3837a4f(); // Function Engine.MaterialInterface.*aed3837a4f // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x6bb9aa0
};

// Class Engine.MaterialInstance
// Size: 0x1e8 (Inherited: 0x78)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0x78(0x08)
	struct UMaterialInterface* Parent; // 0x80(0x08)
	char *8faff03b22 : 1; // 0x88(0x01)
	char *9f50880679 : 1; // 0x88(0x01)
	char pad_88_2 : 1; // 0x88(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x88(0x01)
	char pad_88_4 : 4; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct TArray<struct F*1938f889f6> FontParameterValues; // 0x90(0x10)
	struct TArray<struct F*ecd50ea1e1> ScalarParameterValues; // 0xa0(0x10)
	struct TArray<struct F*c8ae2e9849> TextureParameterValues; // 0xb0(0x10)
	struct TArray<struct F*afa0cd1358> VectorParameterValues; // 0xc0(0x10)
	bool bOverrideBaseProperties; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xd4(0x24)
	char pad_F8[0xf0]; // 0xf8(0xf0)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x1e8 (Inherited: 0x1e8)
struct UMaterialInstanceConstant : UMaterialInstance {
};

// Class Engine.MaterialExpression
// Size: 0x68 (Inherited: 0x30)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x30(0x08)
	struct UMaterialFunction* Function; // 0x38(0x08)
	struct FString Desc; // 0x40(0x10)
	struct FColor BorderColor; // 0x50(0x04)
	char *7d5c77230b : 1; // 0x54(0x01)
	char *24134249a8 : 1; // 0x54(0x01)
	char *5e6d423427 : 1; // 0x54(0x01)
	char *ceacf93e55 : 1; // 0x54(0x01)
	char *9d6fee04fb : 1; // 0x54(0x01)
	char *5a14ee6deb : 1; // 0x54(0x01)
	char *ea6a3fcde4 : 1; // 0x54(0x01)
	char *ea527af7c6 : 1; // 0x54(0x01)
	char *80b53506fe : 1; // 0x55(0x01)
	char *3c602b9576 : 1; // 0x55(0x01)
	char *7f3905b4ee : 1; // 0x55(0x01)
	char pad_55_3 : 5; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	struct TArray<struct FExpressionOutput> Outputs; // 0x58(0x10)
};

// Class Engine.*4eb614635f
// Size: 0x68 (Inherited: 0x68)
struct U*4eb614635f : UMaterialExpression {
};

// Class Engine.*20b0f316ee
// Size: 0x68 (Inherited: 0x68)
struct U*20b0f316ee : UMaterialExpression {
};

// Class Engine.*6bfc7814f8
// Size: 0x30 (Inherited: 0x30)
struct U*6bfc7814f8 : UObject {

	void Activate(); // Function Engine.*6bfc7814f8.Activate // Native|Public|BlueprintCallable // @ game+0x6bd70fc
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x3c8 (Inherited: 0x2c0)
struct UBlueprintGeneratedClass : UClass {
	int32 NumReplicatedProperties; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct TArray<struct U*bc74342338*> *1b6d938bf5; // 0x2c8(0x10)
	struct TArray<struct UActorComponent*> *94a4227fa2; // 0x2d8(0x10)
	struct TArray<struct U*21c8ecb21c*> *073464c770; // 0x2e8(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x2f8(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x300(0x08)
	struct UStructProperty* *2d7297fc0a; // 0x308(0x08)
	struct UFunction* *ffe461292a; // 0x310(0x08)
	struct TArray<struct F*2d43941071> FastCallPairs; // 0x318(0x10)
	bool *2d15b7f305; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct TMap<struct FName, struct F*f497c92dc8> *cc5b27c031; // 0x330(0x50)
	bool *ed8fc07e25; // 0x380(0x01)
	char pad_381[0x47]; // 0x381(0x47)
};

// Class Engine.CameraActor
// Size: 0x990 (Inherited: 0x3e8)
struct ACameraActor : AActor {
	enum class EAutoReceiveInput *210fe1ca45; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
	struct UCameraComponent* CameraComponent; // 0x3f0(0x08)
	struct USceneComponent* SceneComponent; // 0x3f8(0x08)
	char pad_400[0x8]; // 0x400(0x08)
	char bConstrainAspectRatio : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	float AspectRatio; // 0x40c(0x04)
	float FOVAngle; // 0x410(0x04)
	float PostProcessBlendWeight; // 0x414(0x04)
	char pad_418[0x8]; // 0x418(0x08)
	struct FPostProcessSettings PostProcessSettings; // 0x420(0x570)

	void *5c0d05bfc6(); // Function Engine.CameraActor.*5c0d05bfc6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bb9a48
};

// Class Engine.UserDefinedStruct
// Size: 0x108 (Inherited: 0xf8)
struct UUserDefinedStruct : UScriptStruct {
	struct FGuid Guid; // 0xf8(0x10)
};

// Class Engine.AISystemBase
// Size: 0x50 (Inherited: 0x30)
struct UAISystemBase : UObject {
	struct FStringClassReference AISystemClassName; // 0x30(0x10)
	struct FName AISystemModuleName; // 0x40(0x08)
	bool bInstantiateAISystemOnClient; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class Engine.*c2b50fe57b
// Size: 0x50 (Inherited: 0x30)
struct U*c2b50fe57b : UObject {
	struct TArray<struct F*67bc07c1f6> Areas; // 0x30(0x10)
	struct F*a0d435eae7 IncludeFlags; // 0x40(0x04)
	struct F*a0d435eae7 ExcludeFlags; // 0x44(0x04)
	char pad_48[0x8]; // 0x48(0x08)
};

// Class Engine.*76e94c1d7f
// Size: 0x40 (Inherited: 0x30)
struct U*76e94c1d7f : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.Model
// Size: 0x568 (Inherited: 0x30)
struct UModel : UObject {
	char pad_30[0x538]; // 0x30(0x538)
};

// Class Engine.*ce9d24fa0d
// Size: 0x30 (Inherited: 0x30)
struct U*ce9d24fa0d : UObject {
};

// Class Engine.*fd5572f7e4
// Size: 0x30 (Inherited: 0x30)
struct U*fd5572f7e4 : UObject {
};

// Class Engine.EdGraphNode
// Size: 0xa8 (Inherited: 0x30)
struct UEdGraphNode : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins; // 0x40(0x10)
	int32 *f0e623e576; // 0x50(0x04)
	int32 *f41b253a19; // 0x54(0x04)
	int32 *02c4679bb3; // 0x58(0x04)
	int32 *e4afe75f0a; // 0x5c(0x04)
	char *9610629f99 : 1; // 0x60(0x01)
	char pad_60_1 : 7; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct FString NodeComment; // 0x68(0x10)
	bool *46eed7e906; // 0x78(0x01)
	bool *ceacf93e55; // 0x79(0x01)
	bool *7bd0b4cf75; // 0x7a(0x01)
	char pad_7B[0x1]; // 0x7b(0x01)
	int32 *e3edaae0b7; // 0x7c(0x04)
	struct FString *ac5b0cf3a1; // 0x80(0x10)
	struct FGuid NodeGuid; // 0x90(0x10)
	enum class ENodeAdvancedPins *46567863b0; // 0xa0(0x01)
	enum class ENodeEnabledState *7262600590; // 0xa1(0x01)
	bool *23a77dda2a; // 0xa2(0x01)
	bool bIsNodeEnabled; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x148 (Inherited: 0x30)
struct UEdGraphPin_Deprecated : UObject {
	struct FString PinName; // 0x30(0x10)
	struct FString PinToolTip; // 0x40(0x10)
	enum class EEdGraphPinDirection Direction; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct F*7e1b7fab5a PinType; // 0x58(0x80)
	struct FString DefaultValue; // 0xd8(0x10)
	struct FString *dacd436657; // 0xe8(0x10)
	struct UObject* *2e7ac2654d; // 0xf8(0x08)
	struct FText *40179c9732; // 0x100(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> *97cdbb49a2; // 0x118(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> *1914cdc056; // 0x128(0x10)
	struct UEdGraphPin_Deprecated* *98fc6dcf40; // 0x138(0x08)
	struct UEdGraphPin_Deprecated* *62ddfe1f6e; // 0x140(0x08)
};

// Class Engine.*abb42ec669
// Size: 0x30 (Inherited: 0x30)
struct U*abb42ec669 : UInterface {
};

// Class Engine.Level
// Size: 0x340 (Inherited: 0x30)
struct ULevel : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct U*5150ba566f*> *55f7eb2a9d; // 0x38(0x10)
	struct TArray<struct FVector> *8ca3970608; // 0x48(0x10)
	char pad_58[0x18]; // 0x58(0x18)
	struct UWorld* *488bd82a5a; // 0x70(0x08)
	float *1d23bb7054; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct U*55017046d0* ActorCluster; // 0x80(0x08)
	struct UModel* Model; // 0x88(0x08)
	char pad_90[0x30]; // 0x90(0x30)
	struct TArray<struct FGuid> *f6f4fbc950; // 0xc0(0x10)
	char pad_D0[0xb0]; // 0xd0(0xb0)
	struct TArray<struct U*e07a4c78fc*> *6d0a3f7070; // 0x180(0x10)
	struct ANavigationObjectBase* *51cc2ee46b; // 0x190(0x08)
	char pad_198[0x8]; // 0x198(0x08)
	bool *544e79503d; // 0x1a0(0x01)
	char pad_1A1[0x3]; // 0x1a1(0x03)
	struct FIntVector *7974928f53; // 0x1a4(0x0c)
	struct ANavigationObjectBase* *64fbd02e07; // 0x1b0(0x08)
	char pad_1B8[0x10]; // 0x1b8(0x10)
	struct FGuid *43c6aace00; // 0x1c8(0x10)
	int32 *aac6fa92ed; // 0x1d8(0x04)
	char pad_1DC[0x4]; // 0x1dc(0x04)
	struct ALevelScriptActor* LevelScriptActor; // 0x1e0(0x08)
	struct UMapBuildDataRegistry* *0ec75154e6; // 0x1e8(0x08)
	char pad_1F0_0 : 2; // 0x1f0(0x01)
	char *bd92e97168 : 1; // 0x1f0(0x01)
	char bIsVisible : 1; // 0x1f0(0x01)
	char bLocked : 1; // 0x1f0(0x01)
	char *2a606ba41b : 1; // 0x1f0(0x01)
	char pad_1F0_6 : 2; // 0x1f0(0x01)
	char pad_1F1[0x1f]; // 0x1f1(0x1f)
	float *6d51322dab; // 0x210(0x04)
	char pad_214[0x7c]; // 0x214(0x7c)
	int32 *f106a369cf; // 0x290(0x04)
	char pad_294[0x7c]; // 0x294(0x7c)
	struct AWorldSettings* WorldSettings; // 0x310(0x08)
	char pad_318[0x8]; // 0x318(0x08)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x320(0x10)
	char pad_330[0x10]; // 0x330(0x10)
};

// Class Engine.*4f61bf9cab
// Size: 0x30 (Inherited: 0x30)
struct U*4f61bf9cab : UInterface {
};

// Class Engine.AmbientSound
// Size: 0x3f0 (Inherited: 0x3e8)
struct AAmbientSound : AActor {
	struct UAudioComponent* AudioComponent; // 0x3e8(0x08)

	void *2482587342(); // Function Engine.AmbientSound.*2482587342 // Final|Native|Public|BlueprintCallable // @ game+0x6bb8734
	void Stop(); // Function Engine.AmbientSound.Stop // Final|Native|Public|BlueprintCallable // @ game+0x6bd2180
	void FadeOut(); // Function Engine.AmbientSound.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0x6bb8824
	void AdjustVolume(); // Function Engine.AmbientSound.AdjustVolume // Final|Native|Public|BlueprintCallable // @ game+0x6bb2868
	void Play(); // Function Engine.AmbientSound.Play // Final|Native|Public|BlueprintCallable // @ game+0x6bc6b34
};

// Class Engine.AutoBenchSettings
// Size: 0x48 (Inherited: 0x30)
struct UAutoBenchSettings : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct F*27572cdce5> Settings; // 0x38(0x10)
};

// Class Engine.AutoBenchControlActor
// Size: 0x3e8 (Inherited: 0x3e8)
struct AAutoBenchControlActor : AActor {
};

// Class Engine.*0b64d43df2
// Size: 0x30 (Inherited: 0x30)
struct U*0b64d43df2 : UObject {
};

// Class Engine.*2a8749cb1e
// Size: 0x30 (Inherited: 0x30)
struct U*2a8749cb1e : UInterface {
};

// Class Engine.BillboardComponent
// Size: 0x9d0 (Inherited: 0x9b0)
struct UBillboardComponent : UPrimitiveComponent {
	struct UTexture2D* Sprite; // 0x9a8(0x08)
	char bIsScreenSizeScaled : 1; // 0x9b0(0x01)
	float ScreenSize; // 0x9b4(0x04)
	float U; // 0x9b8(0x04)
	float UL; // 0x9bc(0x04)
	float V; // 0x9c0(0x04)
	float VL; // 0x9c4(0x04)
	struct FColor Color; // 0x9c8(0x04)

	void *17e3c97dce(); // Function Engine.BillboardComponent.*17e3c97dce // Native|Public|BlueprintCallable // @ game+0x6bd08fc
	void SetColor(); // Function Engine.BillboardComponent.SetColor // Final|Native|Public|HasDefaults // @ game+0x6bcd19c
	void *576022c5f3(); // Function Engine.BillboardComponent.*576022c5f3 // Native|Public|BlueprintCallable // @ game+0x6bd0fbc
	void *863c1b7940(); // Function Engine.BillboardComponent.*863c1b7940 // Native|Public|BlueprintCallable // @ game+0x6bd0868
};

// Class Engine.*5e9cf974cd
// Size: 0x30 (Inherited: 0x30)
struct U*5e9cf974cd : UInterface {
};

// Class Engine.StaticMesh
// Size: 0x178 (Inherited: 0x30)
struct UStaticMesh : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	int32 MinLOD; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct UMaterialInterface*> Materials; // 0x50(0x10)
	struct TArray<struct F*b95e578402> StaticMaterials; // 0x60(0x10)
	float *e9fbfc159c; // 0x70(0x04)
	int32 LightMapResolution; // 0x74(0x04)
	int32 *e0a09bf5ad; // 0x78(0x04)
	float *ba2bfd22a9; // 0x7c(0x04)
	struct UBodySetup* BodySetup; // 0x80(0x08)
	int32 *6d7466c0fd; // 0x88(0x04)
	char *68b821af92 : 1; // 0x8c(0x01)
	char *d5d8714e97 : 1; // 0x8c(0x01)
	char bStripComplexCollisionForConsole : 1; // 0x8c(0x01)
	char *6963642026 : 1; // 0x8c(0x01)
	char bRequiresAreaWeightedSampling : 1; // 0x8c(0x01)
	char pad_8C_5 : 3; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	float LpvBiasMultiplier; // 0x90(0x04)
	bool *83bc9a1002; // 0x94(0x01)
	char pad_95[0x33]; // 0x95(0x33)
	struct TArray<struct U*42332609a2*> Sockets; // 0xc8(0x10)
	char pad_D8[0x10]; // 0xd8(0x10)
	struct FVector *de141d92fd; // 0xe8(0x0c)
	struct FVector *5d3f4952e6; // 0xf4(0x0c)
	struct FBoxSphereBounds *bdb025f306; // 0x100(0x1c)
	bool *724d2a4455; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
	int32 *141f243af3; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x128(0x10)
	struct UNavCollision* NavCollision; // 0x138(0x08)
	struct F*1565070a2a *c4842cbb73; // 0x140(0x28)
	struct TArray<struct UMaterialInstanceConstant*> *66f11a0382; // 0x168(0x10)

	void *bb75c221c9(); // Function Engine.StaticMesh.*bb75c221c9 // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba3c0
	void *2b50187029(); // Function Engine.StaticMesh.*2b50187029 // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdb68
	void *65dc3531ad(); // Function Engine.StaticMesh.*65dc3531ad // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bba4cc
	void *db671a7987(); // Function Engine.StaticMesh.*db671a7987 // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbdaf8
};

// Class Engine.*fd85e3fbd5
// Size: 0x580 (Inherited: 0x470)
struct U*fd85e3fbd5 : USceneComponent {
	struct FVector Extents; // 0x468(0x0c)
	struct FVector FadeExtents_Neg; // 0x474(0x0c)
	struct FVector FadeExtents_Pos; // 0x480(0x0c)
	bool bOutdoorTransition; // 0x48c(0x01)
	float VolumeAlpha; // 0x490(0x04)
	float Brightness; // 0x494(0x04)
	float SkyIntensity; // 0x498(0x04)
	int32 Priority; // 0x49c(0x04)
	struct F*bdabc767c1 AmbientCube2; // 0x4a0(0xc8)
	char pad_56D[0x13]; // 0x56d(0x13)

	void *3f7afeecc8(); // Function Engine.*fd85e3fbd5.*3f7afeecc8 // Final|Native|Public // @ game+0xd5ebb0
};

// Class Engine.GIVolumesContainerComponent
// Size: 0x480 (Inherited: 0x470)
struct UGIVolumesContainerComponent : USceneComponent {
	char pad_470[0x10]; // 0x470(0x10)
};

// Class Engine.BoxGIVolume
// Size: 0x3f0 (Inherited: 0x3e8)
struct ABoxGIVolume : AActor {
	struct U*fd85e3fbd5* VolumeComponent; // 0x3e8(0x08)
};

// Class Engine.BrushShape
// Size: 0x420 (Inherited: 0x420)
struct ABrushShape : ABrush {
};

// Class Engine.AudioVolume
// Size: 0x468 (Inherited: 0x420)
struct AAudioVolume : AVolume {
	float Priority; // 0x420(0x04)
	char bEnabled : 1; // 0x424(0x01)
	char pad_424_1 : 7; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	struct FReverbSettings Settings; // 0x428(0x18)
	struct F*d94406f7f4 AmbientZoneSettings; // 0x440(0x24)
	char pad_464[0x4]; // 0x464(0x04)

	void SetPriority(); // Function Engine.AudioVolume.SetPriority // Final|Native|Public|BlueprintCallable // @ game+0x6bd0238
	void OnRep_bEnabled(); // Function Engine.AudioVolume.OnRep_bEnabled // Final|Native|Private // @ game+0x5e27f88
	void *8828e22427(); // Function Engine.AudioVolume.*8828e22427 // Final|Native|Public|BlueprintCallable // @ game+0x6bcdb00
	void SetReverbSettings(); // Function Engine.AudioVolume.SetReverbSettings // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bd0710
	void *35168e2a75(); // Function Engine.AudioVolume.*35168e2a75 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6bce7d0
};

// Class Engine.BlockingVolume
// Size: 0x420 (Inherited: 0x420)
struct ABlockingVolume : AVolume {
};

// Class Engine.CameraBlockingVolume
// Size: 0x420 (Inherited: 0x420)
struct ACameraBlockingVolume : AVolume {
};

// Class Engine.CullDistanceVolume
// Size: 0x448 (Inherited: 0x420)
struct ACullDistanceVolume : AVolume {
	struct TArray<struct F*5149d535a7> CullDistances; // 0x420(0x10)
	char bEnabled : 1; // 0x430(0x01)
	char pad_430_1 : 7; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	float CullDistanceForLODActor; // 0x434(0x04)
	float CullDistanceForLODActorTooFar; // 0x438(0x04)
	bool bUseActorBound; // 0x43c(0x01)
	char pad_43D[0x3]; // 0x43d(0x03)
	float IgnoreActorBoundSize; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class Engine.LevelStreamingVolume
// Size: 0x438 (Inherited: 0x420)
struct ALevelStreamingVolume : AVolume {
	struct TArray<struct FName> StreamingLevelNames; // 0x420(0x10)
	char bEditorPreVisOnly : 1; // 0x430(0x01)
	char bDisabled : 1; // 0x430(0x01)
	char pad_430_2 : 6; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	enum class *40de190205 StreamingUsage; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
};

// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x420 (Inherited: 0x420)
struct ALightmassCharacterIndirectDetailVolume : AVolume {
};

// Class Engine.LightmassImportanceVolume
// Size: 0x420 (Inherited: 0x420)
struct ALightmassImportanceVolume : AVolume {
};

// Class Engine.MeshMergeCullingVolume
// Size: 0x420 (Inherited: 0x420)
struct AMeshMergeCullingVolume : AVolume {
};

// Class Engine.NavMeshBoundsVolume
// Size: 0x428 (Inherited: 0x420)
struct ANavMeshBoundsVolume : AVolume {
	struct FNavAgentSelector SupportedAgents; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
};

// Class Engine.DefaultPhysicsVolume
// Size: 0x438 (Inherited: 0x438)
struct ADefaultPhysicsVolume : APhysicsVolume {
};

// Class Engine.KillZVolume
// Size: 0x438 (Inherited: 0x438)
struct AKillZVolume : APhysicsVolume {
};

// Class Engine.PainCausingVolume
// Size: 0x460 (Inherited: 0x438)
struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x438(0x01)
	char pad_438_1 : 7; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	float DamagePerSec; // 0x43c(0x04)
	struct UClass* DamageType; // 0x440(0x08)
	float PainInterval; // 0x448(0x04)
	char bEntryPain : 1; // 0x44c(0x01)
	char *45634256d7 : 1; // 0x44c(0x01)
	char pad_44C_2 : 6; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	struct AController* *d94d66223f; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
};

// Class Engine.BlendableInterface
// Size: 0x30 (Inherited: 0x30)
struct UBlendableInterface : UInterface {
};

// Class Engine.Scene
// Size: 0x30 (Inherited: 0x30)
struct UScene : UObject {
};

// Class Engine.*5403077ac7
// Size: 0x30 (Inherited: 0x30)
struct U*5403077ac7 : UInterface {
};

// Class Engine.PostProcessVolume
// Size: 0x9b0 (Inherited: 0x420)
struct APostProcessVolume : AVolume {
	char pad_420[0x10]; // 0x420(0x10)
	struct FPostProcessSettings Settings; // 0x430(0x570)
	float Priority; // 0x9a0(0x04)
	float BlendRadius; // 0x9a4(0x04)
	float BlendWeight; // 0x9a8(0x04)
	char bEnabled : 1; // 0x9ac(0x01)
	char bUnbound : 1; // 0x9ac(0x01)
	char pad_9AC_2 : 6; // 0x9ac(0x01)
	char pad_9AD[0x3]; // 0x9ad(0x03)

	void *cec1cb64e0(); // Function Engine.PostProcessVolume.*cec1cb64e0 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x6bd2d18
	void *fa132a0246(); // Function Engine.PostProcessVolume.*fa132a0246 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x6bb1e4c
};

// Class Engine.PrecomputedVisibilityOverrideVolume
// Size: 0x450 (Inherited: 0x420)
struct APrecomputedVisibilityOverrideVolume : AVolume {
	struct TArray<struct AActor*> OverrideVisibleActors; // 0x420(0x10)
	struct TArray<struct AActor*> OverrideInvisibleActors; // 0x430(0x10)
	struct TArray<struct FName> OverrideInvisibleLevels; // 0x440(0x10)
};

// Class Engine.PrecomputedVisibilityVolume
// Size: 0x420 (Inherited: 0x420)
struct APrecomputedVisibilityVolume : AVolume {
};

// Class Engine.TriggerVolume
// Size: 0x420 (Inherited: 0x420)
struct ATriggerVolume : AVolume {
};

// Class Engine.*d516522a17
// Size: 0x30 (Inherited: 0x30)
struct U*d516522a17 : UInterface {
};

// Class Engine.CameraShake
// Size: 0x170 (Inherited: 0x30)
struct UCameraShake : UObject {
	char *a1129bfbd8 : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *a990975726; // 0x34(0x04)
	float *99ca5d8eef; // 0x38(0x04)
	float *f03da12a63; // 0x3c(0x04)
	struct F*f7217abe10 *fbdc439690; // 0x40(0x24)
	struct F*06e6e74a48 *b9e2b7833f; // 0x64(0x24)
	struct F*dc02247a53 *168c6d0348; // 0x88(0x0c)
	float AnimPlayRate; // 0x94(0x04)
	float *be68479f85; // 0x98(0x04)
	float *8b697649b9; // 0x9c(0x04)
	float *b7a23eb463; // 0xa0(0x04)
	float *980c5845a2; // 0xa4(0x04)
	struct UCameraAnim* Anim; // 0xa8(0x08)
	char bRandomAnimSegment : 1; // 0xb0(0x01)
	char pad_B0_1 : 7; // 0xb0(0x01)
	char pad_B1[0x17]; // 0xb1(0x17)
	struct APlayerCameraManager* CameraOwner; // 0xc8(0x08)
	char pad_D0[0x88]; // 0xd0(0x88)
	float ShakeScale; // 0x158(0x04)
	float OscillatorTimeRemaining; // 0x15c(0x04)
	struct U*d3f66f5eff* AnimInst; // 0x160(0x08)
	char pad_168[0x8]; // 0x168(0x08)

	void ReceiveIsFinished(); // Function Engine.CameraShake.ReceiveIsFinished // Native|Event|Public|BlueprintEvent|Const // @ game+0xd337ec
	void ReceiveStopShake(); // Function Engine.CameraShake.ReceiveStopShake // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ReceivePlayShake(); // Function Engine.CameraShake.ReceivePlayShake // Event|Public|BlueprintEvent // @ game+0x3b43ac
	void BlueprintUpdateCameraShake(); // Function Engine.CameraShake.BlueprintUpdateCameraShake // Event|Public|HasOutParms|BlueprintEvent // @ game+0x3b43ac
};

// Class Engine.*89f9a84286
// Size: 0x290 (Inherited: 0x200)
struct U*89f9a84286 : UActorComponent {
	char pad_200[0x70]; // 0x200(0x70)
	struct TArray<struct F*a490466ff0> *a490466ff0; // 0x270(0x10)
	char pad_280[0x10]; // 0x280(0x10)

	void OnInputOwnerEndPlayed(); // Function Engine.*89f9a84286.OnInputOwnerEndPlayed // Final|Native|Private // @ game+0x6bc6408
	void *209e40adf2(); // Function Engine.*89f9a84286.*209e40adf2 // Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb17c
	void *954e6309b3(); // Function Engine.*89f9a84286.*954e6309b3 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfecc
	void *043fd36a6d(); // Function Engine.*89f9a84286.*043fd36a6d // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb0ac
	void *a01b6d7366(); // Function Engine.*89f9a84286.*a01b6d7366 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbaf94
	void *a121de3dd8(); // Function Engine.*89f9a84286.*a121de3dd8 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae8c
	void *c28aaac792(); // Function Engine.*89f9a84286.*c28aaac792 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbf270
	void *3aafd5898c(); // Function Engine.*89f9a84286.*3aafd5898c // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbae8c
	void *37d2feebd2(); // Function Engine.*89f9a84286.*37d2feebd2 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfecc
	void *d63dd4050c(); // Function Engine.*89f9a84286.*d63dd4050c // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfecc
};

// Class Engine.CurveFloat
// Size: 0xb0 (Inherited: 0x38)
struct UCurveFloat : UCurveBase {
	struct FRichCurve *0796ed81e5; // 0x38(0x70)
	bool *ee37441e4d; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)

	void *602c42cae2(); // Function Engine.CurveFloat.*602c42cae2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb308
	void *9da493fa7f(); // Function Engine.CurveFloat.*9da493fa7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc03954
};

// Class Engine.DecalActor
// Size: 0x3f0 (Inherited: 0x3e8)
struct ADecalActor : AActor {
	struct UDecalComponent* Decal; // 0x3e8(0x08)

	void CreateDynamicMaterialInstance(); // Function Engine.DecalActor.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x5df1e6c
	void *985cbb1955(); // Function Engine.DecalActor.*985cbb1955 // Final|Native|Public|BlueprintCallable // @ game+0x6bcd8f4
	void *7f5d0189f2(); // Function Engine.DecalActor.*7f5d0189f2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbb2e0
};

// Class Engine.DestructibleActor
// Size: 0x408 (Inherited: 0x3e8)
struct ADestructibleActor : AActor {
	struct UDestructibleComponent* DestructibleComponent; // 0x3e8(0x08)
	char bAffectNavigation : 1; // 0x3f0(0x01)
	char pad_3F0_1 : 7; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct FMulticastDelegate OnActorFracture; // 0x3f8(0x10)
};

// Class Engine.DistanceFieldCapture
// Size: 0x3f0 (Inherited: 0x3e8)
struct ADistanceFieldCapture : AActor {
	struct U*e3423cb73a* CaptureComponent; // 0x3e8(0x08)
};

// Class Engine.DocumentationActor
// Size: 0x3f0 (Inherited: 0x3e8)
struct ADocumentationActor : AActor {
	char pad_3E8[0x8]; // 0x3e8(0x08)
};

// Class Engine.Emitter
// Size: 0x438 (Inherited: 0x3e8)
struct AEmitter : AActor {
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x3e8(0x08)
	char *ff9098583d : 1; // 0x3f0(0x01)
	char bPostUpdateTickGroup : 1; // 0x3f0(0x01)
	char *477c5697c6 : 1; // 0x3f0(0x01)
	char pad_3F0_3 : 5; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct FMulticastDelegate OnParticleSpawn; // 0x3f8(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x408(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0x418(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0x428(0x10)

	void OnParticleSystemFinished(); // Function Engine.Emitter.OnParticleSystemFinished // Native|Public // @ game+0x5d958e4
	void *9eb2ac36d0(); // Function Engine.Emitter.*9eb2ac36d0 // Final|Native|Public|BlueprintCallable // @ game+0x6bd29e4
	void IsActive(); // Function Engine.Emitter.IsActive // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6bbfbb4
	void *0c18dcbb66(); // Function Engine.Emitter.*0c18dcbb66 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bcd280
	void *3a45f42ea4(); // Function Engine.Emitter.*3a45f42ea4 // Final|Native|Public|BlueprintCallable // @ game+0x6bcaedc
	void OnRep_bCurrentlyActive(); // Function Engine.Emitter.OnRep_bCurrentlyActive // Native|Public // @ game+0x5e4766c
	void SetFloatParameter(); // Function Engine.Emitter.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x6bcdc54
	void *1ce0c10461(); // Function Engine.Emitter.*1ce0c10461 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6bd1340
	void Deactivate(); // Function Engine.Emitter.Deactivate // Final|Native|Public|BlueprintCallable // @ game+0x6bb6524
	void Activate(); // Function Engine.Emitter.Activate // Final|Native|Public|BlueprintCallable // @ game+0x6bb077c
	void *72f8053368(); // Function Engine.Emitter.*72f8053368 // Final|Native|Public|BlueprintCallable // @ game+0x6bcf3ec
	void *033547d67c(); // Function Engine.Emitter.*033547d67c // Native|Public|BlueprintCallable // @ game+0x5e89180
};

// Class Engine.EmitterCameraLensEffectBase
// Size: 0x4a0 (Inherited: 0x438)
struct AEmitterCameraLensEffectBase : AEmitter {
	struct UParticleSystem* *d2bdbe540f; // 0x438(0x08)
	struct UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x440(0x08)
	struct APlayerCameraManager* *56bcb63c05; // 0x448(0x08)
	struct FTransform RelativeTransform; // 0x450(0x30)
	float *1ed2100235; // 0x480(0x04)
	char *f205dbfaef : 1; // 0x484(0x01)
	char *a69228887d : 1; // 0x484(0x01)
	char pad_484_2 : 6; // 0x484(0x01)
	char pad_485[0x3]; // 0x485(0x03)
	struct TArray<struct UClass*> *9d165d2087; // 0x488(0x10)
	float DistFromCamera; // 0x498(0x04)
