// WidgetBlueprintGeneratedClass KeyGuideWidgetBP.KeyGuideWidgetBP_C
// Size: 0x638 (Inherited: 0x598)
struct UKeyGuideWidgetBP_C : U*0877f309e3 {
	struct F*a6c93df757 UberGraphFrame; // 0x598(0x08)
	struct UBackgroundBlur* BackgroundBlur_1; // 0x5a0(0x08)
	struct U*36cff032b6* ButtonBack; // 0x5a8(0x08)
	struct UKeyboardWidgetBP_C* KeyboardWidgetBP; // 0x5b0(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP; // 0x5b8(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_7; // 0x5c0(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_8; // 0x5c8(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_9; // 0x5d0(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_12; // 0x5d8(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_13; // 0x5e0(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_14; // 0x5e8(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_15; // 0x5f0(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_C_1; // 0x5f8(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_C_2; // 0x600(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_C_3; // 0x608(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_C_7; // 0x610(0x08)
	struct UKeyGuideContentBP_C* KeyGuideContentBP_C_17; // 0x618(0x08)
	struct UKeyGuideTabWidget_C* KeyGuideTabWidget; // 0x620(0x08)
	struct UInvalidationBox* MainInvalidationBox; // 0x628(0x08)
	struct UMouseWidgetBP_C* MouseWidgetBP; // 0x630(0x08)

	void Construct(); // Function KeyGuideWidgetBP.KeyGuideWidgetBP_C.Construct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void EscapeEvent(); // Function KeyGuideWidgetBP.KeyGuideWidgetBP_C.EscapeEvent // BlueprintCallable|BlueprintEvent // @ game+0x3b43ac
	void BndEvt__TslCommonButton_0_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature(); // Function KeyGuideWidgetBP.KeyGuideWidgetBP_C.BndEvt__TslCommonButton_0_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature // BlueprintEvent // @ game+0x3b43ac
	void BndEvt__TslCommonButton_0_K2Node_ComponentBoundEvent_37_OnButtonHoverEvent__DelegateSignature(); // Function KeyGuideWidgetBP.KeyGuideWidgetBP_C.BndEvt__TslCommonButton_0_K2Node_ComponentBoundEvent_37_OnButtonHoverEvent__DelegateSignature // BlueprintEvent // @ game+0x3b43ac
	void ExecuteUbergraph_KeyGuideWidgetBP(); // Function KeyGuideWidgetBP.KeyGuideWidgetBP_C.ExecuteUbergraph_KeyGuideWidgetBP //  // @ game+0x3b43ac
};

