// WidgetBlueprintGeneratedClass UserPlatformImageWidget.UserPlatformImageWidget_C
// Size: 0x4d8 (Inherited: 0x470)
struct UUserPlatformImageWidget_C : U*c0c5b25d31 {
	struct F*a6c93df757 UberGraphFrame; // 0x470(0x08)
	struct USizeBox* PlatformSizebox; // 0x478(0x08)
	struct UImage* Ps4Controller; // 0x480(0x08)
	struct UImage* QuailController; // 0x488(0x08)
	struct UImage* UserCommon; // 0x490(0x08)
	struct UImage* UserPs4; // 0x498(0x08)
	struct UImage* UserQuail; // 0x4a0(0x08)
	struct UWidgetSwitcher* UserType; // 0x4a8(0x08)
	struct UImage* UserXbox; // 0x4b0(0x08)
	struct UImage* XboxController; // 0x4b8(0x08)
	struct FLinearColor IconColor; // 0x4c0(0x10)
	struct FVector2D IconSize; // 0x4d0(0x08)

	void PreConstruct(); // Function UserPlatformImageWidget.UserPlatformImageWidget_C.PreConstruct // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x3b43ac
	void ExecuteUbergraph_UserPlatformImageWidget(); // Function UserPlatformImageWidget.UserPlatformImageWidget_C.ExecuteUbergraph_UserPlatformImageWidget //  // @ game+0x3b43ac
};

