// Class Engine.Actor
// Size: 0x400 (Inherited: 0x30)
struct AActor : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x40(0x10)
	char pad_50_0 : 3; // 0x50(0x01)
	char *b8d59458c6 : 1; // 0x50(0x01)
	char pad_50_4 : 4; // 0x50(0x01)
	char pad_51_0 : 1; // 0x51(0x01)
	char *cf80e92dfd : 1; // 0x51(0x01)
	char bReplicates : 1; // 0x51(0x01)
	char pad_51_3 : 5; // 0x51(0x01)
	char pad_52[0x6]; // 0x52(0x06)
	struct FName *ab64aa9b2c; // 0x58(0x08)
	enum class ENetRole RemoteRole; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct AActor* Owner; // 0x68(0x08)
	struct FRepMovement ReplicatedMovement; // 0x70(0x34)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct F*f897083c18 *732a816970; // 0xa8(0x40)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0xe8(0x10)
	uint64 *5b976d7486; // 0xf8(0x08)
	float CustomTimeDilation; // 0x100(0x04)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x104(0x01)
	char pad_105[0x3]; // 0x105(0x03)
	float MinNetUpdateFrequency; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct USceneComponent* RootComponent; // 0x110(0x08)
	struct FMulticastDelegate OnTakePointDamage; // 0x118(0x10)
	struct FMulticastDelegate OnReleased; // 0x128(0x10)
	char pad_138[0x8]; // 0x138(0x08)
	enum class EAutoReceiveInput *1b5d625838; // 0x140(0x01)
	char bAutoDestroyWhenFinished : 1; // 0x141(0x01)
	char bCanBeDamaged : 1; // 0x141(0x01)
	char *f9145fc180 : 1; // 0x141(0x01)
	char *f7e3b7cb03 : 1; // 0x141(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x141(0x01)
	char *c5217f0fba : 1; // 0x141(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x141(0x01)
	char *97257759e9 : 1; // 0x141(0x01)
	char *951e142077 : 1; // 0x142(0x01)
	char pad_142_1 : 7; // 0x142(0x01)
	char pad_143[0x5]; // 0x143(0x05)
	struct TArray<struct FName> Layers; // 0x148(0x10)
	char pad_158[0x10]; // 0x158(0x10)
	struct TArray<struct AMatineeActor*> *8a80c37de5; // 0x168(0x10)
	char pad_178[0x58]; // 0x178(0x58)
	enum class ENetRole Role; // 0x1d0(0x01)
	char *62cc053e31 : 1; // 0x1d1(0x01)
	char pad_1D1_1 : 4; // 0x1d1(0x01)
	char *97c9e9d9d8 : 1; // 0x1d1(0x01)
	char *899333b5f1 : 1; // 0x1d1(0x01)
	char *251c0d9766 : 1; // 0x1d1(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x1d2(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x1d3(0x01)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct FMulticastDelegate OnActorEndOverlap; // 0x1d8(0x10)
	int32 *16d0bb46bd; // 0x1e8(0x04)
	float *7974797124; // 0x1ec(0x04)
	char pad_1F0[0x8]; // 0x1f0(0x08)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x1f8(0x10)
	struct FGuid DestructibleId; // 0x208(0x10)
	bool bIsDestroyedVersion; // 0x218(0x01)
	bool RemoveFromLevelLOD; // 0x219(0x01)
	char pad_21A[0x6]; // 0x21a(0x06)
	struct F*82957ba793 PrimaryActorTick; // 0x220(0x58)
	struct FMulticastDelegate OnClicked; // 0x278(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x288(0x10)
	float InitialLifeSpan; // 0x298(0x04)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct FMulticastDelegate OnInputTouchEnter; // 0x2a0(0x10)
	char pad_2B0[0x58]; // 0x2b0(0x58)
	struct APawn* Instigator; // 0x308(0x08)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x310(0x10)
	char pad_320[0x4]; // 0x320(0x04)
	struct UChildActorComponent* *bcea33173e; // 0x324(0x08)
	char pad_32C[0x4]; // 0x32c(0x04)
	struct FMulticastDelegate OnEndCursorOver; // 0x330(0x10)
	char bHidden : 1; // 0x340(0x01)
	char *dca4a04378 : 1; // 0x340(0x01)
	char *b3a4f52d88 : 1; // 0x340(0x01)
	char bOnlyRelevantToOwner : 1; // 0x340(0x01)
	char bAlwaysRelevant : 1; // 0x340(0x01)
	char *4b5ea83cba : 1; // 0x340(0x01)
	char *105e02f348 : 1; // 0x340(0x01)
	char *6980862dd6 : 1; // 0x340(0x01)
	char *ad303653fe : 1; // 0x341(0x01)
	char pad_341_1 : 1; // 0x341(0x01)
	char *f82bbe5644 : 1; // 0x341(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x341(0x01)
	char *e441233b38 : 1; // 0x341(0x01)
	char pad_341_5 : 1; // 0x341(0x01)
	char *b42f39270d : 1; // 0x341(0x01)
	char pad_341_7 : 1; // 0x341(0x01)
	char pad_342[0x6]; // 0x342(0x06)
	struct FMulticastDelegate OnInputTouchBegin; // 0x348(0x10)
	struct U*4aa7f8d102* *4aa7f8d102; // 0x358(0x08)
	float NetUpdateFrequency; // 0x360(0x04)
	char pad_364[0x4]; // 0x364(0x04)
	struct TArray<struct AActor*> Children; // 0x368(0x10)
	struct FMulticastDelegate OnActorHit; // 0x378(0x10)
	int32 *024611cfc7; // 0x388(0x04)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x390(0x10)
	struct TArray<struct FName> Tags; // 0x3a0(0x10)
	char pad_3B0[0x1]; // 0x3b0(0x01)
	enum class *95c5f230f9 InputConsumeOption; // 0x3b1(0x01)
	char pad_3B2[0x2]; // 0x3b2(0x02)
	float NetPriority; // 0x3b4(0x04)
	struct AActor* ParentComponentActor; // 0x3b8(0x08)
	struct FMulticastDelegate OnInputTouchEnd; // 0x3c0(0x10)
	struct FMulticastDelegate OnDestroyed; // 0x3d0(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3e0(0x10)
	char pad_3F0[0x4]; // 0x3f0(0x04)
	float NetCullDistanceSquared; // 0x3f4(0x04)
	char pad_3F8[0x8]; // 0x3f8(0x08)

	bool *1e3f4f9b76(); // Function Engine.Actor.*1e3f4f9b76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696750
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xb88b50
	bool DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x668d464
	enum class ENetRole *6d7d5caa8e(); // Function Engine.Actor.*6d7d5caa8e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66952c0
	float *e1b7176d37(); // Function Engine.Actor.*e1b7176d37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x668fcb8
	bool *2aaaa32fa0(); // Function Engine.Actor.*2aaaa32fa0 // Final|Native|Public|BlueprintCallable // @ game+0x66a7af8
	bool *6dabfe76eb(); // Function Engine.Actor.*6dabfe76eb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66966b8
	bool K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6697964
	bool ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66868c8
	struct AActor* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x273e04
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x26059c
	float *9790e1fca0(); // Function Engine.Actor.*9790e1fca0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6692a04
	bool K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x6699010
	struct FVector *613e01c62a(); // Function Engine.Actor.*613e01c62a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6699e28
	struct FHitResult ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x273e04
	float *93d0f10bfb(); // Function Engine.Actor.*93d0f10bfb // Final|Native|Public|BlueprintCallable // @ game+0x66a2168
	bool *d79c49c550(); // Function Engine.Actor.*d79c49c550 // Native|Public|BlueprintCallable // @ game+0x66a7478
	bool K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x669b478
	float *c38f5475d6(); // Function Engine.Actor.*c38f5475d6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6691fb0
	bool K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669b24c
	struct FVector *641423d1a4(); // Function Engine.Actor.*641423d1a4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668fce0
	float *a030dac26f(); // Function Engine.Actor.*a030dac26f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695780
	void *4d66259ce2(); // Function Engine.Actor.*4d66259ce2 // Native|Public|BlueprintCallable // @ game+0x66a9848
	struct UActorComponent* *2fb8c5686e(); // Function Engine.Actor.*2fb8c5686e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691460
	struct FRotator *4fc38b8595(); // Function Engine.Actor.*4fc38b8595 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668f8e4
	struct UActorComponent* AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xb8ded8
	struct AActor* *38cb59ce4e(); // Function Engine.Actor.*38cb59ce4e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66902a0
	struct FVector *49913882bb(); // Function Engine.Actor.*49913882bb // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6696004
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6699950
	struct AActor* *d4ab759ea6(); // Function Engine.Actor.*d4ab759ea6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694a34
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xc006d4
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6695cc4
	bool K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669b074
	bool *f414cfd93b(); // Function Engine.Actor.*f414cfd93b // Final|Native|Public|BlueprintCallable // @ game+0x5dd98c
	bool *fd96d57958(); // Function Engine.Actor.*fd96d57958 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696e9c
	struct AActor* ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x273e04
	float *b5dbf0fa4d(); // Function Engine.Actor.*b5dbf0fa4d // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66939c0
	bool *3d6bef52db(); // Function Engine.Actor.*3d6bef52db // Final|Native|Public|BlueprintCallable // @ game+0x6699310
	bool K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6697d14
	struct AController* *91c797133f(); // Function Engine.Actor.*91c797133f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693910
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x273e04
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66948a4
	bool K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6697388
	struct APlayerController* *4e5e8a5c04(); // Function Engine.Actor.*4e5e8a5c04 // Native|Public|BlueprintCallable // @ game+0x668efa0
	struct USceneComponent* *3730f5c729(); // Function Engine.Actor.*3730f5c729 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a3ac
	bool K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669ae9c
	struct FVector *6f6c4999f4(); // Function Engine.Actor.*6f6c4999f4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668fc6c
	struct UChildActorComponent* *0919a2c424(); // Function Engine.Actor.*0919a2c424 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694aec
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x33287c
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x273e04
	struct AActor* ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *ab8b52a15b(); // Function Engine.Actor.*ab8b52a15b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66a9f28
	struct APawn* *394d08df53(); // Function Engine.Actor.*394d08df53 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66938f8
	struct FKey ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *0014400b33(); // Function Engine.Actor.*0014400b33 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x66a7510
	struct FKey ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x273e04
	bool K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6697560
	void *a14cb7b3ca(); // Function Engine.Actor.*a14cb7b3ca // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x668f528
	struct AActor* SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x66a68b0
	float *ab7a656a16(); // Function Engine.Actor.*ab7a656a16 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x668fca0
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x273e04
	float *1e359ac376(); // Function Engine.Actor.*1e359ac376 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691e08
	bool GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668f73c
	struct FName MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x669ce6c
	bool *94feccb1e2(); // Function Engine.Actor.*94feccb1e2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x598ec6c
	bool SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x66a20d4
	float ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x273e04
	bool K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6697b3c
	struct FVector *0f4aed8ef9(); // Function Engine.Actor.*0f4aed8ef9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668fb14
	struct UMaterialInstanceDynamic* *23179b0761(); // Function Engine.Actor.*23179b0761 // Final|Native|Public|BlueprintCallable // @ game+0x669cdf0
	struct UActorComponent* *8c98ce177e(); // Function Engine.Actor.*8c98ce177e // Final|Native|Public|BlueprintCallable // @ game+0x6699968
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xad6f40
	struct FVector *3068ec2eb0(); // Function Engine.Actor.*3068ec2eb0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668fb48
	struct FName *a4e857ec43(); // Function Engine.Actor.*a4e857ec43 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66902c4
	struct FHitResult ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x273e04
	bool *13d64425d8(); // Function Engine.Actor.*13d64425d8 // Final|Native|Public|BlueprintCallable // @ game+0x66a1c98
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669ac64
	struct APlayerController* K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *9e37cb0e5c(); // Function Engine.Actor.*9e37cb0e5c // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x669008c
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x668f53c
	struct FName *2d603aa95a(); // Function Engine.Actor.*2d603aa95a // Final|Native|Public|BlueprintCallable // @ game+0x66a8b58
	bool K2_AddActorLocalTransform(); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6697738
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x273e04
	struct APlayerController* K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x273e04
	bool K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669b578
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6688560
	struct AActor* ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x273e04
	struct TArray<struct AActor*> *1092e5e400(); // Function Engine.Actor.*1092e5e400 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6690308
	float *07af7aee83(); // Function Engine.Actor.*07af7aee83 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66930d4
	struct AActor* *5d72d1d4c9(); // Function Engine.Actor.*5d72d1d4c9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694ac8
	enum class ETouchIndex ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *614fe47857(); // Function Engine.Actor.*614fe47857 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669669c
	struct APlayerController* DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x668d4f8
	enum class ETouchIndex ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x273e04
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb485d0
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x273e04
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x273e04
	enum class *c67378b5c9 *df34dc9ee1(); // Function Engine.Actor.*df34dc9ee1 // Final|Native|Public|BlueprintCallable // @ game+0x6699ab8
	struct UActorComponent* *5ef1f9adbd(); // Function Engine.Actor.*5ef1f9adbd // Native|Public|BlueprintCallable // @ game+0x669e9d4
	struct AActor* *5ad1d3c9a1(); // Function Engine.Actor.*5ad1d3c9a1 // Native|Public|BlueprintCallable // @ game+0x669e8ac
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xc8d5d4
	bool K2_AttachRootComponentTo(); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x6698e90
	struct FVector *686ee8fadd(); // Function Engine.Actor.*686ee8fadd // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a1f94
	struct UActorComponent* *00b640eb07(); // Function Engine.Actor.*00b640eb07 // Native|Public|BlueprintCallable // @ game+0x6688688
	struct TArray<struct UActorComponent*> *9bff12536a(); // Function Engine.Actor.*9bff12536a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691648
	struct UClass* GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6694644
	struct TArray<struct UActorComponent*> *dfe7c31236(); // Function Engine.Actor.*dfe7c31236 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691558
	float *90b7b2cf4b(); // Function Engine.Actor.*90b7b2cf4b // Native|Public|BlueprintCallable // @ game+0xccbeb0
	enum class ETouchIndex ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *ce46fbd05d(); // Function Engine.Actor.*ce46fbd05d // Final|Native|Public|BlueprintCallable // @ game+0x6695a4c
	float *eb97b78500(); // Function Engine.Actor.*eb97b78500 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669603c
	enum class ETickingGroup *750dd6d1b4(); // Function Engine.Actor.*750dd6d1b4 // Final|Native|Public|BlueprintCallable // @ game+0x66a79e0
	bool K2_SetActorLocation(); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669aa80
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x273e04
	struct FVector *bd60b203e7(); // Function Engine.Actor.*bd60b203e7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a2034
	enum class ETouchIndex ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x273e04
	struct FVector *ef2725e645(); // Function Engine.Actor.*ef2725e645 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66936f0
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6699eec
	bool SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x66a1d30
	float *48afe05568(); // Function Engine.Actor.*48afe05568 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6692fe0
	struct FVector *70d0b60e57(); // Function Engine.Actor.*70d0b60e57 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668f9f0
	float *be02dcd6c1(); // Function Engine.Actor.*be02dcd6c1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6692aa4
	bool *4db2f11121(); // Function Engine.Actor.*4db2f11121 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x669c7b8
	float *45fd8a20ef(); // Function Engine.Actor.*45fd8a20ef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691d68
};

// Class Engine.AnimInstance
// Size: 0x3a0 (Inherited: 0x30)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct USkeleton* *ed667f4877; // 0x38(0x08)
	enum class *f710213dc1 *11e7e042ca; // 0x40(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x41(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x42(0x01)
	bool *6c5cd0fbcc; // 0x43(0x01)
	bool bWarnAboutBlueprintUsage; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x48(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x58(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x68(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x78(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x88(0x10)
	char pad_98[0x60]; // 0x98(0x60)
	bool *26e169fab8; // 0xf8(0x01)
	char pad_F9[0x9f]; // 0xf9(0x9f)
	struct TArray<struct FAnimNotifyEvent> *505b5151ee; // 0x198(0x10)
	char pad_1A8[0x1f8]; // 0x1a8(0x1f8)

	float GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x66c6c98
	struct FName *da8b5dda0c(); // Function Engine.AnimInstance.*da8b5dda0c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66e08f4
	float *f7028cf890(); // Function Engine.AnimInstance.*f7028cf890 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66cb990
	struct AActor* *4e5ea7e426(); // Function Engine.AnimInstance.*4e5ea7e426 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc8ac10
	float *7ad988b653(); // Function Engine.AnimInstance.*7ad988b653 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66e0ad0
	float *8222fd1c56(); // Function Engine.AnimInstance.*8222fd1c56 // Final|Native|Public|BlueprintCallable // @ game+0x66e0eec
	void *614f873041(); // Function Engine.AnimInstance.*614f873041 // Final|Native|Public|BlueprintCallable // @ game+0x66bb640
	float *7004794d0c(); // Function Engine.AnimInstance.*7004794d0c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66cabb0
	struct FName *460e32196d(); // Function Engine.AnimInstance.*460e32196d // Final|Native|Public|BlueprintCallable // @ game+0x6701888
	float *333bc82610(); // Function Engine.AnimInstance.*333bc82610 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66e0a30
	struct FName *31b3be8143(); // Function Engine.AnimInstance.*31b3be8143 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66c892c
	float GetAnimAssetPlayerTimeFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x66c6d2c
	struct UAnimMontage* *5c84548a1e(); // Function Engine.AnimInstance.*5c84548a1e // Final|Native|Public|BlueprintCallable // @ game+0x66e0c10
	bool *7a4d3e2de7(); // Function Engine.AnimInstance.*7a4d3e2de7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66d0e70
	float *b40d60a3ab(); // Function Engine.AnimInstance.*b40d60a3ab // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66b83a8
	struct APawn* *9c286a1dd6(); // Function Engine.AnimInstance.*9c286a1dd6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67035d0
	float *8f5e8caa01(); // Function Engine.AnimInstance.*8f5e8caa01 // Final|Native|Public|BlueprintCallable // @ game+0x66e0e0c
	bool *35d3016b0e(); // Function Engine.AnimInstance.*35d3016b0e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d4384
	float *a1cdf92d33(); // Function Engine.AnimInstance.*a1cdf92d33 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66ca9ec
	float *7b1d412206(); // Function Engine.AnimInstance.*7b1d412206 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66ca470
	struct FPoseSnapshot *50d1a575e9(); // Function Engine.AnimInstance.*50d1a575e9 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x66fc8a4
	float *9113d38401(); // Function Engine.AnimInstance.*9113d38401 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66e0854
	float *c6aa635ece(); // Function Engine.AnimInstance.*c6aa635ece // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66cb080
	float *5ae2ffaa34(); // Function Engine.AnimInstance.*5ae2ffaa34 // Final|Native|Public|BlueprintCallable // @ game+0x66f4a98
	float *9f4159a1c0(); // Function Engine.AnimInstance.*9f4159a1c0 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x29b4b4
	float *516889ae6d(); // Function Engine.AnimInstance.*516889ae6d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66ce998
	float *b71ba1b5fb(); // Function Engine.AnimInstance.*b71ba1b5fb // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66ca64c
	bool *61c86306be(); // Function Engine.AnimInstance.*61c86306be // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d65b4
	float GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66c888c
	float *e403a62386(); // Function Engine.AnimInstance.*e403a62386 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66cb56c
	float BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x273e04
	struct UAnimMontage* *cfc2a4c7e9(); // Function Engine.AnimInstance.*cfc2a4c7e9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66c84a4
	enum class *f710213dc1 *60dd5a4893(); // Function Engine.AnimInstance.*60dd5a4893 // Final|Native|Public|BlueprintCallable // @ game+0x66f695c
	float GetAnimAssetPlayerTimeFromEnd(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66c6e0c
	struct UAnimMontage* *c1dab9bbb4(); // Function Engine.AnimInstance.*c1dab9bbb4 // Native|Public|BlueprintCallable // @ game+0x59ae728
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x273e04
	float GetAnimAssetPlayerTimeFromEndFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x66c6f10
	bool *d764287b5e(); // Function Engine.AnimInstance.*d764287b5e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d5e70
	float PlaySlotAnimation(); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x66e48b0
	struct USkeletalMeshComponent* *9607422949(); // Function Engine.AnimInstance.*9607422949 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cd848
	float *504e9f6ebf(); // Function Engine.AnimInstance.*504e9f6ebf // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x9c69e4
	float GetStateWeight(); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66d0274
	bool *89bd946387(); // Function Engine.AnimInstance.*89bd946387 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x66dc3b8
	float *cc84762a5a(); // Function Engine.AnimInstance.*cc84762a5a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66ca828
	bool *dc552bfa63(); // Function Engine.AnimInstance.*dc552bfa63 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66e0990
	bool *484b63942a(); // Function Engine.AnimInstance.*484b63942a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d6b3c
	bool *7ddaa5c7cb(); // Function Engine.AnimInstance.*7ddaa5c7cb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66e0b70
	struct UAnimMontage* *63c56d3338(); // Function Engine.AnimInstance.*63c56d3338 // Native|Public|BlueprintCallable // @ game+0xbe3efc
	float *3e3e5841ae(); // Function Engine.AnimInstance.*3e3e5841ae // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x9c6730
	bool *5b379fddd3(); // Function Engine.AnimInstance.*5b379fddd3 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x66dc3b8
	struct UAnimMontage* *18cf7a25ea(); // Function Engine.AnimInstance.*18cf7a25ea // Final|Native|Public|BlueprintCallable // @ game+0x66e0cec
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *feeeff43b3(); // Function Engine.AnimInstance.*feeeff43b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xccbf30
	float Montage_Play(); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x73eea8
	float *8e0d490c68(); // Function Engine.AnimInstance.*8e0d490c68 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66ce76c
	float *a370694256(); // Function Engine.AnimInstance.*a370694256 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66cad8c
	struct UAnimMontage* *44662a9bc1(); // Function Engine.AnimInstance.*44662a9bc1 // Final|Native|Public|BlueprintCallable // @ game+0x66e0d7c
	float *c4fc059f80(); // Function Engine.AnimInstance.*c4fc059f80 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66cb780
	struct F*e57140e3c2 *4f5ff7b06c(); // Function Engine.AnimInstance.*4f5ff7b06c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d07a8
	struct UAnimMontage* *9f48e4fa70(); // Function Engine.AnimInstance.*9f48e4fa70 // Native|Public|BlueprintCallable // @ game+0x59ae4c8
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x66e4ad4
	float *97cd00756e(); // Function Engine.AnimInstance.*97cd00756e // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x66ce558
	struct FName *41e1acbaff(); // Function Engine.AnimInstance.*41e1acbaff // Native|Public|BlueprintCallable // @ game+0x66e9b70
	float *b538b022ef(); // Function Engine.AnimInstance.*b538b022ef // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x73e724
};

// Class Engine.ActorComponent
// Size: 0x200 (Inherited: 0x30)
struct UActorComponent : UObject {
	char pad_30[0xf0]; // 0x30(0xf0)
	struct F*0f0451e91e PrimaryComponentTick; // 0x120(0x58)
	struct TArray<struct FName> ComponentTags; // 0x178(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x188(0x10)
	char pad_198_0 : 3; // 0x198(0x01)
	char bReplicates : 1; // 0x198(0x01)
	char bNetAddressable : 1; // 0x198(0x01)
	char *eb9a7c0234 : 1; // 0x198(0x01)
	char pad_198_6 : 2; // 0x198(0x01)
	char pad_199[0x1]; // 0x199(0x01)
	char pad_19A_0 : 2; // 0x19a(0x01)
	char bCreatedByConstructionScript : 1; // 0x19a(0x01)
	char bInstanceComponent : 1; // 0x19a(0x01)
	char bAutoActivate : 1; // 0x19a(0x01)
	char *a0e3b46900 : 1; // 0x19a(0x01)
	char *f5528674d0 : 1; // 0x19a(0x01)
	char pad_19A_7 : 1; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	struct FGuid DestructibleId; // 0x19c(0x10)
	bool bIsDestroyedVersion; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	char *4104c47be9 : 1; // 0x1b0(0x01)
	char pad_1B0_1 : 2; // 0x1b0(0x01)
	char bIsEditorOnly : 1; // 0x1b0(0x01)
	char pad_1B0_4 : 4; // 0x1b0(0x01)
	char pad_1B1[0x4]; // 0x1b1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1b5(0x01)
	enum class EPendingCreationType *b5609ab139; // 0x1b6(0x01)
	char pad_1B7[0x9]; // 0x1b7(0x09)
	struct TArray<struct FSimpleMemberReference> *146dc34f04; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1d0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1e0(0x10)
	char pad_1F0[0x9]; // 0x1f0(0x09)
	char *cf80e92dfd : 1; // 0x1f9(0x01)
	char pad_1F9_1 : 7; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)

	struct UObject* *8c98ce177e(); // Function Engine.ActorComponent.*8c98ce177e // Final|Native|Public|BlueprintCallable // @ game+0x6699a00
	void *1f22ea7014(); // Function Engine.ActorComponent.*1f22ea7014 // Native|Public|BlueprintCallable // @ game+0x613fc14
	bool *785b4984be(); // Function Engine.ActorComponent.*785b4984be // Native|Public|BlueprintCallable // @ game+0x66a4350
	bool IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696674
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *1a019a9e51(); // Function Engine.ActorComponent.*1a019a9e51 // Native|Public|BlueprintCallable // @ game+0x66a279c
	float *da68cb3372(); // Function Engine.ActorComponent.*da68cb3372 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691508
	bool *0d8e3f17b7(); // Function Engine.ActorComponent.*0d8e3f17b7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696734
	struct AActor* AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x66885f4
	struct AActor* *d4ab759ea6(); // Function Engine.ActorComponent.*d4ab759ea6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc950ac
	struct UActorComponent* *00b640eb07(); // Function Engine.ActorComponent.*00b640eb07 // Native|Public|BlueprintCallable // @ game+0x668871c
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x669d3cc
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0xc2553c
	struct UActorComponent* *5ef1f9adbd(); // Function Engine.ActorComponent.*5ef1f9adbd // Native|Public|BlueprintCallable // @ game+0x669ea68
	struct AActor* *5ad1d3c9a1(); // Function Engine.ActorComponent.*5ad1d3c9a1 // Native|Public|BlueprintCallable // @ game+0x669e940
	float *ea49bd0d03(); // Function Engine.ActorComponent.*ea49bd0d03 // Final|Native|Public|BlueprintCallable // @ game+0x66a43e8
	bool *2aaaa32fa0(); // Function Engine.ActorComponent.*2aaaa32fa0 // Final|Native|Public|BlueprintCallable // @ game+0x66a7b90
	enum class EEndPlayReason ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *8a0aedbeac(); // Function Engine.ActorComponent.*8a0aedbeac // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x668c494
	float ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x273e04
	enum class ETickingGroup *750dd6d1b4(); // Function Engine.ActorComponent.*750dd6d1b4 // Final|Native|Public|BlueprintCallable // @ game+0x66a7a6c
	bool Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xdaa53c
	bool *8ebaaa3f1c(); // Function Engine.ActorComponent.*8ebaaa3f1c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696880
	bool *daf95a6d0f(); // Function Engine.ActorComponent.*daf95a6d0f // Final|Native|Public|BlueprintCallable // @ game+0x66a58a8
	bool *d16a426ed5(); // Function Engine.ActorComponent.*d16a426ed5 // Native|Public|BlueprintCallable // @ game+0x66a1ba4
};

// Class Engine.Pawn
// Size: 0x460 (Inherited: 0x400)
struct APawn : AActor {
	char pad_400[0x8]; // 0x400(0x08)
	char bUseControllerRotationPitch : 1; // 0x408(0x01)
	char bUseControllerRotationYaw : 1; // 0x408(0x01)
	char bUseControllerRotationRoll : 1; // 0x408(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x408(0x01)
	char pad_408_4 : 4; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	float BaseEyeHeight; // 0x40c(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x410(0x01)
	enum class EAutoPossessAI *637d6226e2; // 0x411(0x01)
	char pad_412[0x6]; // 0x412(0x06)
	struct UClass* AIControllerClass; // 0x418(0x08)
	struct APlayerState* PlayerState; // 0x420(0x08)
	struct AController* *ae51997ba6; // 0x428(0x08)
	char pad_430[0x4]; // 0x430(0x04)
	uint16 *b10f56f1ec; // 0x434(0x02)
	char pad_436[0x2]; // 0x436(0x02)
	struct AController* Controller; // 0x438(0x08)
	char pad_440[0x4]; // 0x440(0x04)
	struct FVector *814ccd4912; // 0x444(0x0c)
	struct FVector *3f76097423; // 0x450(0x0c)
	char pad_45C[0x4]; // 0x45c(0x04)

	struct FVector *32c30cb7ba(); // Function Engine.Pawn.*32c30cb7ba // Native|Public|HasDefaults|BlueprintCallable // @ game+0x668c8ac
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0x954f48
	void *e0a9fcbfb7(); // Function Engine.Pawn.*e0a9fcbfb7 // Native|Public|BlueprintCallable // @ game+0x59373c0
	float AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x6686b50
	bool *acf54802ff(); // Function Engine.Pawn.*acf54802ff // Final|Native|Public|BlueprintCallable // @ game+0x66a382c
	struct AController* GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66917f4
	struct FVector *daec38650f(); // Function Engine.Pawn.*daec38650f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6694e04
	bool *cd2880c3b9(); // Function Engine.Pawn.*cd2880c3b9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc0ee34
	struct UPawnMovementComponent* *ce2d089123(); // Function Engine.Pawn.*ce2d089123 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x593bb74
	struct AController* ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x273e04
	struct AActor* *36a58cc031(); // Function Engine.Pawn.*36a58cc031 // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x669d628
	struct FVector K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6694e04
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66917c0
	bool *ecf94bc62e(); // Function Engine.Pawn.*ecf94bc62e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x669ca10
	struct AActor* *f4052479f6(); // Function Engine.Pawn.*f4052479f6 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x669411c
	float AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x6686c88
	struct FVector *c4dd205927(); // Function Engine.Pawn.*c4dd205927 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6693998
	struct AController* ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *c2917ac77a(); // Function Engine.Pawn.*c2917ac77a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66968ac
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x59b21b8
	struct FRotator *7f9978cc5d(); // Function Engine.Pawn.*7f9978cc5d // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66903f0
	void *5169d06c8f(); // Function Engine.Pawn.*5169d06c8f // Native|Public|BlueprintCallable // @ game+0x66a8d3c
	bool *8abf75d769(); // Function Engine.Pawn.*8abf75d769 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6687d7c
	float AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x6686bec
	bool *c6dcfd395c(); // Function Engine.Pawn.*c6dcfd395c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596d008
	bool *796d6f386f(); // Function Engine.Pawn.*796d6f386f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696e24
	struct FVector *8bf01eefd9(); // Function Engine.Pawn.*8bf01eefd9 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6694254
};

// Class Engine.DataAsset
// Size: 0x38 (Inherited: 0x30)
struct UDataAsset : UObject {
	struct UClass* *10becfdadd; // 0x30(0x08)
};

// Class Engine.SceneComponent
// Size: 0x4e0 (Inherited: 0x200)
struct USceneComponent : UActorComponent {
	SetProperty *e5b54241ae; // 0x200(0x50)
	char pad_250[0x8]; // 0x250(0x08)
	struct FVector RelativeLocation; // 0x258(0x0c)
	char pad_264[0x4]; // 0x264(0x04)
	struct USceneComponent* AttachParent; // 0x268(0x08)
	char pad_270_0 : 1; // 0x270(0x01)
	char bReplicatesAttachmentReference : 1; // 0x270(0x01)
	char bReplicatesAttachment : 1; // 0x270(0x01)
	char *7edcd61a27 : 1; // 0x270(0x01)
	char pad_270_4 : 1; // 0x270(0x01)
	char bAbsoluteLocation : 1; // 0x270(0x01)
	char bAbsoluteRotation : 1; // 0x270(0x01)
	char bAbsoluteScale : 1; // 0x270(0x01)
	char bVisible : 1; // 0x271(0x01)
	char bHiddenInGame : 1; // 0x271(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x271(0x01)
	char *24ea2d2db6 : 1; // 0x271(0x01)
	char bUseAttachParentBound : 1; // 0x271(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x271(0x01)
	char pad_271_6 : 2; // 0x271(0x01)
	char pad_272[0x2e]; // 0x272(0x2e)
	char bAbsoluteTranslation : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	struct APhysicsVolume* PhysicsVolume; // 0x2a4(0x08)
	char pad_2AC[0x20]; // 0x2ac(0x20)
	struct FRotator RelativeRotation; // 0x2cc(0x0c)
	char pad_2D8[0x28]; // 0x2d8(0x28)
	struct FVector *9a43cb5eb0; // 0x300(0x0c)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x310(0x10)
	char pad_320[0x50]; // 0x320(0x50)
	struct FName *d373ab65c0; // 0x370(0x08)
	struct FVector RelativeScale3D; // 0x378(0x0c)
	char pad_384[0xc]; // 0x384(0x0c)
	enum class *8d98cbd81d DetailMode; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)
	struct FVector RelativeTranslation; // 0x398(0x0c)
	char pad_3A4[0xc]; // 0x3a4(0x0c)
	enum class EComponentMobility Mobility; // 0x3b0(0x01)
	char pad_3B1[0x7]; // 0x3b1(0x07)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x3b8(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x3c8(0x10)
	char pad_3D8[0x108]; // 0x3d8(0x108)

	struct TArray<struct FName> *13433cbc36(); // Function Engine.SceneComponent.*13433cbc36 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66901bc
	struct USceneComponent* *b37ee9a628(); // Function Engine.SceneComponent.*b37ee9a628 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691000
	bool *3042ae5482(); // Function Engine.SceneComponent.*3042ae5482 // Final|Native|Public|BlueprintCallable // @ game+0x66a5770
	bool K2_SetWorldLocation(); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669bfac
	struct FName *9880b8ac03(); // Function Engine.SceneComponent.*9880b8ac03 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66902f0
	struct FVector *616a4bc95d(); // Function Engine.SceneComponent.*616a4bc95d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xc3e6b0
	struct FTransform *d1e160453f(); // Function Engine.SceneComponent.*d1e160453f // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6695650
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xafdd78
	void *00805e15a0(); // Function Engine.SceneComponent.*00805e15a0 // Final|Native|Public|BlueprintCallable // @ game+0x669eb2c
	struct FVector *b65feeef3f(); // Function Engine.SceneComponent.*b65feeef3f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669a078
	bool ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x66a99ac
	bool K2_AddRelativeRotation(); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66986e8
	bool K2_SetRelativeRotation(); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669bba8
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669a0bc
	struct FRotator *acf5999592(); // Function Engine.SceneComponent.*acf5999592 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6695598
	struct FVector *3c6ecb02cb(); // Function Engine.SceneComponent.*3c6ecb02cb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66952d4
	bool K2_AddWorldTransform(); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6698c64
	struct TArray<struct USceneComponent*> *b7202f79f2(); // Function Engine.SceneComponent.*b7202f79f2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6694cf4
	bool K2_SetRelativeLocation(); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669b7ac
	bool K2_AddWorldOffset(); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66988b4
	struct FVector *6948fa2e48(); // Function Engine.SceneComponent.*6948fa2e48 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6691f0c
	struct FRotator *50da2f3057(); // Function Engine.SceneComponent.*50da2f3057 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6699ff4
	struct TArray<struct USceneComponent*> *f6d44887dc(); // Function Engine.SceneComponent.*f6d44887dc // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66910a0
	bool IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6697270
	bool SetVisibility(); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xc8ce94
	bool K2_AddRelativeLocation(); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669851c
	bool K2_AddWorldRotation(); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6698a8c
	bool *ed9b4c17e2(); // Function Engine.SceneComponent.*ed9b4c17e2 // Final|Native|Public|BlueprintCallable // @ game+0x66a580c
	int32 *38d51f9159(); // Function Engine.SceneComponent.*38d51f9159 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694460
	bool *f414cfd93b(); // Function Engine.SceneComponent.*f414cfd93b // Final|Native|Public|BlueprintCallable // @ game+0x6699530
	bool K2_AttachTo(); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x6699190
	bool *efd3807eb2(); // Function Engine.SceneComponent.*efd3807eb2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x668d5a4
	bool *438a5949ee(); // Function Engine.SceneComponent.*438a5949ee // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59c9148
	bool K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6698118
	bool *444c1212e4(); // Function Engine.SceneComponent.*444c1212e4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669670c
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xafdd78
	struct FVector *e779c0903a(); // Function Engine.SceneComponent.*e779c0903a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6695430
	bool OnRep_Visibility(); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x669d4c0
	bool DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x668d370
	struct USceneComponent* *21f58f1be6(); // Function Engine.SceneComponent.*21f58f1be6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08e58
	bool *64a21ee5e3(); // Function Engine.SceneComponent.*64a21ee5e3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669b978
	struct FQuat *e13883b81c(); // Function Engine.SceneComponent.*e13883b81c // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66954e8
	struct FVector *4b5116dfbb(); // Function Engine.SceneComponent.*4b5116dfbb // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6691520
	struct FVector *5ce6cd6a9b(); // Function Engine.SceneComponent.*5ce6cd6a9b // Native|Public|HasDefaults|BlueprintCallable // @ game+0xc475c0
	struct FTransform *b0520f213c(); // Function Engine.SceneComponent.*b0520f213c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6695268
	bool K2_SetRelativeTransform(); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669bd80
	bool *56cf68d820(); // Function Engine.SceneComponent.*56cf68d820 // Final|Native|Public|BlueprintCallable // @ game+0x66a1a60
	bool *9917bfece4(); // Function Engine.SceneComponent.*9917bfece4 // Final|Native|Public|BlueprintCallable // @ game+0x7857a8
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xb666c4
	bool K2_SetWorldRotation(); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669c3b4
	struct FVector *f6dcf1f073(); // Function Engine.SceneComponent.*f6dcf1f073 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a8828
	bool *5822caec90(); // Function Engine.SceneComponent.*5822caec90 // Final|Native|Public|BlueprintCallable // @ game+0x66a5498
	bool *d0e066f51a(); // Function Engine.SceneComponent.*d0e066f51a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669c184
	struct FVector *17ae5231cf(); // Function Engine.SceneComponent.*17ae5231cf // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6695e34
	bool *5196502450(); // Function Engine.SceneComponent.*5196502450 // Final|Native|Public|BlueprintCallable // @ game+0x66a8c34
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xacb418
	bool K2_AddLocalTransform(); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66982f0
	struct APhysicsVolume* *0f7e9a03af(); // Function Engine.SceneComponent.*0f7e9a03af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695060
	bool K2_AddLocalOffset(); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6697f40
	bool K2_SetWorldTransform(); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669c58c
};

// Class Engine.PrimitiveComponent
// Size: 0xa10 (Inherited: 0x4e0)
struct UPrimitiveComponent : USceneComponent {
	char pad_4E0[0x8]; // 0x4e0(0x08)
	float MinDrawDistance; // 0x4e8(0x04)
	float LDMaxDrawDistance; // 0x4ec(0x04)
	float CachedMaxDrawDistance; // 0x4f0(0x04)
	enum class *aa5951ad16 *beac6f3512; // 0x4f4(0x01)
	enum class *aa5951ad16 *c05f331378; // 0x4f5(0x01)
	char pad_4F6[0x2]; // 0x4f6(0x02)
	char pad_4F8_0 : 3; // 0x4f8(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x4f8(0x01)
	char bGenerateOverlapEvents : 1; // 0x4f8(0x01)
	char bMultiBodyOverlap : 1; // 0x4f8(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x4f8(0x01)
	char bTraceComplexOnMove : 1; // 0x4f8(0x01)
	char bDisableForceFromCharacter : 1; // 0x4f9(0x01)
	char bReturnMaterialOnMove : 1; // 0x4f9(0x01)
	char *7d72c87c3b : 1; // 0x4f9(0x01)
	char bAllowCullDistanceVolume : 1; // 0x4f9(0x01)
	char bImportantMesh : 1; // 0x4f9(0x01)
	char bOverrideCullingDistances : 1; // 0x4f9(0x01)
	char pad_4F9_6 : 2; // 0x4f9(0x01)
	char pad_4FA[0x2]; // 0x4fa(0x02)
	float HLODScreenSize; // 0x4fc(0x04)
	char *5e4ce749ad : 1; // 0x500(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x500(0x01)
	char bRenderInMainPass : 1; // 0x500(0x01)
	char bRenderInMono : 1; // 0x500(0x01)
	char bOwnerNoSee : 1; // 0x500(0x01)
	char bOnlyOwnerSee : 1; // 0x500(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x500(0x01)
	char bUseAsOccluder : 1; // 0x500(0x01)
	char bForceAsOccluder : 1; // 0x501(0x01)
	char bForceOcclusionQuerying : 1; // 0x501(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x501(0x01)
	char *5be8cbe28b : 1; // 0x501(0x01)
	char bForceMipStreaming : 1; // 0x501(0x01)
	char *df83a74442 : 1; // 0x501(0x01)
	char pad_501_6 : 1; // 0x501(0x01)
	char CastShadow : 1; // 0x501(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x502(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x502(0x01)
	char bCastDynamicShadow : 1; // 0x502(0x01)
	char bCastStaticShadow : 1; // 0x502(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x502(0x01)
	char bSelfShadowOnly : 1; // 0x502(0x01)
	char bCastFarShadow : 1; // 0x502(0x01)
	char bCastInsetShadow : 1; // 0x502(0x01)
	char bCastCinematicShadow : 1; // 0x503(0x01)
	char bCastHiddenShadow : 1; // 0x503(0x01)
	char bCastShadowAsTwoSided : 1; // 0x503(0x01)
	char bLightAsIfStatic : 1; // 0x503(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x503(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x503(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x503(0x01)
	char bIgnoreRadialImpulse : 1; // 0x503(0x01)
	char bIgnoreRadialForce : 1; // 0x504(0x01)
	char bApplyImpulseOnDamage : 1; // 0x504(0x01)
	char bSyncBodySleep : 1; // 0x504(0x01)
	char *c4dba7907d : 1; // 0x504(0x01)
	char *9a602298e0 : 1; // 0x504(0x01)
	char *8a825352a8 : 1; // 0x504(0x01)
	char bRenderCustomDepth : 1; // 0x504(0x01)
	char pad_504_7 : 1; // 0x504(0x01)
	char pad_505_0 : 7; // 0x505(0x01)
	char *f0ec410b1c : 1; // 0x505(0x01)
	char *e465b784ab : 1; // 0x506(0x01)
	char *0566bc7293 : 1; // 0x506(0x01)
	char pad_506_2 : 6; // 0x506(0x01)
	char pad_507[0x1]; // 0x507(0x01)
	enum class EDecalChannel DecalChannel; // 0x508(0x01)
	enum class *a6cf5bae1a IndoorOutdoorMask; // 0x509(0x01)
	struct FLightingChannels LightingChannels; // 0x50a(0x03)
	enum class *8421afef2f IndirectLightingCacheQuality; // 0x50d(0x01)
	bool CustomDepthStencilValue; // 0x50e(0x01)
	enum class *dc75936d4b CustomDepthStencilWriteMask; // 0x50f(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x510(0x10)
	int32 TranslucencySortPriority; // 0x520(0x04)
	int32 *9de4760b7d; // 0x524(0x04)
	char pad_528[0x4]; // 0x528(0x04)
	float LpvBiasMultiplier; // 0x52c(0x04)
	struct FBodyInstance BodyInstance; // 0x530(0x230)
	char pad_760[0x8]; // 0x760(0x08)
	enum class EHasCustomNavigableGeometry *8df498730b; // 0x768(0x01)
	char pad_769[0x3b]; // 0x769(0x3b)
	float BoundsScale; // 0x7a4(0x04)
	float *8e81fad5fc; // 0x7a8(0x04)
	float *c058bd94eb; // 0x7ac(0x04)
	float *02253285d4; // 0x7b0(0x04)
	enum class *2cf50fcfdf CanBeCharacterBase; // 0x7b4(0x01)
	char pad_7B5[0x1]; // 0x7b5(0x01)
	enum class *2cf50fcfdf CanCharacterStepUpOn; // 0x7b6(0x01)
	char pad_7B7[0x1]; // 0x7b7(0x01)
	struct TArray<struct AActor*> *2588299a27; // 0x7b8(0x10)
	struct TArray<struct UPrimitiveComponent*> *67a415eac1; // 0x7c8(0x10)
	char pad_7D8[0xb8]; // 0x7d8(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x890(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x8a0(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x8b0(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x8c0(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x8d0(0x10)
	char pad_8E0[0x10]; // 0x8e0(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x8f0(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x900(0x10)
	struct FMulticastDelegate OnClicked; // 0x910(0x10)
	struct FMulticastDelegate OnReleased; // 0x920(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x930(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x940(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x950(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x960(0x10)
	char pad_970[0x28]; // 0x970(0x28)
	struct UPrimitiveComponent* *e6a95e2ca0; // 0x998(0x08)
	struct UPrimitiveComponent* *7982e5317b; // 0x9a0(0x08)
	struct F*3a1b9f6b9c *601e25c40b; // 0x9a8(0x58)
	char pad_A00[0x10]; // 0xa00(0x10)

	float SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x66a2528
	struct FVector *dfbae66789(); // Function Engine.PrimitiveComponent.*dfbae66789 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6692ba4
	bool *0a6204477c(); // Function Engine.PrimitiveComponent.*0a6204477c // Final|Native|Public|BlueprintCallable // @ game+0x66a73c0
	struct TArray<struct UPrimitiveComponent*> *eb52f532a5(); // Function Engine.PrimitiveComponent.*eb52f532a5 // Final|Native|Public|BlueprintCallable // @ game+0x668ca0c
	enum class ECollisionEnabled *ea3f9e2cf3(); // Function Engine.PrimitiveComponent.*ea3f9e2cf3 // Native|Public|BlueprintCallable // @ game+0xc4a510
	int32 *c074a79845(); // Function Engine.PrimitiveComponent.*c074a79845 // Final|Native|Public|BlueprintCallable // @ game+0x66a46b0
	enum class ECollisionEnabled *6ee3451862(); // Function Engine.PrimitiveComponent.*6ee3451862 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691330
	float *44a43b0322(); // Function Engine.PrimitiveComponent.*44a43b0322 // Final|Native|Public|BlueprintCallable // @ game+0x66a4618
	bool SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0x66a5fe0
	enum class *dc75936d4b *e9ee2ab3a1(); // Function Engine.PrimitiveComponent.*e9ee2ab3a1 // Final|Native|Public|BlueprintCallable // @ game+0x66a4740
	bool *4e7d139cf0(); // Function Engine.PrimitiveComponent.*4e7d139cf0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a464
	bool *5cb343a96e(); // Function Engine.PrimitiveComponent.*5cb343a96e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6688f28
	bool *f94dd47839(); // Function Engine.PrimitiveComponent.*f94dd47839 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a438
	bool *13b1364c95(); // Function Engine.PrimitiveComponent.*13b1364c95 // Native|Public|BlueprintCallable // @ game+0x66966e4
	struct UMaterialInterface* *b87315fc50(); // Function Engine.PrimitiveComponent.*b87315fc50 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693c38
	struct FVector GetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6694e78
	bool *2a4abc706a(); // Function Engine.PrimitiveComponent.*2a4abc706a // Final|Native|Public|BlueprintCallable // @ game+0x66963cc
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x668cc74
	struct FName AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6687a1c
	struct FVector *93488147e1(); // Function Engine.PrimitiveComponent.*93488147e1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6690edc
	struct FName SetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xbb1b94
	float SetMassScale(); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x59aecc4
	int32 *30938d503c(); // Function Engine.PrimitiveComponent.*30938d503c // Final|Native|Public|BlueprintCallable // @ game+0x66a7db0
	struct F*a92203063d *379b1e37e1(); // Function Engine.PrimitiveComponent.*379b1e37e1 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66a8754
	enum class ECollisionResponse *21a20b6c62(); // Function Engine.PrimitiveComponent.*21a20b6c62 // Native|Public|BlueprintCallable // @ game+0x66a3fa8
	bool AddForce(); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x668723c
	bool *ccd28ea01f(); // Function Engine.PrimitiveComponent.*ccd28ea01f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x668811c
	bool *5b987becac(); // Function Engine.PrimitiveComponent.*5b987becac // Native|Public|BlueprintCallable // @ game+0x78572c
	struct FVector *b8234e2743(); // Function Engine.PrimitiveComponent.*b8234e2743 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669f008
	bool *bea52685d2(); // Function Engine.PrimitiveComponent.*bea52685d2 // Native|Public|BlueprintCallable // @ game+0x66a5eb4
	bool *30924b231e(); // Function Engine.PrimitiveComponent.*30924b231e // Final|Native|Public|BlueprintCallable // @ game+0x66a675c
	bool AddImpulse(); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66878dc
	struct FName AddForceAtLocationLocal(); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66874c8
	struct UClass* GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6694774
	struct FName SetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xc2cd14
	enum class ECollisionResponse *465dde8592(); // Function Engine.PrimitiveComponent.*465dde8592 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66913b8
	enum class ECollisionChannel *dbe4b0a4e1(); // Function Engine.PrimitiveComponent.*dbe4b0a4e1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691358
	float *d2ee8cd4c7(); // Function Engine.PrimitiveComponent.*d2ee8cd4c7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693b78
	struct TArray<struct F*993c37b57d> *736adad895(); // Function Engine.PrimitiveComponent.*736adad895 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66945cc
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x668c984
	void *fcf556dc5a(); // Function Engine.PrimitiveComponent.*fcf556dc5a // Final|Native|Public|BlueprintCallable // @ game+0x6689550
	float *090f50e275(); // Function Engine.PrimitiveComponent.*090f50e275 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669025c
	bool K2_LineTraceComponent(); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669a4c8
	struct FName *6071051144(); // Function Engine.PrimitiveComponent.*6071051144 // Native|Public|BlueprintCallable // @ game+0x66a8054
	bool AddAngularImpulse(); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6686968
	bool *fd96d57958(); // Function Engine.PrimitiveComponent.*fd96d57958 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696f3c
	struct UMaterialInterface* *b3a3c00bbd(); // Function Engine.PrimitiveComponent.*b3a3c00bbd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693cdc
	enum class EDOFMode *c851d0aa12(); // Function Engine.PrimitiveComponent.*c851d0aa12 // Native|Public|BlueprintCallable // @ game+0x66a5c44
	struct FName *3292c0b7df(); // Function Engine.PrimitiveComponent.*3292c0b7df // Native|Public|BlueprintCallable // @ game+0x66a3e7c
	void *70595e1cd6(); // Function Engine.PrimitiveComponent.*70595e1cd6 // Final|Native|Public|BlueprintCallable // @ game+0x668956c
	enum class ECollisionChannel SetCollisionObjectType(); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x66a3de4
	enum class ECollisionResponse *e5ffb56c9a(); // Function Engine.PrimitiveComponent.*e5ffb56c9a // Native|Public|BlueprintCallable // @ game+0x66a3f10
	bool *7b7fd27d02(); // Function Engine.PrimitiveComponent.*7b7fd27d02 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66a2298
	bool *256ba244cc(); // Function Engine.PrimitiveComponent.*256ba244cc // Native|Public|BlueprintCallable // @ game+0x66a66c4
	struct FName SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x66a6b34
	bool *7923455fa2(); // Function Engine.PrimitiveComponent.*7923455fa2 // Final|Native|Public|BlueprintCallable // @ game+0x66a6944
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x668ca94
	float *44661dddcf(); // Function Engine.PrimitiveComponent.*44661dddcf // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693a18
	bool *a652adf220(); // Function Engine.PrimitiveComponent.*a652adf220 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696ba4
	float *c8a9007ebc(); // Function Engine.PrimitiveComponent.*c8a9007ebc // Final|Native|Public|BlueprintCallable // @ game+0x66a36f0
	struct FName *b92ee3b9c0(); // Function Engine.PrimitiveComponent.*b92ee3b9c0 // Native|Public|BlueprintCallable // @ game+0x66a9cac
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x668cb84
	struct TArray<struct UPrimitiveComponent*> GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x669496c
	int32 *d4294e3947(); // Function Engine.PrimitiveComponent.*d4294e3947 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694498
	bool *009c0f2a1d(); // Function Engine.PrimitiveComponent.*009c0f2a1d // Final|Native|Public|BlueprintCallable // @ game+0x66a732c
	float *cdfb4b1220(); // Function Engine.PrimitiveComponent.*cdfb4b1220 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66911d4
	float SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x6686bec
	bool AddTorque(); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66887b0
	enum class EDOFMode *ebf54e58f9(); // Function Engine.PrimitiveComponent.*ebf54e58f9 // Native|Public|BlueprintCallable // @ game+0x66a4480
	struct F*a92203063d *6dba8b25b2(); // Function Engine.PrimitiveComponent.*6dba8b25b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696208
	struct FName *fc6fe4c940(); // Function Engine.PrimitiveComponent.*fc6fe4c940 // Final|Native|Public|BlueprintCallable // @ game+0x6691380
	bool *3d4f5f6da1(); // Function Engine.PrimitiveComponent.*3d4f5f6da1 // Final|Native|Public|BlueprintCallable // @ game+0x66962ec
	struct UPhysicalMaterial* *794ecded84(); // Function Engine.PrimitiveComponent.*794ecded84 // Native|Public|BlueprintCallable // @ game+0x66a6aa0
	void *e83e82c836(); // Function Engine.PrimitiveComponent.*e83e82c836 // Native|Public|BlueprintCallable // @ game+0x66a9c94
	struct FVector *fb3c2a98a1(); // Function Engine.PrimitiveComponent.*fb3c2a98a1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6694f28
	struct FName *e336185bf8(); // Function Engine.PrimitiveComponent.*e336185bf8 // Final|Native|Public|BlueprintCallable // @ game+0x669e588
	bool *da08b8ba8d(); // Function Engine.PrimitiveComponent.*da08b8ba8d // Native|Public|BlueprintCallable // @ game+0x66a49f0
	bool *473e1da61e(); // Function Engine.PrimitiveComponent.*473e1da61e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696fdc
	struct FName SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a3a74
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693b4c
	bool *78f7d5ad87(); // Function Engine.PrimitiveComponent.*78f7d5ad87 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66882f0
	bool *e2737e7e29(); // Function Engine.PrimitiveComponent.*e2737e7e29 // Final|Native|Public|BlueprintCallable // @ game+0x66a3948
	bool SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a2390
	bool *9594116b12(); // Function Engine.PrimitiveComponent.*9594116b12 // Final|Native|Public|BlueprintCallable // @ game+0x66a7298
	struct UMaterialInterface* *bf796448cc(); // Function Engine.PrimitiveComponent.*bf796448cc // Native|Public|BlueprintCallable // @ game+0x66a6104
	float *5aa27e0388(); // Function Engine.PrimitiveComponent.*5aa27e0388 // Native|Public|BlueprintCallable // @ game+0x669d184
	bool *b9d962ff83(); // Function Engine.PrimitiveComponent.*b9d962ff83 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a494
	struct FName AddForceAtLocation(); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x668737c
	struct FVector GetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xc90684
	bool *84914014a9(); // Function Engine.PrimitiveComponent.*84914014a9 // Native|Public|BlueprintCallable // @ game+0x66a2490
};

// Class Engine.MeshComponent
// Size: 0xb10 (Inherited: 0xa10)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0xa08(0x10)
	char pad_A20[0xf0]; // 0xa20(0xf0)

	struct TArray<struct FName> *489b9cbe67(); // Function Engine.MeshComponent.*489b9cbe67 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693e28
	struct TArray<struct UMaterialInterface*> *0b87d25dc2(); // Function Engine.MeshComponent.*0b87d25dc2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693eb4
	struct FVector *b78c042dcb(); // Function Engine.MeshComponent.*b78c042dcb // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x73cf6c
	int32 *199deabfb3(); // Function Engine.MeshComponent.*199deabfb3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693d80
	bool *1aad846c30(); // Function Engine.MeshComponent.*1aad846c30 // Final|Native|Public|BlueprintCallable // @ game+0x73e5d8
	bool *84436b1e1a(); // Function Engine.MeshComponent.*84436b1e1a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696d54
};

// Class Engine.StaticMeshComponent
// Size: 0xbb0 (Inherited: 0xb10)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xb10(0x04)
	int32 *90bd71ffae; // 0xb14(0x04)
	bool bOverrideMinLOD; // 0xb18(0x01)
	char pad_B19[0x3]; // 0xb19(0x03)
	int32 MinLOD; // 0xb1c(0x04)
	struct UStaticMesh* StaticMesh; // 0xb20(0x08)
	bool bOverrideWireframeColor; // 0xb28(0x01)
	char pad_B29[0x3]; // 0xb29(0x03)
	struct FColor WireframeColorOverride; // 0xb2c(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xb30(0x10)
	char *7e2d9548d8 : 1; // 0xb40(0x01)
	char *8338f52a12 : 1; // 0xb40(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xb40(0x01)
	char *1ee48c2b08 : 1; // 0xb40(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xb40(0x01)
	char bOverrideLightMapRes : 1; // 0xb40(0x01)
	char pad_B40_6 : 2; // 0xb40(0x01)
	char pad_B41[0x3]; // 0xb41(0x03)
	int32 OverriddenLightMapRes; // 0xb44(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xb48(0x01)
	char pad_B48_1 : 7; // 0xb48(0x01)
	char pad_B49[0x3]; // 0xb49(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xb4c(0x04)
	float StreamingDistanceMultiplier; // 0xb50(0x04)
	int32 *af073d6e42; // 0xb54(0x04)
	char *3af970e567 : 1; // 0xb58(0x01)
	char pad_B58_1 : 7; // 0xb58(0x01)
	char pad_B59[0x7]; // 0xb59(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xb60(0x10)
	struct TArray<struct F*36c5fc3da1> *a09dd6c691; // 0xb70(0x10)
	struct TArray<struct F*110531103f> *ba85d1c43d; // 0xb80(0x10)
	bool *51bf197520; // 0xb90(0x01)
	char pad_B91[0x3]; // 0xb91(0x03)
	struct F*25888ccc71 LightmassSettings; // 0xb94(0x18)
	char pad_BAC[0x4]; // 0xbac(0x04)

	bool SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x6150604
	struct UStaticMesh* OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x669d418
	int32 *f07c990051(); // Function Engine.StaticMeshComponent.*f07c990051 // Final|Native|Public|BlueprintCallable // @ game+0x66a4cd0
	struct FVector *bd3a17aa7c(); // Function Engine.StaticMeshComponent.*bd3a17aa7c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6693a44
};

// Class Engine.SkinnedMeshComponent
// Size: 0xcb0 (Inherited: 0xb10)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xb10(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xb18(0x08)
	char pad_B20[0x60]; // 0xb20(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb80(0x01)
	char pad_B80_1 : 7; // 0xb80(0x01)
	char pad_B81[0x7]; // 0xb81(0x07)
	struct TArray<struct FBoxSphereBounds> *3dbfb27017; // 0xb88(0x10)
	char pad_B98[0x20]; // 0xb98(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xbb8(0x08)
	int32 ForcedLodModel; // 0xbc0(0x04)
	int32 MinLodModel; // 0xbc4(0x04)
	char pad_BC8[0x10]; // 0xbc8(0x10)
	struct TArray<struct F*30fe3c2ae3> LODInfo; // 0xbd8(0x10)
	float StreamingDistanceMultiplier; // 0xbe8(0x04)
	struct FColor WireframeColor; // 0xbec(0x04)
	char *659560d097 : 1; // 0xbf0(0x01)
	char *475e008585 : 1; // 0xbf0(0x01)
	char bDisableMorphTarget : 1; // 0xbf0(0x01)
	char *47c3b74fa9 : 1; // 0xbf0(0x01)
	char pad_BF0_4 : 4; // 0xbf0(0x01)
	char pad_BF1[0x17]; // 0xbf1(0x17)
	char bPerBoneMotionBlur : 1; // 0xc08(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xc08(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xc08(0x01)
	char bSyncAttachParentLOD : 1; // 0xc08(0x01)
	char pad_C08_4 : 4; // 0xc08(0x01)
	char pad_C09[0x3]; // 0xc09(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xc0c(0x01)
	char pad_C0D[0x3]; // 0xc0d(0x03)
	char *ed8b7c0cd1 : 1; // 0xc10(0x01)
	char *2dec0d4b3d : 1; // 0xc10(0x01)
	char *d7ee5beccf : 1; // 0xc10(0x01)
	char pad_C10_3 : 5; // 0xc10(0x01)
	char pad_C11[0x3]; // 0xc11(0x03)
	bool *7205949c98; // 0xc14(0x01)
	char pad_C15[0x3]; // 0xc15(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xc18(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xc18(0x01)
	char pad_C18_2 : 6; // 0xc18(0x01)
	char pad_C19[0x3]; // 0xc19(0x03)
	char bRenderStatic : 1; // 0xc1c(0x01)
	char pad_C1C_1 : 7; // 0xc1c(0x01)
	char pad_C1D[0x3]; // 0xc1d(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xc20(0x04)
	char *5d608d2726 : 1; // 0xc24(0x01)
	char pad_C24_1 : 7; // 0xc24(0x01)
	char pad_C25[0xf]; // 0xc25(0x0f)
	struct FBoxSphereBounds *e8aa361390; // 0xc34(0x1c)
	bool *3db651bce3; // 0xc50(0x01)
	bool bEnableUpdateRateOptimizations; // 0xc51(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xc52(0x01)
	char pad_C53[0x4e]; // 0xc53(0x4e)
	bool *c6d2b441e6; // 0xca1(0x01)
	bool *2b84848e75; // 0xca2(0x01)
	char pad_CA3[0xd]; // 0xca3(0x0d)

	struct FRotator *a9b796c1d6(); // Function Engine.SkinnedMeshComponent.*a9b796c1d6 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67033c0
	int32 GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66c774c
	struct TArray<struct F*23058e4b65> SetSkinWeightOverride(); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66f6d28
	struct FName *7a5bcec032(); // Function Engine.SkinnedMeshComponent.*7a5bcec032 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66c7a08
	struct TArray<struct FLinearColor> *bb2cf533fa(); // Function Engine.SkinnedMeshComponent.*bb2cf533fa // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66f9eb8
	struct FName *9b95cbd08f(); // Function Engine.SkinnedMeshComponent.*9b95cbd08f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cff54
	bool *ec630a3bd7(); // Function Engine.SkinnedMeshComponent.*ec630a3bd7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66b452c
	bool *b420fb9e25(); // Function Engine.SkinnedMeshComponent.*b420fb9e25 // Native|Public|BlueprintCallable // @ game+0x66f57e4
	struct FName *81bb09f3f1(); // Function Engine.SkinnedMeshComponent.*81bb09f3f1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c4458
	int32 *422993eabc(); // Function Engine.SkinnedMeshComponent.*422993eabc // Final|Native|Public|BlueprintCallable // @ game+0x66f1b74
	enum class *a843b4c86f *c29b32cdeb(); // Function Engine.SkinnedMeshComponent.*c29b32cdeb // Final|Native|Public|BlueprintCallable // @ game+0x66d48b4
	int32 *cfda61cd72(); // Function Engine.SkinnedMeshComponent.*cfda61cd72 // Final|Native|Public|BlueprintCallable // @ game+0x66f48ac
	float *572be15f1a(); // Function Engine.SkinnedMeshComponent.*572be15f1a // Final|Native|Public|BlueprintCallable // @ game+0x66ede00
	bool *0a10b2cd0f(); // Function Engine.SkinnedMeshComponent.*0a10b2cd0f // Final|Native|Public|BlueprintCallable // @ game+0x66d5f3c
	struct FName *7468ce33f2(); // Function Engine.SkinnedMeshComponent.*7468ce33f2 // Final|Native|Public|BlueprintCallable // @ game+0x67035f8
	struct USkinnedMeshComponent* *ebab473a5d(); // Function Engine.SkinnedMeshComponent.*ebab473a5d // Final|Native|Public|BlueprintCallable // @ game+0x66f477c
	bool SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x66f6bb4
	int32 *fc7b44b1d1(); // Function Engine.SkinnedMeshComponent.*fc7b44b1d1 // Final|Native|Public|BlueprintCallable // @ game+0x66bba6c
	bool *92816e14f0(); // Function Engine.SkinnedMeshComponent.*92816e14f0 // Final|Native|Public|BlueprintCallable // @ game+0x66ee2b0
	bool *2a5d8e52d6(); // Function Engine.SkinnedMeshComponent.*2a5d8e52d6 // Final|Native|Public|BlueprintCallable // @ game+0x66f6714
	struct FRotator *64cb181e22(); // Function Engine.SkinnedMeshComponent.*64cb181e22 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6702fec
	bool *381741b6ee(); // Function Engine.SkinnedMeshComponent.*381741b6ee // Final|Native|Public|BlueprintCallable // @ game+0x66ee360
	int32 *9f5953896a(); // Function Engine.SkinnedMeshComponent.*9f5953896a // Final|Native|Public|BlueprintCallable // @ game+0x66bb704
	struct FName *27a259593c(); // Function Engine.SkinnedMeshComponent.*27a259593c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cd8a0
	int32 *03205eb86e(); // Function Engine.SkinnedMeshComponent.*03205eb86e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cd140
};

// Class Engine.SkeletalMeshComponent
// Size: 0x11a0 (Inherited: 0xcb0)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xcb0(0x08)
	struct UClass* AnimClass; // 0xcb8(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xcc0(0x08)
	struct TArray<struct UAnimInstance*> *cac389782e; // 0xcc8(0x10)
	struct UAnimInstance* *0f41b41bc6; // 0xcd8(0x08)
	struct F*795231f53f AnimationData; // 0xce0(0x18)
	char pad_CF8[0x30]; // 0xcf8(0x30)
	struct TArray<struct FTransform> *30c04377c4; // 0xd28(0x10)
	struct TArray<struct FTransform> *48246de69f; // 0xd38(0x10)
	char pad_D48[0x20]; // 0xd48(0x20)
	float GlobalAnimRateScale; // 0xd68(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd6c(0x01)
	enum class *6b7dd1323d PhysicsTransformUpdateMode; // 0xd6d(0x01)
	char pad_D6E[0x1]; // 0xd6e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd6f(0x01)
	char pad_D70[0x4]; // 0xd70(0x04)
	char pad_D74_0 : 1; // 0xd74(0x01)
	char *cd629f2904 : 1; // 0xd74(0x01)
	char pad_D74_2 : 1; // 0xd74(0x01)
	char *368f830df6 : 1; // 0xd74(0x01)
	char pad_D74_4 : 2; // 0xd74(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd74(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd74(0x01)
	char bDisableClothSimulation : 1; // 0xd75(0x01)
	char pad_D75_1 : 2; // 0xd75(0x01)
	char bCollideWithEnvironment : 1; // 0xd75(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd75(0x01)
	char bLocalSpaceSimulation : 1; // 0xd75(0x01)
	char *9d5f911249 : 1; // 0xd75(0x01)
	char bResetAfterTeleport : 1; // 0xd75(0x01)
	char pad_D76_0 : 1; // 0xd76(0x01)
	char bNoSkeletonUpdate : 1; // 0xd76(0x01)
	char bPauseAnims : 1; // 0xd76(0x01)
	char *5576a9afdf : 1; // 0xd76(0x01)
	char bEnablePerPolyCollision : 1; // 0xd76(0x01)
	char *e60af2509a : 1; // 0xd76(0x01)
	char *1dcbaec13b : 1; // 0xd76(0x01)
	char *639b831db9 : 1; // 0xd76(0x01)
	char *a5d9754d88 : 1; // 0xd77(0x01)
	char *31549101df : 1; // 0xd77(0x01)
	char *dfe8dc6b1c : 1; // 0xd77(0x01)
	char *ec824e2227 : 1; // 0xd77(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd77(0x01)
	char *3f60233fd2 : 1; // 0xd77(0x01)
	char pad_D77_6 : 2; // 0xd77(0x01)
	char *de7a769060 : 1; // 0xd78(0x01)
	char pad_D78_1 : 7; // 0xd78(0x01)
	char pad_D79_0 : 2; // 0xd79(0x01)
	char bDefaultLooping : 1; // 0xd79(0x01)
	char bDefaultPlaying : 1; // 0xd79(0x01)
	char pad_D79_4 : 4; // 0xd79(0x01)
	uint16 *4f3e8a52f4; // 0xd7a(0x02)
	float ClothBlendWeight; // 0xd7c(0x04)
	struct FVector *a7427fc46d; // 0xd80(0x0c)
	char pad_D8C[0x4]; // 0xd8c(0x04)
	struct UBodySetup* BodySetup; // 0xd90(0x08)
	float TeleportDistanceThreshold; // 0xd98(0x04)
	float TeleportRotationThreshold; // 0xd9c(0x04)
	struct FVector *769ee627e3; // 0xda0(0x0c)
	char pad_DAC[0x4]; // 0xdac(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xdb0(0x10)
	char pad_DC0[0xe0]; // 0xdc0(0xe0)
	struct UClass* *aefcf253a9; // 0xea0(0x08)
	char pad_EA8[0x1e8]; // 0xea8(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1090(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1098(0x08)
	float DefaultPosition; // 0x10a0(0x04)
	float DefaultPlayRate; // 0x10a4(0x04)
	uint32 *95fd69c2cb; // 0x10a8(0x04)
	float *b5cc14a665; // 0x10ac(0x04)
	char pad_10B0[0xf0]; // 0x10b0(0xf0)

	struct FName *c56b07f144(); // Function Engine.SkeletalMeshComponent.*c56b07f144 // Final|Native|Public|BlueprintCallable // @ game+0x66f05cc
	bool *a9bd8ab703(); // Function Engine.SkeletalMeshComponent.*a9bd8ab703 // Final|Native|Public|BlueprintCallable // @ game+0xc2e2a8
	bool *9dddf56a91(); // Function Engine.SkeletalMeshComponent.*9dddf56a91 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d476c
	struct FPoseSnapshot *50d1a575e9(); // Function Engine.SkeletalMeshComponent.*50d1a575e9 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66fc99c
	struct FName *d3ad1def60(); // Function Engine.SkeletalMeshComponent.*d3ad1def60 // Native|Public|BlueprintCallable // @ game+0x66eceb4
	float *f6964fda19(); // Function Engine.SkeletalMeshComponent.*f6964fda19 // Final|Native|Public|BlueprintCallable // @ game+0x66e36d4
	float *021885e3b0(); // Function Engine.SkeletalMeshComponent.*021885e3b0 // Final|Native|Public|BlueprintCallable // @ game+0x66eb66c
	float *e433eef528(); // Function Engine.SkeletalMeshComponent.*e433eef528 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66c791c
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x9dd088
	struct UAnimInstance* *930fde712a(); // Function Engine.SkeletalMeshComponent.*930fde712a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc9b1ec
	bool *24e946edb2(); // Function Engine.SkeletalMeshComponent.*24e946edb2 // Final|Native|Public|BlueprintCallable // @ game+0x66eb0a8
	void *614f873041(); // Function Engine.SkeletalMeshComponent.*614f873041 // Final|Native|Public|BlueprintCallable // @ game+0x66bb654
	bool *ad01a8f0e8(); // Function Engine.SkeletalMeshComponent.*ad01a8f0e8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66ae5dc
	void *0f98d962fe(); // Function Engine.SkeletalMeshComponent.*0f98d962fe // Final|Native|Public|BlueprintCallable // @ game+0x66b3278
	bool *40da40db84(); // Function Engine.SkeletalMeshComponent.*40da40db84 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66adcc4
	bool *6365012393(); // Function Engine.SkeletalMeshComponent.*6365012393 // Final|Native|Public|BlueprintCallable // @ game+0x6703688
	bool *3e29b8164e(); // Function Engine.SkeletalMeshComponent.*3e29b8164e // Final|Native|Public|BlueprintCallable // @ game+0x66d5e8c
	enum class EAnimationMode *29dcd8040f(); // Function Engine.SkeletalMeshComponent.*29dcd8040f // Final|Native|Public|BlueprintCallable // @ game+0x9dcf8c
	bool *6a167b3650(); // Function Engine.SkeletalMeshComponent.*6a167b3650 // Final|Native|Public|BlueprintCallable // @ game+0x66eede0
	float *41e4010056(); // Function Engine.SkeletalMeshComponent.*41e4010056 // Final|Native|Public|BlueprintCallable // @ game+0x66c8050
	bool *69cff9aed5(); // Function Engine.SkeletalMeshComponent.*69cff9aed5 // Final|Native|Public|BlueprintCallable // @ game+0x66d6008
	void *d434eea481(); // Function Engine.SkeletalMeshComponent.*d434eea481 // Final|Native|Public|BlueprintCallable // @ game+0x66c5e30
	struct UAnimInstance* *c03f41b0aa(); // Function Engine.SkeletalMeshComponent.*c03f41b0aa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66ce398
	void *3462fbfb5c(); // Function Engine.SkeletalMeshComponent.*3462fbfb5c // Final|Native|Public|BlueprintCallable // @ game+0x66e9268
	struct FName *d9e7603b72(); // Function Engine.SkeletalMeshComponent.*d9e7603b72 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66b7224
	bool SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x66f5eb0
	bool *5ae2ffaa34(); // Function Engine.SkeletalMeshComponent.*5ae2ffaa34 // Final|Native|Public|BlueprintCallable // @ game+0x66f4b78
	bool *f74f280075(); // Function Engine.SkeletalMeshComponent.*f74f280075 // Final|Native|Public|BlueprintCallable // @ game+0x66f06b8
	struct UClass* SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x66ec0cc
	void *1d57b1bb52(); // Function Engine.SkeletalMeshComponent.*1d57b1bb52 // Final|Native|Public|BlueprintCallable // @ game+0x66c5e18
	float *23d2ba5196(); // Function Engine.SkeletalMeshComponent.*23d2ba5196 // Final|Native|Public|BlueprintCallable // @ game+0x66ee980
	float *6e1429b48f(); // Function Engine.SkeletalMeshComponent.*6e1429b48f // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66c84c8
	bool *c1767223e2(); // Function Engine.SkeletalMeshComponent.*c1767223e2 // Final|Native|Public|BlueprintCallable // @ game+0x5937e38
	struct FVector *cbc612e27a(); // Function Engine.SkeletalMeshComponent.*cbc612e27a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cff20
	float *9f9a8070a6(); // Function Engine.SkeletalMeshComponent.*9f9a8070a6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cd044
	bool *7f135ecfd6(); // Function Engine.SkeletalMeshComponent.*7f135ecfd6 // Final|Native|Public|BlueprintCallable // @ game+0x66eb1ec
	bool *de6402c79a(); // Function Engine.SkeletalMeshComponent.*de6402c79a // Final|Native|Public|BlueprintCallable // @ game+0x66f097c
	bool *40e7e573ca(); // Function Engine.SkeletalMeshComponent.*40e7e573ca // Native|Public|BlueprintCallable // @ game+0x66f5004
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66ce054
	bool Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0x9dd2b0
	bool *71482262f9(); // Function Engine.SkeletalMeshComponent.*71482262f9 // Final|Native|Public|BlueprintCallable // @ game+0x66eaf28
	bool *84cfacb4c2(); // Function Engine.SkeletalMeshComponent.*84cfacb4c2 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66eacf0
	bool *c5a6bc927d(); // Function Engine.SkeletalMeshComponent.*c5a6bc927d // Final|Native|Public|BlueprintCallable // @ game+0x66eef10
	float *185f746e31(); // Function Engine.SkeletalMeshComponent.*185f746e31 // Final|Native|Public|BlueprintCallable // @ game+0x66f58c8
	void *dc39210b5a(); // Function Engine.SkeletalMeshComponent.*dc39210b5a // Final|Native|Public|BlueprintCallable // @ game+0x66e953c
	struct UAnimationAsset* SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x9dd23c
	float SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0x9dd128
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cdafc
	bool *96095d2473(); // Function Engine.SkeletalMeshComponent.*96095d2473 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d7070
	bool *a330220722(); // Function Engine.SkeletalMeshComponent.*a330220722 // Final|Native|Public|BlueprintCallable // @ game+0x66eae94
	bool PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x66e4214
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d6574
	enum class EAnimationMode *3033d50dc7(); // Function Engine.SkeletalMeshComponent.*3033d50dc7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66c6ff0
	bool *51412c4656(); // Function Engine.SkeletalMeshComponent.*51412c4656 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x9c8208
	void *37329cc52f(); // Function Engine.SkeletalMeshComponent.*37329cc52f // Final|Native|Public|BlueprintCallable // @ game+0x6702334
	void *a26539e1ba(); // Function Engine.SkeletalMeshComponent.*a26539e1ba // Final|Native|Public|BlueprintCallable // @ game+0x66e91c4
	bool *e7aa7d7da3(); // Function Engine.SkeletalMeshComponent.*e7aa7d7da3 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66ae448
	struct FName *6e324d9bce(); // Function Engine.SkeletalMeshComponent.*6e324d9bce // Final|Native|Public|BlueprintCallable // @ game+0x66c4a60
};

// Class Engine.*3ea9fa89b4
// Size: 0x38 (Inherited: 0x30)
struct U*3ea9fa89b4 : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.*468963f0bd
// Size: 0x38 (Inherited: 0x38)
struct U*468963f0bd : U*3ea9fa89b4 {
};

// Class Engine.*6273c6b474
// Size: 0x30 (Inherited: 0x30)
struct U*6273c6b474 : UObject {
};

// Class Engine.*271a14efcc
// Size: 0x48 (Inherited: 0x30)
struct U*271a14efcc : UObject {
	char bCausedByWorld : 1; // 0x30(0x01)
	char bScaleMomentumByMass : 1; // 0x30(0x01)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char pad_30_3 : 5; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DamageImpulse; // 0x34(0x04)
	float DestructibleImpulse; // 0x38(0x04)
	float DestructibleDamageSpreadScale; // 0x3c(0x04)
	float DamageFalloff; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.MovementComponent
// Size: 0x250 (Inherited: 0x200)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x200(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x208(0x08)
	char pad_210[0x4]; // 0x210(0x04)
	struct FVector Velocity; // 0x214(0x0c)
	char bConstrainToPlane : 1; // 0x220(0x01)
	char bSnapToPlaneAtStart : 1; // 0x220(0x01)
	char pad_220_2 : 6; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	enum class EPlaneConstraintAxisSetting *7ab4b5f3c1; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	struct FVector PlaneConstraintNormal; // 0x228(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x234(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x240(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x240(0x01)
	char bTickBeforeOwner : 1; // 0x240(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x240(0x01)
	char pad_240_4 : 4; // 0x240(0x01)
	char pad_241[0xf]; // 0x241(0x0f)

	struct FVector *804d12d910(); // Function Engine.MovementComponent.*804d12d910 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669509c
	struct APhysicsVolume* PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0xa9ff48
	bool *d248a1aaae(); // Function Engine.MovementComponent.*d248a1aaae // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696aa8
	void *c1398b37a6(); // Function Engine.MovementComponent.*c1398b37a6 // Native|Public|BlueprintCallable // @ game+0x66a9674
	float *053425dd63(); // Function Engine.MovementComponent.*053425dd63 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693fc4
	struct USceneComponent* *92a97de1ad(); // Function Engine.MovementComponent.*92a97de1ad // Native|Public|BlueprintCallable // @ game+0x66a7fc0
	struct FVector *833d7039fe(); // Function Engine.MovementComponent.*833d7039fe // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668c61c
	struct FVector *0332c73f2c(); // Function Engine.MovementComponent.*0332c73f2c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a6d94
	enum class EPlaneConstraintAxisSetting *2fea06ffbc(); // Function Engine.MovementComponent.*2fea06ffbc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695084
	bool *878acd980b(); // Function Engine.MovementComponent.*878acd980b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669a834
	struct FVector ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668c6e4
	void *1c513777e4(); // Function Engine.MovementComponent.*1c513777e4 // Native|Public|BlueprintCallable // @ game+0x66a8d24
	enum class EPlaneConstraintAxisSetting *9f3eaf5b59(); // Function Engine.MovementComponent.*9f3eaf5b59 // Native|Public|BlueprintCallable // @ game+0x66a6c68
	float K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a124
	struct FVector *052621d1b5(); // Function Engine.MovementComponent.*052621d1b5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668c7ac
	struct FVector *70244a322f(); // Function Engine.MovementComponent.*70244a322f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a6f44
	struct FVector *6e8e2e686e(); // Function Engine.MovementComponent.*6e8e2e686e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66950c4
	struct FVector *fd2eb42e11(); // Function Engine.MovementComponent.*fd2eb42e11 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a6ea0
	bool *2607cf7854(); // Function Engine.MovementComponent.*2607cf7854 // Native|Public|BlueprintCallable // @ game+0x66a6cfc
	struct APhysicsVolume* *0f7e9a03af(); // Function Engine.MovementComponent.*0f7e9a03af // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695038
	float K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a17c
	float *25a4009423(); // Function Engine.MovementComponent.*25a4009423 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691fd8
};

// Class Engine.NavMovementComponent
// Size: 0x280 (Inherited: 0x250)
struct UNavMovementComponent : UMovementComponent {
	struct F*4093962ce1 NavAgentProps; // 0x248(0x20)
	float *4bbf1eb9ad; // 0x268(0x04)
	char *90ca0dcfa9 : 1; // 0x26c(0x01)
	char bUseAccelerationForPaths : 1; // 0x26c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x26c(0x01)
	struct F*9f1f98e668 *af58b59ba5; // 0x270(0x04)
	char pad_278_3 : 5; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)

	bool IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696b54
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x66a9040
	void *b22af963f4(); // Function Engine.NavMovementComponent.*b22af963f4 // Final|Native|Public|BlueprintCallable // @ game+0x66a968c
	bool *e1ac14f9ef(); // Function Engine.NavMovementComponent.*e1ac14f9ef // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696a50
	bool *3b5df87a4f(); // Function Engine.NavMovementComponent.*3b5df87a4f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696b7c
	bool *89ecc9aaac(); // Function Engine.NavMovementComponent.*89ecc9aaac // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696e74
	bool *e7adbe771e(); // Function Engine.NavMovementComponent.*e7adbe771e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6697248
};

// Class Engine.PawnMovementComponent
// Size: 0x290 (Inherited: 0x280)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *9376ef64fb; // 0x280(0x08)
	char pad_288[0x8]; // 0x288(0x08)

	struct FVector *3d81af3a18(); // Function Engine.PawnMovementComponent.*3d81af3a18 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x668c874
	bool *6dd846560b(); // Function Engine.PawnMovementComponent.*6dd846560b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6687b68
	struct FVector *d8b516cdf6(); // Function Engine.PawnMovementComponent.*d8b516cdf6 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6694dd4
	struct FVector *b2a08a6a1d(); // Function Engine.PawnMovementComponent.*b2a08a6a1d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6693938
	struct FVector K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669a0f0
	bool *796d6f386f(); // Function Engine.PawnMovementComponent.*796d6f386f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696e4c
	struct APawn* *015cf4862c(); // Function Engine.PawnMovementComponent.*015cf4862c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694dbc
};

// Class Engine.CharacterMovementComponent
// Size: 0x930 (Inherited: 0x290)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_290[0x8]; // 0x290(0x08)
	struct ACharacter* *4938c83d2a; // 0x298(0x08)
	char bApplyGravityWhileJumping : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float GravityScale; // 0x2a4(0x04)
	float MaxStepHeight; // 0x2a8(0x04)
	float JumpZVelocity; // 0x2ac(0x04)
	float JumpOffJumpZFactor; // 0x2b0(0x04)
	float *dd15910807; // 0x2b4(0x04)
	float *5071bbe841; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	float *1aeeb67342; // 0x2c0(0x04)
	float *d1c2ea1058; // 0x2c4(0x04)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	enum class EMovementMode MovementMode; // 0x2d0(0x01)
	bool CustomMovementMode; // 0x2d1(0x01)
	char pad_2D2[0x1e]; // 0x2d2(0x1e)
	float GroundFriction; // 0x2f0(0x04)
	float MaxWalkSpeed; // 0x2f4(0x04)
	float MaxWalkSpeedCrouched; // 0x2f8(0x04)
	float MaxSwimSpeed; // 0x2fc(0x04)
	float MaxFlySpeed; // 0x300(0x04)
	float MaxCustomMovementSpeed; // 0x304(0x04)
	float MaxAcceleration; // 0x308(0x04)
	float BrakingFrictionFactor; // 0x30c(0x04)
	float BrakingFriction; // 0x310(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x314(0x01)
	char pad_314_1 : 7; // 0x314(0x01)
	char pad_315[0x3]; // 0x315(0x03)
	float BrakingDecelerationWalking; // 0x318(0x04)
	float BrakingDecelerationFalling; // 0x31c(0x04)
	float BrakingDecelerationSwimming; // 0x320(0x04)
	float BrakingDecelerationFlying; // 0x324(0x04)
	float AirControl; // 0x328(0x04)
	float AirControlBoostMultiplier; // 0x32c(0x04)
	float AirControlBoostVelocityThreshold; // 0x330(0x04)
	float FallingLateralFriction; // 0x334(0x04)
	float CrouchedHalfHeight; // 0x338(0x04)
	float PronedHalfHeight; // 0x33c(0x04)
	float PronedRadius; // 0x340(0x04)
	float Buoyancy; // 0x344(0x04)
	float PerchRadiusThreshold; // 0x348(0x04)
	float PerchAdditionalHeight; // 0x34c(0x04)
	struct FRotator RotationRate; // 0x350(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x35c(0x01)
	char bOrientRotationToMovement : 1; // 0x35c(0x01)
	char bSweepWhileNavWalking : 1; // 0x35c(0x01)
	char pad_35C_3 : 2; // 0x35c(0x01)
	char *377367ad67 : 1; // 0x35c(0x01)
	char *d391fd96a8 : 1; // 0x35c(0x01)
	char bForceMaxAccel : 1; // 0x35c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x35d(0x01)
	char bForceNextFloorCheck : 1; // 0x35d(0x01)
	char *114aa72bfd : 1; // 0x35d(0x01)
	char bCanWalkOffLedges : 1; // 0x35d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x35d(0x01)
	char pad_35D_5 : 2; // 0x35d(0x01)
	char *c2abb2c6d4 : 1; // 0x35d(0x01)
	char *cb30edb4d5 : 1; // 0x35e(0x01)
	char pad_35E_1 : 7; // 0x35e(0x01)
	char pad_35F[0x1]; // 0x35f(0x01)
	struct USceneComponent* *e932784708; // 0x360(0x08)
	float MaxOutOfWaterStepHeight; // 0x368(0x04)
	float OutofWaterZ; // 0x36c(0x04)
	float Mass; // 0x370(0x04)
	bool bEnablePhysicsInteraction; // 0x374(0x01)
	bool bTouchForceScaledToMass; // 0x375(0x01)
	bool bPushForceScaledToMass; // 0x376(0x01)
	bool bPushForceUsingZOffset; // 0x377(0x01)
	bool bScalePushForceToVelocity; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	float StandingDownwardForceScale; // 0x37c(0x04)
	float InitialPushForceFactor; // 0x380(0x04)
	float PushForceFactor; // 0x384(0x04)
	float PushForcePointZOffsetFactor; // 0x388(0x04)
	float TouchForceFactor; // 0x38c(0x04)
	float MinTouchForce; // 0x390(0x04)
	float MaxTouchForce; // 0x394(0x04)
	float RepulsionForce; // 0x398(0x04)
	char bForceBraking : 1; // 0x39c(0x01)
	char pad_39C_1 : 7; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	float CrouchedSpeedMultiplier; // 0x3a0(0x04)
	float UpperImpactNormalScale; // 0x3a4(0x04)
	struct FVector Acceleration; // 0x3a8(0x0c)
	struct FVector *f2cdf36f17; // 0x3b4(0x0c)
	struct FQuat *2344f9b1ba; // 0x3c0(0x10)
	struct FVector *3d5bc6c8e3; // 0x3d0(0x0c)
	float *1379983bf5; // 0x3dc(0x04)
	float *9b713bace2; // 0x3e0(0x04)
	float *32f74edb4a; // 0x3e4(0x04)
	struct FVector *53684725eb; // 0x3e8(0x0c)
	struct FVector *83c3dcb84b; // 0x3f4(0x0c)
	float *18b0dcf7ea; // 0x400(0x04)
	char pad_404[0x8]; // 0x404(0x08)
	float MaxSimulationTimeStep; // 0x40c(0x04)
	int32 MaxSimulationIterations; // 0x410(0x04)
	float MaxDepenetrationWithGeometry; // 0x414(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x418(0x04)
	float MaxDepenetrationWithPawn; // 0x41c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x420(0x04)
	float *bc7a9107d9; // 0x424(0x04)
	float *f468814d86; // 0x428(0x04)
	float *396f8361b7; // 0x42c(0x04)
	float *58c123bfd6; // 0x430(0x04)
	float *95b5d33d2f; // 0x434(0x04)
	float *1a782b9ac2; // 0x438(0x04)
	float *f5bbe755ef; // 0x43c(0x04)
	float *48231160a6; // 0x440(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float *dfc538dd63; // 0x448(0x04)
	float *6a6d42d7f4; // 0x44c(0x04)
	float *afadae7855; // 0x450(0x04)
	float *33d9b4fb8b; // 0x454(0x04)
	float LedgeCheckThreshold; // 0x458(0x04)
	float JumpOutOfWaterPitch; // 0x45c(0x04)
	struct F*3718d46421 CurrentFloor; // 0x460(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4f8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4f9(0x01)
	enum class EMovementMode *64d9549867; // 0x4fa(0x01)
	char pad_4FB[0x1]; // 0x4fb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityX : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityY : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4fc(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4fc(0x01)
	char bJustTeleported : 1; // 0x4fc(0x01)
	char *1f2fb81ea2 : 1; // 0x4fc(0x01)
	char *1f30f54ae9 : 1; // 0x4fc(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4fd(0x01)
	char bNotifyApex : 1; // 0x4fd(0x01)
	char *f36ca33c0e : 1; // 0x4fd(0x01)
	char bWantsToCrouch : 1; // 0x4fd(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4fd(0x01)
	char pad_4FD_5 : 3; // 0x4fd(0x01)
	char pad_4FE[0x2]; // 0x4fe(0x02)
	enum class EStanceMode StanceMode; // 0x500(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x501(0x01)
	char pad_502[0x2]; // 0x502(0x02)
	char bIgnoreBaseRotation : 1; // 0x504(0x01)
	char *e1b9431844 : 1; // 0x504(0x01)
	char bAlwaysCheckFloor : 1; // 0x504(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x504(0x01)
	char *eaba1e724f : 1; // 0x504(0x01)
	char *74c4a6681c : 1; // 0x504(0x01)
	char bUseRVOAvoidance : 1; // 0x504(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x504(0x01)
	char pad_505[0xf]; // 0x505(0x0f)
	char *64a1cb3dd6 : 1; // 0x514(0x01)
	char *cd0f91380a : 1; // 0x514(0x01)
	char *fbcb4f7122 : 1; // 0x514(0x01)
	char pad_514_3 : 2; // 0x514(0x01)
	char bProjectNavMeshWalking : 1; // 0x514(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x514(0x01)
	char pad_514_7 : 1; // 0x514(0x01)
	char pad_515[0x13]; // 0x515(0x13)
	float AvoidanceConsiderationRadius; // 0x528(0x04)
	struct FVector *71a3c5f6d6; // 0x52c(0x0c)
	int32 AvoidanceUID; // 0x538(0x04)
	struct F*f2710e04b9 AvoidanceGroup; // 0x53c(0x04)
	struct F*f2710e04b9 GroupsToAvoid; // 0x540(0x04)
	struct F*f2710e04b9 GroupsToIgnore; // 0x544(0x04)
	float AvoidanceWeight; // 0x548(0x04)
	struct FVector *e29a3efc6f; // 0x54c(0x0c)
	char pad_558[0xa8]; // 0x558(0xa8)
	float NavMeshProjectionInterval; // 0x600(0x04)
	float *7a0e85f2f7; // 0x604(0x04)
	float NavMeshProjectionInterpSpeed; // 0x608(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x60c(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x610(0x04)
	float NavWalkingFloorDistTolerance; // 0x614(0x04)
	char pad_618[0xb0]; // 0x618(0xb0)
	struct F*7d36dc8762 *f4c4231f71; // 0x6c8(0x58)
	char pad_720[0x10]; // 0x720(0x10)
	float *4df95f3c1b; // 0x730(0x04)
	char pad_734[0x4]; // 0x734(0x04)
	struct FRootMotionSourceGroup *d26ef8f08d; // 0x738(0x100)
	char pad_838[0x98]; // 0x838(0x98)
	struct F*77ba1cb021 *67f0cdfabe; // 0x8d0(0x40)
	struct FVector *45e1cf143e; // 0x910(0x0c)
	bool *a27368222e; // 0x91c(0x01)
	char pad_91D[0x3]; // 0x91d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x920(0x01)
	char pad_920_1 : 7; // 0x920(0x01)
	char pad_921[0xf]; // 0x921(0x0f)

	bool *f2e8aa35e0(); // Function Engine.CharacterMovementComponent.*f2e8aa35e0 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6697298
	struct F*f2710e04b9 *c70f537a0a(); // Function Engine.CharacterMovementComponent.*c70f537a0a // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66a51a4
	struct ACharacter* *e553325af3(); // Function Engine.CharacterMovementComponent.*e553325af3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6690f8c
	struct FVector *bc6abdde9a(); // Function Engine.CharacterMovementComponent.*bc6abdde9a // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x66a88c8
	float *e501ac931e(); // Function Engine.CharacterMovementComponent.*e501ac931e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693f6c
	bool *a38eeeca9f(); // Function Engine.CharacterMovementComponent.*a38eeeca9f // Native|Public|BlueprintCallable // @ game+0x66a6520
	float *14f1b49e8a(); // Function Engine.CharacterMovementComponent.*14f1b49e8a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a150
	bool AddImpulse(); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66877dc
	struct FVector *581baeac28(); // Function Engine.CharacterMovementComponent.*581baeac28 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6692b44
	float *b7442b5506(); // Function Engine.CharacterMovementComponent.*b7442b5506 // Final|Native|Public|BlueprintCallable // @ game+0x66a8624
	float *c4b8270fb7(); // Function Engine.CharacterMovementComponent.*c4b8270fb7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695ed8
	struct FVector *8b32685714(); // Function Engine.CharacterMovementComponent.*8b32685714 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6691c14
	bool *e6a8435a7d(); // Function Engine.CharacterMovementComponent.*e6a8435a7d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696e74
	float *e9b207e0ce(); // Function Engine.CharacterMovementComponent.*e9b207e0ce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693f98
	int32 *4c989de930(); // Function Engine.CharacterMovementComponent.*4c989de930 // Final|Native|Public|BlueprintCallable // @ game+0x66a2bf0
	float *43b516a96e(); // Function Engine.CharacterMovementComponent.*43b516a96e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a420
	struct UPrimitiveComponent* *cd6e07bf02(); // Function Engine.CharacterMovementComponent.*cd6e07bf02 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66940f8
	struct FVector AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6687198
	float *2e43ceda7f(); // Function Engine.CharacterMovementComponent.*2e43ceda7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694e2c
	struct F*3718d46421 *04ec90a9d8(); // Function Engine.CharacterMovementComponent.*04ec90a9d8 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6699bf4
	float *208a65c218(); // Function Engine.CharacterMovementComponent.*208a65c218 // Native|Public|BlueprintCallable // @ game+0x6688d08
	void *35735c5cd3(); // Function Engine.CharacterMovementComponent.*35735c5cd3 // Native|Public|BlueprintCallable // @ game+0x58feb5c
	struct F*f2710e04b9 *ae7f14da74(); // Function Engine.CharacterMovementComponent.*ae7f14da74 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66a52cc
	float *087f6c73d3(); // Function Engine.CharacterMovementComponent.*087f6c73d3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ac220
	float *fbab99523c(); // Function Engine.CharacterMovementComponent.*fbab99523c // Final|Native|Public|BlueprintCallable // @ game+0x66a86bc
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x668d58c
	struct F*f2710e04b9 *18e1c80ce6(); // Function Engine.CharacterMovementComponent.*18e1c80ce6 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66a2c7c
	float *7a61a19a27(); // Function Engine.CharacterMovementComponent.*7a61a19a27 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6690244
	bool *284edf62e0(); // Function Engine.CharacterMovementComponent.*284edf62e0 // Final|Native|Public|BlueprintCallable // @ game+0x66a2b5c
	float *e2309bf902(); // Function Engine.CharacterMovementComponent.*e2309bf902 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5968a1c
	struct F*3718d46421 *cf126f0075(); // Function Engine.CharacterMovementComponent.*cf126f0075 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6699750
	float *34f9057aac(); // Function Engine.CharacterMovementComponent.*34f9057aac // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693f40
	float *a946e888d9(); // Function Engine.CharacterMovementComponent.*a946e888d9 // Final|Native|Public|BlueprintCallable // @ game+0x66a7164
	struct FHitResult CapsuleTouched(); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x66890e4
	int32 *c686538277(); // Function Engine.CharacterMovementComponent.*c686538277 // Final|Native|Public|BlueprintCallable // @ game+0x66a5118
	int32 *a4ebf22dc8(); // Function Engine.CharacterMovementComponent.*a4ebf22dc8 // Final|Native|Public|BlueprintCallable // @ game+0x66a5240
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintFunctionLibrary : UObject {

	struct FStringAssetReference MakeStringAssetReference(); // Function Engine.BlueprintFunctionLibrary.MakeStringAssetReference // Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x66de2b4
};

// Class Engine.StaticMeshActor
// Size: 0x410 (Inherited: 0x400)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x400(0x08)
	bool bStaticMeshReplicateMovement; // 0x408(0x01)
	enum class ENavDataGatheringMode *470c9f1b83; // 0x409(0x01)
	char pad_40A[0x6]; // 0x40a(0x06)
};

// Class Engine.HUD
// Size: 0x4e8 (Inherited: 0x400)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x400(0x08)
	char bLostFocusPaused : 1; // 0x408(0x01)
	char bShowHUD : 1; // 0x408(0x01)
	char bShowDebugInfo : 1; // 0x408(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x408(0x01)
	char bShowOverlays : 1; // 0x408(0x01)
	char bEnableDebugTextShadow : 1; // 0x408(0x01)
	char pad_408_6 : 2; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct TArray<struct AActor*> *5e3e96ddc9; // 0x410(0x10)
	char pad_420[0x8]; // 0x420(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x428(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x438(0x10)
	struct UCanvas* Canvas; // 0x448(0x08)
	struct UCanvas* *4e5d7ebf6f; // 0x450(0x08)
	struct TArray<struct F*56b1f6ab8b> *71494f9592; // 0x458(0x10)
	struct UClass* *87c7d0deab; // 0x468(0x08)
	struct AActor* *a812f78775; // 0x470(0x08)
	char pad_478[0x70]; // 0x478(0x70)

	struct FLinearColor *57c786c3b7(); // Function Engine.HUD.*57c786c3b7 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x668df58
	int32 ReceiveDrawHUD(); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x273e04
	float *090b07aebe(); // Function Engine.HUD.*090b07aebe // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x668e2c8
	struct FVector Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669e370
	struct FName ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x273e04
	bool *2ac1731934(); // Function Engine.HUD.*2ac1731934 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6686d24
	struct FVector2D *842d883d63(); // Function Engine.HUD.*842d883d63 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x668d878
	float *e23130372f(); // Function Engine.HUD.*e23130372f // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6695820
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0x58e5114
	struct FName ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x273e04
	struct FName ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x66a8974
	struct APawn* *9e3bd21f17(); // Function Engine.HUD.*9e3bd21f17 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x6694aa4
	void *9cedc41b81(); // Function Engine.HUD.*9cedc41b81 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x669e618
	struct APlayerController* *596dfaadd8(); // Function Engine.HUD.*596dfaadd8 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x59cc794
	struct FName ShowDebugToggleSubCategory(); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x66a8ac8
	struct FVector Deproject(); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668cf38
	bool *669fd7d092(); // Function Engine.HUD.*669fd7d092 // Final|Native|Public|BlueprintCallable // @ game+0x668dce0
	struct FName ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x273e04
	struct UClass* ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x66a8a08
	bool *d7c730a3af(); // Function Engine.HUD.*d7c730a3af // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x669e7cc
	float *2d1c2faf12(); // Function Engine.HUD.*2d1c2faf12 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x668d64c
	struct FVector2D DrawTexture(); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x668e75c
	bool *014b6abad2(); // Function Engine.HUD.*014b6abad2 // Final|Native|Public|BlueprintCallable // @ game+0x668ec6c
	bool *2e092f08e4(); // Function Engine.HUD.*2e092f08e4 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x668fe04
	bool *376229bab6(); // Function Engine.HUD.*376229bab6 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x668e4a4
	int32 AddHitBox(); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6687614
	struct FName ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x273e04
};

// Class Engine.Brush
// Size: 0x438 (Inherited: 0x400)
struct ABrush : AActor {
	enum class *98ccb57006 *07bf3e561c; // 0x400(0x01)
	char pad_401[0x3]; // 0x401(0x03)
	struct FColor BrushColor; // 0x404(0x04)
	int32 PolyFlags; // 0x408(0x04)
	char *fb6ef6a222 : 1; // 0x40c(0x01)
	char *7676895afc : 1; // 0x40c(0x01)
	char *fc9b5395c4 : 1; // 0x40c(0x01)
	char *dcc8979d15 : 1; // 0x40c(0x01)
	char pad_40C_4 : 4; // 0x40c(0x01)
	char pad_40D[0x3]; // 0x40d(0x03)
	struct UModel* Brush; // 0x410(0x08)
	struct UBrushComponent* BrushComponent; // 0x418(0x08)
	char *77a48e7c2a : 1; // 0x420(0x01)
	char pad_420_1 : 7; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct TArray<struct F*5bb08df245> *9d01312ac4; // 0x428(0x10)
};

// Class Engine.Volume
// Size: 0x438 (Inherited: 0x438)
struct AVolume : ABrush {
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotify : UObject {
	char pad_30[0x10]; // 0x30(0x10)

	bool Received_Notify(); // Function Engine.AnimNotify.Received_Notify // Event|Public|BlueprintEvent|Const // @ game+0x273e04
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x6694368
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	char pad_60[0x10]; // 0x60(0x10)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	bool Received_NotifyBegin(); // Function Engine.AnimNotifyState.Received_NotifyBegin // Event|Public|BlueprintEvent|Const // @ game+0x273e04
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x6694368
	bool Received_NotifyTick(); // Function Engine.AnimNotifyState.Received_NotifyTick // Event|Public|BlueprintEvent|Const // @ game+0x273e04
	bool Received_NotifyEnd(); // Function Engine.AnimNotifyState.Received_NotifyEnd // Event|Public|BlueprintEvent|Const // @ game+0x273e04
};

// Class Engine.DataTable
// Size: 0x88 (Inherited: 0x30)
struct UDataTable : UObject {
	struct UScriptStruct* *ead82841b2; // 0x30(0x08)
	char pad_38[0x50]; // 0x38(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x460)
struct ACharacter : APawn {
	struct UCharacterMovementComponent* CharacterMovement; // 0x460(0x08)
	float JumpKeyHoldTime; // 0x468(0x04)
	float *fdceab32c3; // 0x46c(0x04)
	struct USkeletalMeshComponent* Mesh; // 0x470(0x08)
	bool *1d64cd16dd; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x480(0x08)
	struct FVector *fa08663006; // 0x488(0x0c)
	int32 JumpCurrentCount; // 0x494(0x04)
	int32 JumpMaxCount; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)
	struct F*6e7b288381 *fde57a2c96; // 0x4a0(0x48)
	struct UCapsuleComponent* CapsuleComponent; // 0x4e8(0x08)
	struct FQuat *e5f2932677; // 0x4f0(0x10)
	char bPressedJump : 1; // 0x500(0x01)
	char *4eb88c8a38 : 1; // 0x500(0x01)
	char *22d1b18b88 : 1; // 0x500(0x01)
	char *9dd8ada685 : 1; // 0x500(0x01)
	char *1cdec1f898 : 1; // 0x500(0x01)
	char *34ade2fed5 : 1; // 0x500(0x01)
	char *88e7d0a925 : 1; // 0x500(0x01)
	char *f60ec74df2 : 1; // 0x500(0x01)
	char bWasJumping : 1; // 0x501(0x01)
	char pad_501_1 : 7; // 0x501(0x01)
	char pad_502[0x2]; // 0x502(0x02)
	float CrouchedEyeHeight; // 0x504(0x04)
	char bIsCrouched : 1; // 0x508(0x01)
	char pad_508_1 : 7; // 0x508(0x01)
	char pad_509[0x3]; // 0x509(0x03)
	bool *47ce0f5314; // 0x50c(0x01)
	char pad_50D[0x3]; // 0x50d(0x03)
	struct F*6e7b288381 *950fafca74; // 0x510(0x48)
	float JumpMaxHoldTime; // 0x558(0x04)
	float *1f829a81a5; // 0x55c(0x04)
	struct FMulticastDelegate OnReachedJumpApex; // 0x560(0x10)
	char pad_570[0x10]; // 0x570(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x580(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x590(0x10)
	struct FRootMotionSourceGroup *795892ac52; // 0x5a0(0x100)
	struct F*77ba1cb021 *efe800db11; // 0x6a0(0x40)
	struct TArray<struct F*bb18ec9648> *7b1f597c0d; // 0x6e0(0x10)
	struct F*05d7763b32 *bec31ce030; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	void *b23f868331(); // Function Engine.Character.*b23f868331 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x58da144
	bool K2_OnMovementModeChanged(); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *540037a5a4(); // Function Engine.Character.*540037a5a4 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x66c688
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0xd2425c
	struct FRotator *b4b8a67d69(); // Function Engine.Character.*b4b8a67d69 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6690450
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x5943ec4
	bool *5ff84accd4(); // Function Engine.Character.*5ff84accd4 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0xc6aa0c
	bool *c669440a6a(); // Function Engine.Character.*c669440a6a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x66a0310
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x6697370
	void *5a940b9732(); // Function Engine.Character.*5a940b9732 // Native|Public|BlueprintCallable // @ game+0x66a9644
	bool Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x668ce54
	float ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x66d3e8
	bool *836cb3ba33(); // Function Engine.Character.*836cb3ba33 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x66a07d8
	bool *bd798b0484(); // Function Engine.Character.*bd798b0484 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66970bc
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0xbce3d8
	struct UAnimMontage* *4aff9effe3(); // Function Engine.Character.*4aff9effe3 // Native|Public|BlueprintCallable // @ game+0x66a9350
	bool *5e1e8b0a9d(); // Function Engine.Character.*5e1e8b0a9d // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x669fd90
	struct FVector *c5401cd2d9(); // Function Engine.Character.*c5401cd2d9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6690498
	bool *5cc3a54e3d(); // Function Engine.Character.*5cc3a54e3d // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6689a74
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x669d404
	float K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x273e04
	float OnWalkingOffLedge(); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xbee23c
	struct UAnimMontage* *8e99d6a8ee(); // Function Engine.Character.*8e99d6a8ee // Final|Native|Public|BlueprintCallable // @ game+0x6691c3c
	void *af1cfdadf5(); // Function Engine.Character.*af1cfdadf5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x59d3764
	bool *d79c49c550(); // Function Engine.Character.*d79c49c550 // Native|Public|BlueprintCallable // @ game+0x66a7478
	struct FRotator *df1f1f38a8(); // Function Engine.Character.*df1f1f38a8 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6688bfc
	float *918328595d(); // Function Engine.Character.*918328595d // Native|Public|BlueprintCallable // @ game+0x669da18
	float K2_OnStartCrouch(); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x273e04
	bool OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x273e04
	struct FHitResult OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x273e04
	void *41035236aa(); // Function Engine.Character.*41035236aa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x59d3bbc
	bool *cc71faddc9(); // Function Engine.Character.*cc71faddc9 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x66896e0
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x60884c
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66966e4
	bool *07fd890b66(); // Function Engine.Character.*07fd890b66 // Native|Public|BlueprintCallable // @ game+0x66a9ae8
	bool *53934c922e(); // Function Engine.Character.*53934c922e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6697098
	float K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x273e04
	bool *03d7ad404f(); // Function Engine.Character.*03d7ad404f // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x66a0b1c
	float *5380e4b081(); // Function Engine.Character.*5380e4b081 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6690288
	bool LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x669c8cc
	bool ServerMove(); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x669f414
	bool *3bfd75b1a3(); // Function Engine.Character.*3bfd75b1a3 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x669f810
	bool CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6688fd0
};

// Class Engine.Controller
// Size: 0x480 (Inherited: 0x400)
struct AController : AActor {
	char pad_400[0x8]; // 0x400(0x08)
	struct ACharacter* Character; // 0x408(0x08)
	struct FName StateName; // 0x410(0x08)
	struct USceneComponent* TransformComponent; // 0x418(0x08)
	struct FRotator *c58941edc9; // 0x420(0x0c)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct APawn* Pawn; // 0x430(0x08)
	char pad_438[0xc]; // 0x438(0x0c)
	char *a4b6e8f562 : 1; // 0x444(0x01)
	char *e0bc488814 : 1; // 0x444(0x01)
	char pad_444_2 : 6; // 0x444(0x01)
	char pad_445[0x13]; // 0x445(0x13)
	struct APlayerState* PlayerState; // 0x458(0x08)
	char pad_460[0x10]; // 0x460(0x10)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x470(0x10)

	void *fe617afbe6(); // Function Engine.Controller.*fe617afbe6 // Native|Public|BlueprintCallable // @ game+0x669eb14
	bool *08ab1c5256(); // Function Engine.Controller.*08ab1c5256 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669cb50
	struct APawn* Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x5920b40
	struct FRotator *12f9777c6b(); // Function Engine.Controller.*12f9777c6b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66a4518
	bool *5d83ffddec(); // Function Engine.Controller.*5d83ffddec // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696ce8
	struct AActor* *05bca2745b(); // Function Engine.Controller.*05bca2745b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66960dc
	bool *8da1de78a6(); // Function Engine.Controller.*8da1de78a6 // Native|Public|BlueprintCallable // @ game+0x66a558c
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x59c9d74
	bool *25604da1d8(); // Function Engine.Controller.*25604da1d8 // Native|Public|BlueprintCallable // @ game+0x596ddc4
	struct APlayerController* *2e5b1c76bd(); // Function Engine.Controller.*2e5b1c76bd // Final|Native|Public|BlueprintCallable // @ game+0x6689338
	void *dcb26b0e9a(); // Function Engine.Controller.*dcb26b0e9a // Native|Public|BlueprintCallable // @ game+0x5930600
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x5984ab0
	struct APawn* K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669a1a8
	void *2dd8068e51(); // Function Engine.Controller.*2dd8068e51 // Native|Public|BlueprintCallable // @ game+0x669eafc
	bool *2c664b8b49(); // Function Engine.Controller.*2c664b8b49 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696ba4
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x66a965c
	struct FRotator *a51dacc819(); // Function Engine.Controller.*a51dacc819 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6691d30
	bool *9955fb3f45(); // Function Engine.Controller.*9955fb3f45 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696cc0
	struct FRotator *047360b192(); // Function Engine.Controller.*047360b192 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x668b6ac
	struct AActor* ReceiveInstigatedAnyDamage(); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x273e04
	bool *796d6f386f(); // Function Engine.Controller.*796d6f386f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696dfc
	bool *32780b0e26(); // Function Engine.Controller.*32780b0e26 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x9cc828
	void *7d0cb6afd9(); // Function Engine.Controller.*7d0cb6afd9 // Native|Public|BlueprintCallable // @ game+0x66a9b80
	bool *3d893e1812(); // Function Engine.Controller.*3d893e1812 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669707c
	struct FRotator GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6691788
};

// Class Engine.SpringArmComponent
// Size: 0x570 (Inherited: 0x4e0)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x4e0(0x04)
	struct FVector SocketOffset; // 0x4e4(0x0c)
	struct FVector TargetOffset; // 0x4f0(0x0c)
	float ProbeSize; // 0x4fc(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x500(0x01)
	char pad_501[0x3]; // 0x501(0x03)
	char bDoCollisionTest : 1; // 0x504(0x01)
	char bUsePawnControlRotation : 1; // 0x504(0x01)
	char bInheritPitch : 1; // 0x504(0x01)
	char bInheritYaw : 1; // 0x504(0x01)
	char bInheritRoll : 1; // 0x504(0x01)
	char bLockPitchLag : 1; // 0x504(0x01)
	char bLockYawLag : 1; // 0x504(0x01)
	char bLockRollLag : 1; // 0x504(0x01)
	char bEnableCameraLag : 1; // 0x505(0x01)
	char bEnableCameraRotationLag : 1; // 0x505(0x01)
	char bUseCameraLagSubstepping : 1; // 0x505(0x01)
	char bDrawDebugLagMarkers : 1; // 0x505(0x01)
	char pad_505_4 : 4; // 0x505(0x01)
	char pad_506[0x2]; // 0x506(0x02)
	float CameraLagSpeed; // 0x508(0x04)
	float CameraRotationLagSpeed; // 0x50c(0x04)
	float CameraLagMaxTimeStep; // 0x510(0x04)
	float CameraLagMaxDistance; // 0x514(0x04)
	char pad_518[0x58]; // 0x518(0x58)
};

// Class Engine.PlayerController
// Size: 0x7b0 (Inherited: 0x480)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)
	struct APawn* *5355705fb6; // 0x490(0x08)
	struct U*7f392fdd20* *53da961471; // 0x498(0x08)
	char pad_4A0[0x8]; // 0x4a0(0x08)
	struct AHUD* *09f6cda326; // 0x4a8(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x4b0(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4b8(0x08)
	bool *c935c04b6a; // 0x4c0(0x01)
	char pad_4C1[0x3]; // 0x4c1(0x03)
	struct FRotator TargetViewRotation; // 0x4c4(0x0c)
	char pad_4D0[0xc]; // 0x4d0(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4dc(0x04)
	struct TArray<struct AActor*> *62de05ec1f; // 0x4e0(0x10)
	char pad_4F0[0x4]; // 0x4f0(0x04)
	float *7127c3b7ef; // 0x4f4(0x04)
	struct FVector *1c94c6d466; // 0x4f8(0x0c)
	struct FRotator *104047d191; // 0x504(0x0c)
	int32 *0b2013c943; // 0x510(0x04)
	char pad_514[0x4]; // 0x514(0x04)
	struct UCheatManager* CheatManager; // 0x518(0x08)
	struct UClass* CheatClass; // 0x520(0x08)
	struct UPlayerInput* PlayerInput; // 0x528(0x08)
	struct TArray<struct F*dfbef80de6> *6f0ea30984; // 0x530(0x10)
	char pad_540[0x90]; // 0x540(0x90)
	char pad_5D0_0 : 3; // 0x5d0(0x01)
	char bPlayerIsWaiting : 1; // 0x5d0(0x01)
	char pad_5D0_4 : 4; // 0x5d0(0x01)
	char pad_5D1[0x3]; // 0x5d1(0x03)
	bool *348e8c60ad; // 0x5d4(0x01)
	char pad_5D5[0x3b]; // 0x5d5(0x3b)
	struct UNetConnection* *ef8b6622cb; // 0x610(0x08)
	struct UNetConnection* NetConnection; // 0x618(0x08)
	char pad_620[0xc]; // 0x620(0x0c)
	float InputYawScale; // 0x62c(0x04)
	float InputPitchScale; // 0x630(0x04)
	float InputRollScale; // 0x634(0x04)
	char bShowMouseCursor : 1; // 0x638(0x01)
	char bEnableClickEvents : 1; // 0x638(0x01)
	char bEnableTouchEvents : 1; // 0x638(0x01)
	char bEnableMouseOverEvents : 1; // 0x638(0x01)
	char bEnableTouchOverEvents : 1; // 0x638(0x01)
	char bForceFeedbackEnabled : 1; // 0x638(0x01)
	char pad_638_6 : 2; // 0x638(0x01)
	char pad_639[0x7]; // 0x639(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x640(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x650(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x651(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x652(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x653(0x01)
	float HitResultTraceDistance; // 0x654(0x04)
	char pad_658[0x80]; // 0x658(0x80)
	struct U*4aa7f8d102* *3836f05d7e; // 0x6d8(0x08)
	char pad_6E0_0 : 3; // 0x6e0(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6e0(0x01)
	char pad_6E0_4 : 4; // 0x6e0(0x01)
	char pad_6E1[0x17]; // 0x6e1(0x17)
	struct UTouchInterface* *8722c902fc; // 0x6f8(0x08)
	char pad_700[0x40]; // 0x700(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x740(0x08)
	struct FVector SpawnLocation; // 0x748(0x0c)
	char pad_754[0x4]; // 0x754(0x04)
	bool *3375ec9f26; // 0x758(0x01)
	char pad_759[0x1]; // 0x759(0x01)
	uint16 *d9a44bb2ce; // 0x75a(0x02)
	uint16 *31f30dbdc2; // 0x75c(0x02)
	char pad_75E[0x2]; // 0x75e(0x02)
	struct AActor* *a15f7f3a93; // 0x760(0x08)
	struct AActor* *7cf934aa32; // 0x768(0x08)
	char pad_770[0x40]; // 0x770(0x40)

	struct TArray<struct F*919a4e5392> *b9986a0d77(); // Function Engine.PlayerController.*b9986a0d77 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a1760
	void *ca18aae7b1(); // Function Engine.PlayerController.*ca18aae7b1 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x669f3c8
	struct FKey ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x668c534
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x668cf20
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x668ee40
	void *8828e60900(); // Function Engine.PlayerController.*8828e60900 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b190
	struct FName *6aa0cf84c3(); // Function Engine.PlayerController.*6aa0cf84c3 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a0de4
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x669eb58
	bool *562fffde91(); // Function Engine.PlayerController.*562fffde91 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b7b8
	struct APawn* ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5e9b88
	void *8b2a8ba05e(); // Function Engine.PlayerController.*8b2a8ba05e // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a11e8
	void *ccea1e8dcd(); // Function Engine.PlayerController.*ccea1e8dcd // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x6689fa0
	void *b9a5b90052(); // Function Engine.PlayerController.*b9a5b90052 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a1234
	bool *7aff3172b7(); // Function Engine.PlayerController.*7aff3172b7 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x668b318
	void *f341da3823(); // Function Engine.PlayerController.*f341da3823 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6689f88
	struct FName Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x6688e94
	struct FRotator *7efee3e988(); // Function Engine.PlayerController.*7efee3e988 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x66cd2c
	bool *64e09ff94c(); // Function Engine.PlayerController.*64e09ff94c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669e430
	void *109ed542bf(); // Function Engine.PlayerController.*109ed542bf // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6689f58
	float *5cb6d00d4d(); // Function Engine.PlayerController.*5cb6d00d4d // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668a2e4
	struct UClass* *09b6a398ff(); // Function Engine.PlayerController.*09b6a398ff // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x668b97c
	void *6cfe3183e5(); // Function Engine.PlayerController.*6cfe3183e5 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xde1970
	enum class EControllerHand *eaa37b6d9f(); // Function Engine.PlayerController.*eaa37b6d9f // Final|Native|Public|BlueprintCallable // @ game+0x66a95ac
	bool *11cd5a1cd2(); // Function Engine.PlayerController.*11cd5a1cd2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66922e4
	bool *3229537f4b(); // Function Engine.PlayerController.*3229537f4b // Native|Public|BlueprintCallable // @ game+0x66a83c4
	float *61ab21bf09(); // Function Engine.PlayerController.*61ab21bf09 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6692c5c
	bool *7d402319f6(); // Function Engine.PlayerController.*7d402319f6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6692174
	void *0b5b086a5a(); // Function Engine.PlayerController.*0b5b086a5a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x66a18a4
	bool ServerUpdateLevelVisibility(); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xbf330c
	struct FName *aa5dd0a8e7(); // Function Engine.PlayerController.*aa5dd0a8e7 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b4f0
	bool *9a1480ca0e(); // Function Engine.PlayerController.*9a1480ca0e // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcc9758
	bool *b891a072c6(); // Function Engine.PlayerController.*b891a072c6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6692004
	struct FVector *c6b3360e80(); // Function Engine.PlayerController.*c6b3360e80 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66937f4
	struct FString SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x66a9784
	bool *0c46468f00(); // Function Engine.PlayerController.*0c46468f00 // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x668959c
	struct AHUD* *223c7f5c7b(); // Function Engine.PlayerController.*223c7f5c7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xde9da4
	bool *22f1694b2b(); // Function Engine.PlayerController.*22f1694b2b // Native|Public|BlueprintCallable // @ game+0x66a3bf4
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x66964ac
	struct FString *ca36ac1db5(); // Function Engine.PlayerController.*ca36ac1db5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b23c
	bool *4444f6dc2e(); // Function Engine.PlayerController.*4444f6dc2e // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x669249c
	bool DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668d0cc
	float AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x66884c4
	struct UTouchInterface* *45a7bb797b(); // Function Engine.PlayerController.*45a7bb797b // Native|Public|BlueprintCallable // @ game+0x6686834
	struct FName *cff048ac18(); // Function Engine.PlayerController.*cff048ac18 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x669f1e0
	int32 ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x66a1634
	float *4feca51654(); // Function Engine.PlayerController.*4feca51654 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6692d50
	bool *a7dc80b0cb(); // Function Engine.PlayerController.*a7dc80b0cb // Net|NetReliableNative|Event|Public|NetClient // @ game+0x669d578
	struct FVector *91e5ce2a61(); // Function Engine.PlayerController.*91e5ce2a61 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6693270
	int32 *f595309bb8(); // Function Engine.PlayerController.*f595309bb8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xce1714
	bool ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x66a9914
	void *128ad6584b(); // Function Engine.PlayerController.*128ad6584b // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x6689f70
	struct FRotator *7d9f70de59(); // Function Engine.PlayerController.*7d9f70de59 // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x66a1280
	struct UCameraAnim* *87d4bd0ed1(); // Function Engine.PlayerController.*87d4bd0ed1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668ba28
	void *1bf2c0fa15(); // Function Engine.PlayerController.*1bf2c0fa15 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668a024
	float *b46560c95f(); // Function Engine.PlayerController.*b46560c95f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x669317c
	bool *9333fe086e(); // Function Engine.PlayerController.*9333fe086e // Final|Native|Public|BlueprintCallable // @ game+0x669e1ec
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x59442f4
	void *054ae698aa(); // Function Engine.PlayerController.*054ae698aa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x59cad74
	void *0a767a728b(); // Function Engine.PlayerController.*0a767a728b // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x66a18f0
	struct APawn* *527867814b(); // Function Engine.PlayerController.*527867814b // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xcbe3e4
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x669d610
	int32 *f42971a4a8(); // Function Engine.PlayerController.*f42971a4a8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b584
	struct FUniqueNetIdRepl *d34ced269f(); // Function Engine.PlayerController.*d34ced269f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a14d4
	struct F*7d739d58fd *d32f54be22(); // Function Engine.PlayerController.*d32f54be22 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x66a193c
	bool *488be087b5(); // Function Engine.PlayerController.*488be087b5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668a03c
	struct FName *bdb5e8e311(); // Function Engine.PlayerController.*bdb5e8e311 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668a120
	struct TArray<struct F*3fbb54c377> *3bd9a426f4(); // Function Engine.PlayerController.*3bd9a426f4 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668c304
	struct APawn* ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b1a8
	bool *ca6345be4e(); // Function Engine.PlayerController.*ca6345be4e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668a24c
	bool *bcb4c91970(); // Function Engine.PlayerController.*bcb4c91970 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668a1b4
	struct F*7d739d58fd *bc7ee5fe98(); // Function Engine.PlayerController.*bc7ee5fe98 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b850
	bool *31dade5ead(); // Function Engine.PlayerController.*31dade5ead // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x668d1d4
	void *3f9771d56c(); // Function Engine.PlayerController.*3f9771d56c // Net|NetReliableNative|Event|Public|NetClient // @ game+0xde9844
	struct FUniqueNetIdRepl *ac56631480(); // Function Engine.PlayerController.*ac56631480 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a0c84
	struct FString LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x669cc94
	struct FString *a1c104b477(); // Function Engine.PlayerController.*a1c104b477 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x669f294
	struct FName *04dcc60588(); // Function Engine.PlayerController.*04dcc60588 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x668bba0
	float FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x668f060
	void *085d1b29e4(); // Function Engine.PlayerController.*085d1b29e4 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a1858
	bool *7ee32fbf1d(); // Function Engine.PlayerController.*7ee32fbf1d // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6693ff0
	enum class EControllerHand *e155e1afc0(); // Function Engine.PlayerController.*e155e1afc0 // Final|Native|Public|BlueprintCallable // @ game+0x66a5368
	struct UObject* *7efa7d97f8(); // Function Engine.PlayerController.*7efa7d97f8 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668af34
	bool *121dfd5443(); // Function Engine.PlayerController.*121dfd5443 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66a9d40
	bool *bd26ba1bdf(); // Function Engine.PlayerController.*bd26ba1bdf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66a9e34
	struct FVector *1c6382db08(); // Function Engine.PlayerController.*1c6382db08 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6691ed4
	int32 *81cd11cd3f(); // Function Engine.PlayerController.*81cd11cd3f // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6a6d88
	void *94bb7e21d2(); // Function Engine.PlayerController.*94bb7e21d2 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a1488
	float AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x6688080
	void *2bffd3dab0(); // Function Engine.PlayerController.*2bffd3dab0 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x669f37c
	bool *ab766b338c(); // Function Engine.PlayerController.*ab766b338c // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x668babc
	struct FGuid *bbef2bccc4(); // Function Engine.PlayerController.*bbef2bccc4 // Final|Native|Public|HasDefaults // @ game+0x668be3c
	int32 *81a50ace3a(); // Function Engine.PlayerController.*81a50ace3a // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6696104
	void *11160db8c7(); // Function Engine.PlayerController.*11160db8c7 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668ba10
	struct FRotator *b0e0e5c0d2(); // Function Engine.PlayerController.*b0e0e5c0d2 // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x668a568
	int32 *fd0afdf5cf(); // Function Engine.PlayerController.*fd0afdf5cf // Final|Native|Public|BlueprintCallable // @ game+0x66a63b0
	bool *b8942aeaa0(); // Function Engine.PlayerController.*b8942aeaa0 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x669353c
	struct ASpectatorPawn* *50182b7bf6(); // Function Engine.PlayerController.*50182b7bf6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695768
	struct FString SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x669f11c
	float *bdfb436ed1(); // Function Engine.PlayerController.*bdfb436ed1 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6693438
	float AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x66888ec
	struct FUniqueNetIdRepl *dc76996ac2(); // Function Engine.PlayerController.*dc76996ac2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668c1e8
	struct FString SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x66a6600
	void *0a4900b11d(); // Function Engine.PlayerController.*0a4900b11d // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b300
	bool *16e7b3d651(); // Function Engine.PlayerController.*16e7b3d651 // Native|Public|BlueprintCallable // @ game+0x66a858c
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x5936fdc
	struct FGuid *2263f81ded(); // Function Engine.PlayerController.*2263f81ded // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x668c010
	bool *246c55ff62(); // Function Engine.PlayerController.*246c55ff62 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66927fc
	bool *6e76f35baa(); // Function Engine.PlayerController.*6e76f35baa // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x66a13c8
	bool *79d2f47e0a(); // Function Engine.PlayerController.*79d2f47e0a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696bcc
	struct UObject* *1000a8c5db(); // Function Engine.PlayerController.*1000a8c5db // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668b0fc
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x597107c
	float *e351dac2e0(); // Function Engine.PlayerController.*e351dac2e0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668bc80
	struct FColor *5f3e718776(); // Function Engine.PlayerController.*5f3e718776 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a458c
	float *bfa37ce532(); // Function Engine.PlayerController.*bfa37ce532 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6692e98
	int32 *ccb0abfa15(); // Function Engine.PlayerController.*ccb0abfa15 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668ada8
	bool *25613f28fc(); // Function Engine.PlayerController.*25613f28fc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668ac70
	bool *7e6c398dc3(); // Function Engine.PlayerController.*7e6c398dc3 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x669264c
	struct F*e57696b0b8 *83351c4d17(); // Function Engine.PlayerController.*83351c4d17 // Final|Native|Public|BlueprintCallable // @ game+0x669dee0
	struct FRotator *1c20c798e9(); // Function Engine.PlayerController.*1c20c798e9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a2654
	void *61c1973156(); // Function Engine.PlayerController.*61c1973156 // Final|Native|Public|BlueprintCallable // @ game+0x668952c
	struct FName *d3c7c3f095(); // Function Engine.PlayerController.*d3c7c3f095 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x668a894
	bool *e1ee59f3bc(); // Function Engine.PlayerController.*e1ee59f3bc // Net|NetReliableNative|Event|Public|NetClient // @ game+0x784c18
	struct FString *beec12a508(); // Function Engine.PlayerController.*beec12a508 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x5e6dd4
	float *dcb445d84f(); // Function Engine.PlayerController.*dcb445d84f // Net|Native|Event|Public|NetClient // @ game+0x668a9c8
	float *370ce3ebac(); // Function Engine.PlayerController.*370ce3ebac // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x668aaec
	bool StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x66a8f80
	struct FText *056bb0b803(); // Function Engine.PlayerController.*056bb0b803 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668c3c0
	struct FUniqueNetIdRepl *e2fc8aa029(); // Function Engine.PlayerController.*e2fc8aa029 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x668a44c
};

// Class Engine.Info
// Size: 0x400 (Inherited: 0x400)
struct AInfo : AActor {
};

// Class Engine.GameModeBase
// Size: 0x4a0 (Inherited: 0x400)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x400(0x10)
	struct UClass* GameSessionClass; // 0x410(0x08)
	struct UClass* GameStateClass; // 0x418(0x08)
	struct UClass* PlayerControllerClass; // 0x420(0x08)
	struct UClass* PlayerStateClass; // 0x428(0x08)
	struct FStringClassReference HUDClass; // 0x430(0x10)
	struct UClass* DefaultPawnClass; // 0x440(0x08)
	struct FStringClassReference SpectatorClass; // 0x448(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x458(0x08)
	struct AGameSession* GameSession; // 0x460(0x08)
	struct AGameStateBase* GameState; // 0x468(0x08)
	struct FText *638604ca81; // 0x470(0x18)
	char bUseSeamlessTravel : 1; // 0x488(0x01)
	char bStartPlayersAsSpectators : 1; // 0x488(0x01)
	char bPauseable : 1; // 0x488(0x01)
	char pad_488_3 : 5; // 0x488(0x01)
	char pad_489[0x17]; // 0x489(0x17)

	struct FTransform RestartPlayerAtTransform(); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x669ed80
	void *e97d812c21(); // Function Engine.GameModeBase.*e97d812c21 // Native|Public|BlueprintCallable // @ game+0x5d774c
	bool *58faa59de5(); // Function Engine.GameModeBase.*58faa59de5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596d008
	struct APawn* SpawnDefaultPawnFor(); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xcbd0e4
	struct APlayerController* K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x273e04
	bool K2_OnChangeName(); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x273e04
	struct AController* RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x669ec0c
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xbccfa8
	int32 *1d6a714d9c(); // Function Engine.GameModeBase.*1d6a714d9c // Native|Public|BlueprintCallable // @ game+0x66945a4
	struct AActor* RestartPlayerAtPlayerStart(); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x669eca0
	struct AActor* FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xc73c74
	struct AController* K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x273e04
	bool CanSpectate(); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x6688ff4
	struct APlayerController* InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xdba568
	struct AActor* *95ac877b57(); // Function Engine.GameModeBase.*95ac877b57 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6699d0c
	int32 *8a2f9ba8dd(); // Function Engine.GameModeBase.*8a2f9ba8dd // Native|Public|BlueprintCallable // @ game+0x66944c0
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x59d388c
	struct APlayerController* HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0x896e4c
	struct AActor* ChoosePlayerStart(); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xcc2ebc
	bool ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x669e724
	bool MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xcb1060
	struct APlayerController* K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x273e04
	bool PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0x896d8c
	struct AController* InitStartSpot(); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xdadffc
	bool *3577785442(); // Function Engine.GameModeBase.*3577785442 // Native|Public|BlueprintCallable // @ game+0x66893c8
	struct AController* K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x273e04
	struct APawn* SpawnDefaultPawnAtTransform(); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xd09264
	struct UClass* GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xcdc594
};

// Class Engine.GameMode
// Size: 0x4e0 (Inherited: 0x4a0)
struct AGameMode : AGameModeBase {
	struct FName *59acc54cb2; // 0x4a0(0x08)
	char bDelayedStart : 1; // 0x4a8(0x01)
	char pad_4A8_1 : 7; // 0x4a8(0x01)
	char pad_4A9[0x3]; // 0x4a9(0x03)
	int32 NumSpectators; // 0x4ac(0x04)
	int32 NumPlayers; // 0x4b0(0x04)
	int32 NumBots; // 0x4b4(0x04)
	float MinRespawnDelay; // 0x4b8(0x04)
	int32 NumTravellingPlayers; // 0x4bc(0x04)
	struct UClass* *aa08ae227e; // 0x4c0(0x08)
	struct TArray<struct APlayerState*> *ea842fe704; // 0x4c8(0x10)
	float *40f6dab750; // 0x4d8(0x04)
	bool bHandleDedicatedServerReplays; // 0x4dc(0x01)
	char pad_4DD[0x3]; // 0x4dd(0x03)

	bool *a7a9250f62(); // Function Engine.GameMode.*a7a9250f62 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696270
	void *73ab7fb69b(); // Function Engine.GameMode.*73ab7fb69b // Native|Public|BlueprintCallable // @ game+0x668f034
	struct FName K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x273e04
	bool ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0xb6ea30
	void *97d9a6b98e(); // Function Engine.GameMode.*97d9a6b98e // Native|Public|BlueprintCallable // @ game+0x669eb40
	bool *f826cabf6b(); // Function Engine.GameMode.*f826cabf6b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696d2c
	bool ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xd14c58
	void *d7b5e87aef(); // Function Engine.GameMode.*d7b5e87aef // Native|Public|BlueprintCallable // @ game+0x596c06c
	struct FString Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x669ef44
	void *b8de88dd31(); // Function Engine.GameMode.*b8de88dd31 // Native|Public|BlueprintCallable // @ game+0x66867e4
	struct FName *9ecd3b7aa4(); // Function Engine.GameMode.*9ecd3b7aa4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693c20
	float SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x66a2d18
};

// Class Engine.PlayerState
// Size: 0x498 (Inherited: 0x400)
struct APlayerState : AInfo {
	struct FString PlayerName; // 0x400(0x10)
	struct UClass* *aa08ae227e; // 0x410(0x08)
	float Score; // 0x418(0x04)
	int32 PlayerId; // 0x41c(0x04)
	char pad_420[0x4]; // 0x420(0x04)
	bool Ping; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	int32 StartTime; // 0x428(0x04)
	char pad_42C[0x14]; // 0x42c(0x14)
	struct FString *fef21e2df7; // 0x440(0x10)
	char bIsSpectator : 1; // 0x450(0x01)
	char *b94898b1bc : 1; // 0x450(0x01)
	char bIsABot : 1; // 0x450(0x01)
	char pad_450_3 : 1; // 0x450(0x01)
	char *9a7d67065f : 1; // 0x450(0x01)
	char *50f72176d9 : 1; // 0x450(0x01)
	char pad_450_6 : 2; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
	struct FUniqueNetIdRepl UniqueId; // 0x458(0x18)
	char pad_470[0x20]; // 0x470(0x20)
	bool *d43bf3f659; // 0x490(0x01)
	char pad_491[0x7]; // 0x491(0x07)

	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x59c9d5c
	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0x58e5114
	struct APlayerState* ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x273e04
	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x5990144
	struct APlayerState* ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x273e04
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x59c9d74
};

// Class Engine.SkeletalMeshActor
// Size: 0x488 (Inherited: 0x400)
struct ASkeletalMeshActor : AActor {
	char pad_400[0x8]; // 0x400(0x08)
	char bShouldDoAnimNotifies : 1; // 0x408(0x01)
	char bWakeOnLevelStart : 1; // 0x408(0x01)
	char pad_408_2 : 6; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x410(0x08)
	struct USkeletalMesh* *573ace7b5a; // 0x418(0x08)
	struct UPhysicsAsset* *12e34c7fa2; // 0x420(0x08)
	struct UMaterialInterface* *4da1d1f3fd; // 0x428(0x08)
	struct UMaterialInterface* *77466e8dca; // 0x430(0x08)
	char pad_438[0x50]; // 0x438(0x50)

	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x5990144
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0x58e5114
	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x59c9d5c
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x59c9d74
};

// Class Engine.DestructibleComponent
// Size: 0xd70 (Inherited: 0xcb0)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xca8(0x01)
	struct TArray<struct F*53a1c74b57> FractureEffects; // 0xcb0(0x10)
	bool bEnableHardSleeping; // 0xcc0(0x01)
	char pad_CC1_1 : 7; // 0xcc1(0x01)
	char pad_CC2[0x2]; // 0xcc2(0x02)
	float LargeChunkThreshold; // 0xcc4(0x04)
	char pad_CC8[0x10]; // 0xcc8(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xcd8(0x10)
	char pad_CE8[0x88]; // 0xce8(0x88)

	bool *89d8555bbf(); // Function Engine.DestructibleComponent.*89d8555bbf // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66b1570
	float *b96360052d(); // Function Engine.DestructibleComponent.*b96360052d // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66b0374
	struct UDestructibleMesh* *247917c7eb(); // Function Engine.DestructibleComponent.*247917c7eb // Final|Native|Public|BlueprintCallable // @ game+0x66efcb4
	struct UDestructibleMesh* *efeced8efa(); // Function Engine.DestructibleComponent.*efeced8efa // Final|Native|Public|BlueprintCallable // @ game+0x66c93cc
};

// Class Engine.SaveGame
// Size: 0x30 (Inherited: 0x30)
struct USaveGame : UObject {
};

// Class Engine.*18316965f0
// Size: 0xa30 (Inherited: 0xa10)
struct U*18316965f0 : UPrimitiveComponent {
	struct FColor ShapeColor; // 0xa08(0x04)
	struct UBodySetup* *2847596841; // 0xa10(0x08)
	char *2cbfa4e18b : 1; // 0xa18(0x01)
	char *15d93fcb44 : 1; // 0xa18(0x01)
	char *27dd7eb1bd : 1; // 0xa18(0x01)
	char pad_A1C_3 : 5; // 0xa1c(0x01)
	char pad_A1D[0x3]; // 0xa1d(0x03)
	struct UClass* AreaClass; // 0xa20(0x08)
	char pad_A28[0x8]; // 0xa28(0x08)
};

// Class Engine.TargetPoint
// Size: 0x400 (Inherited: 0x400)
struct ATargetPoint : AActor {
};

// Class Engine.GameStateBase
// Size: 0x440 (Inherited: 0x400)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x400(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x408(0x08)
	struct UClass* SpectatorClass; // 0x410(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x418(0x10)
	bool *8642766d5b; // 0x428(0x01)
	char pad_429[0x3]; // 0x429(0x03)
	float *b9ef543610; // 0x42c(0x04)
	float *9c9ecdea9a; // 0x430(0x04)
	float *f4a4fb2240; // 0x434(0x04)
	char pad_438[0x8]; // 0x438(0x08)

	float *6971957481(); // Function Engine.GameStateBase.*6971957481 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66951c0
	float *8432ff603b(); // Function Engine.GameStateBase.*8432ff603b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e78b4
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0x599328c
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0x58feb5c
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0x9aa718
	float *880a119fd9(); // Function Engine.GameStateBase.*880a119fd9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6693f40
	bool *05f73d26c1(); // Function Engine.GameStateBase.*05f73d26c1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696248
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xbccfa8
	float *e6ac5dc660(); // Function Engine.GameStateBase.*e6ac5dc660 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5969e34
	float *fae00bc477(); // Function Engine.GameStateBase.*fae00bc477 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695118
	bool *58faa59de5(); // Function Engine.GameStateBase.*58faa59de5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696298
};

// Class Engine.GameState
// Size: 0x460 (Inherited: 0x440)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x440(0x08)
	struct FName PreviousMatchState; // 0x448(0x08)
	int32 ElapsedTime; // 0x450(0x04)
	char pad_454[0xc]; // 0x454(0x0c)

	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x59373c0
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0x5d774c
};

// Class Engine.BoxComponent
// Size: 0xa40 (Inherited: 0xa30)
struct UBoxComponent : U*18316965f0 {
	struct FVector BoxExtent; // 0xa28(0x0c)
	char pad_A3C[0x4]; // 0xa3c(0x04)

	struct FVector *e2d2b6102b(); // Function Engine.BoxComponent.*e2d2b6102b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1e00
	struct FVector *375f6933d7(); // Function Engine.BoxComponent.*375f6933d7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfa2c
	bool *4b28c59cdc(); // Function Engine.BoxComponent.*4b28c59cdc // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66edb00
};

// Class Engine.ProjectileMovementComponent
// Size: 0x310 (Inherited: 0x250)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x248(0x04)
	float MaxSpeed; // 0x24c(0x04)
	char bRotationFollowsVelocity : 1; // 0x250(0x01)
	char bShouldBounce : 1; // 0x250(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x250(0x01)
	char bForceSubStepping : 1; // 0x250(0x01)
	char bSimulationEnabled : 1; // 0x250(0x01)
	char bSweepCollision : 1; // 0x250(0x01)
	char bIsHomingProjectile : 1; // 0x250(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x250(0x01)
	char bIsSliding : 1; // 0x251(0x01)
	char bInterpMovement : 1; // 0x251(0x01)
	char bInterpRotation : 1; // 0x251(0x01)
	float PreviousHitTime; // 0x254(0x04)
	struct FVector PreviousHitNormal; // 0x258(0x0c)
	float ProjectileGravityScale; // 0x264(0x04)
	float *1aff06e174; // 0x268(0x04)
	float Bounciness; // 0x26c(0x04)
	float Friction; // 0x270(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x274(0x04)
	float MinFrictionFraction; // 0x278(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x280(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x290(0x10)
	float HomingAccelerationMagnitude; // 0x2a0(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x2a4(0x08)
	float MaxSimulationTimeStep; // 0x2ac(0x04)
	int32 MaxSimulationIterations; // 0x2b0(0x04)
	int32 BounceAdditionalIterations; // 0x2b4(0x04)
	float InterpLocationTime; // 0x2b8(0x04)
	float InterpRotationTime; // 0x2bc(0x04)
	float InterpLocationMaxLagDistance; // 0x2c0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2c4(0x04)
	char pad_2C9[0x47]; // 0x2c9(0x47)

	struct FHitResult OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x273e04
	bool *c41aa9c805(); // Function Engine.ProjectileMovementComponent.*c41aa9c805 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d62c8
	struct FRotator *544ce7c588(); // Function Engine.ProjectileMovementComponent.*544ce7c588 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66e1334
	struct FHitResult StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x67017c0
	struct FVector LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d979c
	void *c4dbbca7a5(); // Function Engine.ProjectileMovementComponent.*c4dbbca7a5 // Native|Public|BlueprintCallable // @ game+0x593d7dc
	bool *65ea89a3fb(); // Function Engine.ProjectileMovementComponent.*65ea89a3fb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d6d64
	struct FVector *6998c735d5(); // Function Engine.ProjectileMovementComponent.*6998c735d5 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66f9d74
	struct FVector OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x273e04
	struct USceneComponent* *fa0688bcbd(); // Function Engine.ProjectileMovementComponent.*fa0688bcbd // Native|Public|BlueprintCallable // @ game+0x66f31c4
};

// Class Engine.CurveBase
// Size: 0x38 (Inherited: 0x30)
struct UCurveBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	float *b1bcc037e3(); // Function Engine.CurveBase.*b1bcc037e3 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6695f00
	float *684cbb9b81(); // Function Engine.CurveBase.*684cbb9b81 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6695a68
};

// Class Engine.GameUserSettings
// Size: 0x118 (Inherited: 0x30)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x30(0x01)
	bool bUseDynamicResolution; // 0x31(0x01)
	char pad_32[0x4e]; // 0x32(0x4e)
	uint32 ResolutionSizeX; // 0x80(0x04)
	uint32 ResolutionSizeY; // 0x84(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	int32 WindowPosX; // 0x90(0x04)
	int32 WindowPosY; // 0x94(0x04)
	int32 FullscreenMode; // 0x98(0x04)
	int32 LastConfirmedFullscreenMode; // 0x9c(0x04)
	int32 PreferredFullscreenMode; // 0xa0(0x04)
	uint32 Version; // 0xa4(0x04)
	int32 AudioQualityLevel; // 0xa8(0x04)
	float FrameRateLimit; // 0xac(0x04)
	char pad_B0[0x4]; // 0xb0(0x04)
	int32 DesiredScreenWidth; // 0xb4(0x04)
	bool bUseDesiredScreenHeight; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DesiredScreenHeight; // 0xbc(0x04)
	float LastRecommendedScreenWidth; // 0xc0(0x04)
	float LastRecommendedScreenHeight; // 0xc4(0x04)
	float LastCPUBenchmarkResult; // 0xc8(0x04)
	float LastGPUBenchmarkResult; // 0xcc(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xd0(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xe0(0x10)
	float LastGPUBenchmarkMultiplier; // 0xf0(0x04)
	bool bUseHDRDisplayOutput; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	int32 HDRDisplayOutputNits; // 0xf8(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xfc(0x01)
	bool bGPUDebug; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0x100(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x108(0x10)

	bool LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x6712c20
	struct FIntPoint *8965889365(); // Function Engine.GameUserSettings.*8965889365 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67156a0
	int32 *35bd157cef(); // Function Engine.GameUserSettings.*35bd157cef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6717628
	struct FIntPoint *bcb8f08616(); // Function Engine.GameUserSettings.*bcb8f08616 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6716b24
	struct FIntPoint *7a8928fa14(); // Function Engine.GameUserSettings.*7a8928fa14 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6714b84
	float *821eaa3a9c(); // Function Engine.GameUserSettings.*821eaa3a9c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x671518c
	struct FIntPoint *877cecaacd(); // Function Engine.GameUserSettings.*877cecaacd // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6714bd0
	int32 *b317a49994(); // Function Engine.GameUserSettings.*b317a49994 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6716b48
	enum class EWindowMode *c3c793a1af(); // Function Engine.GameUserSettings.*c3c793a1af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6716128
	int32 GetResolutionScaleInformation(); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x671674c
	bool *a913e4d760(); // Function Engine.GameUserSettings.*a913e4d760 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6717b44
	int32 *c1f35611fa(); // Function Engine.GameUserSettings.*c1f35611fa // Final|Native|Public|BlueprintCallable // @ game+0x671ec08
	enum class EWindowMode *1af20eacd3(); // Function Engine.GameUserSettings.*1af20eacd3 // Final|Native|Public|BlueprintCallable // @ game+0x671df70
	int32 *83b979d1ed(); // Function Engine.GameUserSettings.*83b979d1ed // Final|Native|Public|BlueprintCallable // @ game+0x6712fa4
	int32 *0e4dc47720(); // Function Engine.GameUserSettings.*0e4dc47720 // Final|Native|Public|BlueprintCallable // @ game+0x5975238
	int32 *a4c56a10e8(); // Function Engine.GameUserSettings.*a4c56a10e8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x671473c
	void *e003595b99(); // Function Engine.GameUserSettings.*e003595b99 // Native|Public|BlueprintCallable // @ game+0x613fc14
	float *39acf58d60(); // Function Engine.GameUserSettings.*39acf58d60 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6716944
	bool *b1719dcbd3(); // Function Engine.GameUserSettings.*b1719dcbd3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x671fa0c
	float *1f9b042806(); // Function Engine.GameUserSettings.*1f9b042806 // Final|Native|Public|BlueprintCallable // @ game+0x671e43c
	void *70c5a018bc(); // Function Engine.GameUserSettings.*70c5a018bc // Native|Public|BlueprintCallable // @ game+0xb241c0
	int32 *19d9f88411(); // Function Engine.GameUserSettings.*19d9f88411 // Native|Public|BlueprintCallable // @ game+0x671e1d8
	int32 *c5db66ecf0(); // Function Engine.GameUserSettings.*c5db66ecf0 // Final|Native|Public|BlueprintCallable // @ game+0x671dbe8
	enum class EWindowMode *fb3ecc5f8a(); // Function Engine.GameUserSettings.*fb3ecc5f8a // Final|Native|Static|Public|BlueprintCallable // @ game+0xc9f798
	bool *01750178be(); // Function Engine.GameUserSettings.*01750178be // Final|Native|Public|BlueprintCallable // @ game+0x671ddb0
	int32 *253ceb23cd(); // Function Engine.GameUserSettings.*253ceb23cd // Final|Native|Public|BlueprintCallable // @ game+0x671dc74
	float *2b0d9d2a79(); // Function Engine.GameUserSettings.*2b0d9d2a79 // Native|Public|BlueprintCallable // @ game+0x6714ba4
	float *2762cf8a23(); // Function Engine.GameUserSettings.*2762cf8a23 // Native|Public|BlueprintCallable // @ game+0x671da78
	bool *7c9471f86f(); // Function Engine.GameUserSettings.*7c9471f86f // Native|Public|BlueprintCallable // @ game+0x597ae24
	int32 *462455abf2(); // Function Engine.GameUserSettings.*462455abf2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6714968
	int32 *8fb8bbfe8c(); // Function Engine.GameUserSettings.*8fb8bbfe8c // Final|Native|Public|BlueprintCallable // @ game+0x671ea00
	int32 SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x671e3a8
	struct FIntPoint *18aa570765(); // Function Engine.GameUserSettings.*18aa570765 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x671e648
	bool *cbbc450a67(); // Function Engine.GameUserSettings.*cbbc450a67 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6717b0c
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x599ed3c
	int32 *98fe66b47d(); // Function Engine.GameUserSettings.*98fe66b47d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6716114
	void *c2ac335ef2(); // Function Engine.GameUserSettings.*c2ac335ef2 // Native|Public|BlueprintCallable // @ game+0xb485d0
	bool *1417bc70d8(); // Function Engine.GameUserSettings.*1417bc70d8 // Final|Native|Public|BlueprintCallable // @ game+0x671ea8c
	int32 *4bfc82e40c(); // Function Engine.GameUserSettings.*4bfc82e40c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6714728
	int32 *0ea0655862(); // Function Engine.GameUserSettings.*0ea0655862 // Final|Native|Public|BlueprintCallable // @ game+0x671e6d4
	int32 *6f801f756b(); // Function Engine.GameUserSettings.*6f801f756b // Final|Native|Public|BlueprintCallable // @ game+0x671e26c
	float *96792ea9be(); // Function Engine.GameUserSettings.*96792ea9be // Native|Public|BlueprintCallable // @ game+0x671663c
	void *30d98f1383(); // Function Engine.GameUserSettings.*30d98f1383 // Native|Public|BlueprintCallable // @ game+0x670c398
	bool *f52b5d8c43(); // Function Engine.GameUserSettings.*f52b5d8c43 // Final|Native|Public|BlueprintCallable // @ game+0x670c3b0
	bool *f7e8ffca10(); // Function Engine.GameUserSettings.*f7e8ffca10 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6717b20
	enum class EWindowMode *9d1ceffc6e(); // Function Engine.GameUserSettings.*9d1ceffc6e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67151a4
	void *09cbb06d9b(); // Function Engine.GameUserSettings.*09cbb06d9b // Native|Public|BlueprintCallable // @ game+0x597ad74
	bool *abd7b80fbb(); // Function Engine.GameUserSettings.*abd7b80fbb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6718070
	struct FIntPoint *d9253d9e28(); // Function Engine.GameUserSettings.*d9253d9e28 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6714be8
	bool *3a4644ef87(); // Function Engine.GameUserSettings.*3a4644ef87 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x671804c
	void *0d786d6dde(); // Function Engine.GameUserSettings.*0d786d6dde // Final|Native|Public|BlueprintCallable // @ game+0x670fedc
	struct UGameUserSettings* *c52ab52f73(); // Function Engine.GameUserSettings.*c52ab52f73 // Final|Native|Static|Public|BlueprintCallable // @ game+0x67152a4
	void *04b3937605(); // Function Engine.GameUserSettings.*04b3937605 // Final|Native|Public|BlueprintCallable // @ game+0x671dd00
	bool *bb4ea235c8(); // Function Engine.GameUserSettings.*bb4ea235c8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6717ae8
	bool *ef9cfc0dd7(); // Function Engine.GameUserSettings.*ef9cfc0dd7 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xadbdfc
	float *e4deeee6a7(); // Function Engine.GameUserSettings.*e4deeee6a7 // Final|Native|Public|BlueprintCallable // @ game+0x671e2f8
	bool *d3b2ed12c4(); // Function Engine.GameUserSettings.*d3b2ed12c4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6718008
	int32 *ff43f20d88(); // Function Engine.GameUserSettings.*ff43f20d88 // Final|Native|Public|BlueprintCallable // @ game+0x671de3c
	void *948dbc9289(); // Function Engine.GameUserSettings.*948dbc9289 // Final|Native|Public|BlueprintCallable // @ game+0x671d504
	float *e27f582866(); // Function Engine.GameUserSettings.*e27f582866 // Final|Native|Public|BlueprintCallable // @ game+0x671ded8
	int32 *311788f411(); // Function Engine.GameUserSettings.*311788f411 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6715ba0
	int32 *44533d5b92(); // Function Engine.GameUserSettings.*44533d5b92 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6717614
	enum class EWindowMode *679f5c0b66(); // Function Engine.GameUserSettings.*679f5c0b66 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x671567c
	int32 *3e2e37d8ce(); // Function Engine.GameUserSettings.*3e2e37d8ce // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6715178
	bool *25f609df00(); // Function Engine.GameUserSettings.*25f609df00 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x670fa98
	int32 *209c135f63(); // Function Engine.GameUserSettings.*209c135f63 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67172d0
};

// Class Engine.GameInstance
// Size: 0x1f0 (Inherited: 0x30)
struct UGameInstance : UObject {
	char pad_30[0x20]; // 0x30(0x20)
	struct U*ff4b8fbd53* *ff4b8fbd53; // 0x50(0x08)
	char pad_58[0xa8]; // 0x58(0xa8)
	struct U*07115daa65* *07115daa65; // 0x100(0x08)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0x108(0x10)
	char pad_118[0xd8]; // 0x118(0xd8)

	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x273e04
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x273e04
	bool HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x273e04
	int32 DebugCreatePlayer(); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x66befe0
	enum class ETravelFailure HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x273e04
	int32 DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x66bf074
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x273e04
};

// Class Engine.TriggerBase
// Size: 0x408 (Inherited: 0x400)
struct ATriggerBase : AActor {
	struct U*18316965f0* CollisionComponent; // 0x400(0x08)
};

// Class Engine.TriggerBox
// Size: 0x408 (Inherited: 0x408)
struct ATriggerBox : ATriggerBase {
};

// Class Engine.CapsuleComponent
// Size: 0xa40 (Inherited: 0xa30)
struct UCapsuleComponent : U*18316965f0 {
	float CapsuleHalfHeight; // 0xa28(0x04)
	float CapsuleRadius; // 0xa2c(0x04)
	float CapsuleHeight; // 0xa30(0x04)
	char pad_A3C[0x4]; // 0xa3c(0x04)

	float *8581b57d25(); // Function Engine.CapsuleComponent.*8581b57d25 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfb28
	bool *22d813c561(); // Function Engine.CapsuleComponent.*22d813c561 // Final|Native|Public|BlueprintCallable // @ game+0x66edeac
	float *9c532adaa0(); // Function Engine.CapsuleComponent.*9c532adaa0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1e64
	float *31f97e3a3d(); // Function Engine.CapsuleComponent.*31f97e3a3d // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1f84
	float *0733f827b9(); // Function Engine.CapsuleComponent.*0733f827b9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1e28
	float *8a4d91c968(); // Function Engine.CapsuleComponent.*8a4d91c968 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfb74
	float *7b5e58ae13(); // Function Engine.CapsuleComponent.*7b5e58ae13 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfad4
	float *b69a96696e(); // Function Engine.CapsuleComponent.*b69a96696e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfa88
	float *ab5f12a9c7(); // Function Engine.CapsuleComponent.*ab5f12a9c7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1e7c
	float *980989f2cc(); // Function Engine.CapsuleComponent.*980989f2cc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfedc
	struct FName *3292c0b7df(); // Function Engine.CapsuleComponent.*3292c0b7df // Native|Public|BlueprintCallable // @ game+0x66a3e7c
	float *194972df68(); // Function Engine.CapsuleComponent.*194972df68 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1e40
	enum class ECollisionResponse *e5ffb56c9a(); // Function Engine.CapsuleComponent.*e5ffb56c9a // Native|Public|BlueprintCallable // @ game+0x66a3f10
	enum class ECollisionResponse *21a20b6c62(); // Function Engine.CapsuleComponent.*21a20b6c62 // Native|Public|BlueprintCallable // @ game+0x66a3fa8
	bool *3b43bcc845(); // Function Engine.CapsuleComponent.*3b43bcc845 // Final|Native|Public|BlueprintCallable // @ game+0x66edf98
	float *39a2e64c25(); // Function Engine.CapsuleComponent.*39a2e64c25 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfca8
	bool *190066363c(); // Function Engine.CapsuleComponent.*190066363c // Final|Native|Public|BlueprintCallable // @ game+0x66edd14
};

// Class Engine.PhysicsVolume
// Size: 0x450 (Inherited: 0x438)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x438(0x04)
	int32 Priority; // 0x43c(0x04)
	float FluidFriction; // 0x440(0x04)
	char bWaterVolume : 1; // 0x444(0x01)
	char bPhysicsOnContact : 1; // 0x444(0x01)
	char pad_444_2 : 6; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	bool *1c6bffdd5f; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x800 (Inherited: 0x7b0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7b0(0x01)
	char *b3d628f82e : 1; // 0x7b0(0x01)
	char pad_7B0_2 : 6; // 0x7b0(0x01)
	char pad_7B1[0x7]; // 0x7b1(0x07)
	struct U*4d37f15df7* *42bf489806; // 0x7b8(0x08)
	char pad_7C0[0x20]; // 0x7c0(0x20)
	float SpeedScale; // 0x7e0(0x04)
	float InitialMaxSpeed; // 0x7e4(0x04)
	float InitialAccel; // 0x7e8(0x04)
	float InitialDecel; // 0x7ec(0x04)
	char pad_7F0[0x10]; // 0x7f0(0x10)

	float *662fc7afd6(); // Function Engine.DebugCameraController.*662fc7afd6 // Final|Native|Public|BlueprintCallable // @ game+0x66a69fc
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x66a8ab0
	void *f8260a0915(); // Function Engine.DebugCameraController.*f8260a0915 // Final|Native|Public|BlueprintCallable // @ game+0x66a98b0
	struct AActor* *b3cfc5896b(); // Function Engine.DebugCameraController.*b3cfc5896b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6695378
	struct FHitResult ReceiveOnActorSelected(); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x273e04
	struct APlayerController* ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x273e04
	struct APlayerController* ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x273e04
};

// Class Engine.Channel
// Size: 0x70 (Inherited: 0x30)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x38]; // 0x38(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x70)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_78[0x2f8]; // 0x78(0x2f8)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	char pad_370[0x20]; // 0x370(0x20)
};

// Class Engine.NavigationObjectBase
// Size: 0x428 (Inherited: 0x400)
struct ANavigationObjectBase : AActor {
	char pad_400[0x8]; // 0x400(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x408(0x08)
	struct UBillboardComponent* *b6f12a9063; // 0x410(0x08)
	struct UBillboardComponent* *a948621fe9; // 0x418(0x08)
	char *e5dc707706 : 1; // 0x420(0x01)
	char pad_420_1 : 7; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
};

// Class Engine.PlayerStart
// Size: 0x430 (Inherited: 0x428)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x428(0x08)
};

// Class Engine.CheatManager
// Size: 0x80 (Inherited: 0x30)
struct UCheatManager : UObject {
	struct ADebugCameraController* *d00d1e9c98; // 0x30(0x08)
	struct UClass* DebugCameraControllerClass; // 0x38(0x08)
	char pad_40[0x40]; // 0x40(0x40)

	struct UClass* DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x6053b54
	struct FString BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x670e1ac
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x599ed54
	struct FString ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x6721058
	bool DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x67129e4
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x672111c
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x592090c
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x671cd68
	float DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x6712868
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x6717a7c
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x6712dd0
	void *b86a954d75(); // Function Engine.CheatManager.*b86a954d75 // Native|Protected|BlueprintCallable // @ game+0xcc512c
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x599ecfc
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x599ed6c
	float SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x671e140
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x67129cc
	struct FName StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x671f5f8
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0x597ad74
	struct FName OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x671c5d8
	struct UClass* DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x6712b74
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x67207f8
	enum class ECollisionChannel DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x6712934
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x671291c
	float FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x6714598
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x671cb58
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x6712c08
	void *94bb7e21d2(); // Function Engine.CheatManager.*94bb7e21d2 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x671db9c
	void *2d2ff9b3aa(); // Function Engine.CheatManager.*2d2ff9b3aa // Native|Protected|BlueprintCallable // @ game+0x6712e98
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x6712e00
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x273e04
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x671b150
	struct UClass* ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x6720fc4
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0x6712a7c
	float ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x670fac0
	struct FString BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x670decc
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x273e04
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x671ec94
	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x599ed3c
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x67207e0
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x671e12c
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x671fa34
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x6714580
	struct FString Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x671f948
	struct FString CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x670fb5c
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x6712904
	float Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x671f060
	float DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x6712a94
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x599eca4
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x6712de8
	struct FName ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x6720f30
	struct FName StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x671f68c
	float BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x670df90
};

// Class Engine.*1dc0463579
// Size: 0xa20 (Inherited: 0xa10)
struct U*1dc0463579 : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0xa10(0x10)
};

// Class Engine.NavArea
// Size: 0x48 (Inherited: 0x30)
struct UNavArea : UObject {
	float DefaultCost; // 0x30(0x04)
	float FixedAreaEnteringCost; // 0x34(0x04)
	struct FColor DrawColor; // 0x38(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x3c(0x04)
	char bSupportsAgent0 : 1; // 0x40(0x01)
	char bSupportsAgent1 : 1; // 0x40(0x01)
	char bSupportsAgent2 : 1; // 0x40(0x01)
	char bSupportsAgent3 : 1; // 0x40(0x01)
	char bSupportsAgent4 : 1; // 0x40(0x01)
	char bSupportsAgent5 : 1; // 0x40(0x01)
	char bSupportsAgent6 : 1; // 0x40(0x01)
	char bSupportsAgent7 : 1; // 0x40(0x01)
	char bSupportsAgent8 : 1; // 0x41(0x01)
	char bSupportsAgent9 : 1; // 0x41(0x01)
	char bSupportsAgent10 : 1; // 0x41(0x01)
	char bSupportsAgent11 : 1; // 0x41(0x01)
	char bSupportsAgent12 : 1; // 0x41(0x01)
	char bSupportsAgent13 : 1; // 0x41(0x01)
	char bSupportsAgent14 : 1; // 0x41(0x01)
	char bSupportsAgent15 : 1; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x408 (Inherited: 0x400)
struct ALevelScriptActor : AActor {
	char *73f286284f : 1; // 0x400(0x01)
	char pad_400_1 : 7; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)

	bool *22f1694b2b(); // Function Engine.LevelScriptActor.*22f1694b2b // Native|Public|BlueprintCallable // @ game+0x786210
	bool *9b041afb0b(); // Function Engine.LevelScriptActor.*9b041afb0b // Native|Public|BlueprintCallable // @ game+0x59a5014
	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x273e04
	struct FIntVector WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x273e04
};

// Class Engine.ChildActorComponent
// Size: 0x510 (Inherited: 0x4e0)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x4e0(0x08)
	struct AActor* ChildActor; // 0x4e8(0x08)
	struct AActor* ChildActorTemplate; // 0x4f0(0x08)
	char pad_4F8[0x18]; // 0x4f8(0x18)

	struct UClass* *ce4ff9f46d(); // Function Engine.ChildActorComponent.*ce4ff9f46d // Final|Native|Public|BlueprintCallable // @ game+0x66a3b64
};

// Class Engine.CameraComponent
// Size: 0xad0 (Inherited: 0x4e0)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x4e0(0x04)
	float OrthoWidth; // 0x4e4(0x04)
	float OrthoNearClipPlane; // 0x4e8(0x04)
	float OrthoFarClipPlane; // 0x4ec(0x04)
	float AspectRatio; // 0x4f0(0x04)
	char bConstrainAspectRatio : 1; // 0x4f4(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x4f4(0x01)
	char bLockToHmd : 1; // 0x4f4(0x01)
	char bUsePawnControlRotation : 1; // 0x4f4(0x01)
	char pad_4F4_4 : 4; // 0x4f4(0x01)
	char pad_4F5[0x3]; // 0x4f5(0x03)
	enum class ECameraProjectionMode ProjectionMode; // 0x4f8(0x01)
	char pad_4F9[0x3]; // 0x4f9(0x03)
	float PostProcessBlendWeight; // 0x4fc(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x500(0x570)
	char pad_A70[0x58]; // 0xa70(0x58)
	char bUseControllerViewRotation : 1; // 0xac8(0x01)
	char pad_AC8_1 : 7; // 0xac8(0x01)
	char pad_AC9[0x7]; // 0xac9(0x07)

	float *51ae0236f3(); // Function Engine.CameraComponent.*51ae0236f3 // Final|Native|Public|BlueprintCallable // @ game+0x66ec52c
	float *e8609babef(); // Function Engine.CameraComponent.*e8609babef // Final|Native|Public|BlueprintCallable // @ game+0x66f5620
	enum class ECameraProjectionMode *da2c35fd6a(); // Function Engine.CameraComponent.*da2c35fd6a // Final|Native|Public|BlueprintCallable // @ game+0x66f6454
	float *f9e81d2a53(); // Function Engine.CameraComponent.*f9e81d2a53 // Final|Native|Public|BlueprintCallable // @ game+0x66f60c8
	struct F*6d0e0b2cc1 *246cb05f09(); // Function Engine.CameraComponent.*246cb05f09 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x66c7e2c
	bool *cb101c76b1(); // Function Engine.CameraComponent.*cb101c76b1 // Final|Native|Public|BlueprintCallable // @ game+0x66f982c
	float *44f5458990(); // Function Engine.CameraComponent.*44f5458990 // Final|Native|Public|BlueprintCallable // @ game+0x66f5588
	float *8480288ca6(); // Function Engine.CameraComponent.*8480288ca6 // Final|Native|Public|BlueprintCallable // @ game+0x66af094
	float *f96592d2aa(); // Function Engine.CameraComponent.*f96592d2aa // Final|Native|Public|BlueprintCallable // @ game+0x66f139c
	bool *5bc288c41d(); // Function Engine.CameraComponent.*5bc288c41d // Final|Native|Public|BlueprintCallable // @ game+0x66eed48
	float *f01ddbe3ef(); // Function Engine.CameraComponent.*f01ddbe3ef // Final|Native|Public|BlueprintCallable // @ game+0x66f3004
};

// Class Engine.Engine
// Size: 0xf50 (Inherited: 0x30)
struct UEngine : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FStringAssetReference TinyFontName; // 0x40(0x10)
	struct UFont* SmallFont; // 0x50(0x08)
	struct FStringAssetReference SmallFontName; // 0x58(0x10)
	struct UFont* *43105ceb99; // 0x68(0x08)
	struct FStringAssetReference MediumFontName; // 0x70(0x10)
	struct UFont* LargeFont; // 0x80(0x08)
	struct FStringAssetReference LargeFontName; // 0x88(0x10)
	struct UFont* *529be18812; // 0x98(0x08)
	struct FStringAssetReference SubtitleFontName; // 0xa0(0x10)
	struct TArray<struct UFont*> *df25b95969; // 0xb0(0x10)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0xc0(0x10)
	struct TArray<struct F*a72ab554af> ActiveStructRedirects; // 0xd0(0x10)
	int32 MaxParticleResizeWarn; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0xe8(0x10)
	struct FStringAssetReference MiniFontTextureName; // 0xf8(0x10)
	struct FColor *192e526923; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x110(0x10)
	int32 *a344514e05; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct UMaterial* *1f9f176dd8; // 0x128(0x08)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0x130(0x10)
	char bAllowMatureLanguage : 1; // 0x140(0x01)
	char pad_140_1 : 7; // 0x140(0x01)
	char pad_141[0x3]; // 0x141(0x03)
	float CameraRotationThreshold; // 0x144(0x04)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x148(0x01)
	char pad_148_1 : 7; // 0x148(0x01)
	char pad_149[0x3]; // 0x149(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0x14c(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x150(0x01)
	char pad_150_1 : 7; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x158(0x08)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x160(0x10)
	struct UTexture2D* *16c3f7b8ed; // 0x170(0x08)
	struct UClass* *fe1481b5c8; // 0x178(0x08)
	float MeshLODRange; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
	struct UMaterial* *62fa611f80; // 0x188(0x08)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0x190(0x10)
	struct FStringAssetReference ArrowMaterialName; // 0x1a0(0x10)
	struct UGameUserSettings* GameUserSettings; // 0x1b0(0x08)
	struct UGameViewportClient* GameViewport; // 0x1b8(0x08)
	struct UMaterial* *31885943df; // 0x1c0(0x08)
	struct FString *89fb77e73a; // 0x1c8(0x10)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x1d8(0x10)
	struct UObject* *efb601c0d7; // 0x1e8(0x08)
	struct UTexture2D* *6487bfa9fa; // 0x1f0(0x08)
	struct UTexture2D* *c594b99558; // 0x1f8(0x08)
	struct UTexture2D* *98f6787349; // 0x200(0x08)
	struct FFloatRange SmoothedFrameRateRange; // 0x208(0x10)
	struct UTexture2D* DefaultTexture; // 0x218(0x08)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x220(0x10)
	float RenderLightMapDensityGrayscaleScale; // 0x230(0x04)
	struct FColor *c1f4779d2d; // 0x234(0x04)
	struct FStringClassReference LocalPlayerClassName; // 0x238(0x10)
	float CameraTranslationThreshold; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x250(0x10)
	struct UMaterialInstanceDynamic* *c546a776e0; // 0x260(0x08)
	struct UTexture* DefaultDiffuseTexture; // 0x268(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x270(0x10)
	struct UMaterial* VertexColorMaterial; // 0x280(0x08)
	struct FColor *c7c24b22f6; // 0x288(0x04)
	char pad_28C[0xc]; // 0x28c(0x0c)
	struct FStringClassReference AssetManagerClassName; // 0x298(0x10)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct TArray<struct F*ce85c43b15> ActivePluginRedirects; // 0x2b0(0x10)
	struct UMaterialInstanceDynamic* *498d4ec4e1; // 0x2c0(0x08)
	struct UMaterialInstanceDynamic* *dd5dd57e60; // 0x2c8(0x08)
	struct UAssetManager* AssetManager; // 0x2d0(0x08)
	struct UClass* *c79d88195f; // 0x2d8(0x08)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x2e0(0x10)
	char bSubtitlesForcedOff : 1; // 0x2f0(0x01)
	char pad_2F0_1 : 7; // 0x2f0(0x01)
	char pad_2F1[0x7]; // 0x2f1(0x07)
	struct UClass* *6ab1c3b78a; // 0x2f8(0x08)
	struct UTexture* WeightMapPlaceholderTexture; // 0x300(0x08)
	struct FStringAssetReference DefaultPhysMaterialName; // 0x308(0x10)
	struct UTexture2D* *2dbaebc744; // 0x318(0x08)
	struct UClass* *9cf85956b5; // 0x320(0x08)
	struct UTexture2D* MiniFontTexture; // 0x328(0x08)
	struct FStringClassReference AIControllerClassName; // 0x330(0x10)
	enum class *a483700a66 *3c98a1a7dd; // 0x340(0x01)
	char pad_341[0x7]; // 0x341(0x07)
	struct UClass* *2d50dcfa17; // 0x348(0x08)
	struct UMaterialInstanceDynamic* *2119402b4a; // 0x350(0x08)
	struct FStringAssetReference DefaultBokehTextureName; // 0x358(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x368(0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x378(0x10)
	float *25fcb3b672; // 0x388(0x04)
	struct FColor *8778089533; // 0x38c(0x04)
	struct UMaterialInstanceDynamic* *5459d9699e; // 0x390(0x08)
	float MinLightMapDensity; // 0x398(0x04)
	struct FColor *7011171afe; // 0x39c(0x04)
	struct UMaterial* *dd5db1982c; // 0x3a0(0x08)
	float MaxLightMapDensity; // 0x3a8(0x04)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct TArray<struct FString> AdditionalFontNames; // 0x3b0(0x10)
	struct UTextureCube* *019d032e90; // 0x3c0(0x08)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x3c8(0x10)
	struct TArray<struct F*6b88783d53> ActiveGameNameRedirects; // 0x3d8(0x10)
	struct FString WireframeMaterialName; // 0x3e8(0x10)
	struct TArray<struct F*2f5df3d7dc> ActiveClassRedirects; // 0x3f8(0x10)
	char bCanBlueprintsTickByDefault : 1; // 0x408(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x408(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x408(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x408(0x01)
	char pad_408_4 : 1; // 0x408(0x01)
	char bSmoothFrameRate : 1; // 0x408(0x01)
	char bUseFixedFrameRate : 1; // 0x408(0x01)
	char pad_408_7 : 1; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct TArray<struct F*73d1c21239> StatColorMappings; // 0x410(0x10)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0x420(0x10)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0x430(0x10)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x440(0x10)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x450(0x10)
	struct FColor *c944d746ad; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct FString LevelColorationLitMaterialName; // 0x468(0x10)
	float DisplayGamma; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct FString PlayOnConsoleSaveDir; // 0x480(0x10)
	struct UMaterial* LevelColorationLitMaterial; // 0x490(0x08)
	struct FString VertexColorMaterialName; // 0x498(0x10)
	struct F*28687cc503 PhysicErrorCorrection; // 0x4a8(0x1c)
	struct FLinearColor LightMapDensitySelectedColor; // 0x4c4(0x10)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	struct UMaterial* RemoveSurfaceMaterial; // 0x4d8(0x08)
	float PrimitiveProbablyVisibleTime; // 0x4e0(0x04)
	float IdealLightMapDensity; // 0x4e4(0x04)
	float MinDesiredFrameRate; // 0x4e8(0x04)
	char pad_4EC[0x4]; // 0x4ec(0x04)
	struct FString LevelColorationUnlitMaterialName; // 0x4f0(0x10)
	int32 *1b556eb405; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct FString *5e1c88c287; // 0x508(0x10)
	struct UClass* *939ce45cf3; // 0x518(0x08)
	struct FStringClassReference LevelScriptActorClassName; // 0x520(0x10)
	struct UMaterial* *167d4506be; // 0x530(0x08)
	char bRenderLightMapDensityGrayscale : 1; // 0x538(0x01)
	char pad_538_1 : 7; // 0x538(0x01)
	char pad_539[0x3]; // 0x539(0x03)
	float NetClientTicksPerSecond; // 0x53c(0x04)
	struct UMaterial* *46fcb09c9b; // 0x540(0x08)
	char bSubtitlesEnabled : 1; // 0x548(0x01)
	char pad_548_1 : 7; // 0x548(0x01)
	char pad_549[0x3]; // 0x549(0x03)
	struct FColor *4709a765b0; // 0x54c(0x04)
	float MaxOcclusionPixelsFraction; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	struct UClass* *36300cd617; // 0x558(0x08)
	struct UTexture2D* *e051d30398; // 0x560(0x08)
	struct TArray<struct F*7c4552fed2> *74257aa68c; // 0x568(0x10)
	struct UMaterialInstanceDynamic* *d52bb2e916; // 0x578(0x08)
	char bPauseOnLossOfFocus : 1; // 0x580(0x01)
	char pad_580_1 : 7; // 0x580(0x01)
	char pad_581[0x3]; // 0x581(0x03)
	int32 MaxParticleResize; // 0x584(0x04)
	int32 MaximumLoopIterationCount; // 0x588(0x04)
	struct FColor *50e4ab95e6; // 0x58c(0x04)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x590(0x08)
	struct UMaterial* WireframeMaterial; // 0x598(0x08)
	struct FStringClassReference ConsoleClassName; // 0x5a0(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x5b0(0x08)
	struct FColor *891c4f69de; // 0x5b8(0x04)
	char pad_5BC[0x54]; // 0x5bc(0x54)
	struct FStringClassReference WorldSettingsClassName; // 0x610(0x10)
	struct UClass* *174a7c81db; // 0x620(0x08)
	struct FStringClassReference GameSingletonClassName; // 0x628(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x638(0x08)
	float MaxPixelShaderAdditiveComplexityCount; // 0x640(0x04)
	char pad_644[0x4]; // 0x644(0x04)
	struct UMaterial* *e68fc694c0; // 0x648(0x08)
	char bHardwareSurveyEnabled : 1; // 0x650(0x01)
	char pad_650_1 : 7; // 0x650(0x01)
	char pad_651[0x3]; // 0x651(0x03)
	float FixedFrameRate; // 0x654(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x658(0x10)
	struct FLinearColor *71a3192718; // 0x668(0x10)
	struct FLinearColor *d45033e7a6; // 0x678(0x10)
	struct FLinearColor *ffccd8fd1b; // 0x688(0x10)
	struct FLinearColor *ca5c8cbcd4; // 0x698(0x10)
	bool *793423ca81; // 0x6a8(0x01)
	char pad_6A9[0x3]; // 0x6a9(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x6ac(0x01)
	char *ddd8bea2f1 : 1; // 0x6ac(0x01)
	char bSuppressMapWarnings : 1; // 0x6ac(0x01)
	char bDisableAILogging : 1; // 0x6ac(0x01)
	char pad_6AC_4 : 4; // 0x6ac(0x01)
	char pad_6AD[0x3]; // 0x6ad(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x6b0(0x04)
	struct FBox *fa997dc2ce; // 0x6b4(0x1c)
	char pad_6D0[0x4]; // 0x6d0(0x04)
	int32 *a4ea644295; // 0x6d4(0x04)
	char *5f4234ebf6 : 1; // 0x6d8(0x01)
	char pad_6D8_1 : 7; // 0x6d8(0x01)
	char pad_6D9[0x7]; // 0x6d9(0x07)
	struct FString ParticleEventManagerClassPath; // 0x6e0(0x10)
	char pad_6F0[0x20]; // 0x6f0(0x20)
	float SelectionHighlightIntensity; // 0x710(0x04)
	float *4ad7031367; // 0x714(0x04)
	float BSPSelectionHighlightIntensity; // 0x718(0x04)
	float HoverHighlightIntensity; // 0x71c(0x04)
	float *c96df757a0; // 0x720(0x04)
	float PrimitiveBaseIntensity; // 0x724(0x04)
	float PrimitiveSelectedIntensity; // 0x728(0x04)
	float PrimitiveHoverIntensity; // 0x72c(0x04)
	char pad_730[0x290]; // 0x730(0x290)
	struct FStringAssetReference LightMapDensityTextureName; // 0x9c0(0x10)
	struct FStringClassReference AvoidanceManagerClassName; // 0x9d0(0x10)
	struct FStringAssetReference DefaultTextureName; // 0x9e0(0x10)
	struct FColor *0edfcd2d1b; // 0x9f0(0x04)
	char pad_9F4[0x4]; // 0x9f4(0x04)
	struct FString LightingTexelDensityName; // 0x9f8(0x10)
	struct FString ShadedLevelColorationLitMaterialName; // 0xa08(0x10)
	struct UMaterialInstanceDynamic* *cba3a24030; // 0xa18(0x08)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0xa20(0x10)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0xa30(0x10)
	struct FColor *30bc7575f3; // 0xa40(0x04)
	char pad_A44[0x4]; // 0xa44(0x04)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0xa48(0x10)
	char pad_A58[0x1d8]; // 0xa58(0x1d8)
	struct TArray<struct F*e13e3afa12> NetDriverDefinitions; // 0xc30(0x10)
	struct TArray<struct FString> ServerActors; // 0xc40(0x10)
	struct TArray<struct FString> *585229a891; // 0xc50(0x10)
	char *07609786a3 : 1; // 0xc60(0x01)
	char pad_C60_1 : 7; // 0xc60(0x01)
	char pad_C61[0x7]; // 0xc61(0x07)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0xc68(0x10)
	float NearClipPlane; // 0xc78(0x04)
	char pad_C7C[0x4]; // 0xc7c(0x04)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0xc80(0x10)
	struct FStringClassReference GameViewportClientClassName; // 0xc90(0x10)
	struct FStringClassReference NavigationSystemClassName; // 0xca0(0x10)
	struct FStringClassReference GameUserSettingsClassName; // 0xcb0(0x10)
	struct UMaterial* *ba4b02b533; // 0xcc0(0x08)
	struct FColor *feb2694aca; // 0xcc8(0x04)
	char pad_CCC[0x4]; // 0xccc(0x04)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0xcd0(0x10)
	struct UMaterial* *22bea6dbb2; // 0xce0(0x08)
	struct FStringAssetReference DebugMeshMaterialName; // 0xce8(0x10)
	int32 *83ecc6816b; // 0xcf8(0x04)
	char pad_CFC[0x4]; // 0xcfc(0x04)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0xd00(0x10)
	struct UMaterial* *c6ef933beb; // 0xd10(0x08)
	struct UMaterial* *85c25c83f5; // 0xd18(0x08)
	struct FColor *3a3f396815; // 0xd20(0x04)
	char pad_D24[0x4]; // 0xd24(0x04)
	struct TArray<struct FString> *bae10a5147; // 0xd28(0x10)
	char pad_D38[0x18]; // 0xd38(0x18)
	struct UClass* *86fb8d6a19; // 0xd50(0x08)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0xd58(0x10)
	float RenderLightMapDensityColorScale; // 0xd68(0x04)
	struct FLinearColor LightingOnlyBrightness; // 0xd6c(0x10)
	struct FLinearColor LightingOnlySpecular; // 0xd7c(0x10)
	char pad_D8C[0x14]; // 0xd8c(0x14)
	int32 *7bf7828cff; // 0xda0(0x04)
	char pad_DA4[0x1ac]; // 0xda4(0x1ac)
};

// Class Engine.*267b167105
// Size: 0x40 (Inherited: 0x30)
struct U*267b167105 : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x670 (Inherited: 0x40)
struct UGameViewportClient : U*267b167105 {
	char pad_40[0x218]; // 0x40(0x218)
	struct UConsole* *0577cd079b; // 0x258(0x08)
	char pad_260[0x170]; // 0x260(0x170)
	struct TArray<struct F*943c6d0e82> *7fc15348f4; // 0x3d0(0x10)
	char pad_3E0[0x278]; // 0x3e0(0x278)
	struct UGameInstance* GameInstance; // 0x658(0x08)
	char pad_660[0x10]; // 0x660(0x10)

	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x66a9848
	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0xb241c0
	int32 SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x66eeb34
};

// Class Engine.Console
// Size: 0x110 (Inherited: 0x30)
struct UConsole : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct ULocalPlayer* *8cb17d72a2; // 0x40(0x08)
	struct UTexture2D* *d7075ad4d7; // 0x48(0x08)
	struct UTexture2D* *c697d5ef94; // 0x50(0x08)
	char pad_58[0x18]; // 0x58(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x70(0x10)
	char pad_80[0x90]; // 0x80(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c8 (Inherited: 0x30)
struct UNetDriver : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct FString NetConnectionClassName; // 0x38(0x10)
	int32 MaxDownloadSize; // 0x48(0x04)
	char bClampListenServerTickRate : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32 NetServerMaxTickRate; // 0x50(0x04)
	int32 MaxInternetClientRate; // 0x54(0x04)
	int32 MaxClientRate; // 0x58(0x04)
	float ServerTravelPause; // 0x5c(0x04)
	float SpawnPrioritySeconds; // 0x60(0x04)
	float RelevantTimeout; // 0x64(0x04)
	float KeepAliveTime; // 0x68(0x04)
	float InitialConnectTimeout; // 0x6c(0x04)
	float ConnectionTimeout; // 0x70(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x74(0x04)
	bool bNoTimeouts; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UNetConnection* *b95efedb68; // 0x80(0x08)
	struct TArray<struct UNetConnection*> *5caadb491a; // 0x88(0x10)
	char pad_98[0x28]; // 0x98(0x28)
	struct UWorld* World; // 0xc0(0x08)
	struct UPackage* *7ce0584c32; // 0xc8(0x08)
	char pad_D0[0x20]; // 0xd0(0x20)
	struct UClass* *6125afc26a; // 0xf0(0x08)
	struct UProperty* *08fb2db1ef; // 0xf8(0x08)
	struct UProperty* *169c3cf1e7; // 0x100(0x08)
	struct FName NetDriverName; // 0x108(0x08)
	char pad_110[0x8]; // 0x110(0x08)
	float Time; // 0x118(0x04)
	char pad_11C[0x3ac]; // 0x11c(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c8)
struct UDemoNetDriver : UNetDriver {
	char pad_4C8[0xf8]; // 0x4c8(0xf8)
	struct TMap<struct FString, struct F*bd2d09f136> *bb20b5ac02; // 0x5c0(0x50)
	char pad_610[0x430]; // 0x610(0x430)
	bool *583fbfe7b8; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.GameEngine
// Size: 0xfb0 (Inherited: 0xf50)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf48(0x04)
	float ServerFlushLogInterval; // 0xf4c(0x04)
	struct UGameInstance* GameInstance; // 0xf50(0x08)
	char pad_F60[0x38]; // 0xf60(0x38)
	struct TArray<struct UWorld*> *30f0e73cd5; // 0xf98(0x10)
	char pad_FA8[0x8]; // 0xfa8(0x08)
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
struct UPlayer : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	int32 *43861e1339; // 0x40(0x04)
	int32 ConfiguredInternetSpeed; // 0x44(0x04)
	int32 ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.NetConnection
// Size: 0x65850 (Inherited: 0x50)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UClass* *c9a07c0e0e; // 0x68(0x08)
	struct UPackageMap* PackageMap; // 0x70(0x08)
	struct TArray<struct UChannel*> *969e2f926f; // 0x78(0x10)
	struct TArray<struct AActor*> *450acb6ca0; // 0x88(0x10)
	struct AActor* ViewTarget; // 0x98(0x08)
	struct AActor* *c907380c05; // 0xa0(0x08)
	int32 *95374739ae; // 0xa8(0x04)
	char *9c3073c60b : 1; // 0xac(0x01)
	char pad_AC_1 : 1; // 0xac(0x01)
	char *7e187ea680 : 1; // 0xac(0x01)
	char pad_AC_3 : 5; // 0xac(0x01)
	char pad_AD[0x8b]; // 0xad(0x8b)
	struct TArray<struct UChannel*> *15c176d85f; // 0x138(0x10)
	char pad_148[0x28]; // 0x148(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x170(0x18)
	char pad_188[0x68]; // 0x188(0x68)
	double *1217438028; // 0x1f0(0x08)
	char pad_1F8[0x65538]; // 0x1f8(0x65538)
	struct TArray<struct UChannel*> *8d7214ce79; // 0x65730(0x10)
	char pad_65740[0x110]; // 0x65740(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x48 (Inherited: 0x30)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*8172d5eac2> ChannelDetails; // 0x30(0x10)
	float Duration; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.GameSession
// Size: 0x418 (Inherited: 0x400)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x400(0x04)
	int32 MaxPlayers; // 0x404(0x04)
	int32 *6dce3bcc33; // 0x408(0x04)
	bool MaxSplitscreensPerConnection; // 0x40c(0x01)
	bool bRequiresPushToTalk; // 0x40d(0x01)
	char pad_40E[0x2]; // 0x40e(0x02)
	struct FName SessionName; // 0x410(0x08)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc90 (Inherited: 0xbb0)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*4f3c2d44a1> PerInstanceSMData; // 0xbb0(0x10)
	int32 InstancingRandomSeed; // 0xbc0(0x04)
	int32 InstanceStartCullDistance; // 0xbc4(0x04)
	int32 InstanceEndCullDistance; // 0xbc8(0x04)
	char pad_BCC[0x4]; // 0xbcc(0x04)
	struct TArray<int32> *754184d020; // 0xbd0(0x10)
	struct TArray<int32> *c10d91a000; // 0xbe0(0x10)
	char pad_BF0[0x78]; // 0xbf0(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xc68(0x08)
	bool *977852e8ca; // 0xc70(0x01)
	char pad_C71[0x3]; // 0xc71(0x03)
	int32 *3cb8f168ab; // 0xc74(0x04)
	struct TArray<struct F*707001a8dd> *9da75a2d5b; // 0xc78(0x10)
	char pad_C88[0x8]; // 0xc88(0x08)

	bool *e5295d5ef3(); // Function Engine.InstancedStaticMeshComponent.*e5295d5ef3 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cb3f0
	bool *67da154cb1(); // Function Engine.InstancedStaticMeshComponent.*67da154cb1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66f2b14
	void *552630dc35(); // Function Engine.InstancedStaticMeshComponent.*552630dc35 // Native|Public|BlueprintCallable // @ game+0xd00f98
	int32 *e4e17343d9(); // Function Engine.InstancedStaticMeshComponent.*e4e17343d9 // Final|Native|Public|BlueprintCallable // @ game+0x66ef6e4
	bool *7459db3257(); // Function Engine.InstancedStaticMeshComponent.*7459db3257 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6703850
	int32 *82167e78cb(); // Function Engine.InstancedStaticMeshComponent.*82167e78cb // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66aeea0
	int32 *1ff5154222(); // Function Engine.InstancedStaticMeshComponent.*1ff5154222 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x593bc84
	bool *7799271b12(); // Function Engine.InstancedStaticMeshComponent.*7799271b12 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66caf60
	struct TArray<int32> *561b0d5362(); // Function Engine.InstancedStaticMeshComponent.*561b0d5362 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cbd0c
	bool *4981f52ac4(); // Function Engine.InstancedStaticMeshComponent.*4981f52ac4 // Native|Public|BlueprintCallable // @ game+0x66e8cc8
	int32 *01fde74119(); // Function Engine.InstancedStaticMeshComponent.*01fde74119 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66aea60
	struct TArray<int32> *a409ec8533(); // Function Engine.InstancedStaticMeshComponent.*a409ec8533 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cbba4
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xdc0 (Inherited: 0xc90)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C90[0x68]; // 0xc90(0x68)
	struct TArray<int32> *c35c6933db; // 0xcf8(0x10)
	int32 *995034b1b2; // 0xd08(0x04)
	char pad_D0C[0x4]; // 0xd0c(0x04)
	struct FBox *9ce4a0f35c; // 0xd10(0x1c)
	struct FBox *eeb6f14d03; // 0xd2c(0x1c)
	struct TArray<struct FBox> *7c7ca05821; // 0xd48(0x10)
	char pad_D58[0x20]; // 0xd58(0x20)
	int32 *18bd8b16a3; // 0xd78(0x04)
	struct FBoxSphereBounds *d45c6ff2a1; // 0xd7c(0x1c)
	char *09c59fbf3c : 1; // 0xd98(0x01)
	char *dac8477fb6 : 1; // 0xd98(0x01)
	char pad_D98_2 : 6; // 0xd98(0x01)
	char pad_D99[0x27]; // 0xd99(0x27)

	bool *c4d2b25a72(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*c4d2b25a72 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66e8d6c
};

// Class Engine.*5d118ed8c5
// Size: 0xdc0 (Inherited: 0xdc0)
struct U*5d118ed8c5 : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xdb8(0x04)
};

// Class Engine.NavLinkProxy
// Size: 0x450 (Inherited: 0x400)
struct ANavLinkProxy : AActor {
	char pad_400[0x10]; // 0x400(0x10)
	struct TArray<struct FNavigationLink> PointLinks; // 0x410(0x10)
	struct TArray<struct FNavigationSegmentLink> SegmentLinks; // 0x420(0x10)
	struct UNavLinkCustomComponent* SmartLinkComp; // 0x430(0x08)
	bool *c69861c740; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct FMulticastDelegate OnSmartLinkReached; // 0x440(0x10)

	bool *b60053683c(); // Function Engine.NavLinkProxy.*b60053683c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6697224
	struct FVector ReceiveSmartLinkReached(); // Function Engine.NavLinkProxy.ReceiveSmartLinkReached // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x273e04
	void *d9d695d546(); // Function Engine.NavLinkProxy.*d9d695d546 // Final|Native|Public // @ game+0xbf0020
	struct AActor* *774b5e08a9(); // Function Engine.NavLinkProxy.*774b5e08a9 // Final|Native|Public|BlueprintCallable // @ game+0x669eeb4
	bool *2058e6a129(); // Function Engine.NavLinkProxy.*2058e6a129 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66962c0
	bool *49e92ce488(); // Function Engine.NavLinkProxy.*49e92ce488 // Final|Native|Public|BlueprintCallable // @ game+0x66a7664
};

// Class Engine.LocalPlayer
// Size: 0x298 (Inherited: 0x50)
struct ULocalPlayer : UPlayer {
	char pad_50[0x8]; // 0x50(0x08)
	char *9b12f4d6bd : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x57]; // 0x59(0x57)
	struct UClass* *ff1a8deac9; // 0xb0(0x08)
	char pad_B8[0x1e0]; // 0xb8(0x1e0)
};

// Class Engine.*df0ac3a39d
// Size: 0x30 (Inherited: 0x30)
struct U*df0ac3a39d : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1d00 (Inherited: 0x400)
struct APlayerCameraManager : AActor {
	struct APlayerController* *e9fdc891fb; // 0x400(0x08)
	struct USceneComponent* TransformComponent; // 0x408(0x08)
	struct FVector FreeCamOffset; // 0x410(0x0c)
	char pad_41C[0x8]; // 0x41c(0x08)
	float DefaultOrthoWidth; // 0x424(0x04)
	char pad_428[0x4]; // 0x428(0x04)
	float ViewPitchMin; // 0x42c(0x04)
	float ViewRollMin; // 0x430(0x04)
	char pad_434[0x14]; // 0x434(0x14)
	float ViewPitchMax; // 0x448(0x04)
	float ViewYawMin; // 0x44c(0x04)
	struct F*ccdcf600a2 ViewTarget; // 0x450(0x5e0)
	char pad_A30[0x1c]; // 0xa30(0x1c)
	float FreeCamDistance; // 0xa4c(0x04)
	struct FVector ViewTargetOffset; // 0xa50(0x0c)
	float DefaultFOV; // 0xa5c(0x04)
	char pad_A60[0x4]; // 0xa60(0x04)
	float ViewYawMax; // 0xa64(0x04)
	struct TArray<struct U*d265edd002*> *e5a975db74; // 0xa68(0x10)
	struct TArray<struct UClass*> DefaultModifiers; // 0xa78(0x10)
	char pad_A88[0x14]; // 0xa88(0x14)
	float DefaultAspectRatio; // 0xa9c(0x04)
	char pad_AA0[0x10]; // 0xaa0(0x10)
	struct F*ccdcf600a2 *0c01e7dd74; // 0xab0(0x5e0)
	char pad_1090[0x8]; // 0x1090(0x08)
	struct TArray<struct AEmitterCameraLensEffectBase*> *23527db694; // 0x1098(0x10)
	struct U*50a4472fea* *a616bea493; // 0x10a8(0x08)
	struct U*faef588082* *949f36d826[0x08]; // 0x10b0(0x40)
	struct TArray<struct FPostProcessSettings> *129b64c87e; // 0x10f0(0x10)
	char pad_1100[0x10]; // 0x1100(0x10)
	struct TArray<struct U*faef588082*> *6e10f27828; // 0x1110(0x10)
	struct TArray<struct U*faef588082*> *08f08cc15c; // 0x1120(0x10)
	struct ACameraActor* *71a037b5ab; // 0x1130(0x08)
	char bIsOrthographic : 1; // 0x1138(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x1138(0x01)
	char pad_1138_2 : 5; // 0x1138(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1138(0x01)
	char pad_1139[0x7]; // 0x1139(0x07)
	struct F*6432761ee7 *2eaebbc30c; // 0x1140(0x5d0)
	float ViewRollMax; // 0x1710(0x04)
	char pad_1714[0x1c]; // 0x1714(0x1c)
	struct F*6432761ee7 *c63c0ee2d5; // 0x1730(0x5d0)

	bool *4b26d3d746(); // Function Engine.PlayerCameraManager.*4b26d3d746 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a8d54
	struct U*d265edd002* *0b6e473a67(); // Function Engine.PlayerCameraManager.*0b6e473a67 // Native|Public|BlueprintCallable // @ game+0x6687ec4
	void *ddd5440b92(); // Function Engine.PlayerCameraManager.*ddd5440b92 // Native|Public|BlueprintCallable // @ game+0x5930618
	void *b9872cbb46(); // Function Engine.PlayerCameraManager.*b9872cbb46 // Native|Public|BlueprintCallable // @ game+0x59cb7d4
	struct U*d265edd002* *f956aeed26(); // Function Engine.PlayerCameraManager.*f956aeed26 // Native|Public|BlueprintCallable // @ game+0x668f2f0
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x58e5114
	bool *30c87708fc(); // Function Engine.PlayerCameraManager.*30c87708fc // Native|Public|BlueprintCallable // @ game+0x66a926c
	struct FVector *83651ba534(); // Function Engine.PlayerCameraManager.*83651ba534 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xaca868
	struct FVector PhotographyCameraModify(); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x669d7bc
	struct FRotator *8b89fd6520(); // Function Engine.PlayerCameraManager.*8b89fd6520 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6690eb4
	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x59c9d74
	bool *526e73aebb(); // Function Engine.PlayerCameraManager.*526e73aebb // Native|Public|BlueprintCallable // @ game+0x66a9058
	bool BlueprintUpdateCamera(); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x273e04
	bool *df4de4472e(); // Function Engine.PlayerCameraManager.*df4de4472e // Native|Public|BlueprintCallable // @ game+0x66a93e4
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x59c9d5c
	bool *3d38e01887(); // Function Engine.PlayerCameraManager.*3d38e01887 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a5d74
	bool *6b65651478(); // Function Engine.PlayerCameraManager.*6b65651478 // Native|Public|BlueprintCallable // @ game+0x66a90f0
	float *739422debf(); // Function Engine.PlayerCameraManager.*739422debf // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691ea8
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5990144
	struct APlayerController* *596dfaadd8(); // Function Engine.PlayerCameraManager.*596dfaadd8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x598ceb8
	struct AEmitterCameraLensEffectBase* *16e171ab9f(); // Function Engine.PlayerCameraManager.*16e171ab9f // Native|Public|BlueprintCallable // @ game+0x669e690
	struct UCameraShake* *0673dfc389(); // Function Engine.PlayerCameraManager.*0673dfc389 // Native|Public|HasDefaults|BlueprintCallable // @ game+0xaad880
	bool *da8f8503b0(); // Function Engine.PlayerCameraManager.*da8f8503b0 // Native|Public|BlueprintCallable // @ game+0x66a94c8
	struct U*faef588082* *245befce61(); // Function Engine.PlayerCameraManager.*245befce61 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x669db50
	struct AEmitterCameraLensEffectBase* *9dc5c269a0(); // Function Engine.PlayerCameraManager.*9dc5c269a0 // Native|Public|BlueprintCallable // @ game+0x6686aa8
	bool *2a6bfee86c(); // Function Engine.PlayerCameraManager.*2a6bfee86c // Native|Public|BlueprintCallable // @ game+0x66a9188
	bool *36ef9f712e(); // Function Engine.PlayerCameraManager.*36ef9f712e // Native|Public|BlueprintCallable // @ game+0x669e724
};

// Class Engine.PlayerInput
// Size: 0x490 (Inherited: 0x30)
struct UPlayerInput : UObject {
	char pad_30[0xf8]; // 0x30(0xf8)
	struct TArray<struct F*61c810cf0e> DebugExecBindings; // 0x128(0x10)
	char pad_138[0x30]; // 0x138(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x168(0x10)
	char pad_178[0x318]; // 0x178(0x318)

	float SetGamePadSensitivity(); // Function Engine.PlayerInput.SetGamePadSensitivity // Final|Exec|Native|Public // @ game+0x66a4f44
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // Final|Exec|Native|Public // @ game+0x6689588
	struct FString SetBind(); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x66a35f0
	float SetGamePadSensitivityOf(); // Function Engine.PlayerInput.SetGamePadSensitivityOf // Final|Exec|Native|Public // @ game+0x66a4fdc
	float SetGamePadDeadZoneOf(); // Function Engine.PlayerInput.SetGamePadDeadZoneOf // Final|Exec|Native|Public // @ game+0x66a4e08
	struct FKey InvertAxisKey(); // Function Engine.PlayerInput.InvertAxisKey // Final|Exec|Native|Public // @ game+0x6696554
	float SetMouseSensitivity(); // Function Engine.PlayerInput.SetMouseSensitivity // Final|Exec|Native|Public // @ game+0x66a6488
	float SetGamePadDeadZone(); // Function Engine.PlayerInput.SetGamePadDeadZone // Final|Exec|Native|Public // @ game+0x66a4d70
	struct FName InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x66964c4
};

// Class Engine.NavigationData
// Size: 0x5a8 (Inherited: 0x400)
struct ANavigationData : AActor {
	struct UPrimitiveComponent* RenderingComp; // 0x400(0x08)
	struct F*dbc2be8864 *dbc2be8864; // 0x408(0x50)
	char *bf6d21a228 : 1; // 0x458(0x01)
	char bForceRebuildOnLoad : 1; // 0x458(0x01)
	char bCanBeMainNavData : 1; // 0x458(0x01)
	char bCanSpawnOnRebuild : 1; // 0x458(0x01)
	char bRebuildAtRuntime : 1; // 0x458(0x01)
	char pad_458_5 : 3; // 0x458(0x01)
	char pad_459[0x3]; // 0x459(0x03)
	enum class ERuntimeGenerationType RuntimeGeneration; // 0x45c(0x01)
	char pad_45D[0x3]; // 0x45d(0x03)
	float ObservedPathsTickInterval; // 0x460(0x04)
	char *5450a494ed : 1; // 0x464(0x01)
	char pad_464_1 : 7; // 0x464(0x01)
	char pad_465[0x3]; // 0x465(0x03)
	uint32 DataVersion; // 0x468(0x04)
	char pad_46C[0xd4]; // 0x46c(0xd4)
	struct TArray<struct F*a098f5a73b> *efbca435e7; // 0x540(0x10)
	char pad_550[0x58]; // 0x550(0x58)
};

// Class Engine.RecastNavMesh
// Size: 0x6c0 (Inherited: 0x5a8)
struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x5a8(0x01)
	char bDrawPolyEdges : 1; // 0x5a8(0x01)
	char bDrawFilledPolys : 1; // 0x5a8(0x01)
	char bDrawNavMeshEdges : 1; // 0x5a8(0x01)
	char *afbdbd43dd : 1; // 0x5a8(0x01)
	char *2b90e490d1 : 1; // 0x5a8(0x01)
	char *5a07d7cafb : 1; // 0x5a8(0x01)
	char *c82954ac6b : 1; // 0x5a8(0x01)
	char *9898141409 : 1; // 0x5a9(0x01)
	char *34275df68e : 1; // 0x5a9(0x01)
	char *1d0f9691e4 : 1; // 0x5a9(0x01)
	char *6256b34fc7 : 1; // 0x5a9(0x01)
	char *484c9504d8 : 1; // 0x5a9(0x01)
	char *e3d71e5fe2 : 1; // 0x5a9(0x01)
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x5a9(0x01)
	char *d60bce4234 : 1; // 0x5a9(0x01)
	char pad_5AA[0x2]; // 0x5aa(0x02)
	float DrawOffset; // 0x5ac(0x04)
	char bFixedTilePoolSize : 1; // 0x5b0(0x01)
	char pad_5B0_1 : 7; // 0x5b0(0x01)
	char pad_5B1[0x3]; // 0x5b1(0x03)
	int32 TilePoolSize; // 0x5b4(0x04)
	float TileSizeUU; // 0x5b8(0x04)
	float CellSize; // 0x5bc(0x04)
	float CellHeight; // 0x5c0(0x04)
	float AgentRadius; // 0x5c4(0x04)
	float AgentHeight; // 0x5c8(0x04)
	float AgentMaxHeight; // 0x5cc(0x04)
	float AgentMaxSlope; // 0x5d0(0x04)
	float AgentMaxStepHeight; // 0x5d4(0x04)
	float MinRegionArea; // 0x5d8(0x04)
	float MergeRegionSize; // 0x5dc(0x04)
	float MaxSimplificationError; // 0x5e0(0x04)
	int32 MaxSimultaneousTileGenerationJobsCount; // 0x5e4(0x04)
	int32 TileNumberHardLimit; // 0x5e8(0x04)
	int32 *f0177cc714; // 0x5ec(0x04)
	int32 *42bcf443d9; // 0x5f0(0x04)
	int32 *a68c5c4820; // 0x5f4(0x04)
	float DefaultDrawDistance; // 0x5f8(0x04)
	float DefaultMaxSearchNodes; // 0x5fc(0x04)
	float DefaultMaxHierarchicalSearchNodes; // 0x600(0x04)
	enum class ERecastPartitioning RegionPartitioning; // 0x604(0x01)
	enum class ERecastPartitioning LayerPartitioning; // 0x605(0x01)
	char pad_606[0x2]; // 0x606(0x02)
	int32 RegionChunkSplits; // 0x608(0x04)
	int32 LayerChunkSplits; // 0x60c(0x04)
	char bSortNavigationAreasByCost : 1; // 0x610(0x01)
	char bPerformVoxelFiltering : 1; // 0x610(0x01)
	char bMarkLowHeightAreas : 1; // 0x610(0x01)
	char bDoFullyAsyncNavDataGathering : 1; // 0x610(0x01)
	char bUseBetterOffsetsFromCorners : 1; // 0x610(0x01)
	char bStoreEmptyTileLayers : 1; // 0x610(0x01)
	char bUseVirtualFilters : 1; // 0x610(0x01)
	char bAllowNavLinkAsPathEnd : 1; // 0x610(0x01)
	char pad_611[0x3]; // 0x611(0x03)
	bool bOnlySavedOnDS; // 0x614(0x01)
	char pad_615[0x3]; // 0x615(0x03)
	char bUseVoxelCache : 1; // 0x618(0x01)
	char pad_618_1 : 7; // 0x618(0x01)
	char pad_619[0x3]; // 0x619(0x03)
	float TileSetUpdateInterval; // 0x61c(0x04)
	float HeuristicScale; // 0x620(0x04)
	float VerticalDeviationFromGroundCompensation; // 0x624(0x04)
	char pad_628[0x98]; // 0x628(0x98)
};

// Class Engine.*ff4b8fbd53
// Size: 0x40 (Inherited: 0x30)
struct U*ff4b8fbd53 : UObject {
	struct TArray<struct F*7f68d80531> *9763e0c01a; // 0x30(0x10)
};

// Class Engine.SceneCaptureComponent
// Size: 0x560 (Inherited: 0x4e0)
struct USceneCaptureComponent : USceneComponent {
	struct TArray<struct UPrimitiveComponent*> *181c8efbcd; // 0x4e0(0x10)
	struct TArray<struct AActor*> HiddenActors; // 0x4f0(0x10)
	struct TArray<struct UPrimitiveComponent*> *276acdd225; // 0x500(0x10)
	struct TArray<struct AActor*> ShowOnlyActors; // 0x510(0x10)
	bool bIsLobbyCapture; // 0x520(0x01)
	bool bCaptureEveryFrame; // 0x521(0x01)
	bool bCaptureOnMovement; // 0x522(0x01)
	char pad_523[0x1]; // 0x523(0x01)
	float LODDistanceFactor; // 0x524(0x04)
	float MaxViewDistanceOverride; // 0x528(0x04)
	int32 CaptureSortPriority; // 0x52c(0x04)
	struct TArray<struct F*2e7d0bf04d> ShowFlagSettings; // 0x530(0x10)
	char pad_540[0x20]; // 0x540(0x20)

	int32 *7e905b4b64(); // Function Engine.SceneCaptureComponent.*7e905b4b64 // Final|Native|Public|BlueprintCallable // @ game+0x66ee0cc
	struct UPrimitiveComponent* *8f98e781db(); // Function Engine.SceneCaptureComponent.*8f98e781db // Final|Native|Public|BlueprintCallable // @ game+0x66d4990
	struct AActor* *4ec409b2bc(); // Function Engine.SceneCaptureComponent.*4ec409b2bc // Final|Native|Public|BlueprintCallable // @ game+0x66e8fb8
	struct UPrimitiveComponent* *30080cc8fb(); // Function Engine.SceneCaptureComponent.*30080cc8fb // Final|Native|Public|BlueprintCallable // @ game+0x66fc4c0
	struct UPrimitiveComponent* *0106912d1f(); // Function Engine.SceneCaptureComponent.*0106912d1f // Final|Native|Public|BlueprintCallable // @ game+0x66e9048
	struct AActor* *d263019945(); // Function Engine.SceneCaptureComponent.*d263019945 // Final|Native|Public|BlueprintCallable // @ game+0x66d47f0
	struct UPrimitiveComponent* *43f5e14905(); // Function Engine.SceneCaptureComponent.*43f5e14905 // Final|Native|Public|BlueprintCallable // @ game+0x66bb670
	struct AActor* *621d8e09f7(); // Function Engine.SceneCaptureComponent.*621d8e09f7 // Final|Native|Public|BlueprintCallable // @ game+0x66fc430
};

// Class Engine.SceneCaptureComponent2D
// Size: 0xba0 (Inherited: 0x560)
struct USceneCaptureComponent2D : USceneCaptureComponent {
	enum class ECameraProjectionMode ProjectionType; // 0x560(0x01)
	char pad_561[0x3]; // 0x561(0x03)
	float FOVAngle; // 0x564(0x04)
	bool *53c2030bce; // 0x568(0x01)
	char pad_569[0x3]; // 0x569(0x03)
	float *29ce5cea98; // 0x56c(0x04)
	float OrthoWidth; // 0x570(0x04)
	char pad_574[0x4]; // 0x574(0x04)
	struct UTextureRenderTarget2D* TextureTarget; // 0x578(0x08)
	enum class *bf5d45bad1 CaptureSource; // 0x580(0x01)
	enum class *1749cfde27 CompositeMode; // 0x581(0x01)
	char pad_582[0x2]; // 0x582(0x02)
	struct FLinearColor LightingOnlyBrightness; // 0x584(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x594(0x10)
	struct FLinearColor LightingOnlyCustomData; // 0x5a4(0x10)
	float LightingOnlyCustomDataAlpha; // 0x5b4(0x04)
	char pad_5B8[0x8]; // 0x5b8(0x08)
	struct FPostProcessSettings PostProcessSettings; // 0x5c0(0x570)
	float PostProcessBlendWeight; // 0xb30(0x04)
	bool bUseCustomProjectionMatrix; // 0xb34(0x01)
	char pad_B35[0xb]; // 0xb35(0x0b)
	struct FMatrix CustomProjectionMatrix; // 0xb40(0x40)
	char *8a9a073e7b : 1; // 0xb80(0x01)
	char pad_B80_1 : 7; // 0xb80(0x01)
	char pad_B81[0x3]; // 0xb81(0x03)
	bool bEnableClipPlane; // 0xb84(0x01)
	char pad_B85[0x3]; // 0xb85(0x03)
	struct FVector ClipPlaneBase; // 0xb88(0x0c)
	struct FVector ClipPlaneNormal; // 0xb94(0x0c)

	void CaptureScene(); // Function Engine.SceneCaptureComponent2D.CaptureScene // Final|Native|Public|BlueprintCallable // @ game+0x66baf74
	float *8480288ca6(); // Function Engine.SceneCaptureComponent2D.*8480288ca6 // Final|Native|Public|BlueprintCallable // @ game+0x66af2bc
};

// Class Engine.ArrowComponent
// Size: 0xa20 (Inherited: 0xa10)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor; // 0xa08(0x04)
	float ArrowSize; // 0xa0c(0x04)
	bool bIsScreenSizeScaled; // 0xa10(0x01)
	float ScreenSize; // 0xa14(0x04)
	char bTreatAsASprite : 1; // 0xa18(0x01)
	char pad_A1D_1 : 7; // 0xa1d(0x01)
	char pad_A1E[0x2]; // 0xa1e(0x02)

	struct FLinearColor SetArrowColor(); // Function Engine.ArrowComponent.SetArrowColor // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66ec490
};

// Class Engine.NavModifierVolume
// Size: 0x448 (Inherited: 0x438)
struct ANavModifierVolume : AVolume {
	char pad_438[0x8]; // 0x438(0x08)
	struct UClass* AreaClass; // 0x440(0x08)

	struct UClass* *7aaad5527c(); // Function Engine.NavModifierVolume.*7aaad5527c // Final|Native|Public|BlueprintCallable // @ game+0x66a25c4
};

// Class Engine.ParticleSystemComponent
// Size: 0xc70 (Inherited: 0xa10)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template; // 0xa08(0x08)
	struct TArray<struct UMaterialInterface*> *0264e057b3; // 0xa10(0x10)
	struct TArray<struct USkeletalMeshComponent*> *d2e13ff94a; // 0xa20(0x10)
	char pad_A38_0 : 7; // 0xa38(0x01)
	char bResetOnDetach : 1; // 0xa30(0x01)
	char *b0c579f1b2 : 1; // 0xa31(0x01)
	char bAllowRecycling : 1; // 0xa31(0x01)
	char bAutoManageAttachment : 1; // 0xa31(0x01)
	char *6a0dc6332d : 1; // 0xa31(0x01)
	char bOverrideLODMethod : 1; // 0xa32(0x01)
	char *a9eb83c3f5 : 1; // 0xa32(0x01)
	char *f4ab1f1a19 : 1; // 0xa32(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0xa38(0x10)
	struct FMulticastDelegate OnParticleSpawn; // 0xa48(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0xa58(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0xa68(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0xa78(0x10)
	struct FVector *6d3adcbc3b; // 0xa88(0x0c)
	struct FVector *1d968f1f5c; // 0xa94(0x0c)
	float WarmupTime; // 0xaa0(0x04)
	float *f276ed8749; // 0xaa4(0x04)
	char pad_AA9[0x3]; // 0xaa9(0x03)
	float SecondsBeforeInactive; // 0xaac(0x04)
	char pad_AB0[0x4]; // 0xab0(0x04)
	float *86558fc266; // 0xab4(0x04)
	char pad_AB8[0x8]; // 0xab8(0x08)
	enum class *4460aee05d LODMethod; // 0xac0(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0xac1(0x01)
	char pad_AC2[0x16]; // 0xac2(0x16)
	struct TArray<struct U*7130a8ded7*> *7f880bcb72; // 0xad8(0x10)
	char pad_AE8[0x60]; // 0xae8(0x60)
	float CustomTimeDilation; // 0xb48(0x04)
	char pad_B4C[0x4]; // 0xb4c(0x04)
	struct FMulticastDelegate OnSystemFinished; // 0xb50(0x10)
	struct USceneComponent* AutoAttachParent; // 0xb60(0x08)
	struct FName AutoAttachSocketName; // 0xb68(0x08)
	enum class EAttachLocation AutoAttachLocationType; // 0xb70(0x01)
	enum class EAttachmentRule AutoAttachLocationRule; // 0xb71(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0xb72(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0xb73(0x01)
	char pad_B74[0xfc]; // 0xb74(0xfc)

	struct UParticleSystem* *3eb6223e6f(); // Function Engine.ParticleSystemComponent.*3eb6223e6f // Final|Native|Public|BlueprintCallable // @ game+0x66a7950
	int32 *3967cdee21(); // Function Engine.ParticleSystemComponent.*3967cdee21 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a34b4
	struct FLinearColor *1e3c290f5c(); // Function Engine.ParticleSystemComponent.*1e3c290f5c // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a4260
	bool *ae89bc7fe9(); // Function Engine.ParticleSystemComponent.*ae89bc7fe9 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6690ac4
	int32 *33bad8c16d(); // Function Engine.ParticleSystemComponent.*33bad8c16d // Native|Public|BlueprintCallable // @ game+0x66a338c
	float SetFloatParameter(); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0xce4c84
	struct AActor* *33a48ef273(); // Function Engine.ParticleSystemComponent.*33a48ef273 // Final|Native|Public|BlueprintCallable // @ game+0x66a1eb8
	void *2f88032a60(); // Function Engine.ParticleSystemComponent.*2f88032a60 // Final|Native|Public|BlueprintCallable // @ game+0x668f04c
	struct FVector *43b5fa91da(); // Function Engine.ParticleSystemComponent.*43b5fa91da // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a82d4
	bool *f78f4b8261(); // Function Engine.ParticleSystemComponent.*f78f4b8261 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66904c0
	struct UMaterialInterface* *77b1620434(); // Function Engine.ParticleSystemComponent.*77b1620434 // Final|Native|Public|BlueprintCallable // @ game+0x66a62d4
	int32 *2b287676da(); // Function Engine.ParticleSystemComponent.*2b287676da // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a3114
	struct UMaterialInstanceDynamic* *803b3191e2(); // Function Engine.ParticleSystemComponent.*803b3191e2 // Native|Public|BlueprintCallable // @ game+0x668cd64
	bool *efcfc3e16f(); // Function Engine.ParticleSystemComponent.*efcfc3e16f // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6690c04
	struct FVector *652895e7b7(); // Function Engine.ParticleSystemComponent.*652895e7b7 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a2db4
	int32 *35fb56820d(); // Function Engine.ParticleSystemComponent.*35fb56820d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66943f4
	enum class EAttachLocation *a9b1891267(); // Function Engine.ParticleSystemComponent.*a9b1891267 // Final|Native|Public|BlueprintCallable // @ game+0x66a2834
	bool *93a6d9a36e(); // Function Engine.ParticleSystemComponent.*93a6d9a36e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x669083c
	bool *e6536d8bf2(); // Function Engine.ParticleSystemComponent.*e6536d8bf2 // Native|Public|BlueprintCallable // @ game+0x66a490c
	struct UMaterialInterface* *e90585bf5a(); // Function Engine.ParticleSystemComponent.*e90585bf5a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66941ac
	bool *69ad17cf8e(); // Function Engine.ParticleSystemComponent.*69ad17cf8e // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x66906fc
	int32 *4e1843a089(); // Function Engine.ParticleSystemComponent.*4e1843a089 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a3250
	enum class EAttachmentRule *833271b79f(); // Function Engine.ParticleSystemComponent.*833271b79f // Final|Native|Public|BlueprintCallable // @ game+0x66a297c
	float *bbe8833323(); // Function Engine.ParticleSystemComponent.*bbe8833323 // Final|Native|Public|BlueprintCallable // @ game+0x66a7c28
	bool *ac3de6ecfd(); // Function Engine.ParticleSystemComponent.*ac3de6ecfd // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6690980
	int32 *f1e9447b17(); // Function Engine.ParticleSystemComponent.*f1e9447b17 // Native|Public|BlueprintCallable // @ game+0x66a2fec
	float *37b5286932(); // Function Engine.ParticleSystemComponent.*37b5286932 // Final|Native|Public|BlueprintCallable // @ game+0x6688a74
	bool *545a9d9058(); // Function Engine.ParticleSystemComponent.*545a9d9058 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66905b8
	struct FVector *840fc18676(); // Function Engine.ParticleSystemComponent.*840fc18676 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x668f554
	int32 *865335f835(); // Function Engine.ParticleSystemComponent.*865335f835 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a2eb0
};

// Class Engine.DefaultPawn
// Size: 0x488 (Inherited: 0x460)
struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x460(0x04)
	float BaseLookUpRate; // 0x464(0x04)
	struct UPawnMovementComponent* MovementComponent; // 0x468(0x08)
	struct USphereComponent* CollisionComponent; // 0x470(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x478(0x08)
	char bAddDefaultMovementBindings : 1; // 0x480(0x01)
	char pad_480_1 : 7; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)

	float *4b0eecc634(); // Function Engine.DefaultPawn.*4b0eecc634 // Native|Public|BlueprintCallable // @ game+0x669d184
	float MoveForward(); // Function Engine.DefaultPawn.MoveForward // Native|Public|BlueprintCallable // @ game+0x669d04c
	float *d93a5f2923(); // Function Engine.DefaultPawn.*d93a5f2923 // Final|Native|Public|BlueprintCallable // @ game+0x669cd58
	float *2502c41576(); // Function Engine.DefaultPawn.*2502c41576 // Final|Native|Public|BlueprintCallable // @ game+0x66a9a50
	float MoveRight(); // Function Engine.DefaultPawn.MoveRight // Native|Public|BlueprintCallable // @ game+0x669d0e8
};

// Class Engine.SpectatorPawn
// Size: 0x488 (Inherited: 0x488)
struct ASpectatorPawn : ADefaultPawn {
};

// Class Engine.FloatingPawnMovement
// Size: 0x2a0 (Inherited: 0x290)
struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x288(0x04)
	float Acceleration; // 0x28c(0x04)
	float Deceleration; // 0x290(0x04)
	float TurningBoost; // 0x294(0x04)
	char *a96f552028 : 1; // 0x298(0x01)
};

// Class Engine.SpectatorPawnMovement
// Size: 0x2b0 (Inherited: 0x2a0)
struct USpectatorPawnMovement : UFloatingPawnMovement {
	char *cea07ee5d4 : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0xf]; // 0x2a1(0x0f)
};

// Class Engine.SplineComponent
// Size: 0xb00 (Inherited: 0xa10)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves *e4855893fe; // 0xa08(0x60)
	struct FInterpCurveVector SplineInfo; // 0xa68(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0xa80(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0xa98(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0xab0(0x18)
	bool bAllowSplineEditingPerInstance; // 0xac8(0x01)
	int32 *b2fc378f11; // 0xacc(0x04)
	bool *f0eb9457f6; // 0xad0(0x01)
	bool *d026b2a624; // 0xad1(0x01)
	float *9b43bd053e; // 0xad4(0x04)
	float Duration; // 0xad8(0x04)
	bool bStationaryEndpoints; // 0xadc(0x01)
	bool *bbd66348f8; // 0xadd(0x01)
	bool *567f48a68a; // 0xade(0x01)
	bool bInputSplinePointsToConstructionScript; // 0xadf(0x01)
	bool bDrawDebug; // 0xae0(0x01)
	bool *46cb7b878f; // 0xae1(0x01)
	bool bLoopPositionOverride; // 0xae2(0x01)
	float *2784a51576; // 0xae4(0x04)
	struct FVector DefaultUpVector; // 0xae8(0x0c)
	char pad_AF6[0xa]; // 0xaf6(0x0a)

	struct FVector *7b4c9d031b(); // Function Engine.SplineComponent.*7b4c9d031b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c4b24
	float *6d1df59408(); // Function Engine.SplineComponent.*6d1df59408 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66c9a8c
	struct FRotator *976eb1cdf1(); // Function Engine.SplineComponent.*976eb1cdf1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf338
	bool *cdebe3cfc2(); // Function Engine.SplineComponent.*cdebe3cfc2 // Final|Native|Public|BlueprintCallable // @ game+0x66ee744
	struct FVector *fdbdd3d158(); // Function Engine.SplineComponent.*fdbdd3d158 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c9318
	struct FVector *c43d5d98a0(); // Function Engine.SplineComponent.*c43d5d98a0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2c94
	struct FVector *e319c53179(); // Function Engine.SplineComponent.*e319c53179 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66ceca4
	struct FVector *caf3ef8e09(); // Function Engine.SplineComponent.*caf3ef8e09 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cc390
	bool *e33656ec55(); // Function Engine.SplineComponent.*e33656ec55 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66af3d0
	struct FVector *3b676ec63f(); // Function Engine.SplineComponent.*3b676ec63f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66ceda4
	struct FVector *c0b3ba04bb(); // Function Engine.SplineComponent.*c0b3ba04bb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf79c
	struct FTransform *d0306b7540(); // Function Engine.SplineComponent.*d0306b7540 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c570c
	float *86965b948e(); // Function Engine.SplineComponent.*86965b948e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf020
	enum class ESplineCoordinateSpace *cccfa56147(); // Function Engine.SplineComponent.*cccfa56147 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66efa68
	struct FVector *444c49960a(); // Function Engine.SplineComponent.*444c49960a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2a04
	struct TArray<struct FVector> *89f33ae457(); // Function Engine.SplineComponent.*89f33ae457 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66f747c
	struct FVector *7674abbac0(); // Function Engine.SplineComponent.*7674abbac0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c7008
	bool *68eb0ba76e(); // Function Engine.SplineComponent.*68eb0ba76e // Final|Native|Public|BlueprintCallable // @ game+0x66e90e8
	struct FVector *ed3e2a0190(); // Function Engine.SplineComponent.*ed3e2a0190 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2248
	struct FRotator *8d4fda68ab(); // Function Engine.SplineComponent.*8d4fda68ab // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c53f0
	struct FVector *4a52b59c2e(); // Function Engine.SplineComponent.*4a52b59c2e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c9554
	struct FVector *be88f7346a(); // Function Engine.SplineComponent.*be88f7346a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cc390
	void *2cd2c878c1(); // Function Engine.SplineComponent.*2cd2c878c1 // Final|Native|Public|BlueprintCallable // @ game+0x6703acc
	struct FVector *8db1b83179(); // Function Engine.SplineComponent.*8db1b83179 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66ceed8
	bool *ab63d040ff(); // Function Engine.SplineComponent.*ab63d040ff // Final|Native|Public|BlueprintCallable // @ game+0x66ee83c
	struct FLinearColor *62d46629cc(); // Function Engine.SplineComponent.*62d46629cc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66a4518
	bool SetSplinePointType(); // Function Engine.SplineComponent.SetSplinePointType // Final|Native|Public|BlueprintCallable // @ game+0x66f7548
	bool *302ea2dab2(); // Function Engine.SplineComponent.*302ea2dab2 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66f87c4
	struct FVector *4ea785482c(); // Function Engine.SplineComponent.*4ea785482c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2d4c
	struct FRotator *d41700f03e(); // Function Engine.SplineComponent.*d41700f03e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf438
	struct FVector *91767e1a30(); // Function Engine.SplineComponent.*91767e1a30 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2148
	struct FRotator *738416c2ad(); // Function Engine.SplineComponent.*738416c2ad // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2fbc
	struct FVector *fc9e685ffb(); // Function Engine.SplineComponent.*fc9e685ffb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c9654
	struct FVector *df19cb0db6(); // Function Engine.SplineComponent.*df19cb0db6 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cc978
	float *0f131f0c6d(); // Function Engine.SplineComponent.*0f131f0c6d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf200
	float *32321cedbf(); // Function Engine.SplineComponent.*32321cedbf // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c4c48
	bool *2a39fcaf9d(); // Function Engine.SplineComponent.*2a39fcaf9d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66f44c4
	struct FVector *bccf821cd7(); // Function Engine.SplineComponent.*bccf821cd7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cc680
	struct FTransform *d95b6f672a(); // Function Engine.SplineComponent.*d95b6f672a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1768
	struct FVector *4f4cd5b2fd(); // Function Engine.SplineComponent.*4f4cd5b2fd // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c51c8
	struct FRotator *395084cc78(); // Function Engine.SplineComponent.*395084cc78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2efc
	struct FVector *904cfd2f2e(); // Function Engine.SplineComponent.*904cfd2f2e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d237c
	struct FVector *c60d6edf0f(); // Function Engine.SplineComponent.*c60d6edf0f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d0874
	float *5a71db2e37(); // Function Engine.SplineComponent.*5a71db2e37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cc4b4
	int32 GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cd1ac
	bool *bc154fa11e(); // Function Engine.SplineComponent.*bc154fa11e // Final|Native|Public|BlueprintCallable // @ game+0x66bb9d8
	struct FVector *112769234e(); // Function Engine.SplineComponent.*112769234e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66af990
	struct FVector *14b50377fd(); // Function Engine.SplineComponent.*14b50377fd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2bd4
	struct FVector *d22dfdbd7c(); // Function Engine.SplineComponent.*d22dfdbd7c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cca78
	struct FVector *9f717ab45b(); // Function Engine.SplineComponent.*9f717ab45b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d30cc
	struct FVector *93d0ee66fc(); // Function Engine.SplineComponent.*93d0ee66fc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c55e8
	struct FVector *39bea93356(); // Function Engine.SplineComponent.*39bea93356 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c4cf4
	bool *9326e47479(); // Function Engine.SplineComponent.*9326e47479 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66af804
	bool *6bd9bbc712(); // Function Engine.SplineComponent.*6bd9bbc712 // Final|Native|Public|BlueprintCallable // @ game+0x66f0254
	struct FVector *23f898d882(); // Function Engine.SplineComponent.*23f898d882 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c5894
	bool *fd0c91139e(); // Function Engine.SplineComponent.*fd0c91139e // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66f96a0
	bool *2aef1bb91c(); // Function Engine.SplineComponent.*2aef1bb91c // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66f7678
	enum class ESplinePointType *a83c9914b5(); // Function Engine.SplineComponent.*a83c9914b5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d0018
	struct FVector *96dd4d52b9(); // Function Engine.SplineComponent.*96dd4d52b9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d2ac4
	struct FVector *e55d35b53f(); // Function Engine.SplineComponent.*e55d35b53f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66af61c
	bool *af9dccd68a(); // Function Engine.SplineComponent.*af9dccd68a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66d5ff0
	float *1e7b8c34a0(); // Function Engine.SplineComponent.*1e7b8c34a0 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c52ec
	struct FVector *1ed04e89f0(); // Function Engine.SplineComponent.*1ed04e89f0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d0974
	struct FRotator *cf23ea2e13(); // Function Engine.SplineComponent.*cf23ea2e13 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf534
	struct TArray<struct FVector> *75d675f16c(); // Function Engine.SplineComponent.*75d675f16c // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66f78e0
	float *59903796c9(); // Function Engine.SplineComponent.*59903796c9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf114
	struct FVector *e91d19565f(); // Function Engine.SplineComponent.*e91d19565f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66ccb74
	bool *5cbd31cdd2(); // Function Engine.SplineComponent.*5cbd31cdd2 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66af4ec
	struct FTransform *36f7fb5f70(); // Function Engine.SplineComponent.*36f7fb5f70 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d18dc
	struct FVector *2d2944af94(); // Function Engine.SplineComponent.*2d2944af94 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf928
	enum class ESplineCoordinateSpace *68745033d7(); // Function Engine.SplineComponent.*68745033d7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cc7d8
	struct FVector *2a125ecadf(); // Function Engine.SplineComponent.*2a125ecadf // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c5520
	bool AddSplinePoint(); // Function Engine.SplineComponent.AddSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66af6bc
	struct FVector *31010fa750(); // Function Engine.SplineComponent.*31010fa750 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66c9750
	struct FLinearColor *08e1e9ebdd(); // Function Engine.SplineComponent.*08e1e9ebdd // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66a4518
	struct FVector *acc78471c0(); // Function Engine.SplineComponent.*acc78471c0 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66cf854
	float *898b520d62(); // Function Engine.SplineComponent.*898b520d62 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66cfff0
	bool *c308954174(); // Function Engine.SplineComponent.*c308954174 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66f8950
	float *205c2e17a2(); // Function Engine.SplineComponent.*205c2e17a2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66ca3c8
	struct FTransform *85f2ef909e(); // Function Engine.SplineComponent.*85f2ef909e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x66d1a88
	struct FVector *dfab37a503(); // Function Engine.SplineComponent.*dfab37a503 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x66fa8b8
};

// Class Engine.MaterialInterface
// Size: 0x78 (Inherited: 0x30)
struct UMaterialInterface : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x38(0x08)
	char pad_40[0x8]; // 0x40(0x08)
	struct F*31693f5ae2 LightmassSettings; // 0x48(0x14)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct TArray<struct F*8f67b6e0e6> *f16f190461; // 0x60(0x10)
	char pad_70[0x8]; // 0x70(0x08)

	struct UPhysicalMaterial* *47cf8f9bb6(); // Function Engine.MaterialInterface.*47cf8f9bb6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694e50
	struct UMaterial* *c3924ed2b7(); // Function Engine.MaterialInterface.*c3924ed2b7 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x6690428
};

// Class Engine.MaterialInstance
// Size: 0x1e8 (Inherited: 0x78)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0x78(0x08)
	struct UMaterialInterface* Parent; // 0x80(0x08)
	char *b4fdeda5cd : 1; // 0x88(0x01)
	char *6c011e6df7 : 1; // 0x88(0x01)
	char pad_88_2 : 1; // 0x88(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x88(0x01)
	char pad_88_4 : 4; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct TArray<struct F*a7bbc83ffe> FontParameterValues; // 0x90(0x10)
	struct TArray<struct F*4ce84ba02f> ScalarParameterValues; // 0xa0(0x10)
	struct TArray<struct F*8a4a1d286a> TextureParameterValues; // 0xb0(0x10)
	struct TArray<struct F*c2d53d1c03> VectorParameterValues; // 0xc0(0x10)
	bool bOverrideBaseProperties; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xd4(0x24)
	char pad_F8[0xf0]; // 0xf8(0xf0)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x1e8 (Inherited: 0x1e8)
struct UMaterialInstanceConstant : UMaterialInstance {
};

// Class Engine.MaterialExpression
// Size: 0x68 (Inherited: 0x30)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x30(0x08)
	struct UMaterialFunction* Function; // 0x38(0x08)
	struct FString Desc; // 0x40(0x10)
	struct FColor BorderColor; // 0x50(0x04)
	char *3a783ccbfb : 1; // 0x54(0x01)
	char *a5da7c9fbf : 1; // 0x54(0x01)
	char *46c0074c5d : 1; // 0x54(0x01)
	char *2ed4c5fd64 : 1; // 0x54(0x01)
	char *e676174cee : 1; // 0x54(0x01)
	char *222a5b7244 : 1; // 0x54(0x01)
	char *6ae63981e1 : 1; // 0x54(0x01)
	char *d3a59df4e9 : 1; // 0x54(0x01)
	char *e872c9d323 : 1; // 0x55(0x01)
	char *9929d6a9bc : 1; // 0x55(0x01)
	char *e975043135 : 1; // 0x55(0x01)
	char pad_55_3 : 5; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	struct TArray<struct FExpressionOutput> Outputs; // 0x58(0x10)
};

// Class Engine.*9cae02a0c8
// Size: 0x68 (Inherited: 0x68)
struct U*9cae02a0c8 : UMaterialExpression {
};

// Class Engine.*6a03f15cb4
// Size: 0x68 (Inherited: 0x68)
struct U*6a03f15cb4 : UMaterialExpression {
};

// Class Engine.*0dbf8eac01
// Size: 0x30 (Inherited: 0x30)
struct U*0dbf8eac01 : UObject {

	void Activate(); // Function Engine.*0dbf8eac01.Activate // Native|Public|BlueprintCallable // @ game+0x5993a04
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x3c0 (Inherited: 0x2b8)
struct UBlueprintGeneratedClass : UClass {
	int32 NumReplicatedProperties; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct TArray<struct U*3df69eb1ab*> *d50407421b; // 0x2c0(0x10)
	struct TArray<struct UActorComponent*> *2618d515c0; // 0x2d0(0x10)
	struct TArray<struct U*12776be9f9*> *7a479ec104; // 0x2e0(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x2f0(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x2f8(0x08)
	struct UStructProperty* *e92387d3dd; // 0x300(0x08)
	struct UFunction* *33c45f144f; // 0x308(0x08)
	struct TArray<struct F*f871fdbfe8> FastCallPairs; // 0x310(0x10)
	bool *b1de85ca98; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct TMap<struct FName, struct F*76eff26226> *8d069c690c; // 0x328(0x50)
	bool *f13a1e87a4; // 0x378(0x01)
	char pad_379[0x47]; // 0x379(0x47)
};

// Class Engine.CameraActor
// Size: 0x9a0 (Inherited: 0x400)
struct ACameraActor : AActor {
	enum class EAutoReceiveInput *ed863f85b0; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct UCameraComponent* CameraComponent; // 0x408(0x08)
	struct USceneComponent* SceneComponent; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	char bConstrainAspectRatio : 1; // 0x420(0x01)
	char pad_420_1 : 7; // 0x420(0x01)
	char pad_421[0x3]; // 0x421(0x03)
	float AspectRatio; // 0x424(0x04)
	float FOVAngle; // 0x428(0x04)
	float PostProcessBlendWeight; // 0x42c(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x430(0x570)

	int32 *f3e4e78431(); // Function Engine.CameraActor.*f3e4e78431 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66903d0
};

// Class Engine.UserDefinedStruct
// Size: 0x108 (Inherited: 0xf8)
struct UUserDefinedStruct : UScriptStruct {
	struct FGuid Guid; // 0xf8(0x10)
};

// Class Engine.AISystemBase
// Size: 0x50 (Inherited: 0x30)
struct UAISystemBase : UObject {
	struct FStringClassReference AISystemClassName; // 0x30(0x10)
	struct FName AISystemModuleName; // 0x40(0x08)
	bool bInstantiateAISystemOnClient; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class Engine.*1a2c4a78a0
// Size: 0x50 (Inherited: 0x30)
struct U*1a2c4a78a0 : UObject {
	struct TArray<struct F*32e4d16215> Areas; // 0x30(0x10)
	struct F*85f602d0b9 IncludeFlags; // 0x40(0x04)
	struct F*85f602d0b9 ExcludeFlags; // 0x44(0x04)
	char pad_48[0x8]; // 0x48(0x08)
};

// Class Engine.*6c389a598a
// Size: 0x40 (Inherited: 0x30)
struct U*6c389a598a : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.Model
// Size: 0x568 (Inherited: 0x30)
struct UModel : UObject {
	char pad_30[0x538]; // 0x30(0x538)
};

// Class Engine.*cfd78a8c42
// Size: 0x30 (Inherited: 0x30)
struct U*cfd78a8c42 : UObject {
};

// Class Engine.*9e86854228
// Size: 0x30 (Inherited: 0x30)
struct U*9e86854228 : UObject {
};

// Class Engine.EdGraphNode
// Size: 0xa8 (Inherited: 0x30)
struct UEdGraphNode : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins; // 0x40(0x10)
	int32 *61c5fd1f45; // 0x50(0x04)
	int32 *957dc8ede2; // 0x54(0x04)
	int32 *1bc9527dfd; // 0x58(0x04)
	int32 *99c349eabe; // 0x5c(0x04)
	char *017d7cfcfa : 1; // 0x60(0x01)
	char pad_60_1 : 7; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct FString NodeComment; // 0x68(0x10)
	bool *865c9c538c; // 0x78(0x01)
	bool *2ed4c5fd64; // 0x79(0x01)
	bool *310f58853a; // 0x7a(0x01)
	char pad_7B[0x1]; // 0x7b(0x01)
	int32 *fbe5696df8; // 0x7c(0x04)
	struct FString *7beb49606d; // 0x80(0x10)
	struct FGuid NodeGuid; // 0x90(0x10)
	enum class ENodeAdvancedPins *2ec0f2d5a5; // 0xa0(0x01)
	enum class ENodeEnabledState *1b089cec93; // 0xa1(0x01)
	bool *a15c4f5c1f; // 0xa2(0x01)
	bool bIsNodeEnabled; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x148 (Inherited: 0x30)
struct UEdGraphPin_Deprecated : UObject {
	struct FString PinName; // 0x30(0x10)
	struct FString PinToolTip; // 0x40(0x10)
	enum class EEdGraphPinDirection Direction; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct F*4342bfc443 PinType; // 0x58(0x80)
	struct FString DefaultValue; // 0xd8(0x10)
	struct FString *e7ac6b2bb0; // 0xe8(0x10)
	struct UObject* *78be025fbb; // 0xf8(0x08)
	struct FText *9f02b52b4e; // 0x100(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> *571292af4d; // 0x118(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> *42fc9067df; // 0x128(0x10)
	struct UEdGraphPin_Deprecated* *de5ae33e93; // 0x138(0x08)
	struct UEdGraphPin_Deprecated* *3af63fd44c; // 0x140(0x08)
};

// Class Engine.*44ca1cef30
// Size: 0x30 (Inherited: 0x30)
struct U*44ca1cef30 : UInterface {
};

// Class Engine.Level
// Size: 0x330 (Inherited: 0x30)
struct ULevel : UObject {
	char pad_30[0x20]; // 0x30(0x20)
	float *c1eaeb8397; // 0x50(0x04)
	bool *11f6bfbd58; // 0x54(0x01)
	char pad_55_0 : 2; // 0x55(0x01)
	char *9f59dfe013 : 1; // 0x55(0x01)
	char bIsVisible : 1; // 0x55(0x01)
	char bLocked : 1; // 0x55(0x01)
	char *02e9790014 : 1; // 0x55(0x01)
	char pad_55_6 : 2; // 0x55(0x01)
	char pad_56[0x1a]; // 0x56(0x1a)
	struct U*33266603e2* ActorCluster; // 0x70(0x08)
	char pad_78[0x70]; // 0x78(0x70)
	struct FGuid *3d8a333984; // 0xe8(0x10)
	struct UMapBuildDataRegistry* *7c9be48b22; // 0xf8(0x08)
	struct ANavigationObjectBase* *a2165f48c4; // 0x100(0x08)
	struct UWorld* *654b8d1763; // 0x108(0x08)
	struct TArray<struct FGuid> *2dafba22fe; // 0x110(0x10)
	char pad_120[0x50]; // 0x120(0x50)
	struct FIntVector *edcaca8239; // 0x170(0x0c)
	char pad_17C[0x4]; // 0x17c(0x04)
	struct TArray<struct FVector> *71279b0e2d; // 0x180(0x10)
	char pad_190[0x30]; // 0x190(0x30)
	struct TArray<struct U*b5dde59565*> *575b76f3d9; // 0x1c0(0x10)
	int32 *ef7f2cdc37; // 0x1d0(0x04)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct TArray<struct U*cfe9bd80c3*> *0545d7fd4e; // 0x1d8(0x10)
	char pad_1E8[0x8]; // 0x1e8(0x08)
	struct ANavigationObjectBase* *81b2bad029; // 0x1f0(0x08)
	char pad_1F8[0x8]; // 0x1f8(0x08)
	struct UModel* Model; // 0x200(0x08)
	int32 *e9b2c9a902; // 0x208(0x04)
	float *31c716180a; // 0x20c(0x04)
	char pad_210[0x70]; // 0x210(0x70)
	struct ALevelScriptActor* LevelScriptActor; // 0x280(0x08)
	char pad_288[0x78]; // 0x288(0x78)
	struct AWorldSettings* WorldSettings; // 0x300(0x08)
	char pad_308[0x8]; // 0x308(0x08)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x310(0x10)
	char pad_320[0x10]; // 0x320(0x10)
};

// Class Engine.*3a93198c95
// Size: 0x30 (Inherited: 0x30)
struct U*3a93198c95 : UInterface {
};

// Class Engine.AmbientSound
// Size: 0x408 (Inherited: 0x400)
struct AAmbientSound : AActor {
	struct UAudioComponent* AudioComponent; // 0x400(0x08)

	float AdjustVolume(); // Function Engine.AmbientSound.AdjustVolume // Final|Native|Public|BlueprintCallable // @ game+0x6688988
	float *a2584d7220(); // Function Engine.AmbientSound.*a2584d7220 // Final|Native|Public|BlueprintCallable // @ game+0x668f0fc
	void Stop(); // Function Engine.AmbientSound.Stop // Final|Native|Public|BlueprintCallable // @ game+0x66a9014
	float Play(); // Function Engine.AmbientSound.Play // Final|Native|Public|BlueprintCallable // @ game+0x669d980
	float FadeOut(); // Function Engine.AmbientSound.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0x668f1ec
};

// Class Engine.AutoBenchSettings
// Size: 0x48 (Inherited: 0x30)
struct UAutoBenchSettings : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct F*3fd7aec64b> Settings; // 0x38(0x10)
};

// Class Engine.AutoBenchControlActor
// Size: 0x400 (Inherited: 0x400)
struct AAutoBenchControlActor : AActor {
};

// Class Engine.*d1d2b8698a
// Size: 0x30 (Inherited: 0x30)
struct U*d1d2b8698a : UObject {
};

// Class Engine.*9c3aeb490a
// Size: 0x30 (Inherited: 0x30)
struct U*9c3aeb490a : UInterface {
};

// Class Engine.BillboardComponent
// Size: 0xa30 (Inherited: 0xa10)
struct UBillboardComponent : UPrimitiveComponent {
	struct UTexture2D* Sprite; // 0xa08(0x08)
	char bIsScreenSizeScaled : 1; // 0xa10(0x01)
	float ScreenSize; // 0xa14(0x04)
	float U; // 0xa18(0x04)
	float UL; // 0xa1c(0x04)
	float V; // 0xa20(0x04)
	float VL; // 0xa24(0x04)
	struct FColor Color; // 0xa28(0x04)

	int32 *fe62714d9b(); // Function Engine.BillboardComponent.*fe62714d9b // Native|Public|BlueprintCallable // @ game+0x66a7e50
	struct UTexture2D* *6a7a2b4bb4(); // Function Engine.BillboardComponent.*6a7a2b4bb4 // Native|Public|BlueprintCallable // @ game+0x66a76fc
	int32 *26dee22cc2(); // Function Engine.BillboardComponent.*26dee22cc2 // Native|Public|BlueprintCallable // @ game+0x66a7790
	bool SetColor(); // Function Engine.BillboardComponent.SetColor // Final|Native|Public|HasDefaults // @ game+0x66a4088
};

// Class Engine.*8db539420c
// Size: 0x30 (Inherited: 0x30)
struct U*8db539420c : UInterface {
};

// Class Engine.StaticMesh
// Size: 0x178 (Inherited: 0x30)
struct UStaticMesh : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	int32 MinLOD; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct UMaterialInterface*> Materials; // 0x50(0x10)
	struct TArray<struct F*534d06babb> StaticMaterials; // 0x60(0x10)
	float *23cf50e234; // 0x70(0x04)
	int32 LightMapResolution; // 0x74(0x04)
	int32 *be31f80f30; // 0x78(0x04)
	float *722c540fe9; // 0x7c(0x04)
	struct UBodySetup* BodySetup; // 0x80(0x08)
	int32 *f2ad808c42; // 0x88(0x04)
	char *7c9cde204d : 1; // 0x8c(0x01)
	char *122eb607ef : 1; // 0x8c(0x01)
	char bStripComplexCollisionForConsole : 1; // 0x8c(0x01)
	char *33a7a5f335 : 1; // 0x8c(0x01)
	char bRequiresAreaWeightedSampling : 1; // 0x8c(0x01)
	char pad_8C_5 : 3; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	float LpvBiasMultiplier; // 0x90(0x04)
	bool *198183bc1f; // 0x94(0x01)
	char pad_95[0x33]; // 0x95(0x33)
	struct TArray<struct U*2ee8b8c92f*> Sockets; // 0xc8(0x10)
	char pad_D8[0x10]; // 0xd8(0x10)
	struct FVector *10c1bdc006; // 0xe8(0x0c)
	struct FVector *609721a3eb; // 0xf4(0x0c)
	struct FBoxSphereBounds *b31255077e; // 0x100(0x1c)
	bool *2c12e476e1; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
	int32 *618491fca8; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x128(0x10)
	struct UNavCollision* NavCollision; // 0x138(0x08)
	struct F*795e425430 *b27fae7125; // 0x140(0x28)
	struct TArray<struct UMaterialInstanceConstant*> *1891538393; // 0x168(0x10)

	struct FBoxSphereBounds *c579dd6c1d(); // Function Engine.StaticMesh.*c579dd6c1d // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6690e54
	int32 *db9c4dbc4e(); // Function Engine.StaticMesh.*db9c4dbc4e // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6694478
	struct FBox *7a6b970ee0(); // Function Engine.StaticMesh.*7a6b970ee0 // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6690d48
	int32 *edfa89fbf9(); // Function Engine.StaticMesh.*edfa89fbf9 // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x66944e8
};

// Class Engine.*d152ab6626
// Size: 0x600 (Inherited: 0x4e0)
struct U*d152ab6626 : USceneComponent {
	struct FVector Extents; // 0x4e0(0x0c)
	struct FVector FadeExtents_Neg; // 0x4ec(0x0c)
	struct FVector FadeExtents_Pos; // 0x4f8(0x0c)
	bool bOutdoorTransition; // 0x504(0x01)
	char pad_505[0x3]; // 0x505(0x03)
	float VolumeAlpha; // 0x508(0x04)
	float Brightness; // 0x50c(0x04)
	float SkyIntensity; // 0x510(0x04)
	int32 Priority; // 0x514(0x04)
	struct F*944fc9bb94 AmbientCube2; // 0x518(0xc8)
	char pad_5E0[0x20]; // 0x5e0(0x20)

	void *fc50369d15(); // Function Engine.*d152ab6626.*fc50369d15 // Final|Native|Public // @ game+0xbf0020
};

// Class Engine.GIVolumesContainerComponent
// Size: 0x500 (Inherited: 0x4e0)
struct UGIVolumesContainerComponent : USceneComponent {
	char pad_4E0[0x20]; // 0x4e0(0x20)
};

// Class Engine.BoxGIVolume
// Size: 0x408 (Inherited: 0x400)
struct ABoxGIVolume : AActor {
	struct U*d152ab6626* VolumeComponent; // 0x400(0x08)
};

// Class Engine.BrushShape
// Size: 0x438 (Inherited: 0x438)
struct ABrushShape : ABrush {
};

// Class Engine.AudioVolume
// Size: 0x480 (Inherited: 0x438)
struct AAudioVolume : AVolume {
	float Priority; // 0x438(0x04)
	char bEnabled : 1; // 0x43c(0x01)
	char pad_43C_1 : 7; // 0x43c(0x01)
	char pad_43D[0x3]; // 0x43d(0x03)
	struct FReverbSettings Settings; // 0x440(0x18)
	struct F*3e305a18ce AmbientZoneSettings; // 0x458(0x24)
	char pad_47C[0x4]; // 0x47c(0x04)

	struct FReverbSettings SetReverbSettings(); // Function Engine.AudioVolume.SetReverbSettings // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66a75a4
	float SetPriority(); // Function Engine.AudioVolume.SetPriority // Final|Native|Public|BlueprintCallable // @ game+0x66a70cc
	void OnRep_bEnabled(); // Function Engine.AudioVolume.OnRep_bEnabled // Final|Native|Private // @ game+0x5970b90
	struct F*3e305a18ce *97d87abcd2(); // Function Engine.AudioVolume.*97d87abcd2 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x66a56c0
	bool *61153ffc78(); // Function Engine.AudioVolume.*61153ffc78 // Final|Native|Public|BlueprintCallable // @ game+0x66a4a88
};

// Class Engine.BlockingVolume
// Size: 0x438 (Inherited: 0x438)
struct ABlockingVolume : AVolume {
};

// Class Engine.CameraBlockingVolume
// Size: 0x438 (Inherited: 0x438)
struct ACameraBlockingVolume : AVolume {
};

// Class Engine.CullDistanceVolume
// Size: 0x460 (Inherited: 0x438)
struct ACullDistanceVolume : AVolume {
	struct TArray<struct F*1eaa6792c3> CullDistances; // 0x438(0x10)
	char bEnabled : 1; // 0x448(0x01)
	char pad_448_1 : 7; // 0x448(0x01)
	char pad_449[0x3]; // 0x449(0x03)
	float CullDistanceForLODActor; // 0x44c(0x04)
	float CullDistanceForLODActorTooFar; // 0x450(0x04)
	bool bUseActorBound; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
	float IgnoreActorBoundSize; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
};

// Class Engine.LevelStreamingVolume
// Size: 0x450 (Inherited: 0x438)
struct ALevelStreamingVolume : AVolume {
	struct TArray<struct FName> StreamingLevelNames; // 0x438(0x10)
	char bEditorPreVisOnly : 1; // 0x448(0x01)
	char bDisabled : 1; // 0x448(0x01)
	char pad_448_2 : 6; // 0x448(0x01)
	char pad_449[0x3]; // 0x449(0x03)
	enum class *8d2645b9ee StreamingUsage; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
};

// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x438 (Inherited: 0x438)
struct ALightmassCharacterIndirectDetailVolume : AVolume {
};

// Class Engine.LightmassImportanceVolume
// Size: 0x438 (Inherited: 0x438)
struct ALightmassImportanceVolume : AVolume {
};

// Class Engine.MeshMergeCullingVolume
// Size: 0x438 (Inherited: 0x438)
struct AMeshMergeCullingVolume : AVolume {
};

// Class Engine.NavMeshBoundsVolume
// Size: 0x440 (Inherited: 0x438)
struct ANavMeshBoundsVolume : AVolume {
	struct FNavAgentSelector SupportedAgents; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class Engine.DefaultPhysicsVolume
// Size: 0x450 (Inherited: 0x450)
struct ADefaultPhysicsVolume : APhysicsVolume {
};

// Class Engine.KillZVolume
// Size: 0x450 (Inherited: 0x450)
struct AKillZVolume : APhysicsVolume {
};

// Class Engine.PainCausingVolume
// Size: 0x478 (Inherited: 0x450)
struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x450(0x01)
	char pad_450_1 : 7; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	float DamagePerSec; // 0x454(0x04)
	struct UClass* DamageType; // 0x458(0x08)
	float PainInterval; // 0x460(0x04)
	char bEntryPain : 1; // 0x464(0x01)
	char *b3a1603483 : 1; // 0x464(0x01)
	char pad_464_2 : 6; // 0x464(0x01)
	char pad_465[0x3]; // 0x465(0x03)
	struct AController* *38f615a2ac; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)
};

// Class Engine.BlendableInterface
// Size: 0x30 (Inherited: 0x30)
struct UBlendableInterface : UInterface {
};

// Class Engine.Scene
// Size: 0x30 (Inherited: 0x30)
struct UScene : UObject {
};

// Class Engine.*9e9b893e41
// Size: 0x30 (Inherited: 0x30)
struct U*9e9b893e41 : UInterface {
};

// Class Engine.PostProcessVolume
// Size: 0x9c0 (Inherited: 0x438)
struct APostProcessVolume : AVolume {
	char pad_438[0x8]; // 0x438(0x08)
	struct FPostProcessSettings Settings; // 0x440(0x570)
	float Priority; // 0x9b0(0x04)
	float BlendRadius; // 0x9b4(0x04)
	float BlendWeight; // 0x9b8(0x04)
	char bEnabled : 1; // 0x9bc(0x01)
	char bUnbound : 1; // 0x9bc(0x01)
	char pad_9BC_2 : 6; // 0x9bc(0x01)
	char pad_9BD[0x3]; // 0x9bd(0x03)

	float *0e74a7afd5(); // Function Engine.PostProcessVolume.*0e74a7afd5 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x66a9b98
	float *8480288ca6(); // Function Engine.PostProcessVolume.*8480288ca6 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x6687f6c
};

// Class Engine.PrecomputedVisibilityOverrideVolume
// Size: 0x468 (Inherited: 0x438)
struct APrecomputedVisibilityOverrideVolume : AVolume {
	struct TArray<struct AActor*> OverrideVisibleActors; // 0x438(0x10)
	struct TArray<struct AActor*> OverrideInvisibleActors; // 0x448(0x10)
	struct TArray<struct FName> OverrideInvisibleLevels; // 0x458(0x10)
};

// Class Engine.PrecomputedVisibilityVolume
// Size: 0x438 (Inherited: 0x438)
struct APrecomputedVisibilityVolume : AVolume {
};

// Class Engine.TriggerVolume
// Size: 0x438 (Inherited: 0x438)
struct ATriggerVolume : AVolume {
};

// Class Engine.*bd81404a65
// Size: 0x30 (Inherited: 0x30)
struct U*bd81404a65 : UInterface {
};

// Class Engine.CameraShake
// Size: 0x170 (Inherited: 0x30)
struct UCameraShake : UObject {
	char *d6b1d28607 : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *58a60c3cf3; // 0x34(0x04)
	float *206d2da50d; // 0x38(0x04)
	float *9d30b8d5d3; // 0x3c(0x04)
	struct F*d2c9ed4b21 *52c4287450; // 0x40(0x24)
	struct F*426dfcc594 *4eb97f3a4f; // 0x64(0x24)
	struct F*f15493e17b *fc4c873000; // 0x88(0x0c)
	float AnimPlayRate; // 0x94(0x04)
	float *3d02c9cb75; // 0x98(0x04)
	float *6cb2d05aec; // 0x9c(0x04)
	float *49b90e2efd; // 0xa0(0x04)
	float *edc22e7546; // 0xa4(0x04)
	struct UCameraAnim* Anim; // 0xa8(0x08)
	char bRandomAnimSegment : 1; // 0xb0(0x01)
	char pad_B0_1 : 7; // 0xb0(0x01)
	char pad_B1[0x17]; // 0xb1(0x17)
	struct APlayerCameraManager* CameraOwner; // 0xc8(0x08)
	char pad_D0[0x88]; // 0xd0(0x88)
	float ShakeScale; // 0x158(0x04)
	float OscillatorTimeRemaining; // 0x15c(0x04)
	struct U*faef588082* AnimInst; // 0x160(0x08)
	char pad_168[0x8]; // 0x168(0x08)

	float ReceivePlayShake(); // Function Engine.CameraShake.ReceivePlayShake // Event|Public|BlueprintEvent // @ game+0x273e04
	struct F*6d0e0b2cc1 BlueprintUpdateCameraShake(); // Function Engine.CameraShake.BlueprintUpdateCameraShake // Event|Public|HasOutParms|BlueprintEvent // @ game+0x273e04
	bool ReceiveIsFinished(); // Function Engine.CameraShake.ReceiveIsFinished // Native|Event|Public|BlueprintEvent|Const // @ game+0xbe7974
	bool ReceiveStopShake(); // Function Engine.CameraShake.ReceiveStopShake // Event|Public|BlueprintEvent // @ game+0x273e04
};

// Class Engine.*4aa7f8d102
// Size: 0x290 (Inherited: 0x200)
struct U*4aa7f8d102 : UActorComponent {
	char pad_200[0x70]; // 0x200(0x70)
	struct TArray<struct F*0319448750> *0319448750; // 0x270(0x10)
	char pad_280[0x10]; // 0x280(0x10)

	bool *959bc0574c(); // Function Engine.*4aa7f8d102.*959bc0574c // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6696948
	float *6ae4690b4c(); // Function Engine.*4aa7f8d102.*6ae4690b4c // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6691a2c
	bool *6ddf54aba4(); // Function Engine.*4aa7f8d102.*6ddf54aba4 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6695b6c
	float *afbff81a88(); // Function Engine.*4aa7f8d102.*afbff81a88 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x669180c
	float *29387b94aa(); // Function Engine.*4aa7f8d102.*29387b94aa // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6691914
	float *b27ae3d7c1(); // Function Engine.*4aa7f8d102.*b27ae3d7c1 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x669180c
	bool *20b3744d00(); // Function Engine.*4aa7f8d102.*20b3744d00 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6696948
	bool *f67ffad4ef(); // Function Engine.*4aa7f8d102.*f67ffad4ef // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x6696948
	enum class EEndPlayReason OnInputOwnerEndPlayed(); // Function Engine.*4aa7f8d102.OnInputOwnerEndPlayed // Final|Native|Private // @ game+0x669d240
	struct FVector *2a6055ccd7(); // Function Engine.*4aa7f8d102.*2a6055ccd7 // Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6691afc
};

// Class Engine.CurveFloat
// Size: 0xb0 (Inherited: 0x38)
struct UCurveFloat : UCurveBase {
	struct FRichCurve *e7fc2b8ab7; // 0x38(0x70)
	bool *5e02225e13; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)

	float *d28bc60b37(); // Function Engine.CurveFloat.*d28bc60b37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691c88
	float *e5df789493(); // Function Engine.CurveFloat.*e5df789493 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb10e18
};

// Class Engine.DecalActor
// Size: 0x408 (Inherited: 0x400)
struct ADecalActor : AActor {
	struct UDecalComponent* Decal; // 0x400(0x08)

	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(); // Function Engine.DecalActor.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x593bb74
	struct UMaterialInterface* *37dea3cfb9(); // Function Engine.DecalActor.*37dea3cfb9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6691c60
	struct UMaterialInterface* *1ba43ce700(); // Function Engine.DecalActor.*1ba43ce700 // Final|Native|Public|BlueprintCallable // @ game+0x66a47e0
};

// Class Engine.DestructibleActor
// Size: 0x420 (Inherited: 0x400)
struct ADestructibleActor : AActor {
	struct UDestructibleComponent* DestructibleComponent; // 0x400(0x08)
	char bAffectNavigation : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct FMulticastDelegate OnActorFracture; // 0x410(0x10)
};

// Class Engine.DistanceFieldCapture
// Size: 0x408 (Inherited: 0x400)
struct ADistanceFieldCapture : AActor {
	struct U*5eded02585* CaptureComponent; // 0x400(0x08)
};

// Class Engine.DocumentationActor
// Size: 0x408 (Inherited: 0x400)
struct ADocumentationActor : AActor {
	char pad_400[0x8]; // 0x400(0x08)
};

// Class Engine.Emitter
// Size: 0x450 (Inherited: 0x400)
struct AEmitter : AActor {
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x400(0x08)
	char *38c7be7858 : 1; // 0x408(0x01)
	char bPostUpdateTickGroup : 1; // 0x408(0x01)
	char *e11534c854 : 1; // 0x408(0x01)
	char pad_408_3 : 5; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct FMulticastDelegate OnParticleSpawn; // 0x410(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x420(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0x430(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0x440(0x10)

	void Activate(); // Function Engine.Emitter.Activate // Final|Native|Public|BlueprintCallable // @ game+0x66867fc
	void *1f22ea7014(); // Function Engine.Emitter.*1f22ea7014 // Final|Native|Public|BlueprintCallable // @ game+0x66a9860
	float SetFloatParameter(); // Function Engine.Emitter.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x66a4bdc
	struct FLinearColor *1e3c290f5c(); // Function Engine.Emitter.*1e3c290f5c // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a416c
	bool IsActive(); // Function Engine.Emitter.IsActive // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6696638
	void OnRep_bCurrentlyActive(); // Function Engine.Emitter.OnRep_bCurrentlyActive // Native|Public // @ game+0x5990144
	struct FVector *43b5fa91da(); // Function Engine.Emitter.*43b5fa91da // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x66a81d4
	void Deactivate(); // Function Engine.Emitter.Deactivate // Final|Native|Public|BlueprintCallable // @ game+0x668ceec
	struct AActor* *33a48ef273(); // Function Engine.Emitter.*33a48ef273 // Final|Native|Public|BlueprintCallable // @ game+0x66a1dc8
	struct UParticleSystem* *3eb6223e6f(); // Function Engine.Emitter.*3eb6223e6f // Native|Public|BlueprintCallable // @ game+0x59d0ec4
