// Class ORCA.ORCAManager
// Size: 0x478 (Inherited: 0x400)
struct AORCAManager : AActor {
	char pad_400[0x50]; // 0x400(0x50)
	struct FString *169acde1d5; // 0x450(0x10)
	float NeighborDist; // 0x460(0x04)
	int32 MaxNeighbors; // 0x464(0x04)
	float TimeHorizon; // 0x468(0x04)
	float Radius; // 0x46c(0x04)
	float MaxSpeed; // 0x470(0x04)
	char pad_474[0x4]; // 0x474(0x04)
};

