// BlueprintGeneratedClass BP_TracerManager.BP_TracerManager_C
// Size: 0x530 (Inherited: 0x530)
struct ABP_TracerManager_C : ATslTracerManager {
	struct UArrowComponent* ArrowComponent; // 0x3f0(0x08)
	struct TArray<struct UParticleSystemComponent*> *05b8ea34c4; // 0x408(0x10)
	float SimulationSubstepTime; // 0x428(0x04)
	float AmmoTimeout; // 0x42c(0x04)
	struct TArray<struct UParticleSystem*> TracerParticleArray; // 0x430(0x10)
	struct UParticleSystem* ShotGunParticleTemplate; // 0x440(0x08)
	struct TArray<struct UParticleSystem*> ProjectileParticleArray; // 0x448(0x10)
	struct TArray<struct UParticleSystem*> MeleeParticleArray; // 0x458(0x10)
	struct FVector ProjectileParticleColorRGB; // 0x468(0x0c)
	struct TMap<enum class *3ea1b45e04, struct FVector> ProjectileClassColorMap; // 0x478(0x50)
	struct FName ColorParameterName; // 0x4c8(0x08)
	struct UStaticMesh* DefaultTracerMesh; // 0x4d0(0x08)
	struct UMaterialInterface* DefaultTracerMeshMaterial; // 0x4d8(0x08)
	struct FVector DefaultTracerMeshScale; // 0x4e0(0x0c)
	enum class *a31f18ac56 DefaultBulletDisplayMode; // 0x4ec(0x01)
	int32 DefaultBulletDisplayType; // 0x4f0(0x04)
	enum class *a31f18ac56 DefaultProjectileDisplayMode; // 0x4f4(0x01)
	int32 DefaultProjectileDisplayType; // 0x4f8(0x04)
	int32 CurrentModeTypeIndex; // 0x4fc(0x04)
	struct TArray<struct F*9f7e91ab9e> ModeTypeArray; // 0x500(0x10)
	float Color1Multiplier; // 0x510(0x04)
	float Color2Multiplier; // 0x514(0x04)
	struct FName TeamColor1ParameterName; // 0x518(0x08)
	struct FName TeamColor2ParameterName; // 0x520(0x08)
	float GrenadeColorScalar; // 0x528(0x04)
};

