// BlueprintGeneratedClass DefaultRifleSetting.DefaultRifleSetting_C
// Size: 0x1080 (Inherited: 0x1080)
struct ADefaultRifleSetting_C : ATslWeapon_Trajectory {
	struct UParticleSystem* *7407395172; // 0xf30(0x08)
	float *0e72b6a21f; // 0xf40(0x04)
	struct FMulticastDelegate OnWeaponRecoil; // 0xf48(0x10)
	struct FName *aed64476a7; // 0xf58(0x08)
	struct TMap<float, struct UClass*> *369fb6afe7; // 0xf70(0x50)
	float TrajectoryGravityZ; // 0xfc4(0x04)
	struct UClass* *dd7b750fd1; // 0xfe0(0x08)
	struct UClass* *e6c11241ae; // 0xfe8(0x08)
	struct UWeaponTrajectoryData* WeaponTrajectoryData; // 0x1000(0x08)

	void *151f400028(struct FHitResult Impact); // Function TslGame.TslWeapon_Trajectory.*151f400028 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults|BlueprintCallable // @ game+0xb06504
	void *b15361c852(); // Function TslGame.TslWeapon_Trajectory.*b15361c852 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x56485c4
	struct FVector *717cc4cb6f(); // Function TslGame.TslWeapon_Trajectory.*717cc4cb6f // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x565632c
	void *69f8b37c4f(struct FHitResult Param0, struct AActor* Param2); // Function TslGame.TslWeapon_Trajectory.*69f8b37c4f // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x5642628
	void *8c8b6f5b20(); // Function TslGame.TslWeapon_Trajectory.*8c8b6f5b20 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5617d28
	void *12b23e5416(); // Function TslGame.TslWeapon_Trajectory.*12b23e5416 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x564f3cc
	void *1af39f23f5(struct FVector Param0); // Function TslGame.TslWeapon_Trajectory.*1af39f23f5 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x564fcd0
	void *09e1442c0b(); // Function TslGame.TslWeapon_Trajectory.*09e1442c0b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x56443e0
	void *95fc5b5950(); // Function TslGame.TslWeapon_Trajectory.*95fc5b5950 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5646db0
	struct FVector *0546dda494(); // Function TslGame.TslWeapon_Trajectory.*0546dda494 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x5656248
	void *f5cd3b2b19(); // Function TslGame.TslWeapon_Trajectory.*f5cd3b2b19 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5644ae4
	void *30a84816a7(); // Function TslGame.TslWeapon_Trajectory.*30a84816a7 // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x56506fc
	bool *4bec4cb25b(float Param8, struct TArray<int32> Param11, uint64 Param13, struct FVector Param23, struct FVector Param25, struct FVector Param27, uint32 Param38, float Param40, float Param42, struct FVector Param44); // Function TslGame.TslWeapon_Trajectory.*4bec4cb25b // Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x564dc78
	void *8a1758c744(); // Function TslGame.TslWeapon_Trajectory.*8a1758c744 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x564fee0
	struct FVector2D *7deb8a48d1(); // Function TslGame.TslWeapon_Trajectory.*7deb8a48d1 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x564f258
	struct FVector *77cb48c181(); // Function TslGame.TslWeapon_Trajectory.*77cb48c181 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x564d9ac
	void *91ec242b4d(); // Function TslGame.TslWeapon_Trajectory.*91ec242b4d // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x564fdd4
	void *e01a9f55f8(); // Function TslGame.TslWeapon_Trajectory.*e01a9f55f8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5644b50
	struct FVector *2f8afb1153(); // Function TslGame.TslWeapon_Trajectory.*2f8afb1153 // Net|Native|Event|NetMulticast|Protected|HasDefaults|BlueprintCallable // @ game+0x3e5958
	void *fd2a789628(); // Function TslGame.TslWeapon_Trajectory.*fd2a789628 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5646de8
	void *5132896c3f(); // Function TslGame.TslWeapon_Trajectory.*5132896c3f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5646dd0
	void *c07642bb51(); // Function TslGame.TslWeapon_Trajectory.*c07642bb51 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x8fd708
	void *fc109c2499(); // Function TslGame.TslWeapon_Trajectory.*fc109c2499 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5644414
	enum class EAnimStance *bf2ccd9e4c(); // Function TslGame.TslWeapon_Trajectory.*bf2ccd9e4c // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x55f7378
	void *0978d812ae(); // Function TslGame.TslWeapon_Trajectory.*0978d812ae // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5644b0c
	struct FVector_NetQuantize *a7d435ec1f(); // Function TslGame.TslWeapon_Trajectory.*a7d435ec1f // Net|Native|Event|Protected|NetServer|NetValidate // @ game+0x564db04
	void OnRep_WeaponSpread(); // Function TslGame.TslWeapon_Trajectory.OnRep_WeaponSpread // Final|Native|Protected // @ game+0x564c2c8
	void *560f55aa5d(struct FVector Param0); // Function TslGame.TslWeapon_Trajectory.*560f55aa5d // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x5656468
	void *5dd4e587f9(); // Function TslGame.TslWeapon_Trajectory.*5dd4e587f9 // Final|Native|Private|HasDefaults // @ game+0x564cedc
	void *86b4cb4a90(); // Function TslGame.TslWeapon_Trajectory.*86b4cb4a90 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5644d64
	struct FVector *1e952318c1(); // Function TslGame.TslWeapon_Trajectory.*1e952318c1 // Net|NetReliableNative|Event|Protected|HasDefaults|NetClient|Const // @ game+0x56427d4
	void *b85e594168(int32 Param0); // Function TslGame.TslWeapon_Trajectory.*b85e594168 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x564d804
};

