// Class Engine.Actor
// Size: 0x3f0 (Inherited: 0x28)
struct AActor : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct AActor*> Children; // 0x38(0x10)
	char pad_48_0 : 3; // 0x48(0x01)
	char *6a29209afc : 1; // 0x48(0x01)
	char pad_48_4 : 4; // 0x48(0x01)
	char pad_49_0 : 1; // 0x49(0x01)
	char *6583edce58 : 1; // 0x49(0x01)
	char bReplicates : 1; // 0x49(0x01)
	char pad_49_3 : 5; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
	struct FName *332fd811ca; // 0x50(0x08)
	enum class ENetRole RemoteRole; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct AActor* Owner; // 0x60(0x08)
	struct FRepMovement ReplicatedMovement; // 0x68(0x34)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct F*e5bda3d960 *e3fb0d68ff; // 0xa0(0x40)
	int32 *2d89f8ef7f; // 0xe0(0x04)
	float NetPriority; // 0xe4(0x04)
	enum class EAutoReceiveInput *8606d93d96; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)
	struct U*63b14265fa* *63b14265fa; // 0xf0(0x08)
	struct TArray<struct FName> Layers; // 0xf8(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x108(0x01)
	char bCanBeDamaged : 1; // 0x108(0x01)
	char *50cd51ed38 : 1; // 0x108(0x01)
	char *e002b42072 : 1; // 0x108(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x108(0x01)
	char *a4c704a3e5 : 1; // 0x108(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x108(0x01)
	char *13aea9b43a : 1; // 0x108(0x01)
	char *4211b886bf : 1; // 0x109(0x01)
	char pad_109_1 : 7; // 0x109(0x01)
	enum class ENetRole Role; // 0x10a(0x01)
	char pad_10B[0x5]; // 0x10b(0x05)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x110(0x10)
	enum class *66c1dada81 InputConsumeOption; // 0x120(0x01)
	char pad_121[0x3]; // 0x121(0x03)
	float NetUpdateFrequency; // 0x124(0x04)
	uint64 *f99b84bc94; // 0x128(0x08)
	char pad_130[0x4]; // 0x130(0x04)
	char *97cac516e7 : 1; // 0x134(0x01)
	char pad_134_1 : 4; // 0x134(0x01)
	char *cd27b8552b : 1; // 0x134(0x01)
	char *8aabd64ff4 : 1; // 0x134(0x01)
	char *3cd32b903e : 1; // 0x134(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x135(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x136(0x01)
	char pad_137[0x9]; // 0x137(0x09)
	struct FMulticastDelegate OnInputTouchLeave; // 0x140(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x150(0x10)
	float NetCullDistanceSquared; // 0x160(0x04)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x164(0x01)
	char pad_165[0x3]; // 0x165(0x03)
	int32 *2bc7f7749a; // 0x168(0x04)
	struct UChildActorComponent* *129513d23d; // 0x16c(0x08)
	struct AActor* ParentComponentActor; // 0x174(0x08)
	char pad_17C[0x4]; // 0x17c(0x04)
	struct FMulticastDelegate OnActorHit; // 0x180(0x10)
	struct FMulticastDelegate OnReleased; // 0x190(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x1a0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x1b0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x1c0(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x1d0(0x10)
	float CustomTimeDilation; // 0x1e0(0x04)
	float MinNetUpdateFrequency; // 0x1e4(0x04)
	float InitialLifeSpan; // 0x1e8(0x04)
	char pad_1EC[0x4]; // 0x1ec(0x04)
	struct FMulticastDelegate OnBeginCursorOver; // 0x1f0(0x10)
	char pad_200[0x10]; // 0x200(0x10)
	struct APawn* Instigator; // 0x210(0x08)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x218(0x10)
	struct TArray<struct AMatineeActor*> *6220728ad0; // 0x228(0x10)
	struct FMulticastDelegate OnTakePointDamage; // 0x238(0x10)
	char pad_248[0x18]; // 0x248(0x18)
	struct FMulticastDelegate OnInputTouchEnter; // 0x260(0x10)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x270(0x10)
	char bHidden : 1; // 0x280(0x01)
	char *0854a90e26 : 1; // 0x280(0x01)
	char *013332e5c6 : 1; // 0x280(0x01)
	char bOnlyRelevantToOwner : 1; // 0x280(0x01)
	char bAlwaysRelevant : 1; // 0x280(0x01)
	char *9ddfc785f1 : 1; // 0x280(0x01)
	char *05594c4443 : 1; // 0x280(0x01)
	char *ef19f6b6c9 : 1; // 0x280(0x01)
	char *dca9d9a72a : 1; // 0x281(0x01)
	char pad_281_1 : 1; // 0x281(0x01)
	char *16d69885c9 : 1; // 0x281(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x281(0x01)
	char *59968c9633 : 1; // 0x281(0x01)
	char pad_281_5 : 1; // 0x281(0x01)
	char *02848ec998 : 1; // 0x281(0x01)
	char pad_281_7 : 1; // 0x281(0x01)
	char pad_282[0x2]; // 0x282(0x02)
	struct FGuid DestructibleId; // 0x284(0x10)
	bool bIsDestroyedVersion; // 0x294(0x01)
	bool RemoveFromLevelLOD; // 0x295(0x01)
	char pad_296[0x2]; // 0x296(0x02)
	struct F*2066290a18 PrimaryActorTick; // 0x298(0x58)
	char pad_2F0[0x50]; // 0x2f0(0x50)
	struct FMulticastDelegate OnClicked; // 0x340(0x10)
	char pad_350[0x50]; // 0x350(0x50)
	struct FMulticastDelegate OnDestroyed; // 0x3a0(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3b0(0x10)
	char pad_3C0[0x8]; // 0x3c0(0x08)
	struct USceneComponent* RootComponent; // 0x3c8(0x08)
	struct TArray<struct FName> Tags; // 0x3d0(0x10)
	float *ae3e81fc86; // 0x3e0(0x04)
	char pad_3E4[0xc]; // 0x3e4(0x0c)

	void SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x639e2d0
	void *43eab6a44c(struct FName InputAxisName); // Function Engine.Actor.*43eab6a44c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f500
	void *2f371b4576(); // Function Engine.Actor.*2f371b4576 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x63a36d8
	void *e14d0605bc(); // Function Engine.Actor.*e14d0605bc // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638be14
	void *a487955527(); // Function Engine.Actor.*a487955527 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6396164
	void *724cefc729(); // Function Engine.Actor.*724cefc729 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63922cc
	struct FVector ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void *17f595f9ac(); // Function Engine.Actor.*17f595f9ac // Final|Native|Public|BlueprintCallable // @ game+0x6391e84
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xbcddd0
	void *c1c64c0f03(); // Function Engine.Actor.*c1c64c0f03 // Native|Public|BlueprintCallable // @ game+0xc20868
	void *7952614099(); // Function Engine.Actor.*7952614099 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c02c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xb6f010
	void ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6382c8c
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x639df2c
	void *3dcb8c828c(); // Function Engine.Actor.*3dcb8c828c // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x638b78c
	void *ccaa7ce1d0(); // Function Engine.Actor.*ccaa7ce1d0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c014
	void K2_AttachRootComponentToActor(struct FName InSocketName); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x639534c
	struct FRotator *679babdbe9(); // Function Engine.Actor.*679babdbe9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6398b2c
	struct AActor* *58360a298b(); // Function Engine.Actor.*58360a298b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393130
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390a70
	float MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63991e0
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xa169f4
	void K2_AddActorLocalTransform(struct FTransform NewTransform, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393a74
	void AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6384924
	void *fd605f1fa8(); // Function Engine.Actor.*fd605f1fa8 // Final|Native|Public|BlueprintCallable // @ game+0x639de94
	void *eda0f1fdef(); // Function Engine.Actor.*eda0f1fdef // Final|Native|Public|BlueprintCallable // @ game+0x63a3cc0
	void *6237fb723e(); // Function Engine.Actor.*6237fb723e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63967a8
	void *8e0bd09921(); // Function Engine.Actor.*8e0bd09921 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x638e3dc
	void DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x63896c8
	struct FName *7915dcfee8(); // Function Engine.Actor.*7915dcfee8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638da8c
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63936c4
	enum class *42e1cdcd79 *694ac52e11(enum class *42e1cdcd79 RotationRule); // Function Engine.Actor.*694ac52e11 // Final|Native|Public|BlueprintCallable // @ game+0x6395df4
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63974e8
	struct FHitResult K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639389c
	void K2_SetActorRotation(bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x703458
	void *927c0af560(); // Function Engine.Actor.*927c0af560 // Native|Public|BlueprintCallable // @ game+0x638b204
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6395c8c
	struct AActor* *bf3d34531f(); // Function Engine.Actor.*bf3d34531f // Final|Native|Public|BlueprintCallable // @ game+0x63a4e10
	void K2_AddActorWorldTransform(bool bSweep); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394050
	struct AActor* *2a43ddf3b4(); // Function Engine.Actor.*2a43ddf3b4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e234
	struct FHitResult ReceiveRadialDamage(struct AController* InstigatedBy); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x1e037c
	enum class EAttachmentRule *ca2fce53c9(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*ca2fce53c9 // Final|Native|Public|BlueprintCallable // @ game+0x639564c
	void *2f98c34a3e(); // Function Engine.Actor.*2f98c34a3e // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638c6d8
	struct AActor* *8ab522db39(); // Function Engine.Actor.*8ab522db39 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e194
	void *2cfa65e375(); // Function Engine.Actor.*2cfa65e375 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638bb48
	void *7af955f165(); // Function Engine.Actor.*7af955f165 // Native|Public|BlueprintCallable // @ game+0x639af28
	void *77574d4d00(float Tolerance); // Function Engine.Actor.*77574d4d00 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63a61e0
	struct UClass* *3d2b57891f(); // Function Engine.Actor.*3d2b57891f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d8a4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb722bc
	void *6d495b918e(); // Function Engine.Actor.*6d495b918e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e230
	void K2_SetActorLocation(bool bSweep, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6396ef4
	void GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xad04f0
	void ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x1e037c
	void SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x55d7234
	void ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FHitResult K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63976c0
	void *96888c26b2(); // Function Engine.Actor.*96888c26b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c694
	void *298b7db98d(); // Function Engine.Actor.*298b7db98d // Final|Native|Public|BlueprintCallable // @ game+0x6395ca4
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xb9cfd4
	void *b0466cb89a(); // Function Engine.Actor.*b0466cb89a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638be48
	void *4e14239fe2(struct FVector OutLocation); // Function Engine.Actor.*4e14239fe2 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bb70
	void *76b33f89d4(struct AActor* OtherActor); // Function Engine.Actor.*76b33f89d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391bb8
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FKey *a84ae826d7(); // Function Engine.Actor.*a84ae826d7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f40c
	void *1f7d6b60c4(); // Function Engine.Actor.*1f7d6b60c4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c054
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x1e037c
	void K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63970d8
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x1e037c
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x638975c
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *553025a5b6(); // Function Engine.Actor.*553025a5b6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fdec
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *3fb2f52d1d(); // Function Engine.Actor.*3fb2f52d1d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638ee30
	void *5c10316bc8(); // Function Engine.Actor.*5c10316bc8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392a18
	void *12680bdeab(); // Function Engine.Actor.*12680bdeab // Native|Public|BlueprintCallable // @ game+0x63a5b00
	void *094169766b(); // Function Engine.Actor.*094169766b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fd3c
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *a80dd65dbf(); // Function Engine.Actor.*a80dd65dbf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392980
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FHitResult K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6397310
	void *7664b363a1(); // Function Engine.Actor.*7664b363a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390e60
	struct TArray<struct AActor*> *f77af040ad(); // Function Engine.Actor.*f77af040ad // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638c474
	void K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x638b7a0
	void *28809cb5e5(); // Function Engine.Actor.*28809cb5e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bfe0
	void *d21a3baa7f(); // Function Engine.Actor.*d21a3baa7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390f6c
	struct FName K2_AttachRootComponentTo(enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x63951cc
	void *3a00f3bb48(); // Function Engine.Actor.*3a00f3bb48 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63916f8
	void *f2d13d9497(); // Function Engine.Actor.*f2d13d9497 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c670
	struct UObject* AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6e6d18
	void *6f6713dfba(struct AActor* OtherActor); // Function Engine.Actor.*6f6713dfba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638eed0
	struct UMaterialInterface* *ea2a94b7da(); // Function Engine.Actor.*ea2a94b7da // Final|Native|Public|BlueprintCallable // @ game+0x6399164
	struct UClass* *2bbda76e95(); // Function Engine.Actor.*2bbda76e95 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d99c
	struct AActor* ReceivePointDamage(struct U*498af98d1d* DamageType, struct FVector HitNormal); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x1e037c
	void GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390cd0
	void *3b635a9905(); // Function Engine.Actor.*3b635a9905 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e190
	enum class EAttachmentRule *e13072354b(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*e13072354b // Final|Native|Public|BlueprintCallable // @ game+0x1fe714
	void *4aadbb23a5(); // Function Engine.Actor.*4aadbb23a5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390f90
	struct AActor* *82b3653b7b(); // Function Engine.Actor.*82b3653b7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392304
	bool K2_AddActorWorldRotation(struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393e78
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639629c
	struct FVector GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638b9a0
	void *d30428cd54(); // Function Engine.Actor.*d30428cd54 // Final|Native|Public|BlueprintCallable // @ game+0x63a3ba8
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x236e50
	void *7fc2785714(); // Function Engine.Actor.*7fc2785714 // Native|Public|BlueprintCallable // @ game+0x639ae00
	void *8df9beeffc(); // Function Engine.Actor.*8df9beeffc // Native|Public|BlueprintCallable // @ game+0x63a3640
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool K2_AddActorWorldOffset(struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393ca0
	void *2ad230fb6c(); // Function Engine.Actor.*2ad230fb6c // Final|Native|Public|BlueprintCallable // @ game+0x639e364
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x3fabf8
	bool K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63978ec
	void *b01fc0cf78(); // Function Engine.Actor.*b01fc0cf78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bc7c
	void *9ffc398f85(); // Function Engine.Actor.*9ffc398f85 // Native|Public|BlueprintCallable // @ game+0x6384a4c
	void *9fc33c71b8(); // Function Engine.Actor.*9fc33c71b8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392964
	struct AController* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1e037c
	void *34c6511ade(); // Function Engine.Actor.*34c6511ade // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fd24
	void ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FKey *8ff8fb0472(); // Function Engine.Actor.*8ff8fb0472 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638fb1c
};

// Class Engine.AnimInstance
// Size: 0x398 (Inherited: 0x28)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct USkeleton* *3d26a0f5a9; // 0x30(0x08)
	enum class *70bf4a9cf2 *06b775a106; // 0x38(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x39(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x3a(0x01)
	bool *b16fe671be; // 0x3b(0x01)
	bool bWarnAboutBlueprintUsage; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x40(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x50(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x60(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x70(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x80(0x10)
	char pad_90[0x60]; // 0x90(0x60)
	bool *9e5b2e55cd; // 0xf0(0x01)
	char pad_F1[0x9f]; // 0xf1(0x9f)
	struct TArray<struct FAnimNotifyEvent> *e83d212201; // 0x190(0x10)
	char pad_1A0[0x1f8]; // 0x1a0(0x1f8)

	struct UAnimMontage* *1049bf0142(); // Function Engine.AnimInstance.*1049bf0142 // Final|Native|Public|BlueprintCallable // @ game+0x63dcce4
	void *fb3df011d9(); // Function Engine.AnimInstance.*fb3df011d9 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c4dc8
	void *ad69a18e5a(); // Function Engine.AnimInstance.*ad69a18e5a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d1be4
	int32 GetStateWeight(); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63cc3f8
	struct UAnimMontage* *d46dc5dc83(); // Function Engine.AnimInstance.*d46dc5dc83 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63dc64c
	int32 PlaySlotAnimation(struct FName SlotNodeName, float BlendOutTime); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x63e0708
	enum class EMontagePlayReturnType Montage_Play(float InTimeToStartMontageAt); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x1fe88c
	void *242396e0df(struct FName NextSection); // Function Engine.AnimInstance.*242396e0df // Native|Public|BlueprintCallable // @ game+0x568a8c0
	struct FName *0c3e0ee134(); // Function Engine.AnimInstance.*0c3e0ee134 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cc8c0
	struct UAnimSequenceBase* *8c0c4894ae(struct FName SlotNodeName); // Function Engine.AnimInstance.*8c0c4894ae // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d2328
	void *691ee180b3(struct UAnimMontage* Montage); // Function Engine.AnimInstance.*691ee180b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63dc788
	int32 *e267668cef(); // Function Engine.AnimInstance.*e267668cef // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c6d68
	int32 *723eae25e1(); // Function Engine.AnimInstance.*723eae25e1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c75d8
	void GetCurrentStateElapsedTime(int32 MachineIndex); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c4d28
	void *91ee611ffd(struct FName SectionName); // Function Engine.AnimInstance.*91ee611ffd // Native|Public|BlueprintCallable // @ game+0x9c410c
	int32 *e146fc91b1(); // Function Engine.AnimInstance.*e146fc91b1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c72e4
	struct FName *057fda6034(); // Function Engine.AnimInstance.*057fda6034 // Final|Native|Public|BlueprintCallable // @ game+0x63f0634
	void GetAnimAssetPlayerTimeFromEnd(struct UAnimationAsset* AnimAsset); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c3294
	int32 *48c662fc37(); // Function Engine.AnimInstance.*48c662fc37 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c7cd8
	int32 *245284edb6(); // Function Engine.AnimInstance.*245284edb6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c6b8c
	void *f364c6828d(int32 StateIndex); // Function Engine.AnimInstance.*f364c6828d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63ca934
	struct UAnimMontage* *bf78400b8f(); // Function Engine.AnimInstance.*bf78400b8f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63dc968
	struct UAnimMontage* *5eeab7b91c(); // Function Engine.AnimInstance.*5eeab7b91c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63dc5ac
	void *bca340010a(struct UAnimMontage* Montage); // Function Engine.AnimInstance.*bca340010a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63dc6e8
	void *c5fd55eb88(bool bUnlockMovement); // Function Engine.AnimInstance.*c5fd55eb88 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x63d8120
	int32 *fd0ea4aa33(); // Function Engine.AnimInstance.*fd0ea4aa33 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c6f2c
	struct UAnimMontage* *ccdbbc4b23(); // Function Engine.AnimInstance.*ccdbbc4b23 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63dc828
	void *1ab31cd97b(); // Function Engine.AnimInstance.*1ab31cd97b // Final|Native|Public|BlueprintCallable // @ game+0x63f24a0
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool *3ae29e8bbb(); // Function Engine.AnimInstance.*3ae29e8bbb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d28b0
	void *f61ade023a(); // Function Engine.AnimInstance.*f61ade023a // Final|Native|Public|BlueprintCallable // @ game+0x63dcc04
	void *9b89db3b5d(int32 MachineIndex); // Function Engine.AnimInstance.*9b89db3b5d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c7ac4
	struct FName *058de0418c(); // Function Engine.AnimInstance.*058de0418c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5e4d0c
	void *66a3995478(struct FName SyncGroup); // Function Engine.AnimInstance.*66a3995478 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d02bc
	void *899177a2d7(); // Function Engine.AnimInstance.*899177a2d7 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c69b0
	void *e8a9ba9091(); // Function Engine.AnimInstance.*e8a9ba9091 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x63f8544
	int32 *3c7c31cc75(); // Function Engine.AnimInstance.*3c7c31cc75 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63caa1c
	void *66f0434692(struct FName MarkerName); // Function Engine.AnimInstance.*66f0434692 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x63ccf88
	void *5e755e4562(); // Function Engine.AnimInstance.*5e755e4562 // Native|Public|BlueprintCallable // @ game+0x63e57b0
	void *79ed44711d(); // Function Engine.AnimInstance.*79ed44711d // Final|Native|Public|BlueprintCallable // @ game+0x63dcb74
	void *ccd070a982(); // Function Engine.AnimInstance.*ccd070a982 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb9a084
	void *84bfa05c08(struct FVector Velocity); // Function Engine.AnimInstance.*84bfa05c08 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63b463c
	int32 *3ae1a9d556(); // Function Engine.AnimInstance.*3ae1a9d556 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c7ee8
	float *f6100f1f77(); // Function Engine.AnimInstance.*f6100f1f77 // Native|Public|BlueprintCallable // @ game+0x8aed70
	void *ec3409ea7b(); // Function Engine.AnimInstance.*ec3409ea7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c4940
	void *905d29ade2(); // Function Engine.AnimInstance.*905d29ade2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbfd0e0
	void *3080ec9377(); // Function Engine.AnimInstance.*3080ec9377 // Final|Native|Public|BlueprintCallable // @ game+0x63dcae4
	int32 *8c5198f019(); // Function Engine.AnimInstance.*8c5198f019 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x275f14
	float PlaySlotAnimationAsDynamicMontage(struct FName SlotNodeName, float BlendOutTime); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x63e092c
	int32 *f36dfe6065(int32 StateIndex); // Function Engine.AnimInstance.*f36dfe6065 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x275670
	void GetAnimAssetPlayerLength(struct UAnimationAsset* AnimAsset); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x63c3120
	bool *0d4faf3909(); // Function Engine.AnimInstance.*0d4faf3909 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x63d8120
	float GetAnimAssetPlayerTimeFromEndFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x63c3398
	void *24d7f1731e(); // Function Engine.AnimInstance.*24d7f1731e // Final|Native|Public|BlueprintCallable // @ game+0x63dca08
	void *a6e097a5c0(); // Function Engine.AnimInstance.*a6e097a5c0 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63c70f0
	void *07eb4aa7bc(); // Function Engine.AnimInstance.*07eb4aa7bc // Final|Native|Public|BlueprintCallable // @ game+0x63b78e4
	int32 *d9cbacaeac(); // Function Engine.AnimInstance.*d9cbacaeac // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x63cac48
	void *9687b3535a(int32 MachineIndex); // Function Engine.AnimInstance.*9687b3535a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xa16af0
	float GetAnimAssetPlayerTimeFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x63c31b4
	struct UAnimMontage* *771de70e87(); // Function Engine.AnimInstance.*771de70e87 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63dc8c8
	void *53d492fe87(); // Function Engine.AnimInstance.*53d492fe87 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63ff258
	void BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x1e037c
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x1e037c
	float *3b5b96bdbc(); // Function Engine.AnimInstance.*3b5b96bdbc // Final|Native|Public|BlueprintCallable // @ game+0x63fd510
};

// Class Engine.ActorComponent
// Size: 0x1f0 (Inherited: 0x28)
struct UActorComponent : UObject {
	char pad_28[0xe8]; // 0x28(0xe8)
	struct F*64c6f9629b PrimaryComponentTick; // 0x110(0x58)
	struct TArray<struct FName> ComponentTags; // 0x168(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x178(0x10)
	char pad_188_0 : 3; // 0x188(0x01)
	char bReplicates : 1; // 0x188(0x01)
	char bNetAddressable : 1; // 0x188(0x01)
	char *d9de2ce983 : 1; // 0x188(0x01)
	char pad_188_6 : 2; // 0x188(0x01)
	char pad_189[0x1]; // 0x189(0x01)
	char pad_18A_0 : 2; // 0x18a(0x01)
	char bCreatedByConstructionScript : 1; // 0x18a(0x01)
	char bInstanceComponent : 1; // 0x18a(0x01)
	char bAutoActivate : 1; // 0x18a(0x01)
	char *eedbc91ee9 : 1; // 0x18a(0x01)
	char *8016acb0c2 : 1; // 0x18a(0x01)
	char pad_18A_7 : 1; // 0x18a(0x01)
	char pad_18B[0x1]; // 0x18b(0x01)
	struct FGuid DestructibleId; // 0x18c(0x10)
	bool bIsDestroyedVersion; // 0x19c(0x01)
	char pad_19D[0x3]; // 0x19d(0x03)
	char *cb59e077f1 : 1; // 0x1a0(0x01)
	char pad_1A0_1 : 2; // 0x1a0(0x01)
	char bIsEditorOnly : 1; // 0x1a0(0x01)
	char pad_1A0_4 : 4; // 0x1a0(0x01)
	char pad_1A1[0x4]; // 0x1a1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1a5(0x01)
	enum class EPendingCreationType *a029c1f885; // 0x1a6(0x01)
	char pad_1A7[0x9]; // 0x1a7(0x09)
	struct TArray<struct FSimpleMemberReference> *1c5b1ecf7e; // 0x1b0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1d0(0x10)
	char pad_1E0[0x9]; // 0x1e0(0x09)
	char *6583edce58 : 1; // 0x1e9(0x01)
	char pad_1E9_1 : 7; // 0x1e9(0x01)
	char pad_1EA[0x6]; // 0x1ea(0x06)

	void *b3ab644ab0(); // Function Engine.ActorComponent.*b3ab644ab0 // Native|Public|BlueprintCallable // @ game+0x639e998
	void *7fc2785714(); // Function Engine.ActorComponent.*7fc2785714 // Native|Public|BlueprintCallable // @ game+0x639ae94
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x6399758
	void AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x63849b8
	void Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xc1f2b8
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0x8e93c0
	void *7e6bf7eb55(); // Function Engine.ActorComponent.*7e6bf7eb55 // Final|Native|Public|BlueprintCallable // @ game+0x63a1b84
	void *eda0f1fdef(); // Function Engine.ActorComponent.*eda0f1fdef // Final|Native|Public|BlueprintCallable // @ game+0x63a3d58
	void IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x639293c
	void *7af955f165(); // Function Engine.ActorComponent.*7af955f165 // Native|Public|BlueprintCallable // @ game+0x639afbc
	void *b6de83bb83(); // Function Engine.ActorComponent.*b6de83bb83 // Native|Public|BlueprintCallable // @ game+0x5e38004
	void ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *d30428cd54(); // Function Engine.ActorComponent.*d30428cd54 // Final|Native|Public|BlueprintCallable // @ game+0x63a3c34
	void *ef1420b078(); // Function Engine.ActorComponent.*ef1420b078 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d94c
	bool *cc59ee805b(); // Function Engine.ActorComponent.*cc59ee805b // Native|Public|BlueprintCallable // @ game+0x639dda0
	void *7664b363a1(); // Function Engine.ActorComponent.*7664b363a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb0ed1c
	void *70313663c3(); // Function Engine.ActorComponent.*70313663c3 // Final|Native|Public|BlueprintCallable // @ game+0x63a05e4
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *9ffc398f85(); // Function Engine.ActorComponent.*9ffc398f85 // Native|Public|BlueprintCallable // @ game+0x6384ae0
	void *65f31f10a3(); // Function Engine.ActorComponent.*65f31f10a3 // Native|Public|BlueprintCallable // @ game+0x63a054c
	void ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *db9ec7e456(); // Function Engine.ActorComponent.*db9ec7e456 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63929fc
	void *baf5caeb25(); // Function Engine.ActorComponent.*baf5caeb25 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392b14
	void *298b7db98d(); // Function Engine.ActorComponent.*298b7db98d // Final|Native|Public|BlueprintCallable // @ game+0x6395d3c
	struct FName *d920280472(); // Function Engine.ActorComponent.*d920280472 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63886f8
};

// Class Engine.Pawn
// Size: 0x450 (Inherited: 0x3f0)
struct APawn : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	char bUseControllerRotationPitch : 1; // 0x3f8(0x01)
	char bUseControllerRotationYaw : 1; // 0x3f8(0x01)
	char bUseControllerRotationRoll : 1; // 0x3f8(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x3f8(0x01)
	char pad_3F8_4 : 4; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	float BaseEyeHeight; // 0x3fc(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x400(0x01)
	enum class EAutoPossessAI *ae9b8791a2; // 0x401(0x01)
	char pad_402[0x6]; // 0x402(0x06)
	struct UClass* AIControllerClass; // 0x408(0x08)
	struct AController* *f127658d48; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct APlayerState* PlayerState; // 0x420(0x08)
	struct AController* Controller; // 0x428(0x08)
	uint16 *015f228c35; // 0x430(0x02)
	char pad_432[0x6]; // 0x432(0x06)
	struct FVector *0bd692bd5a; // 0x438(0x0c)
	struct FVector *77f948b8f9; // 0x444(0x0c)

	void ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x1e037c
	void AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x6382fb0
	void *ceaebf3734(); // Function Engine.Pawn.*ceaebf3734 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63930b8
	void AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x6382f14
	void *aea6d1fc21(bool bNewValue); // Function Engine.Pawn.*aea6d1fc21 // Final|Native|Public|BlueprintCallable // @ game+0x639fa28
	void *b5c3a53167(); // Function Engine.Pawn.*b5c3a53167 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb94604
	void *e777ec86c5(); // Function Engine.Pawn.*e777ec86c5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638fdc4
	void *f8ca4cbaf3(); // Function Engine.Pawn.*f8ca4cbaf3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5649218
	void *e6a1adb893(); // Function Engine.Pawn.*e6a1adb893 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5616eac
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x7a900c
	float *a90e1eb5c4(); // Function Engine.Pawn.*a90e1eb5c4 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6384140
	void *3d498218ec(); // Function Engine.Pawn.*3d498218ec // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c7c0
	void *ff0cdc3443(struct APawn* Pawn); // Function Engine.Pawn.*ff0cdc3443 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x6390548
	void K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639123c
	bool *3faa338288(); // Function Engine.Pawn.*3faa338288 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6398d84
	void *85e6be51d8(); // Function Engine.Pawn.*85e6be51d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392b40
	void AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x638304c
	void ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *a62a63aaf3(); // Function Engine.Pawn.*a62a63aaf3 // Native|Public|BlueprintCallable // @ game+0x63a4ff4
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0x35f3f0
	void *1d88abf6ea(); // Function Engine.Pawn.*1d88abf6ea // Native|Public|BlueprintCallable // @ game+0x56127e8
	void GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638dc04
	void *cd903f5bc1(); // Function Engine.Pawn.*cd903f5bc1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639123c
	void *5a325d1f01(); // Function Engine.Pawn.*5a325d1f01 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6390680
	void *3b0d0a8384(); // Function Engine.Pawn.*3b0d0a8384 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6388b10
	void *1dde1276de(struct FVector NoiseLocation); // Function Engine.Pawn.*1dde1276de // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6399b7c
	void GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x56e1e64
};

// Class Engine.DataAsset
// Size: 0x30 (Inherited: 0x28)
struct UDataAsset : UObject {
	struct UClass* *d62375829a; // 0x28(0x08)
};

// Class Engine.SceneComponent
// Size: 0x4d0 (Inherited: 0x1f0)
struct USceneComponent : UActorComponent {
	struct FRotator RelativeRotation; // 0x1f0(0x0c)
	char pad_1FC[0xc]; // 0x1fc(0x0c)
	struct FVector RelativeLocation; // 0x208(0x0c)
	struct FVector RelativeScale3D; // 0x214(0x0c)
	char pad_220_0 : 1; // 0x220(0x01)
	char bReplicatesAttachmentReference : 1; // 0x220(0x01)
	char bReplicatesAttachment : 1; // 0x220(0x01)
	char *9874f81ad0 : 1; // 0x220(0x01)
	char pad_220_4 : 1; // 0x220(0x01)
	char bAbsoluteLocation : 1; // 0x220(0x01)
	char bAbsoluteRotation : 1; // 0x220(0x01)
	char bAbsoluteScale : 1; // 0x220(0x01)
	char bVisible : 1; // 0x221(0x01)
	char bHiddenInGame : 1; // 0x221(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x221(0x01)
	char *131f3529c6 : 1; // 0x221(0x01)
	char bUseAttachParentBound : 1; // 0x221(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x221(0x01)
	char pad_221_6 : 2; // 0x221(0x01)
	char pad_222[0x2e]; // 0x222(0x2e)
	char bAbsoluteTranslation : 1; // 0x250(0x01)
	char pad_250_1 : 7; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct APhysicsVolume* PhysicsVolume; // 0x254(0x08)
	char pad_25C[0x1c]; // 0x25c(0x1c)
	struct FVector RelativeTranslation; // 0x278(0x0c)
	char pad_284[0x8c]; // 0x284(0x8c)
	enum class EComponentMobility Mobility; // 0x310(0x01)
	enum class *1d65b135dd DetailMode; // 0x311(0x01)
	char pad_312[0x6]; // 0x312(0x06)
	SetProperty *815e178173; // 0x318(0x50)
	char pad_368[0x10]; // 0x368(0x10)
	struct USceneComponent* AttachParent; // 0x378(0x08)
	struct FName *055f551900; // 0x380(0x08)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x388(0x10)
	struct FVector *49e84c2fad; // 0x398(0x0c)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x3a8(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x3b8(0x10)
	char pad_3C8[0x108]; // 0x3c8(0x108)

	void K2_AddWorldTransform(bool bSweep); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394fa0
	struct FHitResult K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394454
	bool K2_AddWorldOffset(struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394bf0
	void *24d4692696(); // Function Engine.SceneComponent.*24d4692696 // Final|Native|Public|BlueprintCallable // @ game+0x63a1a4c
	struct FHitResult K2_AddWorldRotation(); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394dc8
	bool K2_SetRelativeLocation(struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6397b20
	void DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x63895d4
	struct FHitResult K2_SetWorldRotation(); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6398728
	void *a4c0c6dacf(); // Function Engine.SceneComponent.*a4c0c6dacf // Final|Native|Public|BlueprintCallable // @ game+0x639b080
	void K2_SetWorldTransform(struct FTransform NewTransform, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6398900
	void *c95aa311e1(); // Function Engine.SceneComponent.*c95aa311e1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a4ae0
	void *64c6a50e0e(); // Function Engine.SceneComponent.*64c6a50e0e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63929d4
	void OnRep_Visibility(); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x639984c
	void K2_AddLocalOffset(bool bSweep); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639427c
	void *1ab06a479c(); // Function Engine.SceneComponent.*1ab06a479c // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638d964
	int32 *8ecb931576(); // Function Engine.SceneComponent.*8ecb931576 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d444
	void *e94c620b17(struct FName InSocketName); // Function Engine.SceneComponent.*e94c620b17 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6389808
	void K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6396528
	void *71b355cc39(); // Function Engine.SceneComponent.*71b355cc39 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbd0b50
	struct FName *c7f3749d3f(); // Function Engine.SceneComponent.*c7f3749d3f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63934b8
	void *47f11c6aa4(); // Function Engine.SceneComponent.*47f11c6aa4 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638d4e4
	void *7b9f3977eb(); // Function Engine.SceneComponent.*7b9f3977eb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63964e4
	struct FHitResult K2_AddLocalTransform(); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639462c
	void *d6237c56a2(struct FRotator NewRotation, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.*d6237c56a2 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63984f8
	void *fdc9f4ce48(); // Function Engine.SceneComponent.*fdc9f4ce48 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63920fc
	void *c983529eeb(); // Function Engine.SceneComponent.*c983529eeb // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a33bc
	void *fadfce2f5c(struct USceneComponent* InParent); // Function Engine.SceneComponent.*fadfce2f5c // Final|Native|Public|BlueprintCallable // @ game+0x63a4eec
	void *fe65a776a5(); // Function Engine.SceneComponent.*fe65a776a5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6396460
	bool SetVisibility(); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xb9f430
	void *e51a15ac42(); // Function Engine.SceneComponent.*e51a15ac42 // Final|Native|Public|BlueprintCallable // @ game+0x63a1ae8
	void K2_SetRelativeRotation(bool bSweep); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6397f1c
	void *a0c587c4d6(); // Function Engine.SceneComponent.*a0c587c4d6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x639088c
	enum class *42e1cdcd79 *a17d5e84b8(enum class *42e1cdcd79 ScaleRule); // Function Engine.SceneComponent.*a17d5e84b8 // Final|Native|Public|BlueprintCallable // @ game+0x1fe3dc
	struct FHitResult *f0cbf81c2a(struct FRotator NewRotation); // Function Engine.SceneComponent.*f0cbf81c2a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6397cec
	struct FHitResult K2_AddRelativeLocation(); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394858
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xae4444
	void *330134b8c2(); // Function Engine.SceneComponent.*330134b8c2 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63916a0
	void *cb975ed8ba(); // Function Engine.SceneComponent.*cb975ed8ba // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638e338
	struct FHitResult K2_SetRelativeTransform(); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63980f4
	void *5b447b62b7(bool bNewAbsoluteRotation); // Function Engine.SceneComponent.*5b447b62b7 // Final|Native|Public|BlueprintCallable // @ game+0x639dc5c
	struct FName *a27f6d4764(); // Function Engine.SceneComponent.*a27f6d4764 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6391868
	bool *287e49cc7e(); // Function Engine.SceneComponent.*287e49cc7e // Final|Native|Public|BlueprintCallable // @ game+0x63a1774
	void *6f297235ba(); // Function Engine.SceneComponent.*6f297235ba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391498
	void IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63935ac
	void *bb79d1adbb(); // Function Engine.SceneComponent.*bb79d1adbb // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x639112c
	enum class EAttachLocation K2_AttachTo(bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x63954cc
	void K2_SetWorldLocation(struct FVector NewLocation, struct FHitResult SweepHitResult); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6398320
	void *709ad87786(); // Function Engine.SceneComponent.*709ad87786 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c5a4
	struct FName *716c958ce4(enum class *5515701312 TransformSpace); // Function Engine.SceneComponent.*716c958ce4 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6391a88
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xc0a81c
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xc0a81c
	struct FHitResult K2_AddRelativeRotation(); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394a24
	void *77cf8156db(struct FName InSocketName); // Function Engine.SceneComponent.*77cf8156db // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63919d0
	void *c786340f98(); // Function Engine.SceneComponent.*c786340f98 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c6c0
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xba2854
	void *8686c19d5c(); // Function Engine.SceneComponent.*8686c19d5c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639170c
	struct USceneComponent* *e13072354b(struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule ScaleRule); // Function Engine.SceneComponent.*e13072354b // Final|Native|Public|BlueprintCallable // @ game+0x639586c
	void ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x63a5c64
	struct FName *45081e78dc(); // Function Engine.SceneComponent.*45081e78dc // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6391920
	void *4883fee90d(); // Function Engine.SceneComponent.*4883fee90d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639641c
};

// Class Engine.PrimitiveComponent
// Size: 0xa00 (Inherited: 0x4d0)
struct UPrimitiveComponent : USceneComponent {
	char pad_4D0[0x8]; // 0x4d0(0x08)
	float MinDrawDistance; // 0x4d8(0x04)
	float LDMaxDrawDistance; // 0x4dc(0x04)
	float CachedMaxDrawDistance; // 0x4e0(0x04)
	enum class *3c659ab94c *7512e3d028; // 0x4e4(0x01)
	enum class *3c659ab94c *d9fcd9b4bb; // 0x4e5(0x01)
	char pad_4E6[0x2]; // 0x4e6(0x02)
	char pad_4E8_0 : 3; // 0x4e8(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x4e8(0x01)
	char bGenerateOverlapEvents : 1; // 0x4e8(0x01)
	char bMultiBodyOverlap : 1; // 0x4e8(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x4e8(0x01)
	char bTraceComplexOnMove : 1; // 0x4e8(0x01)
	char bDisableForceFromCharacter : 1; // 0x4e9(0x01)
	char bReturnMaterialOnMove : 1; // 0x4e9(0x01)
	char *3e4d34552d : 1; // 0x4e9(0x01)
	char bAllowCullDistanceVolume : 1; // 0x4e9(0x01)
	char bImportantMesh : 1; // 0x4e9(0x01)
	char bOverrideCullingDistances : 1; // 0x4e9(0x01)
	char pad_4E9_6 : 2; // 0x4e9(0x01)
	char pad_4EA[0x2]; // 0x4ea(0x02)
	float HLODScreenSize; // 0x4ec(0x04)
	char *2f091bbd0e : 1; // 0x4f0(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x4f0(0x01)
	char bRenderInMainPass : 1; // 0x4f0(0x01)
	char bRenderInMono : 1; // 0x4f0(0x01)
	char bOwnerNoSee : 1; // 0x4f0(0x01)
	char bOnlyOwnerSee : 1; // 0x4f0(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x4f0(0x01)
	char bUseAsOccluder : 1; // 0x4f0(0x01)
	char bForceAsOccluder : 1; // 0x4f1(0x01)
	char bForceOcclusionQuerying : 1; // 0x4f1(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x4f1(0x01)
	char *afd92d8969 : 1; // 0x4f1(0x01)
	char bForceMipStreaming : 1; // 0x4f1(0x01)
	char *4c581fbba9 : 1; // 0x4f1(0x01)
	char pad_4F1_6 : 1; // 0x4f1(0x01)
	char CastShadow : 1; // 0x4f1(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x4f2(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x4f2(0x01)
	char bCastDynamicShadow : 1; // 0x4f2(0x01)
	char bCastStaticShadow : 1; // 0x4f2(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x4f2(0x01)
	char bSelfShadowOnly : 1; // 0x4f2(0x01)
	char bCastFarShadow : 1; // 0x4f2(0x01)
	char bCastInsetShadow : 1; // 0x4f2(0x01)
	char bCastCinematicShadow : 1; // 0x4f3(0x01)
	char bCastHiddenShadow : 1; // 0x4f3(0x01)
	char bCastShadowAsTwoSided : 1; // 0x4f3(0x01)
	char bLightAsIfStatic : 1; // 0x4f3(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x4f3(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x4f3(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x4f3(0x01)
	char bIgnoreRadialImpulse : 1; // 0x4f3(0x01)
	char bIgnoreRadialForce : 1; // 0x4f4(0x01)
	char bApplyImpulseOnDamage : 1; // 0x4f4(0x01)
	char bSyncBodySleep : 1; // 0x4f4(0x01)
	char *27b0806be5 : 1; // 0x4f4(0x01)
	char *6f3b773115 : 1; // 0x4f4(0x01)
	char *b11801b90d : 1; // 0x4f4(0x01)
	char bRenderCustomDepth : 1; // 0x4f4(0x01)
	char pad_4F4_7 : 1; // 0x4f4(0x01)
	char pad_4F5_0 : 7; // 0x4f5(0x01)
	char *668636af81 : 1; // 0x4f5(0x01)
	char *b3a3eee86b : 1; // 0x4f6(0x01)
	char *07830a14a6 : 1; // 0x4f6(0x01)
	char pad_4F6_2 : 6; // 0x4f6(0x01)
	char pad_4F7[0x1]; // 0x4f7(0x01)
	enum class EDecalChannel DecalChannel; // 0x4f8(0x01)
	enum class *c0765ad24b IndoorOutdoorMask; // 0x4f9(0x01)
	struct FLightingChannels LightingChannels; // 0x4fa(0x03)
	enum class *d315e71b47 IndirectLightingCacheQuality; // 0x4fd(0x01)
	bool CustomDepthStencilValue; // 0x4fe(0x01)
	enum class *6e131cfc7f CustomDepthStencilWriteMask; // 0x4ff(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x500(0x10)
	int32 TranslucencySortPriority; // 0x510(0x04)
	int32 *6862844184; // 0x514(0x04)
	char pad_518[0x4]; // 0x518(0x04)
	float LpvBiasMultiplier; // 0x51c(0x04)
	struct FBodyInstance BodyInstance; // 0x520(0x230)
	char pad_750[0x8]; // 0x750(0x08)
	enum class EHasCustomNavigableGeometry *9a13a32dd1; // 0x758(0x01)
	char pad_759[0x3b]; // 0x759(0x3b)
	float BoundsScale; // 0x794(0x04)
	float *aa675c3c9f; // 0x798(0x04)
	float *8aba3be418; // 0x79c(0x04)
	float *69906a8560; // 0x7a0(0x04)
	enum class *ed39c8987e CanBeCharacterBase; // 0x7a4(0x01)
	char pad_7A5[0x1]; // 0x7a5(0x01)
	enum class *ed39c8987e CanCharacterStepUpOn; // 0x7a6(0x01)
	char pad_7A7[0x1]; // 0x7a7(0x01)
	struct TArray<struct AActor*> *5559023e99; // 0x7a8(0x10)
	struct TArray<struct UPrimitiveComponent*> *34f682ee35; // 0x7b8(0x10)
	char pad_7C8[0xb8]; // 0x7c8(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x880(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x890(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x8a0(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x8b0(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x8c0(0x10)
	char pad_8D0[0x10]; // 0x8d0(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x8e0(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x8f0(0x10)
	struct FMulticastDelegate OnClicked; // 0x900(0x10)
	struct FMulticastDelegate OnReleased; // 0x910(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x920(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x930(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x940(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x950(0x10)
	char pad_960[0x28]; // 0x960(0x28)
	struct UPrimitiveComponent* *afbfc200cf; // 0x988(0x08)
	struct UPrimitiveComponent* *c423c7f1c7; // 0x990(0x08)
	struct F*1d83c9bd93 *605bfc3d64; // 0x998(0x58)
	char pad_9F0[0x10]; // 0x9f0(0x10)

	struct FVector AddForceAtLocation(); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6383740
	void GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638ff78
	void *3f4951ae21(); // Function Engine.PrimitiveComponent.*3f4951ae21 // Native|Public|BlueprintCallable // @ game+0x63a1f20
	void *aa442ff688(); // Function Engine.PrimitiveComponent.*aa442ff688 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392e38
	enum class *d6dc0510f4 *2acabdc4bc(); // Function Engine.PrimitiveComponent.*2acabdc4bc // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63844e0
	void *dfb097147a(); // Function Engine.PrimitiveComponent.*dfb097147a // Native|Public|BlueprintCallable // @ game+0x5b4d80
	void *1d5b572e97(); // Function Engine.PrimitiveComponent.*1d5b572e97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63968d8
	struct AActor* *58360a298b(); // Function Engine.PrimitiveComponent.*58360a298b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63931d0
	struct UMaterialInterface* CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x6388de8
	void *155e776c01(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.*155e776c01 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d7fc
	enum class *d6dc0510f4 *776b623f1e(); // Function Engine.PrimitiveComponent.*776b623f1e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63846b4
	void *401e8be8c9(); // Function Engine.PrimitiveComponent.*401e8be8c9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6396908
	void *6c17800325(); // Function Engine.PrimitiveComponent.*6c17800325 // Native|Public|BlueprintCallable // @ game+0x63a0078
	void *1060cf1432(); // Function Engine.PrimitiveComponent.*1060cf1432 // Final|Native|Public|BlueprintCallable // @ game+0x63a08ac
	void *733d8ffdab(); // Function Engine.PrimitiveComponent.*733d8ffdab // Native|Public|BlueprintCallable // @ game+0x63a2bc4
	void *c09d067d0f(); // Function Engine.PrimitiveComponent.*c09d067d0f // Final|Native|Public|BlueprintCallable // @ game+0x63a3460
	void *dfc478eaef(); // Function Engine.PrimitiveComponent.*dfc478eaef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63924d0
	void *d70adb1efd(float MassInKg); // Function Engine.PrimitiveComponent.*d70adb1efd // Native|Public|BlueprintCallable // @ game+0x63a2190
	struct FVector K2_LineTraceComponent(struct FName BoneName); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639693c
	void *8f296e8ac0(); // Function Engine.PrimitiveComponent.*8f296e8ac0 // Final|Native|Public|BlueprintCallable // @ game+0x63a2a68
	void *3579dd87c5(); // Function Engine.PrimitiveComponent.*3579dd87c5 // Native|Public|BlueprintCallable // @ game+0x63929ac
	int32 *c513e9cfca(); // Function Engine.PrimitiveComponent.*c513e9cfca // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390108
	void CreateAndSetMaterialInstanceDynamic(bool bConcurrent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x6388cf8
	void SetMassScale(); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x568aeec
	int32 *c602cc5bf9(); // Function Engine.PrimitiveComponent.*c602cc5bf9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390064
	void *6f5a420568(); // Function Engine.PrimitiveComponent.*6f5a420568 // Final|Native|Public|BlueprintCallable // @ game+0x63a3588
	void *4179761c58(); // Function Engine.PrimitiveComponent.*4179761c58 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63852ec
	struct UMaterialInterface* SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0xb7f5ac
	struct FName GetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63912b0
	void CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x6388be8
	void *c4ebdc3c8f(struct AActor* Actor); // Function Engine.PrimitiveComponent.*c4ebdc3c8f // Final|Native|Public|BlueprintCallable // @ game+0x63925b4
	struct FName AddTorque(); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6384b74
	void *5b3c874cbe(struct FVector NewAngVel); // Function Engine.PrimitiveComponent.*5b3c874cbe // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639e494
	void *baff305a0b(); // Function Engine.PrimitiveComponent.*baff305a0b // Native|Public|BlueprintCallable // @ game+0x63a010c
	void *b24da2aba6(); // Function Engine.PrimitiveComponent.*b24da2aba6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63908c4
	void *6d15f9d7fc(); // Function Engine.PrimitiveComponent.*6d15f9d7fc // Final|Native|Public|BlueprintCallable // @ game+0x638593c
	struct UPrimitiveComponent* *bba26f131c(); // Function Engine.PrimitiveComponent.*bba26f131c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393270
	void SetPhysicsLinearVelocity(bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x92e96c
	bool SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x63a2c58
	void *10c86d98d5(); // Function Engine.PrimitiveComponent.*10c86d98d5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63909f8
	void SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x6382fb0
	void *fc3da87902(); // Function Engine.PrimitiveComponent.*fc3da87902 // Native|Public|BlueprintCallable // @ game+0x63a287c
	void *1e088aa233(); // Function Engine.PrimitiveComponent.*1e088aa233 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63a4a0c
	struct FName *9d203d4e3a(); // Function Engine.PrimitiveComponent.*9d203d4e3a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638efd0
	void *7ab8b110bc(); // Function Engine.PrimitiveComponent.*7ab8b110bc // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fe44
	void *cefd2a89e7(); // Function Engine.PrimitiveComponent.*cefd2a89e7 // Native|Public|BlueprintCallable // @ game+0x63a22bc
	void *4135b69ecb(); // Function Engine.PrimitiveComponent.*4135b69ecb // Final|Native|Public|BlueprintCallable // @ game+0x63a34f4
	struct FName AddAngularImpulse(); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6382d2c
	void *065d5e11f8(struct FName BoneName); // Function Engine.PrimitiveComponent.*065d5e11f8 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x638d2a8
	void *e06446eb04(); // Function Engine.PrimitiveComponent.*e06446eb04 // Final|Native|Public|BlueprintCallable // @ game+0x639aadc
	void *f6986ba874(); // Function Engine.PrimitiveComponent.*f6986ba874 // Final|Native|Public|BlueprintCallable // @ game+0x63a3f78
	bool *285b57600a(); // Function Engine.PrimitiveComponent.*285b57600a // Native|Public|BlueprintCallable // @ game+0x63a421c
	void *5cdc853a89(); // Function Engine.PrimitiveComponent.*5cdc853a89 // Final|Native|Public|BlueprintCallable // @ game+0x63a093c
	void SetCollisionObjectType(); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x639ffe0
	struct FVector AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6383de0
	void *b9e13958df(); // Function Engine.PrimitiveComponent.*b9e13958df // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d774
	void SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e58c
	void *29c20efb0b(); // Function Engine.PrimitiveComponent.*29c20efb0b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c644
	void *056cc90593(); // Function Engine.PrimitiveComponent.*056cc90593 // Final|Native|Public|BlueprintCallable // @ game+0x639fb44
	struct FVector SetPhysicsAngularVelocity(bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xb0d434
	void SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x639e724
	struct FName AddImpulse(); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6383ca0
	enum class ECollisionChannel *58f998cca1(); // Function Engine.PrimitiveComponent.*58f998cca1 // Native|Public|BlueprintCallable // @ game+0x63a01a4
	void *6ad19621d9(); // Function Engine.PrimitiveComponent.*6ad19621d9 // Final|Native|Public|BlueprintCallable // @ game+0x63a2914
	void *6721a3eb8a(); // Function Engine.PrimitiveComponent.*6721a3eb8a // Final|Native|Public|BlueprintCallable // @ game+0x6385958
	void *601c402444(); // Function Engine.PrimitiveComponent.*601c402444 // Native|Public|BlueprintCallable // @ game+0x63a5f64
	void GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390d98
	void AddForce(struct FVector force); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6383600
	void *1f028ad67d(); // Function Engine.PrimitiveComponent.*1f028ad67d // Final|Native|Public|BlueprintCallable // @ game+0x638d7c4
	struct FName *75116bc348(); // Function Engine.PrimitiveComponent.*75116bc348 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639b55c
	void *46193842e9(); // Function Engine.PrimitiveComponent.*46193842e9 // Final|Native|Public|BlueprintCallable // @ game+0x6388c70
	void *10f75e50ac(); // Function Engine.PrimitiveComponent.*10f75e50ac // Final|Native|Public|BlueprintCallable // @ game+0x639f8ec
	void *e3b0f43f9e(struct FVector Point); // Function Engine.PrimitiveComponent.*e3b0f43f9e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6391360
	struct FName *36ad2d15e7(); // Function Engine.PrimitiveComponent.*36ad2d15e7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638d618
	void *fec7ca08f4(struct FName BoneName); // Function Engine.PrimitiveComponent.*fec7ca08f4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638ffa4
	void *0e38375bb9(); // Function Engine.PrimitiveComponent.*0e38375bb9 // Final|Native|Public|BlueprintCallable // @ game+0x6392694
	void *23f39ad152(); // Function Engine.PrimitiveComponent.*23f39ad152 // Native|Public|BlueprintCallable // @ game+0x63a0bec
	struct FVector AddForceAtLocationLocal(struct FVector Location); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x638388c
	void CreateDynamicMaterialInstance(int32 ElementIndex); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x6388ed8
	void *923a62a1b9(); // Function Engine.PrimitiveComponent.*923a62a1b9 // Final|Native|Public|BlueprintCallable // @ game+0x63a0814
	struct FName GetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xb59468
	void *41428e55af(); // Function Engine.PrimitiveComponent.*41428e55af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63968ac
	void *9f5fbe7730(); // Function Engine.PrimitiveComponent.*9f5fbe7730 // Native|Public|BlueprintCallable // @ game+0x63a067c
	struct FVector SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639fc70
	void *95f3208c0a(); // Function Engine.PrimitiveComponent.*95f3208c0a // Native|Public|BlueprintCallable // @ game+0x639e68c
	void *926dc117b6(); // Function Engine.PrimitiveComponent.*926dc117b6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d79c
	void *d7c852a7d5(); // Function Engine.PrimitiveComponent.*d7c852a7d5 // Native|Public|BlueprintCallable // @ game+0x63994f8
	struct TArray<struct AActor*> GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390ba0
	void *b76664dec1(); // Function Engine.PrimitiveComponent.*b76664dec1 // Native|Public|BlueprintCallable // @ game+0x63a5f4c
	void *a306d03f54(); // Function Engine.PrimitiveComponent.*a306d03f54 // Native|Public|BlueprintCallable // @ game+0xb360a8
};

// Class Engine.MeshComponent
// Size: 0xb00 (Inherited: 0xa00)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x9f8(0x10)
	char pad_A10[0xf0]; // 0xa10(0xf0)

	void *dea9e46c09(); // Function Engine.MeshComponent.*dea9e46c09 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390254
	void *2f56f6caf5(); // Function Engine.MeshComponent.*2f56f6caf5 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a458c
	void *86f42457e0(); // Function Engine.MeshComponent.*86f42457e0 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392fe8
	float *e340f5fc1d(); // Function Engine.MeshComponent.*e340f5fc1d // Final|Native|Public|BlueprintCallable // @ game+0x8f52d0
	void *514a111da7(); // Function Engine.MeshComponent.*514a111da7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63902e0
	void *28b95d47eb(struct FName MaterialSlotName); // Function Engine.MeshComponent.*28b95d47eb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63901ac
};

// Class Engine.StaticMeshComponent
// Size: 0xba0 (Inherited: 0xb00)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xb00(0x04)
	int32 *66a6cd3343; // 0xb04(0x04)
	bool bOverrideMinLOD; // 0xb08(0x01)
	char pad_B09[0x3]; // 0xb09(0x03)
	int32 MinLOD; // 0xb0c(0x04)
	struct UStaticMesh* StaticMesh; // 0xb10(0x08)
	bool bOverrideWireframeColor; // 0xb18(0x01)
	char pad_B19[0x3]; // 0xb19(0x03)
	struct FColor WireframeColorOverride; // 0xb1c(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xb20(0x10)
	char *a28fc20375 : 1; // 0xb30(0x01)
	char *a6e890a6e8 : 1; // 0xb30(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xb30(0x01)
	char *72ad19ace5 : 1; // 0xb30(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xb30(0x01)
	char bOverrideLightMapRes : 1; // 0xb30(0x01)
	char pad_B30_6 : 2; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	int32 OverriddenLightMapRes; // 0xb34(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xb38(0x01)
	char pad_B38_1 : 7; // 0xb38(0x01)
	char pad_B39[0x3]; // 0xb39(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xb3c(0x04)
	float StreamingDistanceMultiplier; // 0xb40(0x04)
	int32 *0f0f75dabf; // 0xb44(0x04)
	char *9a59516d8b : 1; // 0xb48(0x01)
	char pad_B48_1 : 7; // 0xb48(0x01)
	char pad_B49[0x7]; // 0xb49(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xb50(0x10)
	struct TArray<struct F*e52484916f> *6f651a8a78; // 0xb60(0x10)
	struct TArray<struct F*2680edbad5> *65df47e5bb; // 0xb70(0x10)
	bool *5b1ebb8f11; // 0xb80(0x01)
	char pad_B81[0x3]; // 0xb81(0x03)
	struct F*553842a41b LightmassSettings; // 0xb84(0x18)
	char pad_B9C[0x4]; // 0xb9c(0x04)

	struct UStaticMesh* SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x5e48cd0
	struct FVector *34b9302e3c(); // Function Engine.StaticMeshComponent.*34b9302e3c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638fe70
	void OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x63997a4
	void *488bd86f9f(); // Function Engine.StaticMeshComponent.*488bd86f9f // Final|Native|Public|BlueprintCallable // @ game+0x63a0fac
};

// Class Engine.SkinnedMeshComponent
// Size: 0xca0 (Inherited: 0xb00)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xb00(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xb08(0x08)
	char pad_B10[0x60]; // 0xb10(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb70(0x01)
	char pad_B70_1 : 7; // 0xb70(0x01)
	char pad_B71[0x7]; // 0xb71(0x07)
	struct TArray<struct FBoxSphereBounds> *f30ef9aca0; // 0xb78(0x10)
	char pad_B88[0x20]; // 0xb88(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xba8(0x08)
	int32 ForcedLodModel; // 0xbb0(0x04)
	int32 MinLodModel; // 0xbb4(0x04)
	char pad_BB8[0x10]; // 0xbb8(0x10)
	struct TArray<struct F*cbe45bb4a6> LODInfo; // 0xbc8(0x10)
	float StreamingDistanceMultiplier; // 0xbd8(0x04)
	struct FColor WireframeColor; // 0xbdc(0x04)
	char *9e69394ecc : 1; // 0xbe0(0x01)
	char *9903a4c840 : 1; // 0xbe0(0x01)
	char bDisableMorphTarget : 1; // 0xbe0(0x01)
	char *355eef0bc4 : 1; // 0xbe0(0x01)
	char pad_BE0_4 : 4; // 0xbe0(0x01)
	char pad_BE1[0x17]; // 0xbe1(0x17)
	char bPerBoneMotionBlur : 1; // 0xbf8(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xbf8(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xbf8(0x01)
	char bSyncAttachParentLOD : 1; // 0xbf8(0x01)
	char pad_BF8_4 : 4; // 0xbf8(0x01)
	char pad_BF9[0x3]; // 0xbf9(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xbfc(0x01)
	char pad_BFD[0x3]; // 0xbfd(0x03)
	char *4589ff7cf8 : 1; // 0xc00(0x01)
	char *96a8417c7f : 1; // 0xc00(0x01)
	char *f4e5e3198a : 1; // 0xc00(0x01)
	char pad_C00_3 : 5; // 0xc00(0x01)
	char pad_C01[0x3]; // 0xc01(0x03)
	bool *0ca1f88bf0; // 0xc04(0x01)
	char pad_C05[0x3]; // 0xc05(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xc08(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xc08(0x01)
	char pad_C08_2 : 6; // 0xc08(0x01)
	char pad_C09[0x3]; // 0xc09(0x03)
	char bRenderStatic : 1; // 0xc0c(0x01)
	char pad_C0C_1 : 7; // 0xc0c(0x01)
	char pad_C0D[0x3]; // 0xc0d(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xc10(0x04)
	char *f4e58c294b : 1; // 0xc14(0x01)
	char pad_C14_1 : 7; // 0xc14(0x01)
	char pad_C15[0xf]; // 0xc15(0x0f)
	struct FBoxSphereBounds *cd78e2e3f1; // 0xc24(0x1c)
	bool *51163366b3; // 0xc40(0x01)
	bool bEnableUpdateRateOptimizations; // 0xc41(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xc42(0x01)
	char pad_C43[0x4e]; // 0xc43(0x4e)
	bool *6ee4d78242; // 0xc91(0x01)
	bool *7c960d48b8; // 0xc92(0x01)
	char pad_C93[0xd]; // 0xc93(0x0d)

	struct FName *6a5f21ad4e(); // Function Engine.SkinnedMeshComponent.*6a5f21ad4e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cc0d8
	void *3c865e7779(); // Function Engine.SkinnedMeshComponent.*3c865e7779 // Final|Native|Public|BlueprintCallable // @ game+0x63ff280
	void *fc7ead4db2(); // Function Engine.SkinnedMeshComponent.*fc7ead4db2 // Final|Native|Public|BlueprintCallable // @ game+0x63f0448
	bool *10d664b446(struct FVector BoneLocation); // Function Engine.SkinnedMeshComponent.*10d664b446 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63c076c
	void *71a2310595(); // Function Engine.SkinnedMeshComponent.*71a2310595 // Final|Native|Public|BlueprintCallable // @ game+0x63e9e18
	void *67471412a8(); // Function Engine.SkinnedMeshComponent.*67471412a8 // Final|Native|Public|BlueprintCallable // @ game+0x63e98b8
	void *e1f9ca9449(); // Function Engine.SkinnedMeshComponent.*e1f9ca9449 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c9a1c
	struct USkeletalMesh* SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x63f2860
	int32 *2400ce1346(); // Function Engine.SkinnedMeshComponent.*2400ce1346 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c3ea4
	void *a0035d9d4e(); // Function Engine.SkinnedMeshComponent.*a0035d9d4e // Final|Native|Public|BlueprintCallable // @ game+0x63d1cb0
	void GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c3be8
	void *0838ed640a(); // Function Engine.SkinnedMeshComponent.*0838ed640a // Final|Native|Public|BlueprintCallable // @ game+0x63f22b0
	struct FRotator *6c2f9d9de6(struct FVector OutPosition); // Function Engine.SkinnedMeshComponent.*6c2f9d9de6 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63fec74
	void *5ee5688cd0(struct FName ParentBoneName); // Function Engine.SkinnedMeshComponent.*5ee5688cd0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63b07d4
	void *b6a1e57216(); // Function Engine.SkinnedMeshComponent.*b6a1e57216 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c9698
	void *fd2b1bbf5b(); // Function Engine.SkinnedMeshComponent.*fd2b1bbf5b // Final|Native|Public|BlueprintCallable // @ game+0x63ed710
	void *c47c945cda(); // Function Engine.SkinnedMeshComponent.*c47c945cda // Final|Native|Public|BlueprintCallable // @ game+0x63f0318
	void *b41c79226e(int32 LODIndex); // Function Engine.SkinnedMeshComponent.*b41c79226e // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63f5b64
	struct FName *c8ca57db8d(); // Function Engine.SkinnedMeshComponent.*c8ca57db8d // Final|Native|Public|BlueprintCallable // @ game+0x63d07ec
	void SetSkinWeightOverride(int32 LODIndex); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63f29d4
	void *96c3ec4c09(); // Function Engine.SkinnedMeshComponent.*96c3ec4c09 // Final|Native|Public|BlueprintCallable // @ game+0x63b7d10
	struct UPhysicsAsset* *feffa71d19(); // Function Engine.SkinnedMeshComponent.*feffa71d19 // Native|Public|BlueprintCallable // @ game+0x63f1380
	void *ceffae9960(); // Function Engine.SkinnedMeshComponent.*ceffae9960 // Final|Native|Public|BlueprintCallable // @ game+0x63b79a8
	void *727d19e44f(struct FName BoneName, struct FRotator InRotation); // Function Engine.SkinnedMeshComponent.*727d19e44f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63ff048
	void *a7e2c33601(); // Function Engine.SkinnedMeshComponent.*a7e2c33601 // Final|Native|Public|BlueprintCallable // @ game+0x63e9d68
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1190 (Inherited: 0xca0)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xca0(0x08)
	struct UClass* AnimClass; // 0xca8(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xcb0(0x08)
	struct TArray<struct UAnimInstance*> *b1a0aa7521; // 0xcb8(0x10)
	struct UAnimInstance* *08eabd4801; // 0xcc8(0x08)
	struct F*030036a724 AnimationData; // 0xcd0(0x18)
	char pad_CE8[0x30]; // 0xce8(0x30)
	struct TArray<struct FTransform> *58c21de2e0; // 0xd18(0x10)
	struct TArray<struct FTransform> *545370af98; // 0xd28(0x10)
	char pad_D38[0x20]; // 0xd38(0x20)
	float GlobalAnimRateScale; // 0xd58(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd5c(0x01)
	enum class *ab2c643b8f PhysicsTransformUpdateMode; // 0xd5d(0x01)
	char pad_D5E[0x1]; // 0xd5e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd5f(0x01)
	char pad_D60[0x4]; // 0xd60(0x04)
	char pad_D64_0 : 1; // 0xd64(0x01)
	char *3383585ca2 : 1; // 0xd64(0x01)
	char pad_D64_2 : 1; // 0xd64(0x01)
	char *f16a7a3dd7 : 1; // 0xd64(0x01)
	char pad_D64_4 : 2; // 0xd64(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd64(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd64(0x01)
	char bDisableClothSimulation : 1; // 0xd65(0x01)
	char pad_D65_1 : 2; // 0xd65(0x01)
	char bCollideWithEnvironment : 1; // 0xd65(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd65(0x01)
	char bLocalSpaceSimulation : 1; // 0xd65(0x01)
	char *be67cfdb15 : 1; // 0xd65(0x01)
	char bResetAfterTeleport : 1; // 0xd65(0x01)
	char pad_D66_0 : 1; // 0xd66(0x01)
	char bNoSkeletonUpdate : 1; // 0xd66(0x01)
	char bPauseAnims : 1; // 0xd66(0x01)
	char *39749c2751 : 1; // 0xd66(0x01)
	char bEnablePerPolyCollision : 1; // 0xd66(0x01)
	char *2eab519db0 : 1; // 0xd66(0x01)
	char *e494fcf5fb : 1; // 0xd66(0x01)
	char *4035845260 : 1; // 0xd66(0x01)
	char *c6d7dbb4f5 : 1; // 0xd67(0x01)
	char *ac6a357b1a : 1; // 0xd67(0x01)
	char *36b974a93b : 1; // 0xd67(0x01)
	char *6821fc8c10 : 1; // 0xd67(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd67(0x01)
	char *602b32a36f : 1; // 0xd67(0x01)
	char pad_D67_6 : 2; // 0xd67(0x01)
	char *660210df46 : 1; // 0xd68(0x01)
	char pad_D68_1 : 7; // 0xd68(0x01)
	char pad_D69_0 : 2; // 0xd69(0x01)
	char bDefaultLooping : 1; // 0xd69(0x01)
	char bDefaultPlaying : 1; // 0xd69(0x01)
	char pad_D69_4 : 4; // 0xd69(0x01)
	uint16 *2fe5eefb66; // 0xd6a(0x02)
	float ClothBlendWeight; // 0xd6c(0x04)
	struct FVector *a41d195774; // 0xd70(0x0c)
	char pad_D7C[0x4]; // 0xd7c(0x04)
	struct UBodySetup* BodySetup; // 0xd80(0x08)
	float TeleportDistanceThreshold; // 0xd88(0x04)
	float TeleportRotationThreshold; // 0xd8c(0x04)
	struct FVector *b77df095c1; // 0xd90(0x0c)
	char pad_D9C[0x4]; // 0xd9c(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xda0(0x10)
	char pad_DB0[0xe0]; // 0xdb0(0xe0)
	struct UClass* *b14b3c8b7b; // 0xe90(0x08)
	char pad_E98[0x1e8]; // 0xe98(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1080(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1088(0x08)
	float DefaultPosition; // 0x1090(0x04)
	float DefaultPlayRate; // 0x1094(0x04)
	uint32 *5f8fe91e99; // 0x1098(0x04)
	float *3993dbc972; // 0x109c(0x04)
	char pad_10A0[0xf0]; // 0x10a0(0xf0)

	void *a9c661b6a0(); // Function Engine.SkeletalMeshComponent.*a9c661b6a0 // Final|Native|Public|BlueprintCallable // @ game+0x63ea438
	int32 *38a8d94d2a(); // Function Engine.SkeletalMeshComponent.*38a8d94d2a // Final|Native|Public|BlueprintCallable // @ game+0x63c0d74
	void *d6b31f7555(); // Function Engine.SkeletalMeshComponent.*d6b31f7555 // Final|Native|Public|BlueprintCallable // @ game+0x9a4fbc
	void *5f9211f1eb(); // Function Engine.SkeletalMeshComponent.*5f9211f1eb // Final|Native|Public|BlueprintCallable // @ game+0x63c212c
	void *78951d1396(); // Function Engine.SkeletalMeshComponent.*78951d1396 // Final|Native|Public|BlueprintCallable // @ game+0x63c44ec
	bool *a81e6d31fe(); // Function Engine.SkeletalMeshComponent.*a81e6d31fe // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63e6810
	void *1d127e5a31(); // Function Engine.SkeletalMeshComponent.*1d127e5a31 // Final|Native|Public|BlueprintCallable // @ game+0x63e69b4
	float *057fda6034(); // Function Engine.SkeletalMeshComponent.*057fda6034 // Final|Native|Public|BlueprintCallable // @ game+0x63f0714
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x9a5070
	void *01291de0e1(); // Function Engine.SkeletalMeshComponent.*01291de0e1 // Final|Native|Public|BlueprintCallable // @ game+0x63e517c
	void *07eb4aa7bc(); // Function Engine.SkeletalMeshComponent.*07eb4aa7bc // Final|Native|Public|BlueprintCallable // @ game+0x63b78f8
	void *2862b5ed5a(struct FName ProfileName); // Function Engine.SkeletalMeshComponent.*2862b5ed5a // Final|Native|Public|BlueprintCallable // @ game+0x63ea9c8
	void SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x9a5e18
	float *2b1529526f(); // Function Engine.SkeletalMeshComponent.*2b1529526f // Final|Native|Public|BlueprintCallable // @ game+0x63df518
	void *8c3e6ac131(bool bEnableTwistDrive); // Function Engine.SkeletalMeshComponent.*8c3e6ac131 // Final|Native|Public|BlueprintCallable // @ game+0x63e6bc8
	void *fdb6af384f(); // Function Engine.SkeletalMeshComponent.*fdb6af384f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c3490
	void GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c9c78
	void *78c795bb04(bool bEnableSwingDrive); // Function Engine.SkeletalMeshComponent.*78c795bb04 // Final|Native|Public|BlueprintCallable // @ game+0x63e6d0c
	void *d19cf19dad(bool bNewSimulate); // Function Engine.SkeletalMeshComponent.*d19cf19dad // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x909c18
	bool *bbd30f0694(); // Function Engine.SkeletalMeshComponent.*bbd30f0694 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c3db8
	void *8eccb076f1(bool bNewNotifyRigidBodyCollision); // Function Engine.SkeletalMeshComponent.*8eccb076f1 // Native|Public|BlueprintCallable // @ game+0x63e896c
	void *49a5d89dc7(); // Function Engine.SkeletalMeshComponent.*49a5d89dc7 // Final|Native|Public|BlueprintCallable // @ game+0x63d1c00
	void *a95306e281(); // Function Engine.SkeletalMeshComponent.*a95306e281 // Final|Native|Public|BlueprintCallable // @ game+0x63c2144
	void SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0xb0129c
	void SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x63e7bec
	void Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0xaf4f7c
	void *5b7b02a51f(); // Function Engine.SkeletalMeshComponent.*5b7b02a51f // Final|Native|Public|BlueprintCallable // @ game+0x63af520
	void *12330879fc(); // Function Engine.SkeletalMeshComponent.*12330879fc // Final|Native|Public|BlueprintCallable // @ game+0x63fdfbc
	bool *a1620df48e(); // Function Engine.SkeletalMeshComponent.*a1620df48e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63aa6fc
	void *20c9711831(struct FName InBoneName, float TwistLimitAngle); // Function Engine.SkeletalMeshComponent.*20c9711831 // Final|Native|Public|BlueprintCallable // @ game+0x63e718c
	void *7b5470eac3(); // Function Engine.SkeletalMeshComponent.*7b5470eac3 // Final|Native|Public|BlueprintCallable // @ game+0x63f1464
	void *eafb4489c9(); // Function Engine.SkeletalMeshComponent.*eafb4489c9 // Final|Native|Public|BlueprintCallable // @ game+0x63d1d7c
	void *3386d7f324(); // Function Engine.SkeletalMeshComponent.*3386d7f324 // Final|Native|Public|BlueprintCallable // @ game+0x63ec434
	void *370e1608b9(struct FVector HitLocation); // Function Engine.SkeletalMeshComponent.*370e1608b9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63b34b8
	void *b72e6b1694(); // Function Engine.SkeletalMeshComponent.*b72e6b1694 // Final|Native|Public|BlueprintCallable // @ game+0x63e4ea8
	void *b1a20c6186(); // Function Engine.SkeletalMeshComponent.*b1a20c6186 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c3478
	struct UAnimationAsset* PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x63e0058
	void *30ca989855(); // Function Engine.SkeletalMeshComponent.*30ca989855 // Final|Native|Public|BlueprintCallable // @ game+0x63ff310
	void IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d22e8
	struct FName *a1048a9859(); // Function Engine.SkeletalMeshComponent.*a1048a9859 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c959c
	void *23cd46227b(); // Function Engine.SkeletalMeshComponent.*23cd46227b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d06a4
	void *e8a9ba9091(); // Function Engine.SkeletalMeshComponent.*e8a9ba9091 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63f863c
	float *cc72975abc(struct FVector ClosestWorldPosition); // Function Engine.SkeletalMeshComponent.*cc72975abc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63d2de4
	float *4200524a62(float InForceLimit); // Function Engine.SkeletalMeshComponent.*4200524a62 // Final|Native|Public|BlueprintCallable // @ game+0x63e6a48
	void *a61324ada6(bool bEnableGravity); // Function Engine.SkeletalMeshComponent.*a61324ada6 // Final|Native|Public|BlueprintCallable // @ game+0x63ec084
	void *66eace9a8c(); // Function Engine.SkeletalMeshComponent.*66eace9a8c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63cc0a4
	struct FName *114aeda594(); // Function Engine.SkeletalMeshComponent.*114aeda594 // Final|Native|Public|BlueprintCallable // @ game+0x63ec170
	void *20b809a325(); // Function Engine.SkeletalMeshComponent.*20b809a325 // Final|Native|Public|BlueprintCallable // @ game+0x63e4e04
	void *a3c4621c5f(struct FVector Impulse, bool bVelChange); // Function Engine.SkeletalMeshComponent.*a3c4621c5f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63aa890
	float *4403e63617(); // Function Engine.SkeletalMeshComponent.*4403e63617 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63c4964
	void *5fb2b74dad(float AddPhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.*5fb2b74dad // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63a9f78
	void *04f817017d(); // Function Engine.SkeletalMeshComponent.*04f817017d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63ca774
	float *a5309d0c43(); // Function Engine.SkeletalMeshComponent.*a5309d0c43 // Final|Native|Public|BlueprintCallable // @ game+0xb6c254
	void *dcf02b5cb4(); // Function Engine.SkeletalMeshComponent.*dcf02b5cb4 // Final|Native|Public|BlueprintCallable // @ game+0x56131d0
	void GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63ca430
	void *f0efd7be35(struct FName JointName); // Function Engine.SkeletalMeshComponent.*f0efd7be35 // Final|Native|Public|BlueprintCallable // @ game+0x63ea898
	float SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x63f1a4c
	void *34f2079b29(bool bNewNotifyRigidBodyCollision); // Function Engine.SkeletalMeshComponent.*34f2079b29 // Native|Public|BlueprintCallable // @ game+0x63f0ba0
};

// Class Engine.Info
// Size: 0x3f0 (Inherited: 0x3f0)
struct AInfo : AActor {
	struct TArray<struct AActor*> Children; // 0x38(0x10)
	char pad_400_0 : 3; // 0x400(0x01)
	char *6a29209afc : 1; // 0x48(0x01)
	char *6583edce58 : 1; // 0x49(0x01)
	char bReplicates : 1; // 0x49(0x01)
	struct FName *332fd811ca; // 0x50(0x08)
	enum class ENetRole RemoteRole; // 0x58(0x01)
	struct AActor* Owner; // 0x60(0x08)
	struct FRepMovement ReplicatedMovement; // 0x68(0x34)
	struct F*e5bda3d960 *e3fb0d68ff; // 0xa0(0x40)
	int32 *2d89f8ef7f; // 0xe0(0x04)
	float NetPriority; // 0xe4(0x04)
	enum class EAutoReceiveInput *8606d93d96; // 0xe8(0x01)
	struct U*63b14265fa* *63b14265fa; // 0xf0(0x08)
	struct TArray<struct FName> Layers; // 0xf8(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x108(0x01)
	char bCanBeDamaged : 1; // 0x108(0x01)
	char *50cd51ed38 : 1; // 0x108(0x01)
	char *e002b42072 : 1; // 0x108(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x108(0x01)
	char *a4c704a3e5 : 1; // 0x108(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x108(0x01)
	char *13aea9b43a : 1; // 0x108(0x01)
	char *4211b886bf : 1; // 0x109(0x01)
	enum class ENetRole Role; // 0x10a(0x01)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x110(0x10)
	enum class *66c1dada81 InputConsumeOption; // 0x120(0x01)
	float NetUpdateFrequency; // 0x124(0x04)
	uint64 *f99b84bc94; // 0x128(0x08)
	char *97cac516e7 : 1; // 0x134(0x01)
	char *cd27b8552b : 1; // 0x134(0x01)
	char *8aabd64ff4 : 1; // 0x134(0x01)
	char *3cd32b903e : 1; // 0x134(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x135(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x136(0x01)
	struct FMulticastDelegate OnInputTouchLeave; // 0x140(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x150(0x10)
	float NetCullDistanceSquared; // 0x160(0x04)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x164(0x01)
	int32 *2bc7f7749a; // 0x168(0x04)
	struct UChildActorComponent* *129513d23d; // 0x16c(0x08)
	struct AActor* ParentComponentActor; // 0x174(0x08)
	struct FMulticastDelegate OnActorHit; // 0x180(0x10)
	struct FMulticastDelegate OnReleased; // 0x190(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x1a0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x1b0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x1c0(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x1d0(0x10)
	float CustomTimeDilation; // 0x1e0(0x04)
	float MinNetUpdateFrequency; // 0x1e4(0x04)
	float InitialLifeSpan; // 0x1e8(0x04)
	struct FMulticastDelegate OnBeginCursorOver; // 0x1f0(0x10)
	struct APawn* Instigator; // 0x210(0x08)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x218(0x10)
	struct TArray<struct AMatineeActor*> *6220728ad0; // 0x228(0x10)
	struct FMulticastDelegate OnTakePointDamage; // 0x238(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x260(0x10)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x270(0x10)
	char bHidden : 1; // 0x280(0x01)
	char *0854a90e26 : 1; // 0x280(0x01)
	char *013332e5c6 : 1; // 0x280(0x01)
	char bOnlyRelevantToOwner : 1; // 0x280(0x01)
	char bAlwaysRelevant : 1; // 0x280(0x01)
	char *9ddfc785f1 : 1; // 0x280(0x01)
	char *05594c4443 : 1; // 0x280(0x01)
	char *ef19f6b6c9 : 1; // 0x280(0x01)
	char *dca9d9a72a : 1; // 0x281(0x01)
	char *16d69885c9 : 1; // 0x281(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x281(0x01)
	char *59968c9633 : 1; // 0x281(0x01)
	char *02848ec998 : 1; // 0x281(0x01)
	struct FGuid DestructibleId; // 0x284(0x10)
	bool bIsDestroyedVersion; // 0x294(0x01)
	bool RemoveFromLevelLOD; // 0x295(0x01)
	struct F*2066290a18 PrimaryActorTick; // 0x298(0x58)
	struct FMulticastDelegate OnClicked; // 0x340(0x10)
	struct FMulticastDelegate OnDestroyed; // 0x3a0(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3b0(0x10)
	struct USceneComponent* RootComponent; // 0x3c8(0x08)
	struct TArray<struct FName> Tags; // 0x3d0(0x10)
	float *ae3e81fc86; // 0x3e0(0x04)

	void SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x639e2d0
	void *43eab6a44c(struct FName InputAxisName); // Function Engine.Actor.*43eab6a44c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f500
	void *2f371b4576(); // Function Engine.Actor.*2f371b4576 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x63a36d8
	void *e14d0605bc(); // Function Engine.Actor.*e14d0605bc // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638be14
	void *a487955527(); // Function Engine.Actor.*a487955527 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6396164
	void *724cefc729(); // Function Engine.Actor.*724cefc729 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63922cc
	struct FVector ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void *17f595f9ac(); // Function Engine.Actor.*17f595f9ac // Final|Native|Public|BlueprintCallable // @ game+0x6391e84
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xbcddd0
	void *c1c64c0f03(); // Function Engine.Actor.*c1c64c0f03 // Native|Public|BlueprintCallable // @ game+0xc20868
	void *7952614099(); // Function Engine.Actor.*7952614099 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c02c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xb6f010
	void ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6382c8c
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x639df2c
	void *3dcb8c828c(); // Function Engine.Actor.*3dcb8c828c // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x638b78c
	void *ccaa7ce1d0(); // Function Engine.Actor.*ccaa7ce1d0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c014
	void K2_AttachRootComponentToActor(struct FName InSocketName); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x639534c
	struct FRotator *679babdbe9(); // Function Engine.Actor.*679babdbe9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6398b2c
	struct AActor* *58360a298b(); // Function Engine.Actor.*58360a298b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393130
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390a70
	float MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63991e0
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xa169f4
	void K2_AddActorLocalTransform(struct FTransform NewTransform, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393a74
	void AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6384924
	void *fd605f1fa8(); // Function Engine.Actor.*fd605f1fa8 // Final|Native|Public|BlueprintCallable // @ game+0x639de94
	void *eda0f1fdef(); // Function Engine.Actor.*eda0f1fdef // Final|Native|Public|BlueprintCallable // @ game+0x63a3cc0
	void *6237fb723e(); // Function Engine.Actor.*6237fb723e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63967a8
	void *8e0bd09921(); // Function Engine.Actor.*8e0bd09921 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x638e3dc
	void DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x63896c8
	struct FName *7915dcfee8(); // Function Engine.Actor.*7915dcfee8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638da8c
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63936c4
	enum class *42e1cdcd79 *694ac52e11(enum class *42e1cdcd79 RotationRule); // Function Engine.Actor.*694ac52e11 // Final|Native|Public|BlueprintCallable // @ game+0x6395df4
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63974e8
	struct FHitResult K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639389c
	void K2_SetActorRotation(bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x703458
	void *927c0af560(); // Function Engine.Actor.*927c0af560 // Native|Public|BlueprintCallable // @ game+0x638b204
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6395c8c
	struct AActor* *bf3d34531f(); // Function Engine.Actor.*bf3d34531f // Final|Native|Public|BlueprintCallable // @ game+0x63a4e10
	void K2_AddActorWorldTransform(bool bSweep); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394050
	struct AActor* *2a43ddf3b4(); // Function Engine.Actor.*2a43ddf3b4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e234
	struct FHitResult ReceiveRadialDamage(struct AController* InstigatedBy); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x1e037c
	enum class EAttachmentRule *ca2fce53c9(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*ca2fce53c9 // Final|Native|Public|BlueprintCallable // @ game+0x639564c
	void *2f98c34a3e(); // Function Engine.Actor.*2f98c34a3e // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638c6d8
	struct AActor* *8ab522db39(); // Function Engine.Actor.*8ab522db39 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e194
	void *2cfa65e375(); // Function Engine.Actor.*2cfa65e375 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638bb48
	void *7af955f165(); // Function Engine.Actor.*7af955f165 // Native|Public|BlueprintCallable // @ game+0x639af28
	void *77574d4d00(float Tolerance); // Function Engine.Actor.*77574d4d00 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63a61e0
	struct UClass* *3d2b57891f(); // Function Engine.Actor.*3d2b57891f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d8a4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb722bc
	void *6d495b918e(); // Function Engine.Actor.*6d495b918e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e230
	void K2_SetActorLocation(bool bSweep, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6396ef4
	void GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xad04f0
	void ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x1e037c
	void SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x55d7234
	void ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FHitResult K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63976c0
	void *96888c26b2(); // Function Engine.Actor.*96888c26b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c694
	void *298b7db98d(); // Function Engine.Actor.*298b7db98d // Final|Native|Public|BlueprintCallable // @ game+0x6395ca4
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xb9cfd4
	void *b0466cb89a(); // Function Engine.Actor.*b0466cb89a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638be48
	void *4e14239fe2(struct FVector OutLocation); // Function Engine.Actor.*4e14239fe2 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bb70
	void *76b33f89d4(struct AActor* OtherActor); // Function Engine.Actor.*76b33f89d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391bb8
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FKey *a84ae826d7(); // Function Engine.Actor.*a84ae826d7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f40c
	void *1f7d6b60c4(); // Function Engine.Actor.*1f7d6b60c4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c054
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x1e037c
	void K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63970d8
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x1e037c
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x638975c
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *553025a5b6(); // Function Engine.Actor.*553025a5b6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fdec
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *3fb2f52d1d(); // Function Engine.Actor.*3fb2f52d1d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638ee30
	void *5c10316bc8(); // Function Engine.Actor.*5c10316bc8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392a18
	void *12680bdeab(); // Function Engine.Actor.*12680bdeab // Native|Public|BlueprintCallable // @ game+0x63a5b00
	void *094169766b(); // Function Engine.Actor.*094169766b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fd3c
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *a80dd65dbf(); // Function Engine.Actor.*a80dd65dbf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392980
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FHitResult K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6397310
	void *7664b363a1(); // Function Engine.Actor.*7664b363a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390e60
	struct TArray<struct AActor*> *f77af040ad(); // Function Engine.Actor.*f77af040ad // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638c474
	void K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x638b7a0
	void *28809cb5e5(); // Function Engine.Actor.*28809cb5e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bfe0
	void *d21a3baa7f(); // Function Engine.Actor.*d21a3baa7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390f6c
	struct FName K2_AttachRootComponentTo(enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x63951cc
	void *3a00f3bb48(); // Function Engine.Actor.*3a00f3bb48 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63916f8
	void *f2d13d9497(); // Function Engine.Actor.*f2d13d9497 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c670
	struct UObject* AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6e6d18
	void *6f6713dfba(struct AActor* OtherActor); // Function Engine.Actor.*6f6713dfba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638eed0
	struct UMaterialInterface* *ea2a94b7da(); // Function Engine.Actor.*ea2a94b7da // Final|Native|Public|BlueprintCallable // @ game+0x6399164
	struct UClass* *2bbda76e95(); // Function Engine.Actor.*2bbda76e95 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d99c
	struct AActor* ReceivePointDamage(struct U*498af98d1d* DamageType, struct FVector HitNormal); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x1e037c
	void GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390cd0
	void *3b635a9905(); // Function Engine.Actor.*3b635a9905 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e190
	enum class EAttachmentRule *e13072354b(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*e13072354b // Final|Native|Public|BlueprintCallable // @ game+0x1fe714
	void *4aadbb23a5(); // Function Engine.Actor.*4aadbb23a5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390f90
	struct AActor* *82b3653b7b(); // Function Engine.Actor.*82b3653b7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392304
	bool K2_AddActorWorldRotation(struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393e78
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639629c
	struct FVector GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638b9a0
	void *d30428cd54(); // Function Engine.Actor.*d30428cd54 // Final|Native|Public|BlueprintCallable // @ game+0x63a3ba8
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x236e50
	void *7fc2785714(); // Function Engine.Actor.*7fc2785714 // Native|Public|BlueprintCallable // @ game+0x639ae00
	void *8df9beeffc(); // Function Engine.Actor.*8df9beeffc // Native|Public|BlueprintCallable // @ game+0x63a3640
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool K2_AddActorWorldOffset(struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393ca0
	void *2ad230fb6c(); // Function Engine.Actor.*2ad230fb6c // Final|Native|Public|BlueprintCallable // @ game+0x639e364
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x3fabf8
	bool K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63978ec
	void *b01fc0cf78(); // Function Engine.Actor.*b01fc0cf78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bc7c
	void *9ffc398f85(); // Function Engine.Actor.*9ffc398f85 // Native|Public|BlueprintCallable // @ game+0x6384a4c
	void *9fc33c71b8(); // Function Engine.Actor.*9fc33c71b8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392964
	struct AController* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1e037c
	void *34c6511ade(); // Function Engine.Actor.*34c6511ade // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fd24
	void ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FKey *8ff8fb0472(); // Function Engine.Actor.*8ff8fb0472 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638fb1c
};

// Class Engine.GameModeBase
// Size: 0x490 (Inherited: 0x3f0)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x3f0(0x10)
	struct UClass* GameSessionClass; // 0x400(0x08)
	struct UClass* GameStateClass; // 0x408(0x08)
	struct UClass* PlayerControllerClass; // 0x410(0x08)
	struct UClass* PlayerStateClass; // 0x418(0x08)
	struct FStringClassReference HUDClass; // 0x420(0x10)
	struct UClass* DefaultPawnClass; // 0x430(0x08)
	struct FStringClassReference SpectatorClass; // 0x438(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x448(0x08)
	struct AGameSession* GameSession; // 0x450(0x08)
	struct AGameStateBase* GameState; // 0x458(0x08)
	struct FText *02f2c38855; // 0x460(0x18)
	char bUseSeamlessTravel : 1; // 0x478(0x01)
	char bStartPlayersAsSpectators : 1; // 0x478(0x01)
	char bPauseable : 1; // 0x478(0x01)
	char pad_478_3 : 5; // 0x478(0x01)
	char pad_479[0x17]; // 0x479(0x17)

	void HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0x87d02c
	void InitStartSpot(); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xcc3648
	void K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct AController* SpawnDefaultPawnFor(struct AActor* StartSpot); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xbd5db4
	void *df82bef3d0(); // Function Engine.GameModeBase.*df82bef3d0 // Native|Public|BlueprintCallable // @ game+0x5f1718
	void PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0x87cf6c
	struct FString FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xb891e4
	void *49c7068d30(struct FString NewName); // Function Engine.GameModeBase.*49c7068d30 // Native|Public|BlueprintCallable // @ game+0x63857b4
	void GetDefaultPawnClassForController(struct AController* InController); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xbf30e4
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x56b1284
	void K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x1e037c
	void SpawnDefaultPawnAtTransform(struct FTransform SpawnTransform); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xc1fadc
	void *a2a2e5aa70(); // Function Engine.GameModeBase.*a2a2e5aa70 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5649218
	struct APlayerController* K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x1e037c
	void *d170795d09(); // Function Engine.GameModeBase.*d170795d09 // Native|Public|BlueprintCallable // @ game+0x63909d0
	void *5e6c791ad6(struct AController* Player); // Function Engine.GameModeBase.*5e6c791ad6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x6396048
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xb19170
	struct APlayerController* MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xbc4a5c
	struct AController* RestartPlayerAtPlayerStart(); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x639b1f4
	void *18dad4e118(); // Function Engine.GameModeBase.*18dad4e118 // Native|Public|BlueprintCallable // @ game+0x63908ec
	void ChoosePlayerStart(struct AController* Player); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xbd46e4
	struct AActor* ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x639ac78
	struct AController* RestartPlayerAtTransform(); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639b2d4
	void K2_OnChangeName(struct AController* Other); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x1e037c
	void K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x1e037c
	void RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x639b160
	void CanSpectate(struct APlayerController* Viewer); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x63853e0
	void InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xccfda8
};

// Class Engine.GameMode
// Size: 0x4d0 (Inherited: 0x490)
struct AGameMode : AGameModeBase {
	struct FName *cad7def02a; // 0x490(0x08)
	char bDelayedStart : 1; // 0x498(0x01)
	char pad_498_1 : 7; // 0x498(0x01)
	char pad_499[0x3]; // 0x499(0x03)
	int32 NumSpectators; // 0x49c(0x04)
	int32 NumPlayers; // 0x4a0(0x04)
	int32 NumBots; // 0x4a4(0x04)
	float MinRespawnDelay; // 0x4a8(0x04)
	int32 NumTravellingPlayers; // 0x4ac(0x04)
	struct UClass* *aff3dca9f7; // 0x4b0(0x08)
	struct TArray<struct APlayerState*> *27501ccd21; // 0x4b8(0x10)
	float *67a73490ca; // 0x4c8(0x04)
	bool bHandleDedicatedServerReplays; // 0x4cc(0x01)
	char pad_4CD[0x3]; // 0x4cd(0x03)

	void *d8ff867182(); // Function Engine.GameMode.*d8ff867182 // Native|Public|BlueprintCallable // @ game+0x564bfd4
	void *a5ef978767(); // Function Engine.GameMode.*a5ef978767 // Native|Public|BlueprintCallable // @ game+0x564bb98
	void *e72bb40788(); // Function Engine.GameMode.*e72bb40788 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392fc0
	void *93681d758c(); // Function Engine.GameMode.*93681d758c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392538
	void *82e263a9c2(); // Function Engine.GameMode.*82e263a9c2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x639004c
	void ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xc2aa84
	void SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x639ef14
	void ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0x973bb8
	void *7fb112d056(); // Function Engine.GameMode.*7fb112d056 // Native|Public|BlueprintCallable // @ game+0x5648294
	void Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x639b498
	void K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x1e037c
	void *713722b23e(); // Function Engine.GameMode.*713722b23e // Native|Public|BlueprintCallable // @ game+0x639b094
};

// Class Engine.*c5e4cb7a4d
// Size: 0x30 (Inherited: 0x28)
struct U*c5e4cb7a4d : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Engine.*ed75cbc976
// Size: 0x30 (Inherited: 0x30)
struct U*ed75cbc976 : U*c5e4cb7a4d {
};

// Class Engine.*401688bf57
// Size: 0x28 (Inherited: 0x28)
struct U*401688bf57 : UObject {
};

// Class Engine.*498af98d1d
// Size: 0x40 (Inherited: 0x28)
struct U*498af98d1d : UObject {
	char bCausedByWorld : 1; // 0x28(0x01)
	char bScaleMomentumByMass : 1; // 0x28(0x01)
	char bRadialDamageVelChange : 1; // 0x28(0x01)
	char pad_28_3 : 5; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float DamageImpulse; // 0x2c(0x04)
	float DestructibleImpulse; // 0x30(0x04)
	float DestructibleDamageSpreadScale; // 0x34(0x04)
	float DamageFalloff; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.MovementComponent
// Size: 0x240 (Inherited: 0x1f0)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x1f0(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x1f8(0x08)
	char pad_200[0x4]; // 0x200(0x04)
	struct FVector Velocity; // 0x204(0x0c)
	char bConstrainToPlane : 1; // 0x210(0x01)
	char bSnapToPlaneAtStart : 1; // 0x210(0x01)
	char pad_210_2 : 6; // 0x210(0x01)
	char pad_211[0x3]; // 0x211(0x03)
	enum class EPlaneConstraintAxisSetting *5ff5e09fff; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	struct FVector PlaneConstraintNormal; // 0x218(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x224(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x230(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x230(0x01)
	char bTickBeforeOwner : 1; // 0x230(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x230(0x01)
	char pad_230_4 : 4; // 0x230(0x01)
	char pad_231[0xf]; // 0x231(0x0f)

	void *b6c8efbdb0(); // Function Engine.MovementComponent.*b6c8efbdb0 // Native|Public|BlueprintCallable // @ game+0x63a4188
	struct FVector ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6388948
	void *bfb832781f(); // Function Engine.MovementComponent.*bfb832781f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63903f0
	void *c31d3003ec(); // Function Engine.MovementComponent.*c31d3003ec // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e404
	bool *c4f8250805(struct FVector Delta); // Function Engine.MovementComponent.*c4f8250805 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6396ca8
	struct FVector *ff3b5ade2b(); // Function Engine.MovementComponent.*ff3b5ade2b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a2eb8
	void *d1555190f1(); // Function Engine.MovementComponent.*d1555190f1 // Native|Public|BlueprintCallable // @ game+0x63a2d8c
	void *fab8102e5d(); // Function Engine.MovementComponent.*fab8102e5d // Native|Public|BlueprintCallable // @ game+0x63a2e20
	void *94b67ee95b(); // Function Engine.MovementComponent.*94b67ee95b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63914fc
	void *c0ba54ba1b(); // Function Engine.MovementComponent.*c0ba54ba1b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63914d4
	void *01f7b059b5(struct FVector Normal); // Function Engine.MovementComponent.*01f7b059b5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6388a10
	void K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63965e8
	void *5950858757(); // Function Engine.MovementComponent.*5950858757 // Native|Public|BlueprintCallable // @ game+0x63a4fdc
	void *6f297235ba(); // Function Engine.MovementComponent.*6f297235ba // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391470
	void *318cdd375a(struct FVector Direction); // Function Engine.MovementComponent.*318cdd375a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6388880
	void *5acff43dcb(); // Function Engine.MovementComponent.*5acff43dcb // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a3068
	void PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0xb94bc0
	void K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6396590
	void *1283f915c9(); // Function Engine.MovementComponent.*1283f915c9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a2fc4
	void *f4e98dfee9(); // Function Engine.MovementComponent.*f4e98dfee9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63914bc
	float *b8cd8cd7b7(); // Function Engine.MovementComponent.*b8cd8cd7b7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392d3c
	void *9ed3de3e6c(); // Function Engine.MovementComponent.*9ed3de3e6c // Native|Public|BlueprintCallable // @ game+0x63a592c
};

// Class Engine.NavMovementComponent
// Size: 0x270 (Inherited: 0x240)
struct UNavMovementComponent : UMovementComponent {
	struct F*112b6d08d9 NavAgentProps; // 0x238(0x20)
	float *77ddb5b058; // 0x258(0x04)
	char *89266b4845 : 1; // 0x25c(0x01)
	char bUseAccelerationForPaths : 1; // 0x25c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x25c(0x01)
	struct F*37b25a6e05 *aee1222c17; // 0x260(0x04)
	char pad_268_3 : 5; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)

	void *732c78efb2(); // Function Engine.NavMovementComponent.*732c78efb2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392ce4
	void *5edeeddff6(); // Function Engine.NavMovementComponent.*5edeeddff6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392e10
	void *8e52db34a0(); // Function Engine.NavMovementComponent.*8e52db34a0 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393108
	void *1361befc6e(); // Function Engine.NavMovementComponent.*1361befc6e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393584
	void IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392de8
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x63a52f8
	void *bf14594621(); // Function Engine.NavMovementComponent.*bf14594621 // Final|Native|Public|BlueprintCallable // @ game+0x63a5944
};

// Class Engine.PawnMovementComponent
// Size: 0x280 (Inherited: 0x270)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *dac5b5e3f6; // 0x270(0x08)
	char pad_278[0x8]; // 0x278(0x08)

	void *b4adeff535(); // Function Engine.PawnMovementComponent.*b4adeff535 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638fd64
	void K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639655c
	void *ceaebf3734(); // Function Engine.PawnMovementComponent.*ceaebf3734 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63930e0
	void *449559473e(); // Function Engine.PawnMovementComponent.*449559473e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63911f4
	void *d72920eaf6(); // Function Engine.PawnMovementComponent.*d72920eaf6 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6388ad8
	void *9abbf4048c(); // Function Engine.PawnMovementComponent.*9abbf4048c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6383f2c
	void *f8c3127bfa(); // Function Engine.PawnMovementComponent.*f8c3127bfa // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639120c
};

// Class Engine.CharacterMovementComponent
// Size: 0x920 (Inherited: 0x280)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_280[0x8]; // 0x280(0x08)
	struct ACharacter* *9715095276; // 0x288(0x08)
	char bApplyGravityWhileJumping : 1; // 0x290(0x01)
	char pad_290_1 : 7; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	float GravityScale; // 0x294(0x04)
	float MaxStepHeight; // 0x298(0x04)
	float JumpZVelocity; // 0x29c(0x04)
	float JumpOffJumpZFactor; // 0x2a0(0x04)
	float *6e4a728753; // 0x2a4(0x04)
	float *5d81580070; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	float *14261b064c; // 0x2b0(0x04)
	float *3b0102ed15; // 0x2b4(0x04)
	char pad_2B8[0x8]; // 0x2b8(0x08)
	enum class EMovementMode MovementMode; // 0x2c0(0x01)
	bool CustomMovementMode; // 0x2c1(0x01)
	char pad_2C2[0x1e]; // 0x2c2(0x1e)
	float GroundFriction; // 0x2e0(0x04)
	float MaxWalkSpeed; // 0x2e4(0x04)
	float MaxWalkSpeedCrouched; // 0x2e8(0x04)
	float MaxSwimSpeed; // 0x2ec(0x04)
	float MaxFlySpeed; // 0x2f0(0x04)
	float MaxCustomMovementSpeed; // 0x2f4(0x04)
	float MaxAcceleration; // 0x2f8(0x04)
	float BrakingFrictionFactor; // 0x2fc(0x04)
	float BrakingFriction; // 0x300(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x304(0x01)
	char pad_304_1 : 7; // 0x304(0x01)
	char pad_305[0x3]; // 0x305(0x03)
	float BrakingDecelerationWalking; // 0x308(0x04)
	float BrakingDecelerationFalling; // 0x30c(0x04)
	float BrakingDecelerationSwimming; // 0x310(0x04)
	float BrakingDecelerationFlying; // 0x314(0x04)
	float AirControl; // 0x318(0x04)
	float AirControlBoostMultiplier; // 0x31c(0x04)
	float AirControlBoostVelocityThreshold; // 0x320(0x04)
	float FallingLateralFriction; // 0x324(0x04)
	float CrouchedHalfHeight; // 0x328(0x04)
	float PronedHalfHeight; // 0x32c(0x04)
	float PronedRadius; // 0x330(0x04)
	float Buoyancy; // 0x334(0x04)
	float PerchRadiusThreshold; // 0x338(0x04)
	float PerchAdditionalHeight; // 0x33c(0x04)
	struct FRotator RotationRate; // 0x340(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x34c(0x01)
	char bOrientRotationToMovement : 1; // 0x34c(0x01)
	char bSweepWhileNavWalking : 1; // 0x34c(0x01)
	char pad_34C_3 : 2; // 0x34c(0x01)
	char *6b80ed3b3f : 1; // 0x34c(0x01)
	char *a5883f41aa : 1; // 0x34c(0x01)
	char bForceMaxAccel : 1; // 0x34c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x34d(0x01)
	char bForceNextFloorCheck : 1; // 0x34d(0x01)
	char *6913829b5c : 1; // 0x34d(0x01)
	char bCanWalkOffLedges : 1; // 0x34d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x34d(0x01)
	char pad_34D_5 : 2; // 0x34d(0x01)
	char *2acc0ba126 : 1; // 0x34d(0x01)
	char *bfdbad290e : 1; // 0x34e(0x01)
	char pad_34E_1 : 7; // 0x34e(0x01)
	char pad_34F[0x1]; // 0x34f(0x01)
	struct USceneComponent* *24362ccfd4; // 0x350(0x08)
	float MaxOutOfWaterStepHeight; // 0x358(0x04)
	float OutofWaterZ; // 0x35c(0x04)
	float Mass; // 0x360(0x04)
	bool bEnablePhysicsInteraction; // 0x364(0x01)
	bool bTouchForceScaledToMass; // 0x365(0x01)
	bool bPushForceScaledToMass; // 0x366(0x01)
	bool bPushForceUsingZOffset; // 0x367(0x01)
	bool bScalePushForceToVelocity; // 0x368(0x01)
	char pad_369[0x3]; // 0x369(0x03)
	float StandingDownwardForceScale; // 0x36c(0x04)
	float InitialPushForceFactor; // 0x370(0x04)
	float PushForceFactor; // 0x374(0x04)
	float PushForcePointZOffsetFactor; // 0x378(0x04)
	float TouchForceFactor; // 0x37c(0x04)
	float MinTouchForce; // 0x380(0x04)
	float MaxTouchForce; // 0x384(0x04)
	float RepulsionForce; // 0x388(0x04)
	char bForceBraking : 1; // 0x38c(0x01)
	char pad_38C_1 : 7; // 0x38c(0x01)
	char pad_38D[0x3]; // 0x38d(0x03)
	float CrouchedSpeedMultiplier; // 0x390(0x04)
	float UpperImpactNormalScale; // 0x394(0x04)
	struct FVector Acceleration; // 0x398(0x0c)
	struct FVector *8b5e33641b; // 0x3a4(0x0c)
	struct FQuat *1a53230ea5; // 0x3b0(0x10)
	struct FVector *d6e0b7821e; // 0x3c0(0x0c)
	float *706c733206; // 0x3cc(0x04)
	float *798fbf4376; // 0x3d0(0x04)
	float *2140231fbc; // 0x3d4(0x04)
	struct FVector *3b23e36cb0; // 0x3d8(0x0c)
	struct FVector *ff6cbe42b6; // 0x3e4(0x0c)
	float *d094d992c4; // 0x3f0(0x04)
	char pad_3F4[0x8]; // 0x3f4(0x08)
	float MaxSimulationTimeStep; // 0x3fc(0x04)
	int32 MaxSimulationIterations; // 0x400(0x04)
	float MaxDepenetrationWithGeometry; // 0x404(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x408(0x04)
	float MaxDepenetrationWithPawn; // 0x40c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x410(0x04)
	float *d96e75a69b; // 0x414(0x04)
	float *328143b81d; // 0x418(0x04)
	float *353663b1d9; // 0x41c(0x04)
	float *4490412dcb; // 0x420(0x04)
	float *4a53713c71; // 0x424(0x04)
	float *dbf6f973a9; // 0x428(0x04)
	float *95402cbdcf; // 0x42c(0x04)
	float *217c092b35; // 0x430(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	float *d489da6ed0; // 0x438(0x04)
	float *c12b5bd00f; // 0x43c(0x04)
	float *b066376fab; // 0x440(0x04)
	float *b24861907a; // 0x444(0x04)
	float LedgeCheckThreshold; // 0x448(0x04)
	float JumpOutOfWaterPitch; // 0x44c(0x04)
	struct F*771b3804ba CurrentFloor; // 0x450(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4e8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4e9(0x01)
	enum class EMovementMode *138fe62722; // 0x4ea(0x01)
	char pad_4EB[0x1]; // 0x4eb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityX : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityY : 1; // 0x4ec(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4ec(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4ec(0x01)
	char bJustTeleported : 1; // 0x4ec(0x01)
	char *53d48d06f9 : 1; // 0x4ec(0x01)
	char *971521425c : 1; // 0x4ec(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4ed(0x01)
	char bNotifyApex : 1; // 0x4ed(0x01)
	char *be016c8dd7 : 1; // 0x4ed(0x01)
	char bWantsToCrouch : 1; // 0x4ed(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4ed(0x01)
	char pad_4ED_5 : 3; // 0x4ed(0x01)
	char pad_4EE[0x2]; // 0x4ee(0x02)
	enum class EStanceMode StanceMode; // 0x4f0(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x4f1(0x01)
	char pad_4F2[0x2]; // 0x4f2(0x02)
	char bIgnoreBaseRotation : 1; // 0x4f4(0x01)
	char *ba3af84fa8 : 1; // 0x4f4(0x01)
	char bAlwaysCheckFloor : 1; // 0x4f4(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x4f4(0x01)
	char *9f41cc585f : 1; // 0x4f4(0x01)
	char *c4ad66876b : 1; // 0x4f4(0x01)
	char bUseRVOAvoidance : 1; // 0x4f4(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x4f4(0x01)
	char pad_4F5[0xf]; // 0x4f5(0x0f)
	char *3d670ca35e : 1; // 0x504(0x01)
	char *c226f59fd2 : 1; // 0x504(0x01)
	char *0dbc1fe19f : 1; // 0x504(0x01)
	char pad_504_3 : 2; // 0x504(0x01)
	char bProjectNavMeshWalking : 1; // 0x504(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x504(0x01)
	char pad_504_7 : 1; // 0x504(0x01)
	char pad_505[0x13]; // 0x505(0x13)
	float AvoidanceConsiderationRadius; // 0x518(0x04)
	struct FVector *512e308fe4; // 0x51c(0x0c)
	int32 AvoidanceUID; // 0x528(0x04)
	struct F*4c8082789d AvoidanceGroup; // 0x52c(0x04)
	struct F*4c8082789d GroupsToAvoid; // 0x530(0x04)
	struct F*4c8082789d GroupsToIgnore; // 0x534(0x04)
	float AvoidanceWeight; // 0x538(0x04)
	struct FVector *2aeb3bd7b1; // 0x53c(0x0c)
	char pad_548[0xa8]; // 0x548(0xa8)
	float NavMeshProjectionInterval; // 0x5f0(0x04)
	float *c4f2aeded7; // 0x5f4(0x04)
	float NavMeshProjectionInterpSpeed; // 0x5f8(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x5fc(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x600(0x04)
	float NavWalkingFloorDistTolerance; // 0x604(0x04)
	char pad_608[0xb0]; // 0x608(0xb0)
	struct F*d33504fa9e *89cb9e5c44; // 0x6b8(0x58)
	char pad_710[0x10]; // 0x710(0x10)
	float *0330c4ec91; // 0x720(0x04)
	char pad_724[0x4]; // 0x724(0x04)
	struct FRootMotionSourceGroup *0bec0f1727; // 0x728(0x100)
	char pad_828[0x98]; // 0x828(0x98)
	struct F*f882669a6a *8ac2e140c6; // 0x8c0(0x40)
	struct FVector *9aff4f664b; // 0x900(0x0c)
	bool *dbe8d61961; // 0x90c(0x01)
	char pad_90D[0x3]; // 0x90d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x910(0x01)
	char pad_910_1 : 7; // 0x910(0x01)
	char pad_911[0xf]; // 0x911(0x0f)

	void *90a546eabb(); // Function Engine.CharacterMovementComponent.*90a546eabb // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638ef70
	void *71dafd4d4d(); // Function Engine.CharacterMovementComponent.*71dafd4d4d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6396894
	void *2753af4362(); // Function Engine.CharacterMovementComponent.*2753af4362 // Final|Native|Public|BlueprintCallable // @ game+0x63a4974
	void *7f80478723(); // Function Engine.CharacterMovementComponent.*7f80478723 // Final|Native|Public|BlueprintCallable // @ game+0x63a48dc
	void *90faa9aff7(); // Function Engine.CharacterMovementComponent.*90faa9aff7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390524
	bool *38cde05eb4(); // Function Engine.CharacterMovementComponent.*38cde05eb4 // Native|Public|BlueprintCallable // @ game+0x63850cc
	void *95acad96b5(); // Function Engine.CharacterMovementComponent.*95acad96b5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391264
	void *74ec3726b8(); // Function Engine.CharacterMovementComponent.*74ec3726b8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63903c4
	void AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x638355c
	void *b32b5ec1b0(); // Function Engine.CharacterMovementComponent.*b32b5ec1b0 // Final|Native|Public|BlueprintCallable // @ game+0x639edec
	void *7069f250d4(); // Function Engine.CharacterMovementComponent.*7069f250d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d358
	void *015f95d0bb(); // Function Engine.CharacterMovementComponent.*015f95d0bb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x639036c
	void *462bbc0ddd(); // Function Engine.CharacterMovementComponent.*462bbc0ddd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63965bc
	void *0c170a562b(); // Function Engine.CharacterMovementComponent.*0c170a562b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63921a0
	struct FVector AddImpulse(); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6383ba0
	void *db1edcad4b(); // Function Engine.CharacterMovementComponent.*db1edcad4b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6395f30
	void *84929fc112(); // Function Engine.CharacterMovementComponent.*84929fc112 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63a15a8
	struct FHitResult *43edff4ae6(); // Function Engine.CharacterMovementComponent.*43edff4ae6 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x63935d4
	void *e03b5e7dc5(); // Function Engine.CharacterMovementComponent.*e03b5e7dc5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390398
	void *2c03648be5(); // Function Engine.CharacterMovementComponent.*2c03648be5 // Final|Native|Public|BlueprintCallable // @ game+0x639ed58
	void *c64386b7f7(); // Function Engine.CharacterMovementComponent.*c64386b7f7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393108
	void *9b005623ac(); // Function Engine.CharacterMovementComponent.*9b005623ac // Native|Public|BlueprintCallable // @ game+0x89ae58
	void *63889f1173(); // Function Engine.CharacterMovementComponent.*63889f1173 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5644b24
	void *ee419b5fd8(); // Function Engine.CharacterMovementComponent.*ee419b5fd8 // Final|Native|Public|BlueprintCallable // @ game+0x63a3288
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x63897f0
	void *60ff66bd47(); // Function Engine.CharacterMovementComponent.*60ff66bd47 // Final|Native|Public|BlueprintCallable // @ game+0x63a151c
	void *8381acd31f(); // Function Engine.CharacterMovementComponent.*8381acd31f // Final|Native|Public|BlueprintCallable // @ game+0x63a13f4
	void *c58989e56b(); // Function Engine.CharacterMovementComponent.*c58989e56b // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x63a4b80
	void *e8afdd8741(); // Function Engine.CharacterMovementComponent.*e8afdd8741 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x56884fc
	bool CapsuleTouched(struct UPrimitiveComponent* Param0, struct UPrimitiveComponent* Param2); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x63854d0
	enum class EMovementMode *0f142f89b9(); // Function Engine.CharacterMovementComponent.*0f142f89b9 // Native|Public|BlueprintCallable // @ game+0x63a26d8
	void *8514fb3447(); // Function Engine.CharacterMovementComponent.*8514fb3447 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638e040
	void *11603f3271(); // Function Engine.CharacterMovementComponent.*11603f3271 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63a1480
	float *4f63486679(); // Function Engine.CharacterMovementComponent.*4f63486679 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6395a8c
	void *2ff626d6d1(); // Function Engine.CharacterMovementComponent.*2ff626d6d1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c62c
	void *fb06094432(); // Function Engine.CharacterMovementComponent.*fb06094432 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x639ee78
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject {
};

// Class Engine.StaticMeshActor
// Size: 0x400 (Inherited: 0x3f0)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3f0(0x08)
	bool bStaticMeshReplicateMovement; // 0x3f8(0x01)
	enum class ENavDataGatheringMode *e2328b2504; // 0x3f9(0x01)
	char pad_3FA[0x6]; // 0x3fa(0x06)
};

// Class Engine.HUD
// Size: 0x4d8 (Inherited: 0x3f0)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x3f0(0x08)
	char bLostFocusPaused : 1; // 0x3f8(0x01)
	char bShowHUD : 1; // 0x3f8(0x01)
	char bShowDebugInfo : 1; // 0x3f8(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x3f8(0x01)
	char bShowOverlays : 1; // 0x3f8(0x01)
	char bEnableDebugTextShadow : 1; // 0x3f8(0x01)
	char pad_3F8_6 : 2; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct TArray<struct AActor*> *e03555f483; // 0x400(0x10)
	char pad_410[0x8]; // 0x410(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x418(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x428(0x10)
	struct UCanvas* Canvas; // 0x438(0x08)
	struct UCanvas* *62b97b751a; // 0x440(0x08)
	struct TArray<struct F*fae183bc56> *fe8d86efa1; // 0x448(0x10)
	struct UClass* *fb904319b5; // 0x458(0x08)
	struct AActor* *463b4dc366; // 0x460(0x08)
	char pad_468[0x70]; // 0x468(0x70)

	void ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1e037c
	bool *df4061b0be(struct UClass* ClassFilter); // Function Engine.HUD.*df4061b0be // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x638c1ec
	struct FVector2D AddHitBox(struct FVector2D Size, bool bConsumesInput); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63839d8
	void Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639a8c4
	void ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FString *0246c1a4d4(float OutWidth, struct UFont* Font); // Function Engine.HUD.*0246c1a4d4 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6391c58
	float *fe035ce755(struct UMaterialInterface* Material); // Function Engine.HUD.*fe035ce755 // Final|Native|Public|BlueprintCallable // @ game+0x6389f44
	void *c23d7d1b95(struct FString Text, float ScreenX, struct UFont* Font); // Function Engine.HUD.*c23d7d1b95 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x638a708
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0xcf9198
	struct AActor* *96bc26c00a(); // Function Engine.HUD.*96bc26c00a // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x639ad20
	void *7ae35533f0(struct UTexture* Texture, float ScreenY); // Function Engine.HUD.*7ae35533f0 // Final|Native|Public|BlueprintCallable // @ game+0x638aed0
	struct FLinearColor *73cee3e4ca(); // Function Engine.HUD.*73cee3e4ca // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63898b0
	void ShowDebugToggleSubCategory(); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x63a4d80
	void *2693eb47f0(); // Function Engine.HUD.*2693eb47f0 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x6390f48
	void *9947d93eda(); // Function Engine.HUD.*9947d93eda // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x56a98f0
	void ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x63a4cc0
	float Deproject(float ScreenY); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638919c
	void ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1e037c
	float DrawTexture(float TextureUWidth, struct FLinearColor TintColor, float Scale, float Rotation); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x638a9c0
	int32 ReceiveDrawHUD(); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FLinearColor *f7fdb39fc4(float ScreenX, float ScreenW); // Function Engine.HUD.*f7fdb39fc4 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x638a52c
	void *872a042141(); // Function Engine.HUD.*872a042141 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x639ab6c
	float *54873e95c6(float MaterialUWidth, float Scale, float Rotation); // Function Engine.HUD.*54873e95c6 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6389adc
	void ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FVector2D *40f4edae17(struct FVector2D V0_UV, struct FVector2D V2_UV, struct FLinearColor V1_Color); // Function Engine.HUD.*40f4edae17 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x638a1bc
	void ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x63a4c2c
	struct FVector *c5ab2302bc(struct FVector Param4, bool Param6, bool Param8, float Param10); // Function Engine.HUD.*c5ab2302bc // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x63830e8
};

// Class Engine.Brush
// Size: 0x428 (Inherited: 0x3f0)
struct ABrush : AActor {
	enum class *5e5e5eab6b *0b26d2092e; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	struct FColor BrushColor; // 0x3f4(0x04)
	int32 PolyFlags; // 0x3f8(0x04)
	char *aea2cb31c1 : 1; // 0x3fc(0x01)
	char *a1acb90bd3 : 1; // 0x3fc(0x01)
	char *d80e65bbb7 : 1; // 0x3fc(0x01)
	char *eac65cc66b : 1; // 0x3fc(0x01)
	char pad_3FC_4 : 4; // 0x3fc(0x01)
	char pad_3FD[0x3]; // 0x3fd(0x03)
	struct UModel* Brush; // 0x400(0x08)
	struct UBrushComponent* BrushComponent; // 0x408(0x08)
	char *76c1f76587 : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct TArray<struct F*d4dfcacc3f> *39006b633f; // 0x418(0x10)
};

// Class Engine.Volume
// Size: 0x428 (Inherited: 0x428)
struct AVolume : ABrush {
	enum class *5e5e5eab6b *0b26d2092e; // 0x3f0(0x01)
	struct FColor BrushColor; // 0x3f4(0x04)
	int32 PolyFlags; // 0x3f8(0x04)
	char *aea2cb31c1 : 1; // 0x3fc(0x01)
	char *a1acb90bd3 : 1; // 0x3fc(0x01)
	char *d80e65bbb7 : 1; // 0x3fc(0x01)
	char *eac65cc66b : 1; // 0x3fc(0x01)
	struct UModel* Brush; // 0x400(0x08)
	struct UBrushComponent* BrushComponent; // 0x408(0x08)
	char *76c1f76587 : 1; // 0x410(0x01)
	struct TArray<struct F*d4dfcacc3f> *39006b633f; // 0x418(0x10)
};

// Class Engine.AnimNotify
// Size: 0x38 (Inherited: 0x28)
struct UAnimNotify : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x38)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct FVector LocationOffset; // 0x40(0x0c)
	struct FRotator RotationOffset; // 0x4c(0x0c)
	char pad_58[0x18]; // 0x58(0x18)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x30 (Inherited: 0x28)
struct UAnimNotifyState : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Engine.DataTable
// Size: 0x80 (Inherited: 0x28)
struct UDataTable : UObject {
	struct UScriptStruct* *6517b67220; // 0x28(0x08)
	char pad_30[0x50]; // 0x30(0x50)
};

// Class Engine.Character
// Size: 0x860 (Inherited: 0x450)
struct ACharacter : APawn {
	struct FVector *25042cf667; // 0x450(0x0c)
	float JumpMaxHoldTime; // 0x45c(0x04)
	float *242f050da7; // 0x460(0x04)
	char pad_464[0xc]; // 0x464(0x0c)
	struct FQuat *f12a07eecd; // 0x470(0x10)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x480(0x08)
	char bPressedJump : 1; // 0x488(0x01)
	char *1e345fa424 : 1; // 0x488(0x01)
	char *e8e73f092d : 1; // 0x488(0x01)
	char *69cbbf7dd8 : 1; // 0x488(0x01)
	char *8668c6e0ea : 1; // 0x488(0x01)
	char *148d9ff30a : 1; // 0x488(0x01)
	char *cb3edb2730 : 1; // 0x488(0x01)
	char *053cd11427 : 1; // 0x488(0x01)
	char bWasJumping : 1; // 0x489(0x01)
	char pad_489_1 : 7; // 0x489(0x01)
	char pad_48A[0x2]; // 0x48a(0x02)
	bool *6588c92738; // 0x48c(0x01)
	char pad_48D[0x3]; // 0x48d(0x03)
	struct F*c6f03cdc0f *e9a9c9cc0a; // 0x490(0x48)
	float *8bd307ef37; // 0x4d8(0x04)
	bool *c5a0c89d9e; // 0x4dc(0x01)
	char pad_4DD[0x3]; // 0x4dd(0x03)
	struct UCharacterMovementComponent* CharacterMovement; // 0x4e0(0x08)
	float JumpKeyHoldTime; // 0x4e8(0x04)
	char pad_4EC[0x4]; // 0x4ec(0x04)
	struct F*c6f03cdc0f *98c683696e; // 0x4f0(0x48)
	float CrouchedEyeHeight; // 0x538(0x04)
	char bIsCrouched : 1; // 0x53c(0x01)
	char pad_53C_1 : 7; // 0x53c(0x01)
	char pad_53D[0x3]; // 0x53d(0x03)
	struct USkeletalMeshComponent* Mesh; // 0x540(0x08)
	int32 JumpMaxCount; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UCapsuleComponent* CapsuleComponent; // 0x550(0x08)
	int32 JumpCurrentCount; // 0x558(0x04)
	char pad_55C[0x4]; // 0x55c(0x04)
	struct FMulticastDelegate OnReachedJumpApex; // 0x560(0x10)
	char pad_570[0x10]; // 0x570(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x580(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x590(0x10)
	struct FRootMotionSourceGroup *c561841b57; // 0x5a0(0x100)
	struct F*f882669a6a *d1160de8cb; // 0x6a0(0x40)
	struct TArray<struct F*f1a5265894> *bfa8d6a6b0; // 0x6e0(0x10)
	struct F*e60dc8ad15 *4ffa8bec6a; // 0x6f0(0x160)
	char pad_850[0x10]; // 0x850(0x10)

	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x561f7d0
	void *11701e6c86(float Param0); // Function Engine.Character.*11701e6c86 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639d070
	void *ca8dfc4730(); // Function Engine.Character.*ca8dfc4730 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386374
	bool K2_OnMovementModeChanged(); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *99ee38b5a3(); // Function Engine.Character.*99ee38b5a3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c820
	void OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x1e037c
	void ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x945d3c
	struct FName *f8a8a87a99(bool Param5); // Function Engine.Character.*f8a8a87a99 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6388340
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x35bfd8
	struct FName ServerMove(bool Param8); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639b968
	void *8df9beeffc(); // Function Engine.Character.*8df9beeffc // Native|Public|BlueprintCallable // @ game+0x63a3640
	struct UPrimitiveComponent* *862039a00c(struct FName Param8, bool Param10); // Function Engine.Character.*862039a00c // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6385e60
	void *6539aa112e(); // Function Engine.Character.*6539aa112e // Final|Native|Public|BlueprintCallable // @ game+0x638e068
	struct FName *07222f33a7(); // Function Engine.Character.*07222f33a7 // Native|Public|BlueprintCallable // @ game+0x6399f6c
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x63936ac
	bool *2bca3b9c1d(float Param1, struct FVector_NetQuantizeNormal Param3); // Function Engine.Character.*2bca3b9c1d // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6385acc
	void *82691fa526(); // Function Engine.Character.*82691fa526 // Native|Public|BlueprintCallable // @ game+0x63a5608
	bool *7f0a1239ad(struct FVector_NetQuantize10 Param1, uint32 Param3); // Function Engine.Character.*7f0a1239ad // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639c864
	void OnWalkingOffLedge(struct FVector PreviousFloorContactNormal); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x639999c
	void CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x63853b8
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x639972c
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x6399790
	void CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6385394
	void *866417e915(); // Function Engine.Character.*866417e915 // Native|Public|BlueprintCallable // @ game+0x63a5da0
	void IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63929ac
	float *1a3809edda(struct FVector_NetQuantize10 Param5, bool Param7, uint32 Param9, struct FName Param11); // Function Engine.Character.*1a3809edda // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639c2e4
	struct UPrimitiveComponent* *d3e75881e1(struct FName Param5, bool Param7); // Function Engine.Character.*d3e75881e1 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x9445b8
	void *48d57a327e(); // Function Engine.Character.*48d57a327e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6384fc0
	void *b39a015335(); // Function Engine.Character.*b39a015335 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x638635c
	void *5b41406dd2(); // Function Engine.Character.*5b41406dd2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x55f8300
	void *56fb21a6d3(); // Function Engine.Character.*56fb21a6d3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c868
	void OnLaunched(bool bXYOverride); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x1e037c
	float K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *0bf24fb690(); // Function Engine.Character.*0bf24fb690 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x639332c
	void *779dfbaabd(); // Function Engine.Character.*779dfbaabd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393350
	uint32 *fceda4a8d6(float Param0, struct UPrimitiveComponent* Param10, bool Param12); // Function Engine.Character.*fceda4a8d6 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639bd64
	void Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x63890b8
	void K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *729216e5f2(); // Function Engine.Character.*729216e5f2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x55c3ec0
	void *7adff78f36(); // Function Engine.Character.*7adff78f36 // Native|Public|BlueprintCallable // @ game+0x63a58fc
	bool *82e7d06301(float Param0, struct FVector_NetQuantize100 Param2, bool Param4); // Function Engine.Character.*82e7d06301 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639cd2c
	bool LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6398c40
	void K2_OnStartCrouch(float HalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x1e037c
};

// Class Engine.Controller
// Size: 0x470 (Inherited: 0x3f0)
struct AController : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	char *a05757ae10 : 1; // 0x3f8(0x01)
	char *68b329ef67 : 1; // 0x3f8(0x01)
	char pad_3F8_2 : 6; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	struct FRotator *e40e8dabb2; // 0x3fc(0x0c)
	struct USceneComponent* TransformComponent; // 0x408(0x08)
	char pad_410[0x18]; // 0x410(0x18)
	struct FName StateName; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
	struct ACharacter* Character; // 0x438(0x08)
	struct APawn* Pawn; // 0x440(0x08)
	struct APlayerState* PlayerState; // 0x448(0x08)
	char pad_450[0x10]; // 0x450(0x10)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x460(0x10)

	void *d35e8bc247(); // Function Engine.Controller.*d35e8bc247 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63923a4
	void *6e6db3fd99(); // Function Engine.Controller.*6e6db3fd99 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392e38
	void GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638dbcc
	void *36e4787827(); // Function Engine.Controller.*36e4787827 // Native|Public|BlueprintCallable // @ game+0x5649e90
	struct FRotator *15f0d36de2(); // Function Engine.Controller.*15f0d36de2 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0xbd651c
	void K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6396614
	void *27250128fa(); // Function Engine.Controller.*27250128fa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393310
	void *f2a72b13b5(); // Function Engine.Controller.*f2a72b13b5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638e15c
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x35f3f0
	void *19175e6cf7(); // Function Engine.Controller.*19175e6cf7 // Native|Public|BlueprintCallable // @ game+0x639b050
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x7a900c
	void ReceiveInstigatedAnyDamage(struct U*498af98d1d* DamageType); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x1e037c
	void *ceaebf3734(); // Function Engine.Controller.*ceaebf3734 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393090
	void *ee8f3b4c63(); // Function Engine.Controller.*ee8f3b4c63 // Native|Public|BlueprintCallable // @ game+0x63a1868
	void *205665ad55(); // Function Engine.Controller.*205665ad55 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63a0714
	void *1e35afc686(); // Function Engine.Controller.*1e35afc686 // Final|Native|Public|BlueprintCallable // @ game+0x6385724
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x63a5914
	void *bd544094f0(); // Function Engine.Controller.*bd544094f0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392f7c
	void *128814cef7(); // Function Engine.Controller.*128814cef7 // Native|Public|BlueprintCallable // @ game+0x560bb04
	void Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x55fc9dc
	void *70f7882012(); // Function Engine.Controller.*70f7882012 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392f54
	void *8a22f11f09(struct FVector ViewPoint); // Function Engine.Controller.*8a22f11f09 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6398ec4
	void *a590a631c1(); // Function Engine.Controller.*a590a631c1 // Native|Public|BlueprintCallable // @ game+0x63a5e38
	void *c9e2d88f05(); // Function Engine.Controller.*c9e2d88f05 // Native|Public|BlueprintCallable // @ game+0x639b068
	void *ed16c719d1(); // Function Engine.Controller.*ed16c719d1 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6387770
};

// Class Engine.SpringArmComponent
// Size: 0x560 (Inherited: 0x4d0)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x4d0(0x04)
	struct FVector SocketOffset; // 0x4d4(0x0c)
	struct FVector TargetOffset; // 0x4e0(0x0c)
	float ProbeSize; // 0x4ec(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	char bDoCollisionTest : 1; // 0x4f4(0x01)
	char bUsePawnControlRotation : 1; // 0x4f4(0x01)
	char bInheritPitch : 1; // 0x4f4(0x01)
	char bInheritYaw : 1; // 0x4f4(0x01)
	char bInheritRoll : 1; // 0x4f4(0x01)
	char bLockPitchLag : 1; // 0x4f4(0x01)
	char bLockYawLag : 1; // 0x4f4(0x01)
	char bLockRollLag : 1; // 0x4f4(0x01)
	char bEnableCameraLag : 1; // 0x4f5(0x01)
	char bEnableCameraRotationLag : 1; // 0x4f5(0x01)
	char bUseCameraLagSubstepping : 1; // 0x4f5(0x01)
	char bDrawDebugLagMarkers : 1; // 0x4f5(0x01)
	char pad_4F5_4 : 4; // 0x4f5(0x01)
	char pad_4F6[0x2]; // 0x4f6(0x02)
	float CameraLagSpeed; // 0x4f8(0x04)
	float CameraRotationLagSpeed; // 0x4fc(0x04)
	float CameraLagMaxTimeStep; // 0x500(0x04)
	float CameraLagMaxDistance; // 0x504(0x04)
	char pad_508[0x58]; // 0x508(0x58)
};

// Class Engine.PlayerController
// Size: 0x7a0 (Inherited: 0x470)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)
	struct APawn* *52577c9cf3; // 0x480(0x08)
	struct U*bf68adb116* *2118536042; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
	struct AHUD* *0174a95ec0; // 0x498(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x4a0(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4a8(0x08)
	bool *a3e4cbf23c; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	struct FRotator TargetViewRotation; // 0x4b4(0x0c)
	char pad_4C0[0xc]; // 0x4c0(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4cc(0x04)
	struct TArray<struct AActor*> *96a0afe110; // 0x4d0(0x10)
	char pad_4E0[0x4]; // 0x4e0(0x04)
	float *744175bbfd; // 0x4e4(0x04)
	struct FVector *91545f0f7d; // 0x4e8(0x0c)
	struct FRotator *1aa871ab47; // 0x4f4(0x0c)
	int32 *c1e8e27c17; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct UCheatManager* CheatManager; // 0x508(0x08)
	struct UClass* CheatClass; // 0x510(0x08)
	struct UPlayerInput* PlayerInput; // 0x518(0x08)
	struct TArray<struct F*846c4d8d15> *00b46b06f5; // 0x520(0x10)
	char pad_530[0x90]; // 0x530(0x90)
	char pad_5C0_0 : 3; // 0x5c0(0x01)
	char bPlayerIsWaiting : 1; // 0x5c0(0x01)
	char pad_5C0_4 : 4; // 0x5c0(0x01)
	char pad_5C1[0x3]; // 0x5c1(0x03)
	bool *de61ed25a1; // 0x5c4(0x01)
	char pad_5C5[0x3b]; // 0x5c5(0x3b)
	struct UNetConnection* *4d8dd0dd7c; // 0x600(0x08)
	struct UNetConnection* NetConnection; // 0x608(0x08)
	char pad_610[0xc]; // 0x610(0x0c)
	float InputYawScale; // 0x61c(0x04)
	float InputPitchScale; // 0x620(0x04)
	float InputRollScale; // 0x624(0x04)
	char bShowMouseCursor : 1; // 0x628(0x01)
	char bEnableClickEvents : 1; // 0x628(0x01)
	char bEnableTouchEvents : 1; // 0x628(0x01)
	char bEnableMouseOverEvents : 1; // 0x628(0x01)
	char bEnableTouchOverEvents : 1; // 0x628(0x01)
	char bForceFeedbackEnabled : 1; // 0x628(0x01)
	char pad_628_6 : 2; // 0x628(0x01)
	char pad_629[0x7]; // 0x629(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x630(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x640(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x641(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x642(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x643(0x01)
	float HitResultTraceDistance; // 0x644(0x04)
	char pad_648[0x80]; // 0x648(0x80)
	struct U*63b14265fa* *a84aed1ac2; // 0x6c8(0x08)
	char pad_6D0_0 : 3; // 0x6d0(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6d0(0x01)
	char pad_6D0_4 : 4; // 0x6d0(0x01)
	char pad_6D1[0x17]; // 0x6d1(0x17)
	struct UTouchInterface* *353d824492; // 0x6e8(0x08)
	char pad_6F0[0x40]; // 0x6f0(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x730(0x08)
	struct FVector SpawnLocation; // 0x738(0x0c)
	char pad_744[0x4]; // 0x744(0x04)
	bool *66411eec05; // 0x748(0x01)
	char pad_749[0x1]; // 0x749(0x01)
	uint16 *3d54acd8a3; // 0x74a(0x02)
	uint16 *e5470d9a99; // 0x74c(0x02)
	char pad_74E[0x2]; // 0x74e(0x02)
	struct AActor* *2f9c762523; // 0x750(0x08)
	struct AActor* *dd387e3bdd; // 0x758(0x08)
	char pad_760[0x40]; // 0x760(0x40)

	void *9414589630(); // Function Engine.PlayerController.*9414589630 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386784
	struct AActor* *234979df54(); // Function Engine.PlayerController.*234979df54 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x9844e4
	void *5b13f1daeb(struct FKey Key); // Function Engine.PlayerController.*5b13f1daeb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f5a8
	struct UForceFeedbackEffect* *d53e3d94e0(); // Function Engine.PlayerController.*d53e3d94e0 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x6387b20
	struct UClass* *bee6588995(); // Function Engine.PlayerController.*bee6588995 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x6387a3c
	void *27660cb1ad(float Duration, bool bAffectsLeftSmall, bool bAffectsRightSmall); // Function Engine.PlayerController.*27660cb1ad // Final|Native|Public|BlueprintCallable // @ game+0x639a434
	void *138bf4a368(); // Function Engine.PlayerController.*138bf4a368 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639b91c
	float *808761b431(bool Param2); // Function Engine.PlayerController.*808761b431 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386fac
	struct FHitResult *58ac560ffc(enum class ETouchIndex FingerIndex); // Function Engine.PlayerController.*58ac560ffc // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638ec28
	void *207d75612e(); // Function Engine.PlayerController.*207d75612e // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xcf6c54
	void *82afa3a7b9(); // Function Engine.PlayerController.*82afa3a7b9 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xc0658c
	enum class ECameraAnimPlaySpace *5b0dec685d(float Scale, float BlendInTime); // Function Engine.PlayerController.*5b0dec685d // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x63868a0
	void *b6936626e5(); // Function Engine.PlayerController.*b6936626e5 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d6d0
	void ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x6388798
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x638b0a4
	bool *80ddefce3e(); // Function Engine.PlayerController.*80ddefce3e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x8dd274
	void *0ef4224a1c(float DeltaX); // Function Engine.PlayerController.*0ef4224a1c // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638f864
	void *f403e28121(enum class ETouchIndex FingerIndex, float LocationY); // Function Engine.PlayerController.*f403e28121 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638f968
	void *58d19cd040(); // Function Engine.PlayerController.*58d19cd040 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a0788
	void *f2732fc920(); // Function Engine.PlayerController.*f2732fc920 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x63863bc
	void *b9be4bfa5c(); // Function Engine.PlayerController.*b9be4bfa5c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6387458
	void *1b9bad8269(enum class *1878682c6d Param1); // Function Engine.PlayerController.*1b9bad8269 // Final|Native|Public|HasDefaults // @ game+0x6387dbc
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x561fc50
	float *fbc51829ff(); // Function Engine.PlayerController.*fbc51829ff // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x6386cf0
	void *2f8889f3a5(float Param1); // Function Engine.PlayerController.*2f8889f3a5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6387648
	bool *b56aa098d6(); // Function Engine.PlayerController.*b56aa098d6 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0xb26dd8
	void SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x63a27b8
	void *3fc73b6f13(); // Function Engine.PlayerController.*3fc73b6f13 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x865688
	void *088499e4d0(); // Function Engine.PlayerController.*088499e4d0 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xbdf07c
	void *eeb30ba19c(); // Function Engine.PlayerController.*eeb30ba19c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6399904
	bool *dd4c51e1e3(); // Function Engine.PlayerController.*dd4c51e1e3 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xab0d00
	void *2d910e8d72(); // Function Engine.PlayerController.*2d910e8d72 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386584
	void ServerUpdateLevelVisibility(struct FName Param0); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xaeb1dc
	void *2918ec2068(); // Function Engine.PlayerController.*2918ec2068 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x6387914
	void SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x63a5a3c
	void *d916e2a943(struct FName Param1); // Function Engine.PlayerController.*d916e2a943 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x638661c
	struct FHitResult *2c45b56710(); // Function Engine.PlayerController.*2c45b56710 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638ea78
	void *34a03dd82e(); // Function Engine.PlayerController.*34a03dd82e // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d430
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x6389184
	void *f2ad11dc1b(); // Function Engine.PlayerController.*f2ad11dc1b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xb9bb34
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x638b298
	void *c5ab1bf288(); // Function Engine.PlayerController.*c5ab1bf288 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6388624
	void *f01c6ad62c(); // Function Engine.PlayerController.*f01c6ad62c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386440
	void *60e8fd4016(); // Function Engine.PlayerController.*60e8fd4016 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d95c
	void *9806f2220c(); // Function Engine.PlayerController.*9806f2220c // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d684
	void *2e287bf09c(); // Function Engine.PlayerController.*2e287bf09c // Final|Native|Public|BlueprintCallable // @ game+0x63a5864
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x564d480
	void *2a9d12a666(); // Function Engine.PlayerController.*2a9d12a666 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x63879a8
	void *8cada05a90(struct FName Param0); // Function Engine.PlayerController.*8cada05a90 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386e74
	bool *0fc967239a(); // Function Engine.PlayerController.*0fc967239a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639a984
	void *c2427940d5(); // Function Engine.PlayerController.*c2427940d5 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d5c4
	void *d884ceb98a(); // Function Engine.PlayerController.*d884ceb98a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639db38
	void *c693ef733b(float Param1); // Function Engine.PlayerController.*c693ef733b // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6385988
	void *4d701bd8a2(); // Function Engine.PlayerController.*4d701bd8a2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6388168
	void *1d880e774d(); // Function Engine.PlayerController.*1d880e774d // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386344
	void *498dad03e0(); // Function Engine.PlayerController.*498dad03e0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6388284
	void FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x638b2c4
	struct FKey *9fe7d18e40(); // Function Engine.PlayerController.*9fe7d18e40 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f088
	struct FVector_NetQuantize ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639d830
	void *d98ebc4243(); // Function Engine.PlayerController.*d98ebc4243 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6386458
	struct FHitResult *3347c2ead1(struct TArray<enum class EObjectTypeQuery> ObjectTypes); // Function Engine.PlayerController.*3347c2ead1 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638e710
	void *a7b14ec9b0(); // Function Engine.PlayerController.*a7b14ec9b0 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x638638c
	struct AActor* *d36fe357cf(float BlendTime, float BlendExp); // Function Engine.PlayerController.*d36fe357cf // Native|Public|BlueprintCallable // @ game+0x63a467c
	void *d488eaf060(); // Function Engine.PlayerController.*d488eaf060 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x56b1740
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x639b0ac
	float *6da664389f(); // Function Engine.PlayerController.*6da664389f // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x639041c
	void *9d04a2a54b(enum class *1878682c6d Param1); // Function Engine.PlayerController.*9d04a2a54b // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6387f90
	struct FHitResult *6f13f17807(); // Function Engine.PlayerController.*6f13f17807 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638e430
	float *2c95dc8fa1(); // Function Engine.PlayerController.*2c95dc8fa1 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638f2c4
	void *693b11e6e8(enum class EControllerHand Hand); // Function Engine.PlayerController.*693b11e6e8 // Final|Native|Public|BlueprintCallable // @ game+0x639a740
	void *125ef13e4f(); // Function Engine.PlayerController.*125ef13e4f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639b734
	void StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x63a5238
	void *1cd2062287(struct USceneComponent* AttachToComponent); // Function Engine.PlayerController.*1cd2062287 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e850
	void *83f70de997(); // Function Engine.PlayerController.*83f70de997 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639b7e8
	void ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x56acaa0
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x6399b64
	void *8ad4a54cf6(enum class ECollisionChannel TraceChannel, struct FHitResult HitResult); // Function Engine.PlayerController.*8ad4a54cf6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638e8c8
	void *9674400037(); // Function Engine.PlayerController.*9674400037 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391ba0
	bool *930cb558f2(); // Function Engine.PlayerController.*930cb558f2 // Native|Public|BlueprintCallable // @ game+0x639fdf0
	void *b41250e3ae(struct FVector Param0); // Function Engine.PlayerController.*b41250e3ae // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x639d47c
	void *a31819daef(); // Function Engine.PlayerController.*a31819daef // Final|Native|Public|BlueprintCallable // @ game+0x6385918
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x6392774
	void LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x6399008
	void *c11f968a6d(); // Function Engine.PlayerController.*c11f968a6d // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcffb8c
	void *a235b1fcfa(int32 Param1, struct APlayerState* Param3); // Function Engine.PlayerController.*a235b1fcfa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6387138
	void AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x6384cb0
	void *90c95e2107(); // Function Engine.PlayerController.*90c95e2107 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0013c
	void *7fa4dd7244(struct APlayerState* Param0, struct FName Param2); // Function Engine.PlayerController.*7fa4dd7244 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6387c00
	enum class ECameraAnimPlaySpace *c56a5327cc(); // Function Engine.PlayerController.*c56a5327cc // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0xa977d8
	struct USoundBase* *977cb2e1ec(float Param1); // Function Engine.PlayerController.*977cb2e1ec // Net|Native|Event|Public|NetClient // @ game+0x6386bcc
	void *bad6120f6b(bool Param0, struct FVector2D Param2); // Function Engine.PlayerController.*bad6120f6b // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x6387470
	int32 *71377d6c43(); // Function Engine.PlayerController.*71377d6c43 // Final|Native|Public|BlueprintCallable // @ game+0x63a2568
	void *c7482859e6(struct FKey Key); // Function Engine.PlayerController.*c7482859e6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392e60
	void SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x639b670
	void *46d7f5c82f(); // Function Engine.PlayerController.*46d7f5c82f // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639b8d0
	void *90034fd277(); // Function Engine.PlayerController.*90034fd277 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d3e4
	void AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x6384444
	void *894d5aab0c(); // Function Engine.PlayerController.*894d5aab0c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x638787c
	void *8a25e3a3ec(); // Function Engine.PlayerController.*8a25e3a3ec // Net|NetReliableNative|Event|Public|NetClient // @ game+0x63863a4
	void *91fb0f1f53(); // Function Engine.PlayerController.*91fb0f1f53 // Native|Public|BlueprintCallable // @ game+0x63a4844
	void Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x6385258
	struct FVector DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6389330
	void *e7688c5ab7(); // Function Engine.PlayerController.*e7688c5ab7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x63923cc
	struct FKey *73cf67a757(); // Function Engine.PlayerController.*73cf67a757 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638fc20
	void *86b835f913(); // Function Engine.PlayerController.*86b835f913 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638e300
	void *52a0531220(); // Function Engine.PlayerController.*52a0531220 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d338
	void *a41eb8f989(); // Function Engine.PlayerController.*a41eb8f989 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63a5ff8
	void *929bd9b49d(); // Function Engine.PlayerController.*929bd9b49d // Native|Public|BlueprintCallable // @ game+0x6382bf8
	void *6b7eb93d95(); // Function Engine.PlayerController.*6b7eb93d95 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639d1d8
	void *162964937a(); // Function Engine.PlayerController.*162964937a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639daec
	void *4e12e82776(float ScreenY, struct FVector WorldDirection); // Function Engine.PlayerController.*4e12e82776 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6389438
	void *5d69b1297b(); // Function Engine.PlayerController.*5d69b1297b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xc1c684
	void *07bb10948f(); // Function Engine.PlayerController.*07bb10948f // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6387394
	void *7f7a5cd988(); // Function Engine.PlayerController.*7f7a5cd988 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x6387300
	void *b94ca05f4b(); // Function Engine.PlayerController.*b94ca05f4b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x56b1160
	void *f330680f5c(); // Function Engine.PlayerController.*f330680f5c // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x639daa0
	void *c0e5d05621(); // Function Engine.PlayerController.*c0e5d05621 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x561fe84
	struct FHitResult *8e5ce08dca(); // Function Engine.PlayerController.*8e5ce08dca // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638e5a0
	void *23d2eeffeb(); // Function Engine.PlayerController.*23d2eeffeb // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x639da54
	void ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x63a5bcc
	float *a5bdbf96a2(); // Function Engine.PlayerController.*a5bdbf96a2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638f17c
	void ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x70e684
	void *e5134f0647(float Frequency, float Amplitude); // Function Engine.PlayerController.*e5134f0647 // Final|Native|Public|BlueprintCallable // @ game+0x63a1644
	struct FVector *a3ca820659(); // Function Engine.PlayerController.*a3ca820659 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638f69c
	void AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x6384888
	void *36545cdce1(); // Function Engine.PlayerController.*36545cdce1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x63864ec
	void *adaa944e6a(struct FKey Key); // Function Engine.PlayerController.*adaa944e6a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63a60ec
	void *2fa8097c4a(); // Function Engine.PlayerController.*2fa8097c4a // Net|NetReliableNative|Event|Public|NetClient // @ game+0xc31fac
};

// Class Engine.PlayerState
// Size: 0x488 (Inherited: 0x3f0)
struct APlayerState : AInfo {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct UClass* *aff3dca9f7; // 0x3f8(0x08)
	struct FString *de846607a1; // 0x400(0x10)
	int32 PlayerId; // 0x410(0x04)
	char pad_414[0x4]; // 0x414(0x04)
	struct FUniqueNetIdRepl UniqueId; // 0x418(0x18)
	int32 StartTime; // 0x430(0x04)
	char pad_434[0xc]; // 0x434(0x0c)
	struct FString PlayerName; // 0x440(0x10)
	char bIsSpectator : 1; // 0x450(0x01)
	char *9f71f07fd6 : 1; // 0x450(0x01)
	char bIsABot : 1; // 0x450(0x01)
	char pad_450_3 : 1; // 0x450(0x01)
	char *7750580eb7 : 1; // 0x450(0x01)
	char *019f6d2826 : 1; // 0x450(0x01)
	char pad_450_6 : 2; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	float Score; // 0x454(0x04)
	char pad_458[0x10]; // 0x458(0x10)
	bool Ping; // 0x468(0x01)
	char pad_469[0x17]; // 0x469(0x17)
	bool *4f96db3413; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)

	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x5cc600
	void ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x1e037c
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x5683c8c
	void ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x1e037c
	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0xcf9198
	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x5cd000
};

// Class Engine.SkeletalMeshActor
// Size: 0x478 (Inherited: 0x3f0)
struct ASkeletalMeshActor : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	char bShouldDoAnimNotifies : 1; // 0x3f8(0x01)
	char bWakeOnLevelStart : 1; // 0x3f8(0x01)
	char pad_3F8_2 : 6; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x400(0x08)
	struct USkeletalMesh* *986438ef50; // 0x408(0x08)
	struct UPhysicsAsset* *eddbd99a3c; // 0x410(0x08)
	struct UMaterialInterface* *71ff89817b; // 0x418(0x08)
	struct UMaterialInterface* *36ea37d0f9; // 0x420(0x08)
	char pad_428[0x50]; // 0x428(0x50)

	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x5cd000
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x5683c8c
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0xcf9198
	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x5cc600
};

// Class Engine.SaveGame
// Size: 0x28 (Inherited: 0x28)
struct USaveGame : UObject {
};

// Class Engine.*9de72ef8ed
// Size: 0xa20 (Inherited: 0xa00)
struct U*9de72ef8ed : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x9f8(0x04)
	struct UBodySetup* *461f84b5c9; // 0xa00(0x08)
	char *9bba926356 : 1; // 0xa08(0x01)
	char *c85f8034f3 : 1; // 0xa08(0x01)
	char *838f7c099e : 1; // 0xa08(0x01)
	char pad_A0C_3 : 5; // 0xa0c(0x01)
	char pad_A0D[0x3]; // 0xa0d(0x03)
	struct UClass* AreaClass; // 0xa10(0x08)
	char pad_A18[0x8]; // 0xa18(0x08)
};

// Class Engine.TargetPoint
// Size: 0x3f0 (Inherited: 0x3f0)
struct ATargetPoint : AActor {
	struct TArray<struct AActor*> Children; // 0x38(0x10)
	char pad_400_0 : 3; // 0x400(0x01)
	char *6a29209afc : 1; // 0x48(0x01)
	char *6583edce58 : 1; // 0x49(0x01)
	char bReplicates : 1; // 0x49(0x01)
	struct FName *332fd811ca; // 0x50(0x08)
	enum class ENetRole RemoteRole; // 0x58(0x01)
	struct AActor* Owner; // 0x60(0x08)
	struct FRepMovement ReplicatedMovement; // 0x68(0x34)
	struct F*e5bda3d960 *e3fb0d68ff; // 0xa0(0x40)
	int32 *2d89f8ef7f; // 0xe0(0x04)
	float NetPriority; // 0xe4(0x04)
	enum class EAutoReceiveInput *8606d93d96; // 0xe8(0x01)
	struct U*63b14265fa* *63b14265fa; // 0xf0(0x08)
	struct TArray<struct FName> Layers; // 0xf8(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x108(0x01)
	char bCanBeDamaged : 1; // 0x108(0x01)
	char *50cd51ed38 : 1; // 0x108(0x01)
	char *e002b42072 : 1; // 0x108(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x108(0x01)
	char *a4c704a3e5 : 1; // 0x108(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x108(0x01)
	char *13aea9b43a : 1; // 0x108(0x01)
	char *4211b886bf : 1; // 0x109(0x01)
	enum class ENetRole Role; // 0x10a(0x01)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x110(0x10)
	enum class *66c1dada81 InputConsumeOption; // 0x120(0x01)
	float NetUpdateFrequency; // 0x124(0x04)
	uint64 *f99b84bc94; // 0x128(0x08)
	char *97cac516e7 : 1; // 0x134(0x01)
	char *cd27b8552b : 1; // 0x134(0x01)
	char *8aabd64ff4 : 1; // 0x134(0x01)
	char *3cd32b903e : 1; // 0x134(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x135(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x136(0x01)
	struct FMulticastDelegate OnInputTouchLeave; // 0x140(0x10)
	struct FMulticastDelegate OnActorEndOverlap; // 0x150(0x10)
	float NetCullDistanceSquared; // 0x160(0x04)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x164(0x01)
	int32 *2bc7f7749a; // 0x168(0x04)
	struct UChildActorComponent* *129513d23d; // 0x16c(0x08)
	struct AActor* ParentComponentActor; // 0x174(0x08)
	struct FMulticastDelegate OnActorHit; // 0x180(0x10)
	struct FMulticastDelegate OnReleased; // 0x190(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x1a0(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x1b0(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x1c0(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x1d0(0x10)
	float CustomTimeDilation; // 0x1e0(0x04)
	float MinNetUpdateFrequency; // 0x1e4(0x04)
	float InitialLifeSpan; // 0x1e8(0x04)
	struct FMulticastDelegate OnBeginCursorOver; // 0x1f0(0x10)
	struct APawn* Instigator; // 0x210(0x08)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x218(0x10)
	struct TArray<struct AMatineeActor*> *6220728ad0; // 0x228(0x10)
	struct FMulticastDelegate OnTakePointDamage; // 0x238(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x260(0x10)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x270(0x10)
	char bHidden : 1; // 0x280(0x01)
	char *0854a90e26 : 1; // 0x280(0x01)
	char *013332e5c6 : 1; // 0x280(0x01)
	char bOnlyRelevantToOwner : 1; // 0x280(0x01)
	char bAlwaysRelevant : 1; // 0x280(0x01)
	char *9ddfc785f1 : 1; // 0x280(0x01)
	char *05594c4443 : 1; // 0x280(0x01)
	char *ef19f6b6c9 : 1; // 0x280(0x01)
	char *dca9d9a72a : 1; // 0x281(0x01)
	char *16d69885c9 : 1; // 0x281(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x281(0x01)
	char *59968c9633 : 1; // 0x281(0x01)
	char *02848ec998 : 1; // 0x281(0x01)
	struct FGuid DestructibleId; // 0x284(0x10)
	bool bIsDestroyedVersion; // 0x294(0x01)
	bool RemoveFromLevelLOD; // 0x295(0x01)
	struct F*2066290a18 PrimaryActorTick; // 0x298(0x58)
	struct FMulticastDelegate OnClicked; // 0x340(0x10)
	struct FMulticastDelegate OnDestroyed; // 0x3a0(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3b0(0x10)
	struct USceneComponent* RootComponent; // 0x3c8(0x08)
	struct TArray<struct FName> Tags; // 0x3d0(0x10)
	float *ae3e81fc86; // 0x3e0(0x04)

	void SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x639e2d0
	void *43eab6a44c(struct FName InputAxisName); // Function Engine.Actor.*43eab6a44c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f500
	void *2f371b4576(); // Function Engine.Actor.*2f371b4576 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x63a36d8
	void *e14d0605bc(); // Function Engine.Actor.*e14d0605bc // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638be14
	void *a487955527(); // Function Engine.Actor.*a487955527 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x6396164
	void *724cefc729(); // Function Engine.Actor.*724cefc729 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63922cc
	struct FVector ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void *17f595f9ac(); // Function Engine.Actor.*17f595f9ac // Final|Native|Public|BlueprintCallable // @ game+0x6391e84
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xbcddd0
	void *c1c64c0f03(); // Function Engine.Actor.*c1c64c0f03 // Native|Public|BlueprintCallable // @ game+0xc20868
	void *7952614099(); // Function Engine.Actor.*7952614099 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c02c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xb6f010
	void ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6382c8c
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x639df2c
	void *3dcb8c828c(); // Function Engine.Actor.*3dcb8c828c // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x638b78c
	void *ccaa7ce1d0(); // Function Engine.Actor.*ccaa7ce1d0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c014
	void K2_AttachRootComponentToActor(struct FName InSocketName); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x639534c
	struct FRotator *679babdbe9(); // Function Engine.Actor.*679babdbe9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6398b2c
	struct AActor* *58360a298b(); // Function Engine.Actor.*58360a298b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6393130
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390a70
	float MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63991e0
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xa169f4
	void K2_AddActorLocalTransform(struct FTransform NewTransform, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393a74
	void AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x6384924
	void *fd605f1fa8(); // Function Engine.Actor.*fd605f1fa8 // Final|Native|Public|BlueprintCallable // @ game+0x639de94
	void *eda0f1fdef(); // Function Engine.Actor.*eda0f1fdef // Final|Native|Public|BlueprintCallable // @ game+0x63a3cc0
	void *6237fb723e(); // Function Engine.Actor.*6237fb723e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63967a8
	void *8e0bd09921(); // Function Engine.Actor.*8e0bd09921 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x638e3dc
	void DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x63896c8
	struct FName *7915dcfee8(); // Function Engine.Actor.*7915dcfee8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638da8c
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63936c4
	enum class *42e1cdcd79 *694ac52e11(enum class *42e1cdcd79 RotationRule); // Function Engine.Actor.*694ac52e11 // Final|Native|Public|BlueprintCallable // @ game+0x6395df4
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, struct FHitResult SweepHitResult); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63974e8
	struct FHitResult K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x639389c
	void K2_SetActorRotation(bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x703458
	void *927c0af560(); // Function Engine.Actor.*927c0af560 // Native|Public|BlueprintCallable // @ game+0x638b204
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x6395c8c
	struct AActor* *bf3d34531f(); // Function Engine.Actor.*bf3d34531f // Final|Native|Public|BlueprintCallable // @ game+0x63a4e10
	void K2_AddActorWorldTransform(bool bSweep); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6394050
	struct AActor* *2a43ddf3b4(); // Function Engine.Actor.*2a43ddf3b4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e234
	struct FHitResult ReceiveRadialDamage(struct AController* InstigatedBy); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x1e037c
	enum class EAttachmentRule *ca2fce53c9(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*ca2fce53c9 // Final|Native|Public|BlueprintCallable // @ game+0x639564c
	void *2f98c34a3e(); // Function Engine.Actor.*2f98c34a3e // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638c6d8
	struct AActor* *8ab522db39(); // Function Engine.Actor.*8ab522db39 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e194
	void *2cfa65e375(); // Function Engine.Actor.*2cfa65e375 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638bb48
	void *7af955f165(); // Function Engine.Actor.*7af955f165 // Native|Public|BlueprintCallable // @ game+0x639af28
	void *77574d4d00(float Tolerance); // Function Engine.Actor.*77574d4d00 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63a61e0
	struct UClass* *3d2b57891f(); // Function Engine.Actor.*3d2b57891f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d8a4
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xb722bc
	void *6d495b918e(); // Function Engine.Actor.*6d495b918e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e230
	void K2_SetActorLocation(bool bSweep, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6396ef4
	void GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xad04f0
	void ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x1e037c
	void SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x55d7234
	void ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FHitResult K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63976c0
	void *96888c26b2(); // Function Engine.Actor.*96888c26b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c694
	void *298b7db98d(); // Function Engine.Actor.*298b7db98d // Final|Native|Public|BlueprintCallable // @ game+0x6395ca4
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xb9cfd4
	void *b0466cb89a(); // Function Engine.Actor.*b0466cb89a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638be48
	void *4e14239fe2(struct FVector OutLocation); // Function Engine.Actor.*4e14239fe2 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bb70
	void *76b33f89d4(struct AActor* OtherActor); // Function Engine.Actor.*76b33f89d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391bb8
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FKey *a84ae826d7(); // Function Engine.Actor.*a84ae826d7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638f40c
	void *1f7d6b60c4(); // Function Engine.Actor.*1f7d6b60c4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c054
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x1e037c
	void K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63970d8
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x1e037c
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x638975c
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *553025a5b6(); // Function Engine.Actor.*553025a5b6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fdec
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *3fb2f52d1d(); // Function Engine.Actor.*3fb2f52d1d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638ee30
	void *5c10316bc8(); // Function Engine.Actor.*5c10316bc8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392a18
	void *12680bdeab(); // Function Engine.Actor.*12680bdeab // Native|Public|BlueprintCallable // @ game+0x63a5b00
	void *094169766b(); // Function Engine.Actor.*094169766b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fd3c
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *a80dd65dbf(); // Function Engine.Actor.*a80dd65dbf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392980
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FHitResult K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6397310
	void *7664b363a1(); // Function Engine.Actor.*7664b363a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390e60
	struct TArray<struct AActor*> *f77af040ad(); // Function Engine.Actor.*f77af040ad // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638c474
	void K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x638b7a0
	void *28809cb5e5(); // Function Engine.Actor.*28809cb5e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bfe0
	void *d21a3baa7f(); // Function Engine.Actor.*d21a3baa7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390f6c
	struct FName K2_AttachRootComponentTo(enum class EAttachLocation AttachLocationType); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x63951cc
	void *3a00f3bb48(); // Function Engine.Actor.*3a00f3bb48 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63916f8
	void *f2d13d9497(); // Function Engine.Actor.*f2d13d9497 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638c670
	struct UObject* AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6e6d18
	void *6f6713dfba(struct AActor* OtherActor); // Function Engine.Actor.*6f6713dfba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638eed0
	struct UMaterialInterface* *ea2a94b7da(); // Function Engine.Actor.*ea2a94b7da // Final|Native|Public|BlueprintCallable // @ game+0x6399164
	struct UClass* *2bbda76e95(); // Function Engine.Actor.*2bbda76e95 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638d99c
	struct AActor* ReceivePointDamage(struct U*498af98d1d* DamageType, struct FVector HitNormal); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x1e037c
	void GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6390cd0
	void *3b635a9905(); // Function Engine.Actor.*3b635a9905 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x639e190
	enum class EAttachmentRule *e13072354b(enum class EAttachmentRule ScaleRule); // Function Engine.Actor.*e13072354b // Final|Native|Public|BlueprintCallable // @ game+0x1fe714
	void *4aadbb23a5(); // Function Engine.Actor.*4aadbb23a5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390f90
	struct AActor* *82b3653b7b(); // Function Engine.Actor.*82b3653b7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392304
	bool K2_AddActorWorldRotation(struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393e78
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x639629c
	struct FVector GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638b9a0
	void *d30428cd54(); // Function Engine.Actor.*d30428cd54 // Final|Native|Public|BlueprintCallable // @ game+0x63a3ba8
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x236e50
	void *7fc2785714(); // Function Engine.Actor.*7fc2785714 // Native|Public|BlueprintCallable // @ game+0x639ae00
	void *8df9beeffc(); // Function Engine.Actor.*8df9beeffc // Native|Public|BlueprintCallable // @ game+0x63a3640
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x1e037c
	bool K2_AddActorWorldOffset(struct FHitResult SweepHitResult); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6393ca0
	void *2ad230fb6c(); // Function Engine.Actor.*2ad230fb6c // Final|Native|Public|BlueprintCallable // @ game+0x639e364
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x3fabf8
	bool K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63978ec
	void *b01fc0cf78(); // Function Engine.Actor.*b01fc0cf78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638bc7c
	void *9ffc398f85(); // Function Engine.Actor.*9ffc398f85 // Native|Public|BlueprintCallable // @ game+0x6384a4c
	void *9fc33c71b8(); // Function Engine.Actor.*9fc33c71b8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392964
	struct AController* ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1e037c
	void *34c6511ade(); // Function Engine.Actor.*34c6511ade // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638fd24
	void ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x1e037c
	struct FKey *8ff8fb0472(); // Function Engine.Actor.*8ff8fb0472 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638fb1c
};

// Class Engine.GameStateBase
// Size: 0x430 (Inherited: 0x3f0)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x3f0(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x3f8(0x08)
	struct UClass* SpectatorClass; // 0x400(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x408(0x10)
	bool *b3165990bb; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	float *0f4cbda7e4; // 0x41c(0x04)
	float *beee9616a2; // 0x420(0x04)
	float *72d0135ba7; // 0x424(0x04)
	char pad_428[0x8]; // 0x428(0x08)

	void *3a712c20b7(); // Function Engine.GameStateBase.*3a712c20b7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63915f8
	void *a2a2e5aa70(); // Function Engine.GameStateBase.*a2a2e5aa70 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392560
	void *16cf218094(); // Function Engine.GameStateBase.*16cf218094 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x56cae88
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xb19170
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0x89ae58
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0xc09b1c
	struct AController* *a8f929f84f(); // Function Engine.GameStateBase.*a8f929f84f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6391550
	void *32d9e0fcf6(); // Function Engine.GameStateBase.*32d9e0fcf6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5645f18
	void *c133fde381(); // Function Engine.GameStateBase.*c133fde381 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6392510
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0x566dd88
	void *3712aecb1b(); // Function Engine.GameStateBase.*3712aecb1b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x639036c
};

// Class Engine.GameState
// Size: 0x450 (Inherited: 0x430)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x430(0x08)
	struct FName PreviousMatchState; // 0x438(0x08)
	int32 ElapsedTime; // 0x440(0x04)
	char pad_444[0xc]; // 0x444(0x0c)

	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0x5f1718
	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x56127e8
};

// Class Engine.BoxComponent
// Size: 0xa30 (Inherited: 0xa20)
struct UBoxComponent : U*9de72ef8ed {
	struct FVector BoxExtent; // 0xa18(0x0c)
	char pad_A2C[0x4]; // 0xa2c(0x04)

	void *98e9dedda9(); // Function Engine.BoxComponent.*98e9dedda9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63cbbb0
	void *0f9344886a(); // Function Engine.BoxComponent.*0f9344886a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63cdf18
	struct FVector *47e32f31b3(); // Function Engine.BoxComponent.*47e32f31b3 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63e95b8
};

// Class Engine.ProjectileMovementComponent
// Size: 0x300 (Inherited: 0x240)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x238(0x04)
	float MaxSpeed; // 0x23c(0x04)
	char bRotationFollowsVelocity : 1; // 0x240(0x01)
	char bShouldBounce : 1; // 0x240(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x240(0x01)
	char bForceSubStepping : 1; // 0x240(0x01)
	char bSimulationEnabled : 1; // 0x240(0x01)
	char bSweepCollision : 1; // 0x240(0x01)
	char bIsHomingProjectile : 1; // 0x240(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x240(0x01)
	char bIsSliding : 1; // 0x241(0x01)
	char bInterpMovement : 1; // 0x241(0x01)
	char bInterpRotation : 1; // 0x241(0x01)
	float PreviousHitTime; // 0x244(0x04)
	struct FVector PreviousHitNormal; // 0x248(0x0c)
	float ProjectileGravityScale; // 0x254(0x04)
	float *e4135d57da; // 0x258(0x04)
	float Bounciness; // 0x25c(0x04)
	float Friction; // 0x260(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x264(0x04)
	float MinFrictionFraction; // 0x268(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x270(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x280(0x10)
	float HomingAccelerationMagnitude; // 0x290(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x294(0x08)
	float MaxSimulationTimeStep; // 0x29c(0x04)
	int32 MaxSimulationIterations; // 0x2a0(0x04)
	int32 BounceAdditionalIterations; // 0x2a4(0x04)
	float InterpLocationTime; // 0x2a8(0x04)
	float InterpRotationTime; // 0x2ac(0x04)
	float InterpLocationMaxLagDistance; // 0x2b0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2b4(0x04)
	char pad_2B9[0x47]; // 0x2b9(0x47)

	void *831dfc768a(); // Function Engine.ProjectileMovementComponent.*831dfc768a // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63f5a20
	void OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x1e037c
	void *00e85c5c6c(); // Function Engine.ProjectileMovementComponent.*00e85c5c6c // Native|Public|BlueprintCallable // @ game+0x63eed60
	void StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x63fd448
	void *623c7ebb72(); // Function Engine.ProjectileMovementComponent.*623c7ebb72 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d2ad8
	void *09e7043d49(struct FVector NewLocation); // Function Engine.ProjectileMovementComponent.*09e7043d49 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63dd12c
	void *b58938a410(); // Function Engine.ProjectileMovementComponent.*b58938a410 // Native|Public|BlueprintCallable // @ game+0x564d468
	struct FVector LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63d5510
	void *6da4a97058(); // Function Engine.ProjectileMovementComponent.*6da4a97058 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63d203c
	void OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x1e037c
};

// Class Engine.CurveBase
// Size: 0x30 (Inherited: 0x28)
struct UCurveBase : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Engine.GameUserSettings
// Size: 0x110 (Inherited: 0x28)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x28(0x01)
	bool bUseDynamicResolution; // 0x29(0x01)
	char pad_2A[0x4e]; // 0x2a(0x4e)
	uint32 ResolutionSizeX; // 0x78(0x04)
	uint32 ResolutionSizeY; // 0x7c(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x80(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x84(0x04)
	int32 WindowPosX; // 0x88(0x04)
	int32 WindowPosY; // 0x8c(0x04)
	int32 FullscreenMode; // 0x90(0x04)
	int32 LastConfirmedFullscreenMode; // 0x94(0x04)
	int32 PreferredFullscreenMode; // 0x98(0x04)
	uint32 Version; // 0x9c(0x04)
	int32 AudioQualityLevel; // 0xa0(0x04)
	float FrameRateLimit; // 0xa4(0x04)
	char pad_A8[0x4]; // 0xa8(0x04)
	int32 DesiredScreenWidth; // 0xac(0x04)
	bool bUseDesiredScreenHeight; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	int32 DesiredScreenHeight; // 0xb4(0x04)
	float LastRecommendedScreenWidth; // 0xb8(0x04)
	float LastRecommendedScreenHeight; // 0xbc(0x04)
	float LastCPUBenchmarkResult; // 0xc0(0x04)
	float LastGPUBenchmarkResult; // 0xc4(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xc8(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xd8(0x10)
	float LastGPUBenchmarkMultiplier; // 0xe8(0x04)
	bool bUseHDRDisplayOutput; // 0xec(0x01)
	char pad_ED[0x3]; // 0xed(0x03)
	int32 HDRDisplayOutputNits; // 0xf0(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xf4(0x01)
	bool bGPUDebug; // 0xf5(0x01)
	char pad_F6[0x2]; // 0xf6(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0xf8(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x100(0x10)

	void *ff165ed312(); // Function Engine.GameUserSettings.*ff165ed312 // Final|Native|Public|BlueprintCallable // @ game+0x6419880
	void *f99fd71384(); // Function Engine.GameUserSettings.*f99fd71384 // Native|Public|BlueprintCallable // @ game+0x6411ff8
	int32 GetResolutionScaleInformation(float CurrentScaleNormalized); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6412108
	void *b90135664f(); // Function Engine.GameUserSettings.*b90135664f // Native|Public|BlueprintCallable // @ game+0x6410560
	void *d578d2b56d(); // Function Engine.GameUserSettings.*d578d2b56d // Final|Native|Public|BlueprintCallable // @ game+0x641961c
	void *aa506a5c7e(); // Function Engine.GameUserSettings.*aa506a5c7e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64124fc
	void *4e377c31c3(); // Function Engine.GameUserSettings.*4e377c31c3 // Final|Native|Public|BlueprintCallable // @ game+0x64197e4
	void *12bb8cc58b(); // Function Engine.GameUserSettings.*12bb8cc58b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x641349c
	void *1b246fdda3(); // Function Engine.GameUserSettings.*1b246fdda3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6411038
	void *e712800bb5(); // Function Engine.GameUserSettings.*e712800bb5 // Native|Public|BlueprintCallable // @ game+0x5e38004
	void *005b909a0a(); // Function Engine.GameUserSettings.*005b909a0a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x641b3cc
	void *8d0b38839e(); // Function Engine.GameUserSettings.*8d0b38839e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6412fc8
	void *e8aec7750c(); // Function Engine.GameUserSettings.*e8aec7750c // Final|Native|Public|BlueprintCallable // @ game+0x6419590
	void *e6f6ac1408(); // Function Engine.GameUserSettings.*e6f6ac1408 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64124e0
	void *7028637d24(); // Function Engine.GameUserSettings.*7028637d24 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64134d4
	void *694048f68a(); // Function Engine.GameUserSettings.*694048f68a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6412c84
	void *34010b7d81(); // Function Engine.GameUserSettings.*34010b7d81 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x641058c
	void *e79626d820(); // Function Engine.GameUserSettings.*e79626d820 // Final|Native|Public|BlueprintCallable // @ game+0x6419918
	void *5bd816f8fd(); // Function Engine.GameUserSettings.*5bd816f8fd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x641105c
	void *8dfb8f9e1f(); // Function Engine.GameUserSettings.*8dfb8f9e1f // Native|Public|BlueprintCallable // @ game+0x6419b80
	void *e4cadefc91(); // Function Engine.GameUserSettings.*e4cadefc91 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x64105a4
	void *0919531070(); // Function Engine.GameUserSettings.*0919531070 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6410b60
	void *8d4e34d1cd(); // Function Engine.GameUserSettings.*8d4e34d1cd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6413a20
	void *037ccbd6e4(); // Function Engine.GameUserSettings.*037ccbd6e4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x641155c
	void *0f8563b766(); // Function Engine.GameUserSettings.*0f8563b766 // Final|Native|Public|BlueprintCallable // @ game+0x6418eb4
	void *8816de7f70(); // Function Engine.GameUserSettings.*8816de7f70 // Final|Native|Public|BlueprintCallable // @ game+0x6408150
	void *fcb1fc9a28(); // Function Engine.GameUserSettings.*fcb1fc9a28 // Final|Native|Public|BlueprintCallable // @ game+0x6419ca0
	void *a5f557ab6c(); // Function Engine.GameUserSettings.*a5f557ab6c // Final|Native|Public|BlueprintCallable // @ game+0x641a44c
	void *eea34f3e4c(int32 WorkScale); // Function Engine.GameUserSettings.*eea34f3e4c // Native|Public|BlueprintCallable // @ game+0x6419420
	void *f589301822(); // Function Engine.GameUserSettings.*f589301822 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6412fdc
	void *9df0b9d539(); // Function Engine.GameUserSettings.*9df0b9d539 // Final|Native|Public|BlueprintCallable // @ game+0x640bc7c
	void *881d90f45c(); // Function Engine.GameUserSettings.*881d90f45c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6410b48
	void *9305fec020(); // Function Engine.GameUserSettings.*9305fec020 // Final|Native|Public|BlueprintCallable // @ game+0x641a3a8
	void *0f1c6cd359(); // Function Engine.GameUserSettings.*0f1c6cd359 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x8fd708
	void *b4854cc3a2(); // Function Engine.GameUserSettings.*b4854cc3a2 // Final|Native|Public|BlueprintCallable // @ game+0x6419de4
	void *9f9b7968e7(); // Function Engine.GameUserSettings.*9f9b7968e7 // Native|Public|BlueprintCallable // @ game+0xa24364
	void *27602f449d(); // Function Engine.GameUserSettings.*27602f449d // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6419ff0
	void *0d72aba354(); // Function Engine.GameUserSettings.*0d72aba354 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64139b8
	void *929ac2c34a(float CurrentScaleValue); // Function Engine.GameUserSettings.*929ac2c34a // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6412300
	void LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x640e5dc
	void *37684c88cb(); // Function Engine.GameUserSettings.*37684c88cb // Native|Public|BlueprintCallable // @ game+0x641a434
	void *35535da485(); // Function Engine.GameUserSettings.*35535da485 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64134f8
	void *83a6aa3d9c(); // Function Engine.GameUserSettings.*83a6aa3d9c // Final|Native|Public|BlueprintCallable // @ game+0x565163c
	void *a40f28e95a(); // Function Engine.GameUserSettings.*a40f28e95a // Final|Native|Static|Public|BlueprintCallable // @ game+0x6410c60
	void SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x6419d50
	void *461f940e49(); // Function Engine.GameUserSettings.*461f940e49 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x6410540
	void *b114a91f6a(); // Function Engine.GameUserSettings.*b114a91f6a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64100e4
	void *15262d6763(); // Function Engine.GameUserSettings.*15262d6763 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64134c0
	void *1a1197a006(); // Function Engine.GameUserSettings.*1a1197a006 // Final|Native|Static|Public|BlueprintCallable // @ game+0x55fa508
	void *bbfc2c9965(); // Function Engine.GameUserSettings.*bbfc2c9965 // Final|Native|Public|BlueprintCallable // @ game+0x641a5c8
	void *483de8d97e(); // Function Engine.GameUserSettings.*483de8d97e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6410b34
	void *a2b82d5ffa(); // Function Engine.GameUserSettings.*a2b82d5ffa // Native|Public|BlueprintCallable // @ game+0x6408138
	void *8f07a62fc0(); // Function Engine.GameUserSettings.*8f07a62fc0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64100f8
	void *a0cc2f9b1f(); // Function Engine.GameUserSettings.*a0cc2f9b1f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x64139fc
	void *f17918e2e4(); // Function Engine.GameUserSettings.*f17918e2e4 // Final|Native|Public|BlueprintCallable // @ game+0x6419c14
	void *791bb98775(); // Function Engine.GameUserSettings.*791bb98775 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x640b838
	void *edc46fa1a0(); // Function Engine.GameUserSettings.*edc46fa1a0 // Final|Native|Public|BlueprintCallable // @ game+0x64196a8
	void *a0bcd9f088(); // Function Engine.GameUserSettings.*a0bcd9f088 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6411ad0
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x567b5e0
	void *d99fdc2874(); // Function Engine.GameUserSettings.*d99fdc2874 // Final|Native|Public|BlueprintCallable // @ game+0x641a07c
	void *ea56882abd(); // Function Engine.GameUserSettings.*ea56882abd // Final|Native|Public|BlueprintCallable // @ game+0x6419758
	void *20ab35464e(); // Function Engine.GameUserSettings.*20ab35464e // Native|Public|BlueprintCallable // @ game+0x5657188
	bool *714d4f65b8(); // Function Engine.GameUserSettings.*714d4f65b8 // Final|Native|Public|BlueprintCallable // @ game+0x640e960
	void *d685dce1b6(); // Function Engine.GameUserSettings.*d685dce1b6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6411ae4
	void *f390c26976(); // Function Engine.GameUserSettings.*f390c26976 // Native|Public|BlueprintCallable // @ game+0x56570d8
	void *922b274ba7(); // Function Engine.GameUserSettings.*922b274ba7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6410324
};

// Class Engine.GameInstance
// Size: 0x1e0 (Inherited: 0x28)
struct UGameInstance : UObject {
	char pad_28[0x20]; // 0x28(0x20)
	struct U*6653cc84aa* *6653cc84aa; // 0x48(0x08)
	char pad_50[0x98]; // 0x50(0x98)
	struct U*41ff50be2e* *41ff50be2e; // 0xe8(0x08)
	char pad_F0[0x8]; // 0xf0(0x08)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0xf8(0x10)
	char pad_108[0xd8]; // 0x108(0xd8)

	void HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x1e037c
	enum class ENetworkFailure HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x1e037c
	void DebugCreatePlayer(); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x63bb3f8
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x1e037c
	void DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x63bb48c
};

// Class Engine.TriggerBase
// Size: 0x3f8 (Inherited: 0x3f0)
struct ATriggerBase : AActor {
	struct U*9de72ef8ed* CollisionComponent; // 0x3f0(0x08)
};

// Class Engine.TriggerBox
// Size: 0x3f8 (Inherited: 0x3f8)
struct ATriggerBox : ATriggerBase {
	struct U*9de72ef8ed* CollisionComponent; // 0x3f0(0x08)
};

// Class Engine.CapsuleComponent
// Size: 0xa30 (Inherited: 0xa20)
struct UCapsuleComponent : U*9de72ef8ed {
	float CapsuleHalfHeight; // 0xa18(0x04)
	float CapsuleRadius; // 0xa1c(0x04)
	float CapsuleHeight; // 0xa20(0x04)
	char pad_A2C[0x4]; // 0xa2c(0x04)

	void *5e7387deea(); // Function Engine.CapsuleComponent.*5e7387deea // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x63cbcf8
	void *6c17800325(); // Function Engine.CapsuleComponent.*6c17800325 // Native|Public|BlueprintCallable // @ game+0x63a0078
	void *15572a149a(); // Function Engine.CapsuleComponent.*15572a149a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cdf7c
	void *baff305a0b(); // Function Engine.CapsuleComponent.*baff305a0b // Native|Public|BlueprintCallable // @ game+0x63a010c
	void *00f4749d00(); // Function Engine.CapsuleComponent.*00f4749d00 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cbcac
	void *4ecc54f469(); // Function Engine.CapsuleComponent.*4ecc54f469 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cdf58
	float *01db1cc2f0(); // Function Engine.CapsuleComponent.*01db1cc2f0 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x63ce09c
	void *f7e693ed7e(); // Function Engine.CapsuleComponent.*f7e693ed7e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cbc58
	void *c03bd11c98(); // Function Engine.CapsuleComponent.*c03bd11c98 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cbc0c
	void *6b957cfb76(); // Function Engine.CapsuleComponent.*6b957cfb76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cdf40
	float *038749a2fe(); // Function Engine.CapsuleComponent.*038749a2fe // Final|Native|Public|BlueprintCallable // @ game+0x63e97cc
	void *58f998cca1(); // Function Engine.CapsuleComponent.*58f998cca1 // Native|Public|BlueprintCallable // @ game+0x63a01a4
	void *4fba3aec1b(float InHalfHeight); // Function Engine.CapsuleComponent.*4fba3aec1b // Final|Native|Public|BlueprintCallable // @ game+0x63e9a50
	float *fed358e535(); // Function Engine.CapsuleComponent.*fed358e535 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x63cbe2c
	float *2e030b6a4a(); // Function Engine.CapsuleComponent.*2e030b6a4a // Final|Native|Public|BlueprintCallable // @ game+0x63e9964
	void *7f740f17f8(float OutRadius); // Function Engine.CapsuleComponent.*7f740f17f8 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x63cdf94
	void *b260e3db57(); // Function Engine.CapsuleComponent.*b260e3db57 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63cc060
};

// Class Engine.PhysicsVolume
// Size: 0x440 (Inherited: 0x428)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x428(0x04)
	int32 Priority; // 0x42c(0x04)
	float FluidFriction; // 0x430(0x04)
	char bWaterVolume : 1; // 0x434(0x01)
	char bPhysicsOnContact : 1; // 0x434(0x01)
	char pad_434_2 : 6; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	bool *1ffd8a4414; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x7f0 (Inherited: 0x7a0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7a0(0x01)
	char *a68cb7b46b : 1; // 0x7a0(0x01)
	char pad_7A0_2 : 6; // 0x7a0(0x01)
	char pad_7A1[0x7]; // 0x7a1(0x07)
	struct U*7516137630* *fbb1cd85af; // 0x7a8(0x08)
	char pad_7B0[0x20]; // 0x7b0(0x20)
	float SpeedScale; // 0x7d0(0x04)
	float InitialMaxSpeed; // 0x7d4(0x04)
	float InitialAccel; // 0x7d8(0x04)
	float InitialDecel; // 0x7dc(0x04)
	char pad_7E0[0x10]; // 0x7e0(0x10)

	void *d4e8039368(); // Function Engine.DebugCameraController.*d4e8039368 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63917b0
	struct FVector ReceiveOnActorSelected(); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x1e037c
	void *5048ac03eb(); // Function Engine.DebugCameraController.*5048ac03eb // Final|Native|Public|BlueprintCallable // @ game+0x63a2b20
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x63a4d68
	void *2a0c85c652(); // Function Engine.DebugCameraController.*2a0c85c652 // Final|Native|Public|BlueprintCallable // @ game+0x63a5b68
};

// Class Engine.Channel
// Size: 0x68 (Inherited: 0x28)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x28(0x08)
	char pad_30[0x38]; // 0x30(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x68)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x68(0x08)
	char pad_70[0x300]; // 0x70(0x300)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	struct AActor* Actor; // 0x68(0x08)
	char pad_378[0x18]; // 0x378(0x18)
};

// Class Engine.NavigationObjectBase
// Size: 0x418 (Inherited: 0x3f0)
struct ANavigationObjectBase : AActor {
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x3f8(0x08)
	struct UBillboardComponent* *e995b1374d; // 0x400(0x08)
	struct UBillboardComponent* *3a07fdffe9; // 0x408(0x08)
	char *13444ae17a : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
};

// Class Engine.PlayerStart
// Size: 0x420 (Inherited: 0x418)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x418(0x08)
};

// Class Engine.CheatManager
// Size: 0x78 (Inherited: 0x28)
struct UCheatManager : UObject {
	struct ADebugCameraController* *fd70a6f96b; // 0x28(0x08)
	struct UClass* DebugCameraControllerClass; // 0x30(0x08)
	char pad_38[0x40]; // 0x38(0x40)

	void StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x641afb8
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x6416b00
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x6413430
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x640ff3c
	void CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x640b8fc
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x641b3f4
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x640e78c
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x6418508
	void StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x641b04c
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x567b560
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x3fabf8
	void ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x641ca18
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x63a5b00
	void Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x641aa20
	void DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x5d548ac
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x6418718
	void Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x641b308
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x640e7a4
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x641c1b8
	void DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x640e450
	void OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6417f88
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0x56570d8
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x567b5f8
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x641c1a0
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0x640e2d8
	float BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x6409d30
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x640e5c4
	void *9806f2220c(); // Function Engine.CheatManager.*9806f2220c // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6419544
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x6419ad4
	void *1dc29b1854(); // Function Engine.CheatManager.*1dc29b1854 // Native|Protected|BlueprintCallable // @ game+0x640e854
	void DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x640e23c
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0x640e438
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x640e7bc
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1e037c
	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x567b5e0
	void ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x640b860
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x567b610
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x567b5a0
	void ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x641c8f0
	void FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x640ff54
	struct FString BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x6409f4c
	void DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x640e530
	void BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x6409c6c
	void DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x640e3a0
	void DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x640e2f0
	void SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x6419ae8
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x641a654
	void *9548b29d4b(); // Function Engine.CheatManager.*9548b29d4b // Native|Protected|BlueprintCallable // @ game+0xc0bd74
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x55fc708
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x640e388
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x1e037c
	void ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x641c984
};

// Class Engine.*1b1f1e4584
// Size: 0xa10 (Inherited: 0xa00)
struct U*1b1f1e4584 : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0xa00(0x10)
};

// Class Engine.NavArea
// Size: 0x40 (Inherited: 0x28)
struct UNavArea : UObject {
	float DefaultCost; // 0x28(0x04)
	float FixedAreaEnteringCost; // 0x2c(0x04)
	struct FColor DrawColor; // 0x30(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x34(0x04)
	char bSupportsAgent0 : 1; // 0x38(0x01)
	char bSupportsAgent1 : 1; // 0x38(0x01)
	char bSupportsAgent2 : 1; // 0x38(0x01)
	char bSupportsAgent3 : 1; // 0x38(0x01)
	char bSupportsAgent4 : 1; // 0x38(0x01)
	char bSupportsAgent5 : 1; // 0x38(0x01)
	char bSupportsAgent6 : 1; // 0x38(0x01)
	char bSupportsAgent7 : 1; // 0x38(0x01)
	char bSupportsAgent8 : 1; // 0x39(0x01)
	char bSupportsAgent9 : 1; // 0x39(0x01)
	char bSupportsAgent10 : 1; // 0x39(0x01)
	char bSupportsAgent11 : 1; // 0x39(0x01)
	char bSupportsAgent12 : 1; // 0x39(0x01)
	char bSupportsAgent13 : 1; // 0x39(0x01)
	char bSupportsAgent14 : 1; // 0x39(0x01)
	char bSupportsAgent15 : 1; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x3f8 (Inherited: 0x3f0)
struct ALevelScriptActor : AActor {
	char *9fe0b32409 : 1; // 0x3f0(0x01)
	char pad_3F0_1 : 7; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)

	void *930cb558f2(bool bCinematicMode, bool bAffectsHUD); // Function Engine.LevelScriptActor.*930cb558f2 // Native|Public|BlueprintCallable // @ game+0xab04b4
	struct FIntVector WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x1e037c
	struct FName *60b99c5d37(); // Function Engine.LevelScriptActor.*60b99c5d37 // Native|Public|BlueprintCallable // @ game+0x5681534
	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1e037c
};

// Class Engine.ChildActorComponent
// Size: 0x500 (Inherited: 0x4d0)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x4d0(0x08)
	struct AActor* ChildActor; // 0x4d8(0x08)
	struct AActor* ChildActorTemplate; // 0x4e0(0x08)
	char pad_4E8[0x18]; // 0x4e8(0x18)

	void *d9cb75fbb5(); // Function Engine.ChildActorComponent.*d9cb75fbb5 // Final|Native|Public|BlueprintCallable // @ game+0x639fd60
};

// Class Engine.CameraComponent
// Size: 0xac0 (Inherited: 0x4d0)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x4d0(0x04)
	float OrthoWidth; // 0x4d4(0x04)
	float OrthoNearClipPlane; // 0x4d8(0x04)
	float OrthoFarClipPlane; // 0x4dc(0x04)
	float AspectRatio; // 0x4e0(0x04)
	char bConstrainAspectRatio : 1; // 0x4e4(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x4e4(0x01)
	char bLockToHmd : 1; // 0x4e4(0x01)
	char bUsePawnControlRotation : 1; // 0x4e4(0x01)
	char pad_4E4_4 : 4; // 0x4e4(0x01)
	char pad_4E5[0x3]; // 0x4e5(0x03)
	enum class ECameraProjectionMode ProjectionMode; // 0x4e8(0x01)
	char pad_4E9[0x3]; // 0x4e9(0x03)
	float PostProcessBlendWeight; // 0x4ec(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x4f0(0x570)
	char pad_A60[0x58]; // 0xa60(0x58)
	char bUseControllerViewRotation : 1; // 0xab8(0x01)
	char pad_AB8_1 : 7; // 0xab8(0x01)
	char pad_AB9[0x7]; // 0xab9(0x07)

	void *8a619a71fe(); // Function Engine.CameraComponent.*8a619a71fe // Final|Native|Public|BlueprintCallable // @ game+0x63e804c
	void *79844d1a03(); // Function Engine.CameraComponent.*79844d1a03 // Final|Native|Public|BlueprintCallable // @ game+0x63eeba0
	void *334e73d773(); // Function Engine.CameraComponent.*334e73d773 // Final|Native|Public|BlueprintCallable // @ game+0x63f11bc
	void *ecceb55aba(); // Function Engine.CameraComponent.*ecceb55aba // Final|Native|Public|BlueprintCallable // @ game+0x63ab348
	void *5c14709928(); // Function Engine.CameraComponent.*5c14709928 // Final|Native|Public|BlueprintCallable // @ game+0x63f1c64
	void *05dd1e25b7(); // Function Engine.CameraComponent.*05dd1e25b7 // Final|Native|Public|BlueprintCallable // @ game+0x63f1ff0
	void *c77d39d54d(); // Function Engine.CameraComponent.*c77d39d54d // Final|Native|Public|BlueprintCallable // @ game+0x63ea800
	void *cb0966e862(); // Function Engine.CameraComponent.*cb0966e862 // Final|Native|Public|BlueprintCallable // @ game+0x63ece54
	void *06060d8a3e(); // Function Engine.CameraComponent.*06060d8a3e // Final|Native|Public|BlueprintCallable // @ game+0x63f1124
	float *f1c8bde037(); // Function Engine.CameraComponent.*f1c8bde037 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x63c42c8
	void *cb5cdd69b3(); // Function Engine.CameraComponent.*cb5cdd69b3 // Final|Native|Public|BlueprintCallable // @ game+0x63f54d8
};

// Class Engine.Engine
// Size: 0xf30 (Inherited: 0x28)
struct UEngine : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct UFont* TinyFont; // 0x30(0x08)
	struct FStringAssetReference TinyFontName; // 0x38(0x10)
	struct UFont* SmallFont; // 0x48(0x08)
	struct FStringAssetReference SmallFontName; // 0x50(0x10)
	struct UFont* *b2fb6d5918; // 0x60(0x08)
	struct FStringAssetReference MediumFontName; // 0x68(0x10)
	struct UFont* LargeFont; // 0x78(0x08)
	struct FStringAssetReference LargeFontName; // 0x80(0x10)
	struct UFont* *17d1a5c92f; // 0x90(0x08)
	struct FStringAssetReference SubtitleFontName; // 0x98(0x10)
	struct TArray<struct UFont*> *dddf4c9088; // 0xa8(0x10)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0xb8(0x10)
	char bSubtitlesForcedOff : 1; // 0xc8(0x01)
	char pad_C8_1 : 7; // 0xc8(0x01)
	char pad_C9[0x3]; // 0xc9(0x03)
	float MinDesiredFrameRate; // 0xcc(0x04)
	struct TArray<struct F*305cf84e03> ActiveStructRedirects; // 0xd0(0x10)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0xe0(0x10)
	struct TArray<struct F*588c0e2b3a> ActiveGameNameRedirects; // 0xf0(0x10)
	struct UTexture* WeightMapPlaceholderTexture; // 0x100(0x08)
	struct UMaterial* RemoveSurfaceMaterial; // 0x108(0x08)
	struct FStringClassReference GameSingletonClassName; // 0x110(0x10)
	float *b1796a28c0; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct FString LightingTexelDensityName; // 0x128(0x10)
	struct FStringAssetReference LightMapDensityTextureName; // 0x138(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x148(0x10)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0x158(0x10)
	char bCanBlueprintsTickByDefault : 1; // 0x168(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x168(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x168(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x168(0x01)
	char pad_168_4 : 1; // 0x168(0x01)
	char bSmoothFrameRate : 1; // 0x168(0x01)
	char bUseFixedFrameRate : 1; // 0x168(0x01)
	char pad_168_7 : 1; // 0x168(0x01)
	char pad_169[0x7]; // 0x169(0x07)
	struct UTexture2D* MiniFontTexture; // 0x170(0x08)
	struct FColor *1786a736fd; // 0x178(0x04)
	char pad_17C[0x4]; // 0x17c(0x04)
	struct UClass* *6618489028; // 0x180(0x08)
	struct FStringClassReference GameUserSettingsClassName; // 0x188(0x10)
	struct TArray<struct FString> *4fa0bda95b; // 0x198(0x10)
	char pad_1A8[0x18]; // 0x1a8(0x18)
	struct FStringClassReference LocalPlayerClassName; // 0x1c0(0x10)
	struct FFloatRange SmoothedFrameRateRange; // 0x1d0(0x10)
	struct F*eab1f0d427 PhysicErrorCorrection; // 0x1e0(0x1c)
	int32 *3fd60cfe7a; // 0x1fc(0x04)
	struct TArray<struct F*96501223f2> ActiveClassRedirects; // 0x200(0x10)
	struct UMaterialInstanceDynamic* *41801eae84; // 0x210(0x08)
	struct UMaterial* *fdd0f56f71; // 0x218(0x08)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x220(0x10)
	struct FStringClassReference WorldSettingsClassName; // 0x230(0x10)
	struct UMaterialInstanceDynamic* *419956b350; // 0x240(0x08)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x248(0x10)
	struct UMaterial* *158ef2b728; // 0x258(0x08)
	float CameraTranslationThreshold; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct FStringAssetReference DefaultPhysMaterialName; // 0x268(0x10)
	struct UTexture* DefaultDiffuseTexture; // 0x278(0x08)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x280(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x290(0x10)
	struct FString LevelColorationUnlitMaterialName; // 0x2a0(0x10)
	struct UTexture2D* *3354aa5029; // 0x2b0(0x08)
	struct FStringAssetReference ArrowMaterialName; // 0x2b8(0x10)
	char bRenderLightMapDensityGrayscale : 1; // 0x2c8(0x01)
	char pad_2C8_1 : 7; // 0x2c8(0x01)
	char pad_2C9[0x3]; // 0x2c9(0x03)
	int32 *4a63163b75; // 0x2cc(0x04)
	struct UClass* *cfd562edce; // 0x2d0(0x08)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0x2d8(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x2e8(0x10)
	struct FColor *18889b23a4; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct TArray<struct F*93620d28f2> ActivePluginRedirects; // 0x300(0x10)
	struct FStringClassReference AssetManagerClassName; // 0x310(0x10)
	struct UMaterialInstanceDynamic* *882cf2b119; // 0x320(0x08)
	struct FStringAssetReference DefaultBokehTextureName; // 0x328(0x10)
	struct FStringClassReference NavigationSystemClassName; // 0x338(0x10)
	struct UClass* *e7983e4706; // 0x348(0x08)
	struct UTexture2D* *d8417c9941; // 0x350(0x08)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x358(0x10)
	struct UClass* *920ed2f2c5; // 0x368(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x370(0x10)
	struct UMaterial* *b2d86d5e63; // 0x380(0x08)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x388(0x08)
	float DisplayGamma; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	struct FString *9a7e172902; // 0x398(0x10)
	struct UClass* *db10b3ff9c; // 0x3a8(0x08)
	struct UTextureCube* *c142ea92cf; // 0x3b0(0x08)
	struct UClass* *7ebef4665a; // 0x3b8(0x08)
	struct UMaterial* *d4696a6c50; // 0x3c0(0x08)
	float MaxPixelShaderAdditiveComplexityCount; // 0x3c8(0x04)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct FString ShadedLevelColorationLitMaterialName; // 0x3d0(0x10)
	struct FString LevelColorationLitMaterialName; // 0x3e0(0x10)
	char bHardwareSurveyEnabled : 1; // 0x3f0(0x01)
	char pad_3F0_1 : 7; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	struct FColor *c79f672cb1; // 0x3f4(0x04)
	struct FColor *701230078d; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct UTexture2D* *cdaf3acb6f; // 0x400(0x08)
	struct UClass* *ec063d291c; // 0x408(0x08)
	struct UMaterial* *13a610002f; // 0x410(0x08)
	struct FColor *4c5bc6371e; // 0x418(0x04)
	float MaxLightMapDensity; // 0x41c(0x04)
	struct UGameUserSettings* GameUserSettings; // 0x420(0x08)
	struct FColor *c2b218ca0a; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FStringClassReference AvoidanceManagerClassName; // 0x430(0x10)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct UTexture2D* *07a2faa8d2; // 0x448(0x08)
	struct UMaterialInstanceDynamic* *5ecd46dbd6; // 0x450(0x08)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0x458(0x10)
	struct UMaterial* *6095551fc5; // 0x468(0x08)
	struct TArray<struct F*1c8a6a1959> StatColorMappings; // 0x470(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x480(0x08)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x488(0x08)
	struct FStringAssetReference DebugMeshMaterialName; // 0x490(0x10)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x4a0(0x10)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0x4b0(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x4c0(0x08)
	struct UMaterial* VertexColorMaterial; // 0x4c8(0x08)
	char bPauseOnLossOfFocus : 1; // 0x4d0(0x01)
	char pad_4D0_1 : 7; // 0x4d0(0x01)
	char pad_4D1[0x3]; // 0x4d1(0x03)
	int32 MaxParticleResize; // 0x4d4(0x04)
	float MeshLODRange; // 0x4d8(0x04)
	struct FColor *d488e8b15f; // 0x4dc(0x04)
	enum class *ea60031bfe *52dc8ce7e2; // 0x4e0(0x01)
	char pad_4E1[0x3]; // 0x4e1(0x03)
	struct FColor *a1f148b920; // 0x4e4(0x04)
	struct UMaterial* WireframeMaterial; // 0x4e8(0x08)
	int32 *6953cade36; // 0x4f0(0x04)
	char pad_4F4[0x4]; // 0x4f4(0x04)
	struct UGameViewportClient* GameViewport; // 0x4f8(0x08)
	float RenderLightMapDensityGrayscaleScale; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct UClass* *bae4c5214e; // 0x508(0x08)
	char pad_510[0x50]; // 0x510(0x50)
	struct FColor *cb2dd6ab2d; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x568(0x10)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0x578(0x10)
	struct FString PlayOnConsoleSaveDir; // 0x588(0x10)
	struct UMaterial* *904e29baa1; // 0x598(0x08)
	float RenderLightMapDensityColorScale; // 0x5a0(0x04)
	struct FColor *f649ca17a3; // 0x5a4(0x04)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0x5a8(0x10)
	char pad_5B8[0x8]; // 0x5b8(0x08)
	struct UMaterialInstanceDynamic* *7d728f8e49; // 0x5c0(0x08)
	float FixedFrameRate; // 0x5c8(0x04)
	float NetClientTicksPerSecond; // 0x5cc(0x04)
	float PrimitiveProbablyVisibleTime; // 0x5d0(0x04)
	char pad_5D4[0x4]; // 0x5d4(0x04)
	struct UTexture2D* DefaultTexture; // 0x5d8(0x08)
	struct FStringClassReference GameViewportClientClassName; // 0x5e0(0x10)
	struct UMaterialInstanceDynamic* *5b15e6100a; // 0x5f0(0x08)
	float MinLightMapDensity; // 0x5f8(0x04)
	char pad_5FC[0x4]; // 0x5fc(0x04)
	struct FStringClassReference LevelScriptActorClassName; // 0x600(0x10)
	struct FLinearColor LightingOnlyBrightness; // 0x610(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x620(0x10)
	struct UAssetManager* AssetManager; // 0x630(0x08)
	struct UTexture2D* *8bd6845839; // 0x638(0x08)
	struct FStringAssetReference MiniFontTextureName; // 0x640(0x10)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x650(0x10)
	struct UMaterial* *289fbcf95e; // 0x660(0x08)
	struct FColor *57697de8c8; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	struct UTexture2D* *9735291500; // 0x670(0x08)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x678(0x10)
	struct FLinearColor *44bd42ad56; // 0x688(0x10)
	struct FLinearColor *ba04574914; // 0x698(0x10)
	struct FLinearColor *8e0bdb2efe; // 0x6a8(0x10)
	struct FLinearColor *613128785f; // 0x6b8(0x10)
	bool *f9293e381d; // 0x6c8(0x01)
	char pad_6C9[0x3]; // 0x6c9(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x6cc(0x01)
	char *216307556a : 1; // 0x6cc(0x01)
	char bSuppressMapWarnings : 1; // 0x6cc(0x01)
	char bDisableAILogging : 1; // 0x6cc(0x01)
	char pad_6CC_4 : 4; // 0x6cc(0x01)
	char pad_6CD[0x3]; // 0x6cd(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x6d0(0x04)
	struct FBox *3dc6cbcd94; // 0x6d4(0x1c)
	char pad_6F0[0x4]; // 0x6f0(0x04)
	int32 *7b0f12bdd7; // 0x6f4(0x04)
	char *8bdcda74ad : 1; // 0x6f8(0x01)
	char pad_6F8_1 : 7; // 0x6f8(0x01)
	char pad_6F9[0x7]; // 0x6f9(0x07)
	struct FString ParticleEventManagerClassPath; // 0x700(0x10)
	char pad_710[0x20]; // 0x710(0x20)
	float SelectionHighlightIntensity; // 0x730(0x04)
	float *460eba5c32; // 0x734(0x04)
	float BSPSelectionHighlightIntensity; // 0x738(0x04)
	float HoverHighlightIntensity; // 0x73c(0x04)
	float *fdb4353d84; // 0x740(0x04)
	float PrimitiveBaseIntensity; // 0x744(0x04)
	float PrimitiveSelectedIntensity; // 0x748(0x04)
	float PrimitiveHoverIntensity; // 0x74c(0x04)
	char pad_750[0x290]; // 0x750(0x290)
	float NearClipPlane; // 0x9e0(0x04)
	char pad_9E4[0xc]; // 0x9e4(0x0c)
	struct UClass* *3b5143fa7c; // 0x9f0(0x08)
	struct UMaterialInstanceDynamic* *67a2670d5b; // 0x9f8(0x08)
	struct FColor *f8920bc53c; // 0xa00(0x04)
	char pad_A04[0x4]; // 0xa04(0x04)
	struct UMaterial* LevelColorationLitMaterial; // 0xa08(0x08)
	struct UMaterial* *8c96c8d713; // 0xa10(0x08)
	struct FString *258f8c994b; // 0xa18(0x10)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0xa28(0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0xa38(0x10)
	struct FStringClassReference ConsoleClassName; // 0xa48(0x10)
	struct FStringAssetReference DefaultTextureName; // 0xa58(0x10)
	char pad_A68[0x1d8]; // 0xa68(0x1d8)
	struct TArray<struct F*34e3a3f3fe> NetDriverDefinitions; // 0xc40(0x10)
	struct TArray<struct FString> ServerActors; // 0xc50(0x10)
	struct TArray<struct FString> *ac79ee85a0; // 0xc60(0x10)
	char *2eec60230d : 1; // 0xc70(0x01)
	char pad_C70_1 : 7; // 0xc70(0x01)
	char pad_C71[0x3]; // 0xc71(0x03)
	float MaxOcclusionPixelsFraction; // 0xc74(0x04)
	int32 MaximumLoopIterationCount; // 0xc78(0x04)
	char pad_C7C[0x4]; // 0xc7c(0x04)
	struct UMaterial* *e7a58e7605; // 0xc80(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0xc88(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0xc98(0x10)
	struct FString WireframeMaterialName; // 0xca8(0x10)
	struct FString VertexColorMaterialName; // 0xcb8(0x10)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0xcc8(0x10)
	int32 MaxParticleResizeWarn; // 0xcd8(0x04)
	char pad_CDC[0x4]; // 0xcdc(0x04)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0xce0(0x10)
	float IdealLightMapDensity; // 0xcf0(0x04)
	char bSubtitlesEnabled : 1; // 0xcf4(0x01)
	char pad_CF4_1 : 7; // 0xcf4(0x01)
	char pad_CF5[0x3]; // 0xcf5(0x03)
	struct FColor *0aed2d0bb7; // 0xcf8(0x04)
	char pad_CFC[0x4]; // 0xcfc(0x04)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0xd00(0x10)
	struct UMaterial* *569ed0c9a4; // 0xd10(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0xd18(0x10)
	struct UObject* *bc69c4c2bd; // 0xd28(0x08)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0xd30(0x10)
	struct TArray<struct F*ecc95ccbfb> *6ae7184684; // 0xd40(0x10)
	struct FStringClassReference AIControllerClassName; // 0xd50(0x10)
	char bAllowMatureLanguage : 1; // 0xd60(0x01)
	char pad_D60_1 : 7; // 0xd60(0x01)
	char pad_D61[0x3]; // 0xd61(0x03)
	float CameraRotationThreshold; // 0xd64(0x04)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0xd68(0x01)
	char pad_D68_1 : 7; // 0xd68(0x01)
	char pad_D69[0x3]; // 0xd69(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0xd6c(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0xd70(0x01)
	char pad_D70_1 : 7; // 0xd70(0x01)
	char pad_D71[0x17]; // 0xd71(0x17)
	int32 *978b7abcd7; // 0xd88(0x04)
	char pad_D8C[0x1a4]; // 0xd8c(0x1a4)
};

// Class Engine.*e0f0196484
// Size: 0x38 (Inherited: 0x28)
struct U*e0f0196484 : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x670 (Inherited: 0x38)
struct UGameViewportClient : U*e0f0196484 {
	char pad_38[0xd8]; // 0x38(0xd8)
	struct UGameInstance* GameInstance; // 0x110(0x08)
	char pad_118[0x428]; // 0x118(0x428)
	struct UConsole* *9690a62fe8; // 0x540(0x08)
	char pad_548[0x20]; // 0x548(0x20)
	struct TArray<struct F*a821055bfd> *74869acfa5; // 0x568(0x10)
	char pad_578[0xf8]; // 0x578(0xf8)

	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0xa24364
	void SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x63ea5ec
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x566fd04
};

// Class Engine.Console
// Size: 0x108 (Inherited: 0x28)
struct UConsole : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct ULocalPlayer* *2d14c03552; // 0x38(0x08)
	struct UTexture2D* *a3cbd11a2c; // 0x40(0x08)
	struct UTexture2D* *102ee2a7c7; // 0x48(0x08)
	char pad_50[0x18]; // 0x50(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x68(0x10)
	char pad_78[0x90]; // 0x78(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c0 (Inherited: 0x28)
struct UNetDriver : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FString NetConnectionClassName; // 0x30(0x10)
	int32 MaxDownloadSize; // 0x40(0x04)
	char bClampListenServerTickRate : 1; // 0x44(0x01)
	char pad_44_1 : 7; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	int32 NetServerMaxTickRate; // 0x48(0x04)
	int32 MaxInternetClientRate; // 0x4c(0x04)
	int32 MaxClientRate; // 0x50(0x04)
	float ServerTravelPause; // 0x54(0x04)
	float SpawnPrioritySeconds; // 0x58(0x04)
	float RelevantTimeout; // 0x5c(0x04)
	float KeepAliveTime; // 0x60(0x04)
	float InitialConnectTimeout; // 0x64(0x04)
	float ConnectionTimeout; // 0x68(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x6c(0x04)
	bool bNoTimeouts; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UNetConnection* *4c8591292a; // 0x78(0x08)
	struct TArray<struct UNetConnection*> *b7c94b0f77; // 0x80(0x10)
	char pad_90[0x28]; // 0x90(0x28)
	struct UWorld* World; // 0xb8(0x08)
	struct UPackage* *2848450d7c; // 0xc0(0x08)
	char pad_C8[0x20]; // 0xc8(0x20)
	struct UClass* *b10fcf621a; // 0xe8(0x08)
	struct UProperty* *85730e860f; // 0xf0(0x08)
	struct UProperty* *225fd045d9; // 0xf8(0x08)
	struct FName NetDriverName; // 0x100(0x08)
	char pad_108[0x8]; // 0x108(0x08)
	float Time; // 0x110(0x04)
	char pad_114[0x3ac]; // 0x114(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c0)
struct UDemoNetDriver : UNetDriver {
	char pad_4C0[0xf8]; // 0x4c0(0xf8)
	struct TMap<struct FString, struct F*5a3c4c23cd> *32f47fcbd9; // 0x5b8(0x50)
	char pad_608[0x438]; // 0x608(0x438)
	bool *6235ee652d; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.DestructibleComponent
// Size: 0xd60 (Inherited: 0xca0)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc98(0x01)
	struct TArray<struct F*ea886402eb> FractureEffects; // 0xca0(0x10)
	bool bEnableHardSleeping; // 0xcb0(0x01)
	char pad_CB1_1 : 7; // 0xcb1(0x01)
	char pad_CB2[0x2]; // 0xcb2(0x02)
	float LargeChunkThreshold; // 0xcb4(0x04)
	char pad_CB8[0x10]; // 0xcb8(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xcc8(0x10)
	char pad_CD8[0x88]; // 0xcd8(0x88)

	float *d2f2b4878a(); // Function Engine.DestructibleComponent.*d2f2b4878a // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63ad824
	void *8719907661(); // Function Engine.DestructibleComponent.*8719907661 // Final|Native|Public|BlueprintCallable // @ game+0x63c5868
	void *ead89ecafd(struct FVector HitLocation); // Function Engine.DestructibleComponent.*ead89ecafd // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63ac628
	void *68e3b0e890(); // Function Engine.DestructibleComponent.*68e3b0e890 // Final|Native|Public|BlueprintCallable // @ game+0x63eb76c
};

// Class Engine.GameEngine
// Size: 0xf90 (Inherited: 0xf30)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf30(0x04)
	float ServerFlushLogInterval; // 0xf34(0x04)
	struct UGameInstance* GameInstance; // 0xf38(0x08)
	char pad_F40[0x40]; // 0xf40(0x40)
	struct TArray<struct UWorld*> *3c599a0734; // 0xf80(0x10)
};

// Class Engine.Player
// Size: 0x48 (Inherited: 0x28)
struct UPlayer : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	int32 *271682eb8c; // 0x38(0x04)
	int32 ConfiguredInternetSpeed; // 0x3c(0x04)
	int32 ConfiguredLanSpeed; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.NetConnection
// Size: 0x65848 (Inherited: 0x48)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x48(0x10)
	struct UNetDriver* Driver; // 0x58(0x08)
	struct UClass* *2620c0f95a; // 0x60(0x08)
	struct UPackageMap* PackageMap; // 0x68(0x08)
	struct TArray<struct UChannel*> *db17e81f9a; // 0x70(0x10)
	struct TArray<struct AActor*> *4c97345279; // 0x80(0x10)
	struct AActor* ViewTarget; // 0x90(0x08)
	struct AActor* *52a10bb853; // 0x98(0x08)
	int32 *31a15aa452; // 0xa0(0x04)
	char *2b1c0c33d1 : 1; // 0xa4(0x01)
	char pad_A4_1 : 1; // 0xa4(0x01)
	char *ae08848d84 : 1; // 0xa4(0x01)
	char pad_A4_3 : 5; // 0xa4(0x01)
	char pad_A5[0x8b]; // 0xa5(0x8b)
	struct TArray<struct UChannel*> *c0c274a36f; // 0x130(0x10)
	char pad_140[0x28]; // 0x140(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x168(0x18)
	char pad_180[0x68]; // 0x180(0x68)
	double *5be392aec6; // 0x1e8(0x08)
	char pad_1F0[0x65538]; // 0x1f0(0x65538)
	struct TArray<struct UChannel*> *923a8e82b0; // 0x65728(0x10)
	char pad_65738[0x110]; // 0x65738(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x40 (Inherited: 0x28)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*4d87801027> ChannelDetails; // 0x28(0x10)
	float Duration; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.GameSession
// Size: 0x408 (Inherited: 0x3f0)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x3f0(0x04)
	int32 MaxPlayers; // 0x3f4(0x04)
	int32 *9a06514058; // 0x3f8(0x04)
	bool MaxSplitscreensPerConnection; // 0x3fc(0x01)
	bool bRequiresPushToTalk; // 0x3fd(0x01)
	char pad_3FE[0x2]; // 0x3fe(0x02)
	struct FName SessionName; // 0x400(0x08)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc80 (Inherited: 0xba0)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*75ea8e2bf3> PerInstanceSMData; // 0xba0(0x10)
	int32 InstancingRandomSeed; // 0xbb0(0x04)
	int32 InstanceStartCullDistance; // 0xbb4(0x04)
	int32 InstanceEndCullDistance; // 0xbb8(0x04)
	char pad_BBC[0x4]; // 0xbbc(0x04)
	struct TArray<int32> *6f47c66abe; // 0xbc0(0x10)
	struct TArray<int32> *56331a2d03; // 0xbd0(0x10)
	char pad_BE0[0x78]; // 0xbe0(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xc58(0x08)
	bool *66d9b36bd0; // 0xc60(0x01)
	char pad_C61[0x3]; // 0xc61(0x03)
	int32 *0f124e2c4d; // 0xc64(0x04)
	struct TArray<struct F*379f451670> *98820ffda4; // 0xc68(0x10)
	char pad_C78[0x8]; // 0xc78(0x08)

	struct FVector4 *ceef77ed7f(); // Function Engine.InstancedStaticMeshComponent.*ceef77ed7f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63ee6b0
	void *2a75f57149(); // Function Engine.InstancedStaticMeshComponent.*2a75f57149 // Native|Public|BlueprintCallable // @ game+0x63e4908
	struct FVector4 *a984b9a9ce(); // Function Engine.InstancedStaticMeshComponent.*a984b9a9ce // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63ab154
	bool *19b8138a81(); // Function Engine.InstancedStaticMeshComponent.*19b8138a81 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63c7948
	void *028d8429ac(struct FVector4 InPerInstanceCustomData); // Function Engine.InstancedStaticMeshComponent.*028d8429ac // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63aad14
	void *7786d1a996(); // Function Engine.InstancedStaticMeshComponent.*7786d1a996 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63c72cc
	bool *43aa6233e3(); // Function Engine.InstancedStaticMeshComponent.*43aa6233e3 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63c80fc
	void *b96a030999(); // Function Engine.InstancedStaticMeshComponent.*b96a030999 // Final|Native|Public|BlueprintCallable // @ game+0x63eb19c
	struct FVector4 *1ab6a18aad(); // Function Engine.InstancedStaticMeshComponent.*1ab6a18aad // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63c74b8
	float *0b1ef7cb51(bool bSphereInWorldSpace); // Function Engine.InstancedStaticMeshComponent.*0b1ef7cb51 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x63c8264
	void *95a4257f8b(); // Function Engine.InstancedStaticMeshComponent.*95a4257f8b // Native|Public|BlueprintCallable // @ game+0xc0218c
	bool *6075d3ac8a(); // Function Engine.InstancedStaticMeshComponent.*6075d3ac8a // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x63ff4d8
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xdb0 (Inherited: 0xc80)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C80[0x68]; // 0xc80(0x68)
	struct TArray<int32> *6f5dc765ea; // 0xce8(0x10)
	int32 *eaed97f0e4; // 0xcf8(0x04)
	char pad_CFC[0x4]; // 0xcfc(0x04)
	struct FBox *1bd5797291; // 0xd00(0x1c)
	struct FBox *cf161024f3; // 0xd1c(0x1c)
	struct TArray<struct FBox> *7d5adf59ca; // 0xd38(0x10)
	char pad_D48[0x20]; // 0xd48(0x20)
	int32 *64f5d9de39; // 0xd68(0x04)
	struct FBoxSphereBounds *bfbf84d4cc; // 0xd6c(0x1c)
	char *0870e284ac : 1; // 0xd88(0x01)
	char *bea543a7e6 : 1; // 0xd88(0x01)
	char pad_D88_2 : 6; // 0xd88(0x01)
	char pad_D89[0x27]; // 0xd89(0x27)

	struct TArray<int32> *ba760e9eef(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*ba760e9eef // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x63e49ac
};

// Class Engine.*fc79daab3f
// Size: 0xdb0 (Inherited: 0xdb0)
struct U*fc79daab3f : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xda8(0x04)
};

// Class Engine.LocalPlayer
// Size: 0x288 (Inherited: 0x48)
struct ULocalPlayer : UPlayer {
	char pad_48[0x28]; // 0x48(0x28)
	char *87852b9d3b : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x67]; // 0x71(0x67)
	struct UClass* *2d967ee0dc; // 0xd8(0x08)
	char pad_E0[0x1a8]; // 0xe0(0x1a8)
};

// Class Engine.*4d0023a102
// Size: 0x28 (Inherited: 0x28)
struct U*4d0023a102 : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1cc0 (Inherited: 0x3f0)
struct APlayerCameraManager : AActor {
	struct APlayerController* *9709ac5021; // 0x3f0(0x08)
	struct USceneComponent* TransformComponent; // 0x3f8(0x08)
	char pad_400[0x24]; // 0x400(0x24)
	float DefaultOrthoWidth; // 0x424(0x04)
	char pad_428[0x28]; // 0x428(0x28)
	float ViewPitchMax; // 0x450(0x04)
	char pad_454[0xc]; // 0x454(0x0c)
	struct F*0653442295 *41f267243b; // 0x460(0x5d0)
	struct F*0653442295 ViewTarget; // 0xa30(0x5d0)
	char pad_1000[0xc]; // 0x1000(0x0c)
	struct FVector ViewTargetOffset; // 0x100c(0x0c)
	char pad_1018[0x8]; // 0x1018(0x08)
	struct F*af5ae819d5 *bdd4a92675; // 0x1020(0x5c0)
	struct FVector FreeCamOffset; // 0x15e0(0x0c)
	char pad_15EC[0x4]; // 0x15ec(0x04)
	struct F*af5ae819d5 *5e40474673; // 0x15f0(0x5c0)
	struct TArray<struct U*ea345062c7*> *a8a6f91d9b; // 0x1bb0(0x10)
	char pad_1BC0[0x4]; // 0x1bc0(0x04)
	float ViewYawMax; // 0x1bc4(0x04)
	float ViewRollMin; // 0x1bc8(0x04)
	char pad_1BCC[0xc]; // 0x1bcc(0x0c)
	float ViewYawMin; // 0x1bd8(0x04)
	char pad_1BDC[0xc]; // 0x1bdc(0x0c)
	struct TArray<struct AEmitterCameraLensEffectBase*> *d3c8bed385; // 0x1be8(0x10)
	struct U*436388bfde* *c32a2345bf; // 0x1bf8(0x08)
	struct U*de6aae17ea* *480f64fe2f[0x08]; // 0x1c00(0x40)
	struct TArray<struct FPostProcessSettings> *3626307aef; // 0x1c40(0x10)
	char pad_1C50[0x10]; // 0x1c50(0x10)
	struct TArray<struct U*de6aae17ea*> *0ec866bd4e; // 0x1c60(0x10)
	struct TArray<struct U*de6aae17ea*> *295e276da3; // 0x1c70(0x10)
	struct ACameraActor* *463d40d827; // 0x1c80(0x08)
	char bIsOrthographic : 1; // 0x1c88(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x1c88(0x01)
	char pad_1C88_2 : 5; // 0x1c88(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1c88(0x01)
	char pad_1C89[0x7]; // 0x1c89(0x07)
	struct TArray<struct UClass*> DefaultModifiers; // 0x1c90(0x10)
	float DefaultAspectRatio; // 0x1ca0(0x04)
	float ViewRollMax; // 0x1ca4(0x04)
	float DefaultFOV; // 0x1ca8(0x04)
	float ViewPitchMin; // 0x1cac(0x04)
	float FreeCamDistance; // 0x1cb0(0x04)
	char pad_1CB4[0xc]; // 0x1cb4(0x0c)

	void *fd287b77ad(); // Function Engine.PlayerCameraManager.*fd287b77ad // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x638e2d4
	struct FRotator *ed9ad74d63(float Rate, float BlendInTime, bool bLoop, float Duration); // Function Engine.PlayerCameraManager.*ed9ad74d63 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x639a0a4
	struct UCameraAnim* *71bebfc691(); // Function Engine.PlayerCameraManager.*71bebfc691 // Native|Public|BlueprintCallable // @ game+0x63a5440
	void *b93793f9f5(); // Function Engine.PlayerCameraManager.*b93793f9f5 // Native|Public|BlueprintCallable // @ game+0x56a8138
	void *2c3667dab0(struct UClass* ModifierClass); // Function Engine.PlayerCameraManager.*2c3667dab0 // Native|Public|BlueprintCallable // @ game+0x638b554
	void *abe4210355(); // Function Engine.PlayerCameraManager.*abe4210355 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xa0cf90
	void *c109a4af55(); // Function Engine.PlayerCameraManager.*c109a4af55 // Native|Public|BlueprintCallable // @ game+0x63a53a8
	struct UClass* *99927376d9(); // Function Engine.PlayerCameraManager.*99927376d9 // Native|Public|BlueprintCallable // @ game+0x6382e6c
	void PhotographyCameraModify(struct FVector NewCameraLocation, struct FVector OriginalCameraLocation); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x6399d10
	void *9947d93eda(); // Function Engine.PlayerCameraManager.*9947d93eda // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5669e48
	struct UCameraShake* *ecad5d6db1(); // Function Engine.PlayerCameraManager.*ecad5d6db1 // Native|Public|BlueprintCallable // @ game+0x63a5780
	void *310c2a0c34(); // Function Engine.PlayerCameraManager.*310c2a0c34 // Native|Public|BlueprintCallable // @ game+0x639abe4
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5cc600
	void *bc8833b492(); // Function Engine.PlayerCameraManager.*bc8833b492 // Native|Public|BlueprintCallable // @ game+0x63a5310
	struct U*de6aae17ea* *9bb7469531(); // Function Engine.PlayerCameraManager.*9bb7469531 // Native|Public|BlueprintCallable // @ game+0x63a569c
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5cd000
	void *46f1bc277b(struct FLinearColor Color); // Function Engine.PlayerCameraManager.*46f1bc277b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a2050
	void *b9aa07e814(); // Function Engine.PlayerCameraManager.*b9aa07e814 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638d280
	struct FRotator *1f3d8a2b99(); // Function Engine.PlayerCameraManager.*1f3d8a2b99 // Native|Public|HasDefaults|BlueprintCallable // @ game+0xa97ef0
	void *e931c3da1d(struct UClass* ModifierClass); // Function Engine.PlayerCameraManager.*e931c3da1d // Native|Public|BlueprintCallable // @ game+0x6384288
	void *0d58a7376f(); // Function Engine.PlayerCameraManager.*0d58a7376f // Native|Public|BlueprintCallable // @ game+0x560bb1c
	float BlueprintUpdateCamera(); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1e037c
	void *98b7b74d50(struct UClass* Shake); // Function Engine.PlayerCameraManager.*98b7b74d50 // Native|Public|BlueprintCallable // @ game+0x63a5524
	void *bfe31feb0f(); // Function Engine.PlayerCameraManager.*bfe31feb0f // Native|Public|BlueprintCallable // @ game+0x639ac78
	bool *101753f358(); // Function Engine.PlayerCameraManager.*101753f358 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a500c
	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5683c8c
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0xcf9198
};

// Class Engine.PlayerInput
// Size: 0x488 (Inherited: 0x28)
struct UPlayerInput : UObject {
	char pad_28[0xf8]; // 0x28(0xf8)
	struct TArray<struct F*c1a57810c7> DebugExecBindings; // 0x120(0x10)
	char pad_130[0x30]; // 0x130(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x160(0x10)
	char pad_170[0x318]; // 0x170(0x318)

	void SetGamePadDeadZone(); // Function Engine.PlayerInput.SetGamePadDeadZone // Final|Exec|Native|Public // @ game+0x63a104c
	void SetGamePadSensitivityOf(); // Function Engine.PlayerInput.SetGamePadSensitivityOf // Final|Exec|Native|Public // @ game+0x63a12b8
	void SetMouseSensitivity(); // Function Engine.PlayerInput.SetMouseSensitivity // Final|Exec|Native|Public // @ game+0x63a2640
	struct FKey SetGamePadDeadZoneOf(); // Function Engine.PlayerInput.SetGamePadDeadZoneOf // Final|Exec|Native|Public // @ game+0x63a10e4
	void SetGamePadSensitivity(); // Function Engine.PlayerInput.SetGamePadSensitivity // Final|Exec|Native|Public // @ game+0x63a1220
	void InvertAxisKey(); // Function Engine.PlayerInput.InvertAxisKey // Final|Exec|Native|Public // @ game+0x639281c
	void SetBind(struct FName Param0); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x639f7ec
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // Final|Exec|Native|Public // @ game+0x6385974
	void InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x639278c
};

// Class Engine.NavigationData
// Size: 0x598 (Inherited: 0x3f0)
struct ANavigationData : AActor {
	struct UPrimitiveComponent* RenderingComp; // 0x3f0(0x08)
	struct F*b471f00637 *b471f00637; // 0x3f8(0x50)
	char *df1535e956 : 1; // 0x448(0x01)
	char bForceRebuildOnLoad : 1; // 0x448(0x01)
	char bCanBeMainNavData : 1; // 0x448(0x01)
	char bCanSpawnOnRebuild : 1; // 0x448(0x01)
	char bRebuildAtRuntime : 1; // 0x448(0x01)
	char pad_448_5 : 3; // 0x448(0x01)
	char pad_449[0x3]; // 0x449(0x03)
	enum class ERuntimeGenerationType RuntimeGeneration; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	float ObservedPathsTickInterval; // 0x450(0x04)
	char *706aa73b33 : 1; // 0x454(0x01)
	char pad_454_1 : 7; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
	uint32 DataVersion; // 0x458(0x04)
	char pad_45C[0xd4]; // 0x45c(0xd4)
	struct TArray<struct F*4474e4d98f> *2b8f015cb0; // 0x530(0x10)
	char pad_540[0x58]; // 0x540(0x58)
};

// Class Engine.RecastNavMesh
// Size: 0x6b0 (Inherited: 0x598)
struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x598(0x01)
	char bDrawPolyEdges : 1; // 0x598(0x01)
	char bDrawFilledPolys : 1; // 0x598(0x01)
	char bDrawNavMeshEdges : 1; // 0x598(0x01)
	char *46090cb9f2 : 1; // 0x598(0x01)
	char *a1477ce159 : 1; // 0x598(0x01)
	char *5db3fd3ad2 : 1; // 0x598(0x01)
	char *5fb9c971a8 : 1; // 0x598(0x01)
	char *002079ed4a : 1; // 0x599(0x01)
	char *b21e7a7c06 : 1; // 0x599(0x01)
	char *eeca050b48 : 1; // 0x599(0x01)
	char *d3d77d15ca : 1; // 0x599(0x01)
	char *643ea53fc0 : 1; // 0x599(0x01)
	char *4ed371a330 : 1; // 0x599(0x01)
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x599(0x01)
	char *05cdc8618a : 1; // 0x599(0x01)
	char pad_59A[0x2]; // 0x59a(0x02)
	float DrawOffset; // 0x59c(0x04)
	char bFixedTilePoolSize : 1; // 0x5a0(0x01)
	char pad_5A0_1 : 7; // 0x5a0(0x01)
	char pad_5A1[0x3]; // 0x5a1(0x03)
	int32 TilePoolSize; // 0x5a4(0x04)
	float TileSizeUU; // 0x5a8(0x04)
	float CellSize; // 0x5ac(0x04)
	float CellHeight; // 0x5b0(0x04)
	float AgentRadius; // 0x5b4(0x04)
	float AgentHeight; // 0x5b8(0x04)
	float AgentMaxHeight; // 0x5bc(0x04)
	float AgentMaxSlope; // 0x5c0(0x04)
	float AgentMaxStepHeight; // 0x5c4(0x04)
	float MinRegionArea; // 0x5c8(0x04)
	float MergeRegionSize; // 0x5cc(0x04)
	float MaxSimplificationError; // 0x5d0(0x04)
	int32 MaxSimultaneousTileGenerationJobsCount; // 0x5d4(0x04)
	int32 TileNumberHardLimit; // 0x5d8(0x04)
	int32 *b2cc0e49e0; // 0x5dc(0x04)
	int32 *eceaad5847; // 0x5e0(0x04)
	int32 *b000b456cd; // 0x5e4(0x04)
	float DefaultDrawDistance; // 0x5e8(0x04)
	float DefaultMaxSearchNodes; // 0x5ec(0x04)
	float DefaultMaxHierarchicalSearchNodes; // 0x5f0(0x04)
	enum class ERecastPartitioning RegionPartitioning; // 0x5f4(0x01)
	enum class ERecastPartitioning LayerPartitioning; // 0x5f5(0x01)
	char pad_5F6[0x2]; // 0x5f6(0x02)
	int32 RegionChunkSplits; // 0x5f8(0x04)
	int32 LayerChunkSplits; // 0x5fc(0x04)
	char bSortNavigationAreasByCost : 1; // 0x600(0x01)
	char bPerformVoxelFiltering : 1; // 0x600(0x01)
	char bMarkLowHeightAreas : 1; // 0x600(0x01)
	char bDoFullyAsyncNavDataGathering : 1; // 0x600(0x01)
	char bUseBetterOffsetsFromCorners : 1; // 0x600(0x01)
	char bStoreEmptyTileLayers : 1; // 0x600(0x01)
	char bUseVirtualFilters : 1; // 0x600(0x01)
	char bAllowNavLinkAsPathEnd : 1; // 0x600(0x01)
	char pad_601[0x3]; // 0x601(0x03)
	bool bOnlySavedOnDS; // 0x604(0x01)
	char pad_605[0x3]; // 0x605(0x03)
	char bUseVoxelCache : 1; // 0x608(0x01)
	char pad_608_1 : 7; // 0x608(0x01)
	char pad_609[0x3]; // 0x609(0x03)
	float TileSetUpdateInterval; // 0x60c(0x04)
	float HeuristicScale; // 0x610(0x04)
	float VerticalDeviationFromGroundCompensation; // 0x614(0x04)
	char pad_618[0x98]; // 0x618(0x98)
};

// Class Engine.*6653cc84aa
// Size: 0x38 (Inherited: 0x28)
struct U*6653cc84aa : UObject {
	struct TArray<struct F*1d24f23e59> *c899da6a1d; // 0x28(0x10)
};

// Class Engine.SceneCaptureComponent
// Size: 0x550 (Inherited: 0x4d0)
struct USceneCaptureComponent : USceneComponent {
	struct TArray<struct UPrimitiveComponent*> *1b85a647bc; // 0x4d0(0x10)
	struct TArray<struct AActor*> HiddenActors; // 0x4e0(0x10)
	struct TArray<struct UPrimitiveComponent*> *2c21281200; // 0x4f0(0x10)
	struct TArray<struct AActor*> ShowOnlyActors; // 0x500(0x10)
	bool bIsLobbyCapture; // 0x510(0x01)
	bool bCaptureEveryFrame; // 0x511(0x01)
	bool bCaptureOnMovement; // 0x512(0x01)
	char pad_513[0x1]; // 0x513(0x01)
	float LODDistanceFactor; // 0x514(0x04)
	float MaxViewDistanceOverride; // 0x518(0x04)
	int32 CaptureSortPriority; // 0x51c(0x04)
	struct TArray<struct F*8f41bd28ce> ShowFlagSettings; // 0x520(0x10)
	char pad_530[0x20]; // 0x530(0x20)

	void *c79e20c089(); // Function Engine.SceneCaptureComponent.*c79e20c089 // Final|Native|Public|BlueprintCallable // @ game+0x63f80d0
	void *a013f7703f(); // Function Engine.SceneCaptureComponent.*a013f7703f // Final|Native|Public|BlueprintCallable // @ game+0x63e9b84
	void *e10656b7d7(); // Function Engine.SceneCaptureComponent.*e10656b7d7 // Final|Native|Public|BlueprintCallable // @ game+0x63f8160
	void *501173f52c(); // Function Engine.SceneCaptureComponent.*501173f52c // Final|Native|Public|BlueprintCallable // @ game+0x63b7914
	void *603a4566ca(); // Function Engine.SceneCaptureComponent.*603a4566ca // Final|Native|Public|BlueprintCallable // @ game+0x63d0728
	void *6b6e40642f(); // Function Engine.SceneCaptureComponent.*6b6e40642f // Final|Native|Public|BlueprintCallable // @ game+0x63d08c8
	void *37577cf286(); // Function Engine.SceneCaptureComponent.*37577cf286 // Final|Native|Public|BlueprintCallable // @ game+0x63e4bf8
	void *ec2de27f06(); // Function Engine.SceneCaptureComponent.*ec2de27f06 // Final|Native|Public|BlueprintCallable // @ game+0x63e4c88
};

// Class Engine.SceneCaptureComponent2D
// Size: 0xb90 (Inherited: 0x550)
struct USceneCaptureComponent2D : USceneCaptureComponent {
	enum class ECameraProjectionMode ProjectionType; // 0x550(0x01)
	char pad_551[0x3]; // 0x551(0x03)
	float FOVAngle; // 0x554(0x04)
	bool *7ed08cdd15; // 0x558(0x01)
	char pad_559[0x3]; // 0x559(0x03)
	float *447c892cd2; // 0x55c(0x04)
	float OrthoWidth; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct UTextureRenderTarget2D* TextureTarget; // 0x568(0x08)
	enum class *fc99d3fe06 CaptureSource; // 0x570(0x01)
	enum class *0a7c972e56 CompositeMode; // 0x571(0x01)
	char pad_572[0x2]; // 0x572(0x02)
	struct FLinearColor LightingOnlyBrightness; // 0x574(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x584(0x10)
	struct FLinearColor LightingOnlyCustomData; // 0x594(0x10)
	float LightingOnlyCustomDataAlpha; // 0x5a4(0x04)
	char pad_5A8[0x8]; // 0x5a8(0x08)
	struct FPostProcessSettings PostProcessSettings; // 0x5b0(0x570)
	float PostProcessBlendWeight; // 0xb20(0x04)
	bool bUseCustomProjectionMatrix; // 0xb24(0x01)
	char pad_B25[0xb]; // 0xb25(0x0b)
	struct FMatrix CustomProjectionMatrix; // 0xb30(0x40)
	char *02c554f858 : 1; // 0xb70(0x01)
	char pad_B70_1 : 7; // 0xb70(0x01)
	char pad_B71[0x3]; // 0xb71(0x03)
	bool bEnableClipPlane; // 0xb74(0x01)
	char pad_B75[0x3]; // 0xb75(0x03)
	struct FVector ClipPlaneBase; // 0xb78(0x0c)
	struct FVector ClipPlaneNormal; // 0xb84(0x0c)

	TScriptInterface<struct UBlendableInterface> *ecceb55aba(); // Function Engine.SceneCaptureComponent2D.*ecceb55aba // Final|Native|Public|BlueprintCallable // @ game+0x63ab570
	void CaptureScene(); // Function Engine.SceneCaptureComponent2D.CaptureScene // Final|Native|Public|BlueprintCallable // @ game+0x63b7218
};

// Class Engine.ArrowComponent
// Size: 0xa10 (Inherited: 0xa00)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor; // 0x9f8(0x04)
	float ArrowSize; // 0x9fc(0x04)
	bool bIsScreenSizeScaled; // 0xa00(0x01)
	float ScreenSize; // 0xa04(0x04)
	char bTreatAsASprite : 1; // 0xa08(0x01)
	char pad_A0D_1 : 7; // 0xa0d(0x01)
	char pad_A0E[0x2]; // 0xa0e(0x02)

	void SetArrowColor(); // Function Engine.ArrowComponent.SetArrowColor // Native|Public|HasDefaults|BlueprintCallable // @ game+0x63e7fb0
};

// Class Engine.ParticleSystemComponent
// Size: 0xc60 (Inherited: 0xa00)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template; // 0x9f8(0x08)
	struct TArray<struct UMaterialInterface*> *cdc8d40e7a; // 0xa00(0x10)
	struct TArray<struct USkeletalMeshComponent*> *edfb091a25; // 0xa10(0x10)
	char pad_A28_0 : 7; // 0xa28(0x01)
	char bResetOnDetach : 1; // 0xa20(0x01)
	char *806c2063a4 : 1; // 0xa21(0x01)
	char bAllowRecycling : 1; // 0xa21(0x01)
	char bAutoManageAttachment : 1; // 0xa21(0x01)
	char *30c974bd36 : 1; // 0xa21(0x01)
	char bOverrideLODMethod : 1; // 0xa22(0x01)
	char *5a36da03b4 : 1; // 0xa22(0x01)
	char *338b144ca2 : 1; // 0xa22(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0xa28(0x10)
	struct FMulticastDelegate OnParticleSpawn; // 0xa38(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0xa48(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0xa58(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0xa68(0x10)
	struct FVector *780596f89d; // 0xa78(0x0c)
	struct FVector *34a7719c48; // 0xa84(0x0c)
	float WarmupTime; // 0xa90(0x04)
	float *05a26e85b5; // 0xa94(0x04)
	char pad_A99[0x3]; // 0xa99(0x03)
	float SecondsBeforeInactive; // 0xa9c(0x04)
	char pad_AA0[0x4]; // 0xaa0(0x04)
	float *94ce59f5f2; // 0xaa4(0x04)
	char pad_AA8[0x8]; // 0xaa8(0x08)
	enum class *22978e1300 LODMethod; // 0xab0(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0xab1(0x01)
	char pad_AB2[0x16]; // 0xab2(0x16)
	struct TArray<struct U*0fc7361301*> *b22bc451b7; // 0xac8(0x10)
	char pad_AD8[0x60]; // 0xad8(0x60)
	float CustomTimeDilation; // 0xb38(0x04)
	char pad_B3C[0x4]; // 0xb3c(0x04)
	struct FMulticastDelegate OnSystemFinished; // 0xb40(0x10)
	struct USceneComponent* AutoAttachParent; // 0xb50(0x08)
	struct FName AutoAttachSocketName; // 0xb58(0x08)
	enum class EAttachLocation AutoAttachLocationType; // 0xb60(0x01)
	enum class EAttachmentRule AutoAttachLocationRule; // 0xb61(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0xb62(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0xb63(0x01)
	char pad_B64[0xfc]; // 0xb64(0xfc)

	void *0f4a05e7ce(int32 SourceIndex); // Function Engine.ParticleSystemComponent.*0f4a05e7ce // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638cc0c
	struct FName *27ac79d500(); // Function Engine.ParticleSystemComponent.*27ac79d500 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x63905d8
	void *93ce0c42a3(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule); // Function Engine.ParticleSystemComponent.*93ce0c42a3 // Final|Native|Public|BlueprintCallable // @ game+0x639eb78
	enum class *7c7293e9c8 *d95cd5304d(); // Function Engine.ParticleSystemComponent.*d95cd5304d // Final|Native|Public|BlueprintCallable // @ game+0x6384e38
	void *03d49cfae4(struct FVector NewTangentPoint); // Function Engine.ParticleSystemComponent.*03d49cfae4 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x639f6b0
	void *1978396d1f(); // Function Engine.ParticleSystemComponent.*1978396d1f // Final|Native|Public|BlueprintCallable // @ game+0x639e0b4
	float *956e07ae37(); // Function Engine.ParticleSystemComponent.*956e07ae37 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638cacc
	void *932c7c018d(int32 emitterIndex); // Function Engine.ParticleSystemComponent.*932c7c018d // Native|Public|BlueprintCallable // @ game+0x639f588
	struct FVector *8ef0a658ae(); // Function Engine.ParticleSystemComponent.*8ef0a658ae // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638cd50
	struct FVector *4e7a6e62b5(); // Function Engine.ParticleSystemComponent.*4e7a6e62b5 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x639f310
	void *92fa2201de(struct FVector NewTargetPoint); // Function Engine.ParticleSystemComponent.*92fa2201de // Native|Public|HasDefaults|BlueprintCallable // @ game+0x639f44c
	void *1ec3649205(); // Function Engine.ParticleSystemComponent.*1ec3649205 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6390820
	struct FName *4cd338f0fb(); // Function Engine.ParticleSystemComponent.*4cd338f0fb // Native|Public|BlueprintCallable // @ game+0x63a0b08
	void *e7af8658ce(float NewSourceStrength); // Function Engine.ParticleSystemComponent.*e7af8658ce // Native|Public|BlueprintCallable // @ game+0x639f1e8
	void *c00c5b640d(struct FName InName); // Function Engine.ParticleSystemComponent.*c00c5b640d // Native|Public|BlueprintCallable // @ game+0x6388fc8
	struct FVector *70c41e648e(); // Function Engine.ParticleSystemComponent.*70c41e648e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638cfd4
	void *3e55e7d95c(struct FName ParameterName); // Function Engine.ParticleSystemComponent.*3e55e7d95c // Final|Native|Public|BlueprintCallable // @ game+0x63a248c
	struct FVector *cb9b6e1f75(); // Function Engine.ParticleSystemComponent.*cb9b6e1f75 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c890
	void *9b5dcbfbeb(); // Function Engine.ParticleSystemComponent.*9b5dcbfbeb // Final|Native|Public|BlueprintCallable // @ game+0x63a3b18
	void *3ed14454d9(struct FName ParameterName); // Function Engine.ParticleSystemComponent.*3ed14454d9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a449c
	void *090136d69a(int32 emitterIndex, struct FVector OutSourcePoint); // Function Engine.ParticleSystemComponent.*090136d69a // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x638c988
	struct FName *7f2d6dd8db(); // Function Engine.ParticleSystemComponent.*7f2d6dd8db // Final|Native|Public|BlueprintCallable // @ game+0x639ea30
	void *03bf17d814(int32 emitterIndex); // Function Engine.ParticleSystemComponent.*03bf17d814 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x639efb0
	void *7c98b28202(int32 TargetIndex); // Function Engine.ParticleSystemComponent.*7c98b28202 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x638ce94
	void *565424fca2(); // Function Engine.ParticleSystemComponent.*565424fca2 // Final|Native|Public|BlueprintCallable // @ game+0x638b2b0
	struct FName *9252cbf5cf(); // Function Engine.ParticleSystemComponent.*9252cbf5cf // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x63a045c
	void *72c115cb68(int32 emitterIndex); // Function Engine.ParticleSystemComponent.*72c115cb68 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x639f0ac
	struct FName SetFloatParameter(); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x63a0ecc
	enum class *7c7293e9c8 *0ba4a0733f(); // Function Engine.ParticleSystemComponent.*0ba4a0733f // Final|Native|Public|BlueprintCallable // @ game+0x63a3df0
