// WidgetBlueprintGeneratedClass UI_ActionWheelNumber.UI_ActionWheelNumber_C
// Size: 0x458 (Inherited: 0x458)
struct UUI_ActionWheelNumber_C : U*7bcda3a4dc {
	int32 Number; // 0x410(0x04)
	bool *eedbc91ee9; // 0x414(0x01)
	struct UTexture2D* *70edc285f0; // 0x418(0x08)
	struct UTexture2D* *c3327dc37c; // 0x420(0x08)
	struct FLinearColor *f82e21e316; // 0x428(0x10)
	struct FLinearColor *d4400f39d8; // 0x438(0x10)
	struct UBorder* Number_Border; // 0x448(0x08)
	struct UTextBlock* Number_Text; // 0x450(0x08)
};

