// Class TslGame.AbstractRespawnProcessor
// Size: 0x470 (Inherited: 0x3e8)
struct AAbstractRespawnProcessor : AActor {
	float *a4e4a76a26; // 0x3e8(0x04)
	float *96d072f090; // 0x3ec(0x04)
	bool *94a9bde39b; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct TArray<struct UClass*> *f3d371d45a; // 0x3f8(0x10)
	struct FMulticastDelegate OnRespawnStarted; // 0x408(0x10)
	struct FMulticastDelegate OnRespawnEnded; // 0x418(0x10)
	struct FMulticastDelegate OnRespawned; // 0x428(0x10)
	struct FMulticastDelegate OnCharacterDead; // 0x438(0x10)
	struct FMulticastDelegate OnRespawnedByRound; // 0x448(0x10)
	struct TArray<struct F*c9d790acb1> *47c315fdad; // 0x458(0x10)
	char pad_468[0x8]; // 0x468(0x08)

	void *05697b2e74(struct ATslPlayerController* Param0); // Function TslGame.AbstractRespawnProcessor.*05697b2e74 // Native|Protected // @ game+0x580ef88
	void OnCharacterDeadImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharacterDeadImpl // Native|Protected // @ game+0x580eef4
	void OnCharactersRespawnedImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharactersRespawnedImpl // Native|Protected // @ game+0x580f068
	void OnRoundUpdatedImpl(); // Function TslGame.AbstractRespawnProcessor.OnRoundUpdatedImpl // Native|Protected // @ game+0x580f080
};

// Class TslGame.*7f47198efe
// Size: 0x5f0 (Inherited: 0x398)
struct U*7f47198efe : UAnimInstance {
	struct ATslCharacter* *c25b0d4af8; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct FRotator ParachuteRotation_CP; // 0x3a8(0x0c)
	float ParaTurn_CP; // 0x3b4(0x04)
	float ParaPitch_CP; // 0x3b8(0x04)
	bool bIsReleased_CP; // 0x3bc(0x01)
	bool bIsReplayJumping_CP; // 0x3bd(0x01)
	char pad_3BE[0x2]; // 0x3be(0x02)
	struct FTransform IK_L_CP; // 0x3c0(0x30)
	struct FTransform IK_R_CP; // 0x3f0(0x30)
	struct FVector IK_L_Location_CP; // 0x420(0x0c)
	struct FRotator IK_L_Rotation_CP; // 0x42c(0x0c)
	struct FVector IK_R_Location_CP; // 0x438(0x0c)
	struct FRotator IK_R_Rotation_CP; // 0x444(0x0c)
	float EnableIKAlpha_CP; // 0x450(0x04)
	float RigidbodyAlpha; // 0x454(0x04)
	float PhysicsBlendAlpha; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct FTransform IK_L_Handle_CP; // 0x460(0x30)
	struct FTransform IK_R_Handle_CP; // 0x490(0x30)
	struct FTransform IK_L_Strap_CP; // 0x4c0(0x30)
	struct FTransform IK_R_Strap_CP; // 0x4f0(0x30)
	float IK_L_Handle_Alpha_CP; // 0x520(0x04)
	float IK_R_Handle_Alpha_CP; // 0x524(0x04)
	float RollTendency; // 0x528(0x04)
	float PitchTendency; // 0x52c(0x04)
	float TendencyFrame; // 0x530(0x04)
	bool bIsLanding_CP; // 0x534(0x01)
	char pad_535[0x3]; // 0x535(0x03)
	float LandingAlpha_CP; // 0x538(0x04)
	bool bIsMoving_CP; // 0x53c(0x01)
	bool bIsCollapsed_CP; // 0x53d(0x01)
	bool bIsManualCutoff_CP; // 0x53e(0x01)
	bool bIsAutoCutoff_CP; // 0x53f(0x01)
	float ParaAnimTimeFromStart_CP; // 0x540(0x04)
	float ClientRotYawScale; // 0x544(0x04)
	bool bUseNewParachuteAnims; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct FName LeftItemBoneName; // 0x550(0x08)
	struct FName RightItemBoneName; // 0x558(0x08)
	struct FName LeftHandleBoneName; // 0x560(0x08)
	struct FName RightHandleBoneName; // 0x568(0x08)
	struct FName LeftStrapBoneName; // 0x570(0x08)
	struct FName RightStrapBoneName; // 0x578(0x08)
	float LandingCheckVelocityScalar; // 0x580(0x04)
	float LandingCheckStartAltitude; // 0x584(0x04)
	float LandingCheckTickTime; // 0x588(0x04)
	struct FVector TerminalVelocity_CP; // 0x58c(0x0c)
	float *54e324f9b8; // 0x598(0x04)
	float *1d7a7301b0; // 0x59c(0x04)
	struct FVector *5952e35a67; // 0x5a0(0x0c)
	float *f2af665f1f; // 0x5ac(0x04)
	struct TArray<struct FName> *e24e9d80cb; // 0x5b0(0x10)
	bool *7af8203d47; // 0x5c0(0x01)
	char pad_5C1[0x3]; // 0x5c1(0x03)
	struct FVector *636a414b1a; // 0x5c4(0x0c)
	int32 *81330e328b; // 0x5d0(0x04)
	char pad_5D4[0x1c]; // 0x5d4(0x1c)

	void *d3a343cbcb(); // Function TslGame.*7f47198efe.*d3a343cbcb // Final|Native|Public|BlueprintCallable // @ game+0x580eee0
	void *ca82004117(); // Function TslGame.*7f47198efe.*ca82004117 // Final|Native|Public|BlueprintCallable // @ game+0x580eec8
	void *a18186baa6(); // Function TslGame.*7f47198efe.*a18186baa6 // Final|Native|Public|BlueprintCallable // @ game+0xbfe088
	void DetachPara_BP(); // Function TslGame.*7f47198efe.DetachPara_BP // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*29cc67e3b5
// Size: 0x310 (Inherited: 0x250)
struct U*29cc67e3b5 : UUserWidget {
	struct U*4aa7f8d102* *7443db7254; // 0x250(0x08)
	char pad_258[0x48]; // 0x258(0x48)
	struct FMulticastDelegate WidgetDestroyEventDelegate; // 0x2a0(0x10)
	char pad_2B0[0x60]; // 0x2b0(0x60)

	void ContainUserFocus(struct UWidget* Widget); // Function TslGame.*29cc67e3b5.ContainUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x58545b8
	void GetCachedViewTargetTslCharacter(); // Function TslGame.*29cc67e3b5.GetCachedViewTargetTslCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58566bc
	void GetCachedGameState(); // Function TslGame.*29cc67e3b5.GetCachedGameState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5856698
	void GetCachedCharacter(); // Function TslGame.*29cc67e3b5.GetCachedCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5856674
	void SetupInputForBlueprint(); // Function TslGame.*29cc67e3b5.SetupInputForBlueprint // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void GetTslGameUserSettings(); // Function TslGame.*29cc67e3b5.GetTslGameUserSettings // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5859b54
	bool ListenForInputAxis(); // Function TslGame.*29cc67e3b5.ListenForInputAxis // Final|Native|Public|BlueprintCallable // @ game+0x585d778
	void GetDemoPlayerState(); // Function TslGame.*29cc67e3b5.GetDemoPlayerState // Final|Native|Public|BlueprintCallable // @ game+0x5857058
	void StopListeningForAllInputAxises(); // Function TslGame.*29cc67e3b5.StopListeningForAllInputAxises // Final|Native|Public|BlueprintCallable // @ game+0x586411c
	void IsInLobby(); // Function TslGame.*29cc67e3b5.IsInLobby // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585b8b4
	void IsReplaying(); // Function TslGame.*29cc67e3b5.IsReplaying // Final|Native|Public|BlueprintCallable // @ game+0x585c69c
	void *aaf326a652(); // Function TslGame.*29cc67e3b5.*aaf326a652 // Final|Native|Private // @ game+0x585ed7c
	void IsSpectating(); // Function TslGame.*29cc67e3b5.IsSpectating // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585cb94
	void TslUserWidgetDestroyEvent__DelegateSignature(); // DelegateFunction TslGame.*29cc67e3b5.TslUserWidgetDestroyEvent__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x2cd4ac
	void *0e7912f5a2(); // Function TslGame.*29cc67e3b5.*0e7912f5a2 // Final|Native|Public // @ game+0x5864130
	void NavigateUserFocus(struct ULocalPlayer* Player); // Function TslGame.*29cc67e3b5.NavigateUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x585df0c
	bool TransferUserFocusThroughReply(); // Function TslGame.*29cc67e3b5.TransferUserFocusThroughReply // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0x5864958
	void IsParticipatedInRedeploy(); // Function TslGame.*29cc67e3b5.IsParticipatedInRedeploy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585c464
	void ClearUserFocus(); // Function TslGame.*29cc67e3b5.ClearUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x5853668
	void ContainOwnerUserFocus(); // Function TslGame.*29cc67e3b5.ContainOwnerUserFocus // Final|Native|Public|BlueprintCallable // @ game+0x585457c
	struct FKey GetRawKeyValue(); // Function TslGame.*29cc67e3b5.GetRawKeyValue // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5858abc
	void GetAxisMultiplier(); // Function TslGame.*29cc67e3b5.GetAxisMultiplier // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58564a0
	void IsObserving(); // Function TslGame.*29cc67e3b5.IsObserving // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585c3b8
};

// Class TslGame.*bc854bc287
// Size: 0x410 (Inherited: 0x310)
struct U*bc854bc287 : U*29cc67e3b5 {
	char pad_310[0x10]; // 0x310(0x10)
	char bUseEmergingAnimation : 1; // 0x320(0x01)
	char bUseVanishingAnimation : 1; // 0x320(0x01)
	char pad_320_2 : 6; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct F*72b0194904 EmergingAnimationBinder; // 0x328(0x20)
	struct F*72b0194904 VanishingAnimationBinder; // 0x348(0x20)
	struct U*54cc75d10f* Emerging; // 0x368(0x08)
	struct U*54cc75d10f* Vanishing; // 0x370(0x08)
	char pad_378[0x18]; // 0x378(0x18)
	enum class ESlateVisibility *a74c1f7e0f; // 0x390(0x01)
	char pad_391[0x3]; // 0x391(0x03)
	float *ac18a4ff4b; // 0x394(0x04)
	char pad_398[0x4]; // 0x398(0x04)
	int32 phase; // 0x39c(0x04)
	int32 *09a066d23a; // 0x3a0(0x04)
	bool bUseFakeCursor; // 0x3a4(0x01)
	char pad_3A5[0x3]; // 0x3a5(0x03)
	struct F*c1cf1c46a8 *580c9e9da0; // 0x3a8(0x28)
	struct F*1e5151c8f2 *0ae93004dc; // 0x3d0(0x20)
	struct TArray<struct F*b4c4c49562> *7a7241b65d; // 0x3f0(0x10)
	struct TArray<struct F*5a5a69efe6> *dd0c5cdb87; // 0x400(0x10)

	void HandleMainPrepass(); // Function TslGame.*bc854bc287.HandleMainPrepass // Native|Public // @ game+0x2cb73c
	void OnFakeCursorDown(); // Function TslGame.*bc854bc287.OnFakeCursorDown // Native|Protected // @ game+0x29a800
	void OnFakeCursorY(); // Function TslGame.*bc854bc287.OnFakeCursorY // Native|Protected // @ game+0x585e2e4
	void UnBindFakeCursor(); // Function TslGame.*bc854bc287.UnBindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x5864b8c
	void OnFakeCursorUp(); // Function TslGame.*bc854bc287.OnFakeCursorUp // Native|Protected // @ game+0x585e230
	void CheckWantRequestRender(); // Function TslGame.*bc854bc287.CheckWantRequestRender // Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5816648
	void BindFakeCursor(); // Function TslGame.*bc854bc287.BindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x5852f10
	void RuntimeInitBP(); // Function TslGame.*bc854bc287.RuntimeInitBP // BlueprintCosmetic|Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	struct FVector2D SetFakeMouseMouseButtonDown(); // Function TslGame.*bc854bc287.SetFakeMouseMouseButtonDown // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x5862678
	void OnFakeCursorX(); // Function TslGame.*bc854bc287.OnFakeCursorX // Native|Protected // @ game+0x585e248
	void IsMouseOn(); // Function TslGame.*bc854bc287.IsMouseOn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585c1f4
	void SetFakeMouseMouseButtonUp(struct FVector2D InCursorPositionInViewport); // Function TslGame.*bc854bc287.SetFakeMouseMouseButtonUp // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x5862720
};

// Class TslGame.*71907fb697
// Size: 0x430 (Inherited: 0x410)
struct U*71907fb697 : U*bc854bc287 {
	struct ATslCharacter* *123f9c9991; // 0x410(0x08)
	char pad_418[0x18]; // 0x418(0x18)

	void *d484a23170(); // Function TslGame.*71907fb697.*d484a23170 // Final|Native|Protected // @ game+0x594c610
	void OnUpdateViewTarget(); // Function TslGame.*71907fb697.OnUpdateViewTarget // Final|Native|Protected // @ game+0x89b2f0
	void OnMatchStarted(); // Function TslGame.*71907fb697.OnMatchStarted // Final|Native|Protected // @ game+0x89cc00
};

// Class TslGame.*7d9a8815c1
// Size: 0x490 (Inherited: 0x430)
struct U*7d9a8815c1 : U*71907fb697 {
	enum class EEquipSlotID EquipSlotID; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct UMaterial* EquipableIconMaterial; // 0x438(0x08)
	float *2418815263; // 0x440(0x04)
	float *8d1a2e237b; // 0x444(0x04)
	struct UImage* EquipableItemIconImage; // 0x448(0x08)
	struct UEquipableItem* *47baac4f82; // 0x450(0x08)
	char pad_458[0x18]; // 0x458(0x18)
	struct AInventoryFacade* InventoryFacade; // 0x470(0x08)
	struct AEquipment* Equipment; // 0x478(0x08)
	char pad_480[0x10]; // 0x480(0x10)

	void OnUpdateIconGauge(); // Function TslGame.*7d9a8815c1.OnUpdateIconGauge // Final|Native|Protected // @ game+0x594e438
	void OnUpdateIcon(); // Function TslGame.*7d9a8815c1.OnUpdateIcon // Final|Native|Protected // @ game+0x594e424
	void OnUpdateEquipment(); // Function TslGame.*7d9a8815c1.OnUpdateEquipment // Final|Native|Protected // @ game+0x89e110
};

// Class TslGame.*33835f45e3
// Size: 0x4a0 (Inherited: 0x490)
struct U*33835f45e3 : U*7d9a8815c1 {
	struct AInventory* Inventory; // 0x490(0x08)
	struct U*54cc75d10f* CapacityFullWarning; // 0x498(0x08)

	void OnUpdateSpaceGague(); // Function TslGame.*33835f45e3.OnUpdateSpaceGague // Final|Native|Protected|HasOutParms // @ game+0x582669c
	void OnNoBagSpaceEvent(); // Function TslGame.*33835f45e3.OnNoBagSpaceEvent // Final|Native|Protected // @ game+0x58229d0
};

// Class TslGame.*34ad2b8964
// Size: 0x490 (Inherited: 0x490)
struct U*34ad2b8964 : U*7d9a8815c1 {
};

// Class TslGame.TslHpAndBoostGaugeHudWidget
// Size: 0x458 (Inherited: 0x430)
struct UTslHpAndBoostGaugeHudWidget : U*71907fb697 {
	struct F*48f0ad4493 *796fd40c5e; // 0x430(0x18)
	struct U*abc6ce94a2* BoostGaugeWidget; // 0x448(0x08)
	struct U*a04adff7ab* HpGaugeWidget; // 0x450(0x08)

	void OnReset(); // Function TslGame.TslHpAndBoostGaugeHudWidget.OnReset // Final|Native|Protected // @ game+0x582419c
};

// Class TslGame.*a04adff7ab
// Size: 0x580 (Inherited: 0x430)
struct U*a04adff7ab : U*71907fb697 {
	struct U*c1aa0ed298* LifeGaugeColorData; // 0x430(0x08)
	struct TMap<int32, struct FLinearColor> *d592bee1fb; // 0x438(0x50)
	char pad_488[0x8]; // 0x488(0x08)
	struct UImage* HpBar; // 0x490(0x08)
	struct UProgressBar* BluezoneBlocker_ProgressBar; // 0x498(0x08)
	struct UOverlay* EffectLayerBinder; // 0x4a0(0x08)
	struct UBorder* InnerBg; // 0x4a8(0x08)
	struct UWidgetSwitcher* HpBgSwitcher; // 0x4b0(0x08)
	struct UTextBlock* HpText; // 0x4b8(0x08)
	struct UTextBlock* MaxHpText; // 0x4c0(0x08)
	struct U*54cc75d10f* Warning; // 0x4c8(0x08)
	struct U*54cc75d10f* ZombieVirus; // 0x4d0(0x08)
	struct U*54cc75d10f* ZombieDBNO; // 0x4d8(0x08)
	bool bUseEffect; // 0x4e0(0x01)
	char pad_4E1[0x7]; // 0x4e1(0x07)
	struct UClass* DamageEffectClass; // 0x4e8(0x08)
	struct UClass* HealEffectClass; // 0x4f0(0x08)
	struct UClass* HealAmountEffectClass; // 0x4f8(0x08)
	int32 DamageEffectMax; // 0x500(0x04)
	int32 HealEffectMax; // 0x504(0x04)
	bool *5f5f732456; // 0x508(0x01)
	bool *71f59f9a5b; // 0x509(0x01)
	char pad_50A[0x2]; // 0x50a(0x02)
	struct FLinearColor *88f1998c54; // 0x50c(0x10)
	struct FLinearColor *15f816e13c; // 0x51c(0x10)
	char pad_52C[0x14]; // 0x52c(0x14)
	struct U*33e82123fc* *0ec035b6c9; // 0x540(0x08)
	struct TArray<struct U*33e82123fc*> *1490d1b5e0; // 0x548(0x10)
	struct TArray<struct U*33e82123fc*> *e282e9ea9a; // 0x558(0x10)
	char pad_568[0x18]; // 0x568(0x18)

	void OnUsingCastObject(); // Function TslGame.*a04adff7ab.OnUsingCastObject // Final|Native|Protected // @ game+0x582e08
	void OnDestoryDamageEffect(); // Function TslGame.*a04adff7ab.OnDestoryDamageEffect // Final|Native|Protected // @ game+0x581f390
	void *a07f7b5c75(); // Function TslGame.*a04adff7ab.*a07f7b5c75 // Final|Native|Protected // @ game+0x58244e0
	void OnDestoryHealEffect(); // Function TslGame.*a04adff7ab.OnDestoryHealEffect // Final|Native|Protected // @ game+0x581f4c8
	void OnCharacterDeath(); // Function TslGame.*a04adff7ab.OnCharacterDeath // Final|Native|Protected // @ game+0x583094
	void OnUpdateHP(); // Function TslGame.*a04adff7ab.OnUpdateHP // Final|Native|Protected // @ game+0x58262d4
};

// Class TslGame.*6e72b9fa27
// Size: 0x440 (Inherited: 0x430)
struct U*6e72b9fa27 : U*71907fb697 {
	struct UImage* VolumeDuckingImage; // 0x430(0x08)
	struct UInvalidationBox* VolumeDuckingInvalidationBox; // 0x438(0x08)

	void UpdateDuckingState(); // Function TslGame.*6e72b9fa27.UpdateDuckingState // Final|Native|Public // @ game+0x5830ea0
};

// Class TslGame.*71b65e1437
// Size: 0x4c8 (Inherited: 0x430)
struct U*71b65e1437 : U*71907fb697 {
	struct U*54cc75d10f* Timer_FadeIn; // 0x430(0x08)
	struct U*54cc75d10f* Timer_FadeOut; // 0x438(0x08)
	struct U*54cc75d10f* Notification_FadeIn; // 0x440(0x08)
	struct U*54cc75d10f* Notification_FadeOut; // 0x448(0x08)
	struct U*54cc75d10f* Message_FadeIn; // 0x450(0x08)
	struct U*54cc75d10f* Message_FadeOut; // 0x458(0x08)
	struct U*54cc75d10f* Message_Active; // 0x460(0x08)
	struct U*54cc75d10f* Top5_FadeIn; // 0x468(0x08)
	struct U*54cc75d10f* Top5_FadeOut; // 0x470(0x08)
	struct UUserWidget* SignalNotificationWidget; // 0x478(0x08)
	struct U*a84b5dbc2d* SignalTop5NotificationWidget; // 0x480(0x08)
	struct U*8be7a67006* SignalTimerWidget; // 0x488(0x08)
	struct UImage* Top5GlowImage; // 0x490(0x08)
	struct UOverlay* SignalMessageParticleOverlay; // 0x498(0x08)
	struct UTextBlock* SignalMessageText; // 0x4a0(0x08)
	struct UTextBlock* Top5MessageText; // 0x4a8(0x08)
	int32 CPPResultShowTime; // 0x4b0(0x04)
	bool *a07414478e; // 0x4b4(0x01)
	char pad_4B5[0x3]; // 0x4b5(0x03)
	float *52d63392e8; // 0x4b8(0x04)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct F*da672abddc *8a4d8faf6f; // 0x4c0(0x08)

	void OnNotifyCPPWinShow(); // Function TslGame.*71b65e1437.OnNotifyCPPWinShow // Final|Native|Protected // @ game+0x5822a78
	void OnUpdateSignalZone(); // Function TslGame.*71b65e1437.OnUpdateSignalZone // Final|Native|Protected // @ game+0x5826688
	void *c19db68e33(); // Function TslGame.*71b65e1437.*c19db68e33 // Final|Native|Private // @ game+0x581b1ec
	void OnUpdateGroggy(); // Function TslGame.*71b65e1437.OnUpdateGroggy // Final|Native|Protected // @ game+0x58262c0
	void OnPlayMessageActiveAnimation(); // Function TslGame.*71b65e1437.OnPlayMessageActiveAnimation // Final|Native|Private // @ game+0x5823350
	void OnNotifyCPPWinResult(); // Function TslGame.*71b65e1437.OnNotifyCPPWinResult // Final|Native|Protected // @ game+0x58229e4
};

// Class TslGame.*4ce481d2bb
// Size: 0x498 (Inherited: 0x430)
struct U*4ce481d2bb : U*71907fb697 {
	struct UImage* SignalGaugeBarImage; // 0x430(0x08)
	struct UOverlay* EffectLayerBinder; // 0x438(0x08)
	struct UClass* DecreaseSignalEffectClass; // 0x440(0x08)
	struct UClass* IncreaseSignalEffectClass; // 0x448(0x08)
	struct UClass* SignalAmountEffectClass; // 0x450(0x08)
	int32 DecreaseSignalEffectMax; // 0x458(0x04)
	int32 IncreaseSignalEffectMax; // 0x45c(0x04)
	struct U*ad0577e98f* *b8af236abf; // 0x460(0x08)
	struct TArray<struct U*ad0577e98f*> *e98dee9af9; // 0x468(0x10)
	struct TArray<struct U*ad0577e98f*> *64c3e2b04e; // 0x478(0x10)
	float SignalAmount; // 0x488(0x04)
	float Signal; // 0x48c(0x04)
	float *c0e619bab7; // 0x490(0x04)
	float *09d36c567a; // 0x494(0x04)

	void OnUpdateSignal(); // Function TslGame.*4ce481d2bb.OnUpdateSignal // Final|Native|Protected|BlueprintCallable // @ game+0x5826674
	void OnDestoryDecreaseEffect(); // Function TslGame.*4ce481d2bb.OnDestoryDecreaseEffect // Final|Native|Protected // @ game+0x581f42c
	void *d932813327(); // Function TslGame.*4ce481d2bb.*d932813327 // Final|Native|Protected // @ game+0x5820a7c
	void UpdateGauge(); // Function TslGame.*4ce481d2bb.UpdateGauge // Final|Native|Protected // @ game+0x5830fe0
	void OnDestoryIncreaseEffect(); // Function TslGame.*4ce481d2bb.OnDestoryIncreaseEffect // Final|Native|Protected // @ game+0x581f558
	void *e4749a9ee3(); // Function TslGame.*4ce481d2bb.*e4749a9ee3 // Final|Native|Protected // @ game+0x581f354
	void *13512ccd06(float Param1); // Function TslGame.*4ce481d2bb.*13512ccd06 // Final|Native|Protected // @ game+0x58316a4
	void UpdateWidget(); // Function TslGame.*4ce481d2bb.UpdateWidget // Final|Native|Protected // @ game+0x5830fe0
	void OnUsingCastObject(); // Function TslGame.*4ce481d2bb.OnUsingCastObject // Final|Native|Protected // @ game+0x5826c60
	void *2872a8e738(); // Function TslGame.*4ce481d2bb.*2872a8e738 // Final|Native|Protected // @ game+0x581a2c8
};

// Class TslGame.*8be7a67006
// Size: 0x450 (Inherited: 0x430)
struct U*8be7a67006 : U*71907fb697 {
	struct UImage* SignalGaugeImage; // 0x430(0x08)
	struct UTextBlock* SignalCounterText; // 0x438(0x08)
	int32 Countdown; // 0x440(0x04)
	int32 *dbb81e6775; // 0x444(0x04)
	struct F*da672abddc *cbec577d92; // 0x448(0x08)

	void *4aa5158b69(); // Function TslGame.*8be7a67006.*4aa5158b69 // Final|Native|Public // @ game+0x581bd1c
	void *f68020182b(); // Function TslGame.*8be7a67006.*f68020182b // Final|Native|Public // @ game+0x581a77c
	void *2db4c35f3e(); // Function TslGame.*8be7a67006.*2db4c35f3e // Final|Native|Private // @ game+0x5819580
	void UpdateWidget(); // Function TslGame.*8be7a67006.UpdateWidget // Final|Native|Private // @ game+0x5819580
};

// Class TslGame.*e688d8136a
// Size: 0x510 (Inherited: 0x430)
struct U*e688d8136a : U*71907fb697 {
	struct U*b9d075373d* StageInfoWidget; // 0x430(0x08)
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x438(0x08)
	struct U*f1ceb4e93e* TutorialMissionListWidget; // 0x440(0x08)
	struct UTextBlock* TextKillBind; // 0x448(0x08)
	struct U*5df55a5414* HungerGaugeWidget; // 0x450(0x08)
	struct U*cf87751ebe* AdditionalIcon; // 0x458(0x08)
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x460(0x08)
	struct U*7d71d941dd* KeyHintPcIconCrafting; // 0x468(0x08)
	struct U*7d71d941dd* KeyHintPcIconScoreBoard; // 0x470(0x08)
	struct U*7d71d941dd* KeyHintPcIconRules; // 0x478(0x08)
	struct F*f16a7f6759 *a420dd49a2; // 0x480(0x20)
	struct F*f16a7f6759 *3f7ba9e4e9; // 0x4a0(0x20)
	struct FText *1cbc810568; // 0x4c0(0x18)
	struct UClass* *a4b8ef5838; // 0x4d8(0x08)
	struct ATslSLBPlayerState* *7bb7262f53; // 0x4e0(0x08)
	struct U*107a240f9c* *89bda6564f; // 0x4e8(0x08)
	char pad_4F0[0x20]; // 0x4f0(0x20)

	void *2c89cf4e46(); // Function TslGame.*e688d8136a.*2c89cf4e46 // Final|Native|Protected // @ game+0x5830bd0
	void OnReset(); // Function TslGame.*e688d8136a.OnReset // Final|Native|Protected // @ game+0x582419c
	void *6362ad33be(enum class EWidgetShowType Param1, struct ATslBaseHUD* Param3); // Function TslGame.*e688d8136a.*6362ad33be // Final|Native|Protected // @ game+0x5827cfc
	void *50bb8e8346(); // Function TslGame.*e688d8136a.*50bb8e8346 // Final|Native|Protected // @ game+0x5821178
	void *f03014b55a(); // Function TslGame.*e688d8136a.*f03014b55a // Final|Native|Protected // @ game+0x5821208
	void *f025397f4e(); // Function TslGame.*e688d8136a.*f025397f4e // Final|Native|Protected // @ game+0x58265e4
	void OnChangeMissionCount(); // Function TslGame.*e688d8136a.OnChangeMissionCount // Final|Native|Protected // @ game+0x581e7c4
	void OnGameUserSettingApplied(); // Function TslGame.*e688d8136a.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x1c2f9d0
	void UpdateOpenLastGateMission(); // Function TslGame.*e688d8136a.UpdateOpenLastGateMission // Final|Native|Protected // @ game+0x5831424
	void *ed840a767d(); // Function TslGame.*e688d8136a.*ed840a767d // Final|Native|Protected // @ game+0x5824524
	void OnSLBModeMonsterAttacked(); // Function TslGame.*e688d8136a.OnSLBModeMonsterAttacked // Final|Native|Protected // @ game+0x58245b4
};

// Class TslGame.*5df55a5414
// Size: 0x4b0 (Inherited: 0x430)
struct U*5df55a5414 : U*71907fb697 {
	struct FVector4 SplitPoint; // 0x430(0x10)
	struct UImage* ImageIcon; // 0x440(0x08)
	struct UOverlay* PanelGauge; // 0x448(0x08)
	struct UImage* ImageGauge; // 0x450(0x08)
	struct UMaterialInstanceDynamic* *326b7f8415; // 0x458(0x08)
	struct UMaterialInstanceDynamic* *a9a59b6374; // 0x460(0x08)
	char pad_468[0x48]; // 0x468(0x48)

	void *28429909a3(); // Function TslGame.*5df55a5414.*28429909a3 // Final|Native|Protected // @ game+0x5816620
	float *a009f2ed3e(); // Function TslGame.*5df55a5414.*a009f2ed3e // Final|Native|Protected // @ game+0x581e6e4
};

// Class TslGame.*449120cc3d
// Size: 0x438 (Inherited: 0x430)
struct U*449120cc3d : U*71907fb697 {
	struct UImage* MicIcon; // 0x430(0x08)

	void OnSetCurrVoiceInputMode(); // Function TslGame.*449120cc3d.OnSetCurrVoiceInputMode // Final|Native|Protected // @ game+0x58249bc
	void OnMuteVoiceFromMe(); // Function TslGame.*449120cc3d.OnMuteVoiceFromMe // Final|Native|Protected // @ game+0x58222e4
};

// Class TslGame.*0755b02b68
// Size: 0x460 (Inherited: 0x430)
struct U*0755b02b68 : U*71907fb697 {
	struct UTslWeaponHudWidget* WeaponHudWidget; // 0x430(0x08)
	struct UWidgetSwitcher* WeaponIconSwitcherWidget; // 0x438(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x440(0x08)
	float *c8d60cd281; // 0x448(0x04)
	float *deb1a7cd49; // 0x44c(0x04)
	float *3684136764; // 0x450(0x04)
	float *df7fa33fd9; // 0x454(0x04)
	char pad_458[0x8]; // 0x458(0x08)

	void OnReset(); // Function TslGame.*0755b02b68.OnReset // Final|Native|Protected // @ game+0x582419c
};

// Class TslGame.TslWeaponHudWidget
// Size: 0x450 (Inherited: 0x430)
struct UTslWeaponHudWidget : U*71907fb697 {
	struct UBackgroundBlur* WeaponHudBackgroundBlur; // 0x430(0x08)
	struct UBorder* WeaponHudBorder; // 0x438(0x08)
	struct USizeBox* BreathIconSizeBox; // 0x440(0x08)
	float *e5e299bdbe; // 0x448(0x04)
	float *c38086685a; // 0x44c(0x04)
};

// Class TslGame.*193b45e747
// Size: 0x480 (Inherited: 0x430)
struct U*193b45e747 : U*71907fb697 {
	struct FLinearColor *295fd6d657; // 0x430(0x10)
	struct FLinearColor *0e8af57716; // 0x440(0x10)
	struct FLinearColor *fe6640b4a5; // 0x450(0x10)
	float *700af39526; // 0x460(0x04)
	char pad_464[0x14]; // 0x464(0x14)
	struct AEquipment* *db120951b3; // 0x478(0x08)

	void OnChangedWeapon(int32 Param0); // Function TslGame.*193b45e747.OnChangedWeapon // Final|Native|Protected // @ game+0x581e810
	void OnUpdateWeapon(); // Function TslGame.*193b45e747.OnUpdateWeapon // Final|Native|Protected // @ game+0xa2ead0
};

// Class TslGame.*05fa2bff6b
// Size: 0x4a0 (Inherited: 0x480)
struct U*05fa2bff6b : U*193b45e747 {
	struct UImage* DoubleBarrelLeft; // 0x480(0x08)
	struct UImage* DoubleBarrelRight; // 0x488(0x08)
	struct UTexture2D* *cefc22279a; // 0x490(0x08)
	struct UTexture2D* *776be055c6; // 0x498(0x08)
};

// Class TslGame.*e9de5c8a39
// Size: 0x548 (Inherited: 0x480)
struct U*e9de5c8a39 : U*193b45e747 {
	struct UWidgetSwitcher* CurrentFiremodeSwitcher; // 0x480(0x08)
	struct UWidgetSwitcher* NextFiremodeSwitcher; // 0x488(0x08)
	struct UBorder* NextFiremodeBorder; // 0x490(0x08)
	struct U*54cc75d10f* FiremodeIconChange; // 0x498(0x08)
	struct F*81733b0fce *73569a4c3f; // 0x4a0(0x50)
	struct TMap<struct FName, struct F*81733b0fce> *a5b2e59d32; // 0x4f0(0x50)
	char pad_540[0x8]; // 0x540(0x08)
};

// Class TslGame.*7acb80957d
// Size: 0x4c0 (Inherited: 0x480)
struct U*7acb80957d : U*193b45e747 {
	struct UTextBlock* CurrentWeaponLoadedAmmoText; // 0x480(0x08)
	struct UTextBlock* NextWeaponLoadedAmmoText; // 0x488(0x08)
	struct U*54cc75d10f* LoadedAmmoDecreasing; // 0x490(0x08)
	struct U*54cc75d10f* LoadedAmmoIncreasing; // 0x498(0x08)
	struct F*68d8762d80 *db14b76a0a; // 0x4a0(0x10)
	char pad_4B0[0x8]; // 0x4b0(0x08)
	struct ATslWeapon_Gun* *06ebd12d9e; // 0x4b8(0x08)

	void OnGameUserSettingApplied(); // Function TslGame.*7acb80957d.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x5820220
	struct FName OnUpdatedInventory(); // Function TslGame.*7acb80957d.OnUpdatedInventory // Final|Native|Protected|HasOutParms // @ game+0x5826b40
};

// Class TslGame.*d69fb205c2
// Size: 0x4c8 (Inherited: 0x480)
struct U*d69fb205c2 : U*193b45e747 {
	struct UTextBlock* CurrentWeaponReserveAmmoText; // 0x480(0x08)
	struct UTextBlock* NextWeaponReserveAmmoText; // 0x488(0x08)
	struct UWidgetSwitcher* SwitcherNext; // 0x490(0x08)
	struct UWidgetSwitcher* SwitcherCurrent; // 0x498(0x08)
	struct U*54cc75d10f* ReserveAmmoDecreasing; // 0x4a0(0x08)
	struct U*54cc75d10f* ReserveAmmoIncreasing; // 0x4a8(0x08)
	struct F*68d8762d80 *db14b76a0a; // 0x4b0(0x10)
	char pad_4C0[0x8]; // 0x4c0(0x08)
};

// Class TslGame.*02f9258f6b
// Size: 0x508 (Inherited: 0x480)
struct U*02f9258f6b : U*193b45e747 {
	struct UBorder* BorderHealmodeBind; // 0x480(0x08)
	struct UWidgetSwitcher* SwitcherHealmodeBind; // 0x488(0x08)
	struct UTextBlock* TextHealItemCountBind; // 0x490(0x08)
	struct U*54cc75d10f* AnimIconChangeBind; // 0x498(0x08)
	struct F*f5d14e572c *320501a850; // 0x4a0(0x50)
	struct F*68d8762d80 *db14b76a0a; // 0x4f0(0x10)
	char pad_500[0x8]; // 0x500(0x08)

	struct FName OnUpdateInventoryItem(); // Function TslGame.*02f9258f6b.OnUpdateInventoryItem // Final|Native|Protected|HasOutParms // @ game+0x58262e8
};

// Class TslGame.*6c530763b0
// Size: 0x488 (Inherited: 0x410)
struct U*6c530763b0 : U*bc854bc287 {
	struct UBorder* FrameBorder; // 0x410(0x08)
	struct UImage* ItemImage; // 0x418(0x08)
	struct UTextBlock* ItemCountText; // 0x420(0x08)
	struct UItem* *fc516e3bec; // 0x428(0x08)
	struct UItem* *4a9de27215; // 0x430(0x08)
	struct FName IconTextureParamName; // 0x438(0x08)
	struct FName BlinkFrameParamName; // 0x440(0x08)
	struct UCurveFloat* BlinkCurve; // 0x448(0x08)
	char pad_450[0x8]; // 0x450(0x08)
	struct UTexture* *49179dee61; // 0x458(0x20)
	char pad_478[0x10]; // 0x478(0x10)

	void GetCachedItem(); // Function TslGame.*6c530763b0.GetCachedItem // Final|Native|Public|BlueprintCallable // @ game+0x581989c
};

// Class TslGame.*d422e434a2
// Size: 0x4a0 (Inherited: 0x410)
struct U*d422e434a2 : U*bc854bc287 {
	struct TArray<struct F*1e5151c8f2> Slots; // 0x410(0x10)
	struct TMap<struct FName, struct F*7278704b44> *dca9e20f13; // 0x420(0x50)
	struct UDataTable* *7214036691; // 0x470(0x20)
	char pad_490[0x10]; // 0x490(0x10)

	void LoadDataTable(); // Function TslGame.*d422e434a2.LoadDataTable // Final|Native|Private // @ game+0x581bd30
	void OnInventoryUpdated(); // Function TslGame.*d422e434a2.OnInventoryUpdated // Final|Native|Protected // @ game+0x5820ba4
};

// Class TslGame.*a60fa4e018
// Size: 0x450 (Inherited: 0x410)
struct U*a60fa4e018 : U*bc854bc287 {
	struct UInvalidationBox* CachedInvalidationBox; // 0x410(0x08)
	int32 IconIndex; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct UMaterialInterface* MI_ProgressBar; // 0x420(0x08)
	struct FName ProgressBarMaterialParam; // 0x428(0x08)
	struct UMaterialInstanceDynamic* *11aacf3415; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
	struct FName *67a8c78c5f; // 0x440(0x08)
	bool bHideCountText; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
};

// Class TslGame.*f2ce9e0ad0
// Size: 0x568 (Inherited: 0x450)
struct U*f2ce9e0ad0 : U*a60fa4e018 {
	struct UImage* SkillIconImage; // 0x450(0x08)
	struct UImage* SkillProgressBar_Image; // 0x458(0x08)
	struct UTextBlock* SkillCountText; // 0x460(0x08)
	struct UTextBlock* SkillIndexText; // 0x468(0x08)
	struct UBorder* SkillIcon_Border; // 0x470(0x08)
	struct UGridPanel* SkillCountGridPanel; // 0x478(0x08)
	struct U*2c98f921a9* GamepadKeyIcon; // 0x480(0x08)
	struct FLinearColor SkillIconImage_ActivatedColor; // 0x488(0x10)
	struct FLinearColor SkillIconImage_DeactivatedColor; // 0x498(0x10)
	struct FLinearColor SkillIconBorder_ActivatedColor; // 0x4a8(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedColor; // 0x4b8(0x10)
	struct FLinearColor SkillIconBorder_ActivatedBrushColor; // 0x4c8(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedBrushColor; // 0x4d8(0x10)
	struct FSlateColor SkillCountText_ActivatedColor; // 0x4e8(0x28)
	struct FSlateColor SkillCountText_DeactivatedColor; // 0x510(0x28)
	char pad_538[0x30]; // 0x538(0x30)

	enum class *fe3a38da9a OnUpdateIconColor(); // Function TslGame.*f2ce9e0ad0.OnUpdateIconColor // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*8fa63ae61f
// Size: 0x560 (Inherited: 0x450)
struct U*8fa63ae61f : U*a60fa4e018 {
	struct UImage* SkillIconImage; // 0x450(0x08)
	struct UImage* SkillProgressBar_Image; // 0x458(0x08)
	struct UTextBlock* SkillCountText; // 0x460(0x08)
	struct UTextBlock* SkillIndexText; // 0x468(0x08)
	struct UBorder* SkillIcon_Border; // 0x470(0x08)
	struct U*2c98f921a9* GamepadKeyIcon; // 0x478(0x08)
	struct FLinearColor SkillIconImage_ActivatedColor; // 0x480(0x10)
	struct FLinearColor SkillIconImage_DeactivatedColor; // 0x490(0x10)
	struct FLinearColor SkillIconBorder_ActivatedColor; // 0x4a0(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedColor; // 0x4b0(0x10)
	struct FLinearColor SkillIconBorder_ActivatedBrushColor; // 0x4c0(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedBrushColor; // 0x4d0(0x10)
	struct FSlateColor SkillCountText_ActivatedColor; // 0x4e0(0x28)
	struct FSlateColor SkillCountText_DeactivatedColor; // 0x508(0x28)
	char pad_530[0x30]; // 0x530(0x30)

	enum class *fe3a38da9a OnUpdateIconColor(); // Function TslGame.*8fa63ae61f.OnUpdateIconColor // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*ae1f38102c
// Size: 0x518 (Inherited: 0x410)
struct U*ae1f38102c : U*bc854bc287 {
	struct UHorizontalBox* IconHorizontalBox; // 0x410(0x08)
	struct USpacer* IconSpacer; // 0x418(0x08)
	struct U*fcb7bfa607* BuffIconDataAsset; // 0x420(0x08)
	struct FStringClassReference SpawnKitClass; // 0x428(0x10)
	struct TArray<struct U*a60fa4e018*> *0f3f2072c3; // 0x438(0x10)
	struct U*a60fa4e018* *94f8ad55bb; // 0x448(0x08)
	struct USpawnKit* SpawnKit; // 0x450(0x08)
	struct TArray<struct F*dd32ce0963> *dd32ce0963; // 0x458(0x10)
	struct F*417b09f62c *6cc0ab41e2; // 0x468(0x68)
	enum class EFBRClass *102f18f3c4; // 0x4d0(0x01)
	char pad_4D1[0x7]; // 0x4d1(0x07)
	struct TArray<struct U*bc854bc287*> *13b9f377a9; // 0x4d8(0x10)
	char pad_4E8[0x10]; // 0x4e8(0x10)
	bool bCollapseEmptyIconWidget; // 0x4f8(0x01)
	char pad_4F9[0x1f]; // 0x4f9(0x1f)

	void OnWeaponArmed(); // Function TslGame.*ae1f38102c.OnWeaponArmed // Final|Native|Protected // @ game+0x5827554
	void OnSelectableSpawnKit(); // Function TslGame.*ae1f38102c.OnSelectableSpawnKit // Final|Native|Protected // @ game+0x58247c8
	void OnMatchStateChanged(); // Function TslGame.*ae1f38102c.OnMatchStateChanged // Final|Native|Protected // @ game+0x582179c
	void OnUpdateSpawnKit(); // Function TslGame.*ae1f38102c.OnUpdateSpawnKit // Final|Native|Protected // @ game+0x5826794
	void OnUpdateViewTargetSpawnKit(); // Function TslGame.*ae1f38102c.OnUpdateViewTargetSpawnKit // Final|Native|Protected // @ game+0x5826a20
	void OnWeaponUnArmed(); // Function TslGame.*ae1f38102c.OnWeaponUnArmed // Final|Native|Protected // @ game+0x58275a4
	void OnUpdateViewTarget(); // Function TslGame.*ae1f38102c.OnUpdateViewTarget // Final|Native|Protected // @ game+0x5826874
};

// Class TslGame.TslWeapon
// Size: 0xa60 (Inherited: 0x3e8)
struct ATslWeapon : AActor {
	char pad_3E8[0x38]; // 0x3e8(0x38)
	struct UTexture* WeaponIcon; // 0x420(0x08)
	float WeaponIconRatio; // 0x428(0x04)
	int32 LogWeaponFirePerFireCount; // 0x42c(0x04)
	struct TArray<struct FName> *103f58e2d7; // 0x430(0x10)
	struct TArray<struct F*73eadbc90e> *65130a588c; // 0x440(0x10)
	bool *ca40b8afb8; // 0x450(0x01)
	char pad_451[0x27]; // 0x451(0x27)
	struct FMulticastDelegate OnUpdatedAttachment; // 0x478(0x10)
	struct FMulticastDelegate OnUpdatedSkinData; // 0x488(0x10)
	struct FMulticastDelegate OnUpdatedMasteryItem; // 0x498(0x10)
	struct FMulticastDelegate OnUpdatedAttachmentOnServer; // 0x4a8(0x10)
	struct FMulticastDelegate OnUpdatedCharacterEvent; // 0x4b8(0x10)
	char pad_4C8[0x8]; // 0x4c8(0x08)
	struct F*e928921c36 WeaponConfig; // 0x4d0(0x2b0)
	enum class EWeaponHand *494d1dfe8f; // 0x780(0x01)
	char pad_781[0x7]; // 0x781(0x07)
	struct TArray<enum class EWeaponClass> *986867d866; // 0x788(0x10)
	bool *ff9edc0629; // 0x798(0x01)
	bool *a2f1567bc6; // 0x799(0x01)
	char pad_79A[0x6]; // 0x79a(0x06)
	struct U*6587928b02* *69faef3199; // 0x7a0(0x08)
	struct USceneComponent* RootScene; // 0x7a8(0x08)
	int8 *0390fd4864; // 0x7b0(0x01)
	char pad_7B1[0x1]; // 0x7b1(0x01)
	enum class EAttachmentCalculateType *05c4b0e8c5; // 0x7b2(0x01)
	char pad_7B3[0x5]; // 0x7b3(0x05)
	struct TArray<struct F*f4471b5c0d> *3356c666b2; // 0x7b8(0x10)
	struct TArray<struct F*9838798d84> *b32d6389ed; // 0x7c8(0x10)
	struct TArray<int32> *9a4960283c; // 0x7d8(0x10)
	struct TArray<struct U*1126777aa2*> *449a3f7bf9; // 0x7e8(0x10)
	struct FName *747e732719; // 0x7f8(0x08)
	int32 *46ff0889f7; // 0x800(0x04)
	char pad_804[0x4]; // 0x804(0x04)
	struct FText ItemName; // 0x808(0x18)
	enum class EAccessorySlot *ee0bbe0f7e; // 0x820(0x01)
	enum class EAllowedThrowMode *84ea549215; // 0x821(0x01)
	char pad_822[0x6]; // 0x822(0x06)
	struct UAkComponent* AkComponent; // 0x828(0x08)
	char pad_830[0x8]; // 0x830(0x08)
	struct FName *d79ba1b944; // 0x838(0x08)
	struct FName *49558aedfe; // 0x840(0x08)
	struct UParticleSystem* *d73a54a334; // 0x848(0x08)
	struct FName *a9e6b8aebe; // 0x850(0x08)
	struct UClass* *5807964f4f; // 0x858(0x08)
	struct UParticleSystemComponent* *ab51012b25; // 0x860(0x08)
	struct UParticleSystemComponent* *3ee96c6caa; // 0x868(0x08)
	struct UForceFeedbackEffect* *033124abdd; // 0x870(0x08)
	enum class EAnimWeaponType *dc818df781; // 0x878(0x01)
	char pad_879[0x7]; // 0x879(0x07)
	struct F*ab84fcde31 *47ce58a8c5; // 0x880(0x18)
	struct F*06ddb86218 *b1c2bd7934; // 0x898(0x10)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *533c23211b; // 0x8a8(0x50)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *1e2e1a0b8c; // 0x8f8(0x50)
	float *9a0f5df5ef; // 0x948(0x04)
	bool *8d8ee4021c; // 0x94c(0x01)
	char pad_94D[0x3]; // 0x94d(0x03)
	char *c9aa708939 : 1; // 0x950(0x01)
	char pad_950_1 : 7; // 0x950(0x01)
	char pad_951[0x2f]; // 0x951(0x2f)
	bool *065cf40769; // 0x980(0x01)
	bool *613c566c32; // 0x981(0x01)
	bool *5eb2c20ad8; // 0x982(0x01)
	char pad_983[0x1d]; // 0x983(0x1d)
	struct F*1f0042b8e9 *1f0042b8e9; // 0x9a0(0x20)
	struct F*81f90e8006 *81f90e8006; // 0x9c0(0x04)
	struct F*81f90e8006 *7187ea519a; // 0x9c4(0x04)
	struct FName WeaponMeshName; // 0x9c8(0x08)
	struct U*fea697f959* *fea697f959; // 0x9d0(0x08)
	char pad_9D8[0x18]; // 0x9d8(0x18)
	struct UMeshComponent* *98b590b734; // 0x9f0(0x08)
	bool *e54c34977c; // 0x9f8(0x01)
	char pad_9F9[0x67]; // 0x9f9(0x67)

	void *2d9038d7a6(); // Function TslGame.TslWeapon.*2d9038d7a6 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x585e0bc
	void *389d52f6f8(); // Function TslGame.TslWeapon.*389d52f6f8 // Final|Native|Public|Const // @ game+0x585a9f8
	void *056ee50531(); // Function TslGame.TslWeapon.*056ee50531 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a9d4
	void OnRep_ItemIndex(); // Function TslGame.TslWeapon.OnRep_ItemIndex // Final|Native|Protected // @ game+0xbdfc0c
	void *09cf451696(); // Function TslGame.TslWeapon.*09cf451696 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5858c80
	void *547560868a(); // Function TslGame.TslWeapon.*547560868a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5859644
	void *204ec99718(); // Function TslGame.TslWeapon.*204ec99718 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a9bc
	void *a21c9284f3(); // Function TslGame.TslWeapon.*a21c9284f3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581a68c
	void *6f114f37a9(); // Function TslGame.TslWeapon.*6f114f37a9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a5c4
	void *3f78dfb9a2(); // Function TslGame.TslWeapon.*3f78dfb9a2 // Final|Native|Public|BlueprintCallable // @ game+0x5865130
	void *25ea84e057(); // Function TslGame.TslWeapon.*25ea84e057 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5858088
	void *98177c56c9(); // Function TslGame.TslWeapon.*98177c56c9 // Final|Native|Private // @ game+0x5864f04
	void *ff2c30e034(struct FName Tag); // Function TslGame.TslWeapon.*ff2c30e034 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a798
	void OnLoadedAttachmentAssetDatas(); // Function TslGame.TslWeapon.OnLoadedAttachmentAssetDatas // Native|Public|HasOutParms // @ game+0x8f5f50
	void *0cf5ed0ffc(); // Function TslGame.TslWeapon.*0cf5ed0ffc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58562fc
	void *9fa006e632(); // Function TslGame.TslWeapon.*9fa006e632 // Final|Native|Public|BlueprintCallable // @ game+0x5864dd4
	void OnRep_AttachedItemIndexes(); // Function TslGame.TslWeapon.OnRep_AttachedItemIndexes // Final|Native|Protected|HasOutParms // @ game+0xa611a8
	enum class EAnimStance *79f6cb9926(); // Function TslGame.TslWeapon.*79f6cb9926 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5859574
	void GetWeaponMesh(); // Function TslGame.TslWeapon.GetWeaponMesh // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585aa10
	void *ccda8bfec9(); // Function TslGame.TslWeapon.*ccda8bfec9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a918
	void *3aa923ff36(); // Function TslGame.TslWeapon.*3aa923ff36 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a930
	void *ea8096b1c9(); // Function TslGame.TslWeapon.*ea8096b1c9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5855eec
	void *90266a056a(); // Function TslGame.TslWeapon.*90266a056a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5857850
	void *52c2cfe68a(); // Function TslGame.TslWeapon.*52c2cfe68a // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x58610d0
	void *f93e67eedd(); // Function TslGame.TslWeapon.*f93e67eedd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a5ac
	void *19b91d7355(); // Function TslGame.TslWeapon.*19b91d7355 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5857de8
	void *4be3a16818(); // Function TslGame.TslWeapon.*4be3a16818 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5858070
	void *312f74a8ca(); // Function TslGame.TslWeapon.*312f74a8ca // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5859720
	void *f3e4445d73(); // Function TslGame.TslWeapon.*f3e4445d73 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a698
	void OnRep_ReplicatedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedMasteryItem // Final|Native|Private // @ game+0x585ea4c
	struct FHitResult *6fec81be39(); // Function TslGame.TslWeapon.*6fec81be39 // Final|Native|Protected|HasOutParms|HasDefaults // @ game+0x5863740
	void *3cff60c2bf(); // Function TslGame.TslWeapon.*3cff60c2bf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58580a0
	void *6d4de20e15(enum class EWeaponAttachmentSlotID SlotID); // Function TslGame.TslWeapon.*6d4de20e15 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a6f0
	void Weapon_AttachShoulder(); // Function TslGame.TslWeapon.Weapon_AttachShoulder // Final|Native|Public|BlueprintCallable // @ game+0x5865144
	void OnAttachmentChanged(); // Function TslGame.TslWeapon.OnAttachmentChanged // Final|Native|Public // @ game+0x585e1a8
	void OnRep_ReplicatedAssignedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedAssignedMasteryItem // Final|Native|Private // @ game+0xbf00fc
	bool *491eb03e0c(bool bCastShadow); // Function TslGame.TslWeapon.*491eb03e0c // Native|Public|BlueprintCallable // @ game+0x5862fa0
	void *fcde5cd77a(); // Function TslGame.TslWeapon.*fcde5cd77a // Final|Native|Public|BlueprintCallable // @ game+0x58562e4
	void *5343b46626(); // Function TslGame.TslWeapon.*5343b46626 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5855f54
	int32 *97f65719db(); // Function TslGame.TslWeapon.*97f65719db // Native|Public|HasDefaults|BlueprintCallable // @ game+0x5852bb8
	void *2aea9d8f43(); // Function TslGame.TslWeapon.*2aea9d8f43 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x5852b14
	void *6a19f08747(); // Function TslGame.TslWeapon.*6a19f08747 // Final|Native|Public|Const // @ game+0x583c308
	void OnRep_ReplicatedSkinParam(); // Function TslGame.TslWeapon.OnRep_ReplicatedSkinParam // Final|Native|Private // @ game+0x585eacc
	void *967d91062b(); // Function TslGame.TslWeapon.*967d91062b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585cfe8
	void *7918afdde1(); // Function TslGame.TslWeapon.*7918afdde1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585aa8c
	void *13c12e3a9e(); // Function TslGame.TslWeapon.*13c12e3a9e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5855cc4
	void *ad530028b0(); // Function TslGame.TslWeapon.*ad530028b0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a8fc
	void *5fef895e0e(); // Function TslGame.TslWeapon.*5fef895e0e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a8e4
	enum class EWeaponAttachmentSlotID *67df7412de(); // Function TslGame.TslWeapon.*67df7412de // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585b35c
	void *9d4c3c9fd6(); // Function TslGame.TslWeapon.*9d4c3c9fd6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5857098
	void *015cf4862c(); // Function TslGame.TslWeapon.*015cf4862c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd079e0
	void *ffa18d94c6(); // Function TslGame.TslWeapon.*ffa18d94c6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x585a584
	void *aa2185923f(); // Function TslGame.TslWeapon.*aa2185923f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5855d18
};

// Class TslGame.TslWeapon_Gun
// Size: 0x1000 (Inherited: 0xa60)
struct ATslWeapon_Gun : ATslWeapon {
	bool bSpawnBulletFromBarrel; // 0xa58(0x01)
	bool *f1d530a090; // 0xa59(0x01)
	enum class EWeaponState CurrentState; // 0xa5a(0x01)
	int32 *74f3fd9761; // 0xa5c(0x04)
	int32 *eac0fcada9; // 0xa60(0x04)
	int32 *dc8ed397aa; // 0xa64(0x04)
	int32 *19a3b45735; // 0xa68(0x04)
	char *a91d21a3fa : 1; // 0xa6c(0x01)
	char *486160f8ba : 1; // 0xa6c(0x01)
	char *49b99c4d36 : 1; // 0xa6c(0x01)
	char pad_A73_3 : 5; // 0xa73(0x01)
	char pad_A74[0x30]; // 0xa74(0x30)
	int32 *230e7fd28b; // 0xaa4(0x04)
	bool *a9630fb315; // 0xaa8(0x01)
	char pad_AA9[0x7f]; // 0xaa9(0x7f)
	struct F*da672abddc *cc7c683f01; // 0xb28(0x08)
	char pad_B30[0x58]; // 0xb30(0x58)
	struct F*edc104dbaf *9456bccaf8; // 0xb88(0xa8)
	struct U*4a170ec375* *4a170ec375; // 0xc30(0x08)
	struct F*4e85a8c2e0 *424845e66b; // 0xc38(0x20)
	struct FName ScopingAttachPoint; // 0xc58(0x08)
	struct FName *0b9ac6e58c; // 0xc60(0x08)
	struct FName *8eb94f5e87; // 0xc68(0x08)
	char pad_C70[0x290]; // 0xc70(0x290)
	int32 GripTypeIndexOverride; // 0xf00(0x04)
	bool *40c9bf525a; // 0xf04(0x01)
	char pad_F05[0x3]; // 0xf05(0x03)
	float *f433504a41; // 0xf08(0x04)
	char pad_F0C[0xc]; // 0xf0c(0x0c)
	struct U*a82e1ae1b9* WeaponGunData; // 0xf18(0x08)
	char pad_F20[0x20]; // 0xf20(0x20)
	struct UAkAudioEvent* *333730582d; // 0xf40(0x08)
	struct F*b6778548ad *b6778548ad; // 0xf48(0x20)
	struct UStaticMeshComponent* *d718c58b43; // 0xf68(0x08)
	struct FName *dab1ddf816; // 0xf70(0x08)
	char pad_F78[0x8]; // 0xf78(0x08)
	struct U*31506bbb24* *4b6afebae2; // 0xf80(0x08)
	char pad_F88[0x4]; // 0xf88(0x04)
	struct FVector ShootTargetLoc; // 0xf8c(0x0c)
	char pad_F98[0x68]; // 0xf98(0x68)

	void *661af784b0(); // Function TslGame.TslWeapon_Gun.*661af784b0 // Final|Native|Protected // @ game+0x5897ea4
	void *7d9254b9d4(); // Function TslGame.TslWeapon_Gun.*7d9254b9d4 // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x7d92a8
	void *d50abb5464(); // Function TslGame.TslWeapon_Gun.*d50abb5464 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5877184
	void *645cb049f3(); // Function TslGame.TslWeapon_Gun.*645cb049f3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5878678
	void *f77e2d0918(); // Function TslGame.TslWeapon_Gun.*f77e2d0918 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xce842c
	void *5916badd5d(); // Function TslGame.TslWeapon_Gun.*5916badd5d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587bf18
	void *9474e42411(); // Function TslGame.TslWeapon_Gun.*9474e42411 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc39a50
	void *89e6daae13(); // Function TslGame.TslWeapon_Gun.*89e6daae13 // Native|Protected // @ game+0x581be18
	void *56cb627bfe(); // Function TslGame.TslWeapon_Gun.*56cb627bfe // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876f30
	void *d217fefb18(); // Function TslGame.TslWeapon_Gun.*d217fefb18 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc1da28
	void *f8b5835e23(); // Function TslGame.TslWeapon_Gun.*f8b5835e23 // Final|Native|Protected // @ game+0x586aac0
	void *8e9681b6b3(); // Function TslGame.TslWeapon_Gun.*8e9681b6b3 // Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable // @ game+0x7d9228
	void *7238c6cabd(); // Function TslGame.TslWeapon_Gun.*7238c6cabd // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x588c2cc
	void *8233686628(); // Function TslGame.TslWeapon_Gun.*8233686628 // Final|Native|Protected // @ game+0x5883c80
	void *ca759233d9(); // Function TslGame.TslWeapon_Gun.*ca759233d9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587af5c
	void *87fa01e824(); // Function TslGame.TslWeapon_Gun.*87fa01e824 // Final|Native|Public // @ game+0x586b090
	struct USkeletalMeshComponent* *2d9038d7a6(); // Function TslGame.TslWeapon_Gun.*2d9038d7a6 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x585e0bc
	void *aee61e7ab2(); // Function TslGame.TslWeapon_Gun.*aee61e7ab2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58982f4
	void OnAttachmentMainScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentMainScopeLoaded // Final|Native|Protected // @ game+0xddafdc
	void *672b48828a(); // Function TslGame.TslWeapon_Gun.*672b48828a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876a0c
	void *be9f3ee916(); // Function TslGame.TslWeapon_Gun.*be9f3ee916 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58792a4
	void *4bd9517890(); // Function TslGame.TslWeapon_Gun.*4bd9517890 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdae7e0
	void *af16a5bb12(); // Function TslGame.TslWeapon_Gun.*af16a5bb12 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587de98
	void *334ef0e092(); // Function TslGame.TslWeapon_Gun.*334ef0e092 // Final|Native|Protected // @ game+0x5883ca0
	void OnInventoryUpdated(); // Function TslGame.TslWeapon_Gun.OnInventoryUpdated // Final|Native|Protected // @ game+0x5880cc0
	void *94cfba4e13(); // Function TslGame.TslWeapon_Gun.*94cfba4e13 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876484
	struct TArray<bool> *2688951a5f(); // Function TslGame.TslWeapon_Gun.*2688951a5f // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x58911a0
	void *3bcb39dceb(); // Function TslGame.TslWeapon_Gun.*3bcb39dceb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876a4c
	void *7fafe3994d(); // Function TslGame.TslWeapon_Gun.*7fafe3994d // Final|Native|Public|BlueprintCallable // @ game+0x5877bf0
	void *27fae159d3(); // Function TslGame.TslWeapon_Gun.*27fae159d3 // Final|Native|Protected // @ game+0x586aac0
	void *d44492c404(); // Function TslGame.TslWeapon_Gun.*d44492c404 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587de58
	void *d2f49b2e73(); // Function TslGame.TslWeapon_Gun.*d2f49b2e73 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587a930
	void *dd730cf1a1(); // Function TslGame.TslWeapon_Gun.*dd730cf1a1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5877348
	enum class EScopeType *bdcd4c7aad(); // Function TslGame.TslWeapon_Gun.*bdcd4c7aad // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587a76c
	void *6343874d32(); // Function TslGame.TslWeapon_Gun.*6343874d32 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xddfe88
	void *5c4ec7287e(); // Function TslGame.TslWeapon_Gun.*5c4ec7287e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58768d0
	void *5a5993ab22(); // Function TslGame.TslWeapon_Gun.*5a5993ab22 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587b1d4
	void OnAttachmentAngledScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentAngledScopeLoaded // Final|Native|Protected // @ game+0xde281c
	void OnRep_AmmoCount(); // Function TslGame.TslWeapon_Gun.OnRep_AmmoCount // Final|Native|Protected // @ game+0xbc66c0
	void *1cfd164c42(); // Function TslGame.TslWeapon_Gun.*1cfd164c42 // Final|Native|Public|BlueprintCallable // @ game+0x586afe8
	void *cb1524fd8b(); // Function TslGame.TslWeapon_Gun.*cb1524fd8b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58784cc
	void *a8450e8eea(); // Function TslGame.TslWeapon_Gun.*a8450e8eea // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x58785b8
	void *e1e9ad443c(); // Function TslGame.TslWeapon_Gun.*e1e9ad443c // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x5818354
	void *f6ec0b44e7(); // Function TslGame.TslWeapon_Gun.*f6ec0b44e7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587a948
	void *d5cf19f24e(); // Function TslGame.TslWeapon_Gun.*d5cf19f24e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876fbc
	void *9b7dc0e466(); // Function TslGame.TslWeapon_Gun.*9b7dc0e466 // Net|NetReliableNative|Event|NetMulticast|Protected|NetClient|NetValidate // @ game+0x586f260
	void *0ee7e5ea24(); // Function TslGame.TslWeapon_Gun.*0ee7e5ea24 // Final|Native|Public|BlueprintCallable // @ game+0x5894510
	void *06b67ba3d6(); // Function TslGame.TslWeapon_Gun.*06b67ba3d6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5879284
	void *1e59df6902(); // Function TslGame.TslWeapon_Gun.*1e59df6902 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876f54
	void *5697579c6d(); // Function TslGame.TslWeapon_Gun.*5697579c6d // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5892900
	void *0696275a99(); // Function TslGame.TslWeapon_Gun.*0696275a99 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587a988
	void *ef18915869(); // Function TslGame.TslWeapon_Gun.*ef18915869 // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x7d9588
	void *54a465935d(); // Function TslGame.TslWeapon_Gun.*54a465935d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587871c
	void *5e3e7843a3(); // Function TslGame.TslWeapon_Gun.*5e3e7843a3 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5871f8c
	void *6da9608937(); // Function TslGame.TslWeapon_Gun.*6da9608937 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58768f0
	void *dcd713af5e(); // Function TslGame.TslWeapon_Gun.*dcd713af5e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x7d9b60
	void *d24afac05e(); // Function TslGame.TslWeapon_Gun.*d24afac05e // Final|Native|Protected // @ game+0x5883df8
	void *9f76a73b4b(); // Function TslGame.TslWeapon_Gun.*9f76a73b4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876a6c
	void *33ad7a91db(); // Function TslGame.TslWeapon_Gun.*33ad7a91db // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0xc0a03c
	void *b8136b02d3(); // Function TslGame.TslWeapon_Gun.*b8136b02d3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xddff3c
	void *1ecf187a6a(); // Function TslGame.TslWeapon_Gun.*1ecf187a6a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876f7c
	void *0921c33473(); // Function TslGame.TslWeapon_Gun.*0921c33473 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x588ddf4
	void *584068b68d(); // Function TslGame.TslWeapon_Gun.*584068b68d // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0xcf814c
	void *72ef0d3b5d(); // Function TslGame.TslWeapon_Gun.*72ef0d3b5d // Final|Native|Public|BlueprintCallable // @ game+0x586afc0
	void *1d3ae10445(); // Function TslGame.TslWeapon_Gun.*1d3ae10445 // Final|Native|Public|BlueprintCallable // @ game+0x586afd4
	void *a265d353e0(); // Function TslGame.TslWeapon_Gun.*a265d353e0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876378
	void *8323a77311(); // Function TslGame.TslWeapon_Gun.*8323a77311 // Final|Native|Public|BlueprintCallable // @ game+0x5895804
	struct UWorld* *75effd3d0d(); // Function TslGame.TslWeapon_Gun.*75effd3d0d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876288
	void *8d08ae855c(); // Function TslGame.TslWeapon_Gun.*8d08ae855c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587de78
	void *43c063f9de(); // Function TslGame.TslWeapon_Gun.*43c063f9de // Final|Native|Public // @ game+0x586c9dc
	void *b43d1f41b0(); // Function TslGame.TslWeapon_Gun.*b43d1f41b0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xceef04
	enum class EScopeType *55a8496363(); // Function TslGame.TslWeapon_Gun.*55a8496363 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587ae4c
	uint32 *66ddae38ec(); // Function TslGame.TslWeapon_Gun.*66ddae38ec // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x588da00
	void *760202dd95(); // Function TslGame.TslWeapon_Gun.*760202dd95 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x587967c
	void *f58e003aa2(); // Function TslGame.TslWeapon_Gun.*f58e003aa2 // Final|Native|Public // @ game+0x586bf78
	void *e71eb940b1(); // Function TslGame.TslWeapon_Gun.*e71eb940b1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x587858c
	void *bfad5612d3(); // Function TslGame.TslWeapon_Gun.*bfad5612d3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587873c
	void *695cb83e1b(int32 Param0); // Function TslGame.TslWeapon_Gun.*695cb83e1b // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x586eb34
	void IsReloading(); // Function TslGame.TslWeapon_Gun.IsReloading // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587d580
	void *4900a04a3a(); // Function TslGame.TslWeapon_Gun.*4900a04a3a // Native|Protected // @ game+0x5830428
	void OnRep_FiringModeIndex(); // Function TslGame.TslWeapon_Gun.OnRep_FiringModeIndex // Final|Native|Public // @ game+0xc03da4
	void *befe40d7ff(); // Function TslGame.TslWeapon_Gun.*befe40d7ff // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876930
	void *d3ddaf3585(); // Function TslGame.TslWeapon_Gun.*d3ddaf3585 // Net|Native|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x7da34c
	void *8db8929ead(); // Function TslGame.TslWeapon_Gun.*8db8929ead // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x587aa88
	void *20715a76a4(); // Function TslGame.TslWeapon_Gun.*20715a76a4 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x586b7e4
	void *441101373c(); // Function TslGame.TslWeapon_Gun.*441101373c // Final|Native|Public // @ game+0x586c8b4
	void *8084d1a51c(); // Function TslGame.TslWeapon_Gun.*8084d1a51c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5875e80
	void *f5b74c15c0(struct F*ae59b13808 Param1); // Function TslGame.TslWeapon_Gun.*f5b74c15c0 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x58873c0
	void *782bfba0ba(); // Function TslGame.TslWeapon_Gun.*782bfba0ba // Final|Native|Public|BlueprintCallable // @ game+0x586af84
	void *8a6c13fc32(); // Function TslGame.TslWeapon_Gun.*8a6c13fc32 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587a90c
	void *9e735d2f78(); // Function TslGame.TslWeapon_Gun.*9e735d2f78 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x588c450
	void *f6e7c43427(); // Function TslGame.TslWeapon_Gun.*f6e7c43427 // Final|Native|Public|BlueprintCallable // @ game+0x586afac
	void OnRep_CurrentCantedZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentCantedZeroLevel // Final|Native|Protected // @ game+0x5881ae4
	void *ad79771a54(); // Function TslGame.TslWeapon_Gun.*ad79771a54 // Final|Native|Public|BlueprintCallable // @ game+0x586af98
	void *ac8ef2385a(); // Function TslGame.TslWeapon_Gun.*ac8ef2385a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587a960
	void *610b6965e4(); // Function TslGame.TslWeapon_Gun.*610b6965e4 // Net|Native|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x7e6e80
	void *f140026efa(); // Function TslGame.TslWeapon_Gun.*f140026efa // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x5891b50
	void *361a9978b3(); // Function TslGame.TslWeapon_Gun.*361a9978b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5877dc4
	void OnGameUserSettingApplied(); // Function TslGame.TslWeapon_Gun.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x58804ec
	void *fe5659c07c(); // Function TslGame.TslWeapon_Gun.*fe5659c07c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x587aa5c
	void *2a0e35c1df(); // Function TslGame.TslWeapon_Gun.*2a0e35c1df // Final|Native|Public|BlueprintCallable // @ game+0x5895074
	void *4c41ab4b0a(); // Function TslGame.TslWeapon_Gun.*4c41ab4b0a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x587a738
	void *3bbd9faae1(); // Function TslGame.TslWeapon_Gun.*3bbd9faae1 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x588616c
	void *4c90c596ca(); // Function TslGame.TslWeapon_Gun.*4c90c596ca // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58768ac
	void *b3601ff626(); // Function TslGame.TslWeapon_Gun.*b3601ff626 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x588c16c
	void *5cc3d97642(); // Function TslGame.TslWeapon_Gun.*5cc3d97642 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876910
	void *39527511d9(); // Function TslGame.TslWeapon_Gun.*39527511d9 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x588d8e0
	void OnRep_CurrentZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentZeroLevel // Final|Native|Protected // @ game+0x5881b88
	void *d915237016(); // Function TslGame.TslWeapon_Gun.*d915237016 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5876a2c
};

// Class TslGame.TslWeapon_Trajectory
// Size: 0x1100 (Inherited: 0x1000)
struct ATslWeapon_Trajectory : ATslWeapon_Gun {
	float *2dadb9f751; // 0xfa0(0x04)
	struct UParticleSystem* *1d421ccf9d; // 0xfb0(0x08)
	struct FName *ef5a1c96b6; // 0xfb8(0x08)
	struct TMap<float, struct UClass*> *ed16b5d4a8; // 0xfc8(0x50)
	float TrajectoryGravityZ; // 0x1024(0x04)
	struct UClass* *947e77bcb9; // 0x1040(0x08)
	struct UClass* *badc1f7ce4; // 0x1048(0x08)
	struct FMulticastDelegate OnWeaponRecoil; // 0x1060(0x10)
	char pad_1088[0x10]; // 0x1088(0x10)
	struct UWeaponTrajectoryData* WeaponTrajectoryData; // 0x1098(0x08)
	char pad_10A0[0x60]; // 0x10a0(0x60)

	void *03e2207fb1(); // Function TslGame.TslWeapon_Trajectory.*03e2207fb1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xaca7dc
	struct FVector *3cbd42e94c(); // Function TslGame.TslWeapon_Trajectory.*3cbd42e94c // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x58b1cb0
	struct FName *cf1db01601(); // Function TslGame.TslWeapon_Trajectory.*cf1db01601 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x58af5d4
	void *37baea2b06(); // Function TslGame.TslWeapon_Trajectory.*37baea2b06 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x587a948
	void *25a733c20e(); // Function TslGame.TslWeapon_Trajectory.*25a733c20e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x58a636c
	struct FVector *cb614778f0(); // Function TslGame.TslWeapon_Trajectory.*cb614778f0 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults|BlueprintCallable // @ game+0xc8e958
	bool *0708b662c3(struct FVector Param1, uint32 Param3, uint32 Param5, int32 Param14, int32 Param16, struct FVector Param18, struct FVector Param20, struct FHitResult Param29, struct FVector Param31, struct FVector Param33, float Param35, float Param45, float Param47, bool Param49, bool Param51); // Function TslGame.TslWeapon_Trajectory.*0708b662c3 // Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x58afa48
	struct AActor* *d8b2fcd506(); // Function TslGame.TslWeapon_Trajectory.*d8b2fcd506 // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x58a45cc
	void *0a77375a9f(); // Function TslGame.TslWeapon_Trajectory.*0a77375a9f // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x58b24cc
	void *4ea9eb6c2d(); // Function TslGame.TslWeapon_Trajectory.*4ea9eb6c2d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x58a6a70
	struct FVector *1064f6fbc4(); // Function TslGame.TslWeapon_Trajectory.*1064f6fbc4 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x58b80b8
	void *e4b877dc4d(); // Function TslGame.TslWeapon_Trajectory.*e4b877dc4d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x58a6cf0
	void *79f6cb9926(enum class EAnimStance Stance); // Function TslGame.TslWeapon_Trajectory.*79f6cb9926 // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5859574
	void *7823e98ae7(); // Function TslGame.TslWeapon_Trajectory.*7823e98ae7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58a6adc
	struct FVector2D *1cfdbe38d0(); // Function TslGame.TslWeapon_Trajectory.*1cfdbe38d0 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x58b1028
	struct FVector *c49b53291c(struct FVector Param1); // Function TslGame.TslWeapon_Trajectory.*c49b53291c // Net|NetReliableNative|Event|Protected|HasDefaults|NetClient|Const // @ game+0x58a4778
	void *d549a38324(); // Function TslGame.TslWeapon_Trajectory.*d549a38324 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58a8d14
	void *e2ec2abd45(); // Function TslGame.TslWeapon_Trajectory.*e2ec2abd45 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58aa40c
	struct FVector_NetQuantize *6bc16182cb(); // Function TslGame.TslWeapon_Trajectory.*6bc16182cb // Net|Native|Event|Protected|NetServer|NetValidate // @ game+0x58af8d4
	void OnRep_WeaponSpread(); // Function TslGame.TslWeapon_Trajectory.OnRep_WeaponSpread // Final|Native|Protected // @ game+0x58ae0b0
	void *56a0cfe44d(); // Function TslGame.TslWeapon_Trajectory.*56a0cfe44d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58a6a98
	void *aaf79f6fec(); // Function TslGame.TslWeapon_Trajectory.*aaf79f6fec // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58a8d4c
	struct FVector *c95c43a68d(); // Function TslGame.TslWeapon_Trajectory.*c95c43a68d // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x58af77c
	void *7ba5c7bc3c(); // Function TslGame.TslWeapon_Trajectory.*7ba5c7bc3c // Final|Native|Private|HasDefaults // @ game+0x58aecc4
	void *407a9b5c22(struct FAttackId Param0); // Function TslGame.TslWeapon_Trajectory.*407a9b5c22 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x58b1ba4
	struct FVector *5869ad32f6(); // Function TslGame.TslWeapon_Trajectory.*5869ad32f6 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x58b819c
	void *25a9a0b9cf(); // Function TslGame.TslWeapon_Trajectory.*25a9a0b9cf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58a8d34
	void *1da0e9a81c(); // Function TslGame.TslWeapon_Trajectory.*1da0e9a81c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x58a63a0
	void *ca7d96d90b(struct FVector Param0); // Function TslGame.TslWeapon_Trajectory.*ca7d96d90b // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x58b82d8
	struct FVector *6f6659b33a(); // Function TslGame.TslWeapon_Trajectory.*6f6659b33a // Net|Native|Event|NetMulticast|Protected|HasDefaults|BlueprintCallable // @ game+0x610474
	void *751760b617(); // Function TslGame.TslWeapon_Trajectory.*751760b617 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x58b119c
	void *279b5d9052(struct FVector Param0); // Function TslGame.TslWeapon_Trajectory.*279b5d9052 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x58b1aa0
};

// Class TslGame.TslFBRWeapon_GatlingGun
// Size: 0x1180 (Inherited: 0x1100)
struct ATslFBRWeapon_GatlingGun : ATslWeapon_Trajectory {
	char pad_1100[0x20]; // 0x1100(0x20)
	float *73958ea08a; // 0x1120(0x04)
	float *7b58746405; // 0x1124(0x04)
	enum class EHeatState *60289f8a66; // 0x1128(0x01)
	char pad_1129[0x57]; // 0x1129(0x57)

	void *bab07f938e(); // Function TslGame.TslFBRWeapon_GatlingGun.*bab07f938e // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x58171a8
	void OnRep_HeatState(); // Function TslGame.TslFBRWeapon_GatlingGun.OnRep_HeatState // Final|Native|Protected // @ game+0x5823bfc
};

// Class TslGame.*a665f1010c
// Size: 0x450 (Inherited: 0x410)
struct U*a665f1010c : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct UImage* GatlingGauge_Image; // 0x418(0x08)
	struct UMaterialInstanceDynamic* *382c0d7609; // 0x420(0x08)
	char pad_428[0x28]; // 0x428(0x28)

	void *5d329ff3c2(); // Function TslGame.*a665f1010c.*5d329ff3c2 // Final|Native|Protected // @ game+0x58205a8
};

// Class TslGame.*0ac19d21a1
// Size: 0x438 (Inherited: 0x410)
struct U*0ac19d21a1 : U*bc854bc287 {
	struct UTextBlock* MVP_PlayerName_Text; // 0x410(0x08)
	struct UWidgetSwitcher* Result_Switcher; // 0x418(0x08)
	struct U*54cc75d10f* Anim_End; // 0x420(0x08)
	char pad_428[0x10]; // 0x428(0x10)
};

// Class TslGame.*0010267165
// Size: 0x428 (Inherited: 0x410)
struct U*0010267165 : U*bc854bc287 {
	struct UTextBlock* PlayerName_Text; // 0x410(0x08)
	struct U*54cc75d10f* Anim_GoalNotify; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
};

// Class TslGame.*310d4c1b67
// Size: 0x490 (Inherited: 0x410)
struct U*310d4c1b67 : U*bc854bc287 {
	struct UTextBlock* HomeGoalCount_Text; // 0x410(0x08)
	struct UTextBlock* AwayGoalCount_Text; // 0x418(0x08)
	struct UTextBlock* Home_Text; // 0x420(0x08)
	struct UTextBlock* Away_Text; // 0x428(0x08)
	struct UImage* HomeBar_Image; // 0x430(0x08)
	struct UImage* AwayBar_Image; // 0x438(0x08)
	struct FLinearColor *61a28df5ad; // 0x440(0x10)
	struct FLinearColor *5f407d1f23; // 0x450(0x10)
	struct FText *53c5764d45; // 0x460(0x18)
	struct FText *968cc53900; // 0x478(0x18)
};

// Class TslGame.*14c035dfba
// Size: 0x428 (Inherited: 0x410)
struct U*14c035dfba : U*bc854bc287 {
	struct UWidgetSwitcher* Round_Switcher; // 0x410(0x08)
	struct UTextBlock* Min_Text; // 0x418(0x08)
	struct UTextBlock* Sec_Text; // 0x420(0x08)
};

// Class TslGame.*a3e9d89cc4
// Size: 0x428 (Inherited: 0x410)
struct U*a3e9d89cc4 : U*bc854bc287 {
	struct U*14c035dfba* TimeInfo; // 0x410(0x08)
	struct U*310d4c1b67* Score; // 0x418(0x08)
	struct U*0010267165* GoalNotify; // 0x420(0x08)

	void NotifyPlayerReconnect(); // Function TslGame.*a3e9d89cc4.NotifyPlayerReconnect // Native|Event|Public|BlueprintEvent // @ game+0x581d220
	void OnMatchStarted(); // Function TslGame.*a3e9d89cc4.OnMatchStarted // Final|Native|Public // @ game+0x5821558
	void NotifyStartCountdown(); // Function TslGame.*a3e9d89cc4.NotifyStartCountdown // Native|Event|Public|BlueprintEvent // @ game+0x581d260
	void NotifyPhaseStart(); // Function TslGame.*a3e9d89cc4.NotifyPhaseStart // Native|Event|Public|BlueprintEvent // @ game+0x581d18c
};

// Class TslGame.*e941af4832
// Size: 0x438 (Inherited: 0x410)
struct U*e941af4832 : U*bc854bc287 {
	struct UTextBlock* Goal_Text; // 0x410(0x08)
	struct UTextBlock* Kill_Text; // 0x418(0x08)
	struct UTextBlock* PlayerName_Text; // 0x420(0x08)
	struct UBorder* Info_Border; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*85de85f6a1
// Size: 0x488 (Inherited: 0x410)
struct U*85de85f6a1 : U*bc854bc287 {
	struct UButton* TopbarButton; // 0x410(0x08)
	struct U*54cc75d10f* Anim_In; // 0x418(0x08)
	struct U*54cc75d10f* Anim_Out; // 0x420(0x08)
	struct UButton* UploadButton; // 0x428(0x08)
	struct UButton* DownloadButton; // 0x430(0x08)
	struct UTextBlock* TitleText; // 0x438(0x08)
	struct UTextBlock* DescriptionText; // 0x440(0x08)
	struct UTextBlock* UploadText; // 0x448(0x08)
	struct UTextBlock* DownloadText; // 0x450(0x08)
	DelegateProperty OnSavePopupButtonPressEvent; // 0x458(0x10)
	DelegateProperty OnLoadPopupButtonPressEvent; // 0x468(0x10)
	struct U*a2aefa7165* *d9aaa74ab9; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)

	void OnLoadPopupButtonPressed(); // Function TslGame.*85de85f6a1.OnLoadPopupButtonPressed // Final|Native|Public // @ game+0x5821028
	void OnTopbarButtonClicked(); // Function TslGame.*85de85f6a1.OnTopbarButtonClicked // Final|Native|Public // @ game+0x5826174
	void OnDownloadButtonHovered(); // Function TslGame.*85de85f6a1.OnDownloadButtonHovered // Final|Native|Public // @ game+0x581f784
	void OnUploadButtonClicked(); // Function TslGame.*85de85f6a1.OnUploadButtonClicked // Final|Native|Public // @ game+0x5826c38
	void OnDownloadButtonClicked(); // Function TslGame.*85de85f6a1.OnDownloadButtonClicked // Final|Native|Public // @ game+0x581f770
	void OnTopbarButtonHovered(); // Function TslGame.*85de85f6a1.OnTopbarButtonHovered // Final|Native|Public // @ game+0x581f784
	void OnSavePopupButtonPressed(); // Function TslGame.*85de85f6a1.OnSavePopupButtonPressed // Final|Native|Public // @ game+0x5824644
	void OnUploadButtonHovered(); // Function TslGame.*85de85f6a1.OnUploadButtonHovered // Final|Native|Public // @ game+0x581f784
};

// Class TslGame.*8a8464eec8
// Size: 0x5b0 (Inherited: 0x410)
struct U*8a8464eec8 : U*bc854bc287 {
	struct F*222dd71306 *00077fcb62; // 0x410(0xd0)
	struct F*8c7bdcaa93 DisplayNameText_Binder; // 0x4e0(0x20)
	struct F*1e5151c8f2 SupplementaryWidgetSizeBox_Binder; // 0x500(0x20)
	struct F*1e5151c8f2 SupplementaryWidgetSwitcher_Binder; // 0x520(0x20)
	struct TMap<enum class ETslGameOptionSupplementaryType, struct UClass*> SupplementaryWidgetClasses; // 0x540(0x50)
	struct U*5a9e6ea43b* LinkButton; // 0x590(0x08)
	struct UTextBlock* LinkButtonText; // 0x598(0x08)
	char pad_5A0[0x10]; // 0x5a0(0x10)

	void OnClicked_LinkButton(); // Function TslGame.*8a8464eec8.OnClicked_LinkButton // Final|Native|Private // @ game+0x581eb30
};

// Class TslGame.*d096db5074
// Size: 0x460 (Inherited: 0x410)
struct U*d096db5074 : U*bc854bc287 {
	struct F*72b0194904 EnterHover; // 0x410(0x20)
	struct F*72b0194904 LeaveHover; // 0x430(0x20)
	struct UImage* ConsolImage; // 0x450(0x08)
	struct UImage* PcImage; // 0x458(0x08)
};

// Class TslGame.*c92ae3429d
// Size: 0x520 (Inherited: 0x410)
struct U*c92ae3429d : U*bc854bc287 {
	struct TArray<struct FKey> *37ddc914a4; // 0x410(0x10)
	struct U*3d89ff905a* Owner; // 0x420(0x08)
	int32 SlotIndex; // 0x428(0x04)
	bool *48e1338ca1; // 0x42c(0x01)
	bool *6059222592; // 0x42d(0x01)
	bool *08900e2c75; // 0x42e(0x01)
	bool *bf90d690c4; // 0x42f(0x01)
	struct TArray<struct FKey> *e212c7861a; // 0x430(0x10)
	struct FTslInputKey *915b2890be; // 0x440(0x20)
	struct FTslInputKey *edd5b00a07; // 0x460(0x20)
	bool bForceToUseLeftModifierKeys; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)
	struct F*7c50600f8f InputKeyDisplayBorder_Binder; // 0x488(0x30)
	struct F*1e5151c8f2 InputKeyIconizer_Binder; // 0x4b8(0x20)
	struct F*1e5151c8f2 Highlighter_Binder; // 0x4d8(0x20)
	struct UTexture2D* BackgroundTextureNormal; // 0x4f8(0x08)
	struct UTexture2D* BackgroundTextureHighlighted; // 0x500(0x08)
	struct UTexture2D* BackgroundTextureInput; // 0x508(0x08)
	struct FMulticastDelegate OnKeyBinderSlotValueChangeEvent; // 0x510(0x10)
};

// Class TslGame.*884afd0a54
// Size: 0x4b8 (Inherited: 0x410)
struct U*884afd0a54 : U*bc854bc287 {
	struct U*741254b6c0* Owner; // 0x410(0x08)
	int32 Index; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct F*aad5c0ee0d SizeBox_Binder; // 0x420(0x28)
	struct F*1e5151c8f2 Button_Binder; // 0x448(0x20)
	struct F*7c50600f8f InnerBorder_Binder; // 0x468(0x30)
	struct FLinearColor ColorNormal; // 0x498(0x10)
	struct FLinearColor ColorHighlighted; // 0x4a8(0x10)

	void OnClicked(); // Function TslGame.*884afd0a54.OnClicked // Final|Native|Public // @ game+0x581ea5c
};

// Class TslGame.*b49b60302e
// Size: 0x450 (Inherited: 0x410)
struct U*b49b60302e : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct U*aa4be1097b* *1a724b9273; // 0x418(0x08)
	struct F*d9642c06a9 *2fd7fd3911; // 0x420(0x14)
	char pad_434[0x4]; // 0x434(0x04)
	struct F*d9642c06a9 *abc81851ac; // 0x438(0x14)
	char pad_44C[0x4]; // 0x44c(0x04)
};

// Class TslGame.*d78124d371
// Size: 0x7d0 (Inherited: 0x450)
struct U*d78124d371 : U*b49b60302e {
	char pad_450[0x1b0]; // 0x450(0x1b0)
	struct F*222dd71306 *5bef755f74; // 0x600(0xd0)
	struct FName *25f4fa3b11; // 0x6d0(0x08)
	struct FName *0e36fe67a4; // 0x6d8(0x08)
	struct FName *e189eeab56; // 0x6e0(0x08)
	struct FName ItemName; // 0x6e8(0x08)
	int32 *3afde06668; // 0x6f0(0x04)
	char pad_6F4[0x4]; // 0x6f4(0x04)
	struct FText DescriptionText; // 0x6f8(0x18)
	bool *727cdd26b4; // 0x710(0x01)
	bool *5cb4c9b431; // 0x711(0x01)
	bool *0b847d47da; // 0x712(0x01)
	bool *48e1338ca1; // 0x713(0x01)
	char pad_714[0x4]; // 0x714(0x04)
	struct U*425c4cd4f3* *224436e5cc; // 0x718(0x08)
	struct U*a2aefa7165* *d9aaa74ab9; // 0x720(0x08)
	struct UBorder* IndentationBorder; // 0x728(0x08)
	struct U*68fe248867* DisplayNameFlowText; // 0x730(0x08)
	struct UButton* HoverHighlightButton; // 0x738(0x08)
	struct UImage* TooltipIconImage; // 0x740(0x08)
	struct F*1e5151c8f2 Highlit_Binder; // 0x748(0x20)
	struct FLinearColor ColorNormal; // 0x768(0x10)
	struct FLinearColor ColorHighlighted; // 0x778(0x10)
	struct FLinearColor ColorTooltipIconHighlighted; // 0x788(0x10)
	struct FLinearColor ColorEnabled; // 0x798(0x10)
	struct FLinearColor ColorDisabled; // 0x7a8(0x10)
	float IndentationSize; // 0x7b8(0x04)
	char pad_7BC[0x4]; // 0x7bc(0x04)
	struct FMulticastDelegate OnGamepadYEvent; // 0x7c0(0x10)

	bool UpdateWidgetOnSlider(); // Function TslGame.*d78124d371.UpdateWidgetOnSlider // Final|Native|Public // @ game+0x5918084
	void UpdateWidgetByDependentStepper(bool Param1); // Function TslGame.*d78124d371.UpdateWidgetByDependentStepper // Final|Native|Public // @ game+0x5917d58
	bool UpdateWidgetOnDependentSlider(); // Function TslGame.*d78124d371.UpdateWidgetOnDependentSlider // Final|Native|Public // @ game+0x5917ee8
	bool *86bd205947(bool Param2); // Function TslGame.*d78124d371.*86bd205947 // Final|Native|Public // @ game+0x59182b4
	void OnCloudOptionTooltipDeactivated(); // Function TslGame.*d78124d371.OnCloudOptionTooltipDeactivated // Final|Native|Public // @ game+0x590df08
	void UpdateWidget(); // Function TslGame.*d78124d371.UpdateWidget // Final|Native|Public // @ game+0x5917ccc
	void OnCloudOptionTooltipActivated(); // Function TslGame.*d78124d371.OnCloudOptionTooltipActivated // Final|Native|Public // @ game+0x590def4
};

// Class TslGame.*e444a66baf
// Size: 0x868 (Inherited: 0x7d0)
struct U*e444a66baf : U*d78124d371 {
	float *56bad2fa81; // 0x7d0(0x04)
	char pad_7D4[0x4]; // 0x7d4(0x04)
	struct UButton* OptionButton; // 0x7d8(0x08)
	struct UTextBlock* OptionButtonText; // 0x7e0(0x08)
	char pad_7E8[0x70]; // 0x7e8(0x70)
	bool *8bd21a4729; // 0x858(0x01)
	char pad_859[0x7]; // 0x859(0x07)
	struct F*da672abddc *1b1632b221; // 0x860(0x08)

	void OnPopupButtonPressedEvent(); // Function TslGame.*e444a66baf.OnPopupButtonPressedEvent // Final|Native|Protected // @ game+0x5823544
	void ShowPopupDialogEx(); // Function TslGame.*e444a66baf.ShowPopupDialogEx // Final|Native|Protected // @ game+0x582fcc4
};

// Class TslGame.*befee03514
// Size: 0x890 (Inherited: 0x7d0)
struct U*befee03514 : U*d78124d371 {
	bool *a5bd05f019; // 0x7d0(0x01)
	char pad_7D1[0x3]; // 0x7d1(0x03)
	int32 *76c3412af2; // 0x7d4(0x04)
	int32 *f40dac4efb; // 0x7d8(0x04)
	char pad_7DC[0x4]; // 0x7dc(0x04)
	struct TArray<struct F*c3b7d13818> *438771ef40; // 0x7e0(0x10)
	struct U*878cba2d6a* *e417a3def4; // 0x7f0(0x08)
	struct TArray<struct U*878cba2d6a*> *fdcbec3720; // 0x7f8(0x10)
	int32 *6bea4d4e71; // 0x808(0x04)
	bool *b21a9aad79; // 0x80c(0x01)
	char pad_80D[0x3]; // 0x80d(0x03)
	struct UStringTable* DropDownListStringTable; // 0x810(0x08)
	struct UStringTable* DropDownListDetailedStringTable; // 0x818(0x08)
	struct F*1e5151c8f2 DropDownList_Binder; // 0x820(0x20)
	struct F*b1a0bce7e4 DownArrowImage_Binder; // 0x840(0x28)
	struct UClass* DropDownListSelectableWidgetClass; // 0x868(0x08)
	enum class EHorizontalAlignment *128c4cd932; // 0x870(0x01)
	char pad_871[0x7]; // 0x871(0x07)
	struct FMulticastDelegate OnDropDownListSelectionChangeEvent; // 0x878(0x10)
	int32 *dc90668dcb; // 0x888(0x04)
	char pad_88C[0x4]; // 0x88c(0x04)

	void OnComboBoxSelectionChanged(struct FString Param0); // Function TslGame.*befee03514.OnComboBoxSelectionChanged // Final|Native|Public // @ game+0x581ecf0
	struct FString OnGenerateWidget(); // Function TslGame.*befee03514.OnGenerateWidget // Final|Native|Public // @ game+0x5820234
	void *0179d09c7e(); // Function TslGame.*befee03514.*0179d09c7e // Final|Native|Public // @ game+0x581ecc8
	void OnComboBoxOpening(); // Function TslGame.*befee03514.OnComboBoxOpening // Final|Native|Public // @ game+0x581ecdc
	void OnAfterGenerateWidget(); // Function TslGame.*befee03514.OnAfterGenerateWidget // Final|Native|Public // @ game+0x581d598
};

// Class TslGame.*52043f8006
// Size: 0x8a0 (Inherited: 0x890)
struct U*52043f8006 : U*befee03514 {
	struct TArray<struct FName> *b7e86f04c9; // 0x890(0x10)

	struct FString OnMusicSelectionChanged(); // Function TslGame.*52043f8006.OnMusicSelectionChanged // Final|Native|Public // @ game+0x582210c
};

// Class TslGame.*09cb64dd50
// Size: 0x868 (Inherited: 0x7d0)
struct U*09cb64dd50 : U*d78124d371 {
	float *b9106d0cd5; // 0x7d0(0x04)
	char pad_7D4[0x4]; // 0x7d4(0x04)
	struct FText DetailedDescriptionText; // 0x7d8(0x18)
	struct FVector2D *cb9a483f16; // 0x7f0(0x08)
	int32 *aeb5aa4a35; // 0x7f8(0x04)
	float *88ef6f1828; // 0x7fc(0x04)
	bool *d3652f4da1; // 0x800(0x01)
	bool *cb9858f9d3; // 0x801(0x01)
	char pad_802[0x6]; // 0x802(0x06)
	struct F*1e5151c8f2 Slider_Binder; // 0x808(0x20)
	struct F*1e5151c8f2 SliderEditableValueText_Binder; // 0x828(0x20)
	struct FMulticastDelegate OnSliderValueChangeEvent; // 0x848(0x10)
	float *ff070dbf37; // 0x858(0x04)
	char pad_85C[0x4]; // 0x85c(0x04)
	float *cc86f6a086; // 0x860(0x04)
	float *4a6a1d8bee; // 0x864(0x04)

	void OnSliderValueChanged(); // Function TslGame.*09cb64dd50.OnSliderValueChanged // Native|Public // @ game+0x5824a8c
	void OnSliderAdjustmentBegin(); // Function TslGame.*09cb64dd50.OnSliderAdjustmentBegin // Final|Native|Public // @ game+0x5824a60
	void *84b5171717(); // Function TslGame.*09cb64dd50.*84b5171717 // Final|Native|Private // @ game+0x582901c
	void OnSliderAdjustmentEnd(); // Function TslGame.*09cb64dd50.OnSliderAdjustmentEnd // Final|Native|Public // @ game+0x5824a78
	void OnSliderValueTextCommitted(); // Function TslGame.*09cb64dd50.OnSliderValueTextCommitted // Final|Native|Public|HasOutParms // @ game+0x5824c04
	void OnSliderValueTextChanged(); // Function TslGame.*09cb64dd50.OnSliderValueTextChanged // Final|Native|Public|HasOutParms // @ game+0x5824b28
};

// Class TslGame.*0d6e75e856
// Size: 0x8b0 (Inherited: 0x868)
struct U*0d6e75e856 : U*09cb64dd50 {
	struct UWidgetSwitcher* VolumePreviewButtonSwitcher; // 0x868(0x08)
	struct UButton* VolumePreviewButtonPlay; // 0x870(0x08)
	struct UButton* VolumePreviewButtonStop; // 0x878(0x08)
	struct UAkComponent* *c39ae79647; // 0x880(0x08)
	struct UAkAudioEvent* *65bf825b9b; // 0x888(0x08)
	struct UAkAudioEvent* *7abed29c77; // 0x890(0x08)
	bool *598733c5c5; // 0x898(0x01)
	char pad_899[0x3]; // 0x899(0x03)
	float *8b900ea8db; // 0x89c(0x04)
	struct FName RTPC_Name; // 0x8a0(0x08)
	char pad_8A8[0x8]; // 0x8a8(0x08)

	void StopGuideAkEvent(); // Function TslGame.*0d6e75e856.StopGuideAkEvent // Final|Native|Public|BlueprintCallable // @ game+0x5830454
	void StartGuideAkEvent(); // Function TslGame.*0d6e75e856.StartGuideAkEvent // Final|Native|Public|BlueprintCallable // @ game+0x5830414
	void *5f82e4f6bb(); // Function TslGame.*0d6e75e856.*5f82e4f6bb // Final|Native|Protected // @ game+0x581a668
	void *3e5ce2d79b(); // Function TslGame.*0d6e75e856.*3e5ce2d79b // Final|Native|Protected // @ game+0x581660c
};

// Class TslGame.*741254b6c0
// Size: 0x8e0 (Inherited: 0x7d0)
struct U*741254b6c0 : U*d78124d371 {
	bool *36beb3a60e; // 0x7d0(0x01)
	bool *801cf4581c; // 0x7d1(0x01)
	char pad_7D2[0x2]; // 0x7d2(0x02)
	int32 *11c3f4e32b; // 0x7d4(0x04)
	int32 *f40dac4efb; // 0x7d8(0x04)
	char pad_7DC[0x4]; // 0x7dc(0x04)
	struct TArray<struct F*c3b7d13818> *26a4a1e04d; // 0x7e0(0x10)
	struct UStringTable* StepperStringTable; // 0x7f0(0x08)
	struct UStringTable* StepperDetailedStringTable; // 0x7f8(0x08)
	struct U*68fe248867* StepperFlowText; // 0x800(0x08)
	struct F*f90b3e2b9a StepperIndicatorHorizontalBox_Binder; // 0x808(0x28)
	struct UClass* StepperIndicatorWidgetClass; // 0x830(0x08)
	struct F*1e5151c8f2 LeftArrowButton_Binder; // 0x838(0x20)
	struct F*1e5151c8f2 RightArrowButton_Binder; // 0x858(0x20)
	struct FMulticastDelegate OnStepperValueChangeEvent; // 0x878(0x10)
	struct TArray<struct F*86f2230515> *752a7cf2ae; // 0x888(0x10)
	char pad_898[0x48]; // 0x898(0x48)

	void OnRightArrowButtonClicked(); // Function TslGame.*741254b6c0.OnRightArrowButtonClicked // Final|Native|Public // @ game+0x5824510
	void OnLeftArrowButtonClicked(); // Function TslGame.*741254b6c0.OnLeftArrowButtonClicked // Final|Native|Public // @ game+0x5820f58
};

// Class TslGame.*9822bd93d0
// Size: 0x8f0 (Inherited: 0x8e0)
struct U*9822bd93d0 : U*741254b6c0 {
	struct TArray<struct FName> *b7e86f04c9; // 0x8e0(0x10)

	void OnRightButtonClicked(); // Function TslGame.*9822bd93d0.OnRightButtonClicked // Final|Native|Private // @ game+0x5820f6c
	void OnLeftButtonClicked(); // Function TslGame.*9822bd93d0.OnLeftButtonClicked // Final|Native|Private // @ game+0x5820f6c
	void OnMusicSelectionChanged(); // Function TslGame.*9822bd93d0.OnMusicSelectionChanged // Final|Native|Public // @ game+0x5822254
};

// Class TslGame.*7bd9e40db9
// Size: 0x428 (Inherited: 0x410)
struct U*7bd9e40db9 : U*bc854bc287 {
	struct UClass* SubTabLabelWidgetClass; // 0x410(0x08)
	struct UHorizontalBox* TabLabels; // 0x418(0x08)
	float LabelIntervalWidth; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
};

// Class TslGame.*0a124fa67c
// Size: 0x410 (Inherited: 0x410)
struct U*0a124fa67c : U*bc854bc287 {
};

// Class TslGame.*75bb92a087
// Size: 0x438 (Inherited: 0x410)
struct U*75bb92a087 : U*0a124fa67c {
	struct F*b1a0bce7e4 Image_Binder; // 0x410(0x28)
};

// Class TslGame.*8644017778
// Size: 0x498 (Inherited: 0x410)
struct U*8644017778 : U*0a124fa67c {
	struct F*b1a0bce7e4 Image_Binder; // 0x410(0x28)
	struct TMap<struct FString, struct F*bb27a7c784> *b48a0ef21c; // 0x438(0x50)
	struct FString *02186ae40a; // 0x488(0x10)
};

// Class TslGame.*602f594969
// Size: 0x438 (Inherited: 0x410)
struct U*602f594969 : U*0a124fa67c {
	struct F*b1a0bce7e4 Crosshair_Binder; // 0x410(0x28)
};

// Class TslGame.*45eaeb2e29
// Size: 0x410 (Inherited: 0x410)
struct U*45eaeb2e29 : U*0a124fa67c {

	void UpdateVolumeUnitMeter(); // Function TslGame.*45eaeb2e29.UpdateVolumeUnitMeter // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	float OnMicVuMeterUpdated(); // Function TslGame.*45eaeb2e29.OnMicVuMeterUpdated // Final|Native|Public // @ game+0x5821acc
};

// Class TslGame.*ea67073620
// Size: 0x4b8 (Inherited: 0x410)
struct U*ea67073620 : U*bc854bc287 {
	struct FName *2ec9929fda; // 0x410(0x08)
	struct F*1e5151c8f2 LabelButton_Binder; // 0x418(0x20)
	struct F*8c7bdcaa93 LabelText_Binder; // 0x438(0x20)
	struct F*f90b3e2b9a HighlightDecoration_Binder; // 0x458(0x28)
	struct FLinearColor LabelTextNormalColor; // 0x480(0x10)
	struct FLinearColor LabelTextHighlightColor; // 0x490(0x10)
	struct UBorder* Active_Border; // 0x4a0(0x08)
	char pad_4A8[0x10]; // 0x4a8(0x10)

	void OnLabelButtonClicked(); // Function TslGame.*ea67073620.OnLabelButtonClicked // Final|Native|Private // @ game+0x5820c7c
};

// Class TslGame.*b06ed536c2
// Size: 0x448 (Inherited: 0x410)
struct U*b06ed536c2 : U*bc854bc287 {
	struct UClass* TabLabelWidgetClass; // 0x410(0x08)
	struct F*f90b3e2b9a TabLabelWidgetsBox_Binder; // 0x418(0x28)
	float LabelIntervalWidth; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class TslGame.*e3cb0f7f6b
// Size: 0x430 (Inherited: 0x410)
struct U*e3cb0f7f6b : U*bc854bc287 {
	struct UTextBlock* OptionTooltipText; // 0x410(0x08)
	struct FVector2D PositionOffset; // 0x418(0x08)
	struct UWidget* *882487bb0b; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*3b353a21cb
// Size: 0x4c8 (Inherited: 0x410)
struct U*3b353a21cb : U*bc854bc287 {
	struct F*1e5151c8f2 *5ac0db44af; // 0x410(0x20)
	struct F*938b8814f5 *2fbf43647f; // 0x430(0x28)
	struct F*938b8814f5 *68a00481e0; // 0x458(0x28)
	struct F*d19b0bbaa6 *3c1efbd397; // 0x480(0x20)
	struct F*d19b0bbaa6 *1f91e2848f; // 0x4a0(0x20)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	void NotifyWeaponUnarmed(); // Function TslGame.*3b353a21cb.NotifyWeaponUnarmed // Final|Native|Private // @ game+0xc6b9b0
	void RuntimeInit_Implementation(); // Function TslGame.*3b353a21cb.RuntimeInit_Implementation // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnStanceChanged(enum class EStanceMode Param0); // Function TslGame.*3b353a21cb.OnStanceChanged // Final|Native|Private // @ game+0xc6df00
	void OnPossessPawnChanged(); // Function TslGame.*3b353a21cb.OnPossessPawnChanged // Final|Native|Private // @ game+0xbf00fc
	void NotifyReloadingNeed(); // Function TslGame.*3b353a21cb.NotifyReloadingNeed // Final|Native|Private // @ game+0x581d238
};

// Class TslGame.*0b5eebdcb0
// Size: 0x4e0 (Inherited: 0x4c8)
struct U*0b5eebdcb0 : U*3b353a21cb {
	struct USizeBox* KeyHint_SizeBox; // 0x4c8(0x08)
	float *1032644a77; // 0x4d0(0x04)
	float *2c2227b016; // 0x4d4(0x04)
	char pad_4D8[0x8]; // 0x4d8(0x08)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*0b5eebdcb0.UpdatePositionOnMinimapExtended // Final|Native|Private // @ game+0x5831518
};

// Class TslGame.*43f8d59d6f
// Size: 0x438 (Inherited: 0x410)
struct U*43f8d59d6f : U*bc854bc287 {
	struct F*06751c9d06 *6b230e33be; // 0x410(0x28)
};

// Class TslGame.*34cda9bf09
// Size: 0x450 (Inherited: 0x410)
struct U*34cda9bf09 : U*bc854bc287 {
	struct F*8c7bdcaa93 *6fab13d2fa; // 0x410(0x20)
	struct F*8c7bdcaa93 *9c747a3c65; // 0x430(0x20)
};

// Class TslGame.*4543de6f84
// Size: 0x448 (Inherited: 0x410)
struct U*4543de6f84 : U*bc854bc287 {
	char pad_410[0x18]; // 0x410(0x18)
	struct F*8c7bdcaa93 *6fab13d2fa; // 0x428(0x20)
};

// Class TslGame.*b32f54f34a
// Size: 0x470 (Inherited: 0x410)
struct U*b32f54f34a : U*bc854bc287 {
	struct UMaterialInstanceDynamic* *a289ce3559; // 0x410(0x08)
	struct UMaterialInterface* *d540db6445; // 0x418(0x08)
	struct F*b1a0bce7e4 *4ebf01f5f4; // 0x420(0x28)
	struct F*b1a0bce7e4 *99fe37be7e; // 0x448(0x28)
};

// Class TslGame.*8f11713ec2
// Size: 0x4a0 (Inherited: 0x410)
struct U*8f11713ec2 : U*bc854bc287 {
	struct F*be81a602d7 *f687fe8f8a; // 0x410(0x28)
	struct F*be81a602d7 *6f4fe235ba; // 0x438(0x28)
	bool *637dc33257; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct UClass* ItemSlotClass; // 0x468(0x08)
	int32 WidgetReserveCount; // 0x470(0x04)
	bool bCacheFirstInnerSlot; // 0x474(0x01)
	char pad_475[0x3]; // 0x475(0x03)
	int32 InnerSlotReserveCount; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct F*8c648d55c2 *2cf22cc161; // 0x480(0x18)
	char pad_498[0x8]; // 0x498(0x08)

	void *8519cca96c(); // Function TslGame.*8f11713ec2.*8519cca96c // Final|Native|Protected // @ game+0x5820f84
};

// Class TslGame.*fe5186df91
// Size: 0x470 (Inherited: 0x410)
struct U*fe5186df91 : U*bc854bc287 {
	struct U*120c72ed42* KillerDebuff_Widget; // 0x410(0x08)
	struct U*120c72ed42* SurvivorExhausted_Widget; // 0x418(0x08)
	struct UImage* Bleeding_Image; // 0x420(0x08)
	struct U*a375e1ff3d* EndGameGauge; // 0x428(0x08)
	struct U*41114bfae7* Interaction_Widget; // 0x430(0x08)
	struct U*5c174e070f* HASQTEWidget; // 0x438(0x08)
	struct U*d84c2eefcd* Indicator_Widget0; // 0x440(0x08)
	struct U*d84c2eefcd* Indicator_Widget1; // 0x448(0x08)
	struct U*d84c2eefcd* Indicator_Widget2; // 0x450(0x08)
	struct TArray<struct U*d84c2eefcd*> *503231f97e; // 0x458(0x10)
	char pad_468[0x8]; // 0x468(0x08)
};

// Class TslGame.*d84c2eefcd
// Size: 0x420 (Inherited: 0x410)
struct U*d84c2eefcd : U*bc854bc287 {
	struct AActor* *b08a07ba13; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
};

// Class TslGame.*712196be17
// Size: 0x440 (Inherited: 0x410)
struct U*712196be17 : U*bc854bc287 {
	struct UImage* KeyImage; // 0x410(0x08)
	struct FKey Key; // 0x418(0x18)
	float DesiredWidgetHeight; // 0x430(0x04)
	bool bForceKeyboardIcon; // 0x434(0x01)
	char pad_435[0xb]; // 0x435(0x0b)

	void UpdateByInputKey(); // Function TslGame.*712196be17.UpdateByInputKey // Native|Public|HasOutParms|BlueprintCallable // @ game+0x5954548
};

// Class TslGame.*7d71d941dd
// Size: 0x468 (Inherited: 0x440)
struct U*7d71d941dd : U*712196be17 {
	bool bShift; // 0x440(0x01)
	bool bCtrl; // 0x441(0x01)
	bool bAlt; // 0x442(0x01)
	char pad_443[0x5]; // 0x443(0x05)
	struct U*7762a61952* ModifierPanel; // 0x448(0x08)
	struct UImage* ModifierKeyImage; // 0x450(0x08)
	struct UTextBlock* PlusTextBlock; // 0x458(0x08)
	int32 DesiredPlusTextFontSize; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
};

// Class TslGame.*19bc588f4c
// Size: 0x4c8 (Inherited: 0x468)
struct U*19bc588f4c : U*7d71d941dd {
	struct UImage* KeyboardHoldSpinner; // 0x468(0x08)
	struct U*7762a61952* KeyboardHoldSpinnerPanel; // 0x470(0x08)
	struct UImage* MouseHoldSpinner; // 0x478(0x08)
	struct U*7762a61952* MouseHoldSpinnerPanel; // 0x480(0x08)
	struct UImage* DoubleTapImage; // 0x488(0x08)
	struct UImage* HoldTriangleImage; // 0x490(0x08)
	struct U*54cc75d10f* HoldAnimation; // 0x498(0x08)
	struct UMaterialParameterCollection* InteractionHoldMPC; // 0x4a0(0x08)
	float HoldDuration; // 0x4a8(0x04)
	float *2eeb49b649; // 0x4ac(0x04)
	bool *483a5577ed; // 0x4b0(0x01)
	bool *225d0e0e28; // 0x4b1(0x01)
	bool *77edaca154; // 0x4b2(0x01)
	enum class EKeyboardKeyIconDisplayType *11623d36b7; // 0x4b3(0x01)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct FName ActionName; // 0x4b8(0x08)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	float HoldKeyboard(); // Function TslGame.*19bc588f4c.HoldKeyboard // Final|Native|Protected // @ game+0x581b220
};

// Class TslGame.*41114bfae7
// Size: 0x600 (Inherited: 0x410)
struct U*41114bfae7 : U*bc854bc287 {
	struct TMap<enum class ETslHASInteractionMethod, struct UTexture2D*> InteractionTextureMap; // 0x410(0x50)
	struct TMap<enum class ETslHASInteractionType, struct FText> InteractionTextMap; // 0x460(0x50)
	struct UMaterialInstanceDynamic* *3373a51478; // 0x4b0(0x08)
	struct FName CancelPcKeyName; // 0x4b8(0x08)
	struct FName SelfHealPcKeyName; // 0x4c0(0x08)
	struct FName FirePcKeyName; // 0x4c8(0x08)
	struct FText CancelPcKeyText; // 0x4d0(0x18)
	struct FText SelfHealPcKeyText; // 0x4e8(0x18)
	struct FText FirePcKeyText; // 0x500(0x18)
	struct F*ce98e6dac5 CancelPadKeyInfo; // 0x518(0x30)
	struct F*ce98e6dac5 SelfHealPadKeyInfo; // 0x548(0x30)
	struct F*ce98e6dac5 FirePadKeyInfo; // 0x578(0x30)
	struct UHorizontalBox* Interaction_HBox; // 0x5a8(0x08)
	struct UTextBlock* Interaction_TextBlock; // 0x5b0(0x08)
	struct UImage* Interaction_Image; // 0x5b8(0x08)
	struct UImage* InteractionGauge_Image; // 0x5c0(0x08)
	struct UImage* BuffIcon_Image; // 0x5c8(0x08)
	struct UImage* SelfHealLimit_Image; // 0x5d0(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x5d8(0x08)
	struct U*290fc681a4* UniversalInputVisibilitySwitcher; // 0x5e0(0x08)
	struct U*19bc588f4c* PCKeyGuideIcon; // 0x5e8(0x08)
	struct UTextBlock* PCGuideText; // 0x5f0(0x08)
	struct U*672373cc62* PadKeyGuideIcon; // 0x5f8(0x08)
};

// Class TslGame.*bac182c9ab
// Size: 0x530 (Inherited: 0x410)
struct U*bac182c9ab : U*bc854bc287 {
	struct TMap<struct FName, struct UTexture2D*> KillerWeaponIconMap; // 0x410(0x50)
	struct TMap<enum class EHASSurvivorItemLevel, struct UTexture2D*> SurvivorItemBackgroundMap; // 0x460(0x50)
	struct TMap<enum class EHASSurvivorItemType, struct UTexture2D*> SurvivorItemIconMap; // 0x4b0(0x50)
	struct UImage* Bg_Image; // 0x500(0x08)
	struct UImage* ItemGauge_Image; // 0x508(0x08)
	struct UImage* Item_Image; // 0x510(0x08)
	struct UTextBlock* Count_Text; // 0x518(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x520(0x08)
	struct USizeBox* FireSizeBox; // 0x528(0x08)
};

// Class TslGame.*a375e1ff3d
// Size: 0x488 (Inherited: 0x410)
struct U*a375e1ff3d : U*bc854bc287 {
	struct UImage* LastGauge_Image; // 0x410(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x418(0x08)
	struct UMaterialInstanceDynamic* *431fcb4da1; // 0x420(0x08)
	struct FName *3f96330a5b; // 0x428(0x08)
	struct FName *419f977d3e; // 0x430(0x08)
	struct FName *71791e0207; // 0x438(0x08)
	struct U*54cc75d10f* HAS_Alarm_Final_Collapse_Lv1; // 0x440(0x08)
	struct U*54cc75d10f* HAS_Alarm_Final_Collapse_Lv2; // 0x448(0x08)
	struct U*54cc75d10f* HAS_Alarm_Final_Collapse_Lv3; // 0x450(0x08)
	struct U*54cc75d10f* HAS_Alarm_Final_Collapse_Lv4; // 0x458(0x08)
	char pad_460[0x1]; // 0x460(0x01)
	bool bDBNOCharacterInEndGame; // 0x461(0x01)
	char pad_462[0x26]; // 0x462(0x26)
};

// Class TslGame.*1a84f93bab
// Size: 0x528 (Inherited: 0x410)
struct U*1a84f93bab : U*bc854bc287 {
	char pad_410[0x18]; // 0x410(0x18)
	struct TMap<enum class EHASSurvivorItemType, struct UTexture2D*> SurvivorItemTextureMap; // 0x428(0x50)
	struct TMap<enum class EHASSurvivorState, struct UTexture2D*> SurvivorStateTextureMap; // 0x478(0x50)
	float NameTextOpacityWhenAlive; // 0x4c8(0x04)
	float NameTextOpacityWhenDead; // 0x4cc(0x04)
	struct UMaterialInstanceDynamic* *e03bc7ca89; // 0x4d0(0x08)
	struct UImage* SquadBg_Image; // 0x4d8(0x08)
	struct UImage* Role_Image; // 0x4e0(0x08)
	struct UImage* Warning_Image; // 0x4e8(0x08)
	struct UImage* State_Image; // 0x4f0(0x08)
	struct U*24809ef0d2* PlatformImage; // 0x4f8(0x08)
	struct UTextBlock* Name_TextBlock; // 0x500(0x08)
	struct UImage* Gauge_Image; // 0x508(0x08)
	struct UImage* Cabinet1_Image; // 0x510(0x08)
	struct UImage* Cabinet2_Image; // 0x518(0x08)
	struct UImage* Cabinet3_Image; // 0x520(0x08)
};

// Class TslGame.*d40cc00989
// Size: 0x430 (Inherited: 0x410)
struct U*d40cc00989 : U*bc854bc287 {
	struct UClass* *8ad55e403d; // 0x410(0x08)
	struct TArray<struct U*1a84f93bab*> *78b6a0f4b2; // 0x418(0x10)
	struct UVerticalBox* Squard_VBox; // 0x428(0x08)
};

// Class TslGame.*002aeba78a
// Size: 0x438 (Inherited: 0x410)
struct U*002aeba78a : U*bc854bc287 {
	struct UImage* Phase_Image; // 0x410(0x08)
	struct UTextBlock* Engine_TextBlock; // 0x418(0x08)
	struct UTexture2D* *802c95efd8; // 0x420(0x08)
	struct UTexture2D* *ab01a6c75e; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*f2290782c5
// Size: 0x420 (Inherited: 0x410)
struct U*f2290782c5 : U*bc854bc287 {
	struct UImage* SkillIcon_Image; // 0x410(0x08)
	struct UTextBlock* SkillDesc_Text; // 0x418(0x08)
};

// Class TslGame.*e0ab1507c0
// Size: 0x498 (Inherited: 0x410)
struct U*e0ab1507c0 : U*bc854bc287 {
	enum class *cdbae7697e WeaponType; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct UTexture2D* *c46cfb7f8e; // 0x418(0x08)
	bool *ca8652f277; // 0x420(0x01)
	bool *5e1b69a66e; // 0x421(0x01)
	bool *61c0f1e96e; // 0x422(0x01)
	bool *b448c8071d; // 0x423(0x01)
	char pad_424[0x4]; // 0x424(0x04)
	struct UMaterialInstanceDynamic* *b6f0aef3db; // 0x428(0x08)
	struct UImage* Item_Image; // 0x430(0x08)
	struct UImage* CoolTimeGraphImage; // 0x438(0x08)
	struct UTextBlock* Count_Text; // 0x440(0x08)
	struct UImage* FireDarkBg; // 0x448(0x08)
	struct USizeBox* FireSizeBox; // 0x450(0x08)
	struct U*19bc588f4c* FirePcIcon; // 0x458(0x08)
	struct U*2c98f921a9* FirePadIcon; // 0x460(0x08)
	struct UBorder* ExplosionBorder; // 0x468(0x08)
	struct U*19bc588f4c* EquipPcIcon; // 0x470(0x08)
	struct U*2c98f921a9* EquipConsoleIcon; // 0x478(0x08)
	struct U*54cc75d10f* SelectAni; // 0x480(0x08)
	struct U*54cc75d10f* UnSelectAni; // 0x488(0x08)
	struct U*54cc75d10f* ExplosionHighlightAni; // 0x490(0x08)
};

// Class TslGame.*274da97289
// Size: 0x430 (Inherited: 0x410)
struct U*274da97289 : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct U*e0ab1507c0* KillerItemSlot_1; // 0x418(0x08)
	struct U*e0ab1507c0* KillerItemSlot_2; // 0x420(0x08)
	struct U*e0ab1507c0* KillerItemSlot_3; // 0x428(0x08)
};

// Class TslGame.*e922de3ae3
// Size: 0x428 (Inherited: 0x410)
struct U*e922de3ae3 : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct U*54cc75d10f* Anim_Emerge; // 0x418(0x08)
	struct U*54cc75d10f* Anim_Vanish; // 0x420(0x08)
};

// Class TslGame.*120c72ed42
// Size: 0x420 (Inherited: 0x410)
struct U*120c72ed42 : U*bc854bc287 {
	struct UMaterialInstanceDynamic* *70212dd667; // 0x410(0x08)
	struct UImage* Gauge_Image; // 0x418(0x08)
};

// Class TslGame.*a8c70622fb
// Size: 0x440 (Inherited: 0x410)
struct U*a8c70622fb : U*bc854bc287 {
	struct U*b7a715c048* RadioMessageLogWidget; // 0x410(0x08)
	struct U*d40cc00989* SurvivorList_Widget; // 0x418(0x08)
	struct U*002aeba78a* RemainGeneratorWidget; // 0x420(0x08)
	struct UWidgetSwitcher* KillerSurvivorSwitcher; // 0x428(0x08)
	struct U*bac182c9ab* ItemSlot_Widget; // 0x430(0x08)
	struct U*274da97289* KillerItemSlot_Widget; // 0x438(0x08)
};

// Class TslGame.*581cd25c01
// Size: 0x478 (Inherited: 0x410)
struct U*581cd25c01 : U*bc854bc287 {
	struct AInventory* *d4728b1f54; // 0x410(0x08)
	struct F*da672abddc *ffe954783f; // 0x418(0x08)
	struct F*da672abddc *63103df36c; // 0x420(0x08)
	enum class ECastableItemType *ac747a783b; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct TArray<struct F*0253b9bc56> *642210c29c; // 0x430(0x10)
	struct F*b1a0bce7e4 *52952342b2; // 0x440(0x28)
	struct FVector2D *c3eec6c3d3; // 0x468(0x08)
	struct FVector2D *7054f83783; // 0x470(0x08)

	void *112f9cc91e(); // Function TslGame.*581cd25c01.*112f9cc91e // Final|Native|Public // @ game+0x5826c4c
	void *a5004bc1c3(); // Function TslGame.*581cd25c01.*a5004bc1c3 // Final|Native|Public // @ game+0x581d0e0
	void *d96577a7d1(); // Function TslGame.*581cd25c01.*d96577a7d1 // Final|Native|Public // @ game+0x58247b4
	void *d0158b78e0(); // Function TslGame.*581cd25c01.*d0158b78e0 // Final|Native|Public // @ game+0x5820638
};

// Class TslGame.*9207e284ef
// Size: 0x440 (Inherited: 0x410)
struct U*9207e284ef : U*bc854bc287 {
	struct UImage* GaugeImage; // 0x410(0x08)
	bool *4757768119; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct U*c1aa0ed298* *66ee13597a; // 0x420(0x08)
	char pad_428[0x18]; // 0x428(0x18)
};

// Class TslGame.*ef3daaccc1
// Size: 0x460 (Inherited: 0x440)
struct U*ef3daaccc1 : U*9207e284ef {
	struct FLinearColor *d577499392; // 0x440(0x10)
	struct UBorder* GuageBody; // 0x450(0x08)
	struct U*54cc75d10f* WarningAnim; // 0x458(0x08)
};

// Class TslGame.*3ec8de4441
// Size: 0x478 (Inherited: 0x410)
struct U*3ec8de4441 : U*bc854bc287 {
	struct ATslCharacter* *7876996be9; // 0x410(0x08)
	struct F*72b0194904 *4186361c9e; // 0x418(0x20)
	struct F*72b0194904 *b7b284f385; // 0x438(0x20)
	struct F*72b0194904 *5f5dfbf3cc; // 0x458(0x20)

	void NotifyHit(); // Function TslGame.*3ec8de4441.NotifyHit // Final|Native|Public // @ game+0x581d0f4
};

// Class TslGame.*28154ccf50
// Size: 0x470 (Inherited: 0x410)
struct U*28154ccf50 : U*bc854bc287 {
	struct UCanvasPanel* CanvasPanel; // 0x410(0x08)
	struct UImage* HitImage; // 0x418(0x08)
	struct U*54cc75d10f* FadeOutAnim; // 0x420(0x08)
	int32 *a0e9a61318; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UClass* *495c543236; // 0x430(0x08)
	struct UMaterialInterface* *32570d50b1; // 0x438(0x08)
	struct UAkAudioEvent* *50eb9e82a7; // 0x440(0x08)
	struct UAkAudioEvent* *1d07dc9293; // 0x448(0x08)
	struct TArray<struct UUserWidget*> *02303119a3; // 0x450(0x10)
	struct AActor* *d4e6877a61; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	float OnHitNotify(); // Function TslGame.*28154ccf50.OnHitNotify // Final|Native|Public|BlueprintCallable // @ game+0x582093c
};

// Class TslGame.*736bf9f457
// Size: 0x428 (Inherited: 0x410)
struct U*736bf9f457 : U*bc854bc287 {
	struct F*d9642c06a9 *057a777b14; // 0x410(0x14)
	char pad_424[0x4]; // 0x424(0x04)

	void NotifyOnGamepadA(); // Function TslGame.*736bf9f457.NotifyOnGamepadA // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void NotifyOnGamepadUp(); // Function TslGame.*736bf9f457.NotifyOnGamepadUp // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void NotifyOnFocusReceived(); // Function TslGame.*736bf9f457.NotifyOnFocusReceived // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void NotifyOnGamepadB(); // Function TslGame.*736bf9f457.NotifyOnGamepadB // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void NotifyOnGamepadDown(); // Function TslGame.*736bf9f457.NotifyOnGamepadDown // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*f6f6315829
// Size: 0x410 (Inherited: 0x410)
struct U*f6f6315829 : U*bc854bc287 {

	void SetHUD(); // Function TslGame.*f6f6315829.SetHUD // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*2b4cea2a78
// Size: 0x490 (Inherited: 0x410)
struct U*2b4cea2a78 : U*bc854bc287 {
	char pad_410[0x38]; // 0x410(0x38)
	TScriptInterface<struct U*e63b4ff431> SlotContainer; // 0x448(0x10)
	char pad_458[0x10]; // 0x458(0x10)
	struct TArray<struct U*1bacf66c5c*> *28031f66c6; // 0x468(0x10)
	struct UVerticalBox* ItemList; // 0x478(0x08)
	struct UClass* ItemSlotClass; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)

	TScriptInterface<struct U*e63b4ff431> OnSlotLeave(); // Function TslGame.*2b4cea2a78.OnSlotLeave // Final|Native|Protected // @ game+0x5825190
	void OnSlotEnter(TScriptInterface<struct U*ff30135362> Param0); // Function TslGame.*2b4cea2a78.OnSlotEnter // Final|Native|Protected // @ game+0x5824d48
	TScriptInterface<struct U*e63b4ff431> OnSlotFocus(); // Function TslGame.*2b4cea2a78.OnSlotFocus // Final|Native|Protected // @ game+0x5824ea0
};

// Class TslGame.*4824d34a7d
// Size: 0x548 (Inherited: 0x410)
struct U*4824d34a7d : U*bc854bc287 {
	struct F*8c7bdcaa93 *c88a18c5a5; // 0x410(0x20)
	struct F*8c7bdcaa93 *b1f32ea789; // 0x430(0x20)
	struct F*7c50600f8f *82467be334; // 0x450(0x30)
	struct F*f90b3e2b9a *16ccd86ece; // 0x480(0x28)
	struct F*72b0194904 *caac2737b9; // 0x4a8(0x20)
	struct UWidgetSwitcher* InteractKeySwitcher; // 0x4c8(0x08)
	struct U*712196be17* PC_KeyIcon; // 0x4d0(0x08)
	struct U*672373cc62* Console_KeyIcon; // 0x4d8(0x08)
	struct F*7c50600f8f *29d0f770e8; // 0x4e0(0x30)
	struct FText InteractNameText; // 0x510(0x18)
	bool bBlinkInteractName; // 0x528(0x01)
	char pad_529[0x1f]; // 0x529(0x1f)
};

// Class TslGame.*bfc2bc5ae2
// Size: 0x438 (Inherited: 0x410)
struct U*bfc2bc5ae2 : U*bc854bc287 {
	struct U*54cc75d10f* InfoBlink; // 0x410(0x08)
	struct U*54cc75d10f* InfoEmerging; // 0x418(0x08)
	struct U*54cc75d10f* InfoVanishing; // 0x420(0x08)
	struct UTextBlock* EmoteMessageText; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)

	void OnInteract(); // Function TslGame.*bfc2bc5ae2.OnInteract // Final|Native|Public // @ game+0x5820b7c
};

// Class TslGame.*3d6c7151ab
// Size: 0x478 (Inherited: 0x410)
struct U*3d6c7151ab : U*bc854bc287 {
	struct F*b1a0bce7e4 *2ee06a682e; // 0x410(0x28)
	struct F*b1a0bce7e4 *0aa86531f9; // 0x438(0x28)
	float GameMaxSpace; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct AInventory* *d4728b1f54; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)

	void OnInventoryUpdateEvent(); // Function TslGame.*3d6c7151ab.OnInventoryUpdateEvent // Final|Native|Public // @ game+0x5820b90
	void OnStackCountChanged(TScriptInterface<struct U*e63b4ff431> Param1); // Function TslGame.*3d6c7151ab.OnStackCountChanged // Final|Native|Public // @ game+0x58254c0
};

// Class TslGame.*e3ae7b81f2
// Size: 0x410 (Inherited: 0x410)
struct U*e3ae7b81f2 : U*bc854bc287 {
};

// Class TslGame.*a76519a84e
// Size: 0x438 (Inherited: 0x410)
struct U*a76519a84e : U*bc854bc287 {
	struct F*b1a0bce7e4 *67aef21907; // 0x410(0x28)
};

// Class TslGame.*3a3d7c286e
// Size: 0x558 (Inherited: 0x410)
struct U*3a3d7c286e : U*bc854bc287 {
	struct F*8c7bdcaa93 *93c90f5c2c; // 0x410(0x20)
	struct F*8c7bdcaa93 *49272f36ef; // 0x430(0x20)
	struct F*8c7bdcaa93 *0d667c5aff; // 0x450(0x20)
	struct F*8c7bdcaa93 *894bff5d95; // 0x470(0x20)
	struct F*8c7bdcaa93 *905d383583; // 0x490(0x20)
	struct F*8c7bdcaa93 *c117f4b041; // 0x4b0(0x20)
	struct F*8c7bdcaa93 *d0f18de67c; // 0x4d0(0x20)
	struct F*06751c9d06 *0e54c6f449; // 0x4f0(0x28)
	struct F*1e5151c8f2 *c2c8668e16; // 0x518(0x20)
	struct UButton* *5de31263c7; // 0x538(0x08)
	struct U*8fc3571e67* *638fd0729b; // 0x540(0x08)
	int32 SlotIndex; // 0x548(0x04)
	char pad_54C[0xc]; // 0x54c(0x0c)

	void OnClicked(); // Function TslGame.*3a3d7c286e.OnClicked // Final|Native|Public // @ game+0x581ea70
};

// Class TslGame.*f30f304519
// Size: 0x428 (Inherited: 0x410)
struct U*f30f304519 : U*bc854bc287 {
	struct U*54cc75d10f* Show_Anim; // 0x410(0x08)
	struct UImage* Bg_Image; // 0x418(0x08)
	struct UImage* Icon_Image; // 0x420(0x08)
};

// Class TslGame.*1bc1372802
// Size: 0x508 (Inherited: 0x410)
struct U*1bc1372802 : U*bc854bc287 {
	char pad_410[0x58]; // 0x410(0x58)
	enum class EEquipSlotID EquipSlotID; // 0x468(0x01)
	char pad_469[0x3]; // 0x469(0x03)
	int32 WeaponSlotIndex; // 0x46c(0x04)
	struct UTexture* SlotBackground_NormalEmpty; // 0x470(0x08)
	struct UTexture* SlotBackground_Normal; // 0x478(0x08)
	struct UTexture* SlotBackground_On; // 0x480(0x08)
	struct UTexture* SlotBackGround_SubOn; // 0x488(0x08)
	struct UTexture* SlotBackground_Over; // 0x490(0x08)
	struct FName TexParm; // 0x498(0x08)
	struct UClass* *456a1b56af; // 0x4a0(0x08)
	float IconSize; // 0x4a8(0x04)
	float ToolTipShowDelaytime; // 0x4ac(0x04)
	struct UImage* ItemIcon; // 0x4b0(0x08)
	struct UAkAudioEvent* *1646aabe70; // 0x4b8(0x08)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x4c0(0x08)
	struct UMaterialInstanceDynamic* SlotDynamicMaterial; // 0x4c8(0x08)
	struct AEquipment* Equipment; // 0x4d0(0x08)
	struct UItem* Item; // 0x4d8(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x4e0(0x08)
	struct U*c3d8355111* InventoryWidget; // 0x4e8(0x08)
	struct UItemToolTipWidget* *3720cfaf6c; // 0x4f0(0x08)
	struct ATslCharacter* *70baa41f94; // 0x4f8(0x08)
	char pad_500[0x8]; // 0x500(0x08)

	void OnPressedUIWidgetInputY(); // Function TslGame.*1bc1372802.OnPressedUIWidgetInputY // Native|Public // @ game+0xa8b200
	void IsCharacterCasting(); // Function TslGame.*1bc1372802.IsCharacterCasting // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5926e00
	void OnPressedWidgetInputB(); // Function TslGame.*1bc1372802.OnPressedWidgetInputB // Final|Native|Public // @ game+0xbf00fc
	void OnEquipmentUpdated(); // Function TslGame.*1bc1372802.OnEquipmentUpdated // Final|Native|Private // @ game+0x5929034
};

// Class TslGame.*c7a0553c6e
// Size: 0x6d0 (Inherited: 0x508)
struct U*c7a0553c6e : U*1bc1372802 {
	char pad_508[0x20]; // 0x508(0x20)
	struct F*c1cf1c46a8 CanvasPanel_Binder; // 0x528(0x28)
	struct F*7c50600f8f BackgroundSlot_Binder; // 0x550(0x30)
	struct F*1e5151c8f2 IconBlock_Binder; // 0x580(0x20)
	struct F*b1a0bce7e4 Icon_Bidner; // 0x5a0(0x28)
	struct F*be81a602d7 DurabilityGaugeBlock_Binder; // 0x5c8(0x28)
	struct F*1e5151c8f2 DurabilityIconBlock_Binder; // 0x5f0(0x20)
	struct F*b1a0bce7e4 DestroyedItemTint_Binder; // 0x610(0x28)
	struct F*8c7bdcaa93 DurabilityNumber_Binder; // 0x638(0x20)
	struct F*06751c9d06 DurabilityIconSwitcher_Binder; // 0x658(0x28)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x680(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x690(0x10)
	struct FLinearColor BlockedIconColor; // 0x6a0(0x10)
	struct UMaterialInstanceDynamic* *fccfb30228; // 0x6b0(0x08)
	struct UEquipableItem* EquipableItem; // 0x6b8(0x08)
	char pad_6C0[0x8]; // 0x6c0(0x08)
	struct U*f30f304519* RadioMessage; // 0x6c8(0x08)
};

// Class TslGame.*513364c7b2
// Size: 0x718 (Inherited: 0x6d0)
struct U*513364c7b2 : U*c7a0553c6e {
	struct F*b1a0bce7e4 DurabilityGauge_Binder; // 0x6d0(0x28)
	struct F*1e5151c8f2 ItemIconLayer_Binder; // 0x6f8(0x20)
};

// Class TslGame.*051699bace
// Size: 0x6e8 (Inherited: 0x6d0)
struct U*051699bace : U*c7a0553c6e {
	struct UProgressBar* Pgb_Durability; // 0x6d0(0x08)
	float *212a0bcb87; // 0x6d8(0x04)
	char pad_6DC[0xc]; // 0x6dc(0x0c)

	void OnPressedX(); // Function TslGame.*051699bace.OnPressedX // Final|Native|Protected // @ game+0xbffa44
	void FocusState(); // Function TslGame.*051699bace.FocusState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void NormalState(); // Function TslGame.*051699bace.NormalState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void LinkState(); // Function TslGame.*051699bace.LinkState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnReleasedLThumb(); // Function TslGame.*051699bace.OnReleasedLThumb // Final|Native|Protected // @ game+0xc16648
	void OnReleasedX(); // Function TslGame.*051699bace.OnReleasedX // Final|Native|Protected // @ game+0xc336e4
	void OnPressedLThumb(); // Function TslGame.*051699bace.OnPressedLThumb // Final|Native|Protected // @ game+0x930448
};

// Class TslGame.*63ab00449f
// Size: 0x7d8 (Inherited: 0x718)
struct U*63ab00449f : U*513364c7b2 {
	struct TArray<struct FName> Items; // 0x718(0x10)
	struct F*8c7bdcaa93 ItemCountTextBinder; // 0x728(0x20)
	struct F*b1a0bce7e4 ItemIconImageBinder; // 0x748(0x28)
	struct F*aad5c0ee0d ItemIconImageSizeBoxBinder; // 0x770(0x28)
	struct FName ItemIconTextureParamName; // 0x798(0x08)
	float ItemIconImageSizeBoxHeight; // 0x7a0(0x04)
	char pad_7A4[0x4]; // 0x7a4(0x04)
	struct UTexture* IconTexture; // 0x7a8(0x08)
	float NoItemOpacity; // 0x7b0(0x04)
	float DragItemOpacity; // 0x7b4(0x04)
	float HasItemOpacity; // 0x7b8(0x04)
	float DragBackgroundState; // 0x7bc(0x04)
	float ItemPresentBackgroundState; // 0x7c0(0x04)
	char pad_7C4[0x4]; // 0x7c4(0x04)
	struct UClass* LoadoutToolTipClass; // 0x7c8(0x08)
	int32 ItemsCount; // 0x7d0(0x04)
	char pad_7D4[0x4]; // 0x7d4(0x04)

	void OnInventoryUpdated(); // Function TslGame.*63ab00449f.OnInventoryUpdated // Final|Native|Public // @ game+0x581fa84
	void OnUpdateItemBlueprint(); // Function TslGame.*63ab00449f.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnEquipmentUpdated(); // Function TslGame.*63ab00449f.OnEquipmentUpdated // Final|Native|Public // @ game+0x581fa84
	void OnStackCountChanged(); // Function TslGame.*63ab00449f.OnStackCountChanged // Final|Native|Public // @ game+0x581fa84
};

// Class TslGame.*2679a8162b
// Size: 0x718 (Inherited: 0x718)
struct U*2679a8162b : U*513364c7b2 {

	void OnUpdateItemBlueprint(); // Function TslGame.*2679a8162b.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*35c07c90ec
// Size: 0x660 (Inherited: 0x508)
struct U*35c07c90ec : U*1bc1372802 {
	char pad_508[0x98]; // 0x508(0x98)
	struct U*8a017bc4f0* *85044dc232; // 0x5a0(0x08)
	struct UWeaponItem* WeaponItem; // 0x5a8(0x08)
	char pad_5B0[0x10]; // 0x5b0(0x10)
	struct F*be81a602d7 AttachmentIconBlock_Binder; // 0x5c0(0x28)
	struct F*b1a0bce7e4 AttachmentIcon_Binder; // 0x5e8(0x28)
	struct F*7c50600f8f AttachmentSlotBackground_Binder; // 0x610(0x30)
	enum class EWeaponAttachmentSlotID *df12e194f4; // 0x640(0x01)
	char pad_641[0x7]; // 0x641(0x07)
	struct U*f30f304519* RadioMessage; // 0x648(0x08)
	struct AInventory* Inventory; // 0x650(0x08)
	struct U*c3d8355111* *ab06d6087b; // 0x658(0x08)
};

// Class TslGame.*a9be2a0674
// Size: 0x6a0 (Inherited: 0x660)
struct U*a9be2a0674 : U*35c07c90ec {
	struct F*c1cf1c46a8 CanvasPanel_Binder; // 0x660(0x28)
	struct UImage* Recommend_Image; // 0x688(0x08)
	struct UImage* RecommendBG_Image; // 0x690(0x08)
	char pad_698[0x8]; // 0x698(0x08)
};

// Class TslGame.*0693a2029e
// Size: 0x6b0 (Inherited: 0x660)
struct U*0693a2029e : U*35c07c90ec {
	struct F*be81a602d7 SizeBox_Binder; // 0x660(0x28)
	struct UImage* Img_Arrow; // 0x688(0x08)
	struct UImage* ImgBG; // 0x690(0x08)
	struct U*54cc75d10f* Anim_Arrow; // 0x698(0x08)
	float HoldDuration; // 0x6a0(0x04)
	char pad_6A4[0xc]; // 0x6a4(0x0c)

	void OnInputLThumbReleased(); // Function TslGame.*0693a2029e.OnInputLThumbReleased // Final|Native|Protected // @ game+0xbb6544
	void FocusState(); // Function TslGame.*0693a2029e.FocusState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void PlayArrowAnimation(); // Function TslGame.*0693a2029e.PlayArrowAnimation // Final|Native|Public|BlueprintCallable // @ game+0x5828568
	void LinkState(); // Function TslGame.*0693a2029e.LinkState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void SelfPutState(); // Function TslGame.*0693a2029e.SelfPutState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void NormalState(); // Function TslGame.*0693a2029e.NormalState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnInputLThumbPressed(); // Function TslGame.*0693a2029e.OnInputLThumbPressed // Final|Native|Protected // @ game+0xa8b23c
	void DisableState(); // Function TslGame.*0693a2029e.DisableState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*61bf776668
// Size: 0x6a0 (Inherited: 0x6a0)
struct U*61bf776668 : U*a9be2a0674 {
	struct UImage* DisabledImage; // 0x698(0x08)
};

// Class TslGame.TslWeapon_SoftRole
// Size: 0xa90 (Inherited: 0xa60)
struct ATslWeapon_SoftRole : ATslWeapon {
	struct FName AnimNotifyNameCloseSoftRole; // 0xa58(0x08)
	struct FName AnimNotifyNameOpenSoftRole; // 0xa60(0x08)
	struct FName AnimNotifyNameInspectSoftRole; // 0xa68(0x08)
	enum class ESoftRoleState *31aa8598c2; // 0xa70(0x01)
	struct FVector VehicleFppOffset; // 0xa74(0x0c)
	struct U*04b5b50b83* *04b5b50b83; // 0xa80(0x08)
	char pad_A8D[0x3]; // 0xa8d(0x03)

	void *8db8929ead(); // Function TslGame.TslWeapon_SoftRole.*8db8929ead // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x585a988
	void *fe5659c07c(); // Function TslGame.TslWeapon_SoftRole.*fe5659c07c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x585a954
};

// Class TslGame.TslWeapon_TacPack
// Size: 0xaa0 (Inherited: 0xa90)
struct ATslWeapon_TacPack : ATslWeapon_SoftRole {
	float *e6f7ebc9bb; // 0xa90(0x04)
	bool *55ccc7b73e; // 0xa94(0x01)
	char pad_A95[0xb]; // 0xa95(0x0b)

	void UpdatedCharacterEvent(); // Function TslGame.TslWeapon_TacPack.UpdatedCharacterEvent // Final|Native|Protected|HasOutParms // @ game+0x5832188
	void *3a859ee40f(); // Function TslGame.TslWeapon_TacPack.*3a859ee40f // Final|Native|Protected // @ game+0x582684c
};

// Class TslGame.*4fb9e250ef
// Size: 0x7d0 (Inherited: 0x6a0)
struct U*4fb9e250ef : U*a9be2a0674 {
	struct F*b1a0bce7e4 *2ee06a682e; // 0x698(0x28)
	struct F*b1a0bce7e4 *0aa86531f9; // 0x6c0(0x28)
	struct F*b1a0bce7e4 *da2cd40c24; // 0x6e8(0x28)
	struct F*b1a0bce7e4 *f6bc16de89; // 0x710(0x28)
	struct F*06751c9d06 *d61d0e4085; // 0x738(0x28)
	struct F*1e5151c8f2 *856fef9cf3; // 0x760(0x20)
	struct F*8c7bdcaa93 *c32bb877ce; // 0x780(0x20)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x7a0(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x7b0(0x10)
	struct UTextBlock* TextStackCount; // 0x7c0(0x08)
	struct UMaterialInstanceDynamic* *cfe34b110f; // 0x7c8(0x08)
};

// Class TslGame.*649b7d5538
// Size: 0x7f0 (Inherited: 0x6b0)
struct U*649b7d5538 : U*0693a2029e {
	struct F*b1a0bce7e4 *2ee06a682e; // 0x6b0(0x28)
	struct F*b1a0bce7e4 *0aa86531f9; // 0x6d8(0x28)
	struct F*b1a0bce7e4 *f6bc16de89; // 0x700(0x28)
	struct F*06751c9d06 *d61d0e4085; // 0x728(0x28)
	struct F*1e5151c8f2 *856fef9cf3; // 0x750(0x20)
	struct F*8c7bdcaa93 *c32bb877ce; // 0x770(0x20)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x790(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x7a0(0x10)
	struct UMaterialInstanceDynamic* *cfe34b110f; // 0x7b0(0x08)
	struct F*1e5151c8f2 *66b454b969; // 0x7b8(0x20)
	struct UTextBlock* TextStackCount; // 0x7d8(0x08)
	struct UProgressBar* Pgb_Durability; // 0x7e0(0x08)
	char pad_7E8[0x8]; // 0x7e8(0x08)
};

// Class TslGame.ViewModeStudio
// Size: 0x450 (Inherited: 0x3e8)
struct AViewModeStudio : AActor {
	struct UCameraComponent* CameraComponent; // 0x3e8(0x08)
	struct USceneCaptureComponent2D* SceneCaptureComponent; // 0x3f0(0x08)
	char pad_3F8[0x8]; // 0x3f8(0x08)
	struct FTransform *975b39c7c6; // 0x400(0x30)
	struct UTextureRenderTarget2D* TextureTarget; // 0x430(0x08)
	struct FName CameraSocketName; // 0x438(0x08)
	float MaxViewDistance; // 0x440(0x04)
	float ViewSlaveLocationDuration; // 0x444(0x04)
	float *e86449489b; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)

	void *47d2376922(); // Function TslGame.ViewModeStudio.*47d2376922 // Final|Native|Public|BlueprintCallable // @ game+0x58f66fc
	void SetViewModeAbleActor(); // Function TslGame.ViewModeStudio.SetViewModeAbleActor // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x58f8a78
	void *4a4e1ca0c6(); // Function TslGame.ViewModeStudio.*4a4e1ca0c6 // Final|Native|Public|BlueprintCallable // @ game+0x58f8668
	void AddYaw(); // Function TslGame.ViewModeStudio.AddYaw // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x58e31a0
	void AddViewDistance(); // Function TslGame.ViewModeStudio.AddViewDistance // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x581cc28
	void AddPitch(); // Function TslGame.ViewModeStudio.AddPitch // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x58e2fd0
	void *712c6252f1(); // Function TslGame.ViewModeStudio.*712c6252f1 // Final|Native|Public|BlueprintCallable // @ game+0x58e3108
	void AddRoll(); // Function TslGame.ViewModeStudio.AddRoll // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x58e306c
};

// Class TslGame.ItemStudio
// Size: 0x450 (Inherited: 0x450)
struct AItemStudio : AViewModeStudio {

	void SetMeshTransform(); // Function TslGame.ItemStudio.SetMeshTransform // Native|Event|Public|BlueprintEvent // @ game+0x582e56c
	void UpdateComponentToWorld(); // Function TslGame.ItemStudio.UpdateComponentToWorld // Native|Public|BlueprintCallable // @ game+0x5830de0
	void SetItem(); // Function TslGame.ItemStudio.SetItem // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x580eef4
};

// Class TslGame.*59a071bc5a
// Size: 0x728 (Inherited: 0x508)
struct U*59a071bc5a : U*1bc1372802 {
	struct UTextureRenderTarget2D* RenderTargetTexture; // 0x508(0x08)
	struct UClass* ItemStudioClass; // 0x510(0x08)
	int32 MaxWeaponNameLength; // 0x518(0x04)
	char pad_51C[0x4]; // 0x51c(0x04)
	struct F*7c50600f8f BackgroundBorder_Binder; // 0x520(0x30)
	struct F*1e5151c8f2 WeaponInfoText_Bidner; // 0x550(0x20)
	struct F*8c7bdcaa93 WeaponHandsOnLoadedAmmoCount_Binder; // 0x570(0x20)
	struct F*b1a0bce7e4 AmmoIcon_Binder; // 0x590(0x28)
	struct F*8c7bdcaa93 WeaponHandsOnUnloadedAmmoCount_Binder; // 0x5b8(0x20)
	struct F*8c7bdcaa93 WeaponName_Binder; // 0x5d8(0x20)
	struct F*8c7bdcaa93 KeyName_Binder; // 0x5f8(0x20)
	struct F*8c7bdcaa93 AmmoName_Bidner; // 0x618(0x20)
	struct F*b1a0bce7e4 AmmoBg_Binder; // 0x638(0x28)
	struct F*b1a0bce7e4 WeaponCaptureImage_Binder; // 0x660(0x28)
	struct F*b1a0bce7e4 LockIcon_Binder; // 0x688(0x28)
	struct FSlateColor ImageDisabledColor; // 0x6b0(0x28)
	struct UWidgetSwitcher* UnloadedSwitcher; // 0x6d8(0x08)
	char pad_6E0[0x8]; // 0x6e0(0x08)
	struct UEquipableItem* EquipableItem; // 0x6e8(0x08)
	struct ATslWeapon* Weapon; // 0x6f0(0x08)
	struct ATslWeapon_Gun* *6a5899d7e3; // 0x6f8(0x08)
	struct UMaterialInstanceDynamic* *4dc8ee5442; // 0x700(0x08)
	struct UMaterialInstanceDynamic* *6cb6c59192; // 0x708(0x08)
	struct UUserWidget* *64cb66f584; // 0x710(0x08)
	struct AInventory* *d4728b1f54; // 0x718(0x08)
	char pad_720[0x8]; // 0x720(0x08)

	void OnSpawnActorInSceneCaptureWorld(); // Function TslGame.*59a071bc5a.OnSpawnActorInSceneCaptureWorld // Native|Protected // @ game+0x5825398
	void InitBody(); // Function TslGame.*59a071bc5a.InitBody // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x2cd4ac
	void DestroyItemStudio(); // Function TslGame.*59a071bc5a.DestroyItemStudio // Final|Native|Public // @ game+0x5818d94
};

// Class TslGame.*e1eb89fffb
// Size: 0x728 (Inherited: 0x728)
struct U*e1eb89fffb : U*59a071bc5a {
};

// Class TslGame.*8d6d2e0418
// Size: 0x728 (Inherited: 0x728)
struct U*8d6d2e0418 : U*59a071bc5a {

	void SelfPutState(); // Function TslGame.*8d6d2e0418.SelfPutState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void FocusState(); // Function TslGame.*8d6d2e0418.FocusState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnPressedUIWidgetInputY(); // Function TslGame.*8d6d2e0418.OnPressedUIWidgetInputY // Native|Protected // @ game+0xa8b200
	void LinkState(); // Function TslGame.*8d6d2e0418.LinkState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void NormalState(); // Function TslGame.*8d6d2e0418.NormalState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*d262e503e5
// Size: 0x760 (Inherited: 0x728)
struct U*d262e503e5 : U*e1eb89fffb {
	char pad_728[0x8]; // 0x728(0x08)
	struct TArray<struct F*9838798d84> *859599cfba; // 0x730(0x10)
	struct UHorizontalBox* AmmoHorizontalBox; // 0x740(0x08)
	char pad_748[0x18]; // 0x748(0x18)

	void OnSpawnActorInSceneCaptureWorld(); // Function TslGame.*d262e503e5.OnSpawnActorInSceneCaptureWorld // Native|Public // @ game+0x5825398
};

// Class TslGame.*8a017bc4f0
// Size: 0x760 (Inherited: 0x508)
struct U*8a017bc4f0 : U*1bc1372802 {
	char pad_508[0x10]; // 0x508(0x10)
	int32 SlotIndex; // 0x518(0x04)
	char pad_51C[0xa4]; // 0x51c(0xa4)
	struct U*fa4431ffac* *50ab5c2884; // 0x5c0(0x08)
	struct TArray<struct U*35c07c90ec*> *2556239525; // 0x5c8(0x10)
	char pad_5D8[0x50]; // 0x5d8(0x50)
	struct F*f90b3e2b9a AttachmentSlotHorizontalBox_Binder; // 0x628(0x28)
	struct F*f90b3e2b9a TacPackAttachmentSlotHorizontalBox_Binder; // 0x650(0x28)
	struct F*c1cf1c46a8 AttachmentSlotPanel_Binder; // 0x678(0x28)
	struct F*7c50600f8f BackgroundSlot_Binder; // 0x6a0(0x30)
	struct UTextureRenderTarget2D* RenderTargetTexture; // 0x6d0(0x08)
	struct UClass* ItemStudioClass; // 0x6d8(0x08)
	int32 MaxWeaponNameLength; // 0x6e0(0x04)
	char pad_6E4[0x4]; // 0x6e4(0x04)
	struct UMaterialInterface* *d92eb842c1; // 0x6e8(0x08)
	struct UMaterialInterface* *f132c6f0f2; // 0x6f0(0x08)
	struct UMaterialInterface* *3a4d235955; // 0x6f8(0x08)
	struct U*f30f304519* RadioMessage; // 0x700(0x08)
	struct UUserWidget* *64cb66f584; // 0x708(0x08)
	struct AInventory* Inventory; // 0x710(0x08)
	struct AItemStudio* WeaponStudio; // 0x718(0x08)
	struct UMaterialInstanceDynamic* *4dc8ee5442; // 0x720(0x08)
	struct UEquipableItem* EquipableItem; // 0x728(0x08)
	struct UWeaponItem* WeaponItem; // 0x730(0x08)
	struct UThrowableItem* ThrowableItem; // 0x738(0x08)
	struct ATslWeapon_Gun* *6a5899d7e3; // 0x740(0x08)
	struct UEquipableItem* *be81222233; // 0x748(0x08)
	struct UWeaponItem* *1002c76860; // 0x750(0x08)
	struct UThrowableItem* *a7a992dbca; // 0x758(0x08)

	TScriptInterface<struct U*e63b4ff431> *fca27d2d5f(); // Function TslGame.*8a017bc4f0.*fca27d2d5f // Final|Native|Protected // @ game+0x581d710
	void OnPressedUIWidgetInputY(); // Function TslGame.*8a017bc4f0.OnPressedUIWidgetInputY // Native|Public // @ game+0xa8b200
	void OnEnterSlotFunction(TScriptInterface<struct U*e63b4ff431> Param1); // Function TslGame.*8a017bc4f0.OnEnterSlotFunction // Final|Native|Protected // @ game+0x581f92c
	TScriptInterface<struct U*e63b4ff431> OnLeaveSlotFunction(); // Function TslGame.*8a017bc4f0.OnLeaveSlotFunction // Final|Native|Protected // @ game+0x5820de8
	void OnAttachmentFocusedEvent(TScriptInterface<struct U*ff30135362> Param1); // Function TslGame.*8a017bc4f0.OnAttachmentFocusedEvent // Final|Native|Protected // @ game+0x581da80
};

// Class TslGame.*3caea1aaf2
// Size: 0x760 (Inherited: 0x760)
struct U*3caea1aaf2 : U*8a017bc4f0 {
};

// Class TslGame.*afb7fdc2dc
// Size: 0x780 (Inherited: 0x760)
struct U*afb7fdc2dc : U*8a017bc4f0 {
	float *c6ac2b22ad; // 0x760(0x04)
	float *b6e4a52ddc; // 0x764(0x04)
	float *25dc6426b0; // 0x768(0x04)
	char pad_76C[0x14]; // 0x76c(0x14)

	void OnWidgetInputL3Released(); // Function TslGame.*afb7fdc2dc.OnWidgetInputL3Released // Final|Native|Protected // @ game+0xc53f28
	void FocusState(); // Function TslGame.*afb7fdc2dc.FocusState // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void PressedDetachInput(); // Function TslGame.*afb7fdc2dc.PressedDetachInput // Final|Native|Protected // @ game+0x92e500
	void OnWidgetInputL3Pressed(); // Function TslGame.*afb7fdc2dc.OnWidgetInputL3Pressed // Final|Native|Protected // @ game+0x92e964
	void ReleaseDetachInput(); // Function TslGame.*afb7fdc2dc.ReleaseDetachInput // Final|Native|Protected // @ game+0x92e550
	void *b4985a78cb(); // Function TslGame.*afb7fdc2dc.*b4985a78cb // Final|Native|Protected // @ game+0x58287c0
	void OnWidgetInputAPressed(); // Function TslGame.*afb7fdc2dc.OnWidgetInputAPressed // Final|Native|Protected // @ game+0x92d994
	void OnWidgetInputR3Pressed(); // Function TslGame.*afb7fdc2dc.OnWidgetInputR3Pressed // Final|Native|Protected // @ game+0x58276c4
	void ReleasedDropInput(); // Function TslGame.*afb7fdc2dc.ReleasedDropInput // Final|Native|Protected // @ game+0x92d0b0
	void SetSizeToTacticalGearWidget(); // Function TslGame.*afb7fdc2dc.SetSizeToTacticalGearWidget // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void OnWidgetInputR3Released(); // Function TslGame.*afb7fdc2dc.OnWidgetInputR3Released // Final|Native|Protected // @ game+0x58276d8
	void OnWidgetInputAReleased(); // Function TslGame.*afb7fdc2dc.OnWidgetInputAReleased // Final|Native|Protected // @ game+0x92d9d0
	void PressedDropInput(); // Function TslGame.*afb7fdc2dc.PressedDropInput // Final|Native|Protected // @ game+0x92d060
	void NormalState(); // Function TslGame.*afb7fdc2dc.NormalState // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void LinkState(); // Function TslGame.*afb7fdc2dc.LinkState // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void *adb2081dca(); // Function TslGame.*afb7fdc2dc.*adb2081dca // Final|Native|Protected // @ game+0x5828d44
	void SetSizeToGunWeaponWidget(); // Function TslGame.*afb7fdc2dc.SetSizeToGunWeaponWidget // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void SetSizeToThrowableWeaponWidget(); // Function TslGame.*afb7fdc2dc.SetSizeToThrowableWeaponWidget // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*8154182c0e
// Size: 0x780 (Inherited: 0x760)
struct U*8154182c0e : U*3caea1aaf2 {
	DelegateProperty *250d1ee591; // 0x760(0x10)
	struct U*1fc6f92793* *3f696ebff9; // 0x770(0x08)
	char pad_778[0x8]; // 0x778(0x08)

	void ProcessBuy(); // Function TslGame.*8154182c0e.ProcessBuy // Final|Native|Private // @ game+0x58288dc
	void OnUpdateItemBlueprint(); // Function TslGame.*8154182c0e.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.TslItemDragWidget
// Size: 0x538 (Inherited: 0x410)
struct UTslItemDragWidget : U*bc854bc287 {
	struct F*b1a0bce7e4 *f340ae4db9; // 0x410(0x28)
	struct F*b1a0bce7e4 *9d9f9e4ee6; // 0x438(0x28)
	struct F*b1a0bce7e4 *52952342b2; // 0x460(0x28)
	struct F*be81a602d7 *4200a28596; // 0x488(0x28)
	struct F*8c7bdcaa93 *4ad1f44859; // 0x4b0(0x20)
	struct UItem* *f1e868627d; // 0x4d0(0x08)
	TScriptInterface<struct U*ff30135362> *0513f90885; // 0x4d8(0x10)
	char pad_4E8[0x20]; // 0x4e8(0x20)
	struct UTexture* *8eb239ae57; // 0x508(0x08)
	struct UTexture* *9cac0c6fb3; // 0x510(0x08)
	struct UTexture* *cb87f61001; // 0x518(0x08)
	struct ATslPlayerController* ShooterPlayerController; // 0x520(0x08)
	struct AInventory* Inventory; // 0x528(0x08)
	struct UMaterialInstanceDynamic* *f1b9b4474e; // 0x530(0x08)

	void *4166b76cbd(); // Function TslGame.TslItemDragWidget.*4166b76cbd // Final|Native|Public // @ game+0x581faac
};

// Class TslGame.*c5abb7f616
// Size: 0x718 (Inherited: 0x410)
struct U*c5abb7f616 : U*bc854bc287 {
	char pad_410[0x68]; // 0x410(0x68)
	struct TArray<enum class EItemCategory> *8ad35a2dc9; // 0x478(0x10)
	struct UClass* *fd0776b718; // 0x488(0x08)
	bool *81270c3f5f; // 0x490(0x01)
	bool *66c506c673; // 0x491(0x01)
	char pad_492[0x96]; // 0x492(0x96)
	float *249c975513; // 0x528(0x04)
	char pad_52C[0x14]; // 0x52c(0x14)
	struct F*aad5c0ee0d *793db62e67; // 0x540(0x28)
	struct F*5936845b8b *98f1aa0f6b; // 0x568(0x28)
	struct F*7c50600f8f *d2419597f4; // 0x590(0x30)
	struct F*be81a602d7 *548c1888b3; // 0x5c0(0x28)
	struct F*1e5151c8f2 *c3d48dcccd; // 0x5e8(0x20)
	struct F*1e5151c8f2 *6478f61a12; // 0x608(0x20)
	struct F*8c7bdcaa93 *ba8f348af3; // 0x628(0x20)
	struct F*8c7bdcaa93 *de529e268c; // 0x648(0x20)
	struct UClass* *c3778afea3; // 0x668(0x08)
	struct FSlateColor *c412e99fb9; // 0x670(0x28)
	struct FSlateColor *b6dfba4cb1; // 0x698(0x28)
	float *7740a9e141; // 0x6c0(0x04)
	float *98052876e1; // 0x6c4(0x04)
	int32 *7b35cefff8; // 0x6c8(0x04)
	char pad_6CC[0x4]; // 0x6cc(0x04)
	struct TArray<struct U*1bacf66c5c*> *f080a17bd0; // 0x6d0(0x10)
	struct ANearbyInteractiveItemExplorer* ItemExplorer; // 0x6e0(0x08)
	TScriptInterface<struct U*e63b4ff431> Container; // 0x6e8(0x10)
	struct TArray<TScriptInterface<struct U*ff30135362>> *ec66bce078; // 0x6f8(0x10)
	TScriptInterface<struct U*ff30135362> *5765a0f14c; // 0x708(0x10)

	TScriptInterface<struct U*e63b4ff431> HandleOnEnterSlot(); // Function TslGame.*c5abb7f616.HandleOnEnterSlot // Final|Native|Public // @ game+0x581aad8
	void OnRepCharacterInventory(); // Function TslGame.*c5abb7f616.OnRepCharacterInventory // Final|Native|Private // @ game+0x5823838
	void *fc176791eb(); // Function TslGame.*c5abb7f616.*fc176791eb // Final|Native|Public // @ game+0x5818b20
	void HandleOnDoSlotAction(); // Function TslGame.*c5abb7f616.HandleOnDoSlotAction // Final|Native|Public // @ game+0x581a964
	void OnChangedStackCount(); // Function TslGame.*c5abb7f616.OnChangedStackCount // Final|Native|Protected // @ game+0x581e7d8
	TScriptInterface<struct U*e63b4ff431> HandleOnLeaveChildSlot(); // Function TslGame.*c5abb7f616.HandleOnLeaveChildSlot // Final|Native|Public // @ game+0x581ac30
	void IsEmptyList(); // Function TslGame.*c5abb7f616.IsEmptyList // Final|Native|Public|BlueprintCallable // @ game+0x581b7a8
	void HandleOnLeaveSlot(TScriptInterface<struct U*ff30135362> Param0); // Function TslGame.*c5abb7f616.HandleOnLeaveSlot // Final|Native|Public // @ game+0x581ad88
	void OnRefreshFocus(); // Function TslGame.*c5abb7f616.OnRefreshFocus // Native|Public // @ game+0x748b04
	void OnClickBtn_Time(); // Function TslGame.*c5abb7f616.OnClickBtn_Time // Native|Protected // @ game+0xa2ead0
	TScriptInterface<struct U*e63b4ff431> HandleOnEnterChildSlot(); // Function TslGame.*c5abb7f616.HandleOnEnterChildSlot // Final|Native|Public // @ game+0x581a980
	void RefreshList(); // Function TslGame.*c5abb7f616.RefreshList // Final|Native|Public // @ game+0xc9b1e8
	void *365da3b5da(); // Function TslGame.*c5abb7f616.*365da3b5da // Native|Protected // @ game+0x5823820
	void OnEquipmentUpdated(); // Function TslGame.*c5abb7f616.OnEquipmentUpdated // Final|Native|Private // @ game+0x581fa98
	void OnInventoryUpdated(); // Function TslGame.*c5abb7f616.OnInventoryUpdated // Final|Native|Private // @ game+0x5820bb8
	void *a1d97c0a79(); // Function TslGame.*c5abb7f616.*a1d97c0a79 // Final|Native|Public // @ game+0x581fdc4
	void OnSlotFocus(TScriptInterface<struct U*ff30135362> Param0); // Function TslGame.*c5abb7f616.OnSlotFocus // Native|Public // @ game+0x5825014
	void OnClickBtn_Type(); // Function TslGame.*c5abb7f616.OnClickBtn_Type // Native|Protected // @ game+0x581ea2c
};

// Class TslGame.*85f6432873
// Size: 0x718 (Inherited: 0x718)
struct U*85f6432873 : U*c5abb7f616 {
};

// Class TslGame.*3544da7d22
// Size: 0x720 (Inherited: 0x718)
struct U*3544da7d22 : U*c5abb7f616 {
	char pad_718[0x8]; // 0x718(0x08)
};

// Class TslGame.*1bacf66c5c
// Size: 0xaa8 (Inherited: 0x410)
struct U*1bacf66c5c : U*bc854bc287 {
	char pad_410[0x30]; // 0x410(0x30)
	TScriptInterface<struct U*ff30135362> *b33ecc0eb1; // 0x440(0x10)
	TScriptInterface<struct U*e63b4ff431> SlotContainer; // 0x450(0x10)
	char pad_460[0x98]; // 0x460(0x98)
	struct FLinearColor DefaultSlotNameColor; // 0x4f8(0x10)
	struct FLinearColor DisabledSlotNameColor; // 0x508(0x10)
	char pad_518[0x50]; // 0x518(0x50)
	struct F*1e5151c8f2 *bce04fa04c; // 0x568(0x20)
	struct F*1e5151c8f2 *cb049ef341; // 0x588(0x20)
	struct F*b1a0bce7e4 *794f0d1010; // 0x5a8(0x28)
	struct F*7c50600f8f *456767ee74; // 0x5d0(0x30)
	struct F*b1a0bce7e4 *8e2ae8407d; // 0x600(0x28)
	struct F*8c7bdcaa93 *6ac76b8ef6; // 0x628(0x20)
	struct F*1e5151c8f2 *4272761dc4; // 0x648(0x20)
	struct F*b1a0bce7e4 *f340ae4db9; // 0x668(0x28)
	struct F*b1a0bce7e4 *67aef21907; // 0x690(0x28)
	struct F*1e5151c8f2 *66b454b969; // 0x6b8(0x20)
	struct F*b1a0bce7e4 *da2cd40c24; // 0x6d8(0x28)
	struct F*b1a0bce7e4 *f6bc16de89; // 0x700(0x28)
	struct F*06751c9d06 *d61d0e4085; // 0x728(0x28)
	struct F*1e5151c8f2 *856fef9cf3; // 0x750(0x20)
	struct F*8c7bdcaa93 *c32bb877ce; // 0x770(0x20)
	struct F*8c7bdcaa93 *4ce49e3a07; // 0x790(0x20)
	struct F*8c7bdcaa93 *a79ecd8687; // 0x7b0(0x20)
	struct F*aad5c0ee0d *4200a28596; // 0x7d0(0x28)
	struct F*8c7bdcaa93 *4ad1f44859; // 0x7f8(0x20)
	struct F*7c50600f8f *b7fdc39d1a; // 0x818(0x30)
	struct F*b1a0bce7e4 *14fdb74c9f; // 0x848(0x28)
	struct F*8c7bdcaa93 *b99e067936; // 0x870(0x20)
	struct F*be81a602d7 *d616d509f1; // 0x890(0x28)
	struct F*be81a602d7 *f8a7738f7f; // 0x8b8(0x28)
	struct F*aad5c0ee0d *e8159cf37a; // 0x8e0(0x28)
	struct F*1e5151c8f2 *136d31dc98; // 0x908(0x20)
	struct F*b1a0bce7e4 *fdf82826e1; // 0x928(0x28)
	struct F*8c7bdcaa93 *e3b6193f5a; // 0x950(0x20)
	struct UClass* *41ab29b7a3; // 0x970(0x08)
	struct UTexture2D* SelectTexture; // 0x978(0x08)
	struct UTexture2D* FocusTexture; // 0x980(0x08)
	struct UTexture2D* LinkTexture; // 0x988(0x08)
	struct UTexture2D* NormalTexture; // 0x990(0x08)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x998(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x9a8(0x10)
	bool *2c65fbabdf; // 0x9b8(0x01)
	bool *3bed798b6e; // 0x9b9(0x01)
	char pad_9BA[0x6]; // 0x9ba(0x06)
	struct UEquipableItem* EquipableItem; // 0x9c0(0x08)
	struct UMaterialInstanceDynamic* *f1b9b4474e; // 0x9c8(0x08)
	struct UItem* *c271b0f8ab; // 0x9d0(0x08)
	struct UMaterialInstanceDynamic* *4e361560c9; // 0x9d8(0x08)
	struct UProgressBar* CastingProgressBar; // 0x9e0(0x08)
	struct AInventory* *cb2da98a39; // 0x9e8(0x08)
	struct UCastComponent* *38f103443c; // 0x9f0(0x08)
	struct UMaterialInstanceDynamic* *cfe34b110f; // 0x9f8(0x08)
	struct UMaterialInstanceDynamic* *f0a503d463; // 0xa00(0x08)
	struct ATslCharacter* TslCharacter; // 0xa08(0x08)
	struct UTexture* Tex; // 0xa10(0x08)
	struct UImage* *d189dd0a65; // 0xa18(0x08)
	struct U*c3d8355111* *ab06d6087b; // 0xa20(0x08)
	struct UItemToolTipWidget* *3720cfaf6c; // 0xa28(0x08)
	struct F*174cd056c7 *91fb002b08; // 0xa30(0x78)

	TScriptInterface<struct U*e63b4ff431> BroadCastSlotFocus(); // Function TslGame.*1bacf66c5c.BroadCastSlotFocus // Final|Native|Protected // @ game+0x58161e8
	void OnChangedStackCount(); // Function TslGame.*1bacf66c5c.OnChangedStackCount // Final|Native|Protected // @ game+0x581e7f4
	void BroadCastSlotLeave(TScriptInterface<struct U*e63b4ff431> Param1); // Function TslGame.*1bacf66c5c.BroadCastSlotLeave // Final|Native|Protected // @ game+0x581635c
	TScriptInterface<struct U*e63b4ff431> BroadCastSlotEnter(); // Function TslGame.*1bacf66c5c.BroadCastSlotEnter // Final|Native|Protected // @ game+0x5816090
	void DispatchRefreshInnerList(); // Function TslGame.*1bacf66c5c.DispatchRefreshInnerList // Final|Native|Protected // @ game+0x5818da8
};

// Class TslGame.*e1277c70b0
// Size: 0xab0 (Inherited: 0xaa8)
struct U*e1277c70b0 : U*1bacf66c5c {
	struct U*f30f304519* RadioMessage; // 0xaa8(0x08)
};

// Class TslGame.*203492a5d2
// Size: 0xb18 (Inherited: 0xaa8)
struct U*203492a5d2 : U*1bacf66c5c {
	struct U*24809ef0d2* UserNickNamePlatformImageWidget; // 0xaa8(0x08)
	struct F*f90b3e2b9a *57f59f470e; // 0xab0(0x28)
	float *b6e4a52ddc; // 0xad8(0x04)
	float *c6ac2b22ad; // 0xadc(0x04)
	float *97c1522ee8; // 0xae0(0x04)
	char pad_AE4[0x2c]; // 0xae4(0x2c)
	struct UProgressBar* Pgb_Durability; // 0xb10(0x08)

	void OnInputAPressed(); // Function TslGame.*203492a5d2.OnInputAPressed // Final|Native|Protected // @ game+0x5820aa4
	void OnInputBPressed(); // Function TslGame.*203492a5d2.OnInputBPressed // Final|Native|Protected // @ game+0x5820acc
	void OnInputXReleased(); // Function TslGame.*203492a5d2.OnInputXReleased // Final|Native|Protected // @ game+0x5820b40
	void OnInputYReleased(); // Function TslGame.*203492a5d2.OnInputYReleased // Final|Native|Protected // @ game+0x5820b68
	void OnInputXPressed(); // Function TslGame.*203492a5d2.OnInputXPressed // Final|Native|Protected // @ game+0x5820b2c
	void *e7c9829251(); // Function TslGame.*203492a5d2.*e7c9829251 // Final|Native|Protected // @ game+0x5820b0c
	void NormalState(); // Function TslGame.*203492a5d2.NormalState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void LinkState(); // Function TslGame.*203492a5d2.LinkState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnInputYPressed(); // Function TslGame.*203492a5d2.OnInputYPressed // Final|Native|Protected // @ game+0x5820b54
	void OnInputLThumbPressed(); // Function TslGame.*203492a5d2.OnInputLThumbPressed // Final|Native|Protected // @ game+0x5820ae0
	void OnInputAReleased(); // Function TslGame.*203492a5d2.OnInputAReleased // Final|Native|Protected // @ game+0x5820ab8
	void OnInputLThumbReleased(); // Function TslGame.*203492a5d2.OnInputLThumbReleased // Final|Native|Protected // @ game+0x5820af4
	void FocusState(); // Function TslGame.*203492a5d2.FocusState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void SelfPutState(); // Function TslGame.*203492a5d2.SelfPutState // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*add02b9704
// Size: 0xb10 (Inherited: 0xab0)
struct U*add02b9704 : U*e1277c70b0 {
	struct UBorder* HoverBorder; // 0xab0(0x08)
	struct UWidget* CapacityLayer; // 0xab8(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xac0(0x08)
	struct UTextBlock* MaxCapacityText; // 0xac8(0x08)
	struct FLinearColor TrunkDragEnterColor; // 0xad0(0x10)
	struct FLinearColor TrunkDragLeaveColor; // 0xae0(0x10)
	struct FLinearColor TrunkEmptyTextColor; // 0xaf0(0x10)
	struct UTexture2D* emptytexture; // 0xb00(0x08)
	char pad_B08[0x8]; // 0xb08(0x08)
};

// Class TslGame.*cc39756f12
// Size: 0xb58 (Inherited: 0xb18)
struct U*cc39756f12 : U*203492a5d2 {
	struct UVerticalBox* CategoryAndCapacityBox; // 0xb18(0x08)
	struct UImage* Img_IconBg; // 0xb20(0x08)
	struct UGridPanel* IconGrp; // 0xb28(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xb30(0x08)
	struct UTextBlock* MaxCapacityText; // 0xb38(0x08)
	struct FLinearColor TrunkEmptyTextColor; // 0xb40(0x10)
	char pad_B50[0x8]; // 0xb50(0x08)
};

// Class TslGame.*5e5aa09d3f
// Size: 0x488 (Inherited: 0x410)
struct U*5e5aa09d3f : U*bc854bc287 {
	struct F*82698b8317 KeysPanel_Binder; // 0x410(0x20)
	struct FKey CtrlUnrealKey; // 0x430(0x18)
	struct FKey AltUnrealKey; // 0x448(0x18)
	struct FKey ShiftUnrealKey; // 0x460(0x18)
	struct TArray<struct U*60032840a2*> *8371c6f25b; // 0x478(0x10)
};

// Class TslGame.*63e570857c
// Size: 0x478 (Inherited: 0x410)
struct U*63e570857c : U*bc854bc287 {
	struct F*8c7bdcaa93 DescriptionTextBlock_Binder; // 0x410(0x20)
	struct F*f90b3e2b9a KeyImageHorizontalBox; // 0x430(0x28)
	struct F*8c7bdcaa93 DebugTextBlock_Binder; // 0x458(0x20)
};

// Class TslGame.TslKeyHintContentWidget
// Size: 0x520 (Inherited: 0x410)
struct UTslKeyHintContentWidget : U*bc854bc287 {
	struct UClass* KeyImageWidgetClass; // 0x410(0x08)
	struct FMargin KeyIconPadding; // 0x418(0x10)
	float KeyIconDesiredHeight; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UHorizontalBox* KeyImagePanel; // 0x430(0x08)
	struct UTextBlock* InputModeText; // 0x438(0x08)
	struct U*68fe248867* DisplayNameFlowText; // 0x440(0x08)
	struct TArray<struct U*712196be17*> *148c5b2982; // 0x448(0x10)
	struct F*675385f2e6 *c35a9964c4; // 0x458(0xb0)
	char pad_508[0x18]; // 0x508(0x18)
};

// Class TslGame.*978656d918
// Size: 0x558 (Inherited: 0x520)
struct U*978656d918 : UTslKeyHintContentWidget {
	struct UTexture2D* *9666fdf058; // 0x520(0x08)
	struct FText *7f1762143e; // 0x528(0x18)
	struct FText *393f3218f7; // 0x540(0x18)
};

// Class TslGame.*2ae876d048
// Size: 0x558 (Inherited: 0x520)
struct U*2ae876d048 : UTslKeyHintContentWidget {
	struct FName DummyActionName_Aim; // 0x520(0x08)
	struct FName DummyActionName_ADS; // 0x528(0x08)
	struct FName ActionName_Targeting; // 0x530(0x08)
	struct FName ActionName_Aim; // 0x538(0x08)
	struct FText HoldText; // 0x540(0x18)
};

// Class TslGame.*90cff4ad89
// Size: 0x520 (Inherited: 0x520)
struct U*90cff4ad89 : UTslKeyHintContentWidget {
};

// Class TslGame.*555e42e983
// Size: 0x460 (Inherited: 0x410)
struct U*555e42e983 : U*bc854bc287 {
	enum class EKeyHintType KeyHintType; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct UClass* *6bab8c091c; // 0x418(0x08)
	struct F*1e5151c8f2 *5fc887983f; // 0x420(0x20)
	struct F*72b0194904 *d21ce6965c; // 0x440(0x20)
};

// Class TslGame.*7510ec7bb5
// Size: 0x4b8 (Inherited: 0x410)
struct U*7510ec7bb5 : U*bc854bc287 {
	struct UDataTable* KeyHintDataTable; // 0x410(0x08)
	struct UDataTable* KeyHintInfoDataTable; // 0x418(0x08)
	struct UDataTable* KeyHintTableCheckerSetDataTable; // 0x420(0x08)
	struct UClass* ContentWidgetClass; // 0x428(0x08)
	struct FMargin KeyHintContentPadding; // 0x430(0x10)
	struct TArray<struct FName> DisabledGameModes; // 0x440(0x10)
	struct UVerticalBox* PanelA; // 0x450(0x08)
	struct UVerticalBox* PanelB; // 0x458(0x08)
	struct UInvalidationBox* InvalidationBox; // 0x460(0x08)
	struct U*54cc75d10f* AnimationOnChangeHint; // 0x468(0x08)
	struct TArray<struct F*ab1ffbc918> *64d154cda9; // 0x470(0x10)
	char pad_480[0x10]; // 0x480(0x10)
	struct TArray<struct UTslKeyHintContentWidget*> *2388c220d7; // 0x490(0x10)
	char pad_4A0[0x18]; // 0x4a0(0x18)

	void OnNotifyUpdateKeyHint(); // Function TslGame.*7510ec7bb5.OnNotifyUpdateKeyHint // Final|Native|Private // @ game+0xbdd6e4
	void UpdateSelfPosition(); // Function TslGame.*7510ec7bb5.UpdateSelfPosition // Final|Native|Protected // @ game+0x1f0278
	void OnGameUserSettingApplied(); // Function TslGame.*7510ec7bb5.OnGameUserSettingApplied // Native|Protected // @ game+0x581ea44
};

// Class TslGame.*e952e8c6c9
// Size: 0x4b8 (Inherited: 0x4b8)
struct U*e952e8c6c9 : U*7510ec7bb5 {
};

// Class TslGame.*de3b75f120
// Size: 0x4b8 (Inherited: 0x4b8)
struct U*de3b75f120 : U*7510ec7bb5 {
};

// Class TslGame.*d4f4e39629
// Size: 0x438 (Inherited: 0x410)
struct U*d4f4e39629 : U*bc854bc287 {
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x410(0x08)
	struct USizeBox* KeyHint_SizeBox; // 0x418(0x08)
	float *1032644a77; // 0x420(0x04)
	float *2c2227b016; // 0x424(0x04)
	float *c8a8c7dc54; // 0x428(0x04)
	char pad_42C[0xc]; // 0x42c(0x0c)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*d4f4e39629.UpdatePositionOnMinimapExtended // Final|Native|Protected // @ game+0x583152c
};

// Class TslGame.*404abdb7d5
// Size: 0x448 (Inherited: 0x438)
struct U*404abdb7d5 : U*d4f4e39629 {
	struct FName ActionName; // 0x438(0x08)
	struct U*7d71d941dd* KeyImage; // 0x440(0x08)

	void UpdateKeyImage(); // Function TslGame.*404abdb7d5.UpdateKeyImage // Final|Native|Protected // @ game+0x5831288
};

// Class TslGame.*b8ada00d30
// Size: 0x490 (Inherited: 0x438)
struct U*b8ada00d30 : U*d4f4e39629 {
	struct UVerticalBox* KeyHint_VerticalBox_Console; // 0x438(0x08)
	struct UVerticalBox* KeyHint_VerticalBox_Pc; // 0x440(0x08)
	struct TArray<struct F*f85343fddb> *0b39503b8a; // 0x448(0x10)
	struct TArray<struct F*f85343fddb> *bcccc9bb4a; // 0x458(0x10)
	char pad_468[0x28]; // 0x468(0x28)
};

// Class TslGame.*90d1bb98f1
// Size: 0x4a0 (Inherited: 0x490)
struct U*90d1bb98f1 : U*b8ada00d30 {
	char pad_490[0x10]; // 0x490(0x10)
};

// Class TslGame.*8d9e176041
// Size: 0x448 (Inherited: 0x448)
struct U*8d9e176041 : U*404abdb7d5 {
};

// Class TslGame.*4e458d8ac8
// Size: 0x4b0 (Inherited: 0x410)
struct U*4e458d8ac8 : U*bc854bc287 {
	struct FMulticastDelegate OnKeyReceived; // 0x410(0x10)
	struct FTslInputKey OriginKey; // 0x420(0x20)
	struct FKey FirstDownKey; // 0x440(0x18)
	struct FTslInputKey CurrentDownKey; // 0x458(0x20)
	struct FTslInputKey LastDownedKey; // 0x478(0x20)
	bool bFocused; // 0x498(0x01)
	bool bEnableInput; // 0x499(0x01)
	bool bIsKeyUp; // 0x49a(0x01)
	bool bAxisInput; // 0x49b(0x01)
	float AxisScale; // 0x49c(0x04)
	struct TArray<struct FKey> MouseButtons; // 0x4a0(0x10)

	void KeyUp(); // Function TslGame.*4e458d8ac8.KeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x581b9c4
	void IsInputKeyDown(); // Function TslGame.*4e458d8ac8.IsInputKeyDown // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x581b81c
	void GetLastDownedKeyName(); // Function TslGame.*4e458d8ac8.GetLastDownedKeyName // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5819b68
	void KeyDown(); // Function TslGame.*4e458d8ac8.KeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x581b8e0
	void UpdateKeyUp(); // Function TslGame.*4e458d8ac8.UpdateKeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x583129c
	void UpdateKeyDown(); // Function TslGame.*4e458d8ac8.UpdateKeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x58311a4
};

// Class TslGame.*60032840a2
// Size: 0x548 (Inherited: 0x410)
struct U*60032840a2 : U*bc854bc287 {
	struct FString KeyName; // 0x410(0x10)
	struct FKey MatchingUnrealKey; // 0x420(0x18)
	struct FSlateFontInfo KeyNameFont; // 0x438(0x68)
	enum class EVerticalAlignment KeyNameVerticalAlignment; // 0x4a0(0x01)
	enum class EHorizontalAlignment KeyNameHorizontalAlignment; // 0x4a1(0x01)
	enum class ETextJustify KeyNameJustification; // 0x4a2(0x01)
	char pad_4A3[0x1]; // 0x4a3(0x01)
	float KeyNameWrapTextAt; // 0x4a4(0x04)
	struct FLinearColor NonSelectedBorderColor; // 0x4a8(0x10)
	struct FLinearColor SelectedBorderColor; // 0x4b8(0x10)
	struct FLinearColor NonSelectedTextColor; // 0x4c8(0x10)
	struct FLinearColor SelectedTextColor; // 0x4d8(0x10)
	struct UTexture2D* SelectedKeyBorderImage; // 0x4e8(0x08)
	struct UTexture2D* NonSelectedKeyBorderImage; // 0x4f0(0x08)
	bool bSelected; // 0x4f8(0x01)
	char pad_4F9[0x7]; // 0x4f9(0x07)
	struct F*8c7bdcaa93 KeyNameTextBlock_Binder; // 0x500(0x20)
	struct F*b1a0bce7e4 BorderImage_Binder; // 0x520(0x28)

	void IsSelected(); // Function TslGame.*60032840a2.IsSelected // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b870
	void SetSelected(); // Function TslGame.*60032840a2.SetSelected // Final|Native|Public|BlueprintCallable // @ game+0x582ef94
};

// Class TslGame.*6e7455a86a
// Size: 0x480 (Inherited: 0x410)
struct U*6e7455a86a : U*bc854bc287 {
	struct F*1e5151c8f2 *91909d973e; // 0x410(0x20)
	struct F*1e5151c8f2 *fbaaed3f28; // 0x430(0x20)
	struct F*8c7bdcaa93 *fc39d9e20c; // 0x450(0x20)
	DelegateProperty PopupButtonEvent; // 0x470(0x10)

	void SetPopupWidget(struct FText Title); // Function TslGame.*6e7455a86a.SetPopupWidget // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x582ea34
	void OnClickedNoButtion(); // Function TslGame.*6e7455a86a.OnClickedNoButtion // Final|Native|Private // @ game+0x581ea98
	void OnClickedYesButton(); // Function TslGame.*6e7455a86a.OnClickedYesButton // Final|Native|Private // @ game+0x581eb00
};

// Class TslGame.*9985cfb85c
// Size: 0x430 (Inherited: 0x410)
struct U*9985cfb85c : U*bc854bc287 {
	struct F*72b0194904 *ef41e7bf0c; // 0x410(0x20)
};

// Class TslGame.*efe6fdd6ef
// Size: 0x428 (Inherited: 0x410)
struct U*efe6fdd6ef : U*bc854bc287 {
	float *14bf06468a; // 0x410(0x04)
	float *8c6ed048d4; // 0x414(0x04)
	struct U*57f17b3ca9* UI_KillMessageTextBorderWidget; // 0x418(0x08)
	struct U*76f13d6f18* UI_KillMessageCounterWidget; // 0x420(0x08)
};

// Class TslGame.*76f13d6f18
// Size: 0x4e8 (Inherited: 0x410)
struct U*76f13d6f18 : U*bc854bc287 {
	struct UBorder* TeamKillBorder; // 0x410(0x08)
	struct UBorder* KillCounterBorder; // 0x418(0x08)
	struct UBorder* AssistCounterBorder; // 0x420(0x08)
	struct UScaleBox* AssistCounterScaleBox; // 0x428(0x08)
	struct UTextBlock* KillCurrentCount; // 0x430(0x08)
	struct UTextBlock* KillNextCount; // 0x438(0x08)
	struct UTextBlock* AssistCurrentCount; // 0x440(0x08)
	struct UTextBlock* AssistNextCount; // 0x448(0x08)
	struct UWidgetSwitcher* KillTextSwitcher; // 0x450(0x08)
	struct UWidgetSwitcher* AssistTextSwitcher; // 0x458(0x08)
	struct U*54cc75d10f* KillCountUpEffect; // 0x460(0x08)
	struct U*54cc75d10f* KillCountUpNoEffect; // 0x468(0x08)
	struct U*54cc75d10f* AssistCountUp; // 0x470(0x08)
	struct U*54cc75d10f* KillFadeInEffect; // 0x478(0x08)
	struct U*54cc75d10f* KillFadeInNoEffect; // 0x480(0x08)
	struct U*54cc75d10f* KillFadeInEffectWithoutAssistAnim; // 0x488(0x08)
	struct U*54cc75d10f* KillFadeInNoEffectWithoutAssistAnim; // 0x490(0x08)
	struct U*54cc75d10f* AssistFadeIn; // 0x498(0x08)
	struct U*54cc75d10f* FadeInit; // 0x4a0(0x08)
	struct U*54cc75d10f* CountInit; // 0x4a8(0x08)
	struct U*54cc75d10f* FadeOutAnim; // 0x4b0(0x08)
	float *b859fbcabd; // 0x4b8(0x04)
	struct FVector2D *757e56ed5c; // 0x4bc(0x08)
	float *a135e2782f; // 0x4c4(0x04)
	struct FVector2D *d46fa81d25; // 0x4c8(0x08)
	char pad_4D0[0x18]; // 0x4d0(0x18)
};

// Class TslGame.*40cac0b15a
// Size: 0x490 (Inherited: 0x410)
struct U*40cac0b15a : U*bc854bc287 {
	struct UClass* *1fa1796a82; // 0x410(0x08)
	struct UClass* *762228f12f; // 0x418(0x08)
	struct F*d19b0bbaa6 *f4d1cc1d77; // 0x420(0x20)
	struct U*f51c557625* IconOtherKillMessage; // 0x440(0x08)
	struct F*d19b0bbaa6 *8eb7cebe2e; // 0x448(0x20)
	struct U*efe6fdd6ef* *87ed738dbf; // 0x468(0x08)
	float *9889e3dee7; // 0x470(0x04)
	float *95db1e4b2a; // 0x474(0x04)
	struct TArray<struct FDeathMessage> *5d4193ff88; // 0x478(0x10)
	char pad_488[0x8]; // 0x488(0x08)

	void PushAssistMessage(); // Function TslGame.*40cac0b15a.PushAssistMessage // Final|Native|Private|HasOutParms // @ game+0x5828a90
	void OnDisplayKilledMessage(); // Function TslGame.*40cac0b15a.OnDisplayKilledMessage // Final|Native|Private|HasOutParms // @ game+0x8d9f2c
};

// Class TslGame.*f51c557625
// Size: 0x460 (Inherited: 0x410)
struct U*f51c557625 : U*bc854bc287 {
	struct UClass* *13f76e6d81; // 0x410(0x08)
	struct F*be81a602d7 *5fe8fb856b; // 0x418(0x28)
	struct TArray<struct U*264537b5a3*> FreeMessageWidgets; // 0x440(0x10)
	float *e17c1ad2f8; // 0x450(0x04)
	bool *533ee4866e; // 0x454(0x01)
	bool *c49fc58c82; // 0x455(0x01)
	char pad_456[0x2]; // 0x456(0x02)
	float *0c296d54d3; // 0x458(0x04)
	int32 *1a7033bca8; // 0x45c(0x04)

	void SetKillMessageWidgetClass(); // Function TslGame.*f51c557625.SetKillMessageWidgetClass // Final|Native|Public|BlueprintCallable // @ game+0x582e100
	void EnqueueDeathMessage(); // Function TslGame.*f51c557625.EnqueueDeathMessage // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x581949c
	void OnListSizeLimitChange(); // Function TslGame.*f51c557625.OnListSizeLimitChange // Final|Native|Private // @ game+0x5821014
	void OnVanishFinished(); // Function TslGame.*f51c557625.OnVanishFinished // Final|Native|Public // @ game+0x8dd654
	void ReserveMessageWidgetPool(); // Function TslGame.*f51c557625.ReserveMessageWidgetPool // Final|Native|Public|BlueprintCallable // @ game+0x5828f8c
	void TrimKillMessageWidgetArrayByNumLimit(); // Function TslGame.*f51c557625.TrimKillMessageWidgetArrayByNumLimit // Final|Native|Public|BlueprintCallable // @ game+0x58307f0
};

// Class TslGame.*57f17b3ca9
// Size: 0x430 (Inherited: 0x410)
struct U*57f17b3ca9 : U*bc854bc287 {
	struct UGridPanel* KillMessageGrid; // 0x410(0x08)
	char pad_418[0x18]; // 0x418(0x18)
};

// Class TslGame.*a4a9150435
// Size: 0x4e8 (Inherited: 0x410)
struct U*a4a9150435 : U*bc854bc287 {
	struct U*54cc75d10f* FadeInAnim; // 0x410(0x08)
	struct U*54cc75d10f* Transition1to2; // 0x418(0x08)
	struct U*54cc75d10f* Transition2to3; // 0x420(0x08)
	struct U*54cc75d10f* Transition3to4; // 0x428(0x08)
	struct U*54cc75d10f* Transition4to5; // 0x430(0x08)
	struct U*54cc75d10f* FadeOutAnim; // 0x438(0x08)
	struct U*54cc75d10f* InitAnim; // 0x440(0x08)
	struct U*24809ef0d2* Player1Platform; // 0x448(0x08)
	struct UTslRichTextBlock* KillMsgBlock; // 0x450(0x08)
	struct U*24809ef0d2* Player2Platform; // 0x458(0x08)
	struct UTslRichTextBlock* KillMsgBlock2; // 0x460(0x08)
	struct TMap<struct FName, struct FLinearColor> *376c441a9a; // 0x468(0x50)
	char pad_4B8[0x30]; // 0x4b8(0x30)
};

// Class TslGame.*264537b5a3
// Size: 0x508 (Inherited: 0x410)
struct U*264537b5a3 : U*bc854bc287 {
	struct FMulticastDelegate OnVanishFinished; // 0x410(0x10)
	struct TArray<struct F*c9002241e2> *cd6fbe9b56; // 0x420(0x10)
	struct TArray<struct F*97dd478c3e> *0f241295f2; // 0x430(0x10)
	struct TArray<struct UTexture*> WeaponMasteryLevelIcons; // 0x440(0x10)
	struct F*d19b0bbaa6 *638eed52d3; // 0x450(0x20)
	struct F*d19b0bbaa6 *b1409040cf; // 0x470(0x20)
	struct USizeBox* KillMessageSizebox; // 0x490(0x08)
	struct FText PlayZoneText; // 0x498(0x18)
	struct FText RedZoneText; // 0x4b0(0x18)
	struct FText *4dfb35e6fb; // 0x4c8(0x18)
	struct FText *1e1efbc4c6; // 0x4e0(0x18)
	char pad_4F8[0x10]; // 0x4f8(0x10)

	void *908cc003a3(); // Function TslGame.*264537b5a3.*908cc003a3 // Final|Native|Protected // @ game+0x58220b8
	void SetVanishTimer(); // Function TslGame.*264537b5a3.SetVanishTimer // Final|Native|Public // @ game+0x59526fc
	struct UTexture* GetTextureFromConditionOfDeathCategory(); // Function TslGame.*264537b5a3.GetTextureFromConditionOfDeathCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x593f5a0
	void *7fc0c1b765(); // Function TslGame.*264537b5a3.*7fc0c1b765 // Final|Native|Protected // @ game+0x5953b28
	float GetTextureFromDamageTypeCategory(); // Function TslGame.*264537b5a3.GetTextureFromDamageTypeCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x593f880
	struct FName SetFontStyleAndSize(); // Function TslGame.*264537b5a3.SetFontStyleAndSize // Final|Native|Protected // @ game+0x59515d4
};

// Class TslGame.*86dc4cfbb4
// Size: 0x628 (Inherited: 0x508)
struct U*86dc4cfbb4 : U*264537b5a3 {
	struct FLinearColor NormalColor; // 0x508(0x10)
	struct FLinearColor *d16a53c6cd; // 0x518(0x10)
	struct FLinearColor *dcd0148d05; // 0x528(0x10)
	struct FLinearColor *af788e107b; // 0x538(0x10)
	struct FLinearColor *0a2618c645; // 0x548(0x10)
	struct FLinearColor *7443ea200e; // 0x558(0x10)
	float *21014dc2d2; // 0x568(0x04)
	char pad_56C[0x4]; // 0x56c(0x04)
	struct F*c9002241e2 *20e347e55d; // 0x570(0x20)
	struct UWidgetSwitcher* BgSwitcher; // 0x590(0x08)
	struct UImage* SkinBgLeft; // 0x598(0x08)
	struct UImage* SkinBgRight; // 0x5a0(0x08)
	struct UTextBlock* KillerNameText; // 0x5a8(0x08)
	struct UTextBlock* VictimNameText; // 0x5b0(0x08)
	struct UImage* CauserImage; // 0x5b8(0x08)
	struct USizeBox* CauserSizeBox; // 0x5c0(0x08)
	struct UImage* WeaponMasteryImage; // 0x5c8(0x08)
	struct USizeBox* WeaponMasterySizeBox; // 0x5d0(0x08)
	struct UImage* HeadShotImage; // 0x5d8(0x08)
	struct USizeBox* HeadShotSizeBox; // 0x5e0(0x08)
	struct UImage* ConditionImage; // 0x5e8(0x08)
	struct USizeBox* ConditionSizeBox; // 0x5f0(0x08)
	struct UImage* SkinBgTint; // 0x5f8(0x08)
	struct TArray<struct UImage*> EffectImages; // 0x600(0x10)
	struct UImage* AdditionalEffect; // 0x610(0x08)
	struct U*4f3fafadb8* KillerIcon; // 0x618(0x08)
	struct U*4f3fafadb8* VictimIcon; // 0x620(0x08)

	int32 *db7e4f9599(); // Function TslGame.*86dc4cfbb4.*db7e4f9599 // Final|Native|Protected // @ game+0x581a6b8
	void SetMessageColorAndOpacity(); // Function TslGame.*86dc4cfbb4.SetMessageColorAndOpacity // Final|Native|Protected|HasDefaults // @ game+0x582e600
	void SetLayoutTo(); // Function TslGame.*86dc4cfbb4.SetLayoutTo // Final|Native|Protected // @ game+0x582e3ac
};

// Class TslGame.*e657f05624
// Size: 0x888 (Inherited: 0x508)
struct U*e657f05624 : U*264537b5a3 {
	struct UTexture* *4887f94bfd; // 0x508(0x08)
	struct UTexture* *4ebd9b1e69; // 0x510(0x08)
	struct UTexture* *70adbe83a9; // 0x518(0x08)
	struct UTexture* *c293476a39; // 0x520(0x08)
	struct FLinearColor *33f9268cff; // 0x528(0x10)
	struct FLinearColor *975da30dcc; // 0x538(0x10)
	struct F*8c7bdcaa93 *f3dadce3f1; // 0x548(0x20)
	struct F*8c7bdcaa93 *68856673c2; // 0x568(0x20)
	struct F*8c7bdcaa93 *852a451267; // 0x588(0x20)
	struct F*8c7bdcaa93 *81a51ed034; // 0x5a8(0x20)
	struct F*8c7bdcaa93 *dedcc7c831; // 0x5c8(0x20)
	struct F*8c7bdcaa93 *45b37998d3; // 0x5e8(0x20)
	struct F*06751c9d06 *978bd629f9; // 0x608(0x28)
	struct F*b1a0bce7e4 *a8c92ae769; // 0x630(0x28)
	struct F*b1a0bce7e4 *fbe8d53348; // 0x658(0x28)
	struct F*b1a0bce7e4 *c4fa831a05; // 0x680(0x28)
	struct F*06751c9d06 *3cb57ea35c; // 0x6a8(0x28)
	struct F*b1a0bce7e4 *6d0c530a88; // 0x6d0(0x28)
	struct F*b1a0bce7e4 *e819a1f55f; // 0x6f8(0x28)
	struct F*b1a0bce7e4 *952f1c2e29; // 0x720(0x28)
	struct F*b1a0bce7e4 *f6220f1645; // 0x748(0x28)
	struct F*aad5c0ee0d *ca1ba930e5; // 0x770(0x28)
	struct F*aad5c0ee0d *5cf781b051; // 0x798(0x28)
	struct F*aad5c0ee0d *0480dd50b8; // 0x7c0(0x28)
	struct F*b1a0bce7e4 *70a3975214; // 0x7e8(0x28)
	struct F*7c50600f8f *99ca60db12; // 0x810(0x30)
	struct F*f90b3e2b9a *11d59b5f31; // 0x840(0x28)
	struct F*72b0194904 *d65765aeda; // 0x868(0x20)

	int32 *e580980a21(); // Function TslGame.*e657f05624.*e580980a21 // Final|Native|Private // @ game+0x581a368
	void SetVictimMessageColorAndOpacity(); // Function TslGame.*e657f05624.SetVictimMessageColorAndOpacity // Final|Native|Private|HasDefaults // @ game+0x582f5bc
	void SetLayoutTo(); // Function TslGame.*e657f05624.SetLayoutTo // Final|Native|Private // @ game+0x582e440
};

// Class TslGame.*efc8fbc788
// Size: 0x488 (Inherited: 0x410)
struct U*efc8fbc788 : U*bc854bc287 {
	struct TMap<enum class ELoadingScreenType, struct UTexture2D*> DefaultBackgroundsByType; // 0x410(0x50)
	struct UDataTable* LoadingScreenImageDataTable; // 0x460(0x08)
	struct UTexture2D* *2ea18f2a8f; // 0x468(0x20)

	struct UTexture2D* OnUpdate(struct FText Title); // Function TslGame.*efc8fbc788.OnUpdate // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*7fa455d9e8
// Size: 0x420 (Inherited: 0x410)
struct U*7fa455d9e8 : U*bc854bc287 {
	struct USizeBox* LoadingSpinnerSizeBox; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)

	void ShowSpinner(); // Function TslGame.*7fa455d9e8.ShowSpinner // Final|Native|Protected // @ game+0x582fcd8
};

// Class TslGame.*93a25d4218
// Size: 0x458 (Inherited: 0x410)
struct U*93a25d4218 : U*bc854bc287 {
	struct UClass* LobbyNameNameTagWidgetClass; // 0x410(0x08)
	struct F*c1cf1c46a8 *1ae60d5367; // 0x418(0x28)
	bool bUseNameTagOffsetTranslations; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct TArray<struct FVector> NameTagOffsetTranslations; // 0x448(0x10)

	void UpdateNameTagWidget_Internal(); // Function TslGame.*93a25d4218.UpdateNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x5831380
	void SetNameTagWidget_Internal(); // Function TslGame.*93a25d4218.SetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x582e6ac
	void ResetNameTagWidget_Internal(); // Function TslGame.*93a25d4218.ResetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x5829210
	int32 GetNameTagWidget_Internal(); // Function TslGame.*93a25d4218.GetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5819d74
};

// Class TslGame.*dbd2366bbb
// Size: 0x4c0 (Inherited: 0x410)
struct U*dbd2366bbb : U*bc854bc287 {
	struct UTextBlock* NickNameText; // 0x410(0x08)
	struct U*24809ef0d2* UserPlatformImageWidget; // 0x418(0x08)
	struct U*1d3b90ef0e* RankEmblemWidget; // 0x420(0x08)
	struct UWidgetSwitcher* VoiceSwitcher; // 0x428(0x08)
	struct USizeBox* VoiceSizeBox; // 0x430(0x08)
	struct USizeBox* HostSizeBox; // 0x438(0x08)
	struct USizeBox* SizeBoxForStatus; // 0x440(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x448(0x08)
	struct USizeBox* SizeBoxForMiddle; // 0x450(0x08)
	struct U*990321e31a* Clanplate; // 0x458(0x08)
	bool *73b39f11ac; // 0x460(0x01)
	bool bHideIfAlone; // 0x461(0x01)
	bool bHideStateIconIfAlone; // 0x462(0x01)
	bool bHideIdleStateIcon; // 0x463(0x01)
	struct FVector RankNameTagOffsetTranslations; // 0x464(0x0c)
	char pad_470[0x4]; // 0x470(0x04)
	int32 SlotIndex; // 0x474(0x04)
	struct FName NameTagSocketName; // 0x478(0x08)
	struct FVector NameTagOffsetTranslation; // 0x480(0x0c)
	bool bIsHost; // 0x48c(0x01)
	bool bIsReady; // 0x48d(0x01)
	bool bIsSpeaking; // 0x48e(0x01)
	bool bIsLogout; // 0x48f(0x01)
	struct FString Nickname; // 0x490(0x10)
	struct FString ClanTag; // 0x4a0(0x10)
	struct FString ClanplateId; // 0x4b0(0x10)

	void UpdateWidgetSwitchers(); // Function TslGame.*dbd2366bbb.UpdateWidgetSwitchers // Final|Native|Public|BlueprintCallable // @ game+0x5831f80
	struct FString InitWidget(); // Function TslGame.*dbd2366bbb.InitWidget // Final|Native|Public|BlueprintCallable // @ game+0x581b36c
	void OnVoiceChatUpdated(struct FString Param0, bool Param2); // Function TslGame.*dbd2366bbb.OnVoiceChatUpdated // Final|Native|Protected // @ game+0x5827358
	void SetReady(); // Function TslGame.*dbd2366bbb.SetReady // Final|Native|Private // @ game+0xd1e1f0
	struct FString OnParticipantMuteChanged(); // Function TslGame.*dbd2366bbb.OnParticipantMuteChanged // Final|Native|Protected // @ game+0x5822f58
	void SetNickNameAndClanTag(struct FString InNickName); // Function TslGame.*dbd2366bbb.SetNickNameAndClanTag // Final|Native|Public|BlueprintCallable // @ game+0x582e73c
	void SetOffsetTranslation(); // Function TslGame.*dbd2366bbb.SetOffsetTranslation // Final|Native|Public|HasOutParms|HasDefaults // @ game+0x582e8fc
	void UpdateNickNameAndClanName(); // Function TslGame.*dbd2366bbb.UpdateNickNameAndClanName // Final|Native|Public|BlueprintCallable // @ game+0x5831410
	void SetPlatformIcon(); // Function TslGame.*dbd2366bbb.SetPlatformIcon // Final|Native|Private // @ game+0x582e9a4
	void SetHost(); // Function TslGame.*dbd2366bbb.SetHost // Final|Native|Private // @ game+0xdcc4f4
	void SetSpeaking(); // Function TslGame.*dbd2366bbb.SetSpeaking // Final|Native|Private // @ game+0x582f23c
	void SetRankEmblem(); // Function TslGame.*dbd2366bbb.SetRankEmblem // Final|Native|Private // @ game+0x582ed4c
	void *6777963a4b(); // Function TslGame.*dbd2366bbb.*6777963a4b // Final|Native|Private|Const // @ game+0x581b6cc
	void SetBinding(); // Function TslGame.*dbd2366bbb.SetBinding // Final|Native|Private // @ game+0x582dacc
	void OnTeamVoiceChannelLeave(); // Function TslGame.*dbd2366bbb.OnTeamVoiceChannelLeave // Final|Native|Public // @ game+0x5825a74
	void SetNameTagProps(); // Function TslGame.*dbd2366bbb.SetNameTagProps // Final|Native|Public // @ game+0x582e698
	void UpdateWidgetsVisibilities(); // Function TslGame.*dbd2366bbb.UpdateWidgetsVisibilities // Final|Native|Public|BlueprintCallable // @ game+0x5831f94
};

// Class TslGame.*3b1a73df01
// Size: 0x420 (Inherited: 0x410)
struct U*3b1a73df01 : U*bc854bc287 {
	struct UImage* ImageTowerBind; // 0x410(0x08)
	enum class ETslMapMarkerTowerState *9927eccd64; // 0x418(0x01)
	bool *9c0fa01577; // 0x419(0x01)
	char pad_41A[0x6]; // 0x41a(0x06)
};

// Class TslGame.*4519917546
// Size: 0x608 (Inherited: 0x410)
struct U*4519917546 : U*bc854bc287 {
	struct FSlateColor *59c5bf1196; // 0x410(0x28)
	struct FSlateFontInfo *39a579dda5; // 0x438(0x68)
	struct FSlateColor *43c0738d01; // 0x4a0(0x28)
	struct FSlateColor *4ac1f7ed1f; // 0x4c8(0x28)
	struct FSlateFontInfo *aa4874e0da; // 0x4f0(0x68)
	struct FSlateColor *382bdd1e0b; // 0x558(0x28)
	struct FSlateColor *da13b6fbc4; // 0x580(0x28)
	struct FSlateColor *5c7d21d4b1; // 0x5a8(0x28)
	struct UTextBlock* TimestampTextBlock; // 0x5d0(0x08)
	struct U*24809ef0d2* PlatformImageWidget; // 0x5d8(0x08)
	struct UTslRichTextBlock* MessageTextBlock; // 0x5e0(0x08)
	struct U*24809ef0d2* PlatformImageWidget2; // 0x5e8(0x08)
	struct UTslRichTextBlock* MessageTextBlock2; // 0x5f0(0x08)
	struct UImage* HighlightImage; // 0x5f8(0x08)
	struct USizeBox* MatchLogContentSizeBox; // 0x600(0x08)

	void Update(struct FMatchLog Param0); // Function TslGame.*4519917546.Update // Final|Native|Public|HasOutParms // @ game+0x5830a9c
};

// Class TslGame.*e980325b7b
// Size: 0x4a0 (Inherited: 0x410)
struct U*e980325b7b : U*bc854bc287 {
	struct UClass* *cf0dba3f88; // 0x410(0x08)
	float *45d3ba570f; // 0x418(0x04)
	int32 *24a8a175f4; // 0x41c(0x04)
	struct U*470d1af080* TabSelectorWidget; // 0x420(0x08)
	struct UScrollBox* ContentsScrollBox; // 0x428(0x08)
	struct U*2c98f921a9* GamepadScrollGuideKeyIcon; // 0x430(0x08)
	struct UButton* BackButton; // 0x438(0x08)
	struct USpacer* TopSpacer; // 0x440(0x08)
	struct USpacer* BottomSpacer; // 0x448(0x08)
	struct UVerticalBox* LogVerticalBox; // 0x450(0x08)
	struct UTextBlock* NoMatchLogTextBlock; // 0x458(0x08)
	struct TArray<struct FMatchLog> *b3c2950e27; // 0x460(0x10)
	enum class EMatchLogTab CurrentTab; // 0x470(0x01)
	bool *bba8152868; // 0x471(0x01)
	bool *93d615ec1f; // 0x472(0x01)
	char pad_473[0x5]; // 0x473(0x05)
	struct TArray<struct U*4519917546*> *09a15d5155; // 0x478(0x10)
	struct TArray<bool> *0751f9053f; // 0x488(0x10)
	float *cb20222131; // 0x498(0x04)
	float *38db9737c5; // 0x49c(0x04)

	void HandleQuickScrollingDown(); // Function TslGame.*e980325b7b.HandleQuickScrollingDown // Final|Native|Protected // @ game+0x581b054
	void HandleTabRotated(); // Function TslGame.*e980325b7b.HandleTabRotated // Final|Native|Protected // @ game+0x581b13c
	void HandleNewMatchLogAdded(); // Function TslGame.*e980325b7b.HandleNewMatchLogAdded // Final|Native|Protected // @ game+0x581a838
	void HandleRotateTabRight(); // Function TslGame.*e980325b7b.HandleRotateTabRight // Final|Native|Protected // @ game+0x581b090
	void HandleBackButtonClicked(); // Function TslGame.*e980325b7b.HandleBackButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x581a790
	void HandleRotateTabLeft(); // Function TslGame.*e980325b7b.HandleRotateTabLeft // Final|Native|Protected // @ game+0x581b07c
	void HandleQuickScrollingUp(); // Function TslGame.*e980325b7b.HandleQuickScrollingUp // Final|Native|Protected // @ game+0x581b068
	void HandleScroll(); // Function TslGame.*e980325b7b.HandleScroll // Final|Native|Protected // @ game+0x581b0a4
};

// Class TslGame.*d7766704d1
// Size: 0x468 (Inherited: 0x410)
struct U*d7766704d1 : U*bc854bc287 {
	char pad_410[0x18]; // 0x410(0x18)
	struct F*8c7bdcaa93 *b473198ab5; // 0x428(0x20)
	struct F*8c7bdcaa93 *acf71f7c8a; // 0x448(0x20)
};

// Class TslGame.*69854b0ebd
// Size: 0x540 (Inherited: 0x410)
struct U*69854b0ebd : U*bc854bc287 {
	struct UClass* PlayerInfoWidgetTemplate; // 0x410(0x08)
	struct F*be81a602d7 *cd2b519c20; // 0x418(0x28)
	struct F*8c7bdcaa93 *d7d32e19df; // 0x440(0x20)
	struct F*8c7bdcaa93 *c80ec366f4; // 0x460(0x20)
	struct F*8c7bdcaa93 *e5171555e4; // 0x480(0x20)
	struct F*8c7bdcaa93 *4b2581c905; // 0x4a0(0x20)
	struct F*d19b0bbaa6 *7153e0c029; // 0x4c0(0x20)
	struct F*72b0194904 *3bed6d38cc; // 0x4e0(0x20)
	struct F*72b0194904 *116ae51d27; // 0x500(0x20)
	char pad_520[0x8]; // 0x520(0x08)
	struct TArray<struct U*d7766704d1*> *2ec64a889e; // 0x528(0x10)
	char pad_538[0x8]; // 0x538(0x08)

	void *ca9a690d1c(); // Function TslGame.*69854b0ebd.*ca9a690d1c // Final|Native|Protected // @ game+0x58258d0
};

// Class TslGame.TslMediaPlayerWidget
// Size: 0x458 (Inherited: 0x410)
struct UTslMediaPlayerWidget : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct UMediaPlayer* MediaPlayer; // 0x418(0x08)
	struct UPlatformMediaSource* *e5589784b8; // 0x420(0x08)
	struct UAkAudioEvent* *c463cfd3e4; // 0x428(0x08)
	struct UAkAudioEvent* *f81e75b5d4; // 0x430(0x08)
	bool *071e4e8cb4; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct USizeBox* VideoSizeBox; // 0x440(0x08)
	struct UAkComponent* *a6053d74ee; // 0x448(0x08)
	char pad_450[0x8]; // 0x450(0x08)

	void OnSkipVideoPressed(); // Function TslGame.TslMediaPlayerWidget.OnSkipVideoPressed // Final|Native|Protected // @ game+0x5824a4c
	void OnVideoEnded(); // Function TslGame.TslMediaPlayerWidget.OnVideoEnded // Final|Native|Public // @ game+0x58270ac
};

// Class TslGame.*a88f0a770f
// Size: 0x560 (Inherited: 0x410)
struct U*a88f0a770f : U*bc854bc287 {
	struct TArray<struct F*9526feaf82> *3fd5606e7a; // 0x410(0x10)
	struct F*1e5151c8f2 *e284e27806; // 0x420(0x20)
	struct F*1e5151c8f2 *28c3b0cba6; // 0x440(0x20)
	struct F*1e5151c8f2 *590ebd7b56; // 0x460(0x20)
	struct F*1e5151c8f2 *b0b33d8098; // 0x480(0x20)
	struct F*1e5151c8f2 *6afb851073; // 0x4a0(0x20)
	struct F*1e5151c8f2 *6041ca2623; // 0x4c0(0x20)
	struct F*1e5151c8f2 *bf21291995; // 0x4e0(0x20)
	struct F*1e5151c8f2 *99d56ed5e2; // 0x500(0x20)
	struct F*1e5151c8f2 *6011fcacaa; // 0x520(0x20)
	struct U*91d390f031* PubgIdWidget; // 0x540(0x08)
	float PubgIdLifeTime; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UStringTable* UIStringTable; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)

	struct UImage* *8096ad0a45(); // Function TslGame.*a88f0a770f.*8096ad0a45 // Final|Native|Private // @ game+0x5818ca4
	struct UAkAudioEvent* CreateSystemMessage(); // Function TslGame.*a88f0a770f.CreateSystemMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x2cd4ac
	void *a8ab43500b(); // Function TslGame.*a88f0a770f.*a8ab43500b // Final|Native|Private // @ game+0x5821298
	bool *e25c5abe28(int32 Param0); // Function TslGame.*a88f0a770f.*e25c5abe28 // Final|Native|Private // @ game+0x581f5e8
	struct U*326f7af4a4* *6d18ed6c26(); // Function TslGame.*a88f0a770f.*6d18ed6c26 // Final|Native|Private // @ game+0x58289b8
	void *a5a94de4cc(struct TArray<struct F*9526feaf82> Param0); // Function TslGame.*a88f0a770f.*a5a94de4cc // Final|Native|Private|HasOutParms // @ game+0x5818dc4
	void CreateVoiceChannelStateMessage(); // Function TslGame.*a88f0a770f.CreateVoiceChannelStateMessage // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void *58c4eeab3a(); // Function TslGame.*a88f0a770f.*58c4eeab3a // Final|Native|Private // @ game+0x581b610
	struct TArray<struct F*9526feaf82> *e7cd29a704(); // Function TslGame.*a88f0a770f.*e7cd29a704 // Final|Native|Private|HasOutParms // @ game+0x5828e28
	void UpdatePubgIdWidgetWithKiller(); // Function TslGame.*a88f0a770f.UpdatePubgIdWidgetWithKiller // Final|Native|Private // @ game+0x5831568
	void OnDisplayVoiceChannelStateMessage(); // Function TslGame.*a88f0a770f.OnDisplayVoiceChannelStateMessage // Final|Native|Private // @ game+0x581f75c
	void HidePubgIdWidget(); // Function TslGame.*a88f0a770f.HidePubgIdWidget // Final|Native|Public // @ game+0x581b20c
	int32 *67edaef94c(); // Function TslGame.*a88f0a770f.*67edaef94c // Final|Native|Private // @ game+0x581a408
	float CreateGamePlayMessage(struct UAkAudioEvent* Sound); // Function TslGame.*a88f0a770f.CreateGamePlayMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x2cd4ac
	void OnDisplayMessage(struct FText Param1); // Function TslGame.*a88f0a770f.OnDisplayMessage // Final|Native|Private // @ game+0x812920
};

// Class TslGame.*5ee1db0c28
// Size: 0x450 (Inherited: 0x410)
struct U*5ee1db0c28 : U*bc854bc287 {
	struct FString Name; // 0x410(0x10)
	int32 Level; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct FString EmblemId; // 0x428(0x10)
	struct FString NameplateId; // 0x438(0x10)
	enum class EOutGamePlatformProvider Platform; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
};

// Class TslGame.*4ff6e4dd74
// Size: 0x5a8 (Inherited: 0x410)
struct U*4ff6e4dd74 : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct F*be81a602d7 MissionItemVerticalBox_Binder; // 0x418(0x28)
	struct F*8c7bdcaa93 MissionGroupText_Binder; // 0x440(0x20)
	struct F*b1a0bce7e4 ProgressImage_Binder; // 0x460(0x28)
	struct F*8c7bdcaa93 ProgressText_Binder; // 0x488(0x20)
	struct F*72b0194904 LockWidgetAnimation_Binder; // 0x4a8(0x20)
	struct F*7c50600f8f LockBorder_Binder; // 0x4c8(0x30)
	struct F*7c50600f8f ButtonBorder_Binder; // 0x4f8(0x30)
	struct F*b1a0bce7e4 ExpandImage_Binder; // 0x528(0x28)
	struct F*519e1635dd WidgetBody_Binder; // 0x550(0x28)
	struct UTexture2D* ExpandTexture; // 0x578(0x08)
	struct UTexture2D* CollapsTexture; // 0x580(0x08)
	char pad_588[0x8]; // 0x588(0x08)
	struct U*aa4be1097b* *8b316f4a94; // 0x590(0x08)
	struct FMulticastDelegate OnExpanded; // 0x598(0x10)

	void *273cd1d7db(); // Function TslGame.*4ff6e4dd74.*273cd1d7db // Final|Native|Public // @ game+0x5819cac
	void OnButtonDown(struct FGeometry Param0); // Function TslGame.*4ff6e4dd74.OnButtonDown // Final|Native|Private|HasOutParms // @ game+0x581e0f8
	void NotifyWidgetInputA(); // Function TslGame.*4ff6e4dd74.NotifyWidgetInputA // Final|Native|Public|BlueprintCallable // @ game+0x581d3b4
	void *70dd72450b(); // Function TslGame.*4ff6e4dd74.*70dd72450b // Final|Native|Public // @ game+0x5819cd8
	void UpdateDesign_Focused(); // Function TslGame.*4ff6e4dd74.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void UpdateDesign_Normal(); // Function TslGame.*4ff6e4dd74.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*fb74bf4bd9
// Size: 0x560 (Inherited: 0x410)
struct U*fb74bf4bd9 : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	struct UTextBlock* DescriptionText; // 0x420(0x08)
	struct UTextBlock* ProgressText; // 0x428(0x08)
	struct UImage* IconImage; // 0x430(0x08)
	struct UImage* StateImage; // 0x438(0x08)
	struct UImage* ProgressBarImage; // 0x440(0x08)
	struct UBorder* InfoBorder; // 0x448(0x08)
	struct UBorder* ProgressBarBorder; // 0x450(0x08)
	struct UBorder* MissionListBorder; // 0x458(0x08)
	struct TMap<struct FString, struct UTexture2D*> MissionIcons; // 0x460(0x50)
	struct UTexture2D* DefaultMissionIcon; // 0x4b0(0x08)
	struct UTexture2D* LockTexture; // 0x4b8(0x08)
	struct UTexture2D* CompleteTexture; // 0x4c0(0x08)
	float InactiveIconAlpha; // 0x4c8(0x04)
	float ActiveIconAlpha; // 0x4cc(0x04)
	float InactiveTextAlpha; // 0x4d0(0x04)
	float InactiveProgressBarBorderAlpha; // 0x4d4(0x04)
	int32 FontSizeForPC; // 0x4d8(0x04)
	int32 FontSizeForConsole; // 0x4dc(0x04)
	struct FLinearColor ActiveInfoBorderColor; // 0x4e0(0x10)
	struct FLinearColor AchievedInfoBorderColor; // 0x4f0(0x10)
	struct FLinearColor ActiveMissionBorderColor; // 0x500(0x10)
	struct FLinearColor AchievedMissionBorderColor; // 0x510(0x10)
	struct FName ScalarParamNameFirstEnd; // 0x520(0x08)
	struct FName ScalarParamNameSecondEnd; // 0x528(0x08)
	struct FString MissionId; // 0x530(0x10)
	struct FString MissionType; // 0x540(0x10)
	char pad_550[0x8]; // 0x550(0x08)
	struct U*aa4be1097b* *8b316f4a94; // 0x558(0x08)

	void UpdateDesign_Focused(); // Function TslGame.*fb74bf4bd9.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void UpdateDesign_Normal(); // Function TslGame.*fb74bf4bd9.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*3ffce7bd2f
// Size: 0x448 (Inherited: 0x410)
struct U*3ffce7bd2f : U*bc854bc287 {
	char pad_410[0x20]; // 0x410(0x20)
	struct UMaterialInstanceDynamic* *7b54b92337; // 0x430(0x08)
	struct UImage* HpImage; // 0x438(0x08)
	float *72030a7a74; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class TslGame.*5975ef1fd6
// Size: 0x468 (Inherited: 0x410)
struct U*5975ef1fd6 : U*bc854bc287 {
	struct F*82698b8317 KeysPanel_Binder; // 0x410(0x20)
	struct F*b1a0bce7e4 MiddleMouseButton_Binder; // 0x430(0x28)
	struct TArray<struct FString> MiddleMouseButtonActionsOrAxies; // 0x458(0x10)
};

// Class TslGame.*a08c7e2d25
// Size: 0x4a8 (Inherited: 0x410)
struct U*a08c7e2d25 : U*bc854bc287 {
	struct F*b1a0bce7e4 *df23910b16; // 0x410(0x28)
	struct F*8c7bdcaa93 *e6e12da19f; // 0x438(0x20)
	struct F*c1cf1c46a8 *047798916a; // 0x458(0x28)
	struct FVector2D *683a32f202; // 0x480(0x08)
	struct UMaterialInstanceDynamic* *969def6293; // 0x488(0x08)
	struct U*4824d34a7d* CastingBarInfoText; // 0x490(0x08)
	char pad_498[0x10]; // 0x498(0x10)
};

// Class TslGame.*326f7af4a4
// Size: 0x4f0 (Inherited: 0x410)
struct U*326f7af4a4 : U*bc854bc287 {
	enum class EVerticalAlignment *7bb53b0993; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	int32 *5d57b8f183; // 0x414(0x04)
	bool *49e9dec72c; // 0x418(0x01)
	bool *f7bb2dd976; // 0x419(0x01)
	char pad_41A[0x6]; // 0x41a(0x06)
	struct UCurveFloat* *6be0fae18c; // 0x420(0x08)
	struct FVector2D BorderSize; // 0x428(0x08)
	bool *e982f1ccb0; // 0x430(0x01)
	bool *4724bcb35d; // 0x431(0x01)
	char pad_432[0x6]; // 0x432(0x06)
	struct TArray<struct U*ff9dd5d1b4*> *a54f078799; // 0x438(0x10)
	struct U*ff9dd5d1b4* *9b09e9536e; // 0x448(0x08)
	struct F*1e5151c8f2 *6d4a975a22; // 0x450(0x20)
	struct F*1e5151c8f2 *4461501724; // 0x470(0x20)
	struct F*1e5151c8f2 *8c27c32a8d; // 0x490(0x20)
	struct FVector2D *13f469e388; // 0x4b0(0x08)
	struct TArray<struct FVector2D> *e8395b9c57; // 0x4b8(0x10)
	float *5c3ef0e23a; // 0x4c8(0x04)
	struct FVector2D *60274dd99e; // 0x4cc(0x08)
	struct FVector2D *8f89847895; // 0x4d4(0x08)
	struct FVector2D *9d74aacde1; // 0x4dc(0x08)
	float *ca62076f85; // 0x4e4(0x04)
	int32 Count; // 0x4e8(0x04)
	bool *1d3ed605ac; // 0x4ec(0x01)
	char pad_4ED[0x3]; // 0x4ed(0x03)

	void *11ee35dc2e(); // Function TslGame.*326f7af4a4.*11ee35dc2e // Final|Native|Public // @ game+0x5816648
	void *73e1d06951(); // Function TslGame.*326f7af4a4.*73e1d06951 // Final|Native|Protected // @ game+0x5819c88
	enum class ESlateSizeRule SetSizeRule(); // Function TslGame.*326f7af4a4.SetSizeRule // Final|Native|Protected // @ game+0x582f028
	void OnRemoveMessage(); // Function TslGame.*326f7af4a4.OnRemoveMessage // Final|Native|Public // @ game+0xbd907c
	void *fc412e99cf(); // Function TslGame.*326f7af4a4.*fc412e99cf // Final|Native|Protected // @ game+0x58317cc
	void *eb3aa42547(); // Function TslGame.*326f7af4a4.*eb3aa42547 // Final|Native|Protected // @ game+0x581be30
	void *f73b6392e0(); // Function TslGame.*326f7af4a4.*f73b6392e0 // Final|Native|Public // @ game+0x581b1cc
	void *15d3d8570b(); // Function TslGame.*326f7af4a4.*15d3d8570b // Final|Native|Public // @ game+0x5831504
	void *3bf4315999(); // Function TslGame.*326f7af4a4.*3bf4315999 // Final|Native|Protected // @ game+0x581b7fc
};

// Class TslGame.*b4a4e4eb06
// Size: 0x4f0 (Inherited: 0x4f0)
struct U*b4a4e4eb06 : U*326f7af4a4 {
};

// Class TslGame.*ff9dd5d1b4
// Size: 0x470 (Inherited: 0x410)
struct U*ff9dd5d1b4 : U*bc854bc287 {
	struct FText Message; // 0x410(0x18)
	float Duration; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UAkAudioEvent* Sound; // 0x430(0x08)
	struct FMulticastDelegate EndMessage; // 0x438(0x10)
	bool bUsed; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
	struct F*da672abddc *5fd9b39ab7; // 0x450(0x08)
	struct UTextBlock* MessageTextBlock; // 0x458(0x08)
	struct U*54cc75d10f* Anim_FadeIn; // 0x460(0x08)
	struct U*54cc75d10f* Anim_FadeOut; // 0x468(0x08)

	void OnFadeOutFinished(); // Function TslGame.*ff9dd5d1b4.OnFadeOutFinished // Final|Native|Public // @ game+0x812274
	void OnFadeInFinished(); // Function TslGame.*ff9dd5d1b4.OnFadeInFinished // Final|Native|Public // @ game+0xaa61a8
	void StartFadeOut(); // Function TslGame.*ff9dd5d1b4.StartFadeOut // Final|Native|Public // @ game+0xc4f5ac
};

// Class TslGame.*403ee956cf
// Size: 0x468 (Inherited: 0x410)
struct U*403ee956cf : U*bc854bc287 {
	struct U*5dd8e6c560* TeamManagement; // 0x410(0x08)
	struct U*7c3fbbf89b* TeamManagementPopup; // 0x418(0x08)
	struct U*46fedf838a* SystemMenu; // 0x420(0x08)
	struct U*0b12cc9da8* ReportPlayerWidget; // 0x428(0x08)
	struct TArray<struct ATeam*> *ce18809a14; // 0x430(0x10)
	char pad_440[0x18]; // 0x440(0x18)
	struct U*6927fa4953* MissionList; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)

	void OnReport(); // Function TslGame.*403ee956cf.OnReport // Final|Native|Public // @ game+0x5824078
	void InitBinding(); // Function TslGame.*403ee956cf.InitBinding // Final|Native|Public|BlueprintCallable // @ game+0x581b358
	void *096b14b30f(); // Function TslGame.*403ee956cf.*096b14b30f // Final|Native|Protected // @ game+0x5819aa4
	void OnNotifyReportTeamMember(); // Function TslGame.*403ee956cf.OnNotifyReportTeamMember // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
	void OnSuccessfullyReportPlayer(); // Function TslGame.*403ee956cf.OnSuccessfullyReportPlayer // Final|Native|Public // @ game+0x58256c0
};

// Class TslGame.*7e362f6c96
// Size: 0x4e8 (Inherited: 0x410)
struct U*7e362f6c96 : U*bc854bc287 {
	struct UBorder* BorderNotificationMessage; // 0x410(0x08)
	struct UImage* ImageIcon; // 0x418(0x08)
	struct UWidgetSwitcher* SwitcherMessage; // 0x420(0x08)
	struct UTextBlock* TextMessage; // 0x428(0x08)
	struct UTslRichTextBlock* RichTextMessage; // 0x430(0x08)
	struct U*54cc75d10f* AnimAppear; // 0x438(0x08)
	struct U*54cc75d10f* AnimAppearLoop; // 0x440(0x08)
	struct U*54cc75d10f* AnimDisappear; // 0x448(0x08)
	struct UDataTable* NotificationMessageTable; // 0x450(0x08)
	struct TMap<enum class ETslNotificationMessageColorType, struct FSlateColor> *d5c9497272; // 0x458(0x50)
	struct F*839166cc57 *0ab3cf5033; // 0x4a8(0x38)
	char pad_4E0[0x8]; // 0x4e0(0x08)
};

// Class TslGame.*9f06b5e018
// Size: 0x4f8 (Inherited: 0x410)
struct U*9f06b5e018 : U*bc854bc287 {
	struct F*72b0194904 LastTeamsAnimBinder; // 0x410(0x20)
	struct F*72b0194904 LastTeamsSkipAnimBinder; // 0x430(0x20)
	struct F*72b0194904 LastTeamsInitAnimBinder; // 0x450(0x20)
	struct TArray<struct F*d19b0bbaa6> PlayerIconWidgetBinders; // 0x470(0x10)
	struct TArray<struct F*d19b0bbaa6> LastTeamInfoWidgetBinders; // 0x480(0x10)
	struct TMap<int32, struct U*781e92dfff*> *eef9e38d7d; // 0x490(0x50)
	struct U*7cbb8e2e03* *4adffdff91; // 0x4e0(0x08)
	char pad_4E8[0x10]; // 0x4e8(0x10)

	void OnInitLastTeams(); // Function TslGame.*9f06b5e018.OnInitLastTeams // Final|Native|Public // @ game+0x5820a90
	void UpdateCurrentAliveCount(); // Function TslGame.*9f06b5e018.UpdateCurrentAliveCount // Final|Native|Public // @ game+0x5830e74
};

// Class TslGame.*781e92dfff
// Size: 0x5a0 (Inherited: 0x410)
struct U*781e92dfff : U*bc854bc287 {
	struct TArray<struct F*b1a0bce7e4> PlayerImageWidgetBinders; // 0x410(0x10)
	struct F*b1a0bce7e4 BGImageWidgetBinder; // 0x420(0x28)
	struct F*b1a0bce7e4 PatternImageWidgetBinder; // 0x448(0x28)
	struct F*8c7bdcaa93 NameTextWidgetBinder; // 0x470(0x20)
	struct F*7c50600f8f LogoBorderWidgetBinder; // 0x490(0x30)
	struct F*06751c9d06 LogoSwitcherWidgetBinder; // 0x4c0(0x28)
	struct F*b1a0bce7e4 TeamIconImageWidgetBinder; // 0x4e8(0x28)
	struct F*72b0194904 EndAnimBinder; // 0x510(0x20)
	struct FLinearColor BGImageDimColor; // 0x530(0x10)
	struct FLinearColor NameTextNormalColor; // 0x540(0x10)
	struct FLinearColor NameTextDimColor; // 0x550(0x10)
	struct FLinearColor PlayerNormalColor; // 0x560(0x10)
	struct FLinearColor PlayerGroggyColor; // 0x570(0x10)
	struct FLinearColor PlayerDieColor; // 0x580(0x10)
	char pad_590[0x10]; // 0x590(0x10)
};

// Class TslGame.*38bd75c7dc
// Size: 0x438 (Inherited: 0x410)
struct U*38bd75c7dc : U*bc854bc287 {
	struct F*06751c9d06 PlayerStateIconsSwitcherBinder; // 0x410(0x28)
};

// Class TslGame.*ce60637180
// Size: 0x4a8 (Inherited: 0x410)
struct U*ce60637180 : U*bc854bc287 {
	struct F*7c50600f8f LogoBorderWidgetBinder; // 0x410(0x30)
	struct F*82698b8317 LogoPanelWidgetBinder; // 0x440(0x20)
	struct F*b1a0bce7e4 LastTeamPatternWidgetBinder; // 0x460(0x28)
	struct F*8c7bdcaa93 LastTeamTextWidgetBinder; // 0x488(0x20)
};

// Class TslGame.*5db1bcfd9e
// Size: 0x420 (Inherited: 0x410)
struct U*5db1bcfd9e : U*bc854bc287 {
	struct U*7cbb8e2e03* Manager; // 0x410(0x08)
	struct U*24809ef0d2* PlatformImage; // 0x418(0x08)
};

// Class TslGame.*168f2b1f68
// Size: 0x628 (Inherited: 0x420)
struct U*168f2b1f68 : U*5db1bcfd9e {
	struct F*06751c9d06 *30484bd7b9; // 0x420(0x28)
	struct F*06751c9d06 *29d21195da; // 0x448(0x28)
	struct F*72b0194904 *6fb1c6529a; // 0x470(0x20)
	struct F*d19b0bbaa6 *f42c180a5e; // 0x490(0x20)
	struct F*d19b0bbaa6 *2bb8cd7d6f; // 0x4b0(0x20)
	struct F*8c7bdcaa93 *7fe235e0c2; // 0x4d0(0x20)
	struct F*8c7bdcaa93 *27d80bf6b1; // 0x4f0(0x20)
	struct F*72b0194904 *320721bff5; // 0x510(0x20)
	struct F*d19b0bbaa6 *62060e3e03; // 0x530(0x20)
	struct F*d19b0bbaa6 *a9e921288e; // 0x550(0x20)
	struct F*d19b0bbaa6 *6f0e016894; // 0x570(0x20)
	struct F*d19b0bbaa6 *98ff32c524; // 0x590(0x20)
	struct F*8c7bdcaa93 *5a53e832a0; // 0x5b0(0x20)
	struct F*8c7bdcaa93 *f19cafd5ee; // 0x5d0(0x20)
	struct F*8c7bdcaa93 *42e76f32a2; // 0x5f0(0x20)
	struct UAkAudioEvent* *5e171a9495; // 0x610(0x08)
	char pad_618[0x10]; // 0x618(0x10)

	void *cc626fc787(); // Function TslGame.*168f2b1f68.*cc626fc787 // Final|Native|Private // @ game+0x581bcf4
};

// Class TslGame.*7cbb8e2e03
// Size: 0x470 (Inherited: 0x410)
struct U*7cbb8e2e03 : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	struct F*7c50600f8f *160942d3d4; // 0x420(0x30)
	struct UClass* *d3b482d62c; // 0x450(0x08)
	struct UClass* *e97b3b3a80; // 0x458(0x08)
	struct U*5db1bcfd9e* CurrAnimWidget; // 0x460(0x08)
	struct U*9f06b5e018* *9f06b5e018; // 0x468(0x08)

	void Clear(); // Function TslGame.*7cbb8e2e03.Clear // Final|Native|Public|BlueprintCallable // @ game+0x5816670
	void IsEmpty(); // Function TslGame.*7cbb8e2e03.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b764
	void IsBusy(); // Function TslGame.*7cbb8e2e03.IsBusy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b72c
	int32 OnTeamWipeOut(int32 Param1); // Function TslGame.*7cbb8e2e03.OnTeamWipeOut // Final|Native|Protected // @ game+0x5825a8c
	void Peek(); // Function TslGame.*7cbb8e2e03.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x582831c
	void Dequeue(); // Function TslGame.*7cbb8e2e03.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x5818bf4
	void OnCurrAnimFinish(); // Function TslGame.*7cbb8e2e03.OnCurrAnimFinish // Final|Native|Public|BlueprintCallable // @ game+0x581ef5c
	void NumElems(); // Function TslGame.*7cbb8e2e03.NumElems // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581d400
	void OnPersonalKillingSpree(struct FString Param1); // Function TslGame.*7cbb8e2e03.OnPersonalKillingSpree // Final|Native|Protected // @ game+0x58230f0
	void ProcData(); // Function TslGame.*7cbb8e2e03.ProcData // Final|Native|Public|BlueprintCallable // @ game+0x58288a4
	enum class EOutGamePlatformProvider Enqueue(enum class EObserverHudAnimType AnimType, int32 EliminatedTeamNum, struct FString KillingSpreeClanName); // Function TslGame.*7cbb8e2e03.Enqueue // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x5819034
	int32 OnTeamKillingSpree(); // Function TslGame.*7cbb8e2e03.OnTeamKillingSpree // Final|Native|Protected // @ game+0x582590c
};

// Class TslGame.*7ece4b990f
// Size: 0x510 (Inherited: 0x420)
struct U*7ece4b990f : U*5db1bcfd9e {
	struct F*d19b0bbaa6 *0de40fed25; // 0x420(0x20)
	struct F*d19b0bbaa6 *2cada17fae; // 0x440(0x20)
	struct F*d19b0bbaa6 *76f796fa26; // 0x460(0x20)
	struct F*d19b0bbaa6 *c4a0d1b999; // 0x480(0x20)
	struct F*8c7bdcaa93 *2f37fd0f10; // 0x4a0(0x20)
	struct F*8c7bdcaa93 *7431362641; // 0x4c0(0x20)
	struct F*72b0194904 *ca9f88da54; // 0x4e0(0x20)
	struct UAkAudioEvent* *22f5cff052; // 0x500(0x08)
	char pad_508[0x8]; // 0x508(0x08)

	void *3483607f94(); // Function TslGame.*7ece4b990f.*3483607f94 // Final|Native|Protected // @ game+0x581bcf4
};

// Class TslGame.*08b8abcaab
// Size: 0x618 (Inherited: 0x420)
struct U*08b8abcaab : U*5db1bcfd9e {
	struct F*8c7bdcaa93 *27d80bf6b1; // 0x420(0x20)
	struct F*8c7bdcaa93 *f19cafd5ee; // 0x440(0x20)
	struct F*06751c9d06 *1c1864e8f2; // 0x460(0x28)
	struct F*d19b0bbaa6 *da56618d53; // 0x488(0x20)
	struct F*b1a0bce7e4 *5d8813ce8d; // 0x4a8(0x28)
	struct F*8c7bdcaa93 *657909b18d; // 0x4d0(0x20)
	struct F*b1a0bce7e4 *65a1d87dae; // 0x4f0(0x28)
	struct F*8c7bdcaa93 *bd593dd906; // 0x518(0x20)
	struct F*b1a0bce7e4 *61954671b9; // 0x538(0x28)
	struct UTexture2D* KillingSpreeTexture; // 0x560(0x08)
	struct UTexture2D* DominatingTexture; // 0x568(0x08)
	struct F*72b0194904 AssistAnimBinder; // 0x570(0x20)
	struct F*72b0194904 FirstKillAnimBinder; // 0x590(0x20)
	struct F*72b0194904 ThirdKillAnimBinder; // 0x5b0(0x20)
	struct F*72b0194904 FifthKillAnimBinder; // 0x5d0(0x20)
	struct F*72b0194904 OverKillAnimBinder; // 0x5f0(0x20)
	struct UAkAudioEvent* ObserverTotalKillSound; // 0x610(0x08)
};

// Class TslGame.*2f2fce6465
// Size: 0x458 (Inherited: 0x410)
struct U*2f2fce6465 : U*bc854bc287 {
	struct UClass* TeamInfoWidgetTemplate; // 0x410(0x08)
	struct TArray<struct U*69854b0ebd*> *480f92c7ee; // 0x418(0x10)
	float *f02de91cc6; // 0x428(0x04)
	float *60cc7db17b; // 0x42c(0x04)
	struct F*ab7fc46cfb *0f03caefb9; // 0x430(0x28)
};

// Class TslGame.*1c852543d1
// Size: 0x490 (Inherited: 0x410)
struct U*1c852543d1 : U*bc854bc287 {
	struct F*d19b0bbaa6 *580230c513; // 0x410(0x20)
	struct F*d19b0bbaa6 *939d05d60c; // 0x430(0x20)
	struct F*d19b0bbaa6 *e80ea5f626; // 0x450(0x20)
	struct F*72b0194904 *b4386e2fb7; // 0x470(0x20)
};

// Class TslGame.*bd77db9e1c
// Size: 0x4e8 (Inherited: 0x410)
struct U*bd77db9e1c : U*bc854bc287 {
	struct F*8c7bdcaa93 *4e9cd6cf0c; // 0x410(0x20)
	struct F*8c7bdcaa93 *50c992e359; // 0x430(0x20)
	struct F*8c7bdcaa93 *e59e605508; // 0x450(0x20)
	struct F*b1a0bce7e4 *d874ba854e; // 0x470(0x28)
	struct F*d19b0bbaa6 *98ff32c524; // 0x498(0x20)
	struct F*72b0194904 *5c334fe41e; // 0x4b8(0x20)
	enum class ELeagueMatchStatistic *57df471064; // 0x4d8(0x01)
	char pad_4D9[0x3]; // 0x4d9(0x03)
	float *e17fa4863c; // 0x4dc(0x04)
	char pad_4E0[0x8]; // 0x4e0(0x08)

	void *2420671417(); // Function TslGame.*bd77db9e1c.*2420671417 // Final|Native|Private // @ game+0x582564c
};

// Class TslGame.*4f3fafadb8
// Size: 0x458 (Inherited: 0x410)
struct U*4f3fafadb8 : U*bc854bc287 {
	struct FVector2D *84af4b37d4; // 0x410(0x08)
	struct FVector2D *34792f59bc; // 0x418(0x08)
	struct UWidgetSwitcher* SwitcherPlayerIcon; // 0x420(0x08)
	struct USizeBox* SizeboxPlayerIcon; // 0x428(0x08)
	struct UImage* ImagePlayerIcon; // 0x430(0x08)
	struct USizeBox* SizeboxPlayerNumber; // 0x438(0x08)
	struct UBorder* BorderPlayerNumber; // 0x440(0x08)
	struct UImage* ImagePattern; // 0x448(0x08)
	struct UTextBlock* TextNumber; // 0x450(0x08)

	void UpdatePlayerIcon(); // Function TslGame.*4f3fafadb8.UpdatePlayerIcon // Final|Native|Public|BlueprintCallable // @ game+0x583144c
};

// Class TslGame.*07924ee510
// Size: 0x9d8 (Inherited: 0x410)
struct U*07924ee510 : U*bc854bc287 {
	struct UTexture* UnArmedIcon; // 0x410(0x08)
	float UnArmedIconRatio; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct ATslCharacter* *7876996be9; // 0x420(0x08)
	int32 *45730fc46e; // 0x428(0x04)
	int32 *e09e42652b; // 0x42c(0x04)
	int32 *632e11c932; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct F*72b0194904 AmmoIncreasingAnimBinder; // 0x438(0x20)
	struct F*72b0194904 AmmoDecreasingAnimBinder; // 0x458(0x20)
	struct F*8c7bdcaa93 *2fb5bf703e; // 0x478(0x20)
	struct F*8c7bdcaa93 *00056ae152; // 0x498(0x20)
	struct F*7c50600f8f *84d6f66d3f; // 0x4b8(0x30)
	struct F*8c7bdcaa93 *c80ec366f4; // 0x4e8(0x20)
	struct F*7c50600f8f *0ea7fadf53; // 0x508(0x30)
	struct F*06751c9d06 PatternSwitcherBinder; // 0x538(0x28)
	struct F*b1a0bce7e4 *d1c384f7d6; // 0x560(0x28)
	struct F*f90b3e2b9a *d668c7f817; // 0x588(0x28)
	struct F*8c7bdcaa93 *6146bc534c; // 0x5b0(0x20)
	struct F*8c7bdcaa93 *c5859cb359; // 0x5d0(0x20)
	struct F*8c7bdcaa93 *0259dd8e1e; // 0x5f0(0x20)
	struct F*8c7bdcaa93 *e5171555e4; // 0x610(0x20)
	struct F*d19b0bbaa6 *820ad3f9db; // 0x630(0x20)
	struct F*d19b0bbaa6 *fea4827f40; // 0x650(0x20)
	struct F*d19b0bbaa6 *68a7844446; // 0x670(0x20)
	struct F*d19b0bbaa6 *e563c22682; // 0x690(0x20)
	struct F*d19b0bbaa6 *3053acf612; // 0x6b0(0x20)
	struct F*d19b0bbaa6 *a48746b21d; // 0x6d0(0x20)
	struct F*d19b0bbaa6 *2e1946ccd1; // 0x6f0(0x20)
	struct F*d19b0bbaa6 *7d38f9d5f9; // 0x710(0x20)
	struct F*d19b0bbaa6 *369d4bc88d; // 0x730(0x20)
	struct F*b1a0bce7e4 *feacbd177c; // 0x750(0x28)
	struct UTexture2D* DriverTexture; // 0x778(0x08)
	struct F*b1a0bce7e4 WeaponIconImageBinder; // 0x780(0x28)
	struct F*aad5c0ee0d WeaponIconImageSizeBoxBinder; // 0x7a8(0x28)
	struct F*b1a0bce7e4 SecondWeaponIconImageBinder; // 0x7d0(0x28)
	struct F*aad5c0ee0d SecondWeaponIconImageSizeBoxBinder; // 0x7f8(0x28)
	struct F*8c7bdcaa93 MainWeaponName_Binder; // 0x820(0x20)
	struct F*8c7bdcaa93 MainWeaponEmpty_Binder; // 0x840(0x20)
	struct F*8c7bdcaa93 SecondWeaponEmpty_Binder; // 0x860(0x20)
	struct FName WeaponIconTextureParmName; // 0x880(0x08)
	struct FName WeaponIconColorParmName; // 0x888(0x08)
	struct FLinearColor WeaponColor_Armed; // 0x890(0x10)
	struct FLinearColor WeaponColor_Normal; // 0x8a0(0x10)
	struct FLinearColor SecondWeaponColor_Normal; // 0x8b0(0x10)
	struct F*68d8762d80 WeaponColorSet_NoReload; // 0x8c0(0x10)
	struct F*68d8762d80 SecondWeaponColorSet_NoReload; // 0x8d0(0x10)
	struct TMap<struct FName, struct UTexture2D*> WeaponAttachableTextureMap; // 0x8e0(0x50)
	struct TMap<enum class ECastAnim, struct UTexture2D*> CastableItemTextureMap; // 0x930(0x50)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x980(0x10)
	struct U*24809ef0d2* UserPlatformImageWidget; // 0x990(0x08)
	struct FLinearColor *eb9a1a2f3b; // 0x998(0x10)
	struct FLinearColor *90ca368f32; // 0x9a8(0x10)
	struct UTexture2D* *ae20d5f6d7; // 0x9b8(0x08)
	struct UTexture2D* *0f74ef8fe6; // 0x9c0(0x08)
	struct UTexture2D* *7eecc841c1; // 0x9c8(0x08)
	char pad_9D0[0x8]; // 0x9d0(0x08)
};

// Class TslGame.TslObserverPlayerListTileInfoWidget
// Size: 0x650 (Inherited: 0x410)
struct UTslObserverPlayerListTileInfoWidget : U*bc854bc287 {
	char pad_410[0x40]; // 0x410(0x40)
	struct ATslCharacter* Character; // 0x450(0x08)
	struct ATslPlayerState* *6479a6c27b; // 0x458(0x08)
	struct FLinearColor HighlightedColor; // 0x460(0x10)
	struct FLinearColor ActivatedColor; // 0x470(0x10)
	struct FLinearColor DeactivatedColor; // 0x480(0x10)
	struct U*68fe248867* PlayerNameFlowText; // 0x490(0x08)
	struct F*8c7bdcaa93 TeamName; // 0x498(0x20)
	struct F*8c7bdcaa93 PlayerKillCount; // 0x4b8(0x20)
	struct F*d19b0bbaa6 LifeGaugeWidgetBinder; // 0x4d8(0x20)
	struct F*1e5151c8f2 BtnPlayer; // 0x4f8(0x20)
	struct F*1e5151c8f2 KickButton_Binder; // 0x518(0x20)
	struct F*1e5151c8f2 ReportButton_Binder; // 0x538(0x20)
	struct F*aad5c0ee0d TeamTagSizeBox_Binder; // 0x558(0x28)
	struct F*b1a0bce7e4 TeamTagBG_Binder; // 0x580(0x28)
	struct F*b1a0bce7e4 TeamTagColor_Binder; // 0x5a8(0x28)
	struct U*72eb9bf50c* *13fc9695f8; // 0x5d0(0x08)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x5d8(0x10)
	struct U*24809ef0d2* UserPlatformImageWidget; // 0x5e8(0x08)
	struct FString *35b570d52b; // 0x5f0(0x10)
	struct FString PlayerName; // 0x600(0x10)
	struct FString *852a5a5751; // 0x610(0x10)
	struct FText *7d25ad2c66; // 0x620(0x18)
	char pad_638[0x18]; // 0x638(0x18)

	void OnMouseClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnMouseClicked // Final|Native|Private // @ game+0x58220b8
	void OnReportButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnReportButtonClicked // Final|Native|Public // @ game+0x5824188
	void OnKickButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnKickButtonClicked // Final|Native|Private // @ game+0x5820bd8
	void KickPlayer(); // Function TslGame.TslObserverPlayerListTileInfoWidget.KickPlayer // Final|Native|Private // @ game+0x581baa8
};

// Class TslGame.TslObserverPlayerListTileWidget
// Size: 0x580 (Inherited: 0x410)
struct UTslObserverPlayerListTileWidget : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct F*82698b8317 InforPanel; // 0x418(0x20)
	struct F*1e5151c8f2 TeamRank; // 0x438(0x20)
	struct F*8c7bdcaa93 TeamRankText; // 0x458(0x20)
	struct F*06751c9d06 SwitcherTeamLogo; // 0x478(0x28)
	struct F*b1a0bce7e4 TeamImage; // 0x4a0(0x28)
	struct F*b1a0bce7e4 TeamColor; // 0x4c8(0x28)
	struct F*b1a0bce7e4 TeamListColor; // 0x4f0(0x28)
	struct F*8c7bdcaa93 TeamNum; // 0x518(0x20)
	struct F*8c7bdcaa93 TeamInfoKill; // 0x538(0x20)
	struct UTexture2D* *bd93071ad6; // 0x558(0x08)
	char pad_560[0x20]; // 0x560(0x20)

	void UpdateStripeTexture(); // Function TslGame.TslObserverPlayerListTileWidget.UpdateStripeTexture // Event|Protected|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*628776e784
// Size: 0x420 (Inherited: 0x410)
struct U*628776e784 : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)

	struct F*027a9afaf9 Find(); // Function TslGame.*628776e784.Find // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x581964c
	void Enqueue(int32 EliminatedTeamNum); // Function TslGame.*628776e784.Enqueue // Final|Native|Public|BlueprintCallable // @ game+0x5819370
	struct F*027a9afaf9 Peek(); // Function TslGame.*628776e784.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5828408
	void Dequeue(); // Function TslGame.*628776e784.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x5818c18
	void IsEmpty(); // Function TslGame.*628776e784.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b764
	void Clear(); // Function TslGame.*628776e784.Clear // Final|Native|Public|BlueprintCallable // @ game+0x581668c
};

// Class TslGame.*baa3c8b5c3
// Size: 0x438 (Inherited: 0x410)
struct U*baa3c8b5c3 : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	struct UCurveFloat* *b6b3967d96; // 0x420(0x08)
	struct UCurveFloat* *38f487ee68; // 0x428(0x08)
	float *6a93bd5a8f; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
};

// Class TslGame.*db1330835c
// Size: 0x4f8 (Inherited: 0x438)
struct U*db1330835c : U*baa3c8b5c3 {
	char pad_438[0x8]; // 0x438(0x08)
	struct TArray<struct U*5cb3fff2bf*> Icons; // 0x440(0x10)
	struct TMap<int32, struct UTexture2D*> *d7d0efe5e7; // 0x450(0x50)
	struct UHorizontalBox* IconHorizontalBox; // 0x4a0(0x08)
	struct TMap<int32, struct ATslOPBuff*> *129de10659; // 0x4a8(0x50)
};

// Class TslGame.*a12fe0552d
// Size: 0x470 (Inherited: 0x438)
struct U*a12fe0552d : U*baa3c8b5c3 {
	struct TArray<struct FLinearColor> *5955c49998; // 0x438(0x10)
	char pad_448[0x10]; // 0x448(0x10)
	struct UImage* Icon1; // 0x458(0x08)
	struct UImage* Icon2; // 0x460(0x08)
	struct UImage* Icon3; // 0x468(0x08)
};

// Class TslGame.*4b43bd880d
// Size: 0x4e8 (Inherited: 0x410)
struct U*4b43bd880d : U*bc854bc287 {
	struct F*da672abddc *f4516b957e; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct U*db1330835c* MyBuffWidget; // 0x420(0x08)
	struct UCanvasPanel* BuffHeadManagerCanvasPanel; // 0x428(0x08)
	struct UScaleBox* TPP_Box; // 0x430(0x08)
	struct UScaleBox* FPP_Box; // 0x438(0x08)
	struct UScaleBox* FPPWithMonsterHp_Box; // 0x440(0x08)
	struct UScaleBox* IconBox; // 0x448(0x08)
	struct UClass* *93616c40c6; // 0x450(0x08)
	struct UClass* *c1c34acbf6; // 0x458(0x08)
	struct TMap<struct ATslCharacter*, struct U*baa3c8b5c3*> *e0eeb94412; // 0x460(0x50)
	struct TArray<struct U*db1330835c*> *9beca666c1; // 0x4b0(0x10)
	struct TArray<struct U*a12fe0552d*> *0914a3d593; // 0x4c0(0x10)
	float *52168fbf12; // 0x4d0(0x04)
	float *0aa3f1b76f; // 0x4d4(0x04)
	char pad_4D8[0x10]; // 0x4d8(0x10)

	void *3fc7b499f9(); // Function TslGame.*4b43bd880d.*3fc7b499f9 // Final|Native|Protected // @ game+0x5831438
	void OnUpdateViewTarget(); // Function TslGame.*4b43bd880d.OnUpdateViewTarget // Final|Native|Protected // @ game+0x5826904
};

// Class TslGame.*10ac312658
// Size: 0x460 (Inherited: 0x410)
struct U*10ac312658 : U*bc854bc287 {
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x410(0x08)
	struct U*3757dd7a79* PointWidget; // 0x418(0x08)
	struct U*3757dd7a79* KillWidget; // 0x420(0x08)
	struct U*3757dd7a79* AliveWidget; // 0x428(0x08)
	struct U*8d0c61de5f* MonsterHpWidget; // 0x430(0x08)
	struct FName *d839726ba1; // 0x438(0x08)
	struct UClass* *a4b8ef5838; // 0x440(0x08)
	struct U*107a240f9c* *89bda6564f; // 0x448(0x08)
	char pad_450[0x10]; // 0x450(0x10)

	void *cf5d3548e5(); // Function TslGame.*10ac312658.*cf5d3548e5 // Final|Native|Protected // @ game+0x581d5c8
	void OnViewTargetUpdate(); // Function TslGame.*10ac312658.OnViewTargetUpdate // Final|Native|Protected // @ game+0x5827150
	void UpdateCoin(); // Function TslGame.*10ac312658.UpdateCoin // Final|Native|Protected // @ game+0x5830cc0
	void UpdateCoinStackCount(struct FName Param0); // Function TslGame.*10ac312658.UpdateCoinStackCount // Final|Native|Protected|HasOutParms // @ game+0x5830ce8
	void OnMatchStarted(); // Function TslGame.*10ac312658.OnMatchStarted // Final|Native|Protected // @ game+0x58215e4
	void OnKillCountChanged(); // Function TslGame.*10ac312658.OnKillCountChanged // Final|Native|Protected // @ game+0x5820bec
	float OnOPModeMonsterAttacked(float Param3); // Function TslGame.*10ac312658.OnOPModeMonsterAttacked // Final|Native|Protected // @ game+0x5822d88
};

// Class TslGame.*126bef1058
// Size: 0x410 (Inherited: 0x410)
struct U*126bef1058 : U*bc854bc287 {
};

// Class TslGame.*cf1ee77553
// Size: 0x420 (Inherited: 0x410)
struct U*cf1ee77553 : U*bc854bc287 {
	struct U*55b30f0f44* ParachuteGaugeWidget; // 0x410(0x08)
	struct U*70380b4061* ParachuteAirSpeedWidget; // 0x418(0x08)
};

// Class TslGame.*96636ee961
// Size: 0x428 (Inherited: 0x410)
struct U*96636ee961 : U*bc854bc287 {
	struct USizeBox* FollowGuideSizeBox; // 0x410(0x08)
	struct UWidgetSwitcher* FollowGuideSwitcher; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
};

// Class TslGame.*55b30f0f44
// Size: 0x460 (Inherited: 0x410)
struct U*55b30f0f44 : U*bc854bc287 {
	struct USizeBox* FreeFallBar; // 0x410(0x08)
	struct USizeBox* ParachuteFallBar; // 0x418(0x08)
	struct USizeBox* GroundHeightBar; // 0x420(0x08)
	struct UTextBlock* AltitudeText; // 0x428(0x08)
	struct U*54cc75d10f* PositionByPlayerAltitude; // 0x430(0x08)
	float *ae3f780cec; // 0x438(0x04)
	struct ATslCharacter* ViewTargetCharacter; // 0x43c(0x08)
	char pad_444[0x1c]; // 0x444(0x1c)

	void SetSkydiveState(); // Function TslGame.*55b30f0f44.SetSkydiveState // Final|Native|Public // @ game+0xace37c
	void UpdateViewTarget(); // Function TslGame.*55b30f0f44.UpdateViewTarget // Final|Native|Public // @ game+0xacf018
};

// Class TslGame.TslPlaneStanceWidget
// Size: 0x450 (Inherited: 0x410)
struct UTslPlaneStanceWidget : U*bc854bc287 {
	struct ATslCharacter* ViewTargetCharacter; // 0x410(0x08)
	struct UImage* PlaneImage; // 0x418(0x08)
	struct UGridPanel* SeatPanel; // 0x420(0x08)
	struct FName StateParamName; // 0x428(0x08)
	struct UTextBlock* RiderCountText; // 0x430(0x08)
	struct TArray<struct UImage*> *9508b98872; // 0x438(0x10)
	char pad_448[0x8]; // 0x448(0x08)

	void UpdateViewTarget(); // Function TslGame.TslPlaneStanceWidget.UpdateViewTarget // Final|Native|Public // @ game+0xcd2c34
};

// Class TslGame.TslPlatoonCarePackageDropIndicatorWidget
// Size: 0x418 (Inherited: 0x410)
struct UTslPlatoonCarePackageDropIndicatorWidget : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)

	void BP_UpdateIconImage(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconImage // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void BP_UpdateIconType(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconType // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*2dd451f232
// Size: 0x468 (Inherited: 0x410)
struct U*2dd451f232 : U*bc854bc287 {
	struct UButton* CommandButton; // 0x410(0x08)
	struct UTslPlatoonCommandWidget* *0ec7d7a35f; // 0x418(0x08)
	struct ATslGameState* *b594e2159c; // 0x420(0x08)
	struct U*672373cc62* MultipleKeyIconWidget; // 0x428(0x08)
	struct F*f90b3e2b9a *8552da1dc7; // 0x430(0x28)
	enum class *e35b7a0b41 *ba51083be6; // 0x458(0x01)
	char pad_459[0x3]; // 0x459(0x03)
	float *7b58746405; // 0x45c(0x04)
	float *a61f9b2591; // 0x460(0x04)
	bool *38fb506da6; // 0x464(0x01)
	bool *3353c1ec9d; // 0x465(0x01)
	bool *fb5d9be3c9; // 0x466(0x01)
	char pad_467[0x1]; // 0x467(0x01)

	void OnMatchStateChanged(); // Function TslGame.*2dd451f232.OnMatchStateChanged // Final|Native|Public // @ game+0x582182c
	void BP_UpdateHighlight(); // Function TslGame.*2dd451f232.BP_UpdateHighlight // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	float BP_UpdateProgress(); // Function TslGame.*2dd451f232.BP_UpdateProgress // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnUpdatePlatoonFireSupportState(); // Function TslGame.*2dd451f232.OnUpdatePlatoonFireSupportState // Final|Native|Public|HasOutParms // @ game+0x5826530
	enum class *e35b7a0b41 BP_UpdateCommandType(); // Function TslGame.*2dd451f232.BP_UpdateCommandType // Event|Public|HasOutParms|BlueprintEvent // @ game+0x2cd4ac
	void BP_UpdateEnablity(); // Function TslGame.*2dd451f232.BP_UpdateEnablity // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void OnButtonClicked(); // Function TslGame.*2dd451f232.OnButtonClicked // Final|Native|Public // @ game+0x581e0e4
	void OnUpdatePlatoonCarePackageState(); // Function TslGame.*2dd451f232.OnUpdatePlatoonCarePackageState // Final|Native|Public|HasOutParms // @ game+0x582647c
	void BP_UpdateClickability(); // Function TslGame.*2dd451f232.BP_UpdateClickability // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.TslPlatoonCommandWidget
// Size: 0x488 (Inherited: 0x410)
struct UTslPlatoonCommandWidget : U*bc854bc287 {
	struct UClass* *942b2e0d2b; // 0x410(0x08)
	struct U*2681934154* *c9fc034147; // 0x418(0x08)
	struct U*7762a61952* ButtonPanel; // 0x420(0x08)
	bool *8220003a4d; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct TMap<enum class *e35b7a0b41, struct U*2dd451f232*> *1404161111; // 0x430(0x50)
	struct U*2dd451f232* *e281809f0e; // 0x480(0x08)

	void UpdateButtonsByManifest(); // Function TslGame.TslPlatoonCommandWidget.UpdateButtonsByManifest // Final|Native|Public|HasOutParms // @ game+0x5830c0c
};

// Class TslGame.*ee8c4496c9
// Size: 0x418 (Inherited: 0x410)
struct U*ee8c4496c9 : U*bc854bc287 {
	struct UTextBlock* BindTextDescription; // 0x410(0x08)
};

// Class TslGame.*e67cdcb411
// Size: 0x500 (Inherited: 0x410)
struct U*e67cdcb411 : U*bc854bc287 {
	struct UBorder* BindBorderNumberBg; // 0x410(0x08)
	struct UTextBlock* BindTextNumber; // 0x418(0x08)
	struct U*91d390f031* BindWidgetPubgId; // 0x420(0x08)
	struct UWidget* BindWidgetDisable; // 0x428(0x08)
	struct UTextBlock* BindTextDisableText; // 0x430(0x08)
	struct UWidget* BindWidgetSelected; // 0x438(0x08)
	char pad_440[0xc0]; // 0x440(0xc0)
};

// Class TslGame.*3a689b741f
// Size: 0x500 (Inherited: 0x500)
struct U*3a689b741f : U*e67cdcb411 {
};

// Class TslGame.*5b49f9c253
// Size: 0x500 (Inherited: 0x500)
struct U*5b49f9c253 : U*e67cdcb411 {
};

// Class TslGame.*270d51e0c3
// Size: 0x460 (Inherited: 0x410)
struct U*270d51e0c3 : U*bc854bc287 {
	float *577765ed3c; // 0x410(0x04)
	char pad_414[0xc]; // 0x414(0x0c)
	struct F*72b0194904 FadeInAnimation_Binder; // 0x420(0x20)
	struct F*72b0194904 FadeOutAnimation_Binder; // 0x440(0x20)
};

// Class TslGame.*f95ba2b37e
// Size: 0x4c8 (Inherited: 0x410)
struct U*f95ba2b37e : U*bc854bc287 {
	struct F*72b0194904 CountDownAnim_Ready; // 0x410(0x20)
	struct F*72b0194904 CountDownAnim_4; // 0x430(0x20)
	struct F*72b0194904 CountDownAnim_3; // 0x450(0x20)
	struct F*72b0194904 CountDownAnim_2; // 0x470(0x20)
	struct F*72b0194904 CountDownAnim_Go; // 0x490(0x20)
	struct UAkAudioEvent* *a991bf4f04; // 0x4b0(0x08)
	struct UAkAudioEvent* *ca8596f271; // 0x4b8(0x08)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	void CountAnimPlay(); // Function TslGame.*f95ba2b37e.CountAnimPlay // Final|Native|Protected // @ game+0x5818738
};

// Class TslGame.*fc8311bf75
// Size: 0x458 (Inherited: 0x410)
struct U*fc8311bf75 : U*bc854bc287 {
	struct F*8c7bdcaa93 *2f610547d4; // 0x410(0x20)
	struct F*b1a0bce7e4 *9f09571005; // 0x430(0x28)
};

// Class TslGame.*66025a2b2e
// Size: 0x4c8 (Inherited: 0x458)
struct U*66025a2b2e : U*fc8311bf75 {
	struct F*d19b0bbaa6 UserPlatformImageWidget; // 0x458(0x20)
	struct F*8c7bdcaa93 *194ffe05ea; // 0x478(0x20)
	struct F*8c7bdcaa93 *caff011dc8; // 0x498(0x20)
	struct FString *cc19d74e4b; // 0x4b8(0x10)

	void SetUserRankingInformation(); // Function TslGame.*66025a2b2e.SetUserRankingInformation // Final|Native|Public|BlueprintCallable // @ game+0x582f518
};

// Class TslGame.*32fd834774
// Size: 0x4d0 (Inherited: 0x410)
struct U*32fd834774 : U*bc854bc287 {
	struct TArray<struct U*66025a2b2e*> *fdd1c492b6; // 0x410(0x10)
	struct UClass* *3d021dbdea; // 0x420(0x08)
	struct F*f90b3e2b9a *f45420fa4f; // 0x428(0x28)
	struct F*f90b3e2b9a *2fb821c667; // 0x450(0x28)
	struct F*8c7bdcaa93 *1ffd9b6913; // 0x478(0x20)
	struct F*8c7bdcaa93 *10f2f9aca0; // 0x498(0x20)
	int32 *62290c37fb; // 0x4b8(0x04)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct ATslRacingPlayerState* *7d64a6c767; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void UpdateRankingList(); // Function TslGame.*32fd834774.UpdateRankingList // Final|Native|Public|BlueprintCallable // @ game+0x5831690
	void OnUpdateViewTarget(); // Function TslGame.*32fd834774.OnUpdateViewTarget // Final|Native|Public // @ game+0x5826994
};

// Class TslGame.*030c6a0839
// Size: 0x4f0 (Inherited: 0x410)
struct U*030c6a0839 : U*bc854bc287 {
	struct F*8c7bdcaa93 *d18d7ba9e0; // 0x410(0x20)
	struct F*8c7bdcaa93 *d8ef2d89b0; // 0x430(0x20)
	struct F*8c7bdcaa93 *a46f692c73; // 0x450(0x20)
	char pad_470[0x8]; // 0x470(0x08)
	struct F*b1a0bce7e4 *21769f5757; // 0x478(0x28)
	int32 *d3676b9cb2; // 0x4a0(0x04)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct F*72b0194904 CheckPointReachAnim; // 0x4a8(0x20)
	struct F*be81a602d7 *c60b8129ce; // 0x4c8(0x28)
};

// Class TslGame.*922e2eb3d2
// Size: 0x558 (Inherited: 0x410)
struct U*922e2eb3d2 : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct FName *e494ff8a43; // 0x418(0x08)
	struct UMaterialInstance* *d7babf5032; // 0x420(0x08)
	float *abdfbab441; // 0x428(0x04)
	float *acb07bfa49; // 0x42c(0x04)
	struct F*7c50600f8f *bd51694d23; // 0x430(0x30)
	struct UHorizontalBox* HighlightBgHorizontalBox; // 0x460(0x08)
	struct UBorder* HighlightBGBorder; // 0x468(0x08)
	struct UImage* HighlightBgImage; // 0x470(0x08)
	struct UTslRichTextBlock* RichTextBlock; // 0x478(0x08)
	struct UImage* Img_MsgFromOutgameIcon; // 0x480(0x08)
	struct UImage* Img_FocusBg; // 0x488(0x08)
	struct UImage* Img_FocusLine; // 0x490(0x08)
	struct U*54cc75d10f* FadeInAnim; // 0x498(0x08)
	struct U*54cc75d10f* FadeOutAnim; // 0x4a0(0x08)
	struct U*54cc75d10f* HighlightAnim; // 0x4a8(0x08)
	struct U*54cc75d10f* Anim_MsgFromOutgameIconAppear; // 0x4b0(0x08)
	struct FLinearColor *7deb49ae54; // 0x4b8(0x10)
	struct FSlateFontInfo *ffe7a41f42; // 0x4c8(0x68)
	struct U*b7a715c048* *c31827a206; // 0x530(0x08)
	char pad_538[0x20]; // 0x538(0x20)

	void *8bec6ed4de(); // Function TslGame.*922e2eb3d2.*8bec6ed4de // Final|Native|Public // @ game+0x581f798
	void *954c8d4c5c(); // Function TslGame.*922e2eb3d2.*954c8d4c5c // Final|Native|Public // @ game+0x581f7ac
};

// Class TslGame.*1d3b90ef0e
// Size: 0x4e0 (Inherited: 0x410)
struct U*1d3b90ef0e : U*bc854bc287 {
	struct F*b1a0bce7e4 *7094f85a4d; // 0x410(0x28)
	struct F*aad5c0ee0d *0da0d2f0bf; // 0x438(0x28)
	struct F*aad5c0ee0d *b058d2f9e5; // 0x460(0x28)
	struct TMap<enum class ERankType, struct F*58aacf8025> *c513c6e745; // 0x488(0x50)
	char pad_4D8[0x8]; // 0x4d8(0x08)

	void SetRankEmblemFromRankType(enum class ERankType InRankType); // Function TslGame.*1d3b90ef0e.SetRankEmblemFromRankType // Final|Native|Public|BlueprintCallable // @ game+0x582ee28
};

// Class TslGame.*186d384b0c
// Size: 0x410 (Inherited: 0x410)
struct U*186d384b0c : U*bc854bc287 {

	void ExportRecoilData(); // Function TslGame.*186d384b0c.ExportRecoilData // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x5819594
};

// Class TslGame.TslRedeployDebugWidget
// Size: 0x4b0 (Inherited: 0x410)
struct UTslRedeployDebugWidget : U*bc854bc287 {
	struct UTextBlock* MatchState_ElapsedTimeText; // 0x410(0x08)
	struct UTextBlock* GameState_GatherPhaseText; // 0x418(0x08)
	struct UTextBlock* GameState_FightPhaseText; // 0x420(0x08)
	struct UTextBlock* GameState_MaxPhaseText; // 0x428(0x08)
	struct UTextBlock* GameState_EnableText; // 0x430(0x08)
	struct UTextBlock* GameState_FightingText; // 0x438(0x08)
	struct UTextBlock* GameState_GatherStartText; // 0x440(0x08)
	struct UTextBlock* GameState_GatherEndText; // 0x448(0x08)
	struct UTextBlock* GameState_ReviveText; // 0x450(0x08)
	struct UTextBlock* GameState_FightStartText; // 0x458(0x08)
	struct UTextBlock* GameState_FightEndText; // 0x460(0x08)
	struct UTextBlock* GameState_RedeployText; // 0x468(0x08)
	struct UTextBlock* PlayerState_TargetFightPhaseText; // 0x470(0x08)
	struct UTextBlock* PlayerState_TargetReviveText; // 0x478(0x08)
	struct UTextBlock* PlayerState_CurrentStateText; // 0x480(0x08)
	struct UTextBlock* PlayerState_PreviousStateText; // 0x488(0x08)
	struct UTextBlock* RedeployComp_HideLoadingScreenTimerText; // 0x490(0x08)
	struct UTextBlock* RedeployComp_RedeployAlarmTimerText; // 0x498(0x08)
	struct UTextBlock* RedeployComp_RedeployTimerText; // 0x4a0(0x08)
	enum class ETslRedeployPlayerState CurrentState; // 0x4a8(0x01)
	enum class ETslRedeployPlayerState *2733e96d8b; // 0x4a9(0x01)
	char pad_4AA[0x6]; // 0x4aa(0x06)
};

// Class TslGame.*07f6c6b7f9
// Size: 0x460 (Inherited: 0x410)
struct U*07f6c6b7f9 : U*bc854bc287 {
	struct TArray<struct U*a2ee09195b*> *55f9023872; // 0x410(0x10)
	float *0bad11914c; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct UImage* ArrowImage; // 0x428(0x08)
	struct UImage* RunningManImage; // 0x430(0x08)
	struct UImage* BarImage; // 0x438(0x08)
	struct UHorizontalBox* DotsHorizontalBox; // 0x440(0x08)
	struct UTextBlock* DescriptionText; // 0x448(0x08)
	struct UMaterialInstanceDynamic* *5758b6cc1a; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
};

// Class TslGame.*4de5c619f1
// Size: 0x4a8 (Inherited: 0x410)
struct U*4de5c619f1 : U*bc854bc287 {
	struct F*0751dc5caf *8fe5759a9a; // 0x410(0x40)
	struct F*0751dc5caf *4ea69694ff; // 0x450(0x40)
	struct UVerticalBox* VerticalBox; // 0x490(0x08)
	struct U*5839d640b8* *b1815b5f65; // 0x498(0x08)
	struct U*07f6c6b7f9* *ac476e5fc2; // 0x4a0(0x08)
};

// Class TslGame.*5839d640b8
// Size: 0x430 (Inherited: 0x410)
struct U*5839d640b8 : U*bc854bc287 {
	struct UHorizontalBox* TimerHorBox; // 0x410(0x08)
	struct UImage* Icon; // 0x418(0x08)
	struct UTextBlock* TimeText; // 0x420(0x08)
	struct ATslGameState* GameState; // 0x428(0x08)
};

// Class TslGame.TslReloadingGuideWidget
// Size: 0x508 (Inherited: 0x410)
struct UTslReloadingGuideWidget : U*bc854bc287 {
	struct F*da672abddc *5bda590806; // 0x410(0x08)
	struct F*7c50600f8f *15f266fd1e; // 0x418(0x30)
	struct U*672373cc62* MultipleKeyIconWidget; // 0x448(0x08)
	struct F*72b0194904 *a06e149ebd; // 0x450(0x20)
	struct FName *a58b8e6ed6; // 0x470(0x08)
	struct FText *7f1762143e; // 0x478(0x18)
	struct FText *393f3218f7; // 0x490(0x18)
	struct FText *f91fa07f5d; // 0x4a8(0x18)
	char pad_4C0[0x48]; // 0x4c0(0x48)

	void OnCharacterDeath(); // Function TslGame.TslReloadingGuideWidget.OnCharacterDeath // Final|Native|Private // @ game+0x581e9a0
	void *ab91dc8f10(); // Function TslGame.TslReloadingGuideWidget.*ab91dc8f10 // Final|Native|Public|Const // @ game+0x58165e8
	void OnReloadPadInput(); // Function TslGame.TslReloadingGuideWidget.OnReloadPadInput // Final|Native|Private // @ game+0xc12e3c
	void OnNotifyGroggy(); // Function TslGame.TslReloadingGuideWidget.OnNotifyGroggy // Final|Native|Private // @ game+0x5822b0c
	void UpdatePropertiesFromKeyBinding(); // Function TslGame.TslReloadingGuideWidget.UpdatePropertiesFromKeyBinding // Final|Native|Private // @ game+0x5831554
	void OnInteractionWidgetEnabled(); // Function TslGame.TslReloadingGuideWidget.OnInteractionWidgetEnabled // Final|Native|Private // @ game+0x63d06c
	void OnCharacterVault(); // Function TslGame.TslReloadingGuideWidget.OnCharacterVault // Final|Native|Private // @ game+0xcfe244
};

// Class TslGame.*eb04138d6b
// Size: 0x420 (Inherited: 0x410)
struct U*eb04138d6b : U*bc854bc287 {
	struct U*91d390f031* PubgIdWidget; // 0x410(0x08)
	struct U*54cc75d10f* FadeInAnim; // 0x418(0x08)

	void RefreshPubgIdBySpectator(); // Function TslGame.*eb04138d6b.RefreshPubgIdBySpectator // Final|Native|Protected // @ game+0x5828b8c
};

// Class TslGame.TslRichTextBlock
// Size: 0x648 (Inherited: 0x410)
struct UTslRichTextBlock : U*bc854bc287 {
	struct FText *d0609c988e; // 0x410(0x18)
	struct TMap<struct FString, struct F*8ade9120ce> *c40de45753; // 0x428(0x50)
	struct FSlateFontInfo FontInfo; // 0x478(0x68)
	struct FSlateColor *0098e5ff74; // 0x4e0(0x28)
	struct FVector2D *492b13decd; // 0x508(0x08)
	struct FLinearColor *f7f56afd5b; // 0x510(0x10)
	float *ade86d9e25; // 0x520(0x04)
	bool *bb1013ae78; // 0x524(0x01)
	char pad_525[0x3]; // 0x525(0x03)
	float *b67ec90d17; // 0x528(0x04)
	enum class *091373b171 *a1b47e3bd2; // 0x52c(0x01)
	bool *80bc88eecf; // 0x52d(0x01)
	char pad_52E[0x1]; // 0x52e(0x01)
	enum class EVerticalAlignment *aa349aee30; // 0x52f(0x01)
	struct FSlateChildSize *644a53a458; // 0x530(0x08)
	float *48451eb51f; // 0x538(0x04)
	struct FSlateChildSize *d15ede14e7; // 0x53c(0x08)
	struct FVector2D *2a9ea2b087; // 0x544(0x08)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct UVerticalBox* MainVerticalBox; // 0x550(0x08)
	struct TArray<struct USpacer*> *886e54838d; // 0x558(0x10)
	struct TArray<struct UHorizontalBox*> *571a13312b; // 0x568(0x10)
	struct TArray<struct UTextBlock*> *31cdddcacb; // 0x578(0x10)
	struct TArray<struct UImage*> *012461d84b; // 0x588(0x10)
	struct TArray<struct USizeBox*> *0c9b97e205; // 0x598(0x10)
	struct TArray<struct UOverlay*> *5e2ba128c4; // 0x5a8(0x10)
	struct UHorizontalBox* *88c6eeef8d; // 0x5b8(0x08)
	char pad_5C0[0x10]; // 0x5c0(0x10)
	struct UClass* KeyIconWidgetClass; // 0x5d0(0x08)
	char pad_5D8[0x18]; // 0x5d8(0x18)
	struct TMap<struct FName, struct F*d819e297c7> *76581067a8; // 0x5f0(0x50)
	char pad_640[0x8]; // 0x640(0x08)

	void UpdateText(); // Function TslGame.TslRichTextBlock.UpdateText // Final|Native|Public|BlueprintCallable // @ game+0x58319e8
};

// Class TslGame.*6112a61496
// Size: 0x428 (Inherited: 0x410)
struct U*6112a61496 : U*bc854bc287 {
	struct UWidgetSwitcher* SlotWidgetSwitcher; // 0x410(0x08)
	struct U*54cc75d10f* Anim_Start; // 0x418(0x08)
	enum class ERoundEndPointType *25bedd826d; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
};

// Class TslGame.*c480ec8b96
// Size: 0x4b0 (Inherited: 0x410)
struct U*c480ec8b96 : U*bc854bc287 {
	struct UClass* RoundEndPointClass; // 0x410(0x08)
	float PointWidgetAnimDelayTime; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct FString *f3ffc37982; // 0x420(0x10)
	struct FString *19978b8d2b; // 0x430(0x10)
	struct FString *0697325450; // 0x440(0x10)
	struct FString *b97af9350e; // 0x450(0x10)
	struct FString *94904383d9; // 0x460(0x10)
	struct FString *ab439cb0f9; // 0x470(0x10)
	struct FString *f8ac8ad6f1; // 0x480(0x10)
	struct UStringTable* ST_RoundSystem; // 0x490(0x08)
	char pad_498[0x18]; // 0x498(0x18)

	void *c5f1af6dc2(); // Function TslGame.*c480ec8b96.*c5f1af6dc2 // Final|Native|Protected // @ game+0x58285a4
	void *6362ad33be(struct FString Param0, struct UObject* Param2); // Function TslGame.*c480ec8b96.*6362ad33be // Native|Protected // @ game+0x58276ec
};

// Class TslGame.*eab5a353c5
// Size: 0x4e8 (Inherited: 0x4b0)
struct U*eab5a353c5 : U*c480ec8b96 {
	struct UTextBlock* MatchEndText; // 0x4b0(0x08)
	struct UTextBlock* MatchResultText; // 0x4b8(0x08)
	struct UTextBlock* ObserverTeamName; // 0x4c0(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4c8(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4d0(0x08)
	struct U*54cc75d10f* Victory_Anim; // 0x4d8(0x08)
	struct U*54cc75d10f* Defeat_Anim; // 0x4e0(0x08)
};

// Class TslGame.*3b5ffd25cb
// Size: 0x5b0 (Inherited: 0x4b0)
struct U*3b5ffd25cb : U*c480ec8b96 {
	struct UTextBlock* CurrentRoundText; // 0x4b0(0x08)
	struct UTextBlock* CurrentRoundResultText; // 0x4b8(0x08)
	struct UTextBlock* CurrentRoundScoreText; // 0x4c0(0x08)
	struct UTextBlock* YourTeamText; // 0x4c8(0x08)
	struct UTextBlock* EnemyTeamText; // 0x4d0(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4d8(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4e0(0x08)
	struct U*24809ef0d2* YourTeamPlatformIcon; // 0x4e8(0x08)
	struct U*24809ef0d2* EnemyTeamPlatformIcon; // 0x4f0(0x08)
	struct UHorizontalBox* RoundPointHorizontalBox; // 0x4f8(0x08)
	struct TArray<struct U*6112a61496*> *386d543d41; // 0x500(0x10)
	struct U*54cc75d10f* WinEffectAnim; // 0x510(0x08)
	struct U*54cc75d10f* LossEffectAnim; // 0x518(0x08)
	struct U*54cc75d10f* DrawEffectAnim; // 0x520(0x08)
	struct F*82698b8317 NormalRoundPanel; // 0x528(0x20)
	struct F*82698b8317 ZombieDefensePanel; // 0x548(0x20)
	struct F*8c7bdcaa93 RoundText; // 0x568(0x20)
	struct UStringTable* ZombieDefenseTable; // 0x588(0x08)
	struct UAkAudioEvent* *70c0ab6f6c; // 0x590(0x08)
	struct UAkAudioEvent* *3c087ff0b2; // 0x598(0x08)
	struct U*f85b6bbd54* PlayerWinningStreak; // 0x5a0(0x08)
	struct U*f85b6bbd54* EnemyWinningStreak; // 0x5a8(0x08)
};

// Class TslGame.*6990383ca2
// Size: 0x470 (Inherited: 0x410)
struct U*6990383ca2 : U*bc854bc287 {
	struct UTextBlock* RoundNumberText; // 0x410(0x08)
	struct U*54cc75d10f* RoundStart_Anim; // 0x418(0x08)
	struct UTextBlock* RoundText; // 0x420(0x08)
	struct UStringTable* ZombieDefenseTable; // 0x428(0x08)
	char pad_430[0x40]; // 0x430(0x40)

	void *6362ad33be(enum class EWidgetShowType Param1, struct ATslBaseHUD* Param3); // Function TslGame.*6990383ca2.*6362ad33be // Final|Native|Protected // @ game+0x58278f4
};

// Class TslGame.*b51b6c1fa5
// Size: 0x450 (Inherited: 0x410)
struct U*b51b6c1fa5 : U*bc854bc287 {
	struct UHorizontalBox* YourTeamPointBox; // 0x410(0x08)
	struct UHorizontalBox* EnemyTeamPointBox; // 0x418(0x08)
	struct UClass* RoundEndPointClass; // 0x420(0x08)
	struct TArray<struct U*6112a61496*> *e1efcc55e5; // 0x428(0x10)
	struct TArray<struct U*6112a61496*> *fe86cd334e; // 0x438(0x10)
	char pad_448[0x8]; // 0x448(0x08)

	void UpdatePointList(); // Function TslGame.*b51b6c1fa5.UpdatePointList // Final|Native|Protected // @ game+0x58314f0
	void OnMatchStateChanged(); // Function TslGame.*b51b6c1fa5.OnMatchStateChanged // Final|Native|Protected // @ game+0xdd3a0c
	struct ATslBaseHUD* *6362ad33be(enum class EWidgetShowType Param1); // Function TslGame.*b51b6c1fa5.*6362ad33be // Final|Native|Protected // @ game+0x5827af8
};

// Class TslGame.*737524c0ff
// Size: 0x418 (Inherited: 0x410)
struct U*737524c0ff : U*bc854bc287 {
	struct UWidgetSwitcher* KeyGuideSwitcher; // 0x410(0x08)
};

// Class TslGame.*92db317154
// Size: 0x460 (Inherited: 0x410)
struct U*92db317154 : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	struct UTextBlock* TitleTextBlock; // 0x420(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x428(0x08)
	struct UClass* *eb2d1330b7; // 0x430(0x08)
	enum class ESandboxGroypType *02301bb883; // 0x438(0x01)
	char pad_439[0x27]; // 0x439(0x27)
};

// Class TslGame.*07d639c818
// Size: 0x468 (Inherited: 0x460)
struct U*07d639c818 : U*92db317154 {
	bool *64e0e6192e; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
};

// Class TslGame.*ad3732b376
// Size: 0x468 (Inherited: 0x460)
struct U*ad3732b376 : U*92db317154 {
	struct UVerticalBox* RootVerticalBox; // 0x460(0x08)
};

// Class TslGame.*63e7286a60
// Size: 0x468 (Inherited: 0x410)
struct U*63e7286a60 : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	bool *92160dd2f1; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UTextBlock* ItemTextBlock; // 0x420(0x08)
	struct U*68fe248867* ItemTextBlock_Flow; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
	struct FLinearColor *c961ee32bc; // 0x438(0x10)
	struct FLinearColor *abe03095f0; // 0x448(0x10)
	char pad_458[0x10]; // 0x458(0x10)
};

// Class TslGame.*676b856ee9
// Size: 0x488 (Inherited: 0x468)
struct U*676b856ee9 : U*63e7286a60 {
	char pad_468[0x8]; // 0x468(0x08)
	struct UButton* ItemButton; // 0x470(0x08)
	struct UImage* Img_SelectOutLine; // 0x478(0x08)
	struct UImage* Img_SelectGradientBg; // 0x480(0x08)

	void OnUnhover_Button(); // Function TslGame.*676b856ee9.OnUnhover_Button // Final|Native|Private // @ game+0x581d220
	void OnHover_Button(); // Function TslGame.*676b856ee9.OnHover_Button // Final|Native|Private // @ game+0x5820a1c
	void OnClick_Button(); // Function TslGame.*676b856ee9.OnClick_Button // Final|Native|Private // @ game+0x581ea44
};

// Class TslGame.*ddd94ab234
// Size: 0x498 (Inherited: 0x488)
struct U*ddd94ab234 : U*676b856ee9 {
	enum class ESandboxSpecialButtonType *505b924fe4; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)
	struct UImage* ItemIcon_Image; // 0x490(0x08)
};

// Class TslGame.*c3b1116e27
// Size: 0x4d0 (Inherited: 0x488)
struct U*c3b1116e27 : U*676b856ee9 {
	struct UClass* *eb2d1330b7; // 0x488(0x08)
	struct UBorder* ItemBorder; // 0x490(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x498(0x08)
	struct UWidgetSwitcher* ExpandSwitcher; // 0x4a0(0x08)
	char pad_4A8[0x28]; // 0x4a8(0x28)
};

// Class TslGame.*ff35d981c4
// Size: 0x498 (Inherited: 0x488)
struct U*ff35d981c4 : U*676b856ee9 {
	struct UWidgetSwitcher* ItemWidgetSwitcher; // 0x488(0x08)
	enum class ESandboxPowerType *9b18a946dc; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)

	void *8bd7a999fe(); // Function TslGame.*ff35d981c4.*8bd7a999fe // Final|Native|Private // @ game+0x582033c
};

// Class TslGame.*4faa5f19c3
// Size: 0x4b0 (Inherited: 0x468)
struct U*4faa5f19c3 : U*63e7286a60 {
	char pad_468[0x8]; // 0x468(0x08)
	struct UImage* Img_SelectOutLine; // 0x470(0x08)
	struct UImage* Img_SelectGradientBg; // 0x478(0x08)
	struct FName ItemID; // 0x480(0x08)
	struct FText *666ac1d70c; // 0x488(0x18)
	char pad_4A0[0x8]; // 0x4a0(0x08)
	float *44c42b34bc; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)
};

// Class TslGame.*d036f66fcf
// Size: 0x4e0 (Inherited: 0x4b0)
struct U*d036f66fcf : U*4faa5f19c3 {
	struct UButton* ItemButton; // 0x4b0(0x08)
	struct UClass* *219a608bba; // 0x4b8(0x08)
	struct UItem* *fc516e3bec; // 0x4c0(0x08)
	struct U*5a2296a37c* *8a60a08a42; // 0x4c8(0x08)
	char pad_4D0[0x10]; // 0x4d0(0x10)

	void OnClicked_ItemButton(); // Function TslGame.*d036f66fcf.OnClicked_ItemButton // Final|Native|Public // @ game+0x581eb1c
};

// Class TslGame.*e4704e2b24
// Size: 0x4d0 (Inherited: 0x4b0)
struct U*e4704e2b24 : U*4faa5f19c3 {
	struct UBorder* ItemBorder; // 0x4b0(0x08)
	struct U*2b7599fac1* *f963f356b8; // 0x4b8(0x08)
	char pad_4C0[0x10]; // 0x4c0(0x10)
};

// Class TslGame.*96ed8f4ce6
// Size: 0x4f0 (Inherited: 0x4d0)
struct U*96ed8f4ce6 : U*e4704e2b24 {
	char pad_4D0[0x8]; // 0x4d0(0x08)
	struct U*0a27b33ade* SliderWidget; // 0x4d8(0x08)
	char pad_4E0[0x10]; // 0x4e0(0x10)
};

// Class TslGame.*5b474073af
// Size: 0x560 (Inherited: 0x4d0)
struct U*5b474073af : U*e4704e2b24 {
	char pad_4D0[0x80]; // 0x4d0(0x80)
	struct U*30837c8dcb* StepperWidget; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)
};

// Class TslGame.*fb4f63d67a
// Size: 0x490 (Inherited: 0x468)
struct U*fb4f63d67a : U*63e7286a60 {
	struct UTextBlock* CurNumberTextBlock; // 0x468(0x08)
	struct UTextBlock* MaxNumberTextBlock; // 0x470(0x08)
	struct UImage* SliderImage; // 0x478(0x08)
	enum class ESandboxQuantityType *d1993dc8e9; // 0x480(0x04)
	char pad_484[0xc]; // 0x484(0x0c)

	void *26ef6f084c(); // Function TslGame.*fb4f63d67a.*26ef6f084c // Final|Native|Private // @ game+0x582492c
};

// Class TslGame.*82ce396e2e
// Size: 0x410 (Inherited: 0x410)
struct U*82ce396e2e : U*bc854bc287 {
};

// Class TslGame.*199f05be99
// Size: 0x460 (Inherited: 0x410)
struct U*199f05be99 : U*bc854bc287 {
	struct TArray<struct UScreenIndicatorBaseWidget*> *ddd44f1fd4; // 0x410(0x10)
	struct UClass* *2c303aaf67; // 0x420(0x08)
	struct F*c1cf1c46a8 *841ebc85f6; // 0x428(0x28)
	char pad_450[0x10]; // 0x450(0x10)
};

// Class TslGame.*3cc6ea006a
// Size: 0x4c0 (Inherited: 0x460)
struct U*3cc6ea006a : U*199f05be99 {
	struct TMap<struct FString, struct UCaptureObjectIndicatorWidget*> *44ccc361b2; // 0x460(0x50)
	struct TArray<struct ACaptureAreaActor*> *226240008c; // 0x4b0(0x10)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.*3cc6ea006a.OnActivatedCaptureAreaUpdated // Final|Native|Protected|HasOutParms // @ game+0x581d418
};

// Class TslGame.*f68f4f4615
// Size: 0x470 (Inherited: 0x460)
struct U*f68f4f4615 : U*199f05be99 {
	struct TArray<struct U*ec65e21971*> *91b0af5217; // 0x460(0x10)

	void SetSmokeIndicatorWidget(); // Function TslGame.*f68f4f4615.SetSmokeIndicatorWidget // Final|Native|Protected // @ game+0x582f1ac
};

// Class TslGame.*078c45e7d2
// Size: 0x468 (Inherited: 0x460)
struct U*078c45e7d2 : U*199f05be99 {
	struct U*8b847da675* *dddb3cdbac; // 0x460(0x08)
};

// Class TslGame.*98a9efbf56
// Size: 0x480 (Inherited: 0x460)
struct U*98a9efbf56 : U*199f05be99 {
	struct TArray<struct U*ab060bcfd5*> *24d4d61338; // 0x460(0x10)
	struct TArray<struct ATslCharacter*> *b7cf2dfb76; // 0x470(0x10)

	void AddDetectionHumans(); // Function TslGame.*98a9efbf56.AddDetectionHumans // Final|Native|Protected|HasOutParms // @ game+0x5815ed8
};

// Class TslGame.*54defa6afd
// Size: 0x478 (Inherited: 0x460)
struct U*54defa6afd : U*199f05be99 {
	char pad_460[0x18]; // 0x460(0x18)
};

// Class TslGame.*fa8e54abdc
// Size: 0x468 (Inherited: 0x460)
struct U*fa8e54abdc : U*199f05be99 {
	struct U*f40e4814fe* *6b3b729503; // 0x460(0x08)
};

// Class TslGame.*230ce3de3b
// Size: 0x470 (Inherited: 0x460)
struct U*230ce3de3b : U*199f05be99 {
	struct TArray<struct U*bbf511fe29*> *2f8ee17a3e; // 0x460(0x10)

	void *02f7a0c8b1(); // Function TslGame.*230ce3de3b.*02f7a0c8b1 // Final|Native|Protected // @ game+0x58187c8
	void *d9e0308c94(); // Function TslGame.*230ce3de3b.*d9e0308c94 // Final|Native|Protected // @ game+0x5815fa0
};

// Class TslGame.*c87db2e526
// Size: 0x488 (Inherited: 0x460)
struct U*c87db2e526 : U*199f05be99 {
	struct UClass* *2486c9b238; // 0x460(0x08)
	struct TArray<struct UTeamMarkWidget*> *f3369f2c21; // 0x468(0x10)
	struct U*d091a67b25* *d091a67b25; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)
};

// Class TslGame.*6235bba0e3
// Size: 0x450 (Inherited: 0x410)
struct U*6235bba0e3 : U*bc854bc287 {
	struct UButton* ApplyButton; // 0x410(0x08)
	struct UWidgetSwitcher* MouseHoverSwitcher; // 0x418(0x08)
	struct UImage* ConsoleFocusImage; // 0x420(0x08)
	struct UImage* IconImage; // 0x428(0x08)
	struct UTextBlock* NameText; // 0x430(0x08)
	int32 *8a7255ee10; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct U*a1db46a070* *04e7df1099; // 0x440(0x08)
	bool *db20968d80; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
};

// Class TslGame.*f9ee435b4b
// Size: 0x468 (Inherited: 0x450)
struct U*f9ee435b4b : U*6235bba0e3 {
	struct U*54cc75d10f* PressedPcAni; // 0x450(0x08)
	struct U*54cc75d10f* PressedConsoleAni; // 0x458(0x08)
	struct FName *32ba4b535a; // 0x460(0x08)
};

// Class TslGame.*c7f6f9cc4d
// Size: 0x430 (Inherited: 0x410)
struct U*c7f6f9cc4d : U*bc854bc287 {
	enum class ETslSLBStageDifficulty Difficulty; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct UImage* ImageS1; // 0x418(0x08)
	struct UImage* ImageS2; // 0x420(0x08)
	struct UImage* ImageS3; // 0x428(0x08)
};

// Class TslGame.*b9d075373d
// Size: 0x468 (Inherited: 0x410)
struct U*b9d075373d : U*bc854bc287 {
	struct TMap<enum class ETslSLBStage, struct FText> *db3f68c271; // 0x410(0x50)
	struct UTextBlock* TextStage; // 0x460(0x08)
};

// Class TslGame.*139d6841c6
// Size: 0x480 (Inherited: 0x410)
struct U*139d6841c6 : U*bc854bc287 {
	struct UTexture2D* *3f999e87b9; // 0x410(0x08)
	struct UTexture2D* *7bacc5ceba; // 0x418(0x08)
	struct UTexture2D* *b86e385efa; // 0x420(0x08)
	struct UTexture2D* *c9a468726a; // 0x428(0x08)
	struct FName *028b3537c1; // 0x430(0x08)
	float *c7d8c05b71; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct UImage* ImageIcon; // 0x440(0x08)
	struct UImage* ImageGauge; // 0x448(0x08)
	struct U*7762a61952* SwitcherKeyGuideIcon; // 0x450(0x08)
	struct UMaterialInstanceDynamic* *035a11e80a; // 0x458(0x08)
	char pad_460[0x20]; // 0x460(0x20)

	struct ATslBaseHUD* *6362ad33be(); // Function TslGame.*139d6841c6.*6362ad33be // Final|Native|Protected // @ game+0x5827f00
	void OnCancelInteractionCast(); // Function TslGame.*139d6841c6.OnCancelInteractionCast // Final|Native|Protected // @ game+0x581e610
	void OnFinishInteractionCastOnClient(); // Function TslGame.*139d6841c6.OnFinishInteractionCastOnClient // Final|Native|Protected // @ game+0x581fd38
};

// Class TslGame.*29719d8b2a
// Size: 0x460 (Inherited: 0x410)
struct U*29719d8b2a : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	struct FText Label; // 0x420(0x18)
	enum class ETslSLBStageDifficulty ID; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct UTextBlock* TextName; // 0x440(0x08)
	struct U*5a9e6ea43b* Button; // 0x448(0x08)
	struct U*bf625e9bc6* VoteStatus; // 0x450(0x08)
	struct U*c7f6f9cc4d* IconDifficulty; // 0x458(0x08)

	void HandleOnClick(); // Function TslGame.*29719d8b2a.HandleOnClick // Final|Native|Protected // @ game+0x581a84c
};

// Class TslGame.*ed3a2289bf
// Size: 0x498 (Inherited: 0x410)
struct U*ed3a2289bf : U*bc854bc287 {
	char pad_410[0x20]; // 0x410(0x20)
	struct TArray<struct U*29719d8b2a*> *f3143fe5a6; // 0x430(0x10)
	struct TMap<enum class ETslSLBStageDifficulty, struct U*29719d8b2a*> *0c3a255ff0; // 0x440(0x50)
	struct UHorizontalBox* PanelList; // 0x490(0x08)

	void HandleOnClick(); // Function TslGame.*ed3a2289bf.HandleOnClick // Final|Native|Protected|HasOutParms // @ game+0x581a880
};

// Class TslGame.*e8aeb86cde
// Size: 0x450 (Inherited: 0x410)
struct U*e8aeb86cde : U*bc854bc287 {
	enum class ETslSLBStageDifficulty ID; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct FText Name; // 0x418(0x18)
	bool *21e3fd4b01; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct UTextBlock* TextName; // 0x438(0x08)
	struct U*c7f6f9cc4d* IconDifficulty; // 0x440(0x08)
	struct UImage* ImageSeparator; // 0x448(0x08)
};

// Class TslGame.*40ca9fba3c
// Size: 0x4f0 (Inherited: 0x410)
struct U*40ca9fba3c : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	enum class ETslSLBStage ID; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct FText *8ebda4c01c; // 0x428(0x18)
	struct UTexture2D* *b6f6e9fd83; // 0x440(0x08)
	struct TMap<enum class ETslSLBStageDifficulty, struct UTexture2D*> *d6e9f28044; // 0x448(0x50)
	struct TArray<struct U*6adda77c3a*> *a05e0c4183; // 0x498(0x10)
	struct U*c7f6f9cc4d* IconDifficulty; // 0x4a8(0x08)
	struct UImage* ImageStage; // 0x4b0(0x08)
	struct UImage* ImageConsol; // 0x4b8(0x08)
	struct UTextBlock* TextName; // 0x4c0(0x08)
	struct U*5a9e6ea43b* Button; // 0x4c8(0x08)
	struct U*bf625e9bc6* VoteStatus; // 0x4d0(0x08)
	struct UBorder* PanelHistoryBorder; // 0x4d8(0x08)
	struct UHorizontalBox* PanelHistory; // 0x4e0(0x08)
	struct USizeBox* PanelMyHistory; // 0x4e8(0x08)

	void HandleOnClick(); // Function TslGame.*40ca9fba3c.HandleOnClick // Final|Native|Protected // @ game+0x581a930
};

// Class TslGame.*6adda77c3a
// Size: 0x428 (Inherited: 0x410)
struct U*6adda77c3a : U*bc854bc287 {
	struct UBorder* PlayerColorBorder; // 0x410(0x08)
	struct U*c7f6f9cc4d* IconDifficulty; // 0x418(0x08)
	struct UTextBlock* NumberTextBlock; // 0x420(0x08)
};

// Class TslGame.*c1327e28e7
// Size: 0x4a0 (Inherited: 0x410)
struct U*c1327e28e7 : U*bc854bc287 {
	char pad_410[0x28]; // 0x410(0x28)
	struct TArray<struct U*40ca9fba3c*> *f3143fe5a6; // 0x438(0x10)
	struct TMap<enum class ETslSLBStage, struct U*40ca9fba3c*> *0c3a255ff0; // 0x448(0x50)
	struct UWrapBox* PanelList; // 0x498(0x08)

	void HandleOnClick(); // Function TslGame.*c1327e28e7.HandleOnClick // Final|Native|Protected|HasOutParms // @ game+0x581a880
};

// Class TslGame.*bf625e9bc6
// Size: 0x440 (Inherited: 0x410)
struct U*bf625e9bc6 : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	struct UImage* ImageMine; // 0x420(0x08)
	struct UImage* ImageP1; // 0x428(0x08)
	struct UImage* ImageP2; // 0x430(0x08)
	struct UImage* ImageP3; // 0x438(0x08)
};

// Class TslGame.*0a27b33ade
// Size: 0x4c0 (Inherited: 0x410)
struct U*0a27b33ade : U*bc854bc287 {
	char pad_410[0x70]; // 0x410(0x70)
	struct USlider* MainSlider; // 0x480(0x08)
	struct UEditableText* EditableValueText; // 0x488(0x08)
	struct UBorder* EditableTextBorder; // 0x490(0x08)
	char pad_498[0x28]; // 0x498(0x28)

	void HandleOnTextValueChanged(); // Function TslGame.*0a27b33ade.HandleOnTextValueChanged // Final|Native|Private|HasOutParms // @ game+0x581af78
	void HandleOnSliderValueChanged(); // Function TslGame.*0a27b33ade.HandleOnSliderValueChanged // Final|Native|Private // @ game+0x581aee0
};

// Class TslGame.*34d753b36d
// Size: 0x438 (Inherited: 0x410)
struct U*34d753b36d : U*bc854bc287 {
	char pad_410[0x28]; // 0x410(0x28)

	void OnSelected(); // Function TslGame.*34d753b36d.OnSelected // Final|Native|Private // @ game+0x5820a1c
};

// Class TslGame.TDMSpawnKitItemWidget
// Size: 0x4a0 (Inherited: 0x438)
struct UTDMSpawnKitItemWidget : U*34d753b36d {
	struct UWidgetSwitcher* SpawnKitButtonSwitcher; // 0x438(0x08)
	struct UButton* SpawnKitButtonDefaultButton; // 0x440(0x08)
	struct UButton* SpawnKitButtonSelectButton; // 0x448(0x08)
	struct UImage* DefaultSpawnKitWeaponIcon; // 0x450(0x08)
	struct UImage* SelectSpawnKitWeaponIcon; // 0x458(0x08)
	struct UTextBlock* DefaultSpawnKitName; // 0x460(0x08)
	struct UTextBlock* SelectSpawnKitName; // 0x468(0x08)
	struct UBorder* DefaultBorder; // 0x470(0x08)
	struct FLinearColor *df36ef05c4; // 0x478(0x10)
	struct FLinearColor *8cce8bf0ff; // 0x488(0x10)
	char pad_498[0x8]; // 0x498(0x08)

	void OnAsyncLoadIconFinished(); // Function TslGame.TDMSpawnKitItemWidget.OnAsyncLoadIconFinished // Final|Native|Private // @ game+0x581d6fc
	void OnSelected(); // Function TslGame.TDMSpawnKitItemWidget.OnSelected // Native|Protected // @ game+0x5820a1c
};

// Class TslGame.TslSpawnKitItemWidget
// Size: 0x4b0 (Inherited: 0x438)
struct UTslSpawnKitItemWidget : U*34d753b36d {
	char pad_438[0x20]; // 0x438(0x20)
	struct UButton* ButtonForSelector; // 0x458(0x08)
	struct UTextBlock* TextBlockForTitle; // 0x460(0x08)
	struct UBorder* ButtonBorder; // 0x468(0x08)
	struct UWidget* CheckMarkSizeBox; // 0x470(0x08)
	struct UWidget* ButtonForSelectorFocus; // 0x478(0x08)
	struct FLinearColor *6c758c56db; // 0x480(0x10)
	struct FLinearColor *8b61c9655b; // 0x490(0x10)
	struct FLinearColor *cb618329b1; // 0x4a0(0x10)

	void OnUnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnUnHovered // Final|Native|Private // @ game+0x582619c
	void OnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnHovered // Final|Native|Private // @ game+0x5820a34
	void OnSelected(); // Function TslGame.TslSpawnKitItemWidget.OnSelected // Final|Native|Private // @ game+0x5820a1c
};

// Class TslGame.*14ef9e6892
// Size: 0x420 (Inherited: 0x410)
struct U*14ef9e6892 : U*bc854bc287 {
	struct U*91d390f031* PubgIdWidget; // 0x410(0x08)
	struct U*54cc75d10f* FadeInAnim; // 0x418(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*14ef9e6892.OnUpdateViewTarget // Final|Native|Public // @ game+0x5826ab0
};

// Class TslGame.*0f23241d46
// Size: 0x438 (Inherited: 0x410)
struct U*0f23241d46 : U*bc854bc287 {
	struct F*06751c9d06 *e6af2dd269; // 0x410(0x28)

	void UpdateDesign_Selected(); // Function TslGame.*0f23241d46.UpdateDesign_Selected // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void UpdateDesign_Normal(); // Function TslGame.*0f23241d46.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*90525561f5
// Size: 0x458 (Inherited: 0x410)
struct U*90525561f5 : U*bc854bc287 {
	float *d28656c297; // 0x410(0x04)
	int32 *eb0f2e368e; // 0x414(0x04)
	int32 *f83afe309c; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct TArray<struct U*0f23241d46*> *7fcda819e5; // 0x420(0x10)
	struct UClass* *7ab7599d7b; // 0x430(0x08)
	struct F*1e5151c8f2 *c4c0dee135; // 0x438(0x20)
};

// Class TslGame.*8863ea16f7
// Size: 0x478 (Inherited: 0x410)
struct U*8863ea16f7 : U*bc854bc287 {
	struct FMulticastDelegate OnClickedTabButtonWidget; // 0x410(0x10)
	struct FString TitleKeyString; // 0x420(0x10)
	struct FText TitleText; // 0x430(0x18)
	struct UTextBlock* TitleNormal; // 0x448(0x08)
	struct UTextBlock* TitleSelected; // 0x450(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x458(0x08)
	struct UButton* OutsideButton; // 0x460(0x08)
	struct UImage* NotificationImage; // 0x468(0x08)
	bool bTurnOffNotificationIfClicked; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)

	void OnClicked(); // Function TslGame.*8863ea16f7.OnClicked // Native|Public // @ game+0x581ea44
};

// Class TslGame.*14790b73f1
// Size: 0x488 (Inherited: 0x478)
struct U*14790b73f1 : U*8863ea16f7 {
	char pad_478[0x10]; // 0x478(0x10)

	void OnCraftableItemRemoved(); // Function TslGame.*14790b73f1.OnCraftableItemRemoved // Final|Native|Private // @ game+0x581ef48
	void OnNewCraftableItemAdded(); // Function TslGame.*14790b73f1.OnNewCraftableItemAdded // Final|Native|Private // @ game+0x58229bc
	void OnViewTargetUpdated(); // Function TslGame.*14790b73f1.OnViewTargetUpdated // Final|Native|Private // @ game+0x58271e0
};

// Class TslGame.*4507de00ab
// Size: 0x440 (Inherited: 0x410)
struct U*4507de00ab : U*bc854bc287 {
	struct FMulticastDelegate OnTabGroupUpdated; // 0x410(0x10)
	struct TArray<struct U*8863ea16f7*> *2fdef29af5; // 0x420(0x10)
	struct UWidget* TabHorizontalBox; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)

	void UpdateIndexToBP(); // Function TslGame.*4507de00ab.UpdateIndexToBP // Final|Native|Public|BlueprintCallable // @ game+0x5831114
	void ResetTabGroup(); // Function TslGame.*4507de00ab.ResetTabGroup // Final|Native|Public|BlueprintCallable // @ game+0x58292a0
	void UpdateIndexTo(); // Function TslGame.*4507de00ab.UpdateIndexTo // Final|Native|Public // @ game+0x5831114
	void UpdateCurrentIndex(); // Function TslGame.*4507de00ab.UpdateCurrentIndex // Final|Native|Public|BlueprintCallable // @ game+0x5830e88
};

// Class TslGame.*3945e9cacf
// Size: 0x500 (Inherited: 0x410)
struct U*3945e9cacf : U*bc854bc287 {
	DelegateProperty *1eefbfbed7; // 0x410(0x10)
	struct FText TitleText; // 0x420(0x18)
	struct FString TitleKeyString; // 0x438(0x10)
	struct F*8c7bdcaa93 *15c259ec4f; // 0x448(0x20)
	struct F*8c7bdcaa93 *d38aefdd46; // 0x468(0x20)
	struct F*06751c9d06 *e6af2dd269; // 0x488(0x28)
	struct F*1e5151c8f2 *c2c8668e16; // 0x4b0(0x20)
	struct F*b1a0bce7e4 *c0a7c13068; // 0x4d0(0x28)
	char pad_4F8[0x8]; // 0x4f8(0x08)

	void UpdateTitleText(); // Function TslGame.*3945e9cacf.UpdateTitleText // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x58319fc
	void OnClicked(); // Function TslGame.*3945e9cacf.OnClicked // Final|Native|Public // @ game+0x581ea84
	void UpdateDesign_Selected(); // Function TslGame.*3945e9cacf.UpdateDesign_Selected // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*cf87751ebe
// Size: 0x480 (Inherited: 0x410)
struct U*cf87751ebe : U*bc854bc287 {
	struct FVector2D IconSize; // 0x410(0x08)
	struct TMap<int32, struct UImage*> *d7d0efe5e7; // 0x418(0x50)
	struct TArray<struct UImage*> *16b43e4804; // 0x468(0x10)
	struct UHorizontalBox* PanelHorBox; // 0x478(0x08)
};

// Class TslGame.*5b688e72d7
// Size: 0x860 (Inherited: 0x410)
struct U*5b688e72d7 : U*bc854bc287 {
	char pad_410[0x8]; // 0x410(0x08)
	struct F*f90b3e2b9a *df72dcf6ce; // 0x418(0x28)
	struct F*7c50600f8f *3f35ed5a99; // 0x440(0x30)
	struct F*06751c9d06 *b8af1780fe; // 0x470(0x28)
	struct F*aad5c0ee0d *4031fe0046; // 0x498(0x28)
	struct F*72b0194904 *ef2f12aed2; // 0x4c0(0x20)
	struct F*72b0194904 *94623cd9b6; // 0x4e0(0x20)
	struct F*d19b0bbaa6 *581f4ddb3e; // 0x500(0x20)
	struct F*68d8762d80 *68d8762d80; // 0x520(0x10)
	struct UWidgetSwitcher* PlayerStateIconsSwitcher; // 0x530(0x08)
	struct UTextBlock* PlayerNameText; // 0x538(0x08)
	struct UWidgetSwitcher* PlayerColorSwitcher; // 0x540(0x08)
	struct UWidgetSwitcher* PlayerIconNumberSwitcher; // 0x548(0x08)
	struct UImage* MarkerImage; // 0x550(0x08)
	struct UImage* PlayerBoostGaugeImage; // 0x558(0x08)
	struct UTextBlock* FollowNumTxt; // 0x560(0x08)
	struct UImage* FollowArrowImg; // 0x568(0x08)
	struct UImage* IconItemRequest; // 0x570(0x08)
	struct UImage* IconSpecificModeImage; // 0x578(0x08)
	char pad_580[0x8]; // 0x580(0x08)
	struct F*06751c9d06 *a8dbd75519; // 0x588(0x28)
	float *ecc8ea1b26; // 0x5b0(0x04)
	float *35bd11dce9; // 0x5b4(0x04)
	struct F*7c50600f8f *ec245dfec8; // 0x5b8(0x30)
	struct F*8c7bdcaa93 *5628d69621; // 0x5e8(0x20)
	struct F*d19b0bbaa6 *da56618d53; // 0x608(0x20)
	struct F*aad5c0ee0d *85bd311721; // 0x628(0x28)
	struct F*06751c9d06 *c8f34515b1; // 0x650(0x28)
	struct F*1e5151c8f2 *f6065fb522; // 0x678(0x20)
	struct F*06751c9d06 *9c2dfc8a34; // 0x698(0x28)
	struct F*06751c9d06 *d0560bb65c; // 0x6c0(0x28)
	struct F*1e5151c8f2 *adbf37c6d0; // 0x6e8(0x20)
	struct ATeam* Team; // 0x708(0x08)
	struct FLinearColor *384f699358; // 0x710(0x10)
	struct TArray<struct UTexture2D*> *241cc65d22; // 0x720(0x10)
	struct UTexture2D* *8c1e7dea59; // 0x730(0x08)
	struct F*b1a0bce7e4 *f28f679294; // 0x738(0x28)
	struct UTextBlock* ComeBackWarRemainText; // 0x760(0x08)
	struct UTextBlock* BindTextComebackTime; // 0x768(0x08)
	struct UBorder* PlayerStateIconsBorder; // 0x770(0x08)
	struct UBorder* PlayerInfoBorder; // 0x778(0x08)
	struct UBorder* PlayerGaugeBorder; // 0x780(0x08)
	struct UBorder* TeamFollowBorder; // 0x788(0x08)
	struct UBorder* TeamVoiceBorder; // 0x790(0x08)
	struct U*cf87751ebe* AdditionalIcon; // 0x798(0x08)
	struct UTexture2D* *4ff415cf7f; // 0x7a0(0x08)
	struct UTexture2D* *0d1c11dd1a; // 0x7a8(0x08)
	struct ATslCharacter* *e665a1f0e0; // 0x7b0(0x08)
	char pad_7B8[0x10]; // 0x7b8(0x10)
	struct TMap<struct UMaterialInterface*, struct UMaterialInstanceDynamic*> *2405b71707; // 0x7c8(0x50)
	float *916240a7e8; // 0x818(0x04)
	bool *864fa50d9d; // 0x81c(0x01)
	char pad_81D[0x1]; // 0x81d(0x01)
	bool *01ef0d4124; // 0x81e(0x01)
	char pad_81F[0x41]; // 0x81f(0x41)

	void *4398ec63fe(); // Function TslGame.*5b688e72d7.*4398ec63fe // Final|Native|Private // @ game+0x5831910
	struct FString OnNativeParticipantMuteChanged(struct FString Param1); // Function TslGame.*5b688e72d7.OnNativeParticipantMuteChanged // Final|Native|Private // @ game+0x5822704
	void *4a742d2533(); // Function TslGame.*5b688e72d7.*4a742d2533 // Final|Native|Private // @ game+0x5831960
	void *fae7eb89c9(); // Function TslGame.*5b688e72d7.*fae7eb89c9 // Final|Native|Private // @ game+0x5831ce8
	struct FString OnNativeParticipantRestrictionChanged(); // Function TslGame.*5b688e72d7.OnNativeParticipantRestrictionChanged // Final|Native|Private // @ game+0x582289c
	void *7d5a8a5d50(); // Function TslGame.*5b688e72d7.*7d5a8a5d50 // Final|Native|Private // @ game+0x5831924
	void *a6cd44b53d(); // Function TslGame.*5b688e72d7.*a6cd44b53d // Final|Native|Private // @ game+0x58314dc
	void *7768f5d2cc(); // Function TslGame.*5b688e72d7.*7768f5d2cc // Final|Native|Private // @ game+0x5830fcc
	void *9a908bb59a(); // Function TslGame.*5b688e72d7.*9a908bb59a // Final|Native|Private // @ game+0x58317e0
	bool *f7b54b6bb8(); // Function TslGame.*5b688e72d7.*f7b54b6bb8 // Final|Native|Private // @ game+0x5827270
	void *92c37fc6e2(); // Function TslGame.*5b688e72d7.*92c37fc6e2 // Final|Native|Private // @ game+0x5830bf8
	void *47948638c7(struct FString Param0); // Function TslGame.*5b688e72d7.*47948638c7 // Final|Native|Public // @ game+0x58199c0
	void *932c24af98(); // Function TslGame.*5b688e72d7.*932c24af98 // Final|Native|Private // @ game+0x58291e0
	void *bcb2cab683(); // Function TslGame.*5b688e72d7.*bcb2cab683 // Final|Native|Private // @ game+0x583194c
	struct FString OnParticipantRestrictionChanged(); // Function TslGame.*5b688e72d7.OnParticipantRestrictionChanged // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void NotifyEngageAttacked(); // Function TslGame.*5b688e72d7.NotifyEngageAttacked // Final|Native|Private // @ game+0x581d050
	void SetTeam(); // Function TslGame.*5b688e72d7.SetTeam // Native|Public|BlueprintCallable // @ game+0x582f2cc
	void *611aabc09d(); // Function TslGame.*5b688e72d7.*611aabc09d // Final|Native|Private // @ game+0x581607c
	void *9c0916b177(); // Function TslGame.*5b688e72d7.*9c0916b177 // Final|Native|Private // @ game+0x5831100
	void *5ea32c9085(); // Function TslGame.*5b688e72d7.*5ea32c9085 // Final|Native|Private // @ game+0x5829190
	void OnLeaveTeamVoiceChannel(); // Function TslGame.*5b688e72d7.OnLeaveTeamVoiceChannel // Final|Native|Private // @ game+0x5820f40
	bool UpdateVoiceStatusOnly(float Param1); // Function TslGame.*5b688e72d7.UpdateVoiceStatusOnly // Final|Native|Private // @ game+0x5831cfc
	void OnParticipantMuteChanged(struct ATeam* Team, struct FString ChannelId); // Function TslGame.*5b688e72d7.OnParticipantMuteChanged // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	bool *80ef739451(); // Function TslGame.*5b688e72d7.*80ef739451 // Final|Native|Private // @ game+0x5829060
	void *b8c8c540af(); // Function TslGame.*5b688e72d7.*b8c8c540af // Final|Native|Private // @ game+0x58319c0
	void UpdateVoiceChat(struct FString Param0, bool Param2); // Function TslGame.*5b688e72d7.UpdateVoiceChat // Final|Native|Private // @ game+0x5831aec
	void *835cbab21d(); // Function TslGame.*5b688e72d7.*835cbab21d // Final|Native|Private // @ game+0x58319d4
	void OnBlockUserUpdated(); // Function TslGame.*5b688e72d7.OnBlockUserUpdated // Final|Native|Private // @ game+0x581dc4c
	void *69bf4f4608(); // Function TslGame.*5b688e72d7.*69bf4f4608 // Final|Native|Private // @ game+0x582857c
	void FollowParachuteAction(); // Function TslGame.*5b688e72d7.FollowParachuteAction // Final|Native|Public // @ game+0x581980c
};

// Class TslGame.*3978ecfd89
// Size: 0x928 (Inherited: 0x860)
struct U*3978ecfd89 : U*5b688e72d7 {
	struct UImage* ClassIconImageWidget; // 0x860(0x08)
	struct U*7762a61952* TeamInfoGroup; // 0x868(0x08)
	struct UImage* IconBackgroundImageWidget; // 0x870(0x08)
	struct UImage* MemberIndexBackgroundImageWidget; // 0x878(0x08)
	struct UImage* FullBackgroundImageWidget; // 0x880(0x08)
	struct U*7762a61952* LevelPanelWidget; // 0x888(0x08)
	struct UTextBlock* PlayeLevelText; // 0x890(0x08)
	struct TMap<enum class EFBRClass, struct UTexture2D*> ClassTextureData; // 0x898(0x50)
	struct TArray<struct F*6666022568> ImageByMemberIndex; // 0x8e8(0x10)
	struct FMargin SlotPaddingOverride; // 0x8f8(0x10)
	struct FName MaterialParam_Texture; // 0x908(0x08)
	struct FName MaterialParam_IsGray; // 0x910(0x08)
	struct FName MaterialParam_IsBlink; // 0x918(0x08)
	char pad_920[0x8]; // 0x920(0x08)

	void OnToggleClassSelectWidget(); // Function TslGame.*3978ecfd89.OnToggleClassSelectWidget // Final|Native|Public // @ game+0x582604c
	void OnTeamSpawnKitUpdated(); // Function TslGame.*3978ecfd89.OnTeamSpawnKitUpdated // Final|Native|Public // @ game+0x58259e4
};

// Class TslGame.*4ff31079f4
// Size: 0x508 (Inherited: 0x410)
struct U*4ff31079f4 : U*bc854bc287 {
	struct FMulticastDelegate OnReportButtonClicked; // 0x410(0x10)
	char pad_420[0x40]; // 0x420(0x40)
	struct FTslReportUserInfo *e6572f46ad; // 0x460(0x70)
	struct F*b1a0bce7e4 *e33ef3fdc8; // 0x4d0(0x28)
	float VisualVolumeModifier; // 0x4f8(0x04)
	float ActualVolumeMin; // 0x4fc(0x04)
	float ActualVolumeMax; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
};

// Class TslGame.*f2e2cbe8e9
// Size: 0x830 (Inherited: 0x508)
struct U*f2e2cbe8e9 : U*4ff31079f4 {
	char pad_508[0x48]; // 0x508(0x48)
	struct UWidgetSwitcher* RadioButtonSwitcher; // 0x550(0x08)
	struct UButton* RadioOnButton; // 0x558(0x08)
	struct UButton* RadioOffButton; // 0x560(0x08)
	struct UWidgetSwitcher* WaypointButtonSwitcher; // 0x568(0x08)
	struct UButton* WaypointOnButton; // 0x570(0x08)
	struct UButton* WaypointOffButton; // 0x578(0x08)
	struct F*06751c9d06 *7ccd08b3f1; // 0x580(0x28)
	struct F*aad5c0ee0d *9c5e46063f; // 0x5a8(0x28)
	struct F*1e5151c8f2 *1bbfb0af42; // 0x5d0(0x20)
	struct F*1e5151c8f2 *58b56a97df; // 0x5f0(0x20)
	struct F*aad5c0ee0d *48d28278d2; // 0x610(0x28)
	struct F*8c7bdcaa93 *f3ca2df914; // 0x638(0x20)
	struct F*7c50600f8f *070159542b; // 0x658(0x30)
	struct F*1e5151c8f2 *c113aa4363; // 0x688(0x20)
	struct F*06751c9d06 *4b8824a85b; // 0x6a8(0x28)
	int32 *65bcb01032; // 0x6d0(0x04)
	int32 *79664d854a; // 0x6d4(0x04)
	struct F*1e5151c8f2 *edef5c5d71; // 0x6d8(0x20)
	struct F*1e5151c8f2 *2138841ce3; // 0x6f8(0x20)
	struct F*1e5151c8f2 *86ab2ed6e5; // 0x718(0x20)
	struct F*8c7bdcaa93 *b692dfebba; // 0x738(0x20)
	struct F*aad5c0ee0d *a27dbd095b; // 0x758(0x28)
	struct F*aad5c0ee0d *4095d62b8f; // 0x780(0x28)
	struct F*7c50600f8f *28d509b9dc; // 0x7a8(0x30)
	struct FLinearColor *d577499392; // 0x7d8(0x10)
	struct FLinearColor *d7eb635ca3; // 0x7e8(0x10)
	struct FLinearColor *00608ac3ae; // 0x7f8(0x10)
	struct FText *6b12b22e02; // 0x808(0x18)
	char pad_820[0x10]; // 0x820(0x10)

	void NotifyToggleAvoidButtonClicked(); // Function TslGame.*f2e2cbe8e9.NotifyToggleAvoidButtonClicked // Final|Native|Protected // @ game+0x581d2f4
	void OnClickedRadioOnButton(); // Function TslGame.*f2e2cbe8e9.OnClickedRadioOnButton // Final|Native|Protected // @ game+0x581eab4
	void NotifyToggleVoiceMuteButtonClicked(); // Function TslGame.*f2e2cbe8e9.NotifyToggleVoiceMuteButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x581d308
	void OnClickedWaypointOnButton(); // Function TslGame.*f2e2cbe8e9.OnClickedWaypointOnButton // Final|Native|Protected // @ game+0x581eae4
	void NotifyReportButtonClicked(); // Function TslGame.*f2e2cbe8e9.NotifyReportButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x581d24c
	void OnClickedRadioOffButton(); // Function TslGame.*f2e2cbe8e9.OnClickedRadioOffButton // Final|Native|Protected // @ game+0x581eab4
	void NotifyVolumeSliderUpdated(); // Function TslGame.*f2e2cbe8e9.NotifyVolumeSliderUpdated // Final|Native|Protected|BlueprintCallable // @ game+0x581d31c
	void OnClickedWaypointOffButton(); // Function TslGame.*f2e2cbe8e9.OnClickedWaypointOffButton // Final|Native|Protected // @ game+0x581eac8
};

// Class TslGame.*37050c5da6
// Size: 0x6b8 (Inherited: 0x508)
struct U*37050c5da6 : U*4ff31079f4 {
	struct FMulticastDelegate OnNavigate; // 0x508(0x10)
	struct FMulticastDelegate OnShowGamerCard; // 0x518(0x10)
	struct FMulticastDelegate OnToggleVoiceMute; // 0x528(0x10)
	struct FMulticastDelegate OnToggleAvoid; // 0x538(0x10)
	struct FMulticastDelegate OnRequestClose; // 0x548(0x10)
	char pad_558[0x8]; // 0x558(0x08)
	struct F*7c50600f8f *3791f907e1; // 0x560(0x30)
	struct F*8c7bdcaa93 *f3ca2df914; // 0x590(0x20)
	struct F*06751c9d06 *7e1fa5c0b1; // 0x5b0(0x28)
	struct F*d19b0bbaa6 *da56618d53; // 0x5d8(0x20)
	int32 *f8fe1b93b8; // 0x5f8(0x04)
	int32 *a79ad9f592; // 0x5fc(0x04)
	float *4af2d46dc4; // 0x600(0x04)
	char pad_604[0x4]; // 0x604(0x04)
	struct F*aad5c0ee0d *1365650129; // 0x608(0x28)
	struct F*b1a0bce7e4 *73e1b7de57; // 0x630(0x28)
	struct F*8c7bdcaa93 *5bb8cfa2b0; // 0x658(0x20)
	struct FLinearColor FocusedContentColor; // 0x678(0x10)
	struct FLinearColor DefaultContentColor; // 0x688(0x10)
	struct FLinearColor FocusedBrushColor; // 0x698(0x10)
	struct FLinearColor DefaultBrushColor; // 0x6a8(0x10)
};

// Class TslGame.*52beb7d9a7
// Size: 0x4d0 (Inherited: 0x410)
struct U*52beb7d9a7 : U*bc854bc287 {
	struct UImage* CookingTimerImage; // 0x410(0x08)
	struct UMaterialInstanceDynamic* *c1e0075cbb; // 0x418(0x08)
	struct ATslWeapon_Throwable* *b0b7118a51; // 0x420(0x08)
	struct TMap<enum class EColorBlindType, struct FLinearColor> NormalColorMap; // 0x428(0x50)
	struct TMap<enum class EColorBlindType, struct FLinearColor> WarningColorMap; // 0x478(0x50)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*52beb7d9a7.OnUpdateViewTarget // Final|Native|Private // @ game+0xd23e88
	void UpdateProgressColor(); // Function TslGame.*52beb7d9a7.UpdateProgressColor // Final|Native|Private // @ game+0x5831540
};

// Class TslGame.*4cd65ec497
// Size: 0x490 (Inherited: 0x410)
struct U*4cd65ec497 : U*bc854bc287 {
	char pad_410[0x18]; // 0x410(0x18)
	int32 *1503191356; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UClass* WeaponType; // 0x430(0x08)
	struct UTexture* *d189dd0a65; // 0x438(0x08)
	float *3cf6c808fb; // 0x440(0x04)
	struct FLinearColor NormalColor; // 0x444(0x10)
	struct FLinearColor *2a7e54de59; // 0x454(0x10)
	char pad_464[0x4]; // 0x464(0x04)
	struct UImage* Icon; // 0x468(0x08)
	struct UTextBlock* ItemCountText; // 0x470(0x08)
	struct USizeBox* IconSize; // 0x478(0x08)
	struct U*54cc75d10f* Anim_Use; // 0x480(0x08)
	struct U*54cc75d10f* Anim_Add; // 0x488(0x08)

	void OnThrowableItemsUpdated(); // Function TslGame.*4cd65ec497.OnThrowableItemsUpdated // Final|Native|Private // @ game+0x5825ccc
	void GetThrowableItemCount(struct UClass* InItemType); // Function TslGame.*4cd65ec497.GetThrowableItemCount // Final|Native|Public|BlueprintCallable // @ game+0x581a4ec
};

// Class TslGame.*978e216bda
// Size: 0x440 (Inherited: 0x410)
struct U*978e216bda : U*bc854bc287 {
	struct UTextBlock* ToolTipTitleText; // 0x410(0x08)
	struct UTextBlock* ToolTipContentText; // 0x418(0x08)
	struct UWidget* *882487bb0b; // 0x420(0x08)
	char pad_428[0x18]; // 0x428(0x18)
};

// Class TslGame.*ebb955efb3
// Size: 0x480 (Inherited: 0x410)
struct U*ebb955efb3 : U*bc854bc287 {
	struct UButton* ExitButton; // 0x410(0x08)
	struct UButton* AimTrainingButton; // 0x418(0x08)
	struct UButton* SoundTrainingButton; // 0x420(0x08)
	struct UButton* RecordRange10Button; // 0x428(0x08)
	struct UButton* RecordRange50Button; // 0x430(0x08)
	struct UButton* RecordRange100Button; // 0x438(0x08)
	struct UWidgetSwitcher* RecordInfoSwitcher; // 0x440(0x08)
	struct U*2840d8ef8e* LatestAimRecordInfoWidget; // 0x448(0x08)
	struct U*2840d8ef8e* BestAimRecordInfoWidget; // 0x450(0x08)
	struct U*2840d8ef8e* LatestSoundRecordInfoWidget; // 0x458(0x08)
	struct U*2840d8ef8e* BestSoundRecordInfoWidget; // 0x460(0x08)
	struct U*8e96d3e9de* RecordGraphWidget; // 0x468(0x08)
	struct UCanvasPanel* EmptyDataBlockerPanel; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)

	void OnSoundTrainingButton(); // Function TslGame.*ebb955efb3.OnSoundTrainingButton // Final|Native|Private // @ game+0x58252e8
	void OnCloseDashboard(); // Function TslGame.*ebb955efb3.OnCloseDashboard // Final|Native|Public // @ game+0x581ecb4
	void OnHoveredButton(); // Function TslGame.*ebb955efb3.OnHoveredButton // Final|Native|Private // @ game+0xbf00fc
	void OnAimTrainingButton(); // Function TslGame.*ebb955efb3.OnAimTrainingButton // Final|Native|Private // @ game+0x581d5ac
	void OnDashboardRange100Button(); // Function TslGame.*ebb955efb3.OnDashboardRange100Button // Final|Native|Private // @ game+0x581ef70
	void OnDashboardRange10Button(); // Function TslGame.*ebb955efb3.OnDashboardRange10Button // Final|Native|Private // @ game+0x581ef8c
	void OnDashboardRange50Button(); // Function TslGame.*ebb955efb3.OnDashboardRange50Button // Final|Native|Private // @ game+0x581efa8
};

// Class TslGame.*2840d8ef8e
// Size: 0x418 (Inherited: 0x410)
struct U*2840d8ef8e : U*bc854bc287 {
	struct UTextBlock* InfoTypeText; // 0x410(0x08)
};

// Class TslGame.*2186ea0f38
// Size: 0x468 (Inherited: 0x418)
struct U*2186ea0f38 : U*2840d8ef8e {
	struct UTextBlock* ScoreText; // 0x418(0x08)
	struct UTextBlock* AccuracyText; // 0x420(0x08)
	struct UTextBlock* HeadShotKillText; // 0x428(0x08)
	struct UTextBlock* KillText; // 0x430(0x08)
	struct UTextBlock* WeaponText; // 0x438(0x08)
	struct UTextBlock* HeadHitText; // 0x440(0x08)
	struct UTextBlock* ArmHitText; // 0x448(0x08)
	struct UTextBlock* TorsoHitText; // 0x450(0x08)
	struct UTextBlock* PelvisHitText; // 0x458(0x08)
	struct UTextBlock* LegHitText; // 0x460(0x08)
};

// Class TslGame.*4211c85ea1
// Size: 0x438 (Inherited: 0x418)
struct U*4211c85ea1 : U*2840d8ef8e {
	struct UTextBlock* ScoreText; // 0x418(0x08)
	struct UTextBlock* AccuracyText; // 0x420(0x08)
	struct UTextBlock* ReactionRateText; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*e06c592441
// Size: 0x4a8 (Inherited: 0x410)
struct U*e06c592441 : U*bc854bc287 {
	struct FText TrainingTitleText; // 0x410(0x18)
	struct FText TrainingDetailText; // 0x428(0x18)
	struct UTexture2D* ButtonImageTexture; // 0x440(0x08)
	enum class ETrainingPracticeType PracticeType; // 0x448(0x01)
	char pad_449[0x17]; // 0x449(0x17)
	struct FVector2D *20d14d0b3a; // 0x460(0x08)
	struct FVector2D *dced5b0a31; // 0x468(0x08)
	struct UTextBlock* TitleText; // 0x470(0x08)
	struct UTextBlock* DetailText; // 0x478(0x08)
	struct UImage* ButtonImage; // 0x480(0x08)
	struct UImage* ConsoleHighlight; // 0x488(0x08)
	struct UButton* TrainingMenuButton; // 0x490(0x08)
	struct USizeBox* TrainingMenuButtonSizeBox; // 0x498(0x08)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void OnTrainingMenuSelect(); // Function TslGame.*e06c592441.OnTrainingMenuSelect // Final|Native|Public // @ game+0x5826188
	void OnUnHoveredButton(); // Function TslGame.*e06c592441.OnUnHoveredButton // Final|Native|Public // @ game+0x58261d0
	void OnHoveredButton(); // Function TslGame.*e06c592441.OnHoveredButton // Final|Native|Public // @ game+0x5820a68
};

// Class TslGame.*e9ee377d99
// Size: 0x450 (Inherited: 0x410)
struct U*e9ee377d99 : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	struct U*36dae25fa9* RoundCount; // 0x420(0x08)
	struct U*130d17c11b* RoundTime; // 0x428(0x08)
	char pad_430[0x20]; // 0x430(0x20)
};

// Class TslGame.*7f56afd102
// Size: 0x468 (Inherited: 0x450)
struct U*7f56afd102 : U*e9ee377d99 {
	struct U*d5b7fcf3e0* ScorePoints; // 0x450(0x08)
	struct U*f85b6bbd54* WinningStreak; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)
};

// Class TslGame.*8f2d4b3dbe
// Size: 0x570 (Inherited: 0x450)
struct U*8f2d4b3dbe : U*e9ee377d99 {
	struct U*c219922f7c* PlayerHeadManager; // 0x450(0x08)
	struct UBorder* HP_Border; // 0x458(0x08)
	struct U*d5b7fcf3e0* Player_Score; // 0x460(0x08)
	struct U*d5b7fcf3e0* Enemy_Score; // 0x468(0x08)
	struct UImage* Player_Gauge_Image; // 0x470(0x08)
	struct UImage* Enemy_Gauge_Image; // 0x478(0x08)
	struct U*24809ef0d2* Player_PlatformIcon; // 0x480(0x08)
	struct U*24809ef0d2* Enemy_PlatformIcon; // 0x488(0x08)
	struct UTextBlock* PlayerName_Text; // 0x490(0x08)
	struct UTextBlock* EnemyName_Text; // 0x498(0x08)
	struct U*54cc75d10f* Hit0_Anim; // 0x4a0(0x08)
	struct U*54cc75d10f* Hit1_Anim; // 0x4a8(0x08)
	struct U*54cc75d10f* Open_Anim; // 0x4b0(0x08)
	char pad_4B8[0xa0]; // 0x4b8(0xa0)
	struct U*f85b6bbd54* PlayerWinningStreak; // 0x558(0x08)
	struct U*f85b6bbd54* EnemyWinningStreak; // 0x560(0x08)
	char pad_568[0x8]; // 0x568(0x08)
};

// Class TslGame.*642a849e5f
// Size: 0x430 (Inherited: 0x410)
struct U*642a849e5f : U*bc854bc287 {
	struct UWidgetSwitcher* ResultMark_Switcher; // 0x410(0x08)
	struct UWidgetSwitcher* ResultText_Switcher; // 0x418(0x08)
	struct U*54cc75d10f* Anim_Start; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*598baea08d
// Size: 0x438 (Inherited: 0x410)
struct U*598baea08d : U*bc854bc287 {
	struct U*642a849e5f* Round_Player; // 0x410(0x08)
	struct U*130d17c11b* Round_Time; // 0x418(0x08)
	struct U*642a849e5f* Round_Enemy; // 0x420(0x08)
	struct U*54cc75d10f* Anim_Start; // 0x428(0x08)
	struct UAkAudioEvent* *7c29ca6773; // 0x430(0x08)
};

// Class TslGame.*fc008f6ec8
// Size: 0x498 (Inherited: 0x410)
struct U*fc008f6ec8 : U*bc854bc287 {
	struct U*54cc75d10f* Open_Anim; // 0x410(0x08)
	struct U*54cc75d10f* Close_Anim; // 0x418(0x08)
	struct U*54cc75d10f* Found_Anim; // 0x420(0x08)
	struct U*54cc75d10f* MatchStart_Anim; // 0x428(0x08)
	struct U*54cc75d10f* MatchEnd_Anim; // 0x430(0x08)
	struct UCanvasPanel* Search_CanvasPanel; // 0x438(0x08)
	struct UTextBlock* Search_Sub_TextBlock; // 0x440(0x08)
	struct UGridPanel* Search_GridPanel; // 0x448(0x08)
	struct UBorder* Search_Border; // 0x450(0x08)
	struct FText TimeTextFormat; // 0x458(0x18)
	struct FString *4a26f849cd; // 0x470(0x10)
	struct FString *488cae6ae9; // 0x480(0x10)
	char pad_490[0x8]; // 0x490(0x08)

	void OnMatchFound(); // Function TslGame.*fc008f6ec8.OnMatchFound // Final|Native|Private // @ game+0x58214ac
	void OnUpdateMatchWaitingElapsedTime(); // Function TslGame.*fc008f6ec8.OnUpdateMatchWaitingElapsedTime // Final|Native|Private // @ game+0x58263e4
	void OnSearchStarted(); // Function TslGame.*fc008f6ec8.OnSearchStarted // Final|Native|Private // @ game+0x5824710
	void OnSearchCanceled(); // Function TslGame.*fc008f6ec8.OnSearchCanceled // Final|Native|Private // @ game+0x58246fc
};

// Class TslGame.*f85b6bbd54
// Size: 0x4f8 (Inherited: 0x410)
struct U*f85b6bbd54 : U*bc854bc287 {
	struct FSlateBrush *f16c06a048; // 0x410(0x90)
	int32 *262f9f89e8; // 0x4a0(0x04)
	int32 *23c1b51fa1; // 0x4a4(0x04)
	struct FMargin *c3d52561ac; // 0x4a8(0x10)
	enum class EHorizontalAlignment *28c85a119b; // 0x4b8(0x01)
	char pad_4B9[0x3]; // 0x4b9(0x03)
	struct FLinearColor *cbc555f1fb; // 0x4bc(0x10)
	char pad_4CC[0x4]; // 0x4cc(0x04)
	struct UTextBlock* WinningStreakTitleText; // 0x4d0(0x08)
	struct UTextBlock* WinningStreakWinsText; // 0x4d8(0x08)
	struct USizeBox* WinningStreak_SizeBox; // 0x4e0(0x08)
	struct UHorizontalBox* WinningStreak_HorizontalBox; // 0x4e8(0x08)
	struct UBorder* WinningStreak_Border; // 0x4f0(0x08)
};

// Class TslGame.*c28b3fb80f
// Size: 0x498 (Inherited: 0x410)
struct U*c28b3fb80f : U*bc854bc287 {
	char pad_410[0x10]; // 0x410(0x10)
	float ScoreTextStartTime; // 0x420(0x04)
	float ScoreTextUpdateTime; // 0x424(0x04)
	float ScoreTextMaxTime; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UAkAudioEvent* ScoreRiseSoundEvent; // 0x430(0x08)
	struct UAkAudioEvent* ScoreRiseSoundEndEvent; // 0x438(0x08)
	struct UImage* TrainingScoreIconImage; // 0x440(0x08)
	struct UTextBlock* TrainingScoreTitleText; // 0x448(0x08)
	struct UTextBlock* TrainingScoreNumberText; // 0x450(0x08)
	struct U*54cc75d10f* Emerge; // 0x458(0x08)
	char pad_460[0x38]; // 0x460(0x38)

	void *e9d41590da(); // Function TslGame.*c28b3fb80f.*e9d41590da // Final|Native|Private // @ game+0x5828590
	void *e7c70dce57(); // Function TslGame.*c28b3fb80f.*e7c70dce57 // Final|Native|Private // @ game+0x5830be4
	void *3c3e653f87(); // Function TslGame.*c28b3fb80f.*3c3e653f87 // Final|Native|Private // @ game+0x5830020
};

// Class TslGame.*e91330b7a4
// Size: 0x428 (Inherited: 0x410)
struct U*e91330b7a4 : U*bc854bc287 {
	struct UTextBlock* TurnNumber_Text; // 0x410(0x08)
	struct UTextBlock* WeaponName_Text; // 0x418(0x08)
	struct UImage* Weapon_Image; // 0x420(0x08)
};

// Class TslGame.*041b9ea7fc
// Size: 0x5a0 (Inherited: 0x410)
struct U*041b9ea7fc : U*bc854bc287 {
	enum class ETslTrainingType *e27b6729de; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct FText TitleText; // 0x418(0x18)
	struct UTexture2D* BackGroundTexture; // 0x430(0x08)
	struct UTexture2D* *06d26cf66b; // 0x438(0x08)
	struct UImage* TrainingIconImage; // 0x440(0x08)
	struct UImage* BackgroundImage; // 0x448(0x08)
	struct UButton* TeleportButton; // 0x450(0x08)
	struct U*68fe248867* Title_Text; // 0x458(0x08)
	char pad_460[0x128]; // 0x460(0x128)
	struct U*805f5861ab* *638fd0729b; // 0x588(0x08)
	struct U*54cc75d10f* OnBtnHovered_Anim; // 0x590(0x08)
	float *02a6415912; // 0x598(0x04)
	float *a58dba797d; // 0x59c(0x04)

	void OnBtnHoverEnded(); // Function TslGame.*041b9ea7fc.OnBtnHoverEnded // Final|Native|Protected|BlueprintCallable // @ game+0x581df9c
	void OnBtnHovered(); // Function TslGame.*041b9ea7fc.OnBtnHovered // Final|Native|Protected|BlueprintCallable // @ game+0x581e040
	void OnBtnClicked(); // Function TslGame.*041b9ea7fc.OnBtnClicked // Final|Native|Protected|BlueprintCallable // @ game+0x581def8
};

// Class TslGame.*47808853ec
// Size: 0x458 (Inherited: 0x410)
struct U*47808853ec : U*bc854bc287 {
	char pad_410[0x30]; // 0x410(0x30)
	struct U*68fe248867* ToolTipTitleText; // 0x440(0x08)
	struct UImage* ToolTipImage; // 0x448(0x08)
	struct UImage* BackgroundImage; // 0x450(0x08)
};

// Class TslGame.*b16d3011cf
// Size: 0x428 (Inherited: 0x410)
struct U*b16d3011cf : U*bc854bc287 {
	struct UImage* CapacityImage; // 0x410(0x08)
	struct UImage* FeedbackImage; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void OnFocusItemSlot(TScriptInterface<struct U*e63b4ff431> Param1); // Function TslGame.*b16d3011cf.OnFocusItemSlot // Final|Native|Private // @ game+0x581fe50
	TScriptInterface<struct U*e63b4ff431> OnEnterItemSlot(); // Function TslGame.*b16d3011cf.OnEnterItemSlot // Final|Native|Private // @ game+0x581f7d4
	void OnAttachmentFocuseSlotID(TScriptInterface<struct U*ff30135362> Param1); // Function TslGame.*b16d3011cf.OnAttachmentFocuseSlotID // Final|Native|Private // @ game+0x581d8c8
	TScriptInterface<struct U*e63b4ff431> OnLeaveItemSlot(); // Function TslGame.*b16d3011cf.OnLeaveItemSlot // Final|Native|Private // @ game+0x5820c90
	TScriptInterface<struct U*ff30135362> OnFocusWeaponItemSlotIDEquipment(TScriptInterface<struct U*e63b4ff431> Param2); // Function TslGame.*b16d3011cf.OnFocusWeaponItemSlotIDEquipment // Final|Native|Private // @ game+0x5820054
	void OnFocusItemSlotIDEquipment(); // Function TslGame.*b16d3011cf.OnFocusItemSlotIDEquipment // Final|Native|Private // @ game+0x581ffc4
};

// Class TslGame.*ff9faf40b0
// Size: 0x420 (Inherited: 0x410)
struct U*ff9faf40b0 : U*bc854bc287 {
	struct U*f1ceb4e93e* TutorialMissionListWidget; // 0x410(0x08)
	struct U*b3d26677c8* TutorialBannerWidget; // 0x418(0x08)
};

// Class TslGame.*5d296b2a6e
// Size: 0x438 (Inherited: 0x410)
struct U*5d296b2a6e : U*bc854bc287 {
	struct UTextBlock* TitleText; // 0x410(0x08)
	struct UTslRichTextBlock* MainText; // 0x418(0x08)
	struct U*54cc75d10f* FadeInAnim; // 0x420(0x08)
	struct U*54cc75d10f* FadeOutAnim; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*f78ed0a974
// Size: 0x470 (Inherited: 0x410)
struct U*f78ed0a974 : U*bc854bc287 {
	struct U*b7a715c048* RadioMessageLogWidget; // 0x410(0x08)
	struct U*4e414a2e3e* VehicleStanceWidget; // 0x418(0x08)
	struct U*3cf39d4672* MortarCanvasWidget; // 0x420(0x08)
	struct U*242c96ca93* TeamInfoListWidget; // 0x428(0x08)
	struct UWidgetSwitcher* TeamListSwitcher; // 0x430(0x08)
	struct USpacer* TeamListMatchResultSpacer; // 0x438(0x08)
	struct U*27dad970eb* ObserverTeamInfoList; // 0x440(0x08)
	struct FVector2D *0330b99164; // 0x448(0x08)
	struct FVector2D *7104ce5a2f; // 0x450(0x08)
	struct FVector2D *384b8f1879; // 0x458(0x08)
	struct FVector2D *f8df439025; // 0x460(0x08)
	bool *8ba10494fe; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
};

// Class TslGame.*ff16e8a65d
// Size: 0x478 (Inherited: 0x470)
struct U*ff16e8a65d : U*f78ed0a974 {
	struct U*7762a61952* FBRClassSelectGuideOuterBox; // 0x470(0x08)

	void OnToggleClassSelectWidgetVisibility(); // Function TslGame.*ff16e8a65d.OnToggleClassSelectWidgetVisibility // Final|Native|Public // @ game+0x58260e0
	void OnMatchStateChanged(); // Function TslGame.*ff16e8a65d.OnMatchStateChanged // Final|Native|Public // @ game+0x582170c
};

// Class TslGame.*d02a596308
// Size: 0x498 (Inherited: 0x410)
struct U*d02a596308 : U*bc854bc287 {
	char pad_410[0xc]; // 0x410(0x0c)
	enum class ELeaningState CurrentLeanState; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	float *12e9baaa14; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct FText DistanceTextFormat; // 0x428(0x18)
	struct UTextBlock* RangeFinderText; // 0x440(0x08)
	struct FText ScanningTimerText; // 0x448(0x18)
	struct UClass* *fb3e9109e0; // 0x460(0x08)
	struct UVerticalBox* SpottingInfoVerticalBox; // 0x468(0x08)
	struct UHorizontalBox* StandardCrosshair; // 0x470(0x08)
	struct UImage* CrosshairActive; // 0x478(0x08)
	struct UOverlay* DistanceToTarget; // 0x480(0x08)
	struct UOverlay* Overlay_ScanningAll; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)

	void GetScanningPercent(); // Function TslGame.*d02a596308.GetScanningPercent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581a05c
	void *2498508cc6(); // Function TslGame.*d02a596308.*2498508cc6 // Final|Native|Public // @ game+0x58315f8
	void GetScanningInProgressVisibility(); // Function TslGame.*d02a596308.GetScanningInProgressVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581a02c
	void SetRangeFinderTextVisibility(); // Function TslGame.*d02a596308.SetRangeFinderTextVisibility // Final|Native|Public // @ game+0x582ecb8
	void GetScanningInterruptedVisibility(); // Function TslGame.*d02a596308.GetScanningInterruptedVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581a044
	void GetScanningVisibility(); // Function TslGame.*d02a596308.GetScanningVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581a074
};

// Class TslGame.*fa4431ffac
// Size: 0x550 (Inherited: 0x410)
struct U*fa4431ffac : U*bc854bc287 {
	char pad_410[0xc0]; // 0x410(0xc0)
	float *249c975513; // 0x4d0(0x04)
	char pad_4D4[0x64]; // 0x4d4(0x64)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x538(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x540(0x08)
	char pad_548[0x8]; // 0x548(0x08)

	TScriptInterface<struct U*e63b4ff431> CallOnAttachmentFocused(); // Function TslGame.*fa4431ffac.CallOnAttachmentFocused // Final|Native|Protected // @ game+0x59223b0
	void OnChildSlotRefreshFocus(); // Function TslGame.*fa4431ffac.OnChildSlotRefreshFocus // Native|Protected // @ game+0x581ea44
	void CallOnWeaponEquipmentFocused(TScriptInterface<struct U*ff30135362> Param1); // Function TslGame.*fa4431ffac.CallOnWeaponEquipmentFocused // Final|Native|Protected // @ game+0x74873c
	TScriptInterface<struct U*ff30135362> *2c56dc29db(TScriptInterface<struct U*e63b4ff431> Param3); // Function TslGame.*fa4431ffac.*2c56dc29db // Final|Native|Protected // @ game+0x59221a8
};

// Class TslGame.*4ee7c0850b
// Size: 0x550 (Inherited: 0x550)
struct U*4ee7c0850b : U*fa4431ffac {
};

// Class TslGame.*056307e37a
// Size: 0x550 (Inherited: 0x550)
struct U*056307e37a : U*4ee7c0850b {
};

// Class TslGame.*b7c2565143
// Size: 0x490 (Inherited: 0x410)
struct U*b7c2565143 : U*bc854bc287 {
	struct TMap<int32, struct F*ad71ef7f84> *3260c04c93; // 0x410(0x50)
	struct UTextBlock* NameText; // 0x460(0x08)
	struct UImage* BackgroundL; // 0x468(0x08)
	struct UImage* BackgroundR; // 0x470(0x08)
	struct UImage* AdditiveL; // 0x478(0x08)
	struct UImage* AdditiveR; // 0x480(0x08)
	struct U*54cc75d10f* ShowAnim; // 0x488(0x08)
};

// Class TslGame.*fa999346ec
// Size: 0x478 (Inherited: 0x410)
struct U*fa999346ec : U*bc854bc287 {
	struct F*f90b3e2b9a *f323043827; // 0x410(0x28)
	struct F*f90b3e2b9a *99867c76c1; // 0x438(0x28)
	char pad_460[0x18]; // 0x460(0x18)

	void FadeIn(); // Function TslGame.*fa999346ec.FadeIn // Event|Public|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.TslWebBrowserWidget
// Size: 0x4b0 (Inherited: 0x410)
struct UTslWebBrowserWidget : U*bc854bc287 {
	struct UButton* FullModeButton; // 0x410(0x08)
	struct UButton* WindowModeButton; // 0x418(0x08)
	struct F*2c79402f19 WebBrowserWidgetBinder; // 0x420(0x20)
	struct F*06751c9d06 ScreenModeSwitcherBinder; // 0x440(0x28)
	struct F*7c50600f8f WebBrowserBorderBinder; // 0x468(0x30)
	struct FVector2D WindowModePosition; // 0x498(0x08)
	struct FVector2D WindowModeScale; // 0x4a0(0x08)
	char pad_4A8[0x8]; // 0x4a8(0x08)

	void OnLoadURL(); // Function TslGame.TslWebBrowserWidget.OnLoadURL // Final|Native|Public // @ game+0x58210b8
	void OnPopup(); // Function TslGame.TslWebBrowserWidget.OnPopup // Final|Native|Public|BlueprintCallable // @ game+0x5823484
	void *af73260685(); // Function TslGame.TslWebBrowserWidget.*af73260685 // Final|Native|Public // @ game+0x5828c1c
	void *4a32afcdc4(); // Function TslGame.TslWebBrowserWidget.*4a32afcdc4 // Final|Native|Public // @ game+0x5823364
	void OnWindowMode(); // Function TslGame.TslWebBrowserWidget.OnWindowMode // Final|Native|Public // @ game+0x5828308
	void OnFullMode(); // Function TslGame.TslWebBrowserWidget.OnFullMode // Final|Native|Public // @ game+0x582020c
};

// Class TslGame.*f80693807f
// Size: 0x468 (Inherited: 0x410)
struct U*f80693807f : U*bc854bc287 {
	char pad_410[0x50]; // 0x410(0x50)
	struct U*82060c40c9* WebView; // 0x460(0x08)

	void IsReuse(); // Function TslGame.*f80693807f.IsReuse // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b858
	struct FWebPopupParam UpdateWebPopup(); // Function TslGame.*f80693807f.UpdateWebPopup // Final|Native|Public|BlueprintCallable // @ game+0x5831e2c
	void SetLayout(float X, float Width); // Function TslGame.*f80693807f.SetLayout // Final|Native|Public|BlueprintCallable // @ game+0x582e228
	void SetWebPopupVisibility(); // Function TslGame.*f80693807f.SetWebPopupVisibility // Final|Native|Public|BlueprintCallable // @ game+0x582f654
	void OnUpdateWebPopup(); // Function TslGame.*f80693807f.OnUpdateWebPopup // Event|Public|BlueprintEvent // @ game+0x2cd4ac
	void GetSaveWebPopupParam(); // Function TslGame.*f80693807f.GetSaveWebPopupParam // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5819fb8
	void IsWebPopupShow(); // Function TslGame.*f80693807f.IsWebPopupShow // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b8c8
	void CloseWebPopup(); // Function TslGame.*f80693807f.CloseWebPopup // Final|Native|Public|BlueprintCallable // @ game+0x581836c
	void SetReuse(); // Function TslGame.*f80693807f.SetReuse // Final|Native|Public|BlueprintCallable // @ game+0x582ef04
	void UpdateURLAndWidget(); // Function TslGame.*f80693807f.UpdateURLAndWidget // Event|Public|HasOutParms|BlueprintEvent // @ game+0x2cd4ac
};

// Class TslGame.*afa041a7e8
// Size: 0x468 (Inherited: 0x410)
struct U*afa041a7e8 : U*bc854bc287 {
	struct UCanvasPanel* OutsidePanel; // 0x410(0x08)
	struct UWidgetSwitcher* FocusSwitcher; // 0x418(0x08)
	struct UOverlay* TargetImageOverlay; // 0x420(0x08)
	struct UImage* TargetImage; // 0x428(0x08)
	struct U*54cc75d10f* InitAnim; // 0x430(0x08)
	struct U*54cc75d10f* FadeOutForSelected; // 0x438(0x08)
	struct U*54cc75d10f* FadeOutForNonSelected; // 0x440(0x08)
	int32 NonFocusedWidgetIndex; // 0x448(0x04)
	int32 FocusedWidgetIndex; // 0x44c(0x04)
	int32 EmptyWidgetIndex; // 0x450(0x04)
	float *e300655552; // 0x454(0x04)
	float *61cff4d50a; // 0x458(0x04)
	float *bd7ea71f37; // 0x45c(0x04)
	char pad_460[0x8]; // 0x460(0x08)

	struct U*f1aea91345* DoAction(); // Function TslGame.*afa041a7e8.DoAction // Native|Public|BlueprintCallable // @ game+0x5818ee4
	void IsShowDescriptionText(); // Function TslGame.*afa041a7e8.IsShowDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b888
	void IsEmpty(); // Function TslGame.*afa041a7e8.IsEmpty // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b780
	void DoActionInLobby(struct U*f1aea91345* WheelContext); // Function TslGame.*afa041a7e8.DoActionInLobby // Native|Public|BlueprintCallable // @ game+0x5818f8c
	void SetEmpty(); // Function TslGame.*afa041a7e8.SetEmpty // Native|Public|BlueprintCallable // @ game+0x582dd10
	void GetNameText(); // Function TslGame.*afa041a7e8.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5819e14
	void SetFocus(); // Function TslGame.*afa041a7e8.SetFocus // Final|Native|Public|BlueprintCallable // @ game+0x582df88
	void PlaySelectAnimation(); // Function TslGame.*afa041a7e8.PlaySelectAnimation // Native|Public|BlueprintCallable // @ game+0x58285b8
	void GetDescriptionText(); // Function TslGame.*afa041a7e8.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58198c0
};

// Class TslGame.*c71ef70ebb
// Size: 0x4e8 (Inherited: 0x468)
struct U*c71ef70ebb : U*afa041a7e8 {
	struct FString ActionNamePrefix; // 0x468(0x10)
	struct FLinearColor EnbleImageColor; // 0x478(0x10)
	struct FLinearColor DisableImageColor; // 0x488(0x10)
	char pad_498[0x50]; // 0x498(0x50)

	void GetNameText(); // Function TslGame.*c71ef70ebb.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5819e14
	struct U*f1aea91345* DoAction(); // Function TslGame.*c71ef70ebb.DoAction // Native|Public|BlueprintCallable // @ game+0x5818ee4
	void IsShowDescriptionText(); // Function TslGame.*c71ef70ebb.IsShowDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581b888
	void GetDescriptionText(); // Function TslGame.*c71ef70ebb.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58198c0
	struct U*f1aea91345* DoActionInLobby(); // Function TslGame.*c71ef70ebb.DoActionInLobby // Native|Public|BlueprintCallable // @ game+0x5818f8c
};

// Class TslGame.*0e1c8af5c5
// Size: 0x4c8 (Inherited: 0x468)
struct U*0e1c8af5c5 : U*afa041a7e8 {
	struct UTextBlock* StackCountText; // 0x468(0x08)
	struct U*54cc75d10f* FadeOutForNonSelected_NoItem; // 0x470(0x08)
	struct FLinearColor UnusableItemImageColor; // 0x478(0x10)
	struct FLinearColor UsableItemImageColor; // 0x488(0x10)
	struct FLinearColor UnusableItemNameColor; // 0x498(0x10)
	struct FLinearColor UsableItemNameColor; // 0x4a8(0x10)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct FName ItemID; // 0x4c0(0x08)

	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*0e1c8af5c5.OnDefaultITem_AsyncLoadIconFinished // Final|Native|Private // @ game+0x581f368
	void DoAction(struct U*f1aea91345* Context); // Function TslGame.*0e1c8af5c5.DoAction // Native|Public|BlueprintCallable // @ game+0x5818ee4
	void UpdateItemImage(); // Function TslGame.*0e1c8af5c5.UpdateItemImage // Final|Native|Public // @ game+0x581f368
	void GetNameText(); // Function TslGame.*0e1c8af5c5.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5819e14
	void GetStackCount(); // Function TslGame.*0e1c8af5c5.GetStackCount // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581a2e8
	void PlaySelectAnimation(); // Function TslGame.*0e1c8af5c5.PlaySelectAnimation // Native|Public|BlueprintCallable // @ game+0x58285b8
	void *671ff34c98(); // Function TslGame.*0e1c8af5c5.*671ff34c98 // Final|Native|Public // @ game+0x581bdf0
	void GetDescriptionText(); // Function TslGame.*0e1c8af5c5.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x58198c0
};

// Class TslGame.*c100cb8413
// Size: 0x4e0 (Inherited: 0x4c8)
struct U*c100cb8413 : U*0e1c8af5c5 {
	struct FText CannotUseItemText; // 0x4c8(0x18)

	void GetStackCount(); // Function TslGame.*c100cb8413.GetStackCount // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x581a2e8
	void DoAction(struct U*f1aea91345* Context); // Function TslGame.*c100cb8413.DoAction // Native|Protected|BlueprintCallable // @ game+0x5818ee4
};

// Class TslGame.*a553050b6f
// Size: 0x4e0 (Inherited: 0x4c8)
struct U*a553050b6f : U*0e1c8af5c5 {
	struct FText CannotUseItemText; // 0x4c8(0x18)

	struct U*f1aea91345* DoAction(); // Function TslGame.*a553050b6f.DoAction // Native|Protected|BlueprintCallable // @ game+0x5818ee4
};

// Class TslGame.*f309d240ac
// Size: 0x4e0 (Inherited: 0x4c8)
struct U*f309d240ac : U*0e1c8af5c5 {
	struct FText CannotEquipItemText; // 0x4c8(0x18)

	void GetStackCount(); // Function TslGame.*f309d240ac.GetStackCount // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x581a2e8
	void DoAction(struct U*f1aea91345* Context); // Function TslGame.*f309d240ac.DoAction // Native|Protected|BlueprintCallable // @ game+0x5818ee4
};

// Class TslGame.*6c3e86cbdd
// Size: 0x4c8 (Inherited: 0x468)
struct U*6c3e86cbdd : U*afa041a7e8 {
	float Radius; // 0x468(0x04)
	float RadiusOffsetWhenSelected; // 0x46c(0x04)
	struct FName RotationMaterialParameter; // 0x470(0x08)
	struct UImage* FocusedImage; // 0x478(0x08)
	struct UImage* NonFocusedImage; // 0x480(0x08)
	struct USizeBox* FocusedSizeBox; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
	struct F*50d9c84bf6 *dbe0cc99b6; // 0x498(0x28)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	void GetNameText(); // Function TslGame.*6c3e86cbdd.GetNameText // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5819e14
	struct U*f1aea91345* DoAction(); // Function TslGame.*6c3e86cbdd.DoAction // Native|Protected|BlueprintCallable // @ game+0x5818ee4
};

// Class TslGame.*be96eb9332
// Size: 0x498 (Inherited: 0x410)
struct U*be96eb9332 : U*bc854bc287 {
	struct UOverlay* ImageOverlay; // 0x410(0x08)
	struct UImage* Img_Icon; // 0x418(0x08)
	struct U*54cc75d10f* Anim_FocusOn; // 0x420(0x08)
	struct U*54cc75d10f* Anim_FocusOff; // 0x428(0x08)
	struct U*54cc75d10f* Anim_FocusOnTextColor; // 0x430(0x08)
	struct U*54cc75d10f* Anim_FocusOffTextColor; // 0x438(0x08)
	struct U*54cc75d10f* Anim_AlphaStrong_1; // 0x440(0x08)
	struct U*54cc75d10f* Anim_AlphaStrong_2; // 0x448(0x08)
	struct U*54cc75d10f* Anim_AlphaWeak_1; // 0x450(0x08)
	struct U*54cc75d10f* Anim_AlphaWeak_2; // 0x458(0x08)
	char pad_460[0x20]; // 0x460(0x20)
	struct UImage* Img_CheckIcon; // 0x480(0x08)
	struct UTextBlock* Text_ItemName; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
};

// Class TslGame.*a41721aad3
// Size: 0x518 (Inherited: 0x498)
struct U*a41721aad3 : U*be96eb9332 {
	struct UBorder* Bdr_Volume; // 0x498(0x08)
	struct UTextBlock* Txt_Volume; // 0x4a0(0x08)
	struct USizeBox* Szb_SlotNum; // 0x4a8(0x08)
	struct USizeBox* Szb_SlotNum_2; // 0x4b0(0x08)
	struct UTextBlock* TxtSlotNum; // 0x4b8(0x08)
	struct UTextBlock* Txt_SlotNum_2; // 0x4c0(0x08)
	char pad_4C8[0x20]; // 0x4c8(0x20)
	float EquippedSlotAlpha; // 0x4e8(0x04)
	struct FLinearColor UnUsableItemColor; // 0x4ec(0x10)
	char pad_4FC[0xc]; // 0x4fc(0x0c)
	struct FName ItemID; // 0x508(0x08)
	bool *8a614222d8; // 0x510(0x01)
	bool *2c94136b01; // 0x511(0x01)
	char pad_512[0x6]; // 0x512(0x06)

	void UpdateItemImage(); // Function TslGame.*a41721aad3.UpdateItemImage // Final|Native|Public // @ game+0x581f37c
	void GetStackCount(); // Function TslGame.*a41721aad3.GetStackCount // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x581a310
	void *671ff34c98(); // Function TslGame.*a41721aad3.*671ff34c98 // Final|Native|Public // @ game+0x581be04
	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*a41721aad3.OnDefaultITem_AsyncLoadIconFinished // Final|Native|Private // @ game+0x581f37c
};

// Class TslGame.*805f5861ab
// Size: 0x478 (Inherited: 0x410)
struct U*805f5861ab : U*bc854bc287 {
	struct UVerticalBox* info_VerticalBox; // 0x410(0x08)
	struct TArray<struct U*041b9ea7fc*> *ee5af49778; // 0x418(0x10)
	struct U*041b9ea7fc* *fd82ac9b36; // 0x428(0x08)
	struct TArray<struct U*ae089a2b31*> *f36dafb27e; // 0x430(0x10)
	struct FMulticastDelegate OnClickTeleportButton; // 0x440(0x10)
	struct FMulticastDelegate OnHoverTeleportButton; // 0x450(0x10)
	struct FMulticastDelegate OnUnHoverTeleportButton; // 0x460(0x10)
	struct U*23f39cac98* *bb76f12034; // 0x470(0x08)

	void OnBtnClicked(); // Function TslGame.*805f5861ab.OnBtnClicked // Final|Native|Protected|BlueprintCallable // @ game+0x581df0c
	void *05d495f80e(); // Function TslGame.*805f5861ab.*05d495f80e // Final|Native|Public // @ game+0x581b624
	void OnBtnHovered(); // Function TslGame.*805f5861ab.OnBtnHovered // Final|Native|Protected|BlueprintCallable // @ game+0x581e054
	void OnBtnHoverEnded(); // Function TslGame.*805f5861ab.OnBtnHoverEnded // Final|Native|Protected|BlueprintCallable // @ game+0x581dfb0
};

// Class TslGame.*53fcadf8fa
// Size: 0x570 (Inherited: 0x410)
struct U*53fcadf8fa : U*bc854bc287 {
	struct U*6d61b1a01a* RespawnTimerUpdater; // 0x410(0x08)
	struct U*6d61b1a01a* TimeLimitTimerUpdater; // 0x418(0x08)
	struct F*8c7bdcaa93 RespawnTimeTextBinder; // 0x420(0x20)
	struct F*8c7bdcaa93 TimeLimitTextBinder; // 0x440(0x20)
	struct TArray<struct F*b1a0bce7e4> TeamValueImageBinders; // 0x460(0x10)
	struct TArray<struct F*8c7bdcaa93> TeamValueTextBinders; // 0x470(0x10)
	struct TArray<struct F*8c7bdcaa93> TeamMemberCountTextBinders; // 0x480(0x10)
	struct F*7c50600f8f GameStatusMessageBorder_Binder; // 0x490(0x30)
	struct F*72b0194904 VSFadeInAnimation_Binder; // 0x4c0(0x20)
	struct F*72b0194904 VSFadeOutAnimation_Binder; // 0x4e0(0x20)
	struct F*8c7bdcaa93 UpperTargetScoreText_Binder; // 0x500(0x20)
	struct FName ColorParamName; // 0x520(0x08)
	struct FName GaugeParamName; // 0x528(0x08)
	bool bUseRespawnTimer; // 0x530(0x01)
	bool bUseTimeLimitTimer; // 0x531(0x01)
	bool bUseAnimOnMatchStart; // 0x532(0x01)
	bool bPlayGaugeAnim; // 0x533(0x01)
	float GaugeAnimSpeed; // 0x534(0x04)
	float GaugeAnimTime; // 0x538(0x04)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct TArray<struct FLinearColor> TeamColors; // 0x540(0x10)
	char pad_550[0x20]; // 0x550(0x20)

	void OnModeStarted(); // Function TslGame.*53fcadf8fa.OnModeStarted // Native|Protected|HasOutParms // @ game+0x5821d28
	void OnMatchStarted(); // Function TslGame.*53fcadf8fa.OnMatchStarted // Native|Protected // @ game+0x58214c0
	void OnHighEnemyScoreChanged(); // Function TslGame.*53fcadf8fa.OnHighEnemyScoreChanged // Native|Protected // @ game+0x582064c
	void OnMyTeamScoreChanged(); // Function TslGame.*53fcadf8fa.OnMyTeamScoreChanged // Native|Protected // @ game+0x58225d0
	void OnResetLevel(); // Function TslGame.*53fcadf8fa.OnResetLevel // Native|Protected // @ game+0x58241b8
	void OnMyGainScoreChanged(); // Function TslGame.*53fcadf8fa.OnMyGainScoreChanged // Native|Protected // @ game+0x5822378
	void OnTimeLimitUpdated(); // Function TslGame.*53fcadf8fa.OnTimeLimitUpdated // Native|Protected // @ game+0x5825ce0
	struct FString OnRespawnTimeUpdated(); // Function TslGame.*53fcadf8fa.OnRespawnTimeUpdated // Native|Protected // @ game+0x58241d0
	void OnModeInitialized(); // Function TslGame.*53fcadf8fa.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x5821bec
	void OnMyTeamRankChanged(); // Function TslGame.*53fcadf8fa.OnMyTeamRankChanged // Native|Protected // @ game+0x58224ac
};

// Class TslGame.BRTwoTeamScoreboardWidget
// Size: 0x588 (Inherited: 0x570)
struct UBRTwoTeamScoreboardWidget : U*53fcadf8fa {
	char pad_570[0x18]; // 0x570(0x18)
};

// Class TslGame.CustomTwoTeamScoreboardWidget
// Size: 0x5b0 (Inherited: 0x570)
struct UCustomTwoTeamScoreboardWidget : U*53fcadf8fa {
	struct F*8c7bdcaa93 TargetScoreTextBinder; // 0x570(0x20)
	struct FText TargetScoreText; // 0x590(0x18)
	char pad_5A8[0x8]; // 0x5a8(0x08)

	void OnMyTeamScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamScoreChanged // Native|Protected // @ game+0x58225d0
	void OnModeStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeStarted // Native|Protected|HasOutParms // @ game+0x5821d28
	void OnMyGainScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyGainScoreChanged // Native|Protected // @ game+0x5822378
	void OnMatchStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMatchStarted // Native|Protected // @ game+0x58214c0
	void OnResetLevel(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnResetLevel // Native|Protected // @ game+0x58241b8
	void OnHighEnemyScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnHighEnemyScoreChanged // Native|Protected // @ game+0x582064c
	void OnTimeLimitUpdated(struct FString Param0); // Function TslGame.CustomTwoTeamScoreboardWidget.OnTimeLimitUpdated // Native|Protected // @ game+0x5825ce0
	struct FString ShowInstantRespawnMessage(); // Function TslGame.CustomTwoTeamScoreboardWidget.ShowInstantRespawnMessage // Final|Native|Protected // @ game+0x582fa8c
	void OnModeInitialized(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x5821bec
	void OnMyTeamRankChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamRankChanged // Native|Protected // @ game+0x58224ac
	void OnRespawnTimeUpdated(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnRespawnTimeUpdated // Native|Protected // @ game+0x58241d0
};

// Class TslGame.ConquestModeWidget
// Size: 0x640 (Inherited: 0x5b0)
struct UConquestModeWidget : UCustomTwoTeamScoreboardWidget {
	struct UClass* *7c53241741; // 0x5b0(0x08)
	struct UClass* *ab2c33d1d4; // 0x5b8(0x08)
	struct F*f90b3e2b9a *8259f9f7bc; // 0x5c0(0x28)
	struct F*f90b3e2b9a *84f0fb488a; // 0x5e8(0x28)
	bool *fd2f3fb117; // 0x610(0x01)
	char pad_611[0x7]; // 0x611(0x07)
	struct FString *e0de371bd1; // 0x618(0x10)
	struct TArray<struct U*7e20e1635c*> *1c8ab245bf; // 0x628(0x10)
	struct U*7e20e1635c* *893b1858b2; // 0x638(0x08)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.ConquestModeWidget.OnActivatedCaptureAreaUpdated // Final|Native|Private|HasOutParms // @ game+0x581d4d8
};

// Class TslGame.*7c16def0f7
// Size: 0x5e0 (Inherited: 0x5b0)
struct U*7c16def0f7 : UCustomTwoTeamScoreboardWidget {
	struct F*aad5c0ee0d *d94425c261; // 0x5b0(0x28)
	char pad_5D8[0x8]; // 0x5d8(0x08)

	void OnMyTeamScoreChanged(); // Function TslGame.*7c16def0f7.OnMyTeamScoreChanged // Native|Protected // @ game+0x58225d0
	void OnModeInitialized(); // Function TslGame.*7c16def0f7.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x5821bec
	void OnHighEnemyScoreChanged(); // Function TslGame.*7c16def0f7.OnHighEnemyScoreChanged // Native|Protected // @ game+0x582064c
	void OnMatchStarted(); // Function TslGame.*7c16def0f7.OnMatchStarted // Native|Protected // @ game+0x58214c0
};

// Class TslGame.*3d1416104b
// Size: 0x630 (Inherited: 0x5b0)
struct U*3d1416104b : UCustomTwoTeamScoreboardWidget {
	struct F*8c7bdcaa93 *78dfbf0af4; // 0x5b0(0x20)
	struct F*8c7bdcaa93 *b4702cf2a6; // 0x5d0(0x20)
	struct F*72b0194904 *100b559779; // 0x5f0(0x20)
	struct F*72b0194904 *61b8356925; // 0x610(0x20)

	void OnMyTeamScoreChanged(); // Function TslGame.*3d1416104b.OnMyTeamScoreChanged // Native|Protected // @ game+0x58225d0
	void OnModeInitialized(); // Function TslGame.*3d1416104b.OnModeInitialized // Final|Native|Protected|HasOutParms // @ game+0x5821bec
	void *72b611c94b(); // Function TslGame.*3d1416104b.*72b611c94b // Final|Native|Protected // @ game+0x5821384
	void OnMyGainScoreChanged(); // Function TslGame.*3d1416104b.OnMyGainScoreChanged // Native|Protected // @ game+0x5822378
	void OnMatchStarted(); // Function TslGame.*3d1416104b.OnMatchStarted // Native|Protected // @ game+0x58214c0
	void OnHighEnemyScoreChanged(); // Function TslGame.*3d1416104b.OnHighEnemyScoreChanged // Native|Protected // @ game+0x582064c
};

// Class TslGame.*05eb96bd21
// Size: 0x5c0 (Inherited: 0x570)
struct U*05eb96bd21 : U*53fcadf8fa {
	char pad_570[0x28]; // 0x570(0x28)
	struct F*1e5151c8f2 TimeLimitTimerSizeBoxBinder; // 0x598(0x20)
