// AnimBlueprintGeneratedClass CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C
// Size: 0x8b5c (Inherited: 0x590)
struct UCharProxy_AnimBP_Lobby_C : U*d7809ba37f {
	struct F*a3d8ff36c0 UberGraphFrame; // 0x590(0x08)
	struct FAnimNode_SaveCachedPose _d826cd49b9_CF4C69E94D4584561F0E05BD3E8362E5; // 0x598(0xe0)
	struct FAnimNode_SequencePlayer _a45188d31a_88CAAB864B27793D6A4FEA9278275EBA; // 0x678(0x70)
	struct FAnimNode_SaveCachedPose _d826cd49b9_88EF657744D7CD0A7FDC0899BF7388B1; // 0x6e8(0xe0)
	struct FAnimNode_CopyBone _54fda8b895_64036C624695CCAE871C91A12B7E4BD6; // 0x7c8(0x130)
	struct FAnimNode_CopyBone _54fda8b895_9A2FC77A4F553199FE35D8B9FB312960; // 0x8f8(0x130)
	char pad_A28[0x8]; // 0xa28(0x08)
	struct FAnimNode_Fabrik _dce8f9c39d_217FCB10470A39214309EBB1129EC727; // 0xa30(0x1a0)
	struct FAnimNode_CopyBone _54fda8b895_825C3AE34510DAC702F38299520320E5; // 0xbd0(0x130)
	struct FAnimNode_Fabrik _dce8f9c39d_50E1CCC144ED9B7CFB3C1890CBA2E662; // 0xd00(0x1a0)
	struct FAnimNode_CopyBone _54fda8b895_94E5E49E48018345AB9C488D9EB44172; // 0xea0(0x130)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_1F1853924178BAEA6BEACCB192D84949; // 0xfd0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_E5C510214B9D93BD292810BFE2F603D1; // 0x1018(0x48)
	struct FAnimNode_LayeredBoneBlend _4f723ecd32_C2F30D7E4BD89239D23E298DD1729B77; // 0x1060(0xf8)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_8FC1604343ED2A23C11EAEB5261125E0; // 0x1158(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_5432A2504DCB7C5C33D17E850B0953B1; // 0x11a0(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_FE57F22747D2CBE68A6B6C8735A0AA7D; // 0x11e8(0x128)
	struct FAnimNode_SaveCachedPose _d826cd49b9_406BD3B743A02018F5ECE0B6152CF4CC; // 0x1310(0xe0)
	struct FAnimNode_UseCachedPose _7b0dbf9361_21B205254447B5FE68F94B84047A1376; // 0x13f0(0x50)
	struct FAnimNode_UseCachedPose _7b0dbf9361_203D8C8B449C7B836D3E24B6FE69D850; // 0x1440(0x50)
	struct FAnimNode_BlendListByEnum _c967cb65d9_044C21FF45F8C9135ED72E90A1317ACF; // 0x1490(0xe0)
	struct FAnimNode_SaveCachedPose _d826cd49b9_D52F2FC34283A3A47745B6B886AFFBB0; // 0x1570(0xe0)
	struct FAnimNode_UseCachedPose _7b0dbf9361_7E97E81B42424702F70AC7A0BE1DAC7B; // 0x1650(0x50)
	struct FAnimNode_UseCachedPose _7b0dbf9361_7A7BFE2C46B8961489CB07A5A54B844B; // 0x16a0(0x50)
	struct FAnimNode_UseCachedPose _7b0dbf9361_13BC291546E37382B9421CB005024781; // 0x16f0(0x50)
	struct FAnimNode_UseCachedPose _7b0dbf9361_4FEB3CBB4993C735E5697B9ABA86D593; // 0x1740(0x50)
	struct FAnimNode_UseCachedPose _7b0dbf9361_7EF5FE2D4969E9806EE6038352FFCA29; // 0x1790(0x50)
	struct FAnimNode_UseCachedPose _7b0dbf9361_D1F2A2F94C6F6B4125EA27959FC98302; // 0x17e0(0x50)
	struct FAnimNode_CopyBone _54fda8b895_24E7A2C345D59A37751D55ACF23B7355; // 0x1830(0x130)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_074320674063AC07AB26F283D6D78E58; // 0x1960(0x48)
	struct FAnimNode_BlendListByEnum _c967cb65d9_341CAEF947395CE8613E1AA1A1B0CEB9; // 0x19a8(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_50CC758845EBAE09DFE0FFA151BC45A3; // 0x1a88(0x128)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_F55B74BC41101BEBCB2E1FB32E00F62E; // 0x1bb0(0x108)
	char pad_1CB8[0x8]; // 0x1cb8(0x08)
	struct FAnimNode_TransitionResult _960cca1422_BFBC4F03438CEF46794AF49E56D43629; // 0x1cc0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_5C591DE54F0AB6A9C9ADEEB4FDDC4C62; // 0x1d40(0x80)
	struct FAnimNode_TransitionResult _960cca1422_B23A39644DB5ECB2C2CC0A9BBA7BD3B7; // 0x1dc0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_B4789EB84B94BAF324DEDE8E04D6F50B; // 0x1e40(0x80)
	struct FAnimNode_TransitionResult _960cca1422_1B9B424241FB104B11A537B7349DA4C7; // 0x1ec0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_3DA5C7214658D193C32CA1B3EDEC5B06; // 0x1f40(0x80)
	struct FAnimNode_TransitionResult _960cca1422_6C54ABE943792943229ED3BBDF7F1710; // 0x1fc0(0x80)
	struct FTslAnimNode_BlendListRandom _51bff8a4ac_F9E266B24579866CA50116A9A5AEEC44; // 0x2040(0x120)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_531BEF47483A967D265BCEA41B76213F; // 0x2160(0x100)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_EFB7997B46EBC25E4A13AF9813CAED41; // 0x2260(0x100)
	struct FAnimNode_Root _71c7874a20_A5965D5342D8C33B8E9E9393808FB6FD4; // 0x2360(0x48)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_4DC5C840461193E66E77CAA5D42AA989; // 0x23a8(0x100)
	struct FTslAnimNode_BlendListRandom _51bff8a4ac_BCA660E54BEA71CAFED51B83EAB5A330; // 0x24a8(0x120)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_B2157E35433CD1DB30B5C2A23D8766D0; // 0x25c8(0x100)
	struct FAnimNode_Root _71c7874a20_A5965D5342D8C33B8E9E9393808FB6FD3; // 0x26c8(0x48)
	struct FTslAnimNode_BlendListRandom _51bff8a4ac_5FEBC6E944AAE906A6EF128E81217A23; // 0x2710(0x120)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_B40256D5470A10C97DE212BD7C2CEE7D; // 0x2830(0x100)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_9466048A4DE0D1C40429FD8213399D1E; // 0x2930(0x100)
	struct FAnimNode_Root _71c7874a20_A5965D5342D8C33B8E9E9393808FB6FD2; // 0x2a30(0x48)
	struct FTslAnimNode_BlendListRandom _51bff8a4ac_B028C4E545C7A16ACA23A68B6D3132EA; // 0x2a78(0x120)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_65B850774C53532B188729B969A51945; // 0x2b98(0x100)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_D61C21E745C13E71CA53A8B5899F55FF; // 0x2c98(0x100)
	struct FAnimNode_Root _71c7874a20_A5965D5342D8C33B8E9E9393808FB6FD; // 0x2d98(0x48)
	struct FAnimNode_StateMachine _7e9575cc82_42B4671A4DA1A6449F28E6BF77BB3235; // 0x2de0(0xe0)
	struct FAnimNode_BlendListByBool _058792f8b8_DE260CEA407C68776D9118B2960C17E9; // 0x2ec0(0xd0)
	struct FAnimNode_AnimDynamics _67233be70e_FC292CB34C9D970E666EF9B7433D62D3; // 0x2f90(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_631C88D546201C974F742CB8806E8F09; // 0x32d8(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_E9C191E14BB06C296AAC56B0AB1FA6BF; // 0x3620(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_5991C3C04B715B36A0D33080B66FBECE; // 0x3968(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_01099A7D4A5ABA33AFBA468333D3C0E6; // 0x3cb0(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_5AC0BDB14D2A3D1267886E90B77FE3C8; // 0x3ff8(0x348)
	struct FAnimNode_ModifyBone _cac7fc2d7b_138D096848F6627DCB3C9496E0576FF0; // 0x4340(0x140)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_B60838F74D3948F45299BAA39E5A42CA; // 0x4480(0x48)
	struct FAnimNode_LayeredBoneBlend _4f723ecd32_E4F411C2440952ED340FA18691589094; // 0x44c8(0xf8)
	struct FAnimNode_UseCachedPose _7b0dbf9361_6C5CC2124BFDF72A2E770B838AB7F6EE; // 0x45c0(0x50)
	struct FAnimNode_ModifyBone _cac7fc2d7b_BD6709DD4B5C02B97A30ADA130680965; // 0x4610(0x140)
	struct FAnimNode_ModifyBone _cac7fc2d7b_32A421124D76CB4FA4D07B8B33404E2F; // 0x4750(0x140)
	struct FAnimNode_UseCachedPose _7b0dbf9361_CBC1D0164B60BC6744CC67A7498B6C73; // 0x4890(0x50)
	struct FAnimNode_SaveCachedPose _d826cd49b9_DEE412844DF63DD57177199BCCB4D6C7; // 0x48e0(0xe0)
	struct FAnimNode_AnimDynamics _67233be70e_A84BCBEA47A42CFCC1746B9714A69C80; // 0x49c0(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_9CE93AA14E65AE0F24AC659FCD3CDBB6; // 0x4d08(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_784B5B1A4FE48049FF3706AADCE816F3; // 0x5050(0x348)
	struct FAnimNode_AnimDynamics _67233be70e_241AE0874FD9B2E6CFF20FBFA731C9BB; // 0x5398(0x348)
	struct FAnimNode_TransitionResult _960cca1422_FA965ABC4906726969ADD0A14685AD69; // 0x56e0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_6FAC51FB4A405AA0DC0E8D96ABC32B6A2; // 0x5760(0x80)
	struct FAnimNode_TransitionResult _960cca1422_915F95424427296F0AAADD9FB790FE83; // 0x57e0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_B28D304546719889502F7196BE77331D; // 0x5860(0x80)
	struct FAnimNode_TransitionResult _960cca1422_54A1ECA440D695B718577896DAEEBBBA2; // 0x58e0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_86E328FB4B206EC863D5D591E9897A00; // 0x5960(0x80)
	struct FAnimNode_TransitionResult _960cca1422_1C59F71F453844EB762D33AA424B55452; // 0x59e0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_3EFFBC214A9720912CFDC49CC91959332; // 0x5a60(0x80)
	struct FAnimNode_BlendListByBool _058792f8b8_CEAE086E4AAF55A25A971A8A6E0A51AB; // 0x5ae0(0xd0)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_E7CF370F476AC0343A63FD8AE576BD03; // 0x5bb0(0x100)
	struct FTslAnimNode_LobbyAnimSequence _3bdce431ca_32512A324DCFB6BB202AB391A5D72368; // 0x5cb0(0x100)
	struct FAnimNode_Root _71c7874a20_FF4764054176C39B518808A6ADE577B52; // 0x5db0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_50319A28442CEC6A66F09AAA1CF432E74; // 0x5df8(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_4C9B2CCE4DB510CFA8E9CD9B5715C2FE4; // 0x5e40(0x48)
	struct FAnimNode_ModifyBone _cac7fc2d7b_27EF191A40B139062F7EE1B35E0F58534; // 0x5e88(0x140)
	struct FAnimNode_SequencePlayer _a45188d31a_26AC071F48330830E366B3ABF71512414; // 0x5fc8(0x70)
	struct FAnimNode_Slot _62fffa045d_4D78DCDC49DAE824B3D93692F28215C94; // 0x6038(0x70)
	struct FAnimNode_Slot _62fffa045d_92BF24D7422E4FF37C7292874E8128C44; // 0x60a8(0x70)
	struct FAnimNode_Root _71c7874a20_45540D0F4B3D1253461381A0E82115014; // 0x6118(0x48)
	struct FAnimNode_SequencePlayer _a45188d31a_B669BF064CA73609C8747CBC24DFFA67; // 0x6160(0x70)
	struct FAnimNode_Root _71c7874a20_FF4764054176C39B518808A6ADE577B5; // 0x61d0(0x48)
	struct FAnimNode_UseCachedPose _7b0dbf9361_09EDA3AB4B94830C91DD21B77FC031A22; // 0x6218(0x50)
	struct FAnimNode_Root _71c7874a20_FC5FEA4E4757AF43D7DA82B1DAEEA2102; // 0x6268(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_50319A28442CEC6A66F09AAA1CF432E73; // 0x62b0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_4C9B2CCE4DB510CFA8E9CD9B5715C2FE3; // 0x62f8(0x48)
	struct FAnimNode_ModifyBone _cac7fc2d7b_27EF191A40B139062F7EE1B35E0F58533; // 0x6340(0x140)
	struct FAnimNode_SequencePlayer _a45188d31a_26AC071F48330830E366B3ABF71512413; // 0x6480(0x70)
	struct FAnimNode_Slot _62fffa045d_4D78DCDC49DAE824B3D93692F28215C93; // 0x64f0(0x70)
	struct FAnimNode_Slot _62fffa045d_92BF24D7422E4FF37C7292874E8128C43; // 0x6560(0x70)
	struct FAnimNode_Root _71c7874a20_45540D0F4B3D1253461381A0E82115013; // 0x65d0(0x48)
	struct FAnimNode_StateMachine _7e9575cc82_B1B8D05047C0276E40EC4982E8DCD52A; // 0x6618(0xe0)
	struct FAnimNode_SaveCachedPose _d826cd49b9_1ACF15E14242FCF6F35B54AD108C5E4D; // 0x66f8(0xe0)
	struct FAnimNode_SequencePlayer _a45188d31a_8CEB5EA94DE47DD2F9566D9864274BC1; // 0x67d8(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_BC8D319540A5FD23C5CA519E8C2FFA0D; // 0x6848(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_FF5F1D0D4999D3FC20A9ABBDD916501E; // 0x68b8(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_60D457F0437BD0941E743F97374335F4; // 0x6928(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_7E444141446032D2C667E3B21195FB53; // 0x6998(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_DB5FD9AC41A1DAD6D3BA2581D0A1FA47; // 0x6a08(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_CFCF09BC463F7C0AC6A052A0EB3DA6AD; // 0x6a78(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_04EA736E43AC456809982C905F923F52; // 0x6ae8(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_6735DA1E474C3C86505F22BF5AD37830; // 0x6b58(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_276D5CDF43F85F28142267B089375167; // 0x6bc8(0x70)
	struct FAnimNode_UseCachedPose _7b0dbf9361_911A5BF94D7FA7D6B7D58297CEF93149; // 0x6c38(0x50)
	struct FAnimNode_BlendListByEnum _c967cb65d9_7DD4DF2E4EE51B857C8F8BBA6ADD08B0; // 0x6c88(0xe0)
	struct FAnimNode_SequencePlayer _a45188d31a_1656669B4874480FB29CDFB13B3CD70A; // 0x6d68(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_80285FE6415E1F8AA30E20833DB065D9; // 0x6dd8(0x70)
	struct FAnimNode_BlendListByEnum _c967cb65d9_A50437FC42EBAFCE394BF6B0A50A57E2; // 0x6e48(0xe0)
	struct FAnimNode_SequencePlayer _a45188d31a_8AE019434ED53F35CBE569BF7BDBC106; // 0x6f28(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_8097202E431F22442C132CB2787BD89C; // 0x6f98(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_C3833E7F4F5CED3C7DCF5385E0BFE33C; // 0x7008(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_FB62FE64461BE757B0AE46ADF7A89846; // 0x7078(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_B9A3525842BD3F4643465E837BC5CF25; // 0x70e8(0x70)
	struct FAnimNode_SequencePlayer _a45188d31a_5BADF3934F89E31A13AF35B7DCD53ADB; // 0x7158(0x70)
	struct FAnimNode_ModifyBone _cac7fc2d7b_5E3ABB2C4E9D2985FEC1F488B82FCDAE; // 0x71c8(0x140)
	struct FAnimNode_ModifyBone _cac7fc2d7b_FEA8B3D149C4B3B618DE0383CBA83AA2; // 0x7308(0x140)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_FCA71DF74C9B773E1FD33894805C13E3; // 0x7448(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_FCE886B747B29D71AC155396740EE00F; // 0x7490(0x48)
	struct FAnimNode_Slot _62fffa045d_C8F683404625884F8E8AE9A27A9734DF; // 0x74d8(0x70)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_A82C87964E007C995C759E83380AF31E; // 0x7548(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_B59033A5418D48C01076F7A3B5B106D5; // 0x7590(0x48)
	struct FAnimNode_ModifyBone _cac7fc2d7b_1D1CA2534076BB63036E7BAEF0890DA8; // 0x75d8(0x140)
	struct FAnimNode_SequencePlayer _a45188d31a_6FB1B25F441949792EAF7297B5A9F6F8; // 0x7718(0x70)
	struct FAnimNode_Root _71c7874a20_ECA888DC474579B07A7A538D114E450F; // 0x7788(0x48)
	struct FAnimNode_StateMachine _7e9575cc82_D1629A9C4B2B3F0A270D3A8F9B1B49DB; // 0x77d0(0xe0)
	struct FAnimNode_BlendListByBool _058792f8b8_E5B455314B0E7A963136ADB1325A9C73; // 0x78b0(0xd0)
	struct FAnimNode_BlendListByBool _058792f8b8_BAF75A8C4BA4186C9A32348BB7C178FB; // 0x7980(0xd0)
	struct FAnimNode_TransitionResult _960cca1422_6FAC51FB4A405AA0DC0E8D96ABC32B6A; // 0x7a50(0x80)
	struct FAnimNode_TransitionResult _960cca1422_54A1ECA440D695B718577896DAEEBBBA; // 0x7ad0(0x80)
	struct FAnimNode_TransitionResult _960cca1422_1C59F71F453844EB762D33AA424B5545; // 0x7b50(0x80)
	struct FAnimNode_TransitionResult _960cca1422_3EFFBC214A9720912CFDC49CC9195933; // 0x7bd0(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_50319A28442CEC6A66F09AAA1CF432E72; // 0x7c50(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_4C9B2CCE4DB510CFA8E9CD9B5715C2FE2; // 0x7c98(0x48)
	struct FAnimNode_ModifyBone _cac7fc2d7b_27EF191A40B139062F7EE1B35E0F58532; // 0x7ce0(0x140)
	struct FAnimNode_SequencePlayer _a45188d31a_26AC071F48330830E366B3ABF71512412; // 0x7e20(0x70)
	struct FAnimNode_Slot _62fffa045d_4D78DCDC49DAE824B3D93692F28215C92; // 0x7e90(0x70)
	struct FAnimNode_Slot _62fffa045d_92BF24D7422E4FF37C7292874E8128C42; // 0x7f00(0x70)
	struct FAnimNode_Root _71c7874a20_45540D0F4B3D1253461381A0E82115012; // 0x7f70(0x48)
	struct FAnimNode_UseCachedPose _7b0dbf9361_09EDA3AB4B94830C91DD21B77FC031A2; // 0x7fb8(0x50)
	struct FAnimNode_Root _71c7874a20_FC5FEA4E4757AF43D7DA82B1DAEEA210; // 0x8008(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_50319A28442CEC6A66F09AAA1CF432E7; // 0x8050(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace _e121cf2f14_4C9B2CCE4DB510CFA8E9CD9B5715C2FE; // 0x8098(0x48)
	struct FAnimNode_ModifyBone _cac7fc2d7b_27EF191A40B139062F7EE1B35E0F5853; // 0x80e0(0x140)
	struct FAnimNode_SequencePlayer _a45188d31a_26AC071F48330830E366B3ABF7151241; // 0x8220(0x70)
	struct FAnimNode_Slot _62fffa045d_4D78DCDC49DAE824B3D93692F28215C9; // 0x8290(0x70)
	struct FAnimNode_Slot _62fffa045d_92BF24D7422E4FF37C7292874E8128C4; // 0x8300(0x70)
	struct FAnimNode_Root _71c7874a20_45540D0F4B3D1253461381A0E8211501; // 0x8370(0x48)
	struct FAnimNode_StateMachine _7e9575cc82_9238ABF042E23C01C64A8D880F3647F7; // 0x83b8(0xe0)
	struct FAnimNode_BlendListByBool _058792f8b8_C22BA17245EC1D050A9F718CD37E7CF8; // 0x8498(0xd0)
	struct FAnimNode_SaveCachedPose _d826cd49b9_1E1549A447D1ECEC05AB4589265BC7C4; // 0x8568(0xe0)
	struct FAnimNode_UseCachedPose _7b0dbf9361_EC6B2F94473BC89ACF93B78762136834; // 0x8648(0x50)
	struct FAnimNode_UseCachedPose _7b0dbf9361_078A9AE648E163E90FF886A02FB9D860; // 0x8698(0x50)
	struct FAnimNode_AnimDynamics _67233be70e_5B80091E43E07138708FE7A8A0BFEFB0; // 0x86e8(0x348)
	struct FAnimNode_Root _e47e69fd28_8D65CA8E4C2DF91736AC45B7731017E9; // 0x8a30(0x48)
	enum class EAnimWeaponType AnimWeaponType; // 0x8a78(0x01)
	char pad_8A79[0x7]; // 0x8a79(0x07)
	struct UBlendSpaceBase* GripBlendspace; // 0x8a80(0x08)
	float BlendTime; // 0x8a88(0x04)
	struct FVector PistolOffset; // 0x8a8c(0x0c)
	float GripType; // 0x8a98(0x04)
	float BlinkAlpha; // 0x8a9c(0x04)
	enum class EWeaponClass WeaponClassEnum; // 0x8aa0(0x01)
	char pad_8AA1[0x3]; // 0x8aa1(0x03)
	float LH_GripIndex; // 0x8aa4(0x04)
	struct UBlendSpaceBase* LH_GripBS; // 0x8aa8(0x08)
	bool IsLobbyReady; // 0x8ab0(0x01)
	char pad_8AB1[0x3]; // 0x8ab1(0x03)
	struct FVector Wind; // 0x8ab4(0x0c)
	struct FVector InitialWind; // 0x8ac0(0x0c)
	char pad_8ACC[0x4]; // 0x8acc(0x04)
	struct UCurveFloat* Curve; // 0x8ad0(0x08)
	struct FVector AxisFix; // 0x8ad8(0x0c)
	char pad_8AE4[0x4]; // 0x8ae4(0x04)
	struct UCurveFloat* LobbyAdjust; // 0x8ae8(0x08)
	struct UAnimSequence* AnimWeapon_Default; // 0x8af0(0x08)
	struct UAnimSequence* AnimWeapon_Pistol; // 0x8af8(0x08)
	struct UAnimSequence* AnimWeapon_SR; // 0x8b00(0x08)
	struct UAnimSequence* AnimWeapon_Shotgun; // 0x8b08(0x08)
	struct UAnimSequence* AnimWeapon_SMG; // 0x8b10(0x08)
	struct UAnimSequence* AnimWeapon_LMG; // 0x8b18(0x08)
	struct UAnimSequence* AnimWeapon_Melee; // 0x8b20(0x08)
	struct UAnimSequence* AnimWeapon_DMR; // 0x8b28(0x08)
	struct UAnimSequence* AnimWeapon_Carbine; // 0x8b30(0x08)
	struct UAnimSequence* AnimWeapon_Rifle; // 0x8b38(0x08)
	float AdjustedIKLH; // 0x8b40(0x04)
	char pad_8B44[0x4]; // 0x8b44(0x04)
	struct UAnimSequence* AnimUnarmed; // 0x8b48(0x08)
	float AdjustedIKRH; // 0x8b50(0x04)
	float AD_BlendIn; // 0x8b54(0x04)
	enum class EThrownWeaponType ThrownClass; // 0x8b58(0x01)
	bool bUseBlink; // 0x8b59(0x01)
	bool IsSetLobbyPose; // 0x8b5a(0x01)
	bool Trigger_ToggleReady; // 0x8b5b(0x01)

	void ProcessLobbyCharacter(); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.ProcessLobbyCharacter // Public|BlueprintCallable|BlueprintEvent // @ game+0x21d2c4
	void UpdateBlink(); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.UpdateBlink // Public|BlueprintCallable|BlueprintEvent // @ game+0x21d2c4
	void GetAnimWeaponType(); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.GetAnimWeaponType // Public|HasOutParms|BlueprintCallable|BlueprintEvent // @ game+0x21d2c4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CharProxy_AnimBP_Lobby_*960cca1422_54A1ECA440D695B718577896DAEEBBBA_1(); // Function CharProxy_AnimBP_Lobby.CharProxy_AnimBP_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CharProxy_AnimBP_Lobby_*960cca1422_54A1ECA440D695B718577896DAEEBBBA_1 // BlueprintEvent // @ game+0x21d2c4
