// ScriptStruct MapStatCollector.*f632a24688
// Size: 0x48 (Inherited: 0x00)
struct F*f632a24688 {
	struct FName Name; // 0x00(0x08)
	struct FBox2D SamplingArea; // 0x08(0x14)
	char pad_1C[0x4]; // 0x1c(0x04)
	double GroundHeight; // 0x20(0x08)
	double PointInterval; // 0x28(0x08)
	double RayDistance; // 0x30(0x08)
	double HeightOffset; // 0x38(0x08)
	double SearchRadius; // 0x40(0x08)
};

// ScriptStruct MapStatCollector.*2fd8311450
// Size: 0x20 (Inherited: 0x00)
struct F*2fd8311450 {
	struct FString MapName; // 0x00(0x10)
	struct FString *9e3cca3f84; // 0x10(0x10)
};

// ScriptStruct MapStatCollector.*0c8baf364c
// Size: 0x20 (Inherited: 0x00)
struct F*0c8baf364c {
	struct FString StatName; // 0x00(0x10)
	struct FString *8fb2fdb09d; // 0x10(0x10)
};

