// Class Slate.*19feb309fb
// Size: 0x2e0 (Inherited: 0x38)
struct U*19feb309fb : USlateWidgetStyleContainerBase {
	struct F*7bb05e3554 ButtonStyle; // 0x38(0x2a8)
};

// Class Slate.*0d3ab5b90e
// Size: 0x618 (Inherited: 0x38)
struct U*0d3ab5b90e : USlateWidgetStyleContainerBase {
	struct F*d23c67e4c5 *d23c67e4c5; // 0x38(0x5e0)
};

// Class Slate.*43bf326b33
// Size: 0x460 (Inherited: 0x38)
struct U*43bf326b33 : USlateWidgetStyleContainerBase {
	struct F*14d43d58b2 *14d43d58b2; // 0x38(0x428)
};

// Class Slate.*fe311bd2e5
// Size: 0x418 (Inherited: 0x38)
struct U*fe311bd2e5 : USlateWidgetStyleContainerBase {
	struct F*f8636f39a1 *f8636f39a1; // 0x38(0x3e0)
};

// Class Slate.*81d8a2bc60
// Size: 0x8a8 (Inherited: 0x38)
struct U*81d8a2bc60 : USlateWidgetStyleContainerBase {
	struct F*7051df995c *7051df995c; // 0x38(0x870)
};

// Class Slate.*1c1e664bc9
// Size: 0x280 (Inherited: 0x38)
struct U*1c1e664bc9 : USlateWidgetStyleContainerBase {
	struct F*543a4cf75e *543a4cf75e; // 0x38(0x248)
};

// Class Slate.*3a1931219a
// Size: 0x1f0 (Inherited: 0x38)
struct U*3a1931219a : USlateWidgetStyleContainerBase {
	struct F*d246388505 ProgressBarStyle; // 0x38(0x1b8)
};

// Class Slate.*2975915cf8
// Size: 0x550 (Inherited: 0x38)
struct U*2975915cf8 : USlateWidgetStyleContainerBase {
	struct F*49a6b284e1 *49a6b284e1; // 0x38(0x518)
};

// Class Slate.*2fc792a780
// Size: 0x280 (Inherited: 0x38)
struct U*2fc792a780 : USlateWidgetStyleContainerBase {
	struct F*894106b4cc *894106b4cc; // 0x38(0x248)
};

// Class Slate.SlateSettings
// Size: 0x38 (Inherited: 0x30)
struct USlateSettings : UObject {
	bool bVirtualKeyboardSendsTextChanged; // 0x30(0x01)
	bool bVirtualKeyboardDisplayOnFocus; // 0x31(0x01)
	bool bExplicitCanvasChildZOrder; // 0x32(0x01)
	char pad_33[0x5]; // 0x33(0x05)
};

// Class Slate.*e6b301420d
// Size: 0x348 (Inherited: 0x38)
struct U*e6b301420d : USlateWidgetStyleContainerBase {
	struct F*905149747b *905149747b; // 0x38(0x310)
};

// Class Slate.*e31ba23df1
// Size: 0x240 (Inherited: 0x38)
struct U*e31ba23df1 : USlateWidgetStyleContainerBase {
	struct F*7f8a9226a3 *7f8a9226a3; // 0x38(0x208)
};

