// BlueprintGeneratedClass TslCaptureLobby.TslCaptureLobby_C
// Size: 0x486 (Inherited: 0x400)
struct ATslCaptureLobby_C : ALevelScriptActor {
	struct F*abc8f374e0 UberGraphFrame; // 0x400(0x08)
	struct ALobbyViewMode_C* ViewModeStudio; // 0x408(0x08)
	struct ATslWeapon* TslWeapon; // 0x410(0x08)
	char pad_418[0x8]; // 0x418(0x08)
	struct FTransform UiCameraTM; // 0x420(0x30)
	struct FTransform ViewModeTM; // 0x450(0x30)
	bool bLeft; // 0x480(0x01)
	bool bright; // 0x481(0x01)
	bool bUp; // 0x482(0x01)
	bool bDown; // 0x483(0x01)
	bool AddView; // 0x484(0x01)
	bool MinusView; // 0x485(0x01)

	struct FKey InpActEvt_Backslash_*41702fca2c_26(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Backslash_*41702fca2c_26 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Left_*41702fca2c_25(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*41702fca2c_25 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Left_*41702fca2c_24(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*41702fca2c_24 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Right_*41702fca2c_23(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*41702fca2c_23 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Right_*41702fca2c_22(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*41702fca2c_22 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Up_*41702fca2c_21(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*41702fca2c_21 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Up_*41702fca2c_20(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*41702fca2c_20 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Down_*41702fca2c_19(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*41702fca2c_19 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_Down_*41702fca2c_18(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*41702fca2c_18 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_LeftBracket_*41702fca2c_17(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*41702fca2c_17 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_LeftBracket_*41702fca2c_16(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*41702fca2c_16 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_RightBracket_*41702fca2c_15(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*41702fca2c_15 // BlueprintEvent // @ game+0x2ad9d8
	struct FKey InpActEvt_RightBracket_*41702fca2c_14(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*41702fca2c_14 // BlueprintEvent // @ game+0x2ad9d8
	float ReceiveTick(); // Function TslCaptureLobby.TslCaptureLobby_C.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x2ad9d8
	float ExecuteUbergraph_TslCaptureLobby(); // Function TslCaptureLobby.TslCaptureLobby_C.ExecuteUbergraph_TslCaptureLobby // HasDefaults // @ game+0x2ad9d8
};

