// Class ACLPlugin.ACLStatsDumpCommandlet
// Size: 0x88 (Inherited: 0x88)
struct UACLStatsDumpCommandlet : UCommandlet {
};

// Class ACLPlugin.AnimCompress_ACLAuto
// Size: 0x50 (Inherited: 0x50)
struct UAnimCompress_ACLAuto : UAnimCompress {
};

// Class ACLPlugin.*26ddbcc924
// Size: 0x50 (Inherited: 0x50)
struct U*26ddbcc924 : UAnimCompress {
};

// Class ACLPlugin.*0e53730cf3
// Size: 0x68 (Inherited: 0x50)
struct U*0e53730cf3 : U*26ddbcc924 {
	enum class *7e21892861 *baaeeb7b3d; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	float *dd700f471f; // 0x54(0x04)
	float *ec5e58f59c; // 0x58(0x04)
	float *d51408043a; // 0x5c(0x04)
	float *82ad38d200; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// Class ACLPlugin.*aedc2c2c19
// Size: 0x78 (Inherited: 0x50)
struct U*aedc2c2c19 : U*26ddbcc924 {
	float *dd700f471f; // 0x50(0x04)
	float *ec5e58f59c; // 0x54(0x04)
	enum class *7e21892861 *baaeeb7b3d; // 0x58(0x01)
	enum class *adfeed7711 *a2c4fdf1ee; // 0x59(0x01)
	enum class *4135de9f5f *8fc48140c9; // 0x5a(0x01)
	enum class *4135de9f5f *608910a48e; // 0x5b(0x01)
	float *82ad38d200; // 0x5c(0x04)
	float *ded144e4cc; // 0x60(0x04)
	float *b1d8358d5b; // 0x64(0x04)
	float *fdf3ea6011; // 0x68(0x04)
	char *192d1638c8 : 1; // 0x6c(0x01)
	char *c4391ddb76 : 1; // 0x6c(0x01)
	char *da33a3180d : 1; // 0x6c(0x01)
	char *3611f2a664 : 1; // 0x6c(0x01)
	char *92b533bf0e : 1; // 0x6c(0x01)
	char *171a84b198 : 1; // 0x6c(0x01)
	char *ce9f659792 : 1; // 0x6c(0x01)
	char pad_6C_7 : 1; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	uint16 *65acc98570; // 0x70(0x02)
	uint16 *de2afb68df; // 0x72(0x02)
	char pad_74[0x4]; // 0x74(0x04)
};

