// BlueprintGeneratedClass BP_WeaponDisplay.BP_WeaponDisplay_C
// Size: 0x7c8 (Inherited: 0x650)
struct ABP_WeaponDisplay_C : ATslWeaponDisplay {
	struct F*73a77c28fa UberGraphFrame; // 0x650(0x08)
	struct USkeletalMeshComponent* Weapon Textured Mesh; // 0x658(0x08)
	struct USkeletalMeshComponent* Weapon Cutout Mesh; // 0x660(0x08)
	struct USkeletalMeshComponent* Weapon Hidden Mesh; // 0x668(0x08)
	struct USceneComponent* Weapon Meshes; // 0x670(0x08)
	struct UPostProcessComponent* PostProcess; // 0x678(0x08)
	struct USceneComponent* WeaponHolder; // 0x680(0x08)
	struct UStaticMeshComponent* Sphere; // 0x688(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x690(0x08)
	struct FString Crowbar; // 0x698(0x10)
	bool HasSpawnedWeapon; // 0x6a8(0x01)
	bool LocalTesting; // 0x6a9(0x01)
	bool IsMouseButtonDown; // 0x6aa(0x01)
	bool WasMouseButtonJustReleased; // 0x6ab(0x01)
	bool LastMouseSet; // 0x6ac(0x01)
	char pad_6AD[0x3]; // 0x6ad(0x03)
	float LastMouseX; // 0x6b0(0x04)
	float LastMouseY; // 0x6b4(0x04)
	float MouseDeltaX; // 0x6b8(0x04)
	float MouseDeltaY; // 0x6bc(0x04)
	bool BPUserModified; // 0x6c0(0x01)
	char pad_6C1[0x7]; // 0x6c1(0x07)
	struct UCurveFloat* BPDecayCurveDefault; // 0x6c8(0x08)
	struct UCurveFloat* BPDecayCurveContinousSpin; // 0x6d0(0x08)
	float BPMomentumAccumulationMultiplier; // 0x6d8(0x04)
	float BPDecayTimer; // 0x6dc(0x04)
	float BPDecayTimeInSeconds; // 0x6e0(0x04)
	float BPRotationDirection; // 0x6e4(0x04)
	float BPRotationSpeed; // 0x6e8(0x04)
	float BPRotationDeltaMin; // 0x6ec(0x04)
	float BPRotationDeltaMax; // 0x6f0(0x04)
	bool BPReturningToFace; // 0x6f4(0x01)
	char pad_6F5[0x3]; // 0x6f5(0x03)
	float BPFaceRotationTimer; // 0x6f8(0x04)
	float BPFaceRotationSpeed; // 0x6fc(0x04)
	struct FRotator BPFaceRotationFrom; // 0x700(0x0c)
	struct FRotator BPFaceRotationTo; // 0x70c(0x0c)
	struct FRotator BPFaceRotationRight; // 0x718(0x0c)
	bool BPAutoSpinEnabled; // 0x724(0x01)
	bool BPReturnToFaceEnabled; // 0x725(0x01)
	char pad_726[0x2]; // 0x726(0x02)
	struct FRotator BPFaceRotationLeft; // 0x728(0x0c)
	bool BPOverrideTargetFacing; // 0x734(0x01)
	char pad_735[0x3]; // 0x735(0x03)
	struct FRotator BPFaceRotationDefault; // 0x738(0x0c)
	float BPFaceRotationStep; // 0x744(0x04)
	struct FString Kar98k; // 0x748(0x10)
	float Transition Speed; // 0x758(0x04)
	char pad_75C[0x4]; // 0x75c(0x04)
	struct TArray<struct UCurveFloat*> Transition Curve; // 0x760(0x10)
	struct FString crossbow; // 0x770(0x10)
	struct FString aug; // 0x780(0x10)
	struct FString Mini14; // 0x790(0x10)
	struct FString AWM; // 0x7a0(0x10)
	struct FString AKM; // 0x7b0(0x10)
	bool UserSetMomentum; // 0x7c0(0x01)
	bool AttachmentsLoaded; // 0x7c1(0x01)
	char pad_7C2[0x2]; // 0x7c2(0x02)
	int32 AttachmentIndex; // 0x7c4(0x04)

	void UserConstructionScript(); // Function BP_WeaponDisplay.BP_WeaponDisplay_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x22ddc4
	bool AddStaticMeshAsyncEvent(); // Function BP_WeaponDisplay.BP_WeaponDisplay_C.AddStaticMeshAsyncEvent // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x22ddc4
	struct TArray<struct UAsyncStaticMeshComponent*> ExecuteUbergraph_BP_WeaponDisplay(); // Function BP_WeaponDisplay.BP_WeaponDisplay_C.ExecuteUbergraph_BP_WeaponDisplay // HasDefaults // @ game+0x22ddc4
};

