// Enum ChromaSDKPlugin.EChromaSDKStreamStatusEnum
enum class EChromaSDKStreamStatusEnum : uint8 {
	READY,
	AUTHORIZING,
	BROADCASTING,
	WATCHING,
	NOT_AUTHORIZED,
	BROADCAST_DUPLICATE,
	SERVICE_OFFLINE,
	EChromaSDKStreamStatusEnum_MAX,
};

// Enum ChromaSDKPlugin.*572f130643
enum class *572f130643 : uint8 {
	*bc1d0a36d0,
	*93871aa0b7,
	*5daa474f43,
	*5979db28c6,
	*16884d5c7f,
	*313733b762,
	*631f4811ae,
	*572f130643_MAX,
};

// Enum ChromaSDKPlugin.*75ec846e50
enum class *75ec846e50 : uint8 {
	*6c86169dd4,
	*f444d6e223,
	*09dff9574b,
	*e93d726066,
	*719b687ba1,
	*75ec846e50_MAX,
};

// Enum ChromaSDKPlugin.*2aa86c8692
enum class *2aa86c8692 : uint8 {
	*fbcd6ea956,
	*1bc88f20b9,
	*668243007d,
	*fe24972630,
	*c71576e489,
	*a5827d9e89,
	*bbc1dde0a3,
	*a01f1e4849,
	*c5038750c4,
	*f86483b399,
	*55488251c3,
	*d748059105,
	*0f785d958b,
	*69e8ba82b6,
	*a2a11c6232,
	*c504c3bd90,
	*507d7f87e3,
	*2505b9545f,
	*97a552f627,
	*79983881ee,
	*6e08a8cc23,
	*e09757f5ea,
	*678cabd95a,
	*2aa86c8692_MAX,
};

// Enum ChromaSDKPlugin.*4e3a03301e
enum class *4e3a03301e : uint8 {
	*dbe0de8d16,
	*70c53a6217,
	*32c86e39a6,
	*a3e5facbb0,
	*6e59f78024,
	*7d217f8107,
	*406c9766ac,
	*2396383171,
	*67c009cc28,
	*72b8b5e841,
	*51f1509c81,
	*0642507656,
	*b6f318fded,
	*adbe122271,
	*ecb7801358,
	*55c798240a,
	*370a454454,
	*9f9d56b58d,
	*fafabbae61,
	*128f7e76a7,
	*3330c16645,
	*c35f01246b,
	*19a38e8192,
	*af2f60cd7f,
	*5aa921cc8f,
	*7beddb3530,
	*25c72567e0,
	*953f7bbb67,
	*c1632f7a30,
	*7ad47b0427,
	*0cfcef415c,
	*4cba78c8c3,
	*5de2e4c329,
	*0557da567f,
	*9fa506772e,
	*7374c03431,
	*b538be3732,
	*3207140a82,
	*1ce850f264,
	*0faf6434cd,
	*f6e26bb4b7,
	*58cf7b176f,
	*d88fea7cad,
	*33d8eee3ba,
	*d0963ba999,
	*776b493512,
	*c614f4438a,
	*db8e191d70,
	*28135f5d94,
	*c29c1628c6,
	*3b6543d989,
	*d5189a7366,
	*63952589d5,
	*a438604086,
	*1b284049a2,
	*055a07980d,
	*7e32d5d9f1,
	*99b621e1bc,
	*d3dd712cdf,
	*50cdcba3bd,
	*0460afb391,
	*8bc6a5b05e,
	*a2f41676a6,
	*1e517cd6be,
	*159d57a664,
	*c87000e765,
	*9c53f9859a,
	*d9ab1b1163,
	*7fae30d113,
	*1073d531d9,
	*8da772a37c,
	*bc5bb28a57,
	*024bacfae1,
	*d814cd8fec,
	*a55631283a,
	*395f81f3c0,
	*4533fa858b,
	*4a4a680d8a,
	*fe71fffcff,
	*c6872316c5,
	*81b6f43360,
	*8d0a069c5c,
	*03f860b2ce,
	*f882fce92a,
	*dce03587ff,
	*7ef5678939,
	*bca449d8bf,
	*a1b39b3f02,
	*18658c1d47,
	*71fdcc29af,
	*cba281cc5c,
	*2d8eab8dcb,
	*77aa5a34d9,
	*30d16dbf46,
	*c3cdb3f943,
	*8d729d75b7,
	*d12247d6d6,
	*1806db6347,
	*e04571b139,
	*2592060ac2,
	*b55a0726d9,
	*f34d3ab480,
	*0decd22104,
	*442f02bede,
	*dbda96cdc7,
	*74911b5679,
	*ea93a54bc4,
	*bda355d8bc,
	*dbf5e83bd5,
	*a4f83756a9,
	*6f756f3266,
	*0791a4db51,
	*aeea5b8ddf,
	*a0189f1d20,
	*6254268aa7,
	*126b3969c7,
	*7669598f8d,
	*4bb13746a1,
	*87d0346d67,
	*ed6882fff3,
	*a418c8207e,
	*089b7a411d,
	*4d543ed220,
	*293291b7ab,
	*14cd77f08d,
	*168c1a6014,
	*4e3a03301e_MAX,
};

// Enum ChromaSDKPlugin.*c3ca10c38b
enum class *c3ca10c38b : uint8 {
	*117b1b120d,
	*98443ec1c5,
	*1d662dab74,
	*e5876e7e2c,
	*521c3c997b,
	*f048c5b96d,
	*53cd50fd88,
	*c3ca10c38b_MAX,
};

// Enum ChromaSDKPlugin.*1d408e54ba
enum class *1d408e54ba : uint8 {
	*1d662dab74,
	*e5876e7e2c,
	*521c3c997b,
	*53cd50fd88,
	*1d408e54ba_MAX,
};

// Enum ChromaSDKPlugin.*9dd53779bd
enum class *9dd53779bd : uint8 {
	*117b1b120d,
	*98443ec1c5,
	*f048c5b96d,
	*53cd50fd88,
	*9dd53779bd_MAX,
};

// Enum ChromaSDKPlugin.*e89c982d6a
enum class *e89c982d6a : uint8 {
	*49b6a8bcc4,
	*0bc93860aa,
	*53cd50fd88,
	*e89c982d6a_MAX,
};

// ScriptStruct ChromaSDKPlugin.*fa2ed9bea3
// Size: 0x10 (Inherited: 0x00)
struct F*fa2ed9bea3 {
	struct TArray<struct F*d39aab3db1> Effects; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*d39aab3db1
// Size: 0x38 (Inherited: 0x00)
struct F*d39aab3db1 {
	struct FString Animation; // 0x00(0x10)
	bool State; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	int32 PrimaryColor; // 0x14(0x04)
	int32 SecondaryColor; // 0x18(0x04)
	int32 Speed; // 0x1c(0x04)
	enum class *75ec846e50 Blend; // 0x20(0x01)
	enum class *572f130643 Mode; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct F*8c02e1c0d3 FrameIndex; // 0x28(0x10)
};

// ScriptStruct ChromaSDKPlugin.*8c02e1c0d3
// Size: 0x10 (Inherited: 0x00)
struct F*8c02e1c0d3 {
	struct TArray<int32> *025805ac14; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*8f9c47f309
// Size: 0x48 (Inherited: 0x00)
struct F*8f9c47f309 {
	struct FString Title; // 0x00(0x10)
	struct FString Description; // 0x10(0x10)
	struct FString *d4ca013e81; // 0x20(0x10)
	struct FString *127f818a2a; // 0x30(0x10)
	int32 *d2288a5700; // 0x40(0x04)
	int32 Category; // 0x44(0x04)
};

// ScriptStruct ChromaSDKPlugin.*5f77b2a223
// Size: 0x18 (Inherited: 0x00)
struct F*5f77b2a223 {
	struct TArray<struct F*c4939c1f4c> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*c4939c1f4c
// Size: 0x10 (Inherited: 0x00)
struct F*c4939c1f4c {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
};

// ScriptStruct ChromaSDKPlugin.*d64963fe90
// Size: 0x18 (Inherited: 0x00)
struct F*d64963fe90 {
	struct TArray<struct FLinearColor> Colors; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct ChromaSDKPlugin.*8b82e572d0
// Size: 0x14 (Inherited: 0x00)
struct F*8b82e572d0 {
	int32 Result; // 0x00(0x04)
	struct F*d12c13cd08 EffectId; // 0x04(0x10)
};

// ScriptStruct ChromaSDKPlugin.*d12c13cd08
// Size: 0x10 (Inherited: 0x00)
struct F*d12c13cd08 {
	char pad_0[0x10]; // 0x00(0x10)
};

