// Class Engine.Actor
// Size: 0x408 (Inherited: 0x30)
struct AActor : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x40(0x10)
	struct FMulticastDelegate OnClicked; // 0x50(0x10)
	char pad_60_0 : 3; // 0x60(0x01)
	char *6a29209afc : 1; // 0x60(0x01)
	char pad_60_4 : 4; // 0x60(0x01)
	char pad_61_0 : 1; // 0x61(0x01)
	char *6583edce58 : 1; // 0x61(0x01)
	char bReplicates : 1; // 0x61(0x01)
	char pad_61_3 : 5; // 0x61(0x01)
	char pad_62[0x6]; // 0x62(0x06)
	struct FName *332fd811ca; // 0x68(0x08)
	enum class ENetRole RemoteRole; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct AActor* Owner; // 0x78(0x08)
	struct FRepMovement ReplicatedMovement; // 0x80(0x34)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct F*e5bda3d960 *e3fb0d68ff; // 0xb8(0x40)
	struct FMulticastDelegate OnInputTouchBegin; // 0xf8(0x10)
	struct FMulticastDelegate OnTakeAnyDamage; // 0x108(0x10)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
	struct TArray<struct FName> Tags; // 0x120(0x10)
	struct FGuid DestructibleId; // 0x130(0x10)
	bool bIsDestroyedVersion; // 0x140(0x01)
	bool RemoveFromLevelLOD; // 0x141(0x01)
	char pad_142[0x6]; // 0x142(0x06)
	struct F*2066290a18 PrimaryActorTick; // 0x148(0x58)
	float *ae3e81fc86; // 0x1a0(0x04)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x1a8(0x10)
	char bAutoDestroyWhenFinished : 1; // 0x1b8(0x01)
	char bCanBeDamaged : 1; // 0x1b8(0x01)
	char *50cd51ed38 : 1; // 0x1b8(0x01)
	char *e002b42072 : 1; // 0x1b8(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x1b8(0x01)
	char *a4c704a3e5 : 1; // 0x1b8(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x1b8(0x01)
	char *13aea9b43a : 1; // 0x1b8(0x01)
	char *4211b886bf : 1; // 0x1b9(0x01)
	char pad_1B9_1 : 7; // 0x1b9(0x01)
	char pad_1BA[0x6]; // 0x1ba(0x06)
	struct FMulticastDelegate OnTakePointDamage; // 0x1c0(0x10)
	enum class ENetRole Role; // 0x1d0(0x01)
	char pad_1D1[0x3]; // 0x1d1(0x03)
	struct UChildActorComponent* *129513d23d; // 0x1d4(0x08)
	char pad_1DC[0x4]; // 0x1dc(0x04)
	struct FMulticastDelegate OnActorEndOverlap; // 0x1e0(0x10)
	enum class EAutoReceiveInput *8606d93d96; // 0x1f0(0x01)
	char pad_1F1[0x3]; // 0x1f1(0x03)
	float NetUpdateFrequency; // 0x1f4(0x04)
	float MinNetUpdateFrequency; // 0x1f8(0x04)
	float InitialLifeSpan; // 0x1fc(0x04)
	char *97cac516e7 : 1; // 0x200(0x01)
	char pad_200_1 : 4; // 0x200(0x01)
	char *cd27b8552b : 1; // 0x200(0x01)
	char *8aabd64ff4 : 1; // 0x200(0x01)
	char *3cd32b903e : 1; // 0x200(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x201(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x202(0x01)
	char pad_203[0x5]; // 0x203(0x05)
	struct TArray<struct AMatineeActor*> *6220728ad0; // 0x208(0x10)
	int32 *2bc7f7749a; // 0x218(0x04)
	char pad_21C[0x1]; // 0x21c(0x01)
	enum class *66c1dada81 InputConsumeOption; // 0x21d(0x01)
	char pad_21E[0xa]; // 0x21e(0x0a)
	struct USceneComponent* RootComponent; // 0x228(0x08)
	struct FMulticastDelegate OnInputTouchEnter; // 0x230(0x10)
	float CustomTimeDilation; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct TArray<struct AActor*> Children; // 0x248(0x10)
	char pad_258[0x8]; // 0x258(0x08)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x260(0x10)
	struct AActor* ParentComponentActor; // 0x270(0x08)
	float NetCullDistanceSquared; // 0x278(0x04)
	char pad_27C[0x54]; // 0x27c(0x54)
	struct FMulticastDelegate OnActorHit; // 0x2d0(0x10)
	int32 *2d89f8ef7f; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct FMulticastDelegate OnInputTouchEnd; // 0x2e8(0x10)
	struct U*63b14265fa* *63b14265fa; // 0x2f8(0x08)
	struct FMulticastDelegate OnEndCursorOver; // 0x300(0x10)
	char bHidden : 1; // 0x310(0x01)
	char *0854a90e26 : 1; // 0x310(0x01)
	char *013332e5c6 : 1; // 0x310(0x01)
	char bOnlyRelevantToOwner : 1; // 0x310(0x01)
	char bAlwaysRelevant : 1; // 0x310(0x01)
	char *9ddfc785f1 : 1; // 0x310(0x01)
	char *05594c4443 : 1; // 0x310(0x01)
	char *ef19f6b6c9 : 1; // 0x310(0x01)
	char *dca9d9a72a : 1; // 0x311(0x01)
	char pad_311_1 : 1; // 0x311(0x01)
	char *16d69885c9 : 1; // 0x311(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x311(0x01)
	char *59968c9633 : 1; // 0x311(0x01)
	char pad_311_5 : 1; // 0x311(0x01)
	char *02848ec998 : 1; // 0x311(0x01)
	char pad_311_7 : 1; // 0x311(0x01)
	char pad_312[0x6]; // 0x312(0x06)
	struct APawn* Instigator; // 0x318(0x08)
	struct TArray<struct FName> Layers; // 0x320(0x10)
	uint64 *f99b84bc94; // 0x330(0x08)
	struct FMulticastDelegate OnInputTouchLeave; // 0x338(0x10)
	float NetPriority; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct FMulticastDelegate OnReleased; // 0x350(0x10)
	char pad_360[0x8]; // 0x360(0x08)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x368(0x10)
	char pad_378[0x60]; // 0x378(0x60)
	struct FMulticastDelegate OnDestroyed; // 0x3d8(0x10)
	struct FMulticastDelegate OnEndPlay; // 0x3e8(0x10)
	char pad_3F8[0x10]; // 0x3f8(0x10)

	void *a80dd65dbf(); // Function Engine.Actor.*a80dd65dbf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1300
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // Native|Protected // @ game+0xc30d48
	void *8df9beeffc(); // Function Engine.Actor.*8df9beeffc // Native|Public|BlueprintCallable // @ game+0x67c1f34
	void *a84ae826d7(); // Function Engine.Actor.*a84ae826d7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67adce4
	void *6f6713dfba(); // Function Engine.Actor.*6f6713dfba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad7a8
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void *c1c64c0f03(); // Function Engine.Actor.*c1c64c0f03 // Native|Public|BlueprintCallable // @ game+0xcdc258
	void *2a43ddf3b4(); // Function Engine.Actor.*2a43ddf3b4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67acb0c
	void *694ac52e11(); // Function Engine.Actor.*694ac52e11 // Final|Native|Public|BlueprintCallable // @ game+0x67b47d8
	void *553025a5b6(); // Function Engine.Actor.*553025a5b6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae6c4
	void *e14d0605bc(); // Function Engine.Actor.*e14d0605bc // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa770
	void *ea2a94b7da(); // Function Engine.Actor.*ea2a94b7da // Final|Native|Public|BlueprintCallable // @ game+0x67b7a58
	void K2_SetActorRelativeLocation(); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b5c04
	void *8ab522db39(); // Function Engine.Actor.*8ab522db39 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aca6c
	void *5c10316bc8(); // Function Engine.Actor.*5c10316bc8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1398
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x654b64
	void K2_AddActorLocalOffset(); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b20a8
	void *f2d13d9497(); // Function Engine.Actor.*f2d13d9497 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aaf64
	void *3dcb8c828c(); // Function Engine.Actor.*3dcb8c828c // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x67aa11c
	void GetOverlappingComponents(); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67af5a8
	void *76b33f89d4(); // Function Engine.Actor.*76b33f89d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0538
	void *bf3d34531f(); // Function Engine.Actor.*bf3d34531f // Final|Native|Public|BlueprintCallable // @ game+0x67c3704
	void *e13072354b(); // Function Engine.Actor.*e13072354b // Final|Native|Public|BlueprintCallable // @ game+0x6f2fcc
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x67b4670
	void AddTickPrerequisiteActor(); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x67a32b4
	void K2_AddActorWorldTransform(); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b2a34
	void *7fc2785714(); // Function Engine.Actor.*7fc2785714 // Native|Public|BlueprintCallable // @ game+0x67b96f4
	void GetActorBounds(); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa330
	void K2_SetActorRotation(); // Function Engine.Actor.K2_SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x7d29f4
	void K2_SetActorRelativeTransform(); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b5fb4
	void *eda0f1fdef(); // Function Engine.Actor.*eda0f1fdef // Final|Native|Public|BlueprintCallable // @ game+0x67c25b4
	void *2cfa65e375(); // Function Engine.Actor.*2cfa65e375 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa4d8
	void K2_AddActorWorldOffset(); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b2684
	void *34c6511ade(); // Function Engine.Actor.*34c6511ade // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae5fc
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0xc56b64
	void K2_AttachRootComponentToActor(); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x67b3d30
	void HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xaaf328
	void K2_SetActorRelativeRotation(); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b5ddc
	void *ca2fce53c9(); // Function Engine.Actor.*ca2fce53c9 // Final|Native|Public|BlueprintCallable // @ game+0x67b4030
	void *1f7d6b60c4(); // Function Engine.Actor.*1f7d6b60c4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa97c
	void ReceivePointDamage(); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22ddc4
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void K2_SetActorTransform(); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b61e0
	void *d30428cd54(); // Function Engine.Actor.*d30428cd54 // Final|Native|Public|BlueprintCallable // @ game+0x67c249c
	void *7af955f165(); // Function Engine.Actor.*7af955f165 // Native|Public|BlueprintCallable // @ game+0x67b981c
	void SetActorHiddenInGame(); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x67bc820
	void *12680bdeab(); // Function Engine.Actor.*12680bdeab // Native|Public|BlueprintCallable // @ game+0x67c43f4
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x67aa130
	void *2bbda76e95(); // Function Engine.Actor.*2bbda76e95 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac25c
	void *2f371b4576(); // Function Engine.Actor.*2f371b4576 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x67c1fcc
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x9f5e54
	void DisableInput(); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x67a80ec
	void *a487955527(); // Function Engine.Actor.*a487955527 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4b48
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *7664b363a1(); // Function Engine.Actor.*7664b363a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af738
	void ReceiveActorOnInputTouchEnter(); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void SetActorTickEnabled(); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x67bcbc4
	void K2_AttachRootComponentTo(); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x67b3bb0
	void *2f98c34a3e(); // Function Engine.Actor.*2f98c34a3e // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67aafcc
	void K2_AddActorWorldRotation(); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b285c
	void ActorHasTag(); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67a161c
	void *298b7db98d(); // Function Engine.Actor.*298b7db98d // Final|Native|Public|BlueprintCallable // @ game+0x67b4688
	void *3d2b57891f(); // Function Engine.Actor.*3d2b57891f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac164
	void *8ff8fb0472(); // Function Engine.Actor.*8ff8fb0472 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae3f4
	void ReceiveActorBeginOverlap(); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *094169766b(); // Function Engine.Actor.*094169766b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae614
	void *3b635a9905(); // Function Engine.Actor.*3b635a9905 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bca84
	void *9fc33c71b8(); // Function Engine.Actor.*9fc33c71b8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b12e4
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *17f595f9ac(); // Function Engine.Actor.*17f595f9ac // Final|Native|Public|BlueprintCallable // @ game+0x67b0804
	void ReceiveActorOnInputTouchBegin(); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void K2_SetActorLocation(); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b57e8
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ReceiveActorOnInputTouchEnd(); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ReceiveActorOnInputTouchLeave(); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xb841c8
	void *f77af040ad(); // Function Engine.Actor.*f77af040ad // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67aad68
	void *8e0bd09921(); // Function Engine.Actor.*8e0bd09921 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67accb4
	void K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4c50
	void ReceiveEndPlay(); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *2ad230fb6c(); // Function Engine.Actor.*2ad230fb6c // Final|Native|Public|BlueprintCallable // @ game+0x67bcc58
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0xc89268
	void *58360a298b(); // Function Engine.Actor.*58360a298b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1b14
	void *4aadbb23a5(); // Function Engine.Actor.*4aadbb23a5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af830
	void K2_OnEndViewTarget(); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ReceiveActorEndOverlap(); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *4e14239fe2(); // Function Engine.Actor.*4e14239fe2 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa500
	void AddComponent(); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xb3a898
	void *679babdbe9(); // Function Engine.Actor.*679babdbe9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67b7420
	void *b0466cb89a(); // Function Engine.Actor.*b0466cb89a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa7a4
	void *b01fc0cf78(); // Function Engine.Actor.*b01fc0cf78 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa60c
	void *96888c26b2(); // Function Engine.Actor.*96888c26b2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aaf88
	void *724cefc729(); // Function Engine.Actor.*724cefc729 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0c4c
	void K2_SetActorLocationAndRotation(); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b59cc
	void *3fb2f52d1d(); // Function Engine.Actor.*3fb2f52d1d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad708
	void *7915dcfee8(); // Function Engine.Actor.*7915dcfee8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac34c
	void ReceiveTick(); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *77574d4d00(); // Function Engine.Actor.*77574d4d00 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67c4ad4
	void ReceiveHit(); // Function Engine.Actor.ReceiveHit // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22ddc4
	void K2_AddActorLocalTransform(); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b2458
	void *43eab6a44c(); // Function Engine.Actor.*43eab6a44c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67addd8
	void *d21a3baa7f(); // Function Engine.Actor.*d21a3baa7f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af80c
	void *7952614099(); // Function Engine.Actor.*7952614099 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa954
	void *6d495b918e(); // Function Engine.Actor.*6d495b918e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bcb24
	void *fd605f1fa8(); // Function Engine.Actor.*fd605f1fa8 // Final|Native|Public|BlueprintCallable // @ game+0x67bc788
	void *82b3653b7b(); // Function Engine.Actor.*82b3653b7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0c84
	void K2_OnBecomeViewTarget(); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void SetOwner(); // Function Engine.Actor.SetOwner // Native|Public|BlueprintCallable // @ game+0x5aea00c
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0xc2dbb8
	void *3a00f3bb48(); // Function Engine.Actor.*3a00f3bb48 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0078
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void MakeNoise(); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67b7ad4
	void *ccaa7ce1d0(); // Function Engine.Actor.*ccaa7ce1d0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa93c
	void DetachRootComponentFromParent(); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x67a8058
	void *9ffc398f85(); // Function Engine.Actor.*9ffc398f85 // Native|Public|BlueprintCallable // @ game+0x67a33dc
	void *927c0af560(); // Function Engine.Actor.*927c0af560 // Native|Public|BlueprintCallable // @ game+0x67a9b94
	void *6237fb723e(); // Function Engine.Actor.*6237fb723e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b50d4
	void ReceiveAnyDamage(); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ReceiveRadialDamage(); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22ddc4
	void *28809cb5e5(); // Function Engine.Actor.*28809cb5e5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aa908
	void GetOverlappingActors(); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67af348
	void K2_AddActorLocalRotation(); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b2280
};

// Class Engine.AnimInstance
// Size: 0x3a0 (Inherited: 0x30)
struct UAnimInstance : UObject {
	float DeltaTime; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct USkeleton* *3d26a0f5a9; // 0x38(0x08)
	enum class *70bf4a9cf2 *06b775a106; // 0x40(0x01)
	bool bRunUpdatesInWorkerThreads; // 0x41(0x01)
	bool bCanUseParallelUpdateAnimation; // 0x42(0x01)
	bool *b16fe671be; // 0x43(0x01)
	bool bWarnAboutBlueprintUsage; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x48(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x58(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x68(0x10)
	struct FMulticastDelegate OnMontageInterrupted; // 0x78(0x10)
	struct FMulticastDelegate OnAllMontageInstancesEnded; // 0x88(0x10)
	char pad_98[0x60]; // 0x98(0x60)
	bool *9e5b2e55cd; // 0xf8(0x01)
	char pad_F9[0x9f]; // 0xf9(0x9f)
	struct TArray<struct FAnimNotifyEvent> *e83d212201; // 0x198(0x10)
	char pad_1A8[0x1f8]; // 0x1a8(0x1f8)

	void *1049bf0142(); // Function Engine.AnimInstance.*1049bf0142 // Final|Native|Public|BlueprintCallable // @ game+0x67fb85c
	void *fb3df011d9(); // Function Engine.AnimInstance.*fb3df011d9 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e38b8
	void *ad69a18e5a(); // Function Engine.AnimInstance.*ad69a18e5a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67f0764
	void GetStateWeight(); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67eaea0
	void *d46dc5dc83(); // Function Engine.AnimInstance.*d46dc5dc83 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67fb1c4
	void PlaySlotAnimation(); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x67ff280
	void Montage_Play(); // Function Engine.AnimInstance.Montage_Play // Native|Public|BlueprintCallable // @ game+0x6f33fc
	void *242396e0df(); // Function Engine.AnimInstance.*242396e0df // Native|Public|BlueprintCallable // @ game+0x5a7eb54
	void *0c3e0ee134(); // Function Engine.AnimInstance.*0c3e0ee134 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67eb458
	void *8c0c4894ae(); // Function Engine.AnimInstance.*8c0c4894ae // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67f0e90
	void *691ee180b3(); // Function Engine.AnimInstance.*691ee180b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67fb300
	void *e267668cef(); // Function Engine.AnimInstance.*e267668cef // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e5848
	void *723eae25e1(); // Function Engine.AnimInstance.*723eae25e1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e60b8
	void GetCurrentStateElapsedTime(); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e3818
	void *91ee611ffd(); // Function Engine.AnimInstance.*91ee611ffd // Native|Public|BlueprintCallable // @ game+0x79ecec
	void *e146fc91b1(); // Function Engine.AnimInstance.*e146fc91b1 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e5dc4
	void *057fda6034(); // Function Engine.AnimInstance.*057fda6034 // Final|Native|Public|BlueprintCallable // @ game+0x680f1ac
	void GetAnimAssetPlayerTimeFromEnd(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e1d68
	void *48c662fc37(); // Function Engine.AnimInstance.*48c662fc37 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e67b8
	void *245284edb6(); // Function Engine.AnimInstance.*245284edb6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e566c
	void *f364c6828d(); // Function Engine.AnimInstance.*f364c6828d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e93c4
	void *bf78400b8f(); // Function Engine.AnimInstance.*bf78400b8f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67fb4e0
	void *5eeab7b91c(); // Function Engine.AnimInstance.*5eeab7b91c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67fb124
	void *bca340010a(); // Function Engine.AnimInstance.*bca340010a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67fb260
	void *c5fd55eb88(); // Function Engine.AnimInstance.*c5fd55eb88 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x67f6c88
	void *fd0ea4aa33(); // Function Engine.AnimInstance.*fd0ea4aa33 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e5a0c
	void *ccdbbc4b23(); // Function Engine.AnimInstance.*ccdbbc4b23 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67fb3a0
	void *1ab31cd97b(); // Function Engine.AnimInstance.*1ab31cd97b // Final|Native|Public|BlueprintCallable // @ game+0x6811018
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *3ae29e8bbb(); // Function Engine.AnimInstance.*3ae29e8bbb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67f1418
	void *f61ade023a(); // Function Engine.AnimInstance.*f61ade023a // Final|Native|Public|BlueprintCallable // @ game+0x67fb77c
	void *9b89db3b5d(); // Function Engine.AnimInstance.*9b89db3b5d // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e65a4
	void *058de0418c(); // Function Engine.AnimInstance.*058de0418c // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x514c80
	void *66a3995478(); // Function Engine.AnimInstance.*66a3995478 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67eee3c
	void *899177a2d7(); // Function Engine.AnimInstance.*899177a2d7 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e5490
	void *e8a9ba9091(); // Function Engine.AnimInstance.*e8a9ba9091 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x68170c8
	void *3c7c31cc75(); // Function Engine.AnimInstance.*3c7c31cc75 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e94ac
	void *66f0434692(); // Function Engine.AnimInstance.*66f0434692 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ebb08
	void *5e755e4562(); // Function Engine.AnimInstance.*5e755e4562 // Native|Public|BlueprintCallable // @ game+0x6804328
	void *79ed44711d(); // Function Engine.AnimInstance.*79ed44711d // Final|Native|Public|BlueprintCallable // @ game+0x67fb6ec
	void *ccd070a982(); // Function Engine.AnimInstance.*ccd070a982 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc54294
	void *84bfa05c08(); // Function Engine.AnimInstance.*84bfa05c08 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67d2f40
	void *3ae1a9d556(); // Function Engine.AnimInstance.*3ae1a9d556 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e69c8
	void *f6100f1f77(); // Function Engine.AnimInstance.*f6100f1f77 // Native|Public|BlueprintCallable // @ game+0x8ee3b4
	void *ec3409ea7b(); // Function Engine.AnimInstance.*ec3409ea7b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e3430
	void *905d29ade2(); // Function Engine.AnimInstance.*905d29ade2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcb8014
	void *3080ec9377(); // Function Engine.AnimInstance.*3080ec9377 // Final|Native|Public|BlueprintCallable // @ game+0x67fb65c
	void *8c5198f019(); // Function Engine.AnimInstance.*8c5198f019 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xa0a9fc
	void PlaySlotAnimationAsDynamicMontage(); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x67ff4a4
	void *f36dfe6065(); // Function Engine.AnimInstance.*f36dfe6065 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x44f1d0
	void GetAnimAssetPlayerLength(); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x67e1bf4
	void *0d4faf3909(); // Function Engine.AnimInstance.*0d4faf3909 // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x67f6c88
	void GetAnimAssetPlayerTimeFromEndFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x67e1e6c
	void *24d7f1731e(); // Function Engine.AnimInstance.*24d7f1731e // Final|Native|Public|BlueprintCallable // @ game+0x67fb580
	void *a6e097a5c0(); // Function Engine.AnimInstance.*a6e097a5c0 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e5bd0
	void *07eb4aa7bc(); // Function Engine.AnimInstance.*07eb4aa7bc // Final|Native|Public|BlueprintCallable // @ game+0x67d61e8
	void *d9cbacaeac(); // Function Engine.AnimInstance.*d9cbacaeac // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67e96d8
	void *9687b3535a(); // Function Engine.AnimInstance.*9687b3535a // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xa0ac7c
	void GetAnimAssetPlayerTimeFraction(); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x67e1c88
	void *771de70e87(); // Function Engine.AnimInstance.*771de70e87 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67fb440
	void *53d492fe87(); // Function Engine.AnimInstance.*53d492fe87 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x681dddc
	void BlueprintUpdateAnimation(); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *3b5b96bdbc(); // Function Engine.AnimInstance.*3b5b96bdbc // Final|Native|Public|BlueprintCallable // @ game+0x681c094
};

// Class Engine.ActorComponent
// Size: 0x200 (Inherited: 0x30)
struct UActorComponent : UObject {
	char pad_30[0xf0]; // 0x30(0xf0)
	struct F*64c6f9629b PrimaryComponentTick; // 0x120(0x58)
	struct TArray<struct FName> ComponentTags; // 0x178(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x188(0x10)
	char pad_198_0 : 3; // 0x198(0x01)
	char bReplicates : 1; // 0x198(0x01)
	char bNetAddressable : 1; // 0x198(0x01)
	char *d9de2ce983 : 1; // 0x198(0x01)
	char pad_198_6 : 2; // 0x198(0x01)
	char pad_199[0x1]; // 0x199(0x01)
	char pad_19A_0 : 2; // 0x19a(0x01)
	char bCreatedByConstructionScript : 1; // 0x19a(0x01)
	char bInstanceComponent : 1; // 0x19a(0x01)
	char bAutoActivate : 1; // 0x19a(0x01)
	char *eedbc91ee9 : 1; // 0x19a(0x01)
	char *8016acb0c2 : 1; // 0x19a(0x01)
	char pad_19A_7 : 1; // 0x19a(0x01)
	char pad_19B[0x1]; // 0x19b(0x01)
	struct FGuid DestructibleId; // 0x19c(0x10)
	bool bIsDestroyedVersion; // 0x1ac(0x01)
	char pad_1AD[0x3]; // 0x1ad(0x03)
	char *cb59e077f1 : 1; // 0x1b0(0x01)
	char pad_1B0_1 : 2; // 0x1b0(0x01)
	char bIsEditorOnly : 1; // 0x1b0(0x01)
	char pad_1B0_4 : 4; // 0x1b0(0x01)
	char pad_1B1[0x4]; // 0x1b1(0x04)
	enum class EComponentCreationMethod CreationMethod; // 0x1b5(0x01)
	enum class EPendingCreationType *a029c1f885; // 0x1b6(0x01)
	char pad_1B7[0x9]; // 0x1b7(0x09)
	struct TArray<struct FSimpleMemberReference> *1c5b1ecf7e; // 0x1c0(0x10)
	struct FMulticastDelegate OnComponentActivated; // 0x1d0(0x10)
	struct FMulticastDelegate OnComponentDeactivated; // 0x1e0(0x10)
	char pad_1F0[0x9]; // 0x1f0(0x09)
	char *6583edce58 : 1; // 0x1f9(0x01)
	char pad_1F9_1 : 7; // 0x1f9(0x01)
	char pad_1FA[0x6]; // 0x1fa(0x06)

	void *b3ab644ab0(); // Function Engine.ActorComponent.*b3ab644ab0 // Native|Public|BlueprintCallable // @ game+0x67bd28c
	void *7fc2785714(); // Function Engine.ActorComponent.*7fc2785714 // Native|Public|BlueprintCallable // @ game+0x67b9788
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Final|Native|Public // @ game+0x67b804c
	void AddTickPrerequisiteActor(); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x67a3348
	void Activate(); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0xcdaed0
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0xbef000
	void *7e6bf7eb55(); // Function Engine.ActorComponent.*7e6bf7eb55 // Final|Native|Public|BlueprintCallable // @ game+0x67c0478
	void *eda0f1fdef(); // Function Engine.ActorComponent.*eda0f1fdef // Final|Native|Public|BlueprintCallable // @ game+0x67c264c
	void IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b12bc
	void *7af955f165(); // Function Engine.ActorComponent.*7af955f165 // Native|Public|BlueprintCallable // @ game+0x67b98b0
	void *b6de83bb83(); // Function Engine.ActorComponent.*b6de83bb83 // Native|Public|BlueprintCallable // @ game+0x6246d90
	void ReceiveTick(); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *d30428cd54(); // Function Engine.ActorComponent.*d30428cd54 // Final|Native|Public|BlueprintCallable // @ game+0x67c2528
	void *ef1420b078(); // Function Engine.ActorComponent.*ef1420b078 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac20c
	void *cc59ee805b(); // Function Engine.ActorComponent.*cc59ee805b // Native|Public|BlueprintCallable // @ game+0x67bc694
	void *7664b363a1(); // Function Engine.ActorComponent.*7664b363a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbc99c8
	void *70313663c3(); // Function Engine.ActorComponent.*70313663c3 // Final|Native|Public|BlueprintCallable // @ game+0x67beed8
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *9ffc398f85(); // Function Engine.ActorComponent.*9ffc398f85 // Native|Public|BlueprintCallable // @ game+0x67a3470
	void *65f31f10a3(); // Function Engine.ActorComponent.*65f31f10a3 // Native|Public|BlueprintCallable // @ game+0x67bee40
	void ReceiveEndPlay(); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *db9ec7e456(); // Function Engine.ActorComponent.*db9ec7e456 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b137c
	void *baf5caeb25(); // Function Engine.ActorComponent.*baf5caeb25 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b14f8
	void *298b7db98d(); // Function Engine.ActorComponent.*298b7db98d // Final|Native|Public|BlueprintCallable // @ game+0x67b4720
	void *d920280472(); // Function Engine.ActorComponent.*d920280472 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67a7088
};

// Class Engine.Pawn
// Size: 0x468 (Inherited: 0x408)
struct APawn : AActor {
	char pad_408[0x8]; // 0x408(0x08)
	char bUseControllerRotationPitch : 1; // 0x410(0x01)
	char bUseControllerRotationYaw : 1; // 0x410(0x01)
	char bUseControllerRotationRoll : 1; // 0x410(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x410(0x01)
	char pad_410_4 : 4; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float BaseEyeHeight; // 0x414(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x418(0x01)
	enum class EAutoPossessAI *ae9b8791a2; // 0x419(0x01)
	char pad_41A[0x6]; // 0x41a(0x06)
	struct UClass* AIControllerClass; // 0x420(0x08)
	struct AController* *f127658d48; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
	struct AController* Controller; // 0x438(0x08)
	struct APlayerState* PlayerState; // 0x440(0x08)
	uint16 *015f228c35; // 0x448(0x02)
	char pad_44A[0x6]; // 0x44a(0x06)
	struct FVector *0bd692bd5a; // 0x450(0x0c)
	struct FVector *77f948b8f9; // 0x45c(0x0c)

	void ReceivePossessed(); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void AddControllerRollInput(); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x67a1940
	void *ceaebf3734(); // Function Engine.Pawn.*ceaebf3734 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1a9c
	void AddControllerPitchInput(); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x67a18a4
	void *aea6d1fc21(); // Function Engine.Pawn.*aea6d1fc21 // Final|Native|Public|BlueprintCallable // @ game+0x67be31c
	void *b5c3a53167(); // Function Engine.Pawn.*b5c3a53167 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc4e94c
	void *e777ec86c5(); // Function Engine.Pawn.*e777ec86c5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae69c
	void *f8ca4cbaf3(); // Function Engine.Pawn.*f8ca4cbaf3 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3d568
	void *e6a1adb893(); // Function Engine.Pawn.*e6a1adb893 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0b288
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x5a82544
	void *a90e1eb5c4(); // Function Engine.Pawn.*a90e1eb5c4 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a2ad0
	void *3d498218ec(); // Function Engine.Pawn.*3d498218ec // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab0b4
	void *ff0cdc3443(); // Function Engine.Pawn.*ff0cdc3443 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x67aee20
	void K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67afbbc
	void *3faa338288(); // Function Engine.Pawn.*3faa338288 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67b7678
	void *85e6be51d8(); // Function Engine.Pawn.*85e6be51d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1524
	void AddControllerYawInput(); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x67a19dc
	void ReceiveUnpossessed(); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *a62a63aaf3(); // Function Engine.Pawn.*a62a63aaf3 // Native|Public|BlueprintCallable // @ game+0x67c38e8
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0xa1de88
	void *1d88abf6ea(); // Function Engine.Pawn.*1d88abf6ea // Native|Public|BlueprintCallable // @ game+0x5a06cb4
	void GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac4c4
	void *cd903f5bc1(); // Function Engine.Pawn.*cd903f5bc1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67afbbc
	void *5a325d1f01(); // Function Engine.Pawn.*5a325d1f01 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aef58
	void *3b0d0a8384(); // Function Engine.Pawn.*3b0d0a8384 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a74a0
	void *1dde1276de(); // Function Engine.Pawn.*1dde1276de // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67b8470
	void GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac4f8
};

// Class Engine.DataAsset
// Size: 0x38 (Inherited: 0x30)
struct UDataAsset : UObject {
	struct UClass* *d62375829a; // 0x30(0x08)
};

// Class Engine.SceneComponent
// Size: 0x4d0 (Inherited: 0x200)
struct USceneComponent : UActorComponent {
	struct TArray<struct USceneComponent*> AttachChildren; // 0x200(0x10)
	struct FVector *49e84c2fad; // 0x210(0x0c)
	char pad_21C[0x1c]; // 0x21c(0x1c)
	struct FVector RelativeLocation; // 0x238(0x0c)
	char pad_244_0 : 1; // 0x244(0x01)
	char bReplicatesAttachmentReference : 1; // 0x244(0x01)
	char bReplicatesAttachment : 1; // 0x244(0x01)
	char *9874f81ad0 : 1; // 0x244(0x01)
	char pad_244_4 : 1; // 0x244(0x01)
	char bAbsoluteLocation : 1; // 0x244(0x01)
	char bAbsoluteRotation : 1; // 0x244(0x01)
	char bAbsoluteScale : 1; // 0x244(0x01)
	char bVisible : 1; // 0x245(0x01)
	char bHiddenInGame : 1; // 0x245(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x245(0x01)
	char *131f3529c6 : 1; // 0x245(0x01)
	char bUseAttachParentBound : 1; // 0x245(0x01)
	char bEnableInsensitiveUpdate : 1; // 0x245(0x01)
	char pad_245_6 : 2; // 0x245(0x01)
	char pad_246[0x2a]; // 0x246(0x2a)
	char bAbsoluteTranslation : 1; // 0x270(0x01)
	char pad_270_1 : 7; // 0x270(0x01)
	char pad_271[0x3]; // 0x271(0x03)
	struct APhysicsVolume* PhysicsVolume; // 0x274(0x08)
	char pad_27C[0x64]; // 0x27c(0x64)
	enum class *1d65b135dd DetailMode; // 0x2e0(0x01)
	char pad_2E1[0x2f]; // 0x2e1(0x2f)
	struct FVector RelativeTranslation; // 0x310(0x0c)
	char pad_31C[0x4]; // 0x31c(0x04)
	SetProperty *815e178173; // 0x320(0x50)
	char pad_370[0x1]; // 0x370(0x01)
	enum class EComponentMobility Mobility; // 0x371(0x01)
	char pad_372[0x2]; // 0x372(0x02)
	struct FRotator RelativeRotation; // 0x374(0x0c)
	struct FVector RelativeScale3D; // 0x380(0x0c)
	char pad_38C[0x4]; // 0x38c(0x04)
	struct FName *055f551900; // 0x390(0x08)
	char pad_398[0x8]; // 0x398(0x08)
	struct USceneComponent* AttachParent; // 0x3a0(0x08)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x3a8(0x10)
	struct FMulticastDelegate AttachmentChangedDelegate; // 0x3b8(0x10)
	char pad_3C8[0x108]; // 0x3c8(0x108)

	void K2_AddWorldTransform(); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b3984
	void K2_AddLocalRotation(); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b2e38
	void K2_AddWorldOffset(); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b35d4
	void *24d4692696(); // Function Engine.SceneComponent.*24d4692696 // Final|Native|Public|BlueprintCallable // @ game+0x67c0340
	void K2_AddWorldRotation(); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b37ac
	void K2_SetRelativeLocation(); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b6414
	void DetachFromParent(); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x67a7f64
	void K2_SetWorldRotation(); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b701c
	void *a4c0c6dacf(); // Function Engine.SceneComponent.*a4c0c6dacf // Final|Native|Public|BlueprintCallable // @ game+0x67b9974
	void K2_SetWorldTransform(); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b71f4
	void *c95aa311e1(); // Function Engine.SceneComponent.*c95aa311e1 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c33d4
	void *64c6a50e0e(); // Function Engine.SceneComponent.*64c6a50e0e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1354
	void OnRep_Visibility(); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x67b8140
	void K2_AddLocalOffset(); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b2c60
	void *1ab06a479c(); // Function Engine.SceneComponent.*1ab06a479c // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac224
	void *8ecb931576(); // Function Engine.SceneComponent.*8ecb931576 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67abd04
	void *e94c620b17(); // Function Engine.SceneComponent.*e94c620b17 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67a8198
	void K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4ea4
	void *71b355cc39(); // Function Engine.SceneComponent.*71b355cc39 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc8c518
	void *c7f3749d3f(); // Function Engine.SceneComponent.*c7f3749d3f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1e9c
	void *47f11c6aa4(); // Function Engine.SceneComponent.*47f11c6aa4 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67abda4
	void *7b9f3977eb(); // Function Engine.SceneComponent.*7b9f3977eb // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4e60
	void K2_AddLocalTransform(); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b3010
	void *d6237c56a2(); // Function Engine.SceneComponent.*d6237c56a2 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b6dec
	void *fdc9f4ce48(); // Function Engine.SceneComponent.*fdc9f4ce48 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0a7c
	void *c983529eeb(); // Function Engine.SceneComponent.*c983529eeb // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c1cb0
	void *fadfce2f5c(); // Function Engine.SceneComponent.*fadfce2f5c // Final|Native|Public|BlueprintCallable // @ game+0x67c37e0
	void *fe65a776a5(); // Function Engine.SceneComponent.*fe65a776a5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4ddc
	void SetVisibility(); // Function Engine.SceneComponent.SetVisibility // Final|Native|Public|BlueprintCallable // @ game+0xc58c14
	void *e51a15ac42(); // Function Engine.SceneComponent.*e51a15ac42 // Final|Native|Public|BlueprintCallable // @ game+0x67c03dc
	void K2_SetRelativeRotation(); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b6810
	void *a0c587c4d6(); // Function Engine.SceneComponent.*a0c587c4d6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af164
	void *a17d5e84b8(); // Function Engine.SceneComponent.*a17d5e84b8 // Final|Native|Public|BlueprintCallable // @ game+0x6f2d54
	void *f0cbf81c2a(); // Function Engine.SceneComponent.*f0cbf81c2a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b65e0
	void K2_AddRelativeLocation(); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b323c
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // Final|Native|Private // @ game+0xba31b4
	void *330134b8c2(); // Function Engine.SceneComponent.*330134b8c2 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0020
	void *cb975ed8ba(); // Function Engine.SceneComponent.*cb975ed8ba // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67acc10
	void K2_SetRelativeTransform(); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b69e8
	void *5b447b62b7(); // Function Engine.SceneComponent.*5b447b62b7 // Final|Native|Public|BlueprintCallable // @ game+0x67bc550
	void *a27f6d4764(); // Function Engine.SceneComponent.*a27f6d4764 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b01e8
	void *287e49cc7e(); // Function Engine.SceneComponent.*287e49cc7e // Final|Native|Public|BlueprintCallable // @ game+0x67c0068
	void *6f297235ba(); // Function Engine.SceneComponent.*6f297235ba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67afe18
	void IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1f90
	void *bb79d1adbb(); // Function Engine.SceneComponent.*bb79d1adbb // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67afaac
	void K2_AttachTo(); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x67b3eb0
	void K2_SetWorldLocation(); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b6c14
	void *709ad87786(); // Function Engine.SceneComponent.*709ad87786 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aae98
	void *716c958ce4(); // Function Engine.SceneComponent.*716c958ce4 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0408
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // Final|Native|Private // @ game+0xcc61b0
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // Final|Native|Private // @ game+0xcc61b0
	void K2_AddRelativeRotation(); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b3408
	void *77cf8156db(); // Function Engine.SceneComponent.*77cf8156db // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0350
	void *c786340f98(); // Function Engine.SceneComponent.*c786340f98 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aafb4
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0xc5c464
	void *8686c19d5c(); // Function Engine.SceneComponent.*8686c19d5c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b008c
	void *e13072354b(); // Function Engine.SceneComponent.*e13072354b // Final|Native|Public|BlueprintCallable // @ game+0x67b4250
	void ToggleVisibility(); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x67c4558
	void *45081e78dc(); // Function Engine.SceneComponent.*45081e78dc // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b02a0
	void *4883fee90d(); // Function Engine.SceneComponent.*4883fee90d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4d98
};

// Class Engine.PrimitiveComponent
// Size: 0xa00 (Inherited: 0x4d0)
struct UPrimitiveComponent : USceneComponent {
	char pad_4D0[0x8]; // 0x4d0(0x08)
	float MinDrawDistance; // 0x4d8(0x04)
	float LDMaxDrawDistance; // 0x4dc(0x04)
	float CachedMaxDrawDistance; // 0x4e0(0x04)
	enum class *3c659ab94c *7512e3d028; // 0x4e4(0x01)
	enum class *3c659ab94c *d9fcd9b4bb; // 0x4e5(0x01)
	char pad_4E6[0x2]; // 0x4e6(0x02)
	char pad_4E8_0 : 3; // 0x4e8(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x4e8(0x01)
	char bGenerateOverlapEvents : 1; // 0x4e8(0x01)
	char bMultiBodyOverlap : 1; // 0x4e8(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x4e8(0x01)
	char bTraceComplexOnMove : 1; // 0x4e8(0x01)
	char bDisableForceFromCharacter : 1; // 0x4e9(0x01)
	char bReturnMaterialOnMove : 1; // 0x4e9(0x01)
	char *3e4d34552d : 1; // 0x4e9(0x01)
	char bAllowCullDistanceVolume : 1; // 0x4e9(0x01)
	char bImportantMesh : 1; // 0x4e9(0x01)
	char bOverrideCullingDistances : 1; // 0x4e9(0x01)
	char pad_4E9_6 : 2; // 0x4e9(0x01)
	char pad_4EA[0x2]; // 0x4ea(0x02)
	float HLODScreenSize; // 0x4ec(0x04)
	char *2f091bbd0e : 1; // 0x4f0(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x4f0(0x01)
	char bRenderInMainPass : 1; // 0x4f0(0x01)
	char bRenderInMono : 1; // 0x4f0(0x01)
	char bOwnerNoSee : 1; // 0x4f0(0x01)
	char bOnlyOwnerSee : 1; // 0x4f0(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x4f0(0x01)
	char bUseAsOccluder : 1; // 0x4f0(0x01)
	char bForceAsOccluder : 1; // 0x4f1(0x01)
	char bForceOcclusionQuerying : 1; // 0x4f1(0x01)
	char bForceDisableOcclusionQuerying : 1; // 0x4f1(0x01)
	char *afd92d8969 : 1; // 0x4f1(0x01)
	char bForceMipStreaming : 1; // 0x4f1(0x01)
	char *4c581fbba9 : 1; // 0x4f1(0x01)
	char pad_4F1_6 : 1; // 0x4f1(0x01)
	char CastShadow : 1; // 0x4f1(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x4f2(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x4f2(0x01)
	char bCastDynamicShadow : 1; // 0x4f2(0x01)
	char bCastStaticShadow : 1; // 0x4f2(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x4f2(0x01)
	char bSelfShadowOnly : 1; // 0x4f2(0x01)
	char bCastFarShadow : 1; // 0x4f2(0x01)
	char bCastInsetShadow : 1; // 0x4f2(0x01)
	char bCastCinematicShadow : 1; // 0x4f3(0x01)
	char bCastHiddenShadow : 1; // 0x4f3(0x01)
	char bCastShadowAsTwoSided : 1; // 0x4f3(0x01)
	char bLightAsIfStatic : 1; // 0x4f3(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x4f3(0x01)
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x4f3(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x4f3(0x01)
	char bIgnoreRadialImpulse : 1; // 0x4f3(0x01)
	char bIgnoreRadialForce : 1; // 0x4f4(0x01)
	char bApplyImpulseOnDamage : 1; // 0x4f4(0x01)
	char bSyncBodySleep : 1; // 0x4f4(0x01)
	char *27b0806be5 : 1; // 0x4f4(0x01)
	char *6f3b773115 : 1; // 0x4f4(0x01)
	char *b11801b90d : 1; // 0x4f4(0x01)
	char bRenderCustomDepth : 1; // 0x4f4(0x01)
	char pad_4F4_7 : 1; // 0x4f4(0x01)
	char pad_4F5_0 : 7; // 0x4f5(0x01)
	char *668636af81 : 1; // 0x4f5(0x01)
	char *b3a3eee86b : 1; // 0x4f6(0x01)
	char *07830a14a6 : 1; // 0x4f6(0x01)
	char pad_4F6_2 : 6; // 0x4f6(0x01)
	char pad_4F7[0x1]; // 0x4f7(0x01)
	enum class EDecalChannel DecalChannel; // 0x4f8(0x01)
	enum class *c0765ad24b IndoorOutdoorMask; // 0x4f9(0x01)
	struct FLightingChannels LightingChannels; // 0x4fa(0x03)
	enum class *d315e71b47 IndirectLightingCacheQuality; // 0x4fd(0x01)
	bool CustomDepthStencilValue; // 0x4fe(0x01)
	enum class *6e131cfc7f CustomDepthStencilWriteMask; // 0x4ff(0x01)
	struct TArray<enum class ECollisionChannel> IgnoreCollisionMaskOnSweep; // 0x500(0x10)
	int32 TranslucencySortPriority; // 0x510(0x04)
	int32 *6862844184; // 0x514(0x04)
	char pad_518[0x4]; // 0x518(0x04)
	float LpvBiasMultiplier; // 0x51c(0x04)
	struct FBodyInstance BodyInstance; // 0x520(0x230)
	char pad_750[0x8]; // 0x750(0x08)
	enum class EHasCustomNavigableGeometry *9a13a32dd1; // 0x758(0x01)
	char pad_759[0x3b]; // 0x759(0x3b)
	float BoundsScale; // 0x794(0x04)
	float *aa675c3c9f; // 0x798(0x04)
	float *8aba3be418; // 0x79c(0x04)
	float *69906a8560; // 0x7a0(0x04)
	enum class *ed39c8987e CanBeCharacterBase; // 0x7a4(0x01)
	char pad_7A5[0x1]; // 0x7a5(0x01)
	enum class *ed39c8987e CanCharacterStepUpOn; // 0x7a6(0x01)
	char pad_7A7[0x1]; // 0x7a7(0x01)
	struct TArray<struct AActor*> *5559023e99; // 0x7a8(0x10)
	struct TArray<struct UPrimitiveComponent*> *34f682ee35; // 0x7b8(0x10)
	char pad_7C8[0xb8]; // 0x7c8(0xb8)
	struct FMulticastDelegate OnComponentHit; // 0x880(0x10)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x890(0x10)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x8a0(0x10)
	struct FMulticastDelegate OnComponentWake; // 0x8b0(0x10)
	struct FMulticastDelegate OnComponentSleep; // 0x8c0(0x10)
	char pad_8D0[0x10]; // 0x8d0(0x10)
	struct FMulticastDelegate OnBeginCursorOver; // 0x8e0(0x10)
	struct FMulticastDelegate OnEndCursorOver; // 0x8f0(0x10)
	struct FMulticastDelegate OnClicked; // 0x900(0x10)
	struct FMulticastDelegate OnReleased; // 0x910(0x10)
	struct FMulticastDelegate OnInputTouchBegin; // 0x920(0x10)
	struct FMulticastDelegate OnInputTouchEnd; // 0x930(0x10)
	struct FMulticastDelegate OnInputTouchEnter; // 0x940(0x10)
	struct FMulticastDelegate OnInputTouchLeave; // 0x950(0x10)
	char pad_960[0x28]; // 0x960(0x28)
	struct UPrimitiveComponent* *afbfc200cf; // 0x988(0x08)
	struct UPrimitiveComponent* *c423c7f1c7; // 0x990(0x08)
	struct F*1d83c9bd93 *605bfc3d64; // 0x998(0x58)
	char pad_9F0[0x10]; // 0x9f0(0x10)

	void AddForceAtLocation(); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a20d0
	void GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae850
	void *3f4951ae21(); // Function Engine.PrimitiveComponent.*3f4951ae21 // Native|Public|BlueprintCallable // @ game+0x67c0814
	void *aa442ff688(); // Function Engine.PrimitiveComponent.*aa442ff688 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b181c
	void *2acabdc4bc(); // Function Engine.PrimitiveComponent.*2acabdc4bc // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a2e70
	void *dfb097147a(); // Function Engine.PrimitiveComponent.*dfb097147a // Native|Public|BlueprintCallable // @ game+0x43ea88
	void *1d5b572e97(); // Function Engine.PrimitiveComponent.*1d5b572e97 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b51cc
	void *58360a298b(); // Function Engine.PrimitiveComponent.*58360a298b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1bb4
	void CreateAndSetMaterialInstanceDynamicFromMaterial(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x67a7778
	void *155e776c01(); // Function Engine.PrimitiveComponent.*155e776c01 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac0bc
	void *776b623f1e(); // Function Engine.PrimitiveComponent.*776b623f1e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a3044
	void *401e8be8c9(); // Function Engine.PrimitiveComponent.*401e8be8c9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b51fc
	void *6c17800325(); // Function Engine.PrimitiveComponent.*6c17800325 // Native|Public|BlueprintCallable // @ game+0x67be96c
	void *1060cf1432(); // Function Engine.PrimitiveComponent.*1060cf1432 // Final|Native|Public|BlueprintCallable // @ game+0x67bf1a0
	void *733d8ffdab(); // Function Engine.PrimitiveComponent.*733d8ffdab // Native|Public|BlueprintCallable // @ game+0x67c14b8
	void *c09d067d0f(); // Function Engine.PrimitiveComponent.*c09d067d0f // Final|Native|Public|BlueprintCallable // @ game+0x67c1d54
	void *dfc478eaef(); // Function Engine.PrimitiveComponent.*dfc478eaef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0e50
	void *d70adb1efd(); // Function Engine.PrimitiveComponent.*d70adb1efd // Native|Public|BlueprintCallable // @ game+0x67c0a84
	void K2_LineTraceComponent(); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b5230
	void *8f296e8ac0(); // Function Engine.PrimitiveComponent.*8f296e8ac0 // Final|Native|Public|BlueprintCallable // @ game+0x67c135c
	void *3579dd87c5(); // Function Engine.PrimitiveComponent.*3579dd87c5 // Native|Public|BlueprintCallable // @ game+0x67b132c
	void *c513e9cfca(); // Function Engine.PrimitiveComponent.*c513e9cfca // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae9e0
	void CreateAndSetMaterialInstanceDynamic(); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x67a7688
	void SetMassScale(); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x5a7f180
	void *c602cc5bf9(); // Function Engine.PrimitiveComponent.*c602cc5bf9 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae93c
	void *6f5a420568(); // Function Engine.PrimitiveComponent.*6f5a420568 // Final|Native|Public|BlueprintCallable // @ game+0x67c1e7c
	void *4179761c58(); // Function Engine.PrimitiveComponent.*4179761c58 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67a3c7c
	void SetMaterial(); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0xc3d1c8
	void GetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67afc30
	void CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x67a7578
	void *c4ebdc3c8f(); // Function Engine.PrimitiveComponent.*c4ebdc3c8f // Final|Native|Public|BlueprintCallable // @ game+0x67b0f34
	void AddTorque(); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a3504
	void *5b3c874cbe(); // Function Engine.PrimitiveComponent.*5b3c874cbe // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67bcd88
	void *baff305a0b(); // Function Engine.PrimitiveComponent.*baff305a0b // Native|Public|BlueprintCallable // @ game+0x67bea00
	void *b24da2aba6(); // Function Engine.PrimitiveComponent.*b24da2aba6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af19c
	void *6d15f9d7fc(); // Function Engine.PrimitiveComponent.*6d15f9d7fc // Final|Native|Public|BlueprintCallable // @ game+0x67a42cc
	void *bba26f131c(); // Function Engine.PrimitiveComponent.*bba26f131c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1c54
	void SetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x812984
	void SetPhysicsMaxAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x67c154c
	void *10c86d98d5(); // Function Engine.PrimitiveComponent.*10c86d98d5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af2d0
	void SetLinearDamping(); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x67a1940
	void *fc3da87902(); // Function Engine.PrimitiveComponent.*fc3da87902 // Native|Public|BlueprintCallable // @ game+0x67c1170
	void *1e088aa233(); // Function Engine.PrimitiveComponent.*1e088aa233 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67c3300
	void *9d203d4e3a(); // Function Engine.PrimitiveComponent.*9d203d4e3a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad8a8
	void *7ab8b110bc(); // Function Engine.PrimitiveComponent.*7ab8b110bc // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae71c
	void *cefd2a89e7(); // Function Engine.PrimitiveComponent.*cefd2a89e7 // Native|Public|BlueprintCallable // @ game+0x67c0bb0
	void *4135b69ecb(); // Function Engine.PrimitiveComponent.*4135b69ecb // Final|Native|Public|BlueprintCallable // @ game+0x67c1de8
	void AddAngularImpulse(); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a16bc
	void *065d5e11f8(); // Function Engine.PrimitiveComponent.*065d5e11f8 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67abba0
	void *e06446eb04(); // Function Engine.PrimitiveComponent.*e06446eb04 // Final|Native|Public|BlueprintCallable // @ game+0x67b93d0
	void *f6986ba874(); // Function Engine.PrimitiveComponent.*f6986ba874 // Final|Native|Public|BlueprintCallable // @ game+0x67c286c
	void *285b57600a(); // Function Engine.PrimitiveComponent.*285b57600a // Native|Public|BlueprintCallable // @ game+0x67c2b10
	void *5cdc853a89(); // Function Engine.PrimitiveComponent.*5cdc853a89 // Final|Native|Public|BlueprintCallable // @ game+0x67bf230
	void SetCollisionObjectType(); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Native|Public|BlueprintCallable // @ game+0x67be8d4
	void AddImpulseAtLocation(); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a2770
	void *b9e13958df(); // Function Engine.PrimitiveComponent.*b9e13958df // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac034
	void SetAllPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bce80
	void *29c20efb0b(); // Function Engine.PrimitiveComponent.*29c20efb0b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aaf38
	void *056cc90593(); // Function Engine.PrimitiveComponent.*056cc90593 // Final|Native|Public|BlueprintCallable // @ game+0x67be438
	void SetPhysicsAngularVelocity(); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xbc6ed4
	void SetAngularDamping(); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x67bd018
	void AddImpulse(); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a2630
	void *58f998cca1(); // Function Engine.PrimitiveComponent.*58f998cca1 // Native|Public|BlueprintCallable // @ game+0x67bea98
	void *6ad19621d9(); // Function Engine.PrimitiveComponent.*6ad19621d9 // Final|Native|Public|BlueprintCallable // @ game+0x67c1208
	void *6721a3eb8a(); // Function Engine.PrimitiveComponent.*6721a3eb8a // Final|Native|Public|BlueprintCallable // @ game+0x67a42e8
	void *601c402444(); // Function Engine.PrimitiveComponent.*601c402444 // Native|Public|BlueprintCallable // @ game+0x67c4858
	void GetOverlappingComponents(); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67af670
	void AddForce(); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a1f90
	void *1f028ad67d(); // Function Engine.PrimitiveComponent.*1f028ad67d // Final|Native|Public|BlueprintCallable // @ game+0x67ac084
	void *75116bc348(); // Function Engine.PrimitiveComponent.*75116bc348 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b9e50
	void *46193842e9(); // Function Engine.PrimitiveComponent.*46193842e9 // Final|Native|Public|BlueprintCallable // @ game+0x67a7600
	void *10f75e50ac(); // Function Engine.PrimitiveComponent.*10f75e50ac // Final|Native|Public|BlueprintCallable // @ game+0x67be1e0
	void *e3b0f43f9e(); // Function Engine.PrimitiveComponent.*e3b0f43f9e // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67afce0
	void *36ad2d15e7(); // Function Engine.PrimitiveComponent.*36ad2d15e7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67abed8
	void *fec7ca08f4(); // Function Engine.PrimitiveComponent.*fec7ca08f4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae87c
	void *0e38375bb9(); // Function Engine.PrimitiveComponent.*0e38375bb9 // Final|Native|Public|BlueprintCallable // @ game+0x67b1014
	void *23f39ad152(); // Function Engine.PrimitiveComponent.*23f39ad152 // Native|Public|BlueprintCallable // @ game+0x67bf4e0
	void AddForceAtLocationLocal(); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a221c
	void CreateDynamicMaterialInstance(); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x67a7868
	void *923a62a1b9(); // Function Engine.PrimitiveComponent.*923a62a1b9 // Final|Native|Public|BlueprintCallable // @ game+0x67bf108
	void GetPhysicsLinearVelocity(); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x8f5264
	void *41428e55af(); // Function Engine.PrimitiveComponent.*41428e55af // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b51a0
	void *9f5fbe7730(); // Function Engine.PrimitiveComponent.*9f5fbe7730 // Native|Public|BlueprintCallable // @ game+0x67bef70
	void SetCenterOfMass(); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67be564
	void *95f3208c0a(); // Function Engine.PrimitiveComponent.*95f3208c0a // Native|Public|BlueprintCallable // @ game+0x67bcf80
	void *926dc117b6(); // Function Engine.PrimitiveComponent.*926dc117b6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac05c
	void *d7c852a7d5(); // Function Engine.PrimitiveComponent.*d7c852a7d5 // Native|Public|BlueprintCallable // @ game+0x67b7dec
	void GetOverlappingActors(); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67af478
	void *b76664dec1(); // Function Engine.PrimitiveComponent.*b76664dec1 // Native|Public|BlueprintCallable // @ game+0x67c4840
	void *a306d03f54(); // Function Engine.PrimitiveComponent.*a306d03f54 // Native|Public|BlueprintCallable // @ game+0xbf0050
};

// Class Engine.MeshComponent
// Size: 0xb00 (Inherited: 0xa00)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x9f8(0x10)
	char pad_A10[0xf0]; // 0xa10(0xf0)

	void *dea9e46c09(); // Function Engine.MeshComponent.*dea9e46c09 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aeb2c
	void *2f56f6caf5(); // Function Engine.MeshComponent.*2f56f6caf5 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c2e80
	void *86f42457e0(); // Function Engine.MeshComponent.*86f42457e0 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b19cc
	void *e340f5fc1d(); // Function Engine.MeshComponent.*e340f5fc1d // Final|Native|Public|BlueprintCallable // @ game+0x90cea8
	void *514a111da7(); // Function Engine.MeshComponent.*514a111da7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aebb8
	void *28b95d47eb(); // Function Engine.MeshComponent.*28b95d47eb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aea84
};

// Class Engine.StaticMeshComponent
// Size: 0xba0 (Inherited: 0xb00)
struct UStaticMeshComponent : UMeshComponent {
	int32 ForcedLodModel; // 0xb00(0x04)
	int32 *66a6cd3343; // 0xb04(0x04)
	bool bOverrideMinLOD; // 0xb08(0x01)
	char pad_B09[0x3]; // 0xb09(0x03)
	int32 MinLOD; // 0xb0c(0x04)
	struct UStaticMesh* StaticMesh; // 0xb10(0x08)
	bool bOverrideWireframeColor; // 0xb18(0x01)
	char pad_B19[0x3]; // 0xb19(0x03)
	struct FColor WireframeColorOverride; // 0xb1c(0x04)
	struct FLinearColor PerInstanceCustomData; // 0xb20(0x10)
	char *a28fc20375 : 1; // 0xb30(0x01)
	char *a6e890a6e8 : 1; // 0xb30(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0xb30(0x01)
	char *72ad19ace5 : 1; // 0xb30(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0xb30(0x01)
	char bOverrideLightMapRes : 1; // 0xb30(0x01)
	char pad_B30_6 : 2; // 0xb30(0x01)
	char pad_B31[0x3]; // 0xb31(0x03)
	int32 OverriddenLightMapRes; // 0xb34(0x04)
	char bCastDistanceFieldIndirectShadow : 1; // 0xb38(0x01)
	char pad_B38_1 : 7; // 0xb38(0x01)
	char pad_B39[0x3]; // 0xb39(0x03)
	float DistanceFieldIndirectShadowMinVisibility; // 0xb3c(0x04)
	float StreamingDistanceMultiplier; // 0xb40(0x04)
	int32 *0f0f75dabf; // 0xb44(0x04)
	char *9a59516d8b : 1; // 0xb48(0x01)
	char pad_B48_1 : 7; // 0xb48(0x01)
	char pad_B49[0x7]; // 0xb49(0x07)
	struct TArray<struct FGuid> IrrelevantLights; // 0xb50(0x10)
	struct TArray<struct F*e52484916f> *6f651a8a78; // 0xb60(0x10)
	struct TArray<struct F*2680edbad5> *65df47e5bb; // 0xb70(0x10)
	bool *5b1ebb8f11; // 0xb80(0x01)
	char pad_B81[0x3]; // 0xb81(0x03)
	struct F*553842a41b LightmassSettings; // 0xb84(0x18)
	char pad_B9C[0x4]; // 0xb9c(0x04)

	void SetStaticMesh(); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x6257b40
	void *34b9302e3c(); // Function Engine.StaticMeshComponent.*34b9302e3c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae748
	void OnRep_StaticMesh(); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x67b8098
	void *488bd86f9f(); // Function Engine.StaticMeshComponent.*488bd86f9f // Final|Native|Public|BlueprintCallable // @ game+0x67bf8a0
};

// Class Engine.SkinnedMeshComponent
// Size: 0xca0 (Inherited: 0xb00)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0xb00(0x08)
	struct USkinnedMeshComponent* MasterPoseComponent; // 0xb08(0x08)
	char pad_B10[0x60]; // 0xb10(0x60)
	char bUseBoundsFromMasterPoseComponent : 1; // 0xb70(0x01)
	char pad_B70_1 : 7; // 0xb70(0x01)
	char pad_B71[0x7]; // 0xb71(0x07)
	struct TArray<struct FBoxSphereBounds> *f30ef9aca0; // 0xb78(0x10)
	char pad_B88[0x20]; // 0xb88(0x20)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0xba8(0x08)
	int32 ForcedLodModel; // 0xbb0(0x04)
	int32 MinLodModel; // 0xbb4(0x04)
	char pad_BB8[0x10]; // 0xbb8(0x10)
	struct TArray<struct F*cbe45bb4a6> LODInfo; // 0xbc8(0x10)
	float StreamingDistanceMultiplier; // 0xbd8(0x04)
	struct FColor WireframeColor; // 0xbdc(0x04)
	char *9e69394ecc : 1; // 0xbe0(0x01)
	char *9903a4c840 : 1; // 0xbe0(0x01)
	char bDisableMorphTarget : 1; // 0xbe0(0x01)
	char *355eef0bc4 : 1; // 0xbe0(0x01)
	char pad_BE0_4 : 4; // 0xbe0(0x01)
	char pad_BE1[0x17]; // 0xbe1(0x17)
	char bPerBoneMotionBlur : 1; // 0xbf8(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0xbf8(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0xbf8(0x01)
	char bSyncAttachParentLOD : 1; // 0xbf8(0x01)
	char pad_BF8_4 : 4; // 0xbf8(0x01)
	char pad_BF9[0x3]; // 0xbf9(0x03)
	enum class EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0xbfc(0x01)
	char pad_BFD[0x3]; // 0xbfd(0x03)
	char *4589ff7cf8 : 1; // 0xc00(0x01)
	char *96a8417c7f : 1; // 0xc00(0x01)
	char *f4e5e3198a : 1; // 0xc00(0x01)
	char pad_C00_3 : 5; // 0xc00(0x01)
	char pad_C01[0x3]; // 0xc01(0x03)
	bool *0ca1f88bf0; // 0xc04(0x01)
	char pad_C05[0x3]; // 0xc05(0x03)
	char bCastCapsuleDirectShadow : 1; // 0xc08(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0xc08(0x01)
	char pad_C08_2 : 6; // 0xc08(0x01)
	char pad_C09[0x3]; // 0xc09(0x03)
	char bRenderStatic : 1; // 0xc0c(0x01)
	char pad_C0C_1 : 7; // 0xc0c(0x01)
	char pad_C0D[0x3]; // 0xc0d(0x03)
	float CapsuleIndirectShadowMinVisibility; // 0xc10(0x04)
	char *f4e58c294b : 1; // 0xc14(0x01)
	char pad_C14_1 : 7; // 0xc14(0x01)
	char pad_C15[0xf]; // 0xc15(0x0f)
	struct FBoxSphereBounds *cd78e2e3f1; // 0xc24(0x1c)
	bool *51163366b3; // 0xc40(0x01)
	bool bEnableUpdateRateOptimizations; // 0xc41(0x01)
	bool bDisplayDebugUpdateRateOptimizations; // 0xc42(0x01)
	char pad_C43[0x4e]; // 0xc43(0x4e)
	bool *6ee4d78242; // 0xc91(0x01)
	bool *7c960d48b8; // 0xc92(0x01)
	char pad_C93[0xd]; // 0xc93(0x0d)

	void *6a5f21ad4e(); // Function Engine.SkinnedMeshComponent.*6a5f21ad4e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67eab68
	void *3c865e7779(); // Function Engine.SkinnedMeshComponent.*3c865e7779 // Final|Native|Public|BlueprintCallable // @ game+0x681de04
	void *fc7ead4db2(); // Function Engine.SkinnedMeshComponent.*fc7ead4db2 // Final|Native|Public|BlueprintCallable // @ game+0x680efc0
	void *10d664b446(); // Function Engine.SkinnedMeshComponent.*10d664b446 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67df240
	void *71a2310595(); // Function Engine.SkinnedMeshComponent.*71a2310595 // Final|Native|Public|BlueprintCallable // @ game+0x6808990
	void *67471412a8(); // Function Engine.SkinnedMeshComponent.*67471412a8 // Final|Native|Public|BlueprintCallable // @ game+0x6808430
	void *e1f9ca9449(); // Function Engine.SkinnedMeshComponent.*e1f9ca9449 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e84fc
	void SetSkeletalMesh(); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // Native|Public|BlueprintCallable // @ game+0x68113d8
	void *2400ce1346(); // Function Engine.SkinnedMeshComponent.*2400ce1346 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e297c
	void *a0035d9d4e(); // Function Engine.SkinnedMeshComponent.*a0035d9d4e // Final|Native|Public|BlueprintCallable // @ game+0x67f0830
	void GetBoneIndex(); // Function Engine.SkinnedMeshComponent.GetBoneIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e26c0
	void *0838ed640a(); // Function Engine.SkinnedMeshComponent.*0838ed640a // Final|Native|Public|BlueprintCallable // @ game+0x6810e28
	void *6c2f9d9de6(); // Function Engine.SkinnedMeshComponent.*6c2f9d9de6 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x681d7f8
	void *5ee5688cd0(); // Function Engine.SkinnedMeshComponent.*5ee5688cd0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67cf0d8
	void *b6a1e57216(); // Function Engine.SkinnedMeshComponent.*b6a1e57216 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e8178
	void *fd2b1bbf5b(); // Function Engine.SkinnedMeshComponent.*fd2b1bbf5b // Final|Native|Public|BlueprintCallable // @ game+0x680c288
	void *c47c945cda(); // Function Engine.SkinnedMeshComponent.*c47c945cda // Final|Native|Public|BlueprintCallable // @ game+0x680ee90
	void *b41c79226e(); // Function Engine.SkinnedMeshComponent.*b41c79226e // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68146dc
	void *c8ca57db8d(); // Function Engine.SkinnedMeshComponent.*c8ca57db8d // Final|Native|Public|BlueprintCallable // @ game+0x67ef36c
	void SetSkinWeightOverride(); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x681154c
	void *96c3ec4c09(); // Function Engine.SkinnedMeshComponent.*96c3ec4c09 // Final|Native|Public|BlueprintCallable // @ game+0x67d6614
	void *feffa71d19(); // Function Engine.SkinnedMeshComponent.*feffa71d19 // Native|Public|BlueprintCallable // @ game+0x680fef8
	void *ceffae9960(); // Function Engine.SkinnedMeshComponent.*ceffae9960 // Final|Native|Public|BlueprintCallable // @ game+0x67d62ac
	void *727d19e44f(); // Function Engine.SkinnedMeshComponent.*727d19e44f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x681dbcc
	void *a7e2c33601(); // Function Engine.SkinnedMeshComponent.*a7e2c33601 // Final|Native|Public|BlueprintCallable // @ game+0x68088e0
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1190 (Inherited: 0xca0)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UAnimBlueprintGeneratedClass* AnimBlueprintGeneratedClass; // 0xca0(0x08)
	struct UClass* AnimClass; // 0xca8(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xcb0(0x08)
	struct TArray<struct UAnimInstance*> *b1a0aa7521; // 0xcb8(0x10)
	struct UAnimInstance* *08eabd4801; // 0xcc8(0x08)
	struct F*030036a724 AnimationData; // 0xcd0(0x18)
	char pad_CE8[0x30]; // 0xce8(0x30)
	struct TArray<struct FTransform> *58c21de2e0; // 0xd18(0x10)
	struct TArray<struct FTransform> *545370af98; // 0xd28(0x10)
	char pad_D38[0x20]; // 0xd38(0x20)
	float GlobalAnimRateScale; // 0xd58(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xd5c(0x01)
	enum class *ab2c643b8f PhysicsTransformUpdateMode; // 0xd5d(0x01)
	char pad_D5E[0x1]; // 0xd5e(0x01)
	enum class EAnimationMode AnimationMode; // 0xd5f(0x01)
	char pad_D60[0x4]; // 0xd60(0x04)
	char pad_D64_0 : 1; // 0xd64(0x01)
	char *3383585ca2 : 1; // 0xd64(0x01)
	char pad_D64_2 : 1; // 0xd64(0x01)
	char *f16a7a3dd7 : 1; // 0xd64(0x01)
	char pad_D64_4 : 2; // 0xd64(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xd64(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xd64(0x01)
	char bDisableClothSimulation : 1; // 0xd65(0x01)
	char pad_D65_1 : 2; // 0xd65(0x01)
	char bCollideWithEnvironment : 1; // 0xd65(0x01)
	char bCollideWithAttachedChildren : 1; // 0xd65(0x01)
	char bLocalSpaceSimulation : 1; // 0xd65(0x01)
	char *be67cfdb15 : 1; // 0xd65(0x01)
	char bResetAfterTeleport : 1; // 0xd65(0x01)
	char pad_D66_0 : 1; // 0xd66(0x01)
	char bNoSkeletonUpdate : 1; // 0xd66(0x01)
	char bPauseAnims : 1; // 0xd66(0x01)
	char *39749c2751 : 1; // 0xd66(0x01)
	char bEnablePerPolyCollision : 1; // 0xd66(0x01)
	char *2eab519db0 : 1; // 0xd66(0x01)
	char *e494fcf5fb : 1; // 0xd66(0x01)
	char *4035845260 : 1; // 0xd66(0x01)
	char *c6d7dbb4f5 : 1; // 0xd67(0x01)
	char *ac6a357b1a : 1; // 0xd67(0x01)
	char *36b974a93b : 1; // 0xd67(0x01)
	char *6821fc8c10 : 1; // 0xd67(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xd67(0x01)
	char *602b32a36f : 1; // 0xd67(0x01)
	char pad_D67_6 : 2; // 0xd67(0x01)
	char *660210df46 : 1; // 0xd68(0x01)
	char pad_D68_1 : 7; // 0xd68(0x01)
	char pad_D69_0 : 2; // 0xd69(0x01)
	char bDefaultLooping : 1; // 0xd69(0x01)
	char bDefaultPlaying : 1; // 0xd69(0x01)
	char pad_D69_4 : 4; // 0xd69(0x01)
	uint16 *2fe5eefb66; // 0xd6a(0x02)
	float ClothBlendWeight; // 0xd6c(0x04)
	struct FVector *a41d195774; // 0xd70(0x0c)
	char pad_D7C[0x4]; // 0xd7c(0x04)
	struct UBodySetup* BodySetup; // 0xd80(0x08)
	float TeleportDistanceThreshold; // 0xd88(0x04)
	float TeleportRotationThreshold; // 0xd8c(0x04)
	struct FVector *b77df095c1; // 0xd90(0x0c)
	char pad_D9C[0x4]; // 0xd9c(0x04)
	struct FMulticastDelegate OnConstraintBroken; // 0xda0(0x10)
	char pad_DB0[0xe0]; // 0xdb0(0xe0)
	struct UClass* *b14b3c8b7b; // 0xe90(0x08)
	char pad_E98[0x1e8]; // 0xe98(0x1e8)
	struct UAnimSequence* SequenceToPlay; // 0x1080(0x08)
	struct UAnimationAsset* AnimToPlay; // 0x1088(0x08)
	float DefaultPosition; // 0x1090(0x04)
	float DefaultPlayRate; // 0x1094(0x04)
	uint32 *5f8fe91e99; // 0x1098(0x04)
	float *3993dbc972; // 0x109c(0x04)
	char pad_10A0[0xf0]; // 0x10a0(0xf0)

	void *a9c661b6a0(); // Function Engine.SkeletalMeshComponent.*a9c661b6a0 // Final|Native|Public|BlueprintCallable // @ game+0x6808fb0
	void *38a8d94d2a(); // Function Engine.SkeletalMeshComponent.*38a8d94d2a // Final|Native|Public|BlueprintCallable // @ game+0x67df848
	void *d6b31f7555(); // Function Engine.SkeletalMeshComponent.*d6b31f7555 // Final|Native|Public|BlueprintCallable // @ game+0x7e8790
	void *5f9211f1eb(); // Function Engine.SkeletalMeshComponent.*5f9211f1eb // Final|Native|Public|BlueprintCallable // @ game+0x67e0c00
	void *78951d1396(); // Function Engine.SkeletalMeshComponent.*78951d1396 // Final|Native|Public|BlueprintCallable // @ game+0x67e2fdc
	void *a81e6d31fe(); // Function Engine.SkeletalMeshComponent.*a81e6d31fe // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6805388
	void *1d127e5a31(); // Function Engine.SkeletalMeshComponent.*1d127e5a31 // Final|Native|Public|BlueprintCallable // @ game+0x680552c
	void *057fda6034(); // Function Engine.SkeletalMeshComponent.*057fda6034 // Final|Native|Public|BlueprintCallable // @ game+0x680f28c
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // Final|Native|Public|BlueprintCallable // @ game+0x7e8844
	void *01291de0e1(); // Function Engine.SkeletalMeshComponent.*01291de0e1 // Final|Native|Public|BlueprintCallable // @ game+0x6803cf4
	void *07eb4aa7bc(); // Function Engine.SkeletalMeshComponent.*07eb4aa7bc // Final|Native|Public|BlueprintCallable // @ game+0x67d61fc
	void *2862b5ed5a(); // Function Engine.SkeletalMeshComponent.*2862b5ed5a // Final|Native|Public|BlueprintCallable // @ game+0x6809540
	void SetAnimation(); // Function Engine.SkeletalMeshComponent.SetAnimation // Final|Native|Public|BlueprintCallable // @ game+0x7e775c
	void *2b1529526f(); // Function Engine.SkeletalMeshComponent.*2b1529526f // Final|Native|Public|BlueprintCallable // @ game+0x67fe090
	void *8c3e6ac131(); // Function Engine.SkeletalMeshComponent.*8c3e6ac131 // Final|Native|Public|BlueprintCallable // @ game+0x6805740
	void *fdb6af384f(); // Function Engine.SkeletalMeshComponent.*fdb6af384f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e1f64
	void GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e8758
	void *78c795bb04(); // Function Engine.SkeletalMeshComponent.*78c795bb04 // Final|Native|Public|BlueprintCallable // @ game+0x6805884
	void *d19cf19dad(); // Function Engine.SkeletalMeshComponent.*d19cf19dad // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x966ec8
	void *bbd30f0694(); // Function Engine.SkeletalMeshComponent.*bbd30f0694 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e2890
	void *8eccb076f1(); // Function Engine.SkeletalMeshComponent.*8eccb076f1 // Native|Public|BlueprintCallable // @ game+0x68074e4
	void *49a5d89dc7(); // Function Engine.SkeletalMeshComponent.*49a5d89dc7 // Final|Native|Public|BlueprintCallable // @ game+0x67f0780
	void *a95306e281(); // Function Engine.SkeletalMeshComponent.*a95306e281 // Final|Native|Public|BlueprintCallable // @ game+0x67e0c18
	void SetPlayRate(); // Function Engine.SkeletalMeshComponent.SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0xbb83e8
	void SetAnimInstanceClass(); // Function Engine.SkeletalMeshComponent.SetAnimInstanceClass // Final|Native|Public|BlueprintCallable // @ game+0x6806764
	void Play(); // Function Engine.SkeletalMeshComponent.Play // Final|Native|Public|BlueprintCallable // @ game+0xbb2e78
	void *5b7b02a51f(); // Function Engine.SkeletalMeshComponent.*5b7b02a51f // Final|Native|Public|BlueprintCallable // @ game+0x67cde24
	void *12330879fc(); // Function Engine.SkeletalMeshComponent.*12330879fc // Final|Native|Public|BlueprintCallable // @ game+0x681cb40
	void *a1620df48e(); // Function Engine.SkeletalMeshComponent.*a1620df48e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c8ff4
	void *20c9711831(); // Function Engine.SkeletalMeshComponent.*20c9711831 // Final|Native|Public|BlueprintCallable // @ game+0x6805d04
	void *7b5470eac3(); // Function Engine.SkeletalMeshComponent.*7b5470eac3 // Final|Native|Public|BlueprintCallable // @ game+0x680ffdc
	void *eafb4489c9(); // Function Engine.SkeletalMeshComponent.*eafb4489c9 // Final|Native|Public|BlueprintCallable // @ game+0x67f08e4
	void *3386d7f324(); // Function Engine.SkeletalMeshComponent.*3386d7f324 // Final|Native|Public|BlueprintCallable // @ game+0x680afac
	void *370e1608b9(); // Function Engine.SkeletalMeshComponent.*370e1608b9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67d1dbc
	void *b72e6b1694(); // Function Engine.SkeletalMeshComponent.*b72e6b1694 // Final|Native|Public|BlueprintCallable // @ game+0x6803a20
	void *b1a20c6186(); // Function Engine.SkeletalMeshComponent.*b1a20c6186 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e1f4c
	void PlayAnimation(); // Function Engine.SkeletalMeshComponent.PlayAnimation // Final|Native|Public|BlueprintCallable // @ game+0x67febd0
	void *30ca989855(); // Function Engine.SkeletalMeshComponent.*30ca989855 // Final|Native|Public|BlueprintCallable // @ game+0x681de94
	void IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67f0e50
	void *a1048a9859(); // Function Engine.SkeletalMeshComponent.*a1048a9859 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e807c
	void *23cd46227b(); // Function Engine.SkeletalMeshComponent.*23cd46227b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ef224
	void *e8a9ba9091(); // Function Engine.SkeletalMeshComponent.*e8a9ba9091 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x68171c0
	void *cc72975abc(); // Function Engine.SkeletalMeshComponent.*cc72975abc // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67f194c
	void *4200524a62(); // Function Engine.SkeletalMeshComponent.*4200524a62 // Final|Native|Public|BlueprintCallable // @ game+0x68055c0
	void *a61324ada6(); // Function Engine.SkeletalMeshComponent.*a61324ada6 // Final|Native|Public|BlueprintCallable // @ game+0x680abfc
	void *66eace9a8c(); // Function Engine.SkeletalMeshComponent.*66eace9a8c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67eab34
	void *114aeda594(); // Function Engine.SkeletalMeshComponent.*114aeda594 // Final|Native|Public|BlueprintCallable // @ game+0x680ace8
	void *20b809a325(); // Function Engine.SkeletalMeshComponent.*20b809a325 // Final|Native|Public|BlueprintCallable // @ game+0x680397c
	void *a3c4621c5f(); // Function Engine.SkeletalMeshComponent.*a3c4621c5f // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c9188
	void *4403e63617(); // Function Engine.SkeletalMeshComponent.*4403e63617 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67e3454
	void *5fb2b74dad(); // Function Engine.SkeletalMeshComponent.*5fb2b74dad // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67c8870
	void *04f817017d(); // Function Engine.SkeletalMeshComponent.*04f817017d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e9204
	void *a5309d0c43(); // Function Engine.SkeletalMeshComponent.*a5309d0c43 // Final|Native|Public|BlueprintCallable // @ game+0xc2ac8c
	void *dcf02b5cb4(); // Function Engine.SkeletalMeshComponent.*dcf02b5cb4 // Final|Native|Public|BlueprintCallable // @ game+0x5a0769c
	void GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e8ec0
	void *f0efd7be35(); // Function Engine.SkeletalMeshComponent.*f0efd7be35 // Final|Native|Public|BlueprintCallable // @ game+0x6809410
	void SetPosition(); // Function Engine.SkeletalMeshComponent.SetPosition // Final|Native|Public|BlueprintCallable // @ game+0x68105c4
	void *34f2079b29(); // Function Engine.SkeletalMeshComponent.*34f2079b29 // Native|Public|BlueprintCallable // @ game+0x680f718
};

// Class Engine.Info
// Size: 0x408 (Inherited: 0x408)
struct AInfo : AActor {
};

// Class Engine.GameModeBase
// Size: 0x4a8 (Inherited: 0x408)
struct AGameModeBase : AInfo {
	struct FString OptionsString; // 0x408(0x10)
	struct UClass* GameSessionClass; // 0x418(0x08)
	struct UClass* GameStateClass; // 0x420(0x08)
	struct UClass* PlayerControllerClass; // 0x428(0x08)
	struct UClass* PlayerStateClass; // 0x430(0x08)
	struct FStringClassReference HUDClass; // 0x438(0x10)
	struct UClass* DefaultPawnClass; // 0x448(0x08)
	struct FStringClassReference SpectatorClass; // 0x450(0x10)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x460(0x08)
	struct AGameSession* GameSession; // 0x468(0x08)
	struct AGameStateBase* GameState; // 0x470(0x08)
	struct FText *02f2c38855; // 0x478(0x18)
	char bUseSeamlessTravel : 1; // 0x490(0x01)
	char bStartPlayersAsSpectators : 1; // 0x490(0x01)
	char bPauseable : 1; // 0x490(0x01)
	char pad_490_3 : 5; // 0x490(0x01)
	char pad_491[0x17]; // 0x491(0x17)

	void HandleStartingNewPlayer(); // Function Engine.GameModeBase.HandleStartingNewPlayer // Native|Event|Public|BlueprintEvent // @ game+0xb2d074
	void InitStartSpot(); // Function Engine.GameModeBase.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0xd7d974
	void K2_OnRestartPlayer(); // Function Engine.GameModeBase.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void SpawnDefaultPawnFor(); // Function Engine.GameModeBase.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0xc919a4
	void *df82bef3d0(); // Function Engine.GameModeBase.*df82bef3d0 // Native|Public|BlueprintCallable // @ game+0xb13710
	void PlayerCanRestart(); // Function Engine.GameModeBase.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0xb2cfb4
	void FindPlayerStart(); // Function Engine.GameModeBase.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xc45680
	void *49c7068d30(); // Function Engine.GameModeBase.*49c7068d30 // Native|Public|BlueprintCallable // @ game+0x67a4144
	void GetDefaultPawnClassForController(); // Function Engine.GameModeBase.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0xcae51c
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel // Native|Public|BlueprintCallable // @ game+0x5aa55a4
	void K2_OnLogout(); // Function Engine.GameModeBase.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void SpawnDefaultPawnAtTransform(); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xcdb6dc
	void *a2a2e5aa70(); // Function Engine.GameModeBase.*a2a2e5aa70 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3d568
	void K2_OnSwapPlayerControllers(); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers // Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void *d170795d09(); // Function Engine.GameModeBase.*d170795d09 // Native|Public|BlueprintCallable // @ game+0x67af2a8
	void *5e6c791ad6(); // Function Engine.GameModeBase.*5e6c791ad6 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x67b4a2c
	void StartPlay(); // Function Engine.GameModeBase.StartPlay // Native|Public|BlueprintCallable // @ game+0xbd25e0
	void MustSpectate(); // Function Engine.GameModeBase.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0xc7f3bc
	void RestartPlayerAtPlayerStart(); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart // Native|Public|BlueprintCallable // @ game+0x67b9ae8
	void *18dad4e118(); // Function Engine.GameModeBase.*18dad4e118 // Native|Public|BlueprintCallable // @ game+0x67af1c4
	void ChoosePlayerStart(); // Function Engine.GameModeBase.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0xc90778
	void ShouldReset(); // Function Engine.GameModeBase.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x67b956c
	void RestartPlayerAtTransform(); // Function Engine.GameModeBase.RestartPlayerAtTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b9bc8
	void K2_OnChangeName(); // Function Engine.GameModeBase.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void K2_PostLogin(); // Function Engine.GameModeBase.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void RestartPlayer(); // Function Engine.GameModeBase.RestartPlayer // Native|Public|BlueprintCallable // @ game+0x67b9a54
	void CanSpectate(); // Function Engine.GameModeBase.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x67a3d70
	void InitializeHUDForPlayer(); // Function Engine.GameModeBase.InitializeHUDForPlayer // Native|Event|Protected|BlueprintEvent // @ game+0xd8a5e8
};

// Class Engine.GameMode
// Size: 0x4e8 (Inherited: 0x4a8)
struct AGameMode : AGameModeBase {
	struct FName *cad7def02a; // 0x4a8(0x08)
	char bDelayedStart : 1; // 0x4b0(0x01)
	char pad_4B0_1 : 7; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	int32 NumSpectators; // 0x4b4(0x04)
	int32 NumPlayers; // 0x4b8(0x04)
	int32 NumBots; // 0x4bc(0x04)
	float MinRespawnDelay; // 0x4c0(0x04)
	int32 NumTravellingPlayers; // 0x4c4(0x04)
	struct UClass* *aff3dca9f7; // 0x4c8(0x08)
	struct TArray<struct APlayerState*> *27501ccd21; // 0x4d0(0x10)
	float *67a73490ca; // 0x4e0(0x04)
	bool bHandleDedicatedServerReplays; // 0x4e4(0x01)
	char pad_4E5[0x3]; // 0x4e5(0x03)

	void *d8ff867182(); // Function Engine.GameMode.*d8ff867182 // Native|Public|BlueprintCallable // @ game+0x5a40118
	void *a5ef978767(); // Function Engine.GameMode.*a5ef978767 // Native|Public|BlueprintCallable // @ game+0x5a3fcdc
	void *e72bb40788(); // Function Engine.GameMode.*e72bb40788 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b19a4
	void *93681d758c(); // Function Engine.GameMode.*93681d758c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0eb8
	void *82e263a9c2(); // Function Engine.GameMode.*82e263a9c2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae924
	void ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0xce6448
	void SetBandwidthLimit(); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x67bd808
	void ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0x9e915c
	void *7fb112d056(); // Function Engine.GameMode.*7fb112d056 // Native|Public|BlueprintCallable // @ game+0x5a3c5e4
	void Say(); // Function Engine.GameMode.Say // Exec|Native|Public|BlueprintCallable // @ game+0x67b9d8c
	void K2_OnSetMatchState(); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void *713722b23e(); // Function Engine.GameMode.*713722b23e // Native|Public|BlueprintCallable // @ game+0x67b9988
};

// Class Engine.*c5e4cb7a4d
// Size: 0x38 (Inherited: 0x30)
struct U*c5e4cb7a4d : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.*ed75cbc976
// Size: 0x38 (Inherited: 0x38)
struct U*ed75cbc976 : U*c5e4cb7a4d {
};

// Class Engine.*401688bf57
// Size: 0x30 (Inherited: 0x30)
struct U*401688bf57 : UObject {
};

// Class Engine.*498af98d1d
// Size: 0x48 (Inherited: 0x30)
struct U*498af98d1d : UObject {
	char bCausedByWorld : 1; // 0x30(0x01)
	char bScaleMomentumByMass : 1; // 0x30(0x01)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char pad_30_3 : 5; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float DamageImpulse; // 0x34(0x04)
	float DestructibleImpulse; // 0x38(0x04)
	float DestructibleDamageSpreadScale; // 0x3c(0x04)
	float DamageFalloff; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.MovementComponent
// Size: 0x250 (Inherited: 0x200)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0x200(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0x208(0x08)
	char pad_210[0x4]; // 0x210(0x04)
	struct FVector Velocity; // 0x214(0x0c)
	char bConstrainToPlane : 1; // 0x220(0x01)
	char bSnapToPlaneAtStart : 1; // 0x220(0x01)
	char pad_220_2 : 6; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	enum class EPlaneConstraintAxisSetting *5ff5e09fff; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)
	struct FVector PlaneConstraintNormal; // 0x228(0x0c)
	struct FVector PlaneConstraintOrigin; // 0x234(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x240(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x240(0x01)
	char bTickBeforeOwner : 1; // 0x240(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x240(0x01)
	char pad_240_4 : 4; // 0x240(0x01)
	char pad_241[0xf]; // 0x241(0x0f)

	void *b6c8efbdb0(); // Function Engine.MovementComponent.*b6c8efbdb0 // Native|Public|BlueprintCallable // @ game+0x67c2a7c
	void ConstrainLocationToPlane(); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67a72d8
	void *bfb832781f(); // Function Engine.MovementComponent.*bfb832781f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aecc8
	void *c31d3003ec(); // Function Engine.MovementComponent.*c31d3003ec // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67accdc
	void *c4f8250805(); // Function Engine.MovementComponent.*c4f8250805 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67b559c
	void *ff3b5ade2b(); // Function Engine.MovementComponent.*ff3b5ade2b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c17ac
	void *d1555190f1(); // Function Engine.MovementComponent.*d1555190f1 // Native|Public|BlueprintCallable // @ game+0x67c1680
	void *fab8102e5d(); // Function Engine.MovementComponent.*fab8102e5d // Native|Public|BlueprintCallable // @ game+0x67c1714
	void *94b67ee95b(); // Function Engine.MovementComponent.*94b67ee95b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67afe7c
	void *c0ba54ba1b(); // Function Engine.MovementComponent.*c0ba54ba1b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67afe54
	void *01f7b059b5(); // Function Engine.MovementComponent.*01f7b059b5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67a73a0
	void K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4f64
	void *5950858757(); // Function Engine.MovementComponent.*5950858757 // Native|Public|BlueprintCallable // @ game+0x67c38d0
	void *6f297235ba(); // Function Engine.MovementComponent.*6f297235ba // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67afdf0
	void *318cdd375a(); // Function Engine.MovementComponent.*318cdd375a // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67a7210
	void *5acff43dcb(); // Function Engine.MovementComponent.*5acff43dcb // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c195c
	void PhysicsVolumeChanged(); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0xc4eea4
	void K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4f0c
	void *1283f915c9(); // Function Engine.MovementComponent.*1283f915c9 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c18b8
	void *f4e98dfee9(); // Function Engine.MovementComponent.*f4e98dfee9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67afe3c
	void *b8cd8cd7b7(); // Function Engine.MovementComponent.*b8cd8cd7b7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1720
	void *9ed3de3e6c(); // Function Engine.MovementComponent.*9ed3de3e6c // Native|Public|BlueprintCallable // @ game+0x67c4220
};

// Class Engine.NavMovementComponent
// Size: 0x280 (Inherited: 0x250)
struct UNavMovementComponent : UMovementComponent {
	struct F*112b6d08d9 NavAgentProps; // 0x248(0x20)
	float *77ddb5b058; // 0x268(0x04)
	char *89266b4845 : 1; // 0x26c(0x01)
	char bUseAccelerationForPaths : 1; // 0x26c(0x01)
	char bUseFixedBrakingDistanceForPaths : 1; // 0x26c(0x01)
	struct F*37b25a6e05 *aee1222c17; // 0x270(0x04)
	char pad_278_3 : 5; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)

	void *732c78efb2(); // Function Engine.NavMovementComponent.*732c78efb2 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b16c8
	void *5edeeddff6(); // Function Engine.NavMovementComponent.*5edeeddff6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b17f4
	void *8e52db34a0(); // Function Engine.NavMovementComponent.*8e52db34a0 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1aec
	void *1361befc6e(); // Function Engine.NavMovementComponent.*1361befc6e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1f68
	void IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b17cc
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x67c3bec
	void *bf14594621(); // Function Engine.NavMovementComponent.*bf14594621 // Final|Native|Public|BlueprintCallable // @ game+0x67c4238
};

// Class Engine.PawnMovementComponent
// Size: 0x290 (Inherited: 0x280)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* *dac5b5e3f6; // 0x280(0x08)
	char pad_288[0x8]; // 0x288(0x08)

	void *b4adeff535(); // Function Engine.PawnMovementComponent.*b4adeff535 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae63c
	void K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4ed8
	void *ceaebf3734(); // Function Engine.PawnMovementComponent.*ceaebf3734 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1ac4
	void *449559473e(); // Function Engine.PawnMovementComponent.*449559473e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67afb74
	void *d72920eaf6(); // Function Engine.PawnMovementComponent.*d72920eaf6 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a7468
	void *9abbf4048c(); // Function Engine.PawnMovementComponent.*9abbf4048c // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a28bc
	void *f8c3127bfa(); // Function Engine.PawnMovementComponent.*f8c3127bfa // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67afb8c
};

// Class Engine.CharacterMovementComponent
// Size: 0x930 (Inherited: 0x290)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char pad_290[0x8]; // 0x290(0x08)
	struct ACharacter* *9715095276; // 0x298(0x08)
	char bApplyGravityWhileJumping : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float GravityScale; // 0x2a4(0x04)
	float MaxStepHeight; // 0x2a8(0x04)
	float JumpZVelocity; // 0x2ac(0x04)
	float JumpOffJumpZFactor; // 0x2b0(0x04)
	float *6e4a728753; // 0x2b4(0x04)
	float *5d81580070; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	float *14261b064c; // 0x2c0(0x04)
	float *3b0102ed15; // 0x2c4(0x04)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	enum class EMovementMode MovementMode; // 0x2d0(0x01)
	bool CustomMovementMode; // 0x2d1(0x01)
	char pad_2D2[0x1e]; // 0x2d2(0x1e)
	float GroundFriction; // 0x2f0(0x04)
	float MaxWalkSpeed; // 0x2f4(0x04)
	float MaxWalkSpeedCrouched; // 0x2f8(0x04)
	float MaxSwimSpeed; // 0x2fc(0x04)
	float MaxFlySpeed; // 0x300(0x04)
	float MaxCustomMovementSpeed; // 0x304(0x04)
	float MaxAcceleration; // 0x308(0x04)
	float BrakingFrictionFactor; // 0x30c(0x04)
	float BrakingFriction; // 0x310(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x314(0x01)
	char pad_314_1 : 7; // 0x314(0x01)
	char pad_315[0x3]; // 0x315(0x03)
	float BrakingDecelerationWalking; // 0x318(0x04)
	float BrakingDecelerationFalling; // 0x31c(0x04)
	float BrakingDecelerationSwimming; // 0x320(0x04)
	float BrakingDecelerationFlying; // 0x324(0x04)
	float AirControl; // 0x328(0x04)
	float AirControlBoostMultiplier; // 0x32c(0x04)
	float AirControlBoostVelocityThreshold; // 0x330(0x04)
	float FallingLateralFriction; // 0x334(0x04)
	float CrouchedHalfHeight; // 0x338(0x04)
	float PronedHalfHeight; // 0x33c(0x04)
	float PronedRadius; // 0x340(0x04)
	float Buoyancy; // 0x344(0x04)
	float PerchRadiusThreshold; // 0x348(0x04)
	float PerchAdditionalHeight; // 0x34c(0x04)
	struct FRotator RotationRate; // 0x350(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x35c(0x01)
	char bOrientRotationToMovement : 1; // 0x35c(0x01)
	char bSweepWhileNavWalking : 1; // 0x35c(0x01)
	char pad_35C_3 : 2; // 0x35c(0x01)
	char *6b80ed3b3f : 1; // 0x35c(0x01)
	char *a5883f41aa : 1; // 0x35c(0x01)
	char bForceMaxAccel : 1; // 0x35c(0x01)
	char bRunPhysicsWithNoController : 1; // 0x35d(0x01)
	char bForceNextFloorCheck : 1; // 0x35d(0x01)
	char *6913829b5c : 1; // 0x35d(0x01)
	char bCanWalkOffLedges : 1; // 0x35d(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x35d(0x01)
	char pad_35D_5 : 2; // 0x35d(0x01)
	char *2acc0ba126 : 1; // 0x35d(0x01)
	char *bfdbad290e : 1; // 0x35e(0x01)
	char pad_35E_1 : 7; // 0x35e(0x01)
	char pad_35F[0x1]; // 0x35f(0x01)
	struct USceneComponent* *24362ccfd4; // 0x360(0x08)
	float MaxOutOfWaterStepHeight; // 0x368(0x04)
	float OutofWaterZ; // 0x36c(0x04)
	float Mass; // 0x370(0x04)
	bool bEnablePhysicsInteraction; // 0x374(0x01)
	bool bTouchForceScaledToMass; // 0x375(0x01)
	bool bPushForceScaledToMass; // 0x376(0x01)
	bool bPushForceUsingZOffset; // 0x377(0x01)
	bool bScalePushForceToVelocity; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	float StandingDownwardForceScale; // 0x37c(0x04)
	float InitialPushForceFactor; // 0x380(0x04)
	float PushForceFactor; // 0x384(0x04)
	float PushForcePointZOffsetFactor; // 0x388(0x04)
	float TouchForceFactor; // 0x38c(0x04)
	float MinTouchForce; // 0x390(0x04)
	float MaxTouchForce; // 0x394(0x04)
	float RepulsionForce; // 0x398(0x04)
	char bForceBraking : 1; // 0x39c(0x01)
	char pad_39C_1 : 7; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	float CrouchedSpeedMultiplier; // 0x3a0(0x04)
	float UpperImpactNormalScale; // 0x3a4(0x04)
	struct FVector Acceleration; // 0x3a8(0x0c)
	struct FVector *8b5e33641b; // 0x3b4(0x0c)
	struct FQuat *1a53230ea5; // 0x3c0(0x10)
	struct FVector *d6e0b7821e; // 0x3d0(0x0c)
	float *706c733206; // 0x3dc(0x04)
	float *798fbf4376; // 0x3e0(0x04)
	float *2140231fbc; // 0x3e4(0x04)
	struct FVector *3b23e36cb0; // 0x3e8(0x0c)
	struct FVector *ff6cbe42b6; // 0x3f4(0x0c)
	float *d094d992c4; // 0x400(0x04)
	char pad_404[0x8]; // 0x404(0x08)
	float MaxSimulationTimeStep; // 0x40c(0x04)
	int32 MaxSimulationIterations; // 0x410(0x04)
	float MaxDepenetrationWithGeometry; // 0x414(0x04)
	float MaxDepenetrationWithGeometryAsProxy; // 0x418(0x04)
	float MaxDepenetrationWithPawn; // 0x41c(0x04)
	float MaxDepenetrationWithPawnAsProxy; // 0x420(0x04)
	float *d96e75a69b; // 0x424(0x04)
	float *328143b81d; // 0x428(0x04)
	float *353663b1d9; // 0x42c(0x04)
	float *4490412dcb; // 0x430(0x04)
	float *4a53713c71; // 0x434(0x04)
	float *dbf6f973a9; // 0x438(0x04)
	float *95402cbdcf; // 0x43c(0x04)
	float *217c092b35; // 0x440(0x04)
	enum class ENetworkSmoothingMode NetworkSmoothingMode; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	float *d489da6ed0; // 0x448(0x04)
	float *c12b5bd00f; // 0x44c(0x04)
	float *b066376fab; // 0x450(0x04)
	float *b24861907a; // 0x454(0x04)
	float LedgeCheckThreshold; // 0x458(0x04)
	float JumpOutOfWaterPitch; // 0x45c(0x04)
	struct F*771b3804ba CurrentFloor; // 0x460(0x98)
	enum class EMovementMode DefaultLandMovementMode; // 0x4f8(0x01)
	enum class EMovementMode DefaultWaterMovementMode; // 0x4f9(0x01)
	enum class EMovementMode *138fe62722; // 0x4fa(0x01)
	char pad_4FB[0x1]; // 0x4fb(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityX : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityY : 1; // 0x4fc(0x01)
	char bImpartBaseVelocityZ : 1; // 0x4fc(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x4fc(0x01)
	char bJustTeleported : 1; // 0x4fc(0x01)
	char *53d48d06f9 : 1; // 0x4fc(0x01)
	char *971521425c : 1; // 0x4fc(0x01)
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x4fd(0x01)
	char bNotifyApex : 1; // 0x4fd(0x01)
	char *be016c8dd7 : 1; // 0x4fd(0x01)
	char bWantsToCrouch : 1; // 0x4fd(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x4fd(0x01)
	char pad_4FD_5 : 3; // 0x4fd(0x01)
	char pad_4FE[0x2]; // 0x4fe(0x02)
	enum class EStanceMode StanceMode; // 0x500(0x01)
	enum class EStanceMode WantsToStanceMode; // 0x501(0x01)
	char pad_502[0x2]; // 0x502(0x02)
	char bIgnoreBaseRotation : 1; // 0x504(0x01)
	char *ba3af84fa8 : 1; // 0x504(0x01)
	char bAlwaysCheckFloor : 1; // 0x504(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x504(0x01)
	char *9f41cc585f : 1; // 0x504(0x01)
	char *c4ad66876b : 1; // 0x504(0x01)
	char bUseRVOAvoidance : 1; // 0x504(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x504(0x01)
	char pad_505[0xf]; // 0x505(0x0f)
	char *3d670ca35e : 1; // 0x514(0x01)
	char *c226f59fd2 : 1; // 0x514(0x01)
	char *0dbc1fe19f : 1; // 0x514(0x01)
	char pad_514_3 : 2; // 0x514(0x01)
	char bProjectNavMeshWalking : 1; // 0x514(0x01)
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x514(0x01)
	char pad_514_7 : 1; // 0x514(0x01)
	char pad_515[0x13]; // 0x515(0x13)
	float AvoidanceConsiderationRadius; // 0x528(0x04)
	struct FVector *512e308fe4; // 0x52c(0x0c)
	int32 AvoidanceUID; // 0x538(0x04)
	struct F*4c8082789d AvoidanceGroup; // 0x53c(0x04)
	struct F*4c8082789d GroupsToAvoid; // 0x540(0x04)
	struct F*4c8082789d GroupsToIgnore; // 0x544(0x04)
	float AvoidanceWeight; // 0x548(0x04)
	struct FVector *2aeb3bd7b1; // 0x54c(0x0c)
	char pad_558[0xa8]; // 0x558(0xa8)
	float NavMeshProjectionInterval; // 0x600(0x04)
	float *c4f2aeded7; // 0x604(0x04)
	float NavMeshProjectionInterpSpeed; // 0x608(0x04)
	float NavMeshProjectionHeightScaleUp; // 0x60c(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x610(0x04)
	float NavWalkingFloorDistTolerance; // 0x614(0x04)
	char pad_618[0xb0]; // 0x618(0xb0)
	struct F*d33504fa9e *89cb9e5c44; // 0x6c8(0x58)
	char pad_720[0x10]; // 0x720(0x10)
	float *0330c4ec91; // 0x730(0x04)
	char pad_734[0x4]; // 0x734(0x04)
	struct FRootMotionSourceGroup *0bec0f1727; // 0x738(0x100)
	char pad_838[0x98]; // 0x838(0x98)
	struct F*f882669a6a *8ac2e140c6; // 0x8d0(0x40)
	struct FVector *9aff4f664b; // 0x910(0x0c)
	bool *dbe8d61961; // 0x91c(0x01)
	char pad_91D[0x3]; // 0x91d(0x03)
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x920(0x01)
	char pad_920_1 : 7; // 0x920(0x01)
	char pad_921[0xf]; // 0x921(0x0f)

	void *90a546eabb(); // Function Engine.CharacterMovementComponent.*90a546eabb // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad848
	void *71dafd4d4d(); // Function Engine.CharacterMovementComponent.*71dafd4d4d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b5188
	void *2753af4362(); // Function Engine.CharacterMovementComponent.*2753af4362 // Final|Native|Public|BlueprintCallable // @ game+0x67c3268
	void *7f80478723(); // Function Engine.CharacterMovementComponent.*7f80478723 // Final|Native|Public|BlueprintCallable // @ game+0x67c31d0
	void *90faa9aff7(); // Function Engine.CharacterMovementComponent.*90faa9aff7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aedfc
	void *38cde05eb4(); // Function Engine.CharacterMovementComponent.*38cde05eb4 // Native|Public|BlueprintCallable // @ game+0x67a3a5c
	void *95acad96b5(); // Function Engine.CharacterMovementComponent.*95acad96b5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67afbe4
	void *74ec3726b8(); // Function Engine.CharacterMovementComponent.*74ec3726b8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aec9c
	void AddForce(); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a1eec
	void *b32b5ec1b0(); // Function Engine.CharacterMovementComponent.*b32b5ec1b0 // Final|Native|Public|BlueprintCallable // @ game+0x67bd6e0
	void *7069f250d4(); // Function Engine.CharacterMovementComponent.*7069f250d4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67abc50
	void *015f95d0bb(); // Function Engine.CharacterMovementComponent.*015f95d0bb // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aec44
	void *462bbc0ddd(); // Function Engine.CharacterMovementComponent.*462bbc0ddd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4f38
	void *0c170a562b(); // Function Engine.CharacterMovementComponent.*0c170a562b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0b20
	void AddImpulse(); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a2530
	void *db1edcad4b(); // Function Engine.CharacterMovementComponent.*db1edcad4b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4914
	void *84929fc112(); // Function Engine.CharacterMovementComponent.*84929fc112 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67bfe9c
	void *43edff4ae6(); // Function Engine.CharacterMovementComponent.*43edff4ae6 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1fb8
	void *e03b5e7dc5(); // Function Engine.CharacterMovementComponent.*e03b5e7dc5 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aec70
	void *2c03648be5(); // Function Engine.CharacterMovementComponent.*2c03648be5 // Final|Native|Public|BlueprintCallable // @ game+0x67bd64c
	void *c64386b7f7(); // Function Engine.CharacterMovementComponent.*c64386b7f7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1aec
	void *9b005623ac(); // Function Engine.CharacterMovementComponent.*9b005623ac // Native|Public|BlueprintCallable // @ game+0x3911c8
	void *63889f1173(); // Function Engine.CharacterMovementComponent.*63889f1173 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a38df0
	void *ee419b5fd8(); // Function Engine.CharacterMovementComponent.*ee419b5fd8 // Final|Native|Public|BlueprintCallable // @ game+0x67c1b7c
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x67a8180
	void *60ff66bd47(); // Function Engine.CharacterMovementComponent.*60ff66bd47 // Final|Native|Public|BlueprintCallable // @ game+0x67bfe10
	void *8381acd31f(); // Function Engine.CharacterMovementComponent.*8381acd31f // Final|Native|Public|BlueprintCallable // @ game+0x67bfce8
	void *c58989e56b(); // Function Engine.CharacterMovementComponent.*c58989e56b // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x67c3474
	void *e8afdd8741(); // Function Engine.CharacterMovementComponent.*e8afdd8741 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a7c738
	void CapsuleTouched(); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x67a3e60
	void *0f142f89b9(); // Function Engine.CharacterMovementComponent.*0f142f89b9 // Native|Public|BlueprintCallable // @ game+0x67c0fcc
	void *8514fb3447(); // Function Engine.CharacterMovementComponent.*8514fb3447 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac918
	void *11603f3271(); // Function Engine.CharacterMovementComponent.*11603f3271 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67bfd74
	void *4f63486679(); // Function Engine.CharacterMovementComponent.*4f63486679 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4470
	void *2ff626d6d1(); // Function Engine.CharacterMovementComponent.*2ff626d6d1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aaf20
	void *fb06094432(); // Function Engine.CharacterMovementComponent.*fb06094432 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67bd76c
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintFunctionLibrary : UObject {

	void MakeStringAssetReference(); // Function Engine.BlueprintFunctionLibrary.MakeStringAssetReference // Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x67f8b84
};

// Class Engine.StaticMeshActor
// Size: 0x418 (Inherited: 0x408)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x408(0x08)
	bool bStaticMeshReplicateMovement; // 0x410(0x01)
	enum class ENavDataGatheringMode *e2328b2504; // 0x411(0x01)
	char pad_412[0x6]; // 0x412(0x06)
};

// Class Engine.HUD
// Size: 0x4f0 (Inherited: 0x408)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x408(0x08)
	char bLostFocusPaused : 1; // 0x410(0x01)
	char bShowHUD : 1; // 0x410(0x01)
	char bShowDebugInfo : 1; // 0x410(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x410(0x01)
	char bShowOverlays : 1; // 0x410(0x01)
	char bEnableDebugTextShadow : 1; // 0x410(0x01)
	char pad_410_6 : 2; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct TArray<struct AActor*> *e03555f483; // 0x418(0x10)
	char pad_428[0x8]; // 0x428(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x430(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x440(0x10)
	struct UCanvas* Canvas; // 0x450(0x08)
	struct UCanvas* *62b97b751a; // 0x458(0x08)
	struct TArray<struct F*fae183bc56> *fe8d86efa1; // 0x460(0x10)
	struct UClass* *fb904319b5; // 0x470(0x08)
	struct AActor* *463b4dc366; // 0x478(0x08)
	char pad_480[0x70]; // 0x480(0x70)

	void ReceiveHitBoxBeginCursorOver(); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *df4061b0be(); // Function Engine.HUD.*df4061b0be // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x67aaae0
	void AddHitBox(); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a2368
	void Project(); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b91b8
	void ReceiveHitBoxClick(); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *0246c1a4d4(); // Function Engine.HUD.*0246c1a4d4 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67b05d8
	void *fe035ce755(); // Function Engine.HUD.*fe035ce755 // Final|Native|Public|BlueprintCallable // @ game+0x67a88d4
	void *c23d7d1b95(); // Function Engine.HUD.*c23d7d1b95 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a9098
	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0xdb4c0c
	void *96bc26c00a(); // Function Engine.HUD.*96bc26c00a // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x67b9614
	void *7ae35533f0(); // Function Engine.HUD.*7ae35533f0 // Final|Native|Public|BlueprintCallable // @ game+0x67a9860
	void *73cee3e4ca(); // Function Engine.HUD.*73cee3e4ca // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a8240
	void ShowDebugToggleSubCategory(); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x67c3674
	void *2693eb47f0(); // Function Engine.HUD.*2693eb47f0 // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x67af7e8
	void *9947d93eda(); // Function Engine.HUD.*9947d93eda // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x5a9dc28
	void ShowDebugForReticleTargetToggle(); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x67c35b4
	void Deproject(); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67a7b2c
	void ReceiveHitBoxEndCursorOver(); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x22ddc4
	void DrawTexture(); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a9350
	void ReceiveDrawHUD(); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *f7fdb39fc4(); // Function Engine.HUD.*f7fdb39fc4 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a8ebc
	void *872a042141(); // Function Engine.HUD.*872a042141 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x67b9460
	void *54873e95c6(); // Function Engine.HUD.*54873e95c6 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a846c
	void ReceiveHitBoxRelease(); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *40f4edae17(); // Function Engine.HUD.*40f4edae17 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a8b4c
	void ShowDebug(); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x67c3520
	void *c5ab2302bc(); // Function Engine.HUD.*c5ab2302bc // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x67a1a78
};

// Class Engine.Brush
// Size: 0x440 (Inherited: 0x408)
struct ABrush : AActor {
	enum class *5e5e5eab6b *0b26d2092e; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	struct FColor BrushColor; // 0x40c(0x04)
	int32 PolyFlags; // 0x410(0x04)
	char *aea2cb31c1 : 1; // 0x414(0x01)
	char *a1acb90bd3 : 1; // 0x414(0x01)
	char *d80e65bbb7 : 1; // 0x414(0x01)
	char *eac65cc66b : 1; // 0x414(0x01)
	char pad_414_4 : 4; // 0x414(0x01)
	char pad_415[0x3]; // 0x415(0x03)
	struct UModel* Brush; // 0x418(0x08)
	struct UBrushComponent* BrushComponent; // 0x420(0x08)
	char *76c1f76587 : 1; // 0x428(0x01)
	char pad_428_1 : 7; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct TArray<struct F*d4dfcacc3f> *39006b633f; // 0x430(0x10)
};

// Class Engine.Volume
// Size: 0x440 (Inherited: 0x440)
struct AVolume : ABrush {
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotify : UObject {
	char pad_30[0x10]; // 0x30(0x10)

	void GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x67af06c
	void Received_Notify(); // Function Engine.AnimNotify.Received_Notify // Event|Public|BlueprintEvent|Const // @ game+0x22ddc4
};

// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	char pad_60[0x10]; // 0x60(0x10)
	char Attached : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FName SocketName; // 0x78(0x08)
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	void Received_NotifyBegin(); // Function Engine.AnimNotifyState.Received_NotifyBegin // Event|Public|BlueprintEvent|Const // @ game+0x22ddc4
	void Received_NotifyEnd(); // Function Engine.AnimNotifyState.Received_NotifyEnd // Event|Public|BlueprintEvent|Const // @ game+0x22ddc4
	void GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x67af06c
	void Received_NotifyTick(); // Function Engine.AnimNotifyState.Received_NotifyTick // Event|Public|BlueprintEvent|Const // @ game+0x22ddc4
};

// Class Engine.DataTable
// Size: 0x88 (Inherited: 0x30)
struct UDataTable : UObject {
	struct UScriptStruct* *6517b67220; // 0x30(0x08)
	char pad_38[0x50]; // 0x38(0x50)
};

// Class Engine.Character
// Size: 0x880 (Inherited: 0x468)
struct ACharacter : APawn {
	int32 JumpCurrentCount; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct UCapsuleComponent* ProneCapsuleComponent; // 0x470(0x08)
	float *242f050da7; // 0x478(0x04)
	char bPressedJump : 1; // 0x47c(0x01)
	char *1e345fa424 : 1; // 0x47c(0x01)
	char *e8e73f092d : 1; // 0x47c(0x01)
	char *69cbbf7dd8 : 1; // 0x47c(0x01)
	char *8668c6e0ea : 1; // 0x47c(0x01)
	char *148d9ff30a : 1; // 0x47c(0x01)
	char *cb3edb2730 : 1; // 0x47c(0x01)
	char *053cd11427 : 1; // 0x47c(0x01)
	char bWasJumping : 1; // 0x47d(0x01)
	char pad_47D_1 : 7; // 0x47d(0x01)
	char pad_47E[0x2]; // 0x47e(0x02)
	float JumpKeyHoldTime; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct F*c6f03cdc0f *e9a9c9cc0a; // 0x488(0x48)
	bool *c5a0c89d9e; // 0x4d0(0x01)
	char pad_4D1[0x7]; // 0x4d1(0x07)
	struct F*c6f03cdc0f *98c683696e; // 0x4d8(0x48)
	int32 JumpMaxCount; // 0x520(0x04)
	char pad_524[0x4]; // 0x524(0x04)
	struct UCharacterMovementComponent* CharacterMovement; // 0x528(0x08)
	bool *6588c92738; // 0x530(0x01)
	char pad_531[0x3]; // 0x531(0x03)
	float *8bd307ef37; // 0x534(0x04)
	float CrouchedEyeHeight; // 0x538(0x04)
	char bIsCrouched : 1; // 0x53c(0x01)
	char pad_53C_1 : 7; // 0x53c(0x01)
	char pad_53D[0x3]; // 0x53d(0x03)
	struct FVector *25042cf667; // 0x540(0x0c)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct FQuat *f12a07eecd; // 0x550(0x10)
	struct UCapsuleComponent* CapsuleComponent; // 0x560(0x08)
	float JumpMaxHoldTime; // 0x568(0x04)
	char pad_56C[0x4]; // 0x56c(0x04)
	struct USkeletalMeshComponent* Mesh; // 0x570(0x08)
	struct FMulticastDelegate OnReachedJumpApex; // 0x578(0x10)
	char pad_588[0x10]; // 0x588(0x10)
	struct FMulticastDelegate MovementModeChangedDelegate; // 0x598(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x5a8(0x10)
	struct FRootMotionSourceGroup *c561841b57; // 0x5b8(0x100)
	char pad_6B8[0x8]; // 0x6b8(0x08)
	struct F*f882669a6a *d1160de8cb; // 0x6c0(0x40)
	struct TArray<struct F*f1a5265894> *bfa8d6a6b0; // 0x700(0x10)
	struct F*e60dc8ad15 *4ffa8bec6a; // 0x710(0x160)
	char pad_870[0x10]; // 0x870(0x10)

	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x5a13a8c
	void *11701e6c86(); // Function Engine.Character.*11701e6c86 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67bb964
	void *ca8dfc4730(); // Function Engine.Character.*ca8dfc4730 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4d04
	void K2_OnMovementModeChanged(); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *99ee38b5a3(); // Function Engine.Character.*99ee38b5a3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab114
	void OnLanded(); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22ddc4
	void ClientAckGoodMove(); // Function Engine.Character.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x1aa354
	void *f8a8a87a99(); // Function Engine.Character.*f8a8a87a99 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x67a6cd0
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x99a8ec
	void ServerMove(); // Function Engine.Character.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67ba25c
	void *8df9beeffc(); // Function Engine.Character.*8df9beeffc // Native|Public|BlueprintCallable // @ game+0x67c1f34
	void *862039a00c(); // Function Engine.Character.*862039a00c // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x67a47f0
	void *6539aa112e(); // Function Engine.Character.*6539aa112e // Final|Native|Public|BlueprintCallable // @ game+0x67ac940
	void *07222f33a7(); // Function Engine.Character.*07222f33a7 // Native|Public|BlueprintCallable // @ game+0x67b8860
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x67b2090
	void *2bca3b9c1d(); // Function Engine.Character.*2bca3b9c1d // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x67a445c
	void *82691fa526(); // Function Engine.Character.*82691fa526 // Native|Public|BlueprintCallable // @ game+0x67c3efc
	void *7f0a1239ad(); // Function Engine.Character.*7f0a1239ad // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67bb158
	void OnWalkingOffLedge(); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x67b8290
	void CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x67a3d48
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x67b8020
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x67b8084
	void CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67a3d24
	void *866417e915(); // Function Engine.Character.*866417e915 // Native|Public|BlueprintCallable // @ game+0x67c4694
	void IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b132c
	void *1a3809edda(); // Function Engine.Character.*1a3809edda // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67babd8
	void *d3e75881e1(); // Function Engine.Character.*d3e75881e1 // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0xab2968
	void *48d57a327e(); // Function Engine.Character.*48d57a327e // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67a3950
	void *b39a015335(); // Function Engine.Character.*b39a015335 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4cec
	void *5b41406dd2(); // Function Engine.Character.*5b41406dd2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ec790
	void *56fb21a6d3(); // Function Engine.Character.*56fb21a6d3 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab15c
	void OnLaunched(); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x22ddc4
	void K2_OnEndCrouch(); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *0bf24fb690(); // Function Engine.Character.*0bf24fb690 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1d10
	void *779dfbaabd(); // Function Engine.Character.*779dfbaabd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1d34
	void *fceda4a8d6(); // Function Engine.Character.*fceda4a8d6 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67ba658
	void Crouch(); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x67a7a48
	void K2_UpdateCustomMovement(); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *729216e5f2(); // Function Engine.Character.*729216e5f2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x59b82bc
	void *7adff78f36(); // Function Engine.Character.*7adff78f36 // Native|Public|BlueprintCallable // @ game+0x67c41f0
	void *82e7d06301(); // Function Engine.Character.*82e7d06301 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67bb620
	void LaunchCharacter(); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67b7534
	void K2_OnStartCrouch(); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class Engine.Controller
// Size: 0x488 (Inherited: 0x408)
struct AController : AActor {
	char pad_408[0x8]; // 0x408(0x08)
	struct FName StateName; // 0x410(0x08)
	char pad_418[0x10]; // 0x418(0x10)
	struct USceneComponent* TransformComponent; // 0x428(0x08)
	struct FRotator *e40e8dabb2; // 0x430(0x0c)
	char pad_43C[0xc]; // 0x43c(0x0c)
	struct ACharacter* Character; // 0x448(0x08)
	char pad_450[0x10]; // 0x450(0x10)
	char *a05757ae10 : 1; // 0x460(0x01)
	char *68b329ef67 : 1; // 0x460(0x01)
	char pad_460_2 : 6; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct APlayerState* PlayerState; // 0x468(0x08)
	struct APawn* Pawn; // 0x470(0x08)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x478(0x10)

	void *d35e8bc247(); // Function Engine.Controller.*d35e8bc247 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0d24
	void *6e6db3fd99(); // Function Engine.Controller.*6e6db3fd99 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b181c
	void *205665ad55(); // Function Engine.Controller.*205665ad55 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67bf008
	void *36e4787827(); // Function Engine.Controller.*36e4787827 // Native|Public|BlueprintCallable // @ game+0x5a3e1e0
	void *8a22f11f09(); // Function Engine.Controller.*8a22f11f09 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b77b8
	void *1e35afc686(); // Function Engine.Controller.*1e35afc686 // Final|Native|Public|BlueprintCallable // @ game+0x67a40b4
	void *27250128fa(); // Function Engine.Controller.*27250128fa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1cf4
	void *f2a72b13b5(); // Function Engine.Controller.*f2a72b13b5 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aca34
	void K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b4f90
	void *19175e6cf7(); // Function Engine.Controller.*19175e6cf7 // Native|Public|BlueprintCallable // @ game+0x67b9944
	void *15f0d36de2(); // Function Engine.Controller.*15f0d36de2 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0xc920d8
	void ReceiveInstigatedAnyDamage(); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void *ceaebf3734(); // Function Engine.Controller.*ceaebf3734 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1a74
	void *ee8f3b4c63(); // Function Engine.Controller.*ee8f3b4c63 // Native|Public|BlueprintCallable // @ game+0x67c015c
	void *ed16c719d1(); // Function Engine.Controller.*ed16c719d1 // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x67a6100
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0xa71730
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x67c4208
	void *bd544094f0(); // Function Engine.Controller.*bd544094f0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1960
	void *128814cef7(); // Function Engine.Controller.*128814cef7 // Native|Public|BlueprintCallable // @ game+0x59fffd0
	void Possess(); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x59f0ea8
	void *70f7882012(); // Function Engine.Controller.*70f7882012 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1938
	void GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac48c
	void *a590a631c1(); // Function Engine.Controller.*a590a631c1 // Native|Public|BlueprintCallable // @ game+0x67c472c
	void *c9e2d88f05(); // Function Engine.Controller.*c9e2d88f05 // Native|Public|BlueprintCallable // @ game+0x67b995c
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x59a712c
};

// Class Engine.SpringArmComponent
// Size: 0x560 (Inherited: 0x4d0)
struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x4d0(0x04)
	struct FVector SocketOffset; // 0x4d4(0x0c)
	struct FVector TargetOffset; // 0x4e0(0x0c)
	float ProbeSize; // 0x4ec(0x04)
	enum class ECollisionChannel ProbeChannel; // 0x4f0(0x01)
	char pad_4F1[0x3]; // 0x4f1(0x03)
	char bDoCollisionTest : 1; // 0x4f4(0x01)
	char bUsePawnControlRotation : 1; // 0x4f4(0x01)
	char bInheritPitch : 1; // 0x4f4(0x01)
	char bInheritYaw : 1; // 0x4f4(0x01)
	char bInheritRoll : 1; // 0x4f4(0x01)
	char bLockPitchLag : 1; // 0x4f4(0x01)
	char bLockYawLag : 1; // 0x4f4(0x01)
	char bLockRollLag : 1; // 0x4f4(0x01)
	char bEnableCameraLag : 1; // 0x4f5(0x01)
	char bEnableCameraRotationLag : 1; // 0x4f5(0x01)
	char bUseCameraLagSubstepping : 1; // 0x4f5(0x01)
	char bDrawDebugLagMarkers : 1; // 0x4f5(0x01)
	char pad_4F5_4 : 4; // 0x4f5(0x01)
	char pad_4F6[0x2]; // 0x4f6(0x02)
	float CameraLagSpeed; // 0x4f8(0x04)
	float CameraRotationLagSpeed; // 0x4fc(0x04)
	float CameraLagMaxTimeStep; // 0x500(0x04)
	float CameraLagMaxDistance; // 0x504(0x04)
	char pad_508[0x58]; // 0x508(0x58)
};

// Class Engine.PlayerController
// Size: 0x7c0 (Inherited: 0x488)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)
	struct APawn* *52577c9cf3; // 0x498(0x08)
	struct U*bf68adb116* *2118536042; // 0x4a0(0x08)
	char pad_4A8[0x8]; // 0x4a8(0x08)
	struct AHUD* *0174a95ec0; // 0x4b0(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x4b8(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x4c0(0x08)
	bool *a3e4cbf23c; // 0x4c8(0x01)
	char pad_4C9[0x3]; // 0x4c9(0x03)
	struct FRotator TargetViewRotation; // 0x4cc(0x0c)
	char pad_4D8[0xc]; // 0x4d8(0x0c)
	float SmoothTargetViewRotationSpeed; // 0x4e4(0x04)
	struct TArray<struct AActor*> *96a0afe110; // 0x4e8(0x10)
	char pad_4F8[0x4]; // 0x4f8(0x04)
	float *744175bbfd; // 0x4fc(0x04)
	struct FVector *91545f0f7d; // 0x500(0x0c)
	struct FRotator *1aa871ab47; // 0x50c(0x0c)
	int32 *c1e8e27c17; // 0x518(0x04)
	char pad_51C[0x4]; // 0x51c(0x04)
	struct UCheatManager* CheatManager; // 0x520(0x08)
	struct UClass* CheatClass; // 0x528(0x08)
	struct UPlayerInput* PlayerInput; // 0x530(0x08)
	struct TArray<struct F*846c4d8d15> *00b46b06f5; // 0x538(0x10)
	char pad_548[0x90]; // 0x548(0x90)
	char pad_5D8_0 : 3; // 0x5d8(0x01)
	char bPlayerIsWaiting : 1; // 0x5d8(0x01)
	char pad_5D8_4 : 4; // 0x5d8(0x01)
	char pad_5D9[0x3]; // 0x5d9(0x03)
	bool *de61ed25a1; // 0x5dc(0x01)
	char pad_5DD[0x3b]; // 0x5dd(0x3b)
	struct UNetConnection* *4d8dd0dd7c; // 0x618(0x08)
	struct UNetConnection* NetConnection; // 0x620(0x08)
	char pad_628[0xc]; // 0x628(0x0c)
	float InputYawScale; // 0x634(0x04)
	float InputPitchScale; // 0x638(0x04)
	float InputRollScale; // 0x63c(0x04)
	char bShowMouseCursor : 1; // 0x640(0x01)
	char bEnableClickEvents : 1; // 0x640(0x01)
	char bEnableTouchEvents : 1; // 0x640(0x01)
	char bEnableMouseOverEvents : 1; // 0x640(0x01)
	char bEnableTouchOverEvents : 1; // 0x640(0x01)
	char bForceFeedbackEnabled : 1; // 0x640(0x01)
	char pad_640_6 : 2; // 0x640(0x01)
	char pad_641[0x7]; // 0x641(0x07)
	struct TArray<struct FKey> ClickEventKeys; // 0x648(0x10)
	enum class EMouseCursor DefaultMouseCursor; // 0x658(0x01)
	enum class EMouseCursor CurrentMouseCursor; // 0x659(0x01)
	enum class ECollisionChannel DefaultClickTraceChannel; // 0x65a(0x01)
	enum class ECollisionChannel CurrentClickTraceChannel; // 0x65b(0x01)
	float HitResultTraceDistance; // 0x65c(0x04)
	char pad_660[0x80]; // 0x660(0x80)
	struct U*63b14265fa* *a84aed1ac2; // 0x6e0(0x08)
	char pad_6E8_0 : 3; // 0x6e8(0x01)
	char bShouldPerformFullTickWhenPaused : 1; // 0x6e8(0x01)
	char pad_6E8_4 : 4; // 0x6e8(0x01)
	char pad_6E9[0x17]; // 0x6e9(0x17)
	struct UTouchInterface* *353d824492; // 0x700(0x08)
	char pad_708[0x40]; // 0x708(0x40)
	struct ASpectatorPawn* SpectatorPawn; // 0x748(0x08)
	struct FVector SpawnLocation; // 0x750(0x0c)
	char pad_75C[0x4]; // 0x75c(0x04)
	bool *66411eec05; // 0x760(0x01)
	char pad_761[0x1]; // 0x761(0x01)
	uint16 *3d54acd8a3; // 0x762(0x02)
	uint16 *e5470d9a99; // 0x764(0x02)
	char pad_766[0x2]; // 0x766(0x02)
	struct AActor* *2f9c762523; // 0x768(0x08)
	struct AActor* *dd387e3bdd; // 0x770(0x08)
	char pad_778[0x48]; // 0x778(0x48)

	void *9414589630(); // Function Engine.PlayerController.*9414589630 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a5114
	void *234979df54(); // Function Engine.PlayerController.*234979df54 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xbaa058
	void *5b13f1daeb(); // Function Engine.PlayerController.*5b13f1daeb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ade80
	void *d53e3d94e0(); // Function Engine.PlayerController.*d53e3d94e0 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x67a64b0
	void *bee6588995(); // Function Engine.PlayerController.*bee6588995 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x67a63cc
	void *27660cb1ad(); // Function Engine.PlayerController.*27660cb1ad // Final|Native|Public|BlueprintCallable // @ game+0x67b8d28
	void *138bf4a368(); // Function Engine.PlayerController.*138bf4a368 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67ba210
	void *808761b431(); // Function Engine.PlayerController.*808761b431 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a593c
	void *58ac560ffc(); // Function Engine.PlayerController.*58ac560ffc // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad500
	void *207d75612e(); // Function Engine.PlayerController.*207d75612e // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xdb25ac
	void *82afa3a7b9(); // Function Engine.PlayerController.*82afa3a7b9 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcc16f0
	void *5b0dec685d(); // Function Engine.PlayerController.*5b0dec685d // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x67a5230
	void *b6936626e5(); // Function Engine.PlayerController.*b6936626e5 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bbfc4
	void ConsoleKey(); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x67a7128
	void EnableDLSS(); // Function Engine.PlayerController.EnableDLSS // Exec|Native|Public // @ game+0x67a9a34
	void *80ddefce3e(); // Function Engine.PlayerController.*80ddefce3e // Net|NetReliableNative|Event|Public|NetClient // @ game+0x91e80c
	void *0ef4224a1c(); // Function Engine.PlayerController.*0ef4224a1c // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae13c
	void *f403e28121(); // Function Engine.PlayerController.*f403e28121 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae240
	void *58d19cd040(); // Function Engine.PlayerController.*58d19cd040 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bf07c
	void *f2732fc920(); // Function Engine.PlayerController.*f2732fc920 // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4d4c
	void *b9be4bfa5c(); // Function Engine.PlayerController.*b9be4bfa5c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a5de8
	void *1b9bad8269(); // Function Engine.PlayerController.*1b9bad8269 // Final|Native|Public|HasDefaults // @ game+0x67a674c
	void OnRep_TargetViewRotation(); // Function Engine.PlayerController.OnRep_TargetViewRotation // Native|Public // @ game+0x5a13f0c
	void *fbc51829ff(); // Function Engine.PlayerController.*fbc51829ff // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x67a5680
	void *2f8889f3a5(); // Function Engine.PlayerController.*2f8889f3a5 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a5fd8
	void *b56aa098d6(); // Function Engine.PlayerController.*b56aa098d6 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0xbdcc7c
	void SetName(); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x67c10ac
	void *3fc73b6f13(); // Function Engine.PlayerController.*3fc73b6f13 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x8d0ef8
	void *088499e4d0(); // Function Engine.PlayerController.*088499e4d0 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xc9b3d8
	void *eeb30ba19c(); // Function Engine.PlayerController.*eeb30ba19c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67b81f8
	void *dd4c51e1e3(); // Function Engine.PlayerController.*dd4c51e1e3 // Net|NetReliableNative|Event|Public|NetClient // @ game+0xb628ac
	void *2d910e8d72(); // Function Engine.PlayerController.*2d910e8d72 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4f14
	void ServerUpdateLevelVisibility(); // Function Engine.PlayerController.ServerUpdateLevelVisibility // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xba56d4
	void *2918ec2068(); // Function Engine.PlayerController.*2918ec2068 // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x67a62a4
	void SwitchLevel(); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x67c4330
	void *d916e2a943(); // Function Engine.PlayerController.*d916e2a943 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4fac
	void *2c45b56710(); // Function Engine.PlayerController.*2c45b56710 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad350
	void *34a03dd82e(); // Function Engine.PlayerController.*34a03dd82e // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bbd24
	void DecDISPSharpness(); // Function Engine.PlayerController.DecDISPSharpness // Exec|Native|Public // @ game+0x67a7b14
	void *f2ad11dc1b(); // Function Engine.PlayerController.*f2ad11dc1b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xa77e44
	void EnableTAA(); // Function Engine.PlayerController.EnableTAA // Exec|Native|Public // @ game+0x67a9c28
	void *c5ab1bf288(); // Function Engine.PlayerController.*c5ab1bf288 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a6fb4
	void *f01c6ad62c(); // Function Engine.PlayerController.*f01c6ad62c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4dd0
	void *60e8fd4016(); // Function Engine.PlayerController.*60e8fd4016 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bc250
	void *9806f2220c(); // Function Engine.PlayerController.*9806f2220c // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bbf78
	void *2e287bf09c(); // Function Engine.PlayerController.*2e287bf09c // Final|Native|Public|BlueprintCallable // @ game+0x67c4158
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x5a415ac
	void *2a9d12a666(); // Function Engine.PlayerController.*2a9d12a666 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a6338
	void *8cada05a90(); // Function Engine.PlayerController.*8cada05a90 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a5804
	void *0fc967239a(); // Function Engine.PlayerController.*0fc967239a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67b9278
	void *c2427940d5(); // Function Engine.PlayerController.*c2427940d5 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bbeb8
	void *d884ceb98a(); // Function Engine.PlayerController.*d884ceb98a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67bc42c
	void *c693ef733b(); // Function Engine.PlayerController.*c693ef733b // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x67a4318
	void *4d701bd8a2(); // Function Engine.PlayerController.*4d701bd8a2 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a6af8
	void *1d880e774d(); // Function Engine.PlayerController.*1d880e774d // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4cd4
	void *498dad03e0(); // Function Engine.PlayerController.*498dad03e0 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a6c14
	void FOV(); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x67a9c54
	void *9fe7d18e40(); // Function Engine.PlayerController.*9fe7d18e40 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad960
	void ServerUpdateCamera(); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67bc124
	void *d98ebc4243(); // Function Engine.PlayerController.*d98ebc4243 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4de8
	void *3347c2ead1(); // Function Engine.PlayerController.*3347c2ead1 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67acfe8
	void *a7b14ec9b0(); // Function Engine.PlayerController.*a7b14ec9b0 // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x67a4d1c
	void *d36fe357cf(); // Function Engine.PlayerController.*d36fe357cf // Native|Public|BlueprintCallable // @ game+0x67c2f70
	void *d488eaf060(); // Function Engine.PlayerController.*d488eaf060 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5aa5a60
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x67b99a0
	void *6da664389f(); // Function Engine.PlayerController.*6da664389f // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67aecf4
	void *9d04a2a54b(); // Function Engine.PlayerController.*9d04a2a54b // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x67a6920
	void *6f13f17807(); // Function Engine.PlayerController.*6f13f17807 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67acd08
	void *2c95dc8fa1(); // Function Engine.PlayerController.*2c95dc8fa1 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67adb9c
	void *693b11e6e8(); // Function Engine.PlayerController.*693b11e6e8 // Final|Native|Public|BlueprintCallable // @ game+0x67b9034
	void *125ef13e4f(); // Function Engine.PlayerController.*125ef13e4f // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67ba028
	void StartFire(); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x67c3b2c
	void *1cd2062287(); // Function Engine.PlayerController.*1cd2062287 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bd144
	void *83f70de997(); // Function Engine.PlayerController.*83f70de997 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67ba0dc
	void ClientRetryClientRestart(); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5aa0dc0
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x67b8458
	void *8ad4a54cf6(); // Function Engine.PlayerController.*8ad4a54cf6 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ad1a0
	void *9674400037(); // Function Engine.PlayerController.*9674400037 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0520
	void *930cb558f2(); // Function Engine.PlayerController.*930cb558f2 // Native|Public|BlueprintCallable // @ game+0x67be6e4
	void *b41250e3ae(); // Function Engine.PlayerController.*b41250e3ae // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x67bbd70
	void *a31819daef(); // Function Engine.PlayerController.*a31819daef // Final|Native|Public|BlueprintCallable // @ game+0x67a42a8
	void IncDISPSharpness(); // Function Engine.PlayerController.IncDISPSharpness // Exec|Native|Public // @ game+0x67b10f4
	void LocalTravel(); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x67b78fc
	void *c11f968a6d(); // Function Engine.PlayerController.*c11f968a6d // Net|NetReliableNative|Event|Public|NetClient // @ game+0xdbbef0
	void *a235b1fcfa(); // Function Engine.PlayerController.*a235b1fcfa // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a5ac8
	void AddYawInput(); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x67a3640
	void *90c95e2107(); // Function Engine.PlayerController.*90c95e2107 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xdbc50c
	void *7fa4dd7244(); // Function Engine.PlayerController.*7fa4dd7244 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a6590
	void *c56a5327cc(); // Function Engine.PlayerController.*c56a5327cc // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0xb4d388
	void *977cb2e1ec(); // Function Engine.PlayerController.*977cb2e1ec // Net|Native|Event|Public|NetClient // @ game+0x67a555c
	void *bad6120f6b(); // Function Engine.PlayerController.*bad6120f6b // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x67a5e00
	void *71377d6c43(); // Function Engine.PlayerController.*71377d6c43 // Final|Native|Public|BlueprintCallable // @ game+0x67c0e5c
	void *c7482859e6(); // Function Engine.PlayerController.*c7482859e6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1844
	void SendToConsole(); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x67b9f64
	void *46d7f5c82f(); // Function Engine.PlayerController.*46d7f5c82f // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67ba1c4
	void *90034fd277(); // Function Engine.PlayerController.*90034fd277 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bbcd8
	void AddPitchInput(); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x67a2dd4
	void *894d5aab0c(); // Function Engine.PlayerController.*894d5aab0c // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a620c
	void *8a25e3a3ec(); // Function Engine.PlayerController.*8a25e3a3ec // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4d34
	void *91fb0f1f53(); // Function Engine.PlayerController.*91fb0f1f53 // Native|Public|BlueprintCallable // @ game+0x67c3138
	void Camera(); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x67a3be8
	void DeprojectMousePositionToWorld(); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67a7cc0
	void *e7688c5ab7(); // Function Engine.PlayerController.*e7688c5ab7 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0d4c
	void *73cf67a757(); // Function Engine.PlayerController.*73cf67a757 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ae4f8
	void *86b835f913(); // Function Engine.PlayerController.*86b835f913 // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67acbd8
	void *52a0531220(); // Function Engine.PlayerController.*52a0531220 // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bbc2c
	void *a41eb8f989(); // Function Engine.PlayerController.*a41eb8f989 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67c48ec
	void *929bd9b49d(); // Function Engine.PlayerController.*929bd9b49d // Native|Public|BlueprintCallable // @ game+0x67a1588
	void *6b7eb93d95(); // Function Engine.PlayerController.*6b7eb93d95 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bbacc
	void *162964937a(); // Function Engine.PlayerController.*162964937a // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67bc3e0
	void *4e12e82776(); // Function Engine.PlayerController.*4e12e82776 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67a7dc8
	void *5d69b1297b(); // Function Engine.PlayerController.*5d69b1297b // Net|NetReliableNative|Event|Public|NetClient // @ game+0xcd8418
	void *07bb10948f(); // Function Engine.PlayerController.*07bb10948f // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a5d24
	void *7f7a5cd988(); // Function Engine.PlayerController.*7f7a5cd988 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a5c90
	void *b94ca05f4b(); // Function Engine.PlayerController.*b94ca05f4b // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5aa5480
	void *f330680f5c(); // Function Engine.PlayerController.*f330680f5c // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x67bc394
	void *c0e5d05621(); // Function Engine.PlayerController.*c0e5d05621 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5a14140
	void *8e5ce08dca(); // Function Engine.PlayerController.*8e5ce08dca // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ace78
	void *23d2eeffeb(); // Function Engine.PlayerController.*23d2eeffeb // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x67bc348
	void ToggleSpeaking(); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x67c44c0
	void *a5bdbf96a2(); // Function Engine.PlayerController.*a5bdbf96a2 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ada54
	void ClientRestart(); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x92e770
	void *e5134f0647(); // Function Engine.PlayerController.*e5134f0647 // Final|Native|Public|BlueprintCallable // @ game+0x67bff38
	void *a3ca820659(); // Function Engine.PlayerController.*a3ca820659 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67adf74
	void AddRollInput(); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x67a3218
	void *36545cdce1(); // Function Engine.PlayerController.*36545cdce1 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x67a4e7c
	void *adaa944e6a(); // Function Engine.PlayerController.*adaa944e6a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67c49e0
	void *2fa8097c4a(); // Function Engine.PlayerController.*2fa8097c4a // Net|NetReliableNative|Event|Public|NetClient // @ game+0xced87c
};

// Class Engine.PlayerState
// Size: 0x498 (Inherited: 0x408)
struct APlayerState : AInfo {
	bool Ping; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	int32 PlayerId; // 0x40c(0x04)
	struct UClass* *aff3dca9f7; // 0x410(0x08)
	int32 StartTime; // 0x418(0x04)
	char bIsSpectator : 1; // 0x41c(0x01)
	char *9f71f07fd6 : 1; // 0x41c(0x01)
	char bIsABot : 1; // 0x41c(0x01)
	char pad_41C_3 : 1; // 0x41c(0x01)
	char *7750580eb7 : 1; // 0x41c(0x01)
	char *019f6d2826 : 1; // 0x41c(0x01)
	char pad_41C_6 : 2; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	struct FUniqueNetIdRepl UniqueId; // 0x420(0x18)
	struct FString PlayerName; // 0x438(0x10)
	char pad_448[0x10]; // 0x448(0x10)
	struct FString *de846607a1; // 0x458(0x10)
	char pad_468[0x10]; // 0x468(0x10)
	float Score; // 0x478(0x04)
	char pad_47C[0x18]; // 0x47c(0x18)
	bool *4f96db3413; // 0x494(0x01)
	char pad_495[0x3]; // 0x495(0x03)

	void OnRep_bIsInactive(); // Function Engine.PlayerState.OnRep_bIsInactive // Native|Public // @ game+0x5fb79c
	void ReceiveCopyProperties(); // Function Engine.PlayerState.ReceiveCopyProperties // Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x5a77d08
	void ReceiveOverrideWith(); // Function Engine.PlayerState.ReceiveOverrideWith // Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void OnRep_Score(); // Function Engine.PlayerState.OnRep_Score // Native|Public // @ game+0xdb4c0c
	void OnRep_PlayerName(); // Function Engine.PlayerState.OnRep_PlayerName // Native|Public // @ game+0x5fc3d0
};

// Class Engine.SkeletalMeshActor
// Size: 0x490 (Inherited: 0x408)
struct ASkeletalMeshActor : AActor {
	char pad_408[0x8]; // 0x408(0x08)
	char bShouldDoAnimNotifies : 1; // 0x410(0x01)
	char bWakeOnLevelStart : 1; // 0x410(0x01)
	char pad_410_2 : 6; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x418(0x08)
	struct USkeletalMesh* *986438ef50; // 0x420(0x08)
	struct UPhysicsAsset* *eddbd99a3c; // 0x428(0x08)
	struct UMaterialInterface* *71ff89817b; // 0x430(0x08)
	struct UMaterialInterface* *36ea37d0f9; // 0x438(0x08)
	char pad_440[0x50]; // 0x440(0x50)

	void OnRep_ReplicatedPhysAsset(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedPhysAsset // Native|Public // @ game+0x5fc3d0
	void OnRep_ReplicatedMaterial1(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial1 // Native|Public // @ game+0x5a77d08
	void OnRep_ReplicatedMesh(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMesh // Native|Public // @ game+0xdb4c0c
	void OnRep_ReplicatedMaterial0(); // Function Engine.SkeletalMeshActor.OnRep_ReplicatedMaterial0 // Native|Public // @ game+0x5fb79c
};

// Class Engine.SaveGame
// Size: 0x30 (Inherited: 0x30)
struct USaveGame : UObject {
};

// Class Engine.*9de72ef8ed
// Size: 0xa20 (Inherited: 0xa00)
struct U*9de72ef8ed : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x9f8(0x04)
	struct UBodySetup* *461f84b5c9; // 0xa00(0x08)
	char *9bba926356 : 1; // 0xa08(0x01)
	char *c85f8034f3 : 1; // 0xa08(0x01)
	char *838f7c099e : 1; // 0xa08(0x01)
	char pad_A0C_3 : 5; // 0xa0c(0x01)
	char pad_A0D[0x3]; // 0xa0d(0x03)
	struct UClass* AreaClass; // 0xa10(0x08)
	char pad_A18[0x8]; // 0xa18(0x08)
};

// Class Engine.TargetPoint
// Size: 0x408 (Inherited: 0x408)
struct ATargetPoint : AActor {
};

// Class Engine.GameStateBase
// Size: 0x448 (Inherited: 0x408)
struct AGameStateBase : AInfo {
	struct UClass* GameModeClass; // 0x408(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x410(0x08)
	struct UClass* SpectatorClass; // 0x418(0x08)
	struct TArray<struct APlayerState*> PlayerArray; // 0x420(0x10)
	bool *b3165990bb; // 0x430(0x01)
	char pad_431[0x3]; // 0x431(0x03)
	float *0f4cbda7e4; // 0x434(0x04)
	float *beee9616a2; // 0x438(0x04)
	float *72d0135ba7; // 0x43c(0x04)
	char pad_440[0x8]; // 0x440(0x08)

	void *3a712c20b7(); // Function Engine.GameStateBase.*3a712c20b7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aff78
	void *a2a2e5aa70(); // Function Engine.GameStateBase.*a2a2e5aa70 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0ee0
	void *16cf218094(); // Function Engine.GameStateBase.*16cf218094 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5abf348
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameStateBase.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0xbd25e0
	void OnRep_SpectatorClass(); // Function Engine.GameStateBase.OnRep_SpectatorClass // Native|Protected // @ game+0x3911c8
	void OnRep_GameModeClass(); // Function Engine.GameStateBase.OnRep_GameModeClass // Native|Protected // @ game+0xcc52d8
	void *a8f929f84f(); // Function Engine.GameStateBase.*a8f929f84f // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67afed0
	void *32d9e0fcf6(); // Function Engine.GameStateBase.*32d9e0fcf6 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3a1cc
	void *c133fde381(); // Function Engine.GameStateBase.*c133fde381 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0e90
	void OnRep_ReplicatedHasBegunPlay(); // Function Engine.GameStateBase.OnRep_ReplicatedHasBegunPlay // Native|Protected // @ game+0x5a61e50
	void *3712aecb1b(); // Function Engine.GameStateBase.*3712aecb1b // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aec44
};

// Class Engine.GameState
// Size: 0x468 (Inherited: 0x448)
struct AGameState : AGameStateBase {
	struct FName MatchState; // 0x448(0x08)
	struct FName PreviousMatchState; // 0x450(0x08)
	int32 ElapsedTime; // 0x458(0x04)
	char pad_45C[0xc]; // 0x45c(0x0c)

	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0xb13710
	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x5a06cb4
};

// Class Engine.BoxComponent
// Size: 0xa30 (Inherited: 0xa20)
struct UBoxComponent : U*9de72ef8ed {
	struct FVector BoxExtent; // 0xa18(0x0c)
	char pad_A2C[0x4]; // 0xa2c(0x04)

	void *98e9dedda9(); // Function Engine.BoxComponent.*98e9dedda9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea640
	void *0f9344886a(); // Function Engine.BoxComponent.*0f9344886a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67eca98
	void *47e32f31b3(); // Function Engine.BoxComponent.*47e32f31b3 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6808130
};

// Class Engine.ProjectileMovementComponent
// Size: 0x310 (Inherited: 0x250)
struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x248(0x04)
	float MaxSpeed; // 0x24c(0x04)
	char bRotationFollowsVelocity : 1; // 0x250(0x01)
	char bShouldBounce : 1; // 0x250(0x01)
	char bInitialVelocityInLocalSpace : 1; // 0x250(0x01)
	char bForceSubStepping : 1; // 0x250(0x01)
	char bSimulationEnabled : 1; // 0x250(0x01)
	char bSweepCollision : 1; // 0x250(0x01)
	char bIsHomingProjectile : 1; // 0x250(0x01)
	char bBounceAngleAffectsFriction : 1; // 0x250(0x01)
	char bIsSliding : 1; // 0x251(0x01)
	char bInterpMovement : 1; // 0x251(0x01)
	char bInterpRotation : 1; // 0x251(0x01)
	float PreviousHitTime; // 0x254(0x04)
	struct FVector PreviousHitNormal; // 0x258(0x0c)
	float ProjectileGravityScale; // 0x264(0x04)
	float *e4135d57da; // 0x268(0x04)
	float Bounciness; // 0x26c(0x04)
	float Friction; // 0x270(0x04)
	float BounceVelocityStopSimulatingThreshold; // 0x274(0x04)
	float MinFrictionFraction; // 0x278(0x04)
	struct FMulticastDelegate OnProjectileBounce; // 0x280(0x10)
	struct FMulticastDelegate OnProjectileStop; // 0x290(0x10)
	float HomingAccelerationMagnitude; // 0x2a0(0x04)
	struct USceneComponent* HomingTargetComponent; // 0x2a4(0x08)
	float MaxSimulationTimeStep; // 0x2ac(0x04)
	int32 MaxSimulationIterations; // 0x2b0(0x04)
	int32 BounceAdditionalIterations; // 0x2b4(0x04)
	float InterpLocationTime; // 0x2b8(0x04)
	float InterpRotationTime; // 0x2bc(0x04)
	float InterpLocationMaxLagDistance; // 0x2c0(0x04)
	float InterpLocationSnapToTargetDistance; // 0x2c4(0x04)
	char pad_2C9[0x47]; // 0x2c9(0x47)

	void *831dfc768a(); // Function Engine.ProjectileMovementComponent.*831dfc768a // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6814598
	void OnProjectileBounceDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults // @ game+0x22ddc4
	void *00e85c5c6c(); // Function Engine.ProjectileMovementComponent.*00e85c5c6c // Native|Public|BlueprintCallable // @ game+0x680d8d8
	void StopSimulating(); // Function Engine.ProjectileMovementComponent.StopSimulating // Native|Public|HasOutParms|BlueprintCallable // @ game+0x681bfcc
	void *623c7ebb72(); // Function Engine.ProjectileMovementComponent.*623c7ebb72 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67f1640
	void *09e7043d49(); // Function Engine.ProjectileMovementComponent.*09e7043d49 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67fbca4
	void *b58938a410(); // Function Engine.ProjectileMovementComponent.*b58938a410 // Native|Public|BlueprintCallable // @ game+0x5a41594
	void LimitVelocity(); // Function Engine.ProjectileMovementComponent.LimitVelocity // Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67f4078
	void *6da4a97058(); // Function Engine.ProjectileMovementComponent.*6da4a97058 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67f0ba4
	void OnProjectileStopDelegate__DelegateSignature(); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature // MulticastDelegate|Public|Delegate|HasOutParms // @ game+0x22ddc4
};

// Class Engine.CurveBase
// Size: 0x38 (Inherited: 0x30)
struct UCurveBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	void *278bc785ce(); // Function Engine.CurveBase.*278bc785ce // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0820
	void *09895f0919(); // Function Engine.CurveBase.*09895f0919 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0b48
};

// Class Engine.GameUserSettings
// Size: 0x118 (Inherited: 0x30)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x30(0x01)
	bool bUseDynamicResolution; // 0x31(0x01)
	char pad_32[0x4e]; // 0x32(0x4e)
	uint32 ResolutionSizeX; // 0x80(0x04)
	uint32 ResolutionSizeY; // 0x84(0x04)
	uint32 LastUserConfirmedResolutionSizeX; // 0x88(0x04)
	uint32 LastUserConfirmedResolutionSizeY; // 0x8c(0x04)
	int32 WindowPosX; // 0x90(0x04)
	int32 WindowPosY; // 0x94(0x04)
	int32 FullscreenMode; // 0x98(0x04)
	int32 LastConfirmedFullscreenMode; // 0x9c(0x04)
	int32 PreferredFullscreenMode; // 0xa0(0x04)
	uint32 Version; // 0xa4(0x04)
	int32 AudioQualityLevel; // 0xa8(0x04)
	float FrameRateLimit; // 0xac(0x04)
	char pad_B0[0x4]; // 0xb0(0x04)
	int32 DesiredScreenWidth; // 0xb4(0x04)
	bool bUseDesiredScreenHeight; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32 DesiredScreenHeight; // 0xbc(0x04)
	float LastRecommendedScreenWidth; // 0xc0(0x04)
	float LastRecommendedScreenHeight; // 0xc4(0x04)
	float LastCPUBenchmarkResult; // 0xc8(0x04)
	float LastGPUBenchmarkResult; // 0xcc(0x04)
	struct TArray<float> LastCPUBenchmarkSteps; // 0xd0(0x10)
	struct TArray<float> LastGPUBenchmarkSteps; // 0xe0(0x10)
	float LastGPUBenchmarkMultiplier; // 0xf0(0x04)
	bool bUseHDRDisplayOutput; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	int32 HDRDisplayOutputNits; // 0xf8(0x04)
	enum class EGraphicsAPIType GraphicsAPI; // 0xfc(0x01)
	bool bGPUDebug; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FDateTime GPUDebugActiveDateTime; // 0x100(0x08)
	struct FMulticastDelegate OnGameUserSettingsUINeedsUpdate; // 0x108(0x10)

	void *ff165ed312(); // Function Engine.GameUserSettings.*ff165ed312 // Final|Native|Public|BlueprintCallable // @ game+0x6838580
	void *f99fd71384(); // Function Engine.GameUserSettings.*f99fd71384 // Native|Public|BlueprintCallable // @ game+0x6830ce4
	void GetResolutionScaleInformation(); // Function Engine.GameUserSettings.GetResolutionScaleInformation // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6830df4
	void *b90135664f(); // Function Engine.GameUserSettings.*b90135664f // Native|Public|BlueprintCallable // @ game+0x682f24c
	void *d578d2b56d(); // Function Engine.GameUserSettings.*d578d2b56d // Final|Native|Public|BlueprintCallable // @ game+0x683831c
	void *aa506a5c7e(); // Function Engine.GameUserSettings.*aa506a5c7e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68311f0
	void *4e377c31c3(); // Function Engine.GameUserSettings.*4e377c31c3 // Final|Native|Public|BlueprintCallable // @ game+0x68384e4
	void *12bb8cc58b(); // Function Engine.GameUserSettings.*12bb8cc58b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6832190
	void *1b246fdda3(); // Function Engine.GameUserSettings.*1b246fdda3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682fd24
	void *e712800bb5(); // Function Engine.GameUserSettings.*e712800bb5 // Native|Public|BlueprintCallable // @ game+0x6246d90
	void *005b909a0a(); // Function Engine.GameUserSettings.*005b909a0a // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x683a0b4
	void *8d0b38839e(); // Function Engine.GameUserSettings.*8d0b38839e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6831cbc
	void *e8aec7750c(); // Function Engine.GameUserSettings.*e8aec7750c // Final|Native|Public|BlueprintCallable // @ game+0x6838290
	void *e6f6ac1408(); // Function Engine.GameUserSettings.*e6f6ac1408 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x68311cc
	void *7028637d24(); // Function Engine.GameUserSettings.*7028637d24 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68321c8
	void *694048f68a(); // Function Engine.GameUserSettings.*694048f68a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6831978
	void *34010b7d81(); // Function Engine.GameUserSettings.*34010b7d81 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x682f278
	void *e79626d820(); // Function Engine.GameUserSettings.*e79626d820 // Final|Native|Public|BlueprintCallable // @ game+0x6838618
	void *5bd816f8fd(); // Function Engine.GameUserSettings.*5bd816f8fd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x682fd48
	void *8dfb8f9e1f(); // Function Engine.GameUserSettings.*8dfb8f9e1f // Native|Public|BlueprintCallable // @ game+0x6838880
	void *e4cadefc91(); // Function Engine.GameUserSettings.*e4cadefc91 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x682f290
	void *0919531070(); // Function Engine.GameUserSettings.*0919531070 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682f84c
	void *8d4e34d1cd(); // Function Engine.GameUserSettings.*8d4e34d1cd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6832718
	void *037ccbd6e4(); // Function Engine.GameUserSettings.*037ccbd6e4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6830248
	void *0f8563b766(); // Function Engine.GameUserSettings.*0f8563b766 // Final|Native|Public|BlueprintCallable // @ game+0x6837bac
	void *8816de7f70(); // Function Engine.GameUserSettings.*8816de7f70 // Final|Native|Public|BlueprintCallable // @ game+0x6826e34
	void *fcb1fc9a28(); // Function Engine.GameUserSettings.*fcb1fc9a28 // Final|Native|Public|BlueprintCallable // @ game+0x68389a0
	void *a5f557ab6c(); // Function Engine.GameUserSettings.*a5f557ab6c // Final|Native|Public|BlueprintCallable // @ game+0x6839134
	void *eea34f3e4c(); // Function Engine.GameUserSettings.*eea34f3e4c // Native|Public|BlueprintCallable // @ game+0x6838120
	void *f589301822(); // Function Engine.GameUserSettings.*f589301822 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6831cd0
	void *9df0b9d539(); // Function Engine.GameUserSettings.*9df0b9d539 // Final|Native|Public|BlueprintCallable // @ game+0x682a960
	void *881d90f45c(); // Function Engine.GameUserSettings.*881d90f45c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682f834
	void *9305fec020(); // Function Engine.GameUserSettings.*9305fec020 // Final|Native|Public|BlueprintCallable // @ game+0x68390a8
	void *0f1c6cd359(); // Function Engine.GameUserSettings.*0f1c6cd359 // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x95eea8
	void *b4854cc3a2(); // Function Engine.GameUserSettings.*b4854cc3a2 // Final|Native|Public|BlueprintCallable // @ game+0x6838ae4
	void *9f9b7968e7(); // Function Engine.GameUserSettings.*9f9b7968e7 // Native|Public|BlueprintCallable // @ game+0xac1580
	void *27602f449d(); // Function Engine.GameUserSettings.*27602f449d // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x6838cf0
	void *0d72aba354(); // Function Engine.GameUserSettings.*0d72aba354 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68326b0
	void *929ac2c34a(); // Function Engine.GameUserSettings.*929ac2c34a // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x6830fec
	void LoadSettings(); // Function Engine.GameUserSettings.LoadSettings // Native|Public|BlueprintCallable // @ game+0x682d2c8
	void *37684c88cb(); // Function Engine.GameUserSettings.*37684c88cb // Native|Public|BlueprintCallable // @ game+0xc30d48
	void *35535da485(); // Function Engine.GameUserSettings.*35535da485 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68321ec
	void *83a6aa3d9c(); // Function Engine.GameUserSettings.*83a6aa3d9c // Final|Native|Public|BlueprintCallable // @ game+0x5a45768
	void *a40f28e95a(); // Function Engine.GameUserSettings.*a40f28e95a // Final|Native|Static|Public|BlueprintCallable // @ game+0x682f94c
	void SetResolutionScaleValue(); // Function Engine.GameUserSettings.SetResolutionScaleValue // Final|Native|Public|BlueprintCallable // @ game+0x6838a50
	void *461f940e49(); // Function Engine.GameUserSettings.*461f940e49 // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0x682f22c
	void *b114a91f6a(); // Function Engine.GameUserSettings.*b114a91f6a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682edd0
	void *15262d6763(); // Function Engine.GameUserSettings.*15262d6763 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68321b4
	void *1a1197a006(); // Function Engine.GameUserSettings.*1a1197a006 // Final|Native|Static|Public|BlueprintCallable // @ game+0x59ee978
	void *bbfc2c9965(); // Function Engine.GameUserSettings.*bbfc2c9965 // Final|Native|Public|BlueprintCallable // @ game+0x68392b0
	void *483de8d97e(); // Function Engine.GameUserSettings.*483de8d97e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682f820
	void *a2b82d5ffa(); // Function Engine.GameUserSettings.*a2b82d5ffa // Native|Public|BlueprintCallable // @ game+0x6826e1c
	void *8f07a62fc0(); // Function Engine.GameUserSettings.*8f07a62fc0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682ede4
	void *a0cc2f9b1f(); // Function Engine.GameUserSettings.*a0cc2f9b1f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68326f4
	void *f17918e2e4(); // Function Engine.GameUserSettings.*f17918e2e4 // Final|Native|Public|BlueprintCallable // @ game+0x6838914
	void *791bb98775(); // Function Engine.GameUserSettings.*791bb98775 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682a51c
	void *edc46fa1a0(); // Function Engine.GameUserSettings.*edc46fa1a0 // Final|Native|Public|BlueprintCallable // @ game+0x68383a8
	void *a0bcd9f088(); // Function Engine.GameUserSettings.*a0bcd9f088 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68307bc
	void SaveSettings(); // Function Engine.GameUserSettings.SaveSettings // Native|Public|BlueprintCallable // @ game+0x5a6f65c
	void *d99fdc2874(); // Function Engine.GameUserSettings.*d99fdc2874 // Final|Native|Public|BlueprintCallable // @ game+0x6838d7c
	void *ea56882abd(); // Function Engine.GameUserSettings.*ea56882abd // Final|Native|Public|BlueprintCallable // @ game+0x6838458
	void *20ab35464e(); // Function Engine.GameUserSettings.*20ab35464e // Native|Public|BlueprintCallable // @ game+0x5a4b2b4
	void *714d4f65b8(); // Function Engine.GameUserSettings.*714d4f65b8 // Final|Native|Public|BlueprintCallable // @ game+0x682d64c
	void *d685dce1b6(); // Function Engine.GameUserSettings.*d685dce1b6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x68307d0
	void *f390c26976(); // Function Engine.GameUserSettings.*f390c26976 // Native|Public|BlueprintCallable // @ game+0x5a4b204
	void *922b274ba7(); // Function Engine.GameUserSettings.*922b274ba7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x682f010
};

// Class Engine.GameInstance
// Size: 0x1f0 (Inherited: 0x30)
struct UGameInstance : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct U*6653cc84aa* *6653cc84aa; // 0x38(0x08)
	char pad_40[0x90]; // 0x40(0x90)
	struct U*41ff50be2e* *41ff50be2e; // 0xd0(0x08)
	char pad_D8[0x30]; // 0xd8(0x30)
	struct FMulticastDelegate OnKillcamLoadingFinished; // 0x108(0x10)
	char pad_118[0xd8]; // 0x118(0xd8)

	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void HandleTravelError(); // Function Engine.GameInstance.HandleTravelError // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void DebugRemovePlayer(); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x67d9f60
	void HandleNetworkError(); // Function Engine.GameInstance.HandleNetworkError // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void KillcamLoadingFinishedDelegate__DelegateSignature(); // DelegateFunction Engine.GameInstance.KillcamLoadingFinishedDelegate__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x22ddc4
	void DebugCreatePlayer(); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x67d9ecc
};

// Class Engine.TriggerBase
// Size: 0x410 (Inherited: 0x408)
struct ATriggerBase : AActor {
	struct U*9de72ef8ed* CollisionComponent; // 0x408(0x08)
};

// Class Engine.TriggerBox
// Size: 0x410 (Inherited: 0x410)
struct ATriggerBox : ATriggerBase {
};

// Class Engine.CapsuleComponent
// Size: 0xa30 (Inherited: 0xa20)
struct UCapsuleComponent : U*9de72ef8ed {
	float CapsuleHalfHeight; // 0xa18(0x04)
	float CapsuleRadius; // 0xa1c(0x04)
	float CapsuleHeight; // 0xa20(0x04)
	char pad_A2C[0x4]; // 0xa2c(0x04)

	void *5e7387deea(); // Function Engine.CapsuleComponent.*5e7387deea // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea788
	void *6c17800325(); // Function Engine.CapsuleComponent.*6c17800325 // Native|Public|BlueprintCallable // @ game+0x67be96c
	void *15572a149a(); // Function Engine.CapsuleComponent.*15572a149a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ecafc
	void *baff305a0b(); // Function Engine.CapsuleComponent.*baff305a0b // Native|Public|BlueprintCallable // @ game+0x67bea00
	void *00f4749d00(); // Function Engine.CapsuleComponent.*00f4749d00 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea73c
	void *4ecc54f469(); // Function Engine.CapsuleComponent.*4ecc54f469 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ecad8
	void *01db1cc2f0(); // Function Engine.CapsuleComponent.*01db1cc2f0 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ecc1c
	void *f7e693ed7e(); // Function Engine.CapsuleComponent.*f7e693ed7e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea6e8
	void *c03bd11c98(); // Function Engine.CapsuleComponent.*c03bd11c98 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea69c
	void *6b957cfb76(); // Function Engine.CapsuleComponent.*6b957cfb76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ecac0
	void *038749a2fe(); // Function Engine.CapsuleComponent.*038749a2fe // Final|Native|Public|BlueprintCallable // @ game+0x6808344
	void *58f998cca1(); // Function Engine.CapsuleComponent.*58f998cca1 // Native|Public|BlueprintCallable // @ game+0x67bea98
	void *4fba3aec1b(); // Function Engine.CapsuleComponent.*4fba3aec1b // Final|Native|Public|BlueprintCallable // @ game+0x68085c8
	void *fed358e535(); // Function Engine.CapsuleComponent.*fed358e535 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea8bc
	void *2e030b6a4a(); // Function Engine.CapsuleComponent.*2e030b6a4a // Final|Native|Public|BlueprintCallable // @ game+0x68084dc
	void *7f740f17f8(); // Function Engine.CapsuleComponent.*7f740f17f8 // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ecb14
	void *b260e3db57(); // Function Engine.CapsuleComponent.*b260e3db57 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67eaaf0
};

// Class Engine.PhysicsVolume
// Size: 0x458 (Inherited: 0x440)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x440(0x04)
	int32 Priority; // 0x444(0x04)
	float FluidFriction; // 0x448(0x04)
	char bWaterVolume : 1; // 0x44c(0x01)
	char bPhysicsOnContact : 1; // 0x44c(0x01)
	char pad_44C_2 : 6; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	bool *1ffd8a4414; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class Engine.DebugCameraController
// Size: 0x810 (Inherited: 0x7c0)
struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x7c0(0x01)
	char *a68cb7b46b : 1; // 0x7c0(0x01)
	char pad_7C0_2 : 6; // 0x7c0(0x01)
	char pad_7C1[0x7]; // 0x7c1(0x07)
	struct U*7516137630* *fbb1cd85af; // 0x7c8(0x08)
	char pad_7D0[0x20]; // 0x7d0(0x20)
	float SpeedScale; // 0x7f0(0x04)
	float InitialMaxSpeed; // 0x7f4(0x04)
	float InitialAccel; // 0x7f8(0x04)
	float InitialDecel; // 0x7fc(0x04)
	char pad_800[0x10]; // 0x800(0x10)

	void *d4e8039368(); // Function Engine.DebugCameraController.*d4e8039368 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0130
	void ReceiveOnActorSelected(); // Function Engine.DebugCameraController.ReceiveOnActorSelected // Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22ddc4
	void ReceiveOnActivate(); // Function Engine.DebugCameraController.ReceiveOnActivate // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ReceiveOnDeactivate(); // Function Engine.DebugCameraController.ReceiveOnDeactivate // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *5048ac03eb(); // Function Engine.DebugCameraController.*5048ac03eb // Final|Native|Public|BlueprintCallable // @ game+0x67c1414
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x67c365c
	void *2a0c85c652(); // Function Engine.DebugCameraController.*2a0c85c652 // Final|Native|Public|BlueprintCallable // @ game+0x67c445c
};

// Class Engine.Channel
// Size: 0x70 (Inherited: 0x30)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x38]; // 0x38(0x38)
};

// Class Engine.ActorChannel
// Size: 0x370 (Inherited: 0x70)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x70(0x08)
	char pad_78[0x2f8]; // 0x78(0x2f8)
};

// Class Engine.DemoActorChannel
// Size: 0x390 (Inherited: 0x370)
struct UDemoActorChannel : UActorChannel {
	char pad_370[0x20]; // 0x370(0x20)
};

// Class Engine.NavigationObjectBase
// Size: 0x430 (Inherited: 0x408)
struct ANavigationObjectBase : AActor {
	char pad_408[0x8]; // 0x408(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x410(0x08)
	struct UBillboardComponent* *e995b1374d; // 0x418(0x08)
	struct UBillboardComponent* *3a07fdffe9; // 0x420(0x08)
	char *13444ae17a : 1; // 0x428(0x01)
	char pad_428_1 : 7; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
};

// Class Engine.PlayerStart
// Size: 0x438 (Inherited: 0x430)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x430(0x08)
};

// Class Engine.CheatManager
// Size: 0x80 (Inherited: 0x30)
struct UCheatManager : UObject {
	struct ADebugCameraController* *fd70a6f96b; // 0x30(0x08)
	struct UClass* DebugCameraControllerClass; // 0x38(0x08)
	char pad_40[0x40]; // 0x40(0x40)

	void StreamLevelIn(); // Function Engine.CheatManager.StreamLevelIn // Exec|Native|Public // @ game+0x6839ca0
	void LogLoc(); // Function Engine.CheatManager.LogLoc // Exec|Native|Public // @ game+0x68357f8
	void InvertMouse(); // Function Engine.CheatManager.InvertMouse // Final|Exec|Native|Public // @ game+0x6832124
	void FlushLog(); // Function Engine.CheatManager.FlushLog // Exec|Native|Public // @ game+0x682ec28
	void CheatScript(); // Function Engine.CheatManager.CheatScript // Final|Exec|Native|Public // @ game+0x682a5e0
	void TestCollisionDistance(); // Function Engine.CheatManager.TestCollisionDistance // Exec|Native|Public // @ game+0x683a0dc
	void DumpChatState(); // Function Engine.CheatManager.DumpChatState // Exec|Native|Public // @ game+0x682d478
	void PlayersOnly(); // Function Engine.CheatManager.PlayersOnly // Exec|Native|Public|BlueprintCallable // @ game+0x6837200
	void StreamLevelOut(); // Function Engine.CheatManager.StreamLevelOut // Exec|Native|Public // @ game+0x6839d34
	void God(); // Function Engine.CheatManager.God // Exec|Native|Public|BlueprintCallable // @ game+0x5a6f5c4
	void ViewSelf(); // Function Engine.CheatManager.ViewSelf // Exec|Native|Public // @ game+0x9f5e54
	void ViewPlayer(); // Function Engine.CheatManager.ViewPlayer // Exec|Native|Public // @ game+0x683b700
	void DebugCapsuleSweepCapture(); // Function Engine.CheatManager.DebugCapsuleSweepCapture // Exec|Native|Public // @ game+0x682cfc4
	void Slomo(); // Function Engine.CheatManager.Slomo // Exec|Native|Public|BlueprintCallable // @ game+0x6839708
	void DestroyPawns(); // Function Engine.CheatManager.DestroyPawns // Exec|Native|Public // @ game+0x615bcd4
	void RebuildNavigation(); // Function Engine.CheatManager.RebuildNavigation // Exec|Native|Public // @ game+0x6837410
	void Summon(); // Function Engine.CheatManager.Summon // Exec|Native|Public // @ game+0x6839ff0
	void DumpPartyState(); // Function Engine.CheatManager.DumpPartyState // Exec|Native|Public // @ game+0x682d490
	void ToggleDebugCamera(); // Function Engine.CheatManager.ToggleDebugCamera // Exec|Native|Public // @ game+0x683aea0
	void DebugCapsuleSweepSize(); // Function Engine.CheatManager.DebugCapsuleSweepSize // Exec|Native|Public // @ game+0x682d13c
	void OnlyLoadLevel(); // Function Engine.CheatManager.OnlyLoadLevel // Exec|Native|Public // @ game+0x6836c80
	void Ghost(); // Function Engine.CheatManager.Ghost // Exec|Native|Public|BlueprintCallable // @ game+0x5a4b204
	void Fly(); // Function Engine.CheatManager.Fly // Exec|Native|Public|BlueprintCallable // @ game+0x5a6f674
	void ToggleAILogging(); // Function Engine.CheatManager.ToggleAILogging // Exec|Native|Public // @ game+0x683ae88
	void DebugCapsuleSweep(); // Function Engine.CheatManager.DebugCapsuleSweep // Exec|Native|Public // @ game+0xc2dbb8
	void BugItGo(); // Function Engine.CheatManager.BugItGo // Exec|Native|Public // @ game+0x6828a14
	void DestroyAllPawnsExceptTarget(); // Function Engine.CheatManager.DestroyAllPawnsExceptTarget // Exec|Native|Public // @ game+0x682d2b0
	void *9806f2220c(); // Function Engine.CheatManager.*9806f2220c // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x6838244
	void SetMouseSensitivityToDefault(); // Function Engine.CheatManager.SetMouseSensitivityToDefault // Final|Exec|Native|Public // @ game+0x68387d4
	void *1dc29b1854(); // Function Engine.CheatManager.*1dc29b1854 // Native|Protected|BlueprintCallable // @ game+0x682d540
	void DamageTarget(); // Function Engine.CheatManager.DamageTarget // Exec|Native|Public|BlueprintCallable // @ game+0x682cf28
	void DebugCapsuleSweepPawn(); // Function Engine.CheatManager.DebugCapsuleSweepPawn // Exec|Native|Public // @ game+0x682d124
	void DumpVoiceMutingState(); // Function Engine.CheatManager.DumpVoiceMutingState // Exec|Native|Public // @ game+0x682d4a8
	void ReceiveEndPlay(); // Function Engine.CheatManager.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void Walk(); // Function Engine.CheatManager.Walk // Exec|Native|Public|BlueprintCallable // @ game+0x5a6f65c
	void ChangeSize(); // Function Engine.CheatManager.ChangeSize // Exec|Native|Public|BlueprintCallable // @ game+0x682a544
	void DestroyTarget(); // Function Engine.CheatManager.DestroyTarget // Exec|Native|Public|BlueprintCallable // @ game+0x5a6f68c
	void Teleport(); // Function Engine.CheatManager.Teleport // Exec|Native|Public|BlueprintCallable // @ game+0x5a6f61c
	void ViewActor(); // Function Engine.CheatManager.ViewActor // Exec|Native|Public // @ game+0x683b5d8
	void FreezeFrame(); // Function Engine.CheatManager.FreezeFrame // Exec|Native|Public|BlueprintCallable // @ game+0x682ec40
	void BugItStringCreator(); // Function Engine.CheatManager.BugItStringCreator // Exec|Native|Public|HasOutParms|HasDefaults // @ game+0x6828c30
	void DestroyAll(); // Function Engine.CheatManager.DestroyAll // Exec|Native|Public // @ game+0x682d21c
	void BugIt(); // Function Engine.CheatManager.BugIt // Exec|Native|Public // @ game+0x6828950
	void DebugCapsuleSweepComplex(); // Function Engine.CheatManager.DebugCapsuleSweepComplex // Exec|Native|Public // @ game+0x682d08c
	void DebugCapsuleSweepChannel(); // Function Engine.CheatManager.DebugCapsuleSweepChannel // Exec|Native|Public // @ game+0x682cfdc
	void SetNavDrawDistance(); // Function Engine.CheatManager.SetNavDrawDistance // Final|Exec|Native|Public // @ game+0x68387e8
	void SetWorldOrigin(); // Function Engine.CheatManager.SetWorldOrigin // Final|Exec|Native|Public // @ game+0x683933c
	void *9548b29d4b(); // Function Engine.CheatManager.*9548b29d4b // Native|Protected|BlueprintCallable // @ game+0xcc7a50
	void DumpOnlineSessionState(); // Function Engine.CheatManager.DumpOnlineSessionState // Exec|Native|Public // @ game+0x59f0bd4
	void DebugCapsuleSweepClear(); // Function Engine.CheatManager.DebugCapsuleSweepClear // Exec|Native|Public // @ game+0x682d074
	void ReceiveInitCheatManager(); // Function Engine.CheatManager.ReceiveInitCheatManager // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ViewClass(); // Function Engine.CheatManager.ViewClass // Exec|Native|Public // @ game+0x683b66c
};

// Class Engine.*1b1f1e4584
// Size: 0xa10 (Inherited: 0xa00)
struct U*1b1f1e4584 : UPrimitiveComponent {
	struct TArray<struct FNavigationLink> Links; // 0xa00(0x10)
};

// Class Engine.NavArea
// Size: 0x48 (Inherited: 0x30)
struct UNavArea : UObject {
	float DefaultCost; // 0x30(0x04)
	float FixedAreaEnteringCost; // 0x34(0x04)
	struct FColor DrawColor; // 0x38(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x3c(0x04)
	char bSupportsAgent0 : 1; // 0x40(0x01)
	char bSupportsAgent1 : 1; // 0x40(0x01)
	char bSupportsAgent2 : 1; // 0x40(0x01)
	char bSupportsAgent3 : 1; // 0x40(0x01)
	char bSupportsAgent4 : 1; // 0x40(0x01)
	char bSupportsAgent5 : 1; // 0x40(0x01)
	char bSupportsAgent6 : 1; // 0x40(0x01)
	char bSupportsAgent7 : 1; // 0x40(0x01)
	char bSupportsAgent8 : 1; // 0x41(0x01)
	char bSupportsAgent9 : 1; // 0x41(0x01)
	char bSupportsAgent10 : 1; // 0x41(0x01)
	char bSupportsAgent11 : 1; // 0x41(0x01)
	char bSupportsAgent12 : 1; // 0x41(0x01)
	char bSupportsAgent13 : 1; // 0x41(0x01)
	char bSupportsAgent14 : 1; // 0x41(0x01)
	char bSupportsAgent15 : 1; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Engine.LevelScriptActor
// Size: 0x410 (Inherited: 0x408)
struct ALevelScriptActor : AActor {
	char *9fe0b32409 : 1; // 0x408(0x01)
	char pad_408_1 : 7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)

	void *930cb558f2(); // Function Engine.LevelScriptActor.*930cb558f2 // Native|Public|BlueprintCallable // @ game+0xb62080
	void WorldOriginLocationChanged(); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|HasDefaults|BlueprintEvent // @ game+0x22ddc4
	void *60b99c5d37(); // Function Engine.LevelScriptActor.*60b99c5d37 // Native|Public|BlueprintCallable // @ game+0x5a755b0
	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class Engine.ChildActorComponent
// Size: 0x500 (Inherited: 0x4d0)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x4d0(0x08)
	struct AActor* ChildActor; // 0x4d8(0x08)
	struct AActor* ChildActorTemplate; // 0x4e0(0x08)
	char pad_4E8[0x18]; // 0x4e8(0x18)

	void *d9cb75fbb5(); // Function Engine.ChildActorComponent.*d9cb75fbb5 // Final|Native|Public|BlueprintCallable // @ game+0x67be654
};

// Class Engine.CameraComponent
// Size: 0xac0 (Inherited: 0x4d0)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x4d0(0x04)
	float OrthoWidth; // 0x4d4(0x04)
	float OrthoNearClipPlane; // 0x4d8(0x04)
	float OrthoFarClipPlane; // 0x4dc(0x04)
	float AspectRatio; // 0x4e0(0x04)
	char bConstrainAspectRatio : 1; // 0x4e4(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x4e4(0x01)
	char bLockToHmd : 1; // 0x4e4(0x01)
	char bUsePawnControlRotation : 1; // 0x4e4(0x01)
	char pad_4E4_4 : 4; // 0x4e4(0x01)
	char pad_4E5[0x3]; // 0x4e5(0x03)
	enum class ECameraProjectionMode ProjectionMode; // 0x4e8(0x01)
	char pad_4E9[0x3]; // 0x4e9(0x03)
	float PostProcessBlendWeight; // 0x4ec(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x4f0(0x570)
	char pad_A60[0x58]; // 0xa60(0x58)
	char bUseControllerViewRotation : 1; // 0xab8(0x01)
	char pad_AB8_1 : 7; // 0xab8(0x01)
	char pad_AB9[0x7]; // 0xab9(0x07)

	void *8a619a71fe(); // Function Engine.CameraComponent.*8a619a71fe // Final|Native|Public|BlueprintCallable // @ game+0x6806bc4
	void *79844d1a03(); // Function Engine.CameraComponent.*79844d1a03 // Final|Native|Public|BlueprintCallable // @ game+0x680d718
	void *334e73d773(); // Function Engine.CameraComponent.*334e73d773 // Final|Native|Public|BlueprintCallable // @ game+0x680fd34
	void *ecceb55aba(); // Function Engine.CameraComponent.*ecceb55aba // Final|Native|Public|BlueprintCallable // @ game+0x67c9c40
	void *5c14709928(); // Function Engine.CameraComponent.*5c14709928 // Final|Native|Public|BlueprintCallable // @ game+0x68107dc
	void *05dd1e25b7(); // Function Engine.CameraComponent.*05dd1e25b7 // Final|Native|Public|BlueprintCallable // @ game+0x6810b68
	void *c77d39d54d(); // Function Engine.CameraComponent.*c77d39d54d // Final|Native|Public|BlueprintCallable // @ game+0x6809378
	void *cb0966e862(); // Function Engine.CameraComponent.*cb0966e862 // Final|Native|Public|BlueprintCallable // @ game+0x680b9cc
	void *06060d8a3e(); // Function Engine.CameraComponent.*06060d8a3e // Final|Native|Public|BlueprintCallable // @ game+0x680fc9c
	void *f1c8bde037(); // Function Engine.CameraComponent.*f1c8bde037 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x67e2db8
	void *cb5cdd69b3(); // Function Engine.CameraComponent.*cb5cdd69b3 // Final|Native|Public|BlueprintCallable // @ game+0x6814050
};

// Class Engine.Engine
// Size: 0xf50 (Inherited: 0x30)
struct UEngine : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FStringAssetReference TinyFontName; // 0x40(0x10)
	struct UFont* SmallFont; // 0x50(0x08)
	struct FStringAssetReference SmallFontName; // 0x58(0x10)
	struct UFont* *b2fb6d5918; // 0x68(0x08)
	struct FStringAssetReference MediumFontName; // 0x70(0x10)
	struct UFont* LargeFont; // 0x80(0x08)
	struct FStringAssetReference LargeFontName; // 0x88(0x10)
	struct UFont* *17d1a5c92f; // 0x98(0x08)
	struct FStringAssetReference SubtitleFontName; // 0xa0(0x10)
	struct TArray<struct UFont*> *dddf4c9088; // 0xb0(0x10)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0xc0(0x10)
	int32 *4a63163b75; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct FStringAssetReference DefaultBloomKernelTextureName; // 0xd8(0x10)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0xe8(0x10)
	struct FString WireframeMaterialName; // 0xf8(0x10)
	struct UMaterial* *904e29baa1; // 0x108(0x08)
	float DisplayGamma; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct UMaterial* DebugMeshMaterial; // 0x118(0x08)
	struct FFloatRange SmoothedFrameRateRange; // 0x120(0x10)
	struct UMaterial* *fdd0f56f71; // 0x130(0x08)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0x138(0x10)
	struct TArray<struct F*588c0e2b3a> ActiveGameNameRedirects; // 0x148(0x10)
	struct UMaterial* *8c96c8d713; // 0x158(0x08)
	char pad_160[0x50]; // 0x160(0x50)
	struct UGameUserSettings* GameUserSettings; // 0x1b0(0x08)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0x1b8(0x10)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0x1c8(0x10)
	struct UTexture* WeightMapPlaceholderTexture; // 0x1d8(0x08)
	struct UMaterialInstanceDynamic* *419956b350; // 0x1e0(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0x1e8(0x10)
	char bHardwareSurveyEnabled : 1; // 0x1f8(0x01)
	char pad_1F8_1 : 7; // 0x1f8(0x01)
	char pad_1F9[0x7]; // 0x1f9(0x07)
	struct FStringClassReference AIControllerClassName; // 0x200(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x210(0x10)
	struct FStringAssetReference DefaultBokehTextureName; // 0x220(0x10)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x230(0x10)
	float RenderLightMapDensityGrayscaleScale; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct FStringAssetReference DefaultTextureName; // 0x248(0x10)
	float PrimitiveProbablyVisibleTime; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct UMaterial* *e7a58e7605; // 0x260(0x08)
	struct UTexture2D* *8bd6845839; // 0x268(0x08)
	struct UClass* *cfd562edce; // 0x270(0x08)
	struct UTexture2D* *07a2faa8d2; // 0x278(0x08)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x280(0x10)
	int32 *3fd60cfe7a; // 0x290(0x04)
	enum class *ea60031bfe *52dc8ce7e2; // 0x294(0x01)
	char pad_295[0x3]; // 0x295(0x03)
	struct UMaterialInstanceDynamic* *882cf2b119; // 0x298(0x08)
	struct UMaterial* RemoveSurfaceMaterial; // 0x2a0(0x08)
	struct UTexture2D* *cdaf3acb6f; // 0x2a8(0x08)
	struct FStringClassReference LocalPlayerClassName; // 0x2b0(0x10)
	struct UClass* *e7983e4706; // 0x2c0(0x08)
	float NearClipPlane; // 0x2c8(0x04)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	struct UMaterial* *569ed0c9a4; // 0x2d0(0x08)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x2d8(0x10)
	struct FString PlayOnConsoleSaveDir; // 0x2e8(0x10)
	float MinDesiredFrameRate; // 0x2f8(0x04)
	float NetClientTicksPerSecond; // 0x2fc(0x04)
	struct UMaterial* *6095551fc5; // 0x300(0x08)
	struct UTexture2D* MiniFontTexture; // 0x308(0x08)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x310(0x08)
	struct UClass* *db10b3ff9c; // 0x318(0x08)
	char bSubtitlesForcedOff : 1; // 0x320(0x01)
	char pad_320_1 : 7; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x328(0x10)
	struct UTexture2D* *9735291500; // 0x338(0x08)
	struct UAssetManager* AssetManager; // 0x340(0x08)
	struct FColor *18889b23a4; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct FStringClassReference AvoidanceManagerClassName; // 0x350(0x10)
	struct FStringClassReference GameViewportClientClassName; // 0x360(0x10)
	struct TArray<struct F*96501223f2> ActiveClassRedirects; // 0x370(0x10)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x380(0x10)
	struct FColor *a1f148b920; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)
	struct FString *9a7e172902; // 0x398(0x10)
	struct FStringClassReference NavigationSystemClassName; // 0x3a8(0x10)
	char bRenderLightMapDensityGrayscale : 1; // 0x3b8(0x01)
	char pad_3B8_1 : 7; // 0x3b8(0x01)
	char pad_3B9[0x7]; // 0x3b9(0x07)
	struct UClass* *3b5143fa7c; // 0x3c0(0x08)
	struct UMaterialInstanceDynamic* *67a2670d5b; // 0x3c8(0x08)
	struct UObject* *bc69c4c2bd; // 0x3d0(0x08)
	struct FString ShadedLevelColorationLitMaterialName; // 0x3d8(0x10)
	struct FColor *4c5bc6371e; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct FStringAssetReference DefaultReflectionCaptureTextureName; // 0x3f0(0x10)
	struct UGameViewportClient* GameViewport; // 0x400(0x08)
	struct FString *258f8c994b; // 0x408(0x10)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x418(0x10)
	struct FString VertexColorMaterialName; // 0x428(0x10)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0x438(0x10)
	struct UMaterial* LevelColorationLitMaterial; // 0x448(0x08)
	struct FColor *0aed2d0bb7; // 0x450(0x04)
	char bPauseOnLossOfFocus : 1; // 0x454(0x01)
	char pad_454_1 : 7; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
	int32 MaxParticleResize; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct FStringAssetReference LightMapDensityTextureName; // 0x460(0x10)
	struct FStringAssetReference MiniFontTextureName; // 0x470(0x10)
	struct TArray<struct F*305cf84e03> ActiveStructRedirects; // 0x480(0x10)
	struct UClass* *bae4c5214e; // 0x490(0x08)
	char bAllowMatureLanguage : 1; // 0x498(0x01)
	char pad_498_1 : 7; // 0x498(0x01)
	char pad_499[0x3]; // 0x499(0x03)
	float CameraRotationThreshold; // 0x49c(0x04)
	struct FStringClassReference GameSingletonClassName; // 0x4a0(0x10)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x4b0(0x10)
	struct UClass* *920ed2f2c5; // 0x4c0(0x08)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x4c8(0x01)
	char pad_4C8_1 : 7; // 0x4c8(0x01)
	char pad_4C9[0x3]; // 0x4c9(0x03)
	int32 NumPawnsAllowedToBeSpawnedInAFrame; // 0x4cc(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x4d0(0x01)
	char pad_4D0_1 : 7; // 0x4d0(0x01)
	char pad_4D1[0xf]; // 0x4d1(0x0f)
	struct UMaterial* *b2d86d5e63; // 0x4e0(0x08)
	struct FColor *57697de8c8; // 0x4e8(0x04)
	char pad_4EC[0x4]; // 0x4ec(0x04)
	struct TArray<struct FString> *4fa0bda95b; // 0x4f0(0x10)
	char pad_500[0x18]; // 0x500(0x18)
	struct UMaterial* *158ef2b728; // 0x518(0x08)
	struct UTexture2D* *3354aa5029; // 0x520(0x08)
	struct FString LightingTexelDensityName; // 0x528(0x10)
	float CameraTranslationThreshold; // 0x538(0x04)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x540(0x10)
	struct FLinearColor LightingOnlyBrightness; // 0x550(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x560(0x10)
	int32 MaximumLoopIterationCount; // 0x570(0x04)
	char pad_574[0x4]; // 0x574(0x04)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0x578(0x10)
	float *b1796a28c0; // 0x588(0x04)
	char pad_58C[0x4]; // 0x58c(0x04)
	struct UClass* *ec063d291c; // 0x590(0x08)
	struct FLinearColor LightMapDensitySelectedColor; // 0x598(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x5a8(0x10)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x5b8(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x5c8(0x08)
	struct UClass* *6618489028; // 0x5d0(0x08)
	char bSubtitlesEnabled : 1; // 0x5d8(0x01)
	char pad_5D8_1 : 7; // 0x5d8(0x01)
	char pad_5D9[0x3]; // 0x5d9(0x03)
	struct FColor *cb2dd6ab2d; // 0x5dc(0x04)
	struct FStringAssetReference DebugMeshMaterialName; // 0x5e0(0x10)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x5f0(0x10)
	float IdealLightMapDensity; // 0x600(0x04)
	char pad_604[0x4]; // 0x604(0x04)
	struct TArray<struct F*93620d28f2> ActivePluginRedirects; // 0x608(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x618(0x10)
	struct FString LevelColorationUnlitMaterialName; // 0x628(0x10)
	struct FStringClassReference WorldSettingsClassName; // 0x638(0x10)
	struct UMaterial* WireframeMaterial; // 0x648(0x08)
	float MaxPixelShaderAdditiveComplexityCount; // 0x650(0x04)
	float MaxLightMapDensity; // 0x654(0x04)
	struct UMaterial* *289fbcf95e; // 0x658(0x08)
	struct UMaterialInstanceDynamic* *5b15e6100a; // 0x660(0x08)
	float MeshLODRange; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	struct FStringClassReference ConsoleClassName; // 0x670(0x10)
	struct FColor *c2b218ca0a; // 0x680(0x04)
	char pad_684[0x4]; // 0x684(0x04)
	struct FStringClassReference LevelScriptActorClassName; // 0x688(0x10)
	struct UTexture* DefaultDiffuseTexture; // 0x698(0x08)
	struct UMaterial* *13a610002f; // 0x6a0(0x08)
	struct UTexture2D* *d8417c9941; // 0x6a8(0x08)
	struct TArray<struct F*ecc95ccbfb> *6ae7184684; // 0x6b0(0x10)
	struct FStringAssetReference DefaultPhysMaterialName; // 0x6c0(0x10)
	struct FString LevelColorationLitMaterialName; // 0x6d0(0x10)
	float FixedFrameRate; // 0x6e0(0x04)
	char pad_6E4[0x4]; // 0x6e4(0x04)
	struct FStringClassReference GameUserSettingsClassName; // 0x6e8(0x10)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x6f8(0x10)
	struct FLinearColor *44bd42ad56; // 0x708(0x10)
	struct FLinearColor *ba04574914; // 0x718(0x10)
	struct FLinearColor *8e0bdb2efe; // 0x728(0x10)
	struct FLinearColor *613128785f; // 0x738(0x10)
	bool *f9293e381d; // 0x748(0x01)
	char pad_749[0x3]; // 0x749(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x74c(0x01)
	char *216307556a : 1; // 0x74c(0x01)
	char bSuppressMapWarnings : 1; // 0x74c(0x01)
	char bDisableAILogging : 1; // 0x74c(0x01)
	char pad_74C_4 : 4; // 0x74c(0x01)
	char pad_74D[0x3]; // 0x74d(0x03)
	uint32 bEnableVisualLogRecordingOnStart; // 0x750(0x04)
	struct FBox *3dc6cbcd94; // 0x754(0x1c)
	char pad_770[0x4]; // 0x770(0x04)
	int32 *7b0f12bdd7; // 0x774(0x04)
	char *8bdcda74ad : 1; // 0x778(0x01)
	char pad_778_1 : 7; // 0x778(0x01)
	char pad_779[0x7]; // 0x779(0x07)
	struct FString ParticleEventManagerClassPath; // 0x780(0x10)
	char pad_790[0x20]; // 0x790(0x20)
	float SelectionHighlightIntensity; // 0x7b0(0x04)
	float *460eba5c32; // 0x7b4(0x04)
	float BSPSelectionHighlightIntensity; // 0x7b8(0x04)
	float HoverHighlightIntensity; // 0x7bc(0x04)
	float *fdb4353d84; // 0x7c0(0x04)
	float PrimitiveBaseIntensity; // 0x7c4(0x04)
	float PrimitiveSelectedIntensity; // 0x7c8(0x04)
	float PrimitiveHoverIntensity; // 0x7cc(0x04)
	char pad_7D0[0x290]; // 0x7d0(0x290)
	struct F*eab1f0d427 PhysicErrorCorrection; // 0xa60(0x1c)
	char bCanBlueprintsTickByDefault : 1; // 0xa7c(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0xa7c(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0xa7c(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0xa7c(0x01)
	char pad_A7C_4 : 1; // 0xa7c(0x01)
	char bSmoothFrameRate : 1; // 0xa7c(0x01)
	char bUseFixedFrameRate : 1; // 0xa7c(0x01)
	char pad_A7C_7 : 1; // 0xa7c(0x01)
	char pad_A7D[0x3]; // 0xa7d(0x03)
	struct UTexture2D* DefaultTexture; // 0xa80(0x08)
	struct FColor *701230078d; // 0xa88(0x04)
	float MaxOcclusionPixelsFraction; // 0xa8c(0x04)
	struct FStringAssetReference ArrowMaterialName; // 0xa90(0x10)
	struct FColor *c79f672cb1; // 0xaa0(0x04)
	char pad_AA4[0x4]; // 0xaa4(0x04)
	struct UMaterialInstanceDynamic* *41801eae84; // 0xaa8(0x08)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0xab0(0x08)
	int32 *6953cade36; // 0xab8(0x04)
	char pad_ABC[0x1d4]; // 0xabc(0x1d4)
	struct TArray<struct F*34e3a3f3fe> NetDriverDefinitions; // 0xc90(0x10)
	struct TArray<struct FString> ServerActors; // 0xca0(0x10)
	struct TArray<struct FString> *ac79ee85a0; // 0xcb0(0x10)
	char *2eec60230d : 1; // 0xcc0(0x01)
	char pad_CC0_1 : 7; // 0xcc0(0x01)
	char pad_CC1[0x3]; // 0xcc1(0x03)
	struct FColor *1786a736fd; // 0xcc4(0x04)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0xcc8(0x10)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0xcd8(0x10)
	struct FColor *d488e8b15f; // 0xce8(0x04)
	char pad_CEC[0xc]; // 0xcec(0x0c)
	struct FStringClassReference AssetManagerClassName; // 0xcf8(0x10)
	struct TArray<struct F*1c8a6a1959> StatColorMappings; // 0xd08(0x10)
	struct FColor *f8920bc53c; // 0xd18(0x04)
	char pad_D1C[0x4]; // 0xd1c(0x04)
	struct UMaterialInstanceDynamic* *5ecd46dbd6; // 0xd20(0x08)
	float RenderLightMapDensityColorScale; // 0xd28(0x04)
	char pad_D2C[0x4]; // 0xd2c(0x04)
	struct UTextureCube* *c142ea92cf; // 0xd30(0x08)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0xd38(0x10)
	struct FColor *f649ca17a3; // 0xd48(0x04)
	char pad_D4C[0x4]; // 0xd4c(0x04)
	struct UMaterialInstanceDynamic* *7d728f8e49; // 0xd50(0x08)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0xd58(0x04)
	char pad_D5C[0x4]; // 0xd5c(0x04)
	struct UClass* *7ebef4665a; // 0xd60(0x08)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0xd68(0x10)
	struct UMaterial* *d4696a6c50; // 0xd78(0x08)
	struct UMaterial* VertexColorMaterial; // 0xd80(0x08)
	float MinLightMapDensity; // 0xd88(0x04)
	int32 MaxParticleResizeWarn; // 0xd8c(0x04)
	char pad_D90[0x18]; // 0xd90(0x18)
	int32 *978b7abcd7; // 0xda8(0x04)
	char pad_DAC[0x1a4]; // 0xdac(0x1a4)
};

// Class Engine.*e0f0196484
// Size: 0x40 (Inherited: 0x30)
struct U*e0f0196484 : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x670 (Inherited: 0x40)
struct UGameViewportClient : U*e0f0196484 {
	char pad_40[0x1c0]; // 0x40(0x1c0)
	struct TArray<struct F*a821055bfd> *74869acfa5; // 0x200(0x10)
	char pad_210[0x248]; // 0x210(0x248)
	struct UGameInstance* GameInstance; // 0x458(0x08)
	char pad_460[0x1f0]; // 0x460(0x1f0)
	struct UConsole* *9690a62fe8; // 0x650(0x08)
	char pad_658[0x18]; // 0x658(0x18)

	void SetConsoleTarget(); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x6809164
	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0x67c43f4
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0xc56b64
};

// Class Engine.Console
// Size: 0x110 (Inherited: 0x30)
struct UConsole : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct ULocalPlayer* *2d14c03552; // 0x40(0x08)
	struct UTexture2D* *a3cbd11a2c; // 0x48(0x08)
	struct UTexture2D* *102ee2a7c7; // 0x50(0x08)
	char pad_58[0x18]; // 0x58(0x18)
	struct TArray<struct FString> HistoryBuffer; // 0x70(0x10)
	char pad_80[0x90]; // 0x80(0x90)
};

// Class Engine.NetDriver
// Size: 0x4c8 (Inherited: 0x30)
struct UNetDriver : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct FString NetConnectionClassName; // 0x38(0x10)
	int32 MaxDownloadSize; // 0x48(0x04)
	char bClampListenServerTickRate : 1; // 0x4c(0x01)
	char pad_4C_1 : 7; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	int32 NetServerMaxTickRate; // 0x50(0x04)
	int32 MaxInternetClientRate; // 0x54(0x04)
	int32 MaxClientRate; // 0x58(0x04)
	float ServerTravelPause; // 0x5c(0x04)
	float SpawnPrioritySeconds; // 0x60(0x04)
	float RelevantTimeout; // 0x64(0x04)
	float KeepAliveTime; // 0x68(0x04)
	float InitialConnectTimeout; // 0x6c(0x04)
	float ConnectionTimeout; // 0x70(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x74(0x04)
	bool bNoTimeouts; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct UNetConnection* *4c8591292a; // 0x80(0x08)
	struct TArray<struct UNetConnection*> *b7c94b0f77; // 0x88(0x10)
	char pad_98[0x28]; // 0x98(0x28)
	struct UWorld* World; // 0xc0(0x08)
	struct UPackage* *2848450d7c; // 0xc8(0x08)
	char pad_D0[0x20]; // 0xd0(0x20)
	struct UClass* *b10fcf621a; // 0xf0(0x08)
	struct UProperty* *85730e860f; // 0xf8(0x08)
	struct UProperty* *225fd045d9; // 0x100(0x08)
	struct FName NetDriverName; // 0x108(0x08)
	char pad_110[0x8]; // 0x110(0x08)
	float Time; // 0x118(0x04)
	char pad_11C[0x3ac]; // 0x11c(0x3ac)
};

// Class Engine.DemoNetDriver
// Size: 0xc60 (Inherited: 0x4c8)
struct UDemoNetDriver : UNetDriver {
	char pad_4C8[0xf8]; // 0x4c8(0xf8)
	struct TMap<struct FString, struct F*5a3c4c23cd> *32f47fcbd9; // 0x5c0(0x50)
	char pad_610[0x430]; // 0x610(0x430)
	bool *6235ee652d; // 0xa40(0x01)
	char pad_A41[0x21f]; // 0xa41(0x21f)
};

// Class Engine.DestructibleComponent
// Size: 0xd60 (Inherited: 0xca0)
struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0xc98(0x01)
	struct TArray<struct F*ea886402eb> FractureEffects; // 0xca0(0x10)
	bool bEnableHardSleeping; // 0xcb0(0x01)
	char pad_CB1_1 : 7; // 0xcb1(0x01)
	char pad_CB2[0x2]; // 0xcb2(0x02)
	float LargeChunkThreshold; // 0xcb4(0x04)
	char pad_CB8[0x10]; // 0xcb8(0x10)
	struct FMulticastDelegate OnComponentFracture; // 0xcc8(0x10)
	char pad_CD8[0x88]; // 0xcd8(0x88)

	void *d2f2b4878a(); // Function Engine.DestructibleComponent.*d2f2b4878a // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67cc11c
	void *8719907661(); // Function Engine.DestructibleComponent.*8719907661 // Final|Native|Public|BlueprintCallable // @ game+0x67e435c
	void *ead89ecafd(); // Function Engine.DestructibleComponent.*ead89ecafd // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67caf20
	void *68e3b0e890(); // Function Engine.DestructibleComponent.*68e3b0e890 // Final|Native|Public|BlueprintCallable // @ game+0x680a2e4
};

// Class Engine.GameEngine
// Size: 0xfb0 (Inherited: 0xf50)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf50(0x04)
	float ServerFlushLogInterval; // 0xf54(0x04)
	struct UGameInstance* GameInstance; // 0xf58(0x08)
	char pad_F60[0x40]; // 0xf60(0x40)
	struct TArray<struct UWorld*> *3c599a0734; // 0xfa0(0x10)
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
struct UPlayer : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	int32 *271682eb8c; // 0x40(0x04)
	int32 ConfiguredInternetSpeed; // 0x44(0x04)
	int32 ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.NetConnection
// Size: 0x65850 (Inherited: 0x50)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UClass* *2620c0f95a; // 0x68(0x08)
	struct UPackageMap* PackageMap; // 0x70(0x08)
	struct TArray<struct UChannel*> *db17e81f9a; // 0x78(0x10)
	struct TArray<struct AActor*> *4c97345279; // 0x88(0x10)
	struct AActor* ViewTarget; // 0x98(0x08)
	struct AActor* *52a10bb853; // 0xa0(0x08)
	int32 *31a15aa452; // 0xa8(0x04)
	char *2b1c0c33d1 : 1; // 0xac(0x01)
	char pad_AC_1 : 1; // 0xac(0x01)
	char *ae08848d84 : 1; // 0xac(0x01)
	char pad_AC_3 : 5; // 0xac(0x01)
	char pad_AD[0x8b]; // 0xad(0x8b)
	struct TArray<struct UChannel*> *c0c274a36f; // 0x138(0x10)
	char pad_148[0x28]; // 0x148(0x28)
	struct FUniqueNetIdRepl PlayerId; // 0x170(0x18)
	char pad_188[0x68]; // 0x188(0x68)
	double *5be392aec6; // 0x1f0(0x08)
	char pad_1F8[0x65538]; // 0x1f8(0x65538)
	struct TArray<struct UChannel*> *923a8e82b0; // 0x65730(0x10)
	char pad_65740[0x110]; // 0x65740(0x110)
};

// Class Engine.ForceFeedbackEffect
// Size: 0x48 (Inherited: 0x30)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct F*4d87801027> ChannelDetails; // 0x30(0x10)
	float Duration; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.GameSession
// Size: 0x420 (Inherited: 0x408)
struct AGameSession : AInfo {
	int32 MaxSpectators; // 0x408(0x04)
	int32 MaxPlayers; // 0x40c(0x04)
	int32 *9a06514058; // 0x410(0x04)
	bool MaxSplitscreensPerConnection; // 0x414(0x01)
	bool bRequiresPushToTalk; // 0x415(0x01)
	char pad_416[0x2]; // 0x416(0x02)
	struct FName SessionName; // 0x418(0x08)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0xc80 (Inherited: 0xba0)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct F*75ea8e2bf3> PerInstanceSMData; // 0xba0(0x10)
	int32 InstancingRandomSeed; // 0xbb0(0x04)
	int32 InstanceStartCullDistance; // 0xbb4(0x04)
	int32 InstanceEndCullDistance; // 0xbb8(0x04)
	char pad_BBC[0x4]; // 0xbbc(0x04)
	struct TArray<int32> *6f47c66abe; // 0xbc0(0x10)
	struct TArray<int32> *56331a2d03; // 0xbd0(0x10)
	char pad_BE0[0x78]; // 0xbe0(0x78)
	struct UPhysicsSerializer* PhysicsSerializer; // 0xc58(0x08)
	bool *66d9b36bd0; // 0xc60(0x01)
	char pad_C61[0x3]; // 0xc61(0x03)
	int32 *0f124e2c4d; // 0xc64(0x04)
	struct TArray<struct F*379f451670> *98820ffda4; // 0xc68(0x10)
	char pad_C78[0x8]; // 0xc78(0x08)

	void *ceef77ed7f(); // Function Engine.InstancedStaticMeshComponent.*ceef77ed7f // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x680d228
	void *2a75f57149(); // Function Engine.InstancedStaticMeshComponent.*2a75f57149 // Native|Public|BlueprintCallable // @ game+0x6803480
	void *a984b9a9ce(); // Function Engine.InstancedStaticMeshComponent.*a984b9a9ce // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67c9a4c
	void *19b8138a81(); // Function Engine.InstancedStaticMeshComponent.*19b8138a81 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e6428
	void *028d8429ac(); // Function Engine.InstancedStaticMeshComponent.*028d8429ac // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67c960c
	void *7786d1a996(); // Function Engine.InstancedStaticMeshComponent.*7786d1a996 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e5dac
	void *43aa6233e3(); // Function Engine.InstancedStaticMeshComponent.*43aa6233e3 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e6bdc
	void *b96a030999(); // Function Engine.InstancedStaticMeshComponent.*b96a030999 // Final|Native|Public|BlueprintCallable // @ game+0x6809d14
	void *1ab6a18aad(); // Function Engine.InstancedStaticMeshComponent.*1ab6a18aad // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e5f98
	void *0b1ef7cb51(); // Function Engine.InstancedStaticMeshComponent.*0b1ef7cb51 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e6d44
	void *95a4257f8b(); // Function Engine.InstancedStaticMeshComponent.*95a4257f8b // Native|Public|BlueprintCallable // @ game+0xcbd24c
	void *6075d3ac8a(); // Function Engine.InstancedStaticMeshComponent.*6075d3ac8a // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x681e05c
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xdb0 (Inherited: 0xc80)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_C80[0x68]; // 0xc80(0x68)
	struct TArray<int32> *6f5dc765ea; // 0xce8(0x10)
	int32 *eaed97f0e4; // 0xcf8(0x04)
	char pad_CFC[0x4]; // 0xcfc(0x04)
	struct FBox *1bd5797291; // 0xd00(0x1c)
	struct FBox *cf161024f3; // 0xd1c(0x1c)
	struct TArray<struct FBox> *7d5adf59ca; // 0xd38(0x10)
	char pad_D48[0x20]; // 0xd48(0x20)
	int32 *64f5d9de39; // 0xd68(0x04)
	struct FBoxSphereBounds *bfbf84d4cc; // 0xd6c(0x1c)
	char *0870e284ac : 1; // 0xd88(0x01)
	char *bea543a7e6 : 1; // 0xd88(0x01)
	char pad_D88_2 : 6; // 0xd88(0x01)
	char pad_D89[0x27]; // 0xd89(0x27)

	void *ba760e9eef(); // Function Engine.HierarchicalInstancedStaticMeshComponent.*ba760e9eef // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6803524
};

// Class Engine.*fc79daab3f
// Size: 0xdb0 (Inherited: 0xdb0)
struct U*fc79daab3f : UHierarchicalInstancedStaticMeshComponent {
	int32 MinVertsToSplitNodeForGrid; // 0xda8(0x04)
};

// Class Engine.LocalPlayer
// Size: 0x290 (Inherited: 0x50)
struct ULocalPlayer : UPlayer {
	char pad_50[0x14]; // 0x50(0x14)
	char *87852b9d3b : 1; // 0x64(0x01)
	char pad_64_1 : 7; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct UClass* *2d967ee0dc; // 0x68(0x08)
	char pad_70[0x220]; // 0x70(0x220)
};

// Class Engine.*4d0023a102
// Size: 0x30 (Inherited: 0x30)
struct U*4d0023a102 : UObject {
};

// Class Engine.PlayerCameraManager
// Size: 0x1d10 (Inherited: 0x408)
struct APlayerCameraManager : AActor {
	struct APlayerController* *9709ac5021; // 0x408(0x08)
	struct USceneComponent* TransformComponent; // 0x410(0x08)
	char pad_418[0x4]; // 0x418(0x04)
	struct FVector FreeCamOffset; // 0x41c(0x0c)
	float DefaultFOV; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	float DefaultOrthoWidth; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	float FreeCamDistance; // 0x438(0x04)
	float ViewRollMax; // 0x43c(0x04)
	char pad_440[0x20]; // 0x440(0x20)
	struct F*0653442295 *41f267243b; // 0x460(0x5e0)
	char pad_A40[0x4]; // 0xa40(0x04)
	float ViewYawMax; // 0xa44(0x04)
	char pad_A48[0xc]; // 0xa48(0x0c)
	float ViewYawMin; // 0xa54(0x04)
	char pad_A58[0x8]; // 0xa58(0x08)
	struct F*af5ae819d5 *5e40474673; // 0xa60(0x5d0)
	char pad_1030[0x8]; // 0x1030(0x08)
	struct TArray<struct UClass*> DefaultModifiers; // 0x1038(0x10)
	float ViewPitchMin; // 0x1048(0x04)
	char pad_104C[0x4]; // 0x104c(0x04)
	struct TArray<struct U*ea345062c7*> *a8a6f91d9b; // 0x1050(0x10)
	char pad_1060[0x10]; // 0x1060(0x10)
	struct F*0653442295 ViewTarget; // 0x1070(0x5e0)
	struct F*af5ae819d5 *bdd4a92675; // 0x1650(0x5d0)
	char pad_1C20[0x10]; // 0x1c20(0x10)
	float DefaultAspectRatio; // 0x1c30(0x04)
	char pad_1C34[0x4]; // 0x1c34(0x04)
	struct TArray<struct AEmitterCameraLensEffectBase*> *d3c8bed385; // 0x1c38(0x10)
	struct U*436388bfde* *c32a2345bf; // 0x1c48(0x08)
	struct U*de6aae17ea* *480f64fe2f[0x08]; // 0x1c50(0x40)
	struct TArray<struct FPostProcessSettings> *3626307aef; // 0x1c90(0x10)
	char pad_1CA0[0x10]; // 0x1ca0(0x10)
	struct TArray<struct U*de6aae17ea*> *0ec866bd4e; // 0x1cb0(0x10)
	struct TArray<struct U*de6aae17ea*> *295e276da3; // 0x1cc0(0x10)
	struct ACameraActor* *463d40d827; // 0x1cd0(0x08)
	char bIsOrthographic : 1; // 0x1cd8(0x01)
	char bDefaultConstrainAspectRatio : 1; // 0x1cd8(0x01)
	char pad_1CD8_2 : 5; // 0x1cd8(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1cd8(0x01)
	char pad_1CD9[0x1b]; // 0x1cd9(0x1b)
	float ViewRollMin; // 0x1cf4(0x04)
	char pad_1CF8[0x8]; // 0x1cf8(0x08)
	float ViewPitchMax; // 0x1d00(0x04)
	struct FVector ViewTargetOffset; // 0x1d04(0x0c)

	void *fd287b77ad(); // Function Engine.PlayerCameraManager.*fd287b77ad // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67acbac
	void *ed9ad74d63(); // Function Engine.PlayerCameraManager.*ed9ad74d63 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67b8998
	void *71bebfc691(); // Function Engine.PlayerCameraManager.*71bebfc691 // Native|Public|BlueprintCallable // @ game+0x67c3d34
	void *b93793f9f5(); // Function Engine.PlayerCameraManager.*b93793f9f5 // Native|Public|BlueprintCallable // @ game+0x5a9c470
	void *2c3667dab0(); // Function Engine.PlayerCameraManager.*2c3667dab0 // Native|Public|BlueprintCallable // @ game+0x67a9ee4
	void *abe4210355(); // Function Engine.PlayerCameraManager.*abe4210355 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xa94c18
	void *c109a4af55(); // Function Engine.PlayerCameraManager.*c109a4af55 // Native|Public|BlueprintCallable // @ game+0x67c3c9c
	void *99927376d9(); // Function Engine.PlayerCameraManager.*99927376d9 // Native|Public|BlueprintCallable // @ game+0x67a17fc
	void PhotographyCameraModify(); // Function Engine.PlayerCameraManager.PhotographyCameraModify // BlueprintCosmetic|Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x67b8604
	void *9947d93eda(); // Function Engine.PlayerCameraManager.*9947d93eda // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5df10
	void *ecad5d6db1(); // Function Engine.PlayerCameraManager.*ecad5d6db1 // Native|Public|BlueprintCallable // @ game+0x67c4074
	void *310c2a0c34(); // Function Engine.PlayerCameraManager.*310c2a0c34 // Native|Public|BlueprintCallable // @ game+0x67b94d8
	void OnPhotographySessionEnd(); // Function Engine.PlayerCameraManager.OnPhotographySessionEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5fb79c
	void *bc8833b492(); // Function Engine.PlayerCameraManager.*bc8833b492 // Native|Public|BlueprintCallable // @ game+0x67c3c04
	void *9bb7469531(); // Function Engine.PlayerCameraManager.*9bb7469531 // Native|Public|BlueprintCallable // @ game+0x67c3f90
	void OnPhotographyMultiPartCaptureStart(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5fc3d0
	void *46f1bc277b(); // Function Engine.PlayerCameraManager.*46f1bc277b // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c0944
	void *b9aa07e814(); // Function Engine.PlayerCameraManager.*b9aa07e814 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67abb78
	void *1f3d8a2b99(); // Function Engine.PlayerCameraManager.*1f3d8a2b99 // Native|Public|HasDefaults|BlueprintCallable // @ game+0xb4db14
	void *e931c3da1d(); // Function Engine.PlayerCameraManager.*e931c3da1d // Native|Public|BlueprintCallable // @ game+0x67a2c18
	void *0d58a7376f(); // Function Engine.PlayerCameraManager.*0d58a7376f // Native|Public|BlueprintCallable // @ game+0x59fffe8
	void BlueprintUpdateCamera(); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22ddc4
	void *98b7b74d50(); // Function Engine.PlayerCameraManager.*98b7b74d50 // Native|Public|BlueprintCallable // @ game+0x67c3e18
	void *bfe31feb0f(); // Function Engine.PlayerCameraManager.*bfe31feb0f // Native|Public|BlueprintCallable // @ game+0x67b956c
	void *101753f358(); // Function Engine.PlayerCameraManager.*101753f358 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c3900
	void OnPhotographySessionStart(); // Function Engine.PlayerCameraManager.OnPhotographySessionStart // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0x5a77d08
	void OnPhotographyMultiPartCaptureEnd(); // Function Engine.PlayerCameraManager.OnPhotographyMultiPartCaptureEnd // BlueprintCosmetic|Native|Event|Public|BlueprintEvent // @ game+0xdb4c0c
};

// Class Engine.PlayerInput
// Size: 0x490 (Inherited: 0x30)
struct UPlayerInput : UObject {
	char pad_30[0xf8]; // 0x30(0xf8)
	struct TArray<struct F*c1a57810c7> DebugExecBindings; // 0x128(0x10)
	char pad_138[0x30]; // 0x138(0x30)
	struct TArray<struct FName> InvertedAxis; // 0x168(0x10)
	char pad_178[0x318]; // 0x178(0x318)

	void SetGamePadDeadZone(); // Function Engine.PlayerInput.SetGamePadDeadZone // Final|Exec|Native|Public // @ game+0x67bf940
	void SetGamePadSensitivityOf(); // Function Engine.PlayerInput.SetGamePadSensitivityOf // Final|Exec|Native|Public // @ game+0x67bfbac
	void SetMouseSensitivity(); // Function Engine.PlayerInput.SetMouseSensitivity // Final|Exec|Native|Public // @ game+0x67c0f34
	void SetGamePadDeadZoneOf(); // Function Engine.PlayerInput.SetGamePadDeadZoneOf // Final|Exec|Native|Public // @ game+0x67bf9d8
	void SetGamePadSensitivity(); // Function Engine.PlayerInput.SetGamePadSensitivity // Final|Exec|Native|Public // @ game+0x67bfb14
	void InvertAxisKey(); // Function Engine.PlayerInput.InvertAxisKey // Final|Exec|Native|Public // @ game+0x67b119c
	void SetBind(); // Function Engine.PlayerInput.SetBind // Final|Exec|Native|Public // @ game+0x67be0e0
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing // Final|Exec|Native|Public // @ game+0x67a4304
	void InvertAxis(); // Function Engine.PlayerInput.InvertAxis // Final|Exec|Native|Public // @ game+0x67b110c
};

// Class Engine.NavigationData
// Size: 0x5b0 (Inherited: 0x408)
struct ANavigationData : AActor {
	struct UPrimitiveComponent* RenderingComp; // 0x408(0x08)
	struct F*b471f00637 *b471f00637; // 0x410(0x50)
	char *df1535e956 : 1; // 0x460(0x01)
	char bForceRebuildOnLoad : 1; // 0x460(0x01)
	char bCanBeMainNavData : 1; // 0x460(0x01)
	char bCanSpawnOnRebuild : 1; // 0x460(0x01)
	char bRebuildAtRuntime : 1; // 0x460(0x01)
	char pad_460_5 : 3; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	enum class ERuntimeGenerationType RuntimeGeneration; // 0x464(0x01)
	char pad_465[0x3]; // 0x465(0x03)
	float ObservedPathsTickInterval; // 0x468(0x04)
	char *706aa73b33 : 1; // 0x46c(0x01)
	char pad_46C_1 : 7; // 0x46c(0x01)
	char pad_46D[0x3]; // 0x46d(0x03)
	uint32 DataVersion; // 0x470(0x04)
	char pad_474[0xd4]; // 0x474(0xd4)
	struct TArray<struct F*4474e4d98f> *2b8f015cb0; // 0x548(0x10)
	char pad_558[0x58]; // 0x558(0x58)
};

// Class Engine.RecastNavMesh
// Size: 0x6c0 (Inherited: 0x5b0)
struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x5b0(0x01)
	char bDrawPolyEdges : 1; // 0x5b0(0x01)
	char bDrawFilledPolys : 1; // 0x5b0(0x01)
	char bDrawNavMeshEdges : 1; // 0x5b0(0x01)
	char *46090cb9f2 : 1; // 0x5b0(0x01)
	char *a1477ce159 : 1; // 0x5b0(0x01)
	char *5db3fd3ad2 : 1; // 0x5b0(0x01)
	char *5fb9c971a8 : 1; // 0x5b0(0x01)
	char *002079ed4a : 1; // 0x5b1(0x01)
	char *b21e7a7c06 : 1; // 0x5b1(0x01)
	char *eeca050b48 : 1; // 0x5b1(0x01)
	char *d3d77d15ca : 1; // 0x5b1(0x01)
	char *643ea53fc0 : 1; // 0x5b1(0x01)
	char *4ed371a330 : 1; // 0x5b1(0x01)
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x5b1(0x01)
	char *05cdc8618a : 1; // 0x5b1(0x01)
	char pad_5B2[0x2]; // 0x5b2(0x02)
	float DrawOffset; // 0x5b4(0x04)
	char bFixedTilePoolSize : 1; // 0x5b8(0x01)
	char pad_5B8_1 : 7; // 0x5b8(0x01)
	char pad_5B9[0x3]; // 0x5b9(0x03)
	int32 TilePoolSize; // 0x5bc(0x04)
	float TileSizeUU; // 0x5c0(0x04)
	float CellSize; // 0x5c4(0x04)
	float CellHeight; // 0x5c8(0x04)
	float AgentRadius; // 0x5cc(0x04)
	float AgentHeight; // 0x5d0(0x04)
	float AgentMaxHeight; // 0x5d4(0x04)
	float AgentMaxSlope; // 0x5d8(0x04)
	float AgentMaxStepHeight; // 0x5dc(0x04)
	float MinRegionArea; // 0x5e0(0x04)
	float MergeRegionSize; // 0x5e4(0x04)
	float MaxSimplificationError; // 0x5e8(0x04)
	int32 MaxSimultaneousTileGenerationJobsCount; // 0x5ec(0x04)
	int32 TileNumberHardLimit; // 0x5f0(0x04)
	int32 *b2cc0e49e0; // 0x5f4(0x04)
	int32 *eceaad5847; // 0x5f8(0x04)
	int32 *b000b456cd; // 0x5fc(0x04)
	float DefaultDrawDistance; // 0x600(0x04)
	float DefaultMaxSearchNodes; // 0x604(0x04)
	float DefaultMaxHierarchicalSearchNodes; // 0x608(0x04)
	enum class ERecastPartitioning RegionPartitioning; // 0x60c(0x01)
	enum class ERecastPartitioning LayerPartitioning; // 0x60d(0x01)
	char pad_60E[0x2]; // 0x60e(0x02)
	int32 RegionChunkSplits; // 0x610(0x04)
	int32 LayerChunkSplits; // 0x614(0x04)
	char bSortNavigationAreasByCost : 1; // 0x618(0x01)
	char bPerformVoxelFiltering : 1; // 0x618(0x01)
	char bMarkLowHeightAreas : 1; // 0x618(0x01)
	char bDoFullyAsyncNavDataGathering : 1; // 0x618(0x01)
	char bUseBetterOffsetsFromCorners : 1; // 0x618(0x01)
	char bStoreEmptyTileLayers : 1; // 0x618(0x01)
	char bUseVirtualFilters : 1; // 0x618(0x01)
	char bAllowNavLinkAsPathEnd : 1; // 0x618(0x01)
	char pad_619[0x3]; // 0x619(0x03)
	bool bOnlySavedOnDS; // 0x61c(0x01)
	char pad_61D[0x3]; // 0x61d(0x03)
	char bUseVoxelCache : 1; // 0x620(0x01)
	char pad_620_1 : 7; // 0x620(0x01)
	char pad_621[0x3]; // 0x621(0x03)
	float TileSetUpdateInterval; // 0x624(0x04)
	float HeuristicScale; // 0x628(0x04)
	float VerticalDeviationFromGroundCompensation; // 0x62c(0x04)
	char pad_630[0x90]; // 0x630(0x90)
};

// Class Engine.*6653cc84aa
// Size: 0x40 (Inherited: 0x30)
struct U*6653cc84aa : UObject {
	struct TArray<struct F*1d24f23e59> *c899da6a1d; // 0x30(0x10)
};

// Class Engine.SceneCaptureComponent
// Size: 0x550 (Inherited: 0x4d0)
struct USceneCaptureComponent : USceneComponent {
	struct TArray<struct UPrimitiveComponent*> *1b85a647bc; // 0x4d0(0x10)
	struct TArray<struct AActor*> HiddenActors; // 0x4e0(0x10)
	struct TArray<struct UPrimitiveComponent*> *2c21281200; // 0x4f0(0x10)
	struct TArray<struct AActor*> ShowOnlyActors; // 0x500(0x10)
	bool bIsLobbyCapture; // 0x510(0x01)
	bool bCaptureEveryFrame; // 0x511(0x01)
	bool bCaptureOnMovement; // 0x512(0x01)
	char pad_513[0x1]; // 0x513(0x01)
	float LODDistanceFactor; // 0x514(0x04)
	float MaxViewDistanceOverride; // 0x518(0x04)
	int32 CaptureSortPriority; // 0x51c(0x04)
	struct TArray<struct F*8f41bd28ce> ShowFlagSettings; // 0x520(0x10)
	char pad_530[0x20]; // 0x530(0x20)

	void *c79e20c089(); // Function Engine.SceneCaptureComponent.*c79e20c089 // Final|Native|Public|BlueprintCallable // @ game+0x6816c54
	void *a013f7703f(); // Function Engine.SceneCaptureComponent.*a013f7703f // Final|Native|Public|BlueprintCallable // @ game+0x68086fc
	void *e10656b7d7(); // Function Engine.SceneCaptureComponent.*e10656b7d7 // Final|Native|Public|BlueprintCallable // @ game+0x6816ce4
	void *501173f52c(); // Function Engine.SceneCaptureComponent.*501173f52c // Final|Native|Public|BlueprintCallable // @ game+0x67d6218
	void *603a4566ca(); // Function Engine.SceneCaptureComponent.*603a4566ca // Final|Native|Public|BlueprintCallable // @ game+0x67ef2a8
	void *6b6e40642f(); // Function Engine.SceneCaptureComponent.*6b6e40642f // Final|Native|Public|BlueprintCallable // @ game+0x67ef448
	void *37577cf286(); // Function Engine.SceneCaptureComponent.*37577cf286 // Final|Native|Public|BlueprintCallable // @ game+0x6803770
	void *ec2de27f06(); // Function Engine.SceneCaptureComponent.*ec2de27f06 // Final|Native|Public|BlueprintCallable // @ game+0x6803800
};

// Class Engine.SceneCaptureComponent2D
// Size: 0xb90 (Inherited: 0x550)
struct USceneCaptureComponent2D : USceneCaptureComponent {
	enum class ECameraProjectionMode ProjectionType; // 0x550(0x01)
	char pad_551[0x3]; // 0x551(0x03)
	float FOVAngle; // 0x554(0x04)
	bool *7ed08cdd15; // 0x558(0x01)
	char pad_559[0x3]; // 0x559(0x03)
	float *447c892cd2; // 0x55c(0x04)
	float OrthoWidth; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct UTextureRenderTarget2D* TextureTarget; // 0x568(0x08)
	enum class *fc99d3fe06 CaptureSource; // 0x570(0x01)
	enum class *0a7c972e56 CompositeMode; // 0x571(0x01)
	char pad_572[0x2]; // 0x572(0x02)
	struct FLinearColor LightingOnlyBrightness; // 0x574(0x10)
	struct FLinearColor LightingOnlySpecular; // 0x584(0x10)
	struct FLinearColor LightingOnlyCustomData; // 0x594(0x10)
	float LightingOnlyCustomDataAlpha; // 0x5a4(0x04)
	char pad_5A8[0x8]; // 0x5a8(0x08)
	struct FPostProcessSettings PostProcessSettings; // 0x5b0(0x570)
	float PostProcessBlendWeight; // 0xb20(0x04)
	bool bUseCustomProjectionMatrix; // 0xb24(0x01)
	char pad_B25[0xb]; // 0xb25(0x0b)
	struct FMatrix CustomProjectionMatrix; // 0xb30(0x40)
	char *02c554f858 : 1; // 0xb70(0x01)
	char pad_B70_1 : 7; // 0xb70(0x01)
	char pad_B71[0x3]; // 0xb71(0x03)
	bool bEnableClipPlane; // 0xb74(0x01)
	char pad_B75[0x3]; // 0xb75(0x03)
	struct FVector ClipPlaneBase; // 0xb78(0x0c)
	struct FVector ClipPlaneNormal; // 0xb84(0x0c)

	void *ecceb55aba(); // Function Engine.SceneCaptureComponent2D.*ecceb55aba // Final|Native|Public|BlueprintCallable // @ game+0x67c9e68
	void CaptureScene(); // Function Engine.SceneCaptureComponent2D.CaptureScene // Final|Native|Public|BlueprintCallable // @ game+0x67d5b1c
};

// Class Engine.ArrowComponent
// Size: 0xa10 (Inherited: 0xa00)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor; // 0x9f8(0x04)
	float ArrowSize; // 0x9fc(0x04)
	bool bIsScreenSizeScaled; // 0xa00(0x01)
	float ScreenSize; // 0xa04(0x04)
	char bTreatAsASprite : 1; // 0xa08(0x01)
	char pad_A0D_1 : 7; // 0xa0d(0x01)
	char pad_A0E[0x2]; // 0xa0e(0x02)

	void SetArrowColor(); // Function Engine.ArrowComponent.SetArrowColor // Native|Public|HasDefaults|BlueprintCallable // @ game+0x6806b28
};

// Class Engine.ParticleSystemComponent
// Size: 0xc60 (Inherited: 0xa00)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template; // 0x9f8(0x08)
	struct TArray<struct UMaterialInterface*> *cdc8d40e7a; // 0xa00(0x10)
	struct TArray<struct USkeletalMeshComponent*> *edfb091a25; // 0xa10(0x10)
	char pad_A28_0 : 7; // 0xa28(0x01)
	char bResetOnDetach : 1; // 0xa20(0x01)
	char *806c2063a4 : 1; // 0xa21(0x01)
	char bAllowRecycling : 1; // 0xa21(0x01)
	char bAutoManageAttachment : 1; // 0xa21(0x01)
	char *30c974bd36 : 1; // 0xa21(0x01)
	char bOverrideLODMethod : 1; // 0xa22(0x01)
	char *5a36da03b4 : 1; // 0xa22(0x01)
	char *338b144ca2 : 1; // 0xa22(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0xa28(0x10)
	struct FMulticastDelegate OnParticleSpawn; // 0xa38(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0xa48(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0xa58(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0xa68(0x10)
	struct FVector *780596f89d; // 0xa78(0x0c)
	struct FVector *34a7719c48; // 0xa84(0x0c)
	float WarmupTime; // 0xa90(0x04)
	float *05a26e85b5; // 0xa94(0x04)
	char pad_A99[0x3]; // 0xa99(0x03)
	float SecondsBeforeInactive; // 0xa9c(0x04)
	char pad_AA0[0x4]; // 0xaa0(0x04)
	float *94ce59f5f2; // 0xaa4(0x04)
	char pad_AA8[0x8]; // 0xaa8(0x08)
	enum class *22978e1300 LODMethod; // 0xab0(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0xab1(0x01)
	char pad_AB2[0x16]; // 0xab2(0x16)
	struct TArray<struct U*0fc7361301*> *b22bc451b7; // 0xac8(0x10)
	char pad_AD8[0x60]; // 0xad8(0x60)
	float CustomTimeDilation; // 0xb38(0x04)
	char pad_B3C[0x4]; // 0xb3c(0x04)
	struct FMulticastDelegate OnSystemFinished; // 0xb40(0x10)
	struct USceneComponent* AutoAttachParent; // 0xb50(0x08)
	struct FName AutoAttachSocketName; // 0xb58(0x08)
	enum class EAttachLocation AutoAttachLocationType; // 0xb60(0x01)
	enum class EAttachmentRule AutoAttachLocationRule; // 0xb61(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0xb62(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0xb63(0x01)
	char pad_B64[0xfc]; // 0xb64(0xfc)

	void *0f4a05e7ce(); // Function Engine.ParticleSystemComponent.*0f4a05e7ce // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab500
	void *27ac79d500(); // Function Engine.ParticleSystemComponent.*27ac79d500 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67aeeb0
	void *93ce0c42a3(); // Function Engine.ParticleSystemComponent.*93ce0c42a3 // Final|Native|Public|BlueprintCallable // @ game+0x67bd46c
	void *d95cd5304d(); // Function Engine.ParticleSystemComponent.*d95cd5304d // Final|Native|Public|BlueprintCallable // @ game+0x67a37c8
	void *03d49cfae4(); // Function Engine.ParticleSystemComponent.*03d49cfae4 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bdfa4
	void *1978396d1f(); // Function Engine.ParticleSystemComponent.*1978396d1f // Final|Native|Public|BlueprintCallable // @ game+0x67bc9a8
	void *956e07ae37(); // Function Engine.ParticleSystemComponent.*956e07ae37 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab3c0
	void *932c7c018d(); // Function Engine.ParticleSystemComponent.*932c7c018d // Native|Public|BlueprintCallable // @ game+0x67bde7c
	void *8ef0a658ae(); // Function Engine.ParticleSystemComponent.*8ef0a658ae // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab644
	void *4e7a6e62b5(); // Function Engine.ParticleSystemComponent.*4e7a6e62b5 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bdc04
	void *92fa2201de(); // Function Engine.ParticleSystemComponent.*92fa2201de // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bdd40
	void *1ec3649205(); // Function Engine.ParticleSystemComponent.*1ec3649205 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af0f8
	void *4cd338f0fb(); // Function Engine.ParticleSystemComponent.*4cd338f0fb // Native|Public|BlueprintCallable // @ game+0x67bf3fc
	void *e7af8658ce(); // Function Engine.ParticleSystemComponent.*e7af8658ce // Native|Public|BlueprintCallable // @ game+0x67bdadc
	void *c00c5b640d(); // Function Engine.ParticleSystemComponent.*c00c5b640d // Native|Public|BlueprintCallable // @ game+0x67a7958
	void *70c41e648e(); // Function Engine.ParticleSystemComponent.*70c41e648e // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab8c8
	void *3e55e7d95c(); // Function Engine.ParticleSystemComponent.*3e55e7d95c // Final|Native|Public|BlueprintCallable // @ game+0x67c0d80
	void *cb9b6e1f75(); // Function Engine.ParticleSystemComponent.*cb9b6e1f75 // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab184
	void *9b5dcbfbeb(); // Function Engine.ParticleSystemComponent.*9b5dcbfbeb // Final|Native|Public|BlueprintCallable // @ game+0x67c240c
	void *3ed14454d9(); // Function Engine.ParticleSystemComponent.*3ed14454d9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c2d90
	void *090136d69a(); // Function Engine.ParticleSystemComponent.*090136d69a // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab27c
	void *7f2d6dd8db(); // Function Engine.ParticleSystemComponent.*7f2d6dd8db // Final|Native|Public|BlueprintCallable // @ game+0x67bd324
	void *03bf17d814(); // Function Engine.ParticleSystemComponent.*03bf17d814 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bd8a4
	void *7c98b28202(); // Function Engine.ParticleSystemComponent.*7c98b28202 // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab788
	void *565424fca2(); // Function Engine.ParticleSystemComponent.*565424fca2 // Final|Native|Public|BlueprintCallable // @ game+0x67a9c40
	void *9252cbf5cf(); // Function Engine.ParticleSystemComponent.*9252cbf5cf // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bed50
	void *72c115cb68(); // Function Engine.ParticleSystemComponent.*72c115cb68 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bd9a0
	void SetFloatParameter(); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x67bf7c0
	void *0ba4a0733f(); // Function Engine.ParticleSystemComponent.*0ba4a0733f // Final|Native|Public|BlueprintCallable // @ game+0x67c26e4
	void *5aad5cdf33(); // Function Engine.ParticleSystemComponent.*5aad5cdf33 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67aa148
};

// Class Engine.DefaultPawn
// Size: 0x490 (Inherited: 0x468)
struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x468(0x04)
	float BaseLookUpRate; // 0x46c(0x04)
	struct UPawnMovementComponent* MovementComponent; // 0x470(0x08)
	struct USphereComponent* CollisionComponent; // 0x478(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x480(0x08)
	char bAddDefaultMovementBindings : 1; // 0x488(0x01)
	char pad_488_1 : 7; // 0x488(0x01)
	char pad_489[0x7]; // 0x489(0x07)

	void MoveRight(); // Function Engine.DefaultPawn.MoveRight // Native|Public|BlueprintCallable // @ game+0x67b7d50
	void *b29ee3df94(); // Function Engine.DefaultPawn.*b29ee3df94 // Final|Native|Public|BlueprintCallable // @ game+0x67c45fc
	void MoveForward(); // Function Engine.DefaultPawn.MoveForward // Native|Public|BlueprintCallable // @ game+0x67b7cb4
	void *db93078038(); // Function Engine.DefaultPawn.*db93078038 // Native|Public|BlueprintCallable // @ game+0x67b7dec
	void *0067206425(); // Function Engine.DefaultPawn.*0067206425 // Final|Native|Public|BlueprintCallable // @ game+0x67b79c0
};

// Class Engine.SpectatorPawn
// Size: 0x490 (Inherited: 0x490)
struct ASpectatorPawn : ADefaultPawn {
};

// Class Engine.FloatingPawnMovement
// Size: 0x2a0 (Inherited: 0x290)
struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x288(0x04)
	float Acceleration; // 0x28c(0x04)
	float Deceleration; // 0x290(0x04)
	float TurningBoost; // 0x294(0x04)
	char *502d899bf1 : 1; // 0x298(0x01)
};

// Class Engine.SpectatorPawnMovement
// Size: 0x2b0 (Inherited: 0x2a0)
struct USpectatorPawnMovement : UFloatingPawnMovement {
	char *8499a67b55 : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0xf]; // 0x2a1(0x0f)
};

// Class Engine.SplineComponent
// Size: 0xaf0 (Inherited: 0xa00)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves *5d0c3695ca; // 0x9f8(0x60)
	struct FInterpCurveVector SplineInfo; // 0xa58(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0xa70(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0xa88(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0xaa0(0x18)
	bool bAllowSplineEditingPerInstance; // 0xab8(0x01)
	int32 *12ac1bfde3; // 0xabc(0x04)
	bool *0fe780b02b; // 0xac0(0x01)
	bool *ebdb0cb481; // 0xac1(0x01)
	float *5deaafa98f; // 0xac4(0x04)
	float Duration; // 0xac8(0x04)
	bool bStationaryEndpoints; // 0xacc(0x01)
	bool *90c9232a35; // 0xacd(0x01)
	bool *cfa2a7f9d6; // 0xace(0x01)
	bool bInputSplinePointsToConstructionScript; // 0xacf(0x01)
	bool bDrawDebug; // 0xad0(0x01)
	bool *f088e06431; // 0xad1(0x01)
	bool bLoopPositionOverride; // 0xad2(0x01)
	float *0c6302c5b8; // 0xad4(0x04)
	struct FVector DefaultUpVector; // 0xad8(0x0c)
	char pad_AE6[0xa]; // 0xae6(0x0a)

	void *f521037389(); // Function Engine.SplineComponent.*f521037389 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e04f4
	void GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e81e4
	void *f2d9795463(); // Function Engine.SplineComponent.*f2d9795463 // Final|Native|Public|BlueprintCallable // @ game+0x6808e6c
	void *279afd97e4(); // Function Engine.SplineComponent.*279afd97e4 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6812104
	void *61729ae40b(); // Function Engine.SplineComponent.*61729ae40b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e9f4c
	void *14c6ac2ad7(); // Function Engine.SplineComponent.*14c6ac2ad7 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ecde0
	void *8e0da38491(); // Function Engine.SplineComponent.*8e0da38491 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ec400
	void *2442c3cfda(); // Function Engine.SplineComponent.*2442c3cfda // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67c9f7c
	void *0d1539b16e(); // Function Engine.SplineComponent.*0d1539b16e // Final|Native|Public|BlueprintCallable // @ game+0x68038a0
	void *0bd297ec0c(); // Function Engine.SplineComponent.*0bd297ec0c // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e7bac
	void *715e15771d(); // Function Engine.SplineComponent.*715e15771d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67eb624
	void *eaeef389ef(); // Function Engine.SplineComponent.*eaeef389ef // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e74ec
	void *482c918b00(); // Function Engine.SplineComponent.*482c918b00 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e9c34
	void *8168c7d440(); // Function Engine.SplineComponent.*8168c7d440 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6813174
	void *0535ea2b38(); // Function Engine.SplineComponent.*0535ea2b38 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e9e14
	void *5bc3f87938(); // Function Engine.SplineComponent.*5bc3f87938 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ed60c
	void *c031841270(); // Function Engine.SplineComponent.*c031841270 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67edb04
	void *37ea769ce6(); // Function Engine.SplineComponent.*37ea769ce6 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea53c
	void *8342ca28b4(); // Function Engine.SplineComponent.*8342ca28b4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ed7dc
	void *93e1ad9183(); // Function Engine.SplineComponent.*93e1ad9183 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67eac04
	void *b2051880fc(); // Function Engine.SplineComponent.*b2051880fc // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea468
	void *53522ec073(); // Function Engine.SplineComponent.*53522ec073 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e01d8
	void *7241eb6d5b(); // Function Engine.SplineComponent.*7241eb6d5b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67eb524
	void *8e2c528b3c(); // Function Engine.SplineComponent.*8e2c528b3c // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6812fe8
	void *ae66b82b13(); // Function Engine.SplineComponent.*ae66b82b13 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ec574
	void *561d92dd32(); // Function Engine.SplineComponent.*561d92dd32 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e42a8
	void *1e53d88498(); // Function Engine.SplineComponent.*1e53d88498 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e73c8
	void AddSplinePoint(); // Function Engine.SplineComponent.AddSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67ca268
	void *ace558dfb0(); // Function Engine.SplineComponent.*ace558dfb0 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67dfadc
	void *9bc798c6dd(); // Function Engine.SplineComponent.*9bc798c6dd // Final|Native|Public|BlueprintCallable // @ game+0x67d6580
	void *a497bf4f60(); // Function Engine.SplineComponent.*a497bf4f60 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e53e8
	void *93587c57a4(); // Function Engine.SplineComponent.*93587c57a4 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67ca098
	void *eb8b8b03c8(); // Function Engine.SplineComponent.*eb8b8b03c8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ed954
	void *2a5354556b(); // Function Engine.SplineComponent.*2a5354556b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e99b8
	void *b2334fe3c5(); // Function Engine.SplineComponent.*b2334fe3c5 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e00d4
	void *a4b5846717(); // Function Engine.SplineComponent.*a4b5846717 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67ca3b0
	void *8e0b29167c(); // Function Engine.SplineComponent.*8e0b29167c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e7668
	void *e4d7315f08(); // Function Engine.SplineComponent.*e4d7315f08 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e7810
	void *d0fbe1200b(); // Function Engine.SplineComponent.*d0fbe1200b // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67bf008
	void *f936f6802a(); // Function Engine.SplineComponent.*f936f6802a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e4a1c
	void *0008f1c73b(); // Function Engine.SplineComponent.*0008f1c73b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea148
	void *d5b3bb04f1(); // Function Engine.SplineComponent.*d5b3bb04f1 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e067c
	void *4dcb5b3bb8(); // Function Engine.SplineComponent.*4dcb5b3bb8 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x68150dc
	void *267f16087a(); // Function Engine.SplineComponent.*267f16087a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67dfa30
	void *1ccda6641b(); // Function Engine.SplineComponent.*1ccda6641b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ed89c
	void *841cb0b102(); // Function Engine.SplineComponent.*841cb0b102 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67ca53c
	void *b6f1ea618d(); // Function Engine.SplineComponent.*b6f1ea618d // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6811e9c
	void *f5754b1a86(); // Function Engine.SplineComponent.*f5754b1a86 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e7ab0
	void *6f43d569e7(); // Function Engine.SplineComponent.*6f43d569e7 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x680ebd8
	void *68e4d63e31(); // Function Engine.SplineComponent.*68e4d63e31 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e73c8
	void *78cf24de3f(); // Function Engine.SplineComponent.*78cf24de3f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e79b0
	void *8b89c44917(); // Function Engine.SplineComponent.*8b89c44917 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ec720
	void *34595addba(); // Function Engine.SplineComponent.*34595addba // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e45e4
	void *817d1e31e3(); // Function Engine.SplineComponent.*817d1e31e3 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x6811ca0
	void *ca13fcab0a(); // Function Engine.SplineComponent.*ca13fcab0a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67df90c
	void *57c75d8184(); // Function Engine.SplineComponent.*57c75d8184 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e98b8
	void *0764c61ef4(); // Function Engine.SplineComponent.*0764c61ef4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea3b0
	void *805ba4563a(); // Function Engine.SplineComponent.*805ba4563a // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67ca1c8
	void *b4f2515961(); // Function Engine.SplineComponent.*b4f2515961 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x6813ec4
	void *24ae13b599(); // Function Engine.SplineComponent.*24ae13b599 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e0308
	void *b7c16d3638(); // Function Engine.SplineComponent.*b7c16d3638 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67eac2c
	void *25df325ea2(); // Function Engine.SplineComponent.*25df325ea2 // Final|Native|Public|BlueprintCallable // @ game+0x681e2d8
	void *ce1badd0f1(); // Function Engine.SplineComponent.*ce1badd0f1 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ecee0
	void SetSplinePointType(); // Function Engine.SplineComponent.SetSplinePointType // Final|Native|Public|BlueprintCallable // @ game+0x6811d6c
	void *81a349303e(); // Function Engine.SplineComponent.*81a349303e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ea04c
	void *2fbe7e676d(); // Function Engine.SplineComponent.*2fbe7e676d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x67bf008
	void *175855f7ad(); // Function Engine.SplineComponent.*175855f7ad // Final|Native|Public|BlueprintCallable // @ game+0x680a884
	void *04eb39a8ec(); // Function Engine.SplineComponent.*04eb39a8ec // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67edbc4
	void *597a0fd09e(); // Function Engine.SplineComponent.*597a0fd09e // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67edcd4
	void *f0e4b56ae4(); // Function Engine.SplineComponent.*f0e4b56ae4 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ed6cc
	void *938009a2b9(); // Function Engine.SplineComponent.*938009a2b9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e9aec
	void *4b9fad82e6(); // Function Engine.SplineComponent.*4b9fad82e6 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x680a098
	void *f4221d3f9b(); // Function Engine.SplineComponent.*f4221d3f9b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e44e4
	void *092a5c45dd(); // Function Engine.SplineComponent.*092a5c45dd // Final|Native|Public|BlueprintCallable // @ game+0x6808d74
	void *6f307b627d(); // Function Engine.SplineComponent.*6f307b627d // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e03d0
	void *b923bdee7e(); // Function Engine.SplineComponent.*b923bdee7e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67e9d28
	void *7ed08d336d(); // Function Engine.SplineComponent.*7ed08d336d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ed014
	void *17cdd5e7dd(); // Function Engine.SplineComponent.*17cdd5e7dd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e46e0
	void *6b603f80ab(); // Function Engine.SplineComponent.*6b603f80ab // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67dffb0
	void *0997d90b54(); // Function Engine.SplineComponent.*0997d90b54 // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e76b8
	void *5387c29b2a(); // Function Engine.SplineComponent.*5387c29b2a // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67e1f7c
};

// Class Engine.MaterialInterface
// Size: 0x78 (Inherited: 0x30)
struct UMaterialInterface : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x38(0x08)
	char pad_40[0x8]; // 0x40(0x08)
	struct F*5dc70d11a6 LightmassSettings; // 0x48(0x14)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct TArray<struct F*bed7a8a90d> *e928e50296; // 0x60(0x10)
	char pad_70[0x8]; // 0x70(0x08)

	void *a8f9fd13ce(); // Function Engine.MaterialInterface.*a8f9fd13ce // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x67ab0ec
	void *858264d1dd(); // Function Engine.MaterialInterface.*858264d1dd // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67afc08
};

// Class Engine.MaterialInstance
// Size: 0x1e8 (Inherited: 0x78)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0x78(0x08)
	struct UMaterialInterface* Parent; // 0x80(0x08)
	char *8301cd2f62 : 1; // 0x88(0x01)
	char *7f383fa02f : 1; // 0x88(0x01)
	char pad_88_2 : 1; // 0x88(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x88(0x01)
	char pad_88_4 : 4; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct TArray<struct F*e1e5e1e8bc> FontParameterValues; // 0x90(0x10)
	struct TArray<struct F*fffe4f3fbb> ScalarParameterValues; // 0xa0(0x10)
	struct TArray<struct F*d64a96c518> TextureParameterValues; // 0xb0(0x10)
	struct TArray<struct F*8b44e564ca> VectorParameterValues; // 0xc0(0x10)
	bool bOverrideBaseProperties; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xd4(0x24)
	char pad_F8[0xf0]; // 0xf8(0xf0)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x1e8 (Inherited: 0x1e8)
struct UMaterialInstanceConstant : UMaterialInstance {
};

// Class Engine.MaterialExpression
// Size: 0x68 (Inherited: 0x30)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x30(0x08)
	struct UMaterialFunction* Function; // 0x38(0x08)
	struct FString Desc; // 0x40(0x10)
	struct FColor BorderColor; // 0x50(0x04)
	char *1de66c58b2 : 1; // 0x54(0x01)
	char *983854d3fd : 1; // 0x54(0x01)
	char *23373f140d : 1; // 0x54(0x01)
	char *fcfa3c4f53 : 1; // 0x54(0x01)
	char *0dfd399f8d : 1; // 0x54(0x01)
	char *a9a0a72ccf : 1; // 0x54(0x01)
	char *f11152e06d : 1; // 0x54(0x01)
	char *2e1791687e : 1; // 0x54(0x01)
	char *c2835d8d12 : 1; // 0x55(0x01)
	char *f0c96f4fc4 : 1; // 0x55(0x01)
	char *1c92d522e2 : 1; // 0x55(0x01)
	char pad_55_3 : 5; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	struct TArray<struct FExpressionOutput> Outputs; // 0x58(0x10)
};

// Class Engine.*699123f0e5
// Size: 0x68 (Inherited: 0x68)
struct U*699123f0e5 : UMaterialExpression {
};

// Class Engine.*c9284c4e3d
// Size: 0x68 (Inherited: 0x68)
struct U*c9284c4e3d : UMaterialExpression {
};

// Class Engine.*4471bd9586
// Size: 0x30 (Inherited: 0x30)
struct U*4471bd9586 : UObject {

	void Activate(); // Function Engine.*4471bd9586.Activate // Native|Public|BlueprintCallable // @ game+0xc56b64
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x3c8 (Inherited: 0x2c0)
struct UBlueprintGeneratedClass : UClass {
	int32 NumReplicatedProperties; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct TArray<struct U*cdcaa442f5*> *a7317b54d6; // 0x2c8(0x10)
	struct TArray<struct UActorComponent*> *9ef71c20e3; // 0x2d8(0x10)
	struct TArray<struct U*a7a0563fde*> *259f597d99; // 0x2e8(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x2f8(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x300(0x08)
	struct UStructProperty* *c9e96efa09; // 0x308(0x08)
	struct UFunction* *2dc08a4ade; // 0x310(0x08)
	struct TArray<struct F*3600aa5c0a> FastCallPairs; // 0x318(0x10)
	bool *6234aa4ebc; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct TMap<struct FName, struct F*02431ea27c> *54cd37d868; // 0x330(0x50)
	bool *e0afe426c6; // 0x380(0x01)
	char pad_381[0x47]; // 0x381(0x47)
};

// Class Engine.CameraActor
// Size: 0x9b0 (Inherited: 0x408)
struct ACameraActor : AActor {
	enum class EAutoReceiveInput *c43918eaa7; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct UCameraComponent* CameraComponent; // 0x410(0x08)
	struct USceneComponent* SceneComponent; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
	char bConstrainAspectRatio : 1; // 0x428(0x01)
	char pad_428_1 : 7; // 0x428(0x01)
	char pad_429[0x3]; // 0x429(0x03)
	float AspectRatio; // 0x42c(0x04)
	float FOVAngle; // 0x430(0x04)
	float PostProcessBlendWeight; // 0x434(0x04)
	char pad_438[0x8]; // 0x438(0x08)
	struct FPostProcessSettings PostProcessSettings; // 0x440(0x570)

	void *d8f12ba800(); // Function Engine.CameraActor.*d8f12ba800 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ab094
};

// Class Engine.UserDefinedStruct
// Size: 0x108 (Inherited: 0xf8)
struct UUserDefinedStruct : UScriptStruct {
	struct FGuid Guid; // 0xf8(0x10)
};

// Class Engine.AISystemBase
// Size: 0x50 (Inherited: 0x30)
struct UAISystemBase : UObject {
	struct FStringClassReference AISystemClassName; // 0x30(0x10)
	struct FName AISystemModuleName; // 0x40(0x08)
	bool bInstantiateAISystemOnClient; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class Engine.*7faddb26b3
// Size: 0x50 (Inherited: 0x30)
struct U*7faddb26b3 : UObject {
	struct TArray<struct F*614c6831c7> Areas; // 0x30(0x10)
	struct F*dd97a4099e IncludeFlags; // 0x40(0x04)
	struct F*dd97a4099e ExcludeFlags; // 0x44(0x04)
	char pad_48[0x8]; // 0x48(0x08)
};

// Class Engine.*5cde8540b3
// Size: 0x40 (Inherited: 0x30)
struct U*5cde8540b3 : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class Engine.Model
// Size: 0x568 (Inherited: 0x30)
struct UModel : UObject {
	char pad_30[0x538]; // 0x30(0x538)
};

// Class Engine.*0e4851fd83
// Size: 0x30 (Inherited: 0x30)
struct U*0e4851fd83 : UObject {
};

// Class Engine.*ac81b8ce3c
// Size: 0x30 (Inherited: 0x30)
struct U*ac81b8ce3c : UObject {
};

// Class Engine.EdGraphNode
// Size: 0xa8 (Inherited: 0x30)
struct UEdGraphNode : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins; // 0x40(0x10)
	int32 *7fd1966a66; // 0x50(0x04)
	int32 *39ee486500; // 0x54(0x04)
	int32 *24c5dc7d16; // 0x58(0x04)
	int32 *a3c4327bc9; // 0x5c(0x04)
	char *a6a3b5d5fe : 1; // 0x60(0x01)
	char pad_60_1 : 7; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct FString NodeComment; // 0x68(0x10)
	bool *28c2068cc1; // 0x78(0x01)
	bool *fcfa3c4f53; // 0x79(0x01)
	bool *3c855ef06e; // 0x7a(0x01)
	char pad_7B[0x1]; // 0x7b(0x01)
	int32 *b5ee58d6de; // 0x7c(0x04)
	struct FString *25e7648d30; // 0x80(0x10)
	struct FGuid NodeGuid; // 0x90(0x10)
	enum class ENodeAdvancedPins *a60922bdd6; // 0xa0(0x01)
	enum class ENodeEnabledState *a1d48742a2; // 0xa1(0x01)
	bool *bcbc8fe9b4; // 0xa2(0x01)
	bool bIsNodeEnabled; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x148 (Inherited: 0x30)
struct UEdGraphPin_Deprecated : UObject {
	struct FString PinName; // 0x30(0x10)
	struct FString PinToolTip; // 0x40(0x10)
	enum class EEdGraphPinDirection Direction; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct F*c760683241 PinType; // 0x58(0x80)
	struct FString DefaultValue; // 0xd8(0x10)
	struct FString *6681b284ab; // 0xe8(0x10)
	struct UObject* *3a208b4b78; // 0xf8(0x08)
	struct FText *e2e1d469ef; // 0x100(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> *fe4bb925c1; // 0x118(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> *4138ba5f80; // 0x128(0x10)
	struct UEdGraphPin_Deprecated* *e0e888d50f; // 0x138(0x08)
	struct UEdGraphPin_Deprecated* *cdfc22b853; // 0x140(0x08)
};

// Class Engine.*484eacf266
// Size: 0x30 (Inherited: 0x30)
struct U*484eacf266 : UInterface {
};

// Class Engine.Level
// Size: 0x330 (Inherited: 0x30)
struct ULevel : UObject {
	char pad_30[0x60]; // 0x30(0x60)
	struct TArray<struct FGuid> *452e3ab3b7; // 0x90(0x10)
	struct UWorld* *0c2ed5c6ba; // 0xa0(0x08)
	struct U*5b918d4999* ActorCluster; // 0xa8(0x08)
	struct TArray<struct U*d83febdd27*> *1988633d5a; // 0xb0(0x10)
	float *2bc81c7841; // 0xc0(0x04)
	struct FIntVector *b01974b4ce; // 0xc4(0x0c)
	struct TArray<struct U*204470fe3a*> *b8d105c335; // 0xd0(0x10)
	struct UMapBuildDataRegistry* *355caf4b0c; // 0xe0(0x08)
	struct ANavigationObjectBase* *285a8fdd46; // 0xe8(0x08)
	struct UModel* Model; // 0xf0(0x08)
	int32 *255d9e4e74; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct TArray<struct FVector> *c941c0bf37; // 0x100(0x10)
	bool *e41f9fc895; // 0x110(0x01)
	char pad_111[0x17]; // 0x111(0x17)
	struct ANavigationObjectBase* *49596c1750; // 0x128(0x08)
	char pad_130[0x70]; // 0x130(0x70)
	struct ALevelScriptActor* LevelScriptActor; // 0x1a0(0x08)
	int32 *41942aff95; // 0x1a8(0x04)
	char pad_1AC[0x3c]; // 0x1ac(0x3c)
	float *2013658f1c; // 0x1e8(0x04)
	char pad_1EC_0 : 2; // 0x1ec(0x01)
	char *04c05013b7 : 1; // 0x1ec(0x01)
	char bIsVisible : 1; // 0x1ec(0x01)
	char bLocked : 1; // 0x1ec(0x01)
	char *a243b3e55e : 1; // 0x1ec(0x01)
	char pad_1EC_6 : 2; // 0x1ec(0x01)
	char pad_1ED[0x8b]; // 0x1ed(0x8b)
	struct FGuid *47880ed3ea; // 0x278(0x10)
	char pad_288[0x78]; // 0x288(0x78)
	struct AWorldSettings* WorldSettings; // 0x300(0x08)
	char pad_308[0x8]; // 0x308(0x08)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x310(0x10)
	char pad_320[0x10]; // 0x320(0x10)
};

// Class Engine.*078dd500bb
// Size: 0x30 (Inherited: 0x30)
struct U*078dd500bb : UInterface {
};

// Class Engine.AmbientSound
// Size: 0x410 (Inherited: 0x408)
struct AAmbientSound : AActor {
	struct UAudioComponent* AudioComponent; // 0x408(0x08)

	void FadeOut(); // Function Engine.AmbientSound.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0x67a9de0
	void Play(); // Function Engine.AmbientSound.Play // Final|Native|Public|BlueprintCallable // @ game+0x67b87c8
	void *c8b0393496(); // Function Engine.AmbientSound.*c8b0393496 // Final|Native|Public|BlueprintCallable // @ game+0x67a9cf0
	void AdjustVolume(); // Function Engine.AmbientSound.AdjustVolume // Final|Native|Public|BlueprintCallable // @ game+0x67a36dc
	void Stop(); // Function Engine.AmbientSound.Stop // Final|Native|Public|BlueprintCallable // @ game+0x67c3bc0
};

// Class Engine.AutoBenchSettings
// Size: 0x48 (Inherited: 0x30)
struct UAutoBenchSettings : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct F*fc49b70054> Settings; // 0x38(0x10)
};

// Class Engine.AutoBenchControlActor
// Size: 0x408 (Inherited: 0x408)
struct AAutoBenchControlActor : AActor {
};

// Class Engine.*2f0001d6bf
// Size: 0x30 (Inherited: 0x30)
struct U*2f0001d6bf : UObject {
};

// Class Engine.*0a30f37bbc
// Size: 0x30 (Inherited: 0x30)
struct U*0a30f37bbc : UInterface {
};

// Class Engine.BillboardComponent
// Size: 0xa20 (Inherited: 0xa00)
struct UBillboardComponent : UPrimitiveComponent {
	struct UTexture2D* Sprite; // 0x9f8(0x08)
	char bIsScreenSizeScaled : 1; // 0xa00(0x01)
	float ScreenSize; // 0xa04(0x04)
	float U; // 0xa08(0x04)
	float UL; // 0xa0c(0x04)
	float V; // 0xa10(0x04)
	float VL; // 0xa14(0x04)
	struct FColor Color; // 0xa18(0x04)

	void *de3bcd9efe(); // Function Engine.BillboardComponent.*de3bcd9efe // Native|Public|BlueprintCallable // @ game+0x67c290c
	void SetColor(); // Function Engine.BillboardComponent.SetColor // Final|Native|Public|HasDefaults // @ game+0x67beb78
	void *d73d19ce7c(); // Function Engine.BillboardComponent.*d73d19ce7c // Native|Public|BlueprintCallable // @ game+0x67c21b8
	void *bcd91c059a(); // Function Engine.BillboardComponent.*bcd91c059a // Native|Public|BlueprintCallable // @ game+0x67c224c
};

// Class Engine.*526b625f4a
// Size: 0x30 (Inherited: 0x30)
struct U*526b625f4a : UInterface {
};

// Class Engine.StaticMesh
// Size: 0x178 (Inherited: 0x30)
struct UStaticMesh : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	int32 MinLOD; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct UMaterialInterface*> Materials; // 0x50(0x10)
	struct TArray<struct F*43af02caf0> StaticMaterials; // 0x60(0x10)
	float *7732c89687; // 0x70(0x04)
	int32 LightMapResolution; // 0x74(0x04)
	int32 *9726a81429; // 0x78(0x04)
	float *02c4f73f59; // 0x7c(0x04)
	struct UBodySetup* BodySetup; // 0x80(0x08)
	int32 *c247be02b2; // 0x88(0x04)
	char *c76a126daa : 1; // 0x8c(0x01)
	char *a54083ef41 : 1; // 0x8c(0x01)
	char bStripComplexCollisionForConsole : 1; // 0x8c(0x01)
	char *5fad43e82d : 1; // 0x8c(0x01)
	char bRequiresAreaWeightedSampling : 1; // 0x8c(0x01)
	char pad_8C_5 : 3; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	float LpvBiasMultiplier; // 0x90(0x04)
	bool *ecb84c8f41; // 0x94(0x01)
	char pad_95[0x33]; // 0x95(0x33)
	struct TArray<struct U*51ab10dd10*> Sockets; // 0xc8(0x10)
	char pad_D8[0x10]; // 0xd8(0x10)
	struct FVector *288824cc7d; // 0xe8(0x0c)
	struct FVector *f93bcbf265; // 0xf4(0x0c)
	struct FBoxSphereBounds *a5cca5147a; // 0x100(0x1c)
	bool *f7f2e560f1; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
	int32 *0f0507e036; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x128(0x10)
	struct UNavCollision* NavCollision; // 0x138(0x08)
	struct F*1dd977ee69 *e93e77c09b; // 0x140(0x28)
	struct TArray<struct UMaterialInstanceConstant*> *431663e11f; // 0x168(0x10)

	void *f36fae672e(); // Function Engine.StaticMesh.*f36fae672e // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67abb18
	void *ba56162d2e(); // Function Engine.StaticMesh.*ba56162d2e // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af1ec
	void *7bd3928ea5(); // Function Engine.StaticMesh.*7bd3928ea5 // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67af17c
	void *c8e9b0a557(); // Function Engine.StaticMesh.*c8e9b0a557 // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67aba0c
};

// Class Engine.*00b670dc95
// Size: 0x5f0 (Inherited: 0x4d0)
struct U*00b670dc95 : USceneComponent {
	struct FVector Extents; // 0x4d0(0x0c)
	struct FVector FadeExtents_Neg; // 0x4dc(0x0c)
	struct FVector FadeExtents_Pos; // 0x4e8(0x0c)
	bool bOutdoorTransition; // 0x4f4(0x01)
	char pad_4F5[0x3]; // 0x4f5(0x03)
	float VolumeAlpha; // 0x4f8(0x04)
	float Brightness; // 0x4fc(0x04)
	float SkyIntensity; // 0x500(0x04)
	int32 Priority; // 0x504(0x04)
	struct F*47c2c57997 AmbientCube2; // 0x508(0xc8)
	char pad_5D0[0x20]; // 0x5d0(0x20)

	void *0c5a7fd6a0(); // Function Engine.*00b670dc95.*0c5a7fd6a0 // Final|Native|Public // @ game+0xbdbb4c
};

// Class Engine.GIVolumesContainerComponent
// Size: 0x4f0 (Inherited: 0x4d0)
struct UGIVolumesContainerComponent : USceneComponent {
	char pad_4D0[0x20]; // 0x4d0(0x20)
};

// Class Engine.BoxGIVolume
// Size: 0x410 (Inherited: 0x408)
struct ABoxGIVolume : AActor {
	struct U*00b670dc95* VolumeComponent; // 0x408(0x08)
};

// Class Engine.BrushShape
// Size: 0x440 (Inherited: 0x440)
struct ABrushShape : ABrush {
};

// Class Engine.AudioVolume
// Size: 0x488 (Inherited: 0x440)
struct AAudioVolume : AVolume {
	float Priority; // 0x440(0x04)
	char bEnabled : 1; // 0x444(0x01)
	char pad_444_1 : 7; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)
	struct FReverbSettings Settings; // 0x448(0x18)
	struct F*2b1daf3feb AmbientZoneSettings; // 0x460(0x24)
	char pad_484[0x4]; // 0x484(0x04)

	void *f938159d44(); // Function Engine.AudioVolume.*f938159d44 // Final|Native|Public|BlueprintCallable // @ game+0x67bf578
	void *bbd4275724(); // Function Engine.AudioVolume.*bbd4275724 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67c0290
	void SetPriority(); // Function Engine.AudioVolume.SetPriority // Final|Native|Public|BlueprintCallable // @ game+0x67c1ae4
	void SetReverbSettings(); // Function Engine.AudioVolume.SetReverbSettings // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x67c2060
	void OnRep_bEnabled(); // Function Engine.AudioVolume.OnRep_bEnabled // Final|Native|Private // @ game+0x5a410a8
};

// Class Engine.BlockingVolume
// Size: 0x440 (Inherited: 0x440)
struct ABlockingVolume : AVolume {
};

// Class Engine.CameraBlockingVolume
// Size: 0x440 (Inherited: 0x440)
struct ACameraBlockingVolume : AVolume {
};

// Class Engine.CullDistanceVolume
// Size: 0x468 (Inherited: 0x440)
struct ACullDistanceVolume : AVolume {
	struct TArray<struct F*a4caa301c7> CullDistances; // 0x440(0x10)
	char bEnabled : 1; // 0x450(0x01)
	char pad_450_1 : 7; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	float CullDistanceForLODActor; // 0x454(0x04)
	float CullDistanceForLODActorTooFar; // 0x458(0x04)
	bool bUseActorBound; // 0x45c(0x01)
	char pad_45D[0x3]; // 0x45d(0x03)
	float IgnoreActorBoundSize; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
};

// Class Engine.LevelStreamingVolume
// Size: 0x458 (Inherited: 0x440)
struct ALevelStreamingVolume : AVolume {
	struct TArray<struct FName> StreamingLevelNames; // 0x440(0x10)
	char bEditorPreVisOnly : 1; // 0x450(0x01)
	char bDisabled : 1; // 0x450(0x01)
	char pad_450_2 : 6; // 0x450(0x01)
	char pad_451[0x3]; // 0x451(0x03)
	enum class *bae5a64964 StreamingUsage; // 0x454(0x01)
	char pad_455[0x3]; // 0x455(0x03)
};

// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x440 (Inherited: 0x440)
struct ALightmassCharacterIndirectDetailVolume : AVolume {
};

// Class Engine.LightmassImportanceVolume
// Size: 0x440 (Inherited: 0x440)
struct ALightmassImportanceVolume : AVolume {
};

// Class Engine.MeshMergeCullingVolume
// Size: 0x440 (Inherited: 0x440)
struct AMeshMergeCullingVolume : AVolume {
};

// Class Engine.NavMeshBoundsVolume
// Size: 0x448 (Inherited: 0x440)
struct ANavMeshBoundsVolume : AVolume {
	struct FNavAgentSelector SupportedAgents; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class Engine.NavModifierVolume
// Size: 0x450 (Inherited: 0x440)
struct ANavModifierVolume : AVolume {
	char pad_440[0x8]; // 0x440(0x08)
	struct UClass* AreaClass; // 0x448(0x08)

	void *17584ae5c0(); // Function Engine.NavModifierVolume.*17584ae5c0 // Final|Native|Public|BlueprintCallable // @ game+0x67bd0b4
};

// Class Engine.DefaultPhysicsVolume
// Size: 0x458 (Inherited: 0x458)
struct ADefaultPhysicsVolume : APhysicsVolume {
};

// Class Engine.KillZVolume
// Size: 0x458 (Inherited: 0x458)
struct AKillZVolume : APhysicsVolume {
};

// Class Engine.PainCausingVolume
// Size: 0x480 (Inherited: 0x458)
struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x458(0x01)
	char pad_458_1 : 7; // 0x458(0x01)
	char pad_459[0x3]; // 0x459(0x03)
	float DamagePerSec; // 0x45c(0x04)
	struct UClass* DamageType; // 0x460(0x08)
	float PainInterval; // 0x468(0x04)
	char bEntryPain : 1; // 0x46c(0x01)
	char *79b99203af : 1; // 0x46c(0x01)
	char pad_46C_2 : 6; // 0x46c(0x01)
	char pad_46D[0x3]; // 0x46d(0x03)
	struct AController* *f6a0b7550d; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)
};

// Class Engine.BlendableInterface
// Size: 0x30 (Inherited: 0x30)
struct UBlendableInterface : UInterface {
};

// Class Engine.Scene
// Size: 0x30 (Inherited: 0x30)
struct UScene : UObject {
};

// Class Engine.*c0fb985655
// Size: 0x30 (Inherited: 0x30)
struct U*c0fb985655 : UInterface {
};

// Class Engine.PostProcessVolume
// Size: 0x9d0 (Inherited: 0x440)
struct APostProcessVolume : AVolume {
	char pad_440[0x10]; // 0x440(0x10)
	struct FPostProcessSettings Settings; // 0x450(0x570)
	float Priority; // 0x9c0(0x04)
	float BlendRadius; // 0x9c4(0x04)
	float BlendWeight; // 0x9c8(0x04)
	char bEnabled : 1; // 0x9cc(0x01)
	char bUnbound : 1; // 0x9cc(0x01)
	char pad_9CC_2 : 6; // 0x9cc(0x01)
	char pad_9CD[0x3]; // 0x9cd(0x03)

	void *ecceb55aba(); // Function Engine.PostProcessVolume.*ecceb55aba // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x67a2cc0
	void *7bdf8efba3(); // Function Engine.PostProcessVolume.*7bdf8efba3 // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x67c4744
};

// Class Engine.PrecomputedVisibilityOverrideVolume
// Size: 0x470 (Inherited: 0x440)
struct APrecomputedVisibilityOverrideVolume : AVolume {
	struct TArray<struct AActor*> OverrideVisibleActors; // 0x440(0x10)
	struct TArray<struct AActor*> OverrideInvisibleActors; // 0x450(0x10)
	struct TArray<struct FName> OverrideInvisibleLevels; // 0x460(0x10)
};

// Class Engine.PrecomputedVisibilityVolume
// Size: 0x440 (Inherited: 0x440)
struct APrecomputedVisibilityVolume : AVolume {
};

// Class Engine.TriggerVolume
// Size: 0x440 (Inherited: 0x440)
struct ATriggerVolume : AVolume {
};

// Class Engine.*e0a79ad73f
// Size: 0x30 (Inherited: 0x30)
struct U*e0a79ad73f : UInterface {
};

// Class Engine.CameraShake
// Size: 0x170 (Inherited: 0x30)
struct UCameraShake : UObject {
	char *1bcf2af904 : 1; // 0x30(0x01)
	char pad_30_1 : 7; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float *bf3553f181; // 0x34(0x04)
	float *3148f5c3c5; // 0x38(0x04)
	float *8698cd9385; // 0x3c(0x04)
	struct F*673e053786 *ac240f8630; // 0x40(0x24)
	struct F*eff78d75d0 *b8c7dd6819; // 0x64(0x24)
	struct F*58787e3608 *511d76dce3; // 0x88(0x0c)
	float AnimPlayRate; // 0x94(0x04)
	float *5aee86e63b; // 0x98(0x04)
	float *b54198ecd1; // 0x9c(0x04)
	float *43bfb06925; // 0xa0(0x04)
	float *968bd93263; // 0xa4(0x04)
	struct UCameraAnim* Anim; // 0xa8(0x08)
	char bRandomAnimSegment : 1; // 0xb0(0x01)
	char pad_B0_1 : 7; // 0xb0(0x01)
	char pad_B1[0x17]; // 0xb1(0x17)
	struct APlayerCameraManager* CameraOwner; // 0xc8(0x08)
	char pad_D0[0x88]; // 0xd0(0x88)
	float ShakeScale; // 0x158(0x04)
	float OscillatorTimeRemaining; // 0x15c(0x04)
	struct U*de6aae17ea* AnimInst; // 0x160(0x08)
	char pad_168[0x8]; // 0x168(0x08)

	void ReceivePlayShake(); // Function Engine.CameraShake.ReceivePlayShake // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void ReceiveStopShake(); // Function Engine.CameraShake.ReceiveStopShake // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void BlueprintUpdateCameraShake(); // Function Engine.CameraShake.BlueprintUpdateCameraShake // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22ddc4
	void ReceiveIsFinished(); // Function Engine.CameraShake.ReceiveIsFinished // Native|Event|Public|BlueprintEvent|Const // @ game+0xcc9138
};

// Class Engine.*63b14265fa
// Size: 0x290 (Inherited: 0x200)
struct U*63b14265fa : UActorComponent {
	char pad_200[0x70]; // 0x200(0x70)
	struct TArray<struct F*08ee4d66ce> *08ee4d66ce; // 0x270(0x10)
	char pad_280[0x10]; // 0x280(0x10)

	void *813159274a(); // Function Engine.*63b14265fa.*813159274a // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x67b15c0
	void OnInputOwnerEndPlayed(); // Function Engine.*63b14265fa.OnInputOwnerEndPlayed // Final|Native|Private // @ game+0x67b7ea8
	void *c51a2b8470(); // Function Engine.*63b14265fa.*c51a2b8470 // Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac800
	void *7e45599f79(); // Function Engine.*63b14265fa.*7e45599f79 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac510
	void *a04458f0a0(); // Function Engine.*63b14265fa.*a04458f0a0 // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x67b15c0
	void *f02eefa657(); // Function Engine.*63b14265fa.*f02eefa657 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67b0924
	void *cd26f7604c(); // Function Engine.*63b14265fa.*cd26f7604c // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac510
	void *d2538d0575(); // Function Engine.*63b14265fa.*d2538d0575 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac618
	void *4f1eccd288(); // Function Engine.*63b14265fa.*4f1eccd288 // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac730
	void *dd977a3fde(); // Function Engine.*63b14265fa.*dd977a3fde // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x67b15c0
};

// Class Engine.CurveFloat
// Size: 0xb0 (Inherited: 0x38)
struct UCurveFloat : UCurveBase {
	struct FRichCurve *2d625a83c8; // 0x38(0x70)
	bool *2df1ab8272; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)

	void *f3987cbe77(); // Function Engine.CurveFloat.*f3987cbe77 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x994e08
	void *1bf4f700b6(); // Function Engine.CurveFloat.*1bf4f700b6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac98c
};

// Class Engine.DecalActor
// Size: 0x410 (Inherited: 0x408)
struct ADecalActor : AActor {
	struct UDecalComponent* Decal; // 0x408(0x08)

	void *5ef8202fe7(); // Function Engine.DecalActor.*5ef8202fe7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67ac964
	void CreateDynamicMaterialInstance(); // Function Engine.DecalActor.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x5a0b288
	void *e5a6406b5b(); // Function Engine.DecalActor.*e5a6406b5b // Final|Native|Public|BlueprintCallable // @ game+0x67bf2d0
};

// Class Engine.DestructibleActor
// Size: 0x428 (Inherited: 0x408)
struct ADestructibleActor : AActor {
	struct UDestructibleComponent* DestructibleComponent; // 0x408(0x08)
	char bAffectNavigation : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct FMulticastDelegate OnActorFracture; // 0x418(0x10)
};

// Class Engine.DistanceFieldCapture
// Size: 0x410 (Inherited: 0x408)
struct ADistanceFieldCapture : AActor {
	struct U*8aed76bbf2* CaptureComponent; // 0x408(0x08)
};

// Class Engine.DocumentationActor
// Size: 0x410 (Inherited: 0x408)
struct ADocumentationActor : AActor {
	char pad_408[0x8]; // 0x408(0x08)
};

// Class Engine.Emitter
// Size: 0x458 (Inherited: 0x408)
struct AEmitter : AActor {
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x408(0x08)
	char *9139d37487 : 1; // 0x410(0x01)
	char bPostUpdateTickGroup : 1; // 0x410(0x01)
	char *1ba7876da8 : 1; // 0x410(0x01)
	char pad_410_3 : 5; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct FMulticastDelegate OnParticleSpawn; // 0x418(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x428(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0x438(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0x448(0x10)

	void *b6de83bb83(); // Function Engine.Emitter.*b6de83bb83 // Final|Native|Public|BlueprintCallable // @ game+0x67c440c
	void *9b5dcbfbeb(); // Function Engine.Emitter.*9b5dcbfbeb // Native|Public|BlueprintCallable // @ game+0x5aa2b20
	void OnRep_bCurrentlyActive(); // Function Engine.Emitter.OnRep_bCurrentlyActive // Native|Public // @ game+0x5fc3d0
	void Activate(); // Function Engine.Emitter.Activate // Final|Native|Public|BlueprintCallable // @ game+0x67a1550
	void OnParticleSystemFinished(); // Function Engine.Emitter.OnParticleSystemFinished // Native|Public // @ game+0x59c21e0
	void *3ed14454d9(); // Function Engine.Emitter.*3ed14454d9 // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67c2c90
	void *3e55e7d95c(); // Function Engine.Emitter.*3e55e7d95c // Final|Native|Public|BlueprintCallable // @ game+0x67c0c90
	void *9252cbf5cf(); // Function Engine.Emitter.*9252cbf5cf // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x67bec5c
	void Deactivate(); // Function Engine.Emitter.Deactivate // Final|Native|Public|BlueprintCallable // @ game+0x67a7ae0
	void *1978396d1f(); // Function Engine.Emitter.*1978396d1f // Final|Native|Public|BlueprintCallable // @ game+0x67bc8b8
	void SetFloatParameter(); // Function Engine.Emitter.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x67bf6cc
	void IsActive(); // Function Engine.Emitter.IsActive // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x67b1280
};

// Class Engine.EmitterCameraLensEffectBase
// Size: 0x4c0 (Inherited: 0x458)
struct AEmitterCameraLensEffectBase : AEmitter {
	struct UParticleSystem* *b70d2a0387; // 0x458(0x08)
	struct UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x460(0x08)
	struct APlayerCameraManager* *26b4993c40; // 0x468(0x08)
	struct FTransform RelativeTransform; // 0x470(0x30)
	float *5d0f61c14f; // 0x4a0(0x04)
	char *5d42685f42 : 1; // 0x4a4(0x01)
	char *15ffb9a242 : 1; // 0x4a4(0x01)
	char pad_4A4_2 : 6; // 0x4a4(0x01)
	char pad_4A5[0x3]; // 0x4a5(0x03)
	struct TArray<struct UClass*> *b15eb3abf8; // 0x4a8(0x10)
	float DistFromCamera; // 0x4b8(0x04)
	char pad_4BC[0x4]; // 0x4bc(0x04)
};

// Class Engine.FoliageBlockingVolumeActor
// Size: 0x410 (Inherited: 0x408)
struct AFoliageBlockingVolumeActor : AActor {
	struct U*1ee70631d9* FoliageBlockingVolumeComponent; // 0x408(0x08)
};

// Class Engine.DebugCameraHUD
// Size: 0x4f0 (Inherited: 0x4f0)
struct ADebugCameraHUD : AHUD {
};

// Class Engine.AtmosphericFog
// Size: 0x410 (Inherited: 0x408)
struct AAtmosphericFog : AInfo {
	struct UAtmosphericFogComponent* AtmosphericFogComponent; // 0x408(0x08)
};

// Class Engine.ExponentialHeightFog
// Size: 0x418 (Inherited: 0x408)
struct AExponentialHeightFog : AInfo {
	struct UExponentialHeightFogComponent* Component; // 0x408(0x08)
	char bEnabled : 1; // 0x410(0x01)
	char pad_410_1 : 7; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)

	void OnRep_bEnabled(); // Function Engine.ExponentialHeightFog.OnRep_bEnabled // Native|Public // @ game+0xdb4c0c
};

// Class Engine.GameNetworkManager
// Size: 0x490 (Inherited: 0x408)
struct AGameNetworkManager : AInfo {
	int32 *f74a0bfe74; // 0x408(0x04)
	float *c5440b9f3d; // 0x40c(0x04)
	int32 TotalNetBandwidth; // 0x410(0x04)
	int32 MinDynamicBandwidth; // 0x414(0x04)
	int32 MaxDynamicBandwidth; // 0x418(0x04)
	char bIsStandbyCheckingEnabled : 1; // 0x41c(0x01)
	char *734f9b33bb : 1; // 0x41c(0x01)
	char pad_41C_2 : 6; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	float StandbyRxCheatTime; // 0x420(0x04)
	float StandbyTxCheatTime; // 0x424(0x04)
	int32 BadPingThreshold; // 0x428(0x04)
	float PercentMissingForRxStandby; // 0x42c(0x04)
	float PercentMissingForTxStandby; // 0x430(0x04)
	float PercentForBadPing; // 0x434(0x04)
	float JoinInProgressStandbyWaitTime; // 0x438(0x04)
	float MoveRepSize; // 0x43c(0x04)
	float MAXPOSITIONERRORSQUARED; // 0x440(0x04)
	float MAXNEARZEROVELOCITYSQUARED; // 0x444(0x04)
	float CLIENTADJUSTUPDATECOST; // 0x448(0x04)
	float MAXCLIENTUPDATEINTERVAL; // 0x44c(0x04)
	float MaxMoveDeltaTime; // 0x450(0x04)
	float ClientNetSendMoveDeltaTime; // 0x454(0x04)
	float ClientNetSendMoveDeltaTimeThrottled; // 0x458(0x04)
	int32 ClientNetSendMoveThrottleAtNetSpeed; // 0x45c(0x04)
	int32 ClientNetSendMoveThrottleOverPlayerCount; // 0x460(0x04)
	bool ClientAuthorativePosition; // 0x464(0x01)
	char pad_465[0x3]; // 0x465(0x03)
	float ClientErrorUpdateRateLimit; // 0x468(0x04)
	bool bMovementTimeDiscrepancyDetection; // 0x46c(0x01)
	bool bMovementTimeDiscrepancyResolution; // 0x46d(0x01)
	char pad_46E[0x2]; // 0x46e(0x02)
	float MovementTimeDiscrepancyResolutionMinFPS; // 0x470(0x04)
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x474(0x04)
	float MovementTimeDiscrepancyMinTimeMargin; // 0x478(0x04)
	float MovementTimeDiscrepancyResolutionRate; // 0x47c(0x04)
	float MovementTimeDiscrepancyDriftAllowance; // 0x480(0x04)
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x484(0x01)
	bool bUseDistanceBasedRelevancy; // 0x485(0x01)
