// BlueprintGeneratedClass TslCaptureLobby.TslCaptureLobby_C
// Size: 0x496 (Inherited: 0x410)
struct ATslCaptureLobby_C : ALevelScriptActor {
	struct F*73a77c28fa UberGraphFrame; // 0x410(0x08)
	struct ALobbyViewMode_C* ViewModeStudio; // 0x418(0x08)
	struct ATslWeapon* TslWeapon; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
	struct FTransform UiCameraTM; // 0x430(0x30)
	struct FTransform ViewModeTM; // 0x460(0x30)
	bool bLeft; // 0x490(0x01)
	bool bright; // 0x491(0x01)
	bool bUp; // 0x492(0x01)
	bool bDown; // 0x493(0x01)
	bool AddView; // 0x494(0x01)
	bool MinusView; // 0x495(0x01)

	struct FKey InpActEvt_Backslash_*081c3f41d2_26(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Backslash_*081c3f41d2_26 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Left_*081c3f41d2_25(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*081c3f41d2_25 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Left_*081c3f41d2_24(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Left_*081c3f41d2_24 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Right_*081c3f41d2_23(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*081c3f41d2_23 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Right_*081c3f41d2_22(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Right_*081c3f41d2_22 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Up_*081c3f41d2_21(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*081c3f41d2_21 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Up_*081c3f41d2_20(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Up_*081c3f41d2_20 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Down_*081c3f41d2_19(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*081c3f41d2_19 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_Down_*081c3f41d2_18(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_Down_*081c3f41d2_18 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_LeftBracket_*081c3f41d2_17(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*081c3f41d2_17 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_LeftBracket_*081c3f41d2_16(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_LeftBracket_*081c3f41d2_16 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_RightBracket_*081c3f41d2_15(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*081c3f41d2_15 // BlueprintEvent // @ game+0x22ddc4
	struct FKey InpActEvt_RightBracket_*081c3f41d2_14(); // Function TslCaptureLobby.TslCaptureLobby_C.InpActEvt_RightBracket_*081c3f41d2_14 // BlueprintEvent // @ game+0x22ddc4
	float ReceiveTick(); // Function TslCaptureLobby.TslCaptureLobby_C.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x22ddc4
	float ExecuteUbergraph_TslCaptureLobby(); // Function TslCaptureLobby.TslCaptureLobby_C.ExecuteUbergraph_TslCaptureLobby // HasDefaults // @ game+0x22ddc4
};

