// Class TslGame.AbstractRespawnProcessor
// Size: 0x490 (Inherited: 0x408)
struct AAbstractRespawnProcessor : AActor {
	float *af1e34aab2; // 0x408(0x04)
	float *c94eeccead; // 0x40c(0x04)
	bool *d4d903dfd3; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct TArray<struct UClass*> *97e61c3a1c; // 0x418(0x10)
	struct FMulticastDelegate OnRespawnStarted; // 0x428(0x10)
	struct FMulticastDelegate OnRespawnEnded; // 0x438(0x10)
	struct FMulticastDelegate OnRespawned; // 0x448(0x10)
	struct FMulticastDelegate OnCharacterDead; // 0x458(0x10)
	struct FMulticastDelegate OnRespawnedByRound; // 0x468(0x10)
	struct TArray<struct F*9f4e2ae220> *5fac409a71; // 0x478(0x10)
	char pad_488[0x8]; // 0x488(0x08)

	void *11e921e673(); // Function TslGame.AbstractRespawnProcessor.*11e921e673 // Native|Protected // @ game+0x59a704c
	void OnRoundUpdatedImpl(); // Function TslGame.AbstractRespawnProcessor.OnRoundUpdatedImpl // Native|Protected // @ game+0x59a7144
	void OnCharacterDeadImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharacterDeadImpl // Native|Protected // @ game+0x59a6fb8
	void OnCharactersRespawnedImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharactersRespawnedImpl // Native|Protected // @ game+0x59a712c
};

// Class TslGame.*004af35bc0
// Size: 0x600 (Inherited: 0x3a0)
struct U*004af35bc0 : UAnimInstance {
	struct ATslCharacter* *426d13dabe; // 0x3a0(0x08)
	char pad_3A8[0x8]; // 0x3a8(0x08)
	struct FRotator ParachuteRotation_CP; // 0x3b0(0x0c)
	float ParaTurn_CP; // 0x3bc(0x04)
	float ParaPitch_CP; // 0x3c0(0x04)
	bool bIsReleased_CP; // 0x3c4(0x01)
	bool bIsReplayJumping_CP; // 0x3c5(0x01)
	char pad_3C6[0xa]; // 0x3c6(0x0a)
	struct FTransform IK_L_CP; // 0x3d0(0x30)
	struct FTransform IK_R_CP; // 0x400(0x30)
	struct FVector IK_L_Location_CP; // 0x430(0x0c)
	struct FRotator IK_L_Rotation_CP; // 0x43c(0x0c)
	struct FVector IK_R_Location_CP; // 0x448(0x0c)
	struct FRotator IK_R_Rotation_CP; // 0x454(0x0c)
	float EnableIKAlpha_CP; // 0x460(0x04)
	float RigidbodyAlpha; // 0x464(0x04)
	float PhysicsBlendAlpha; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct FTransform IK_L_Handle_CP; // 0x470(0x30)
	struct FTransform IK_R_Handle_CP; // 0x4a0(0x30)
	struct FTransform IK_L_Strap_CP; // 0x4d0(0x30)
	struct FTransform IK_R_Strap_CP; // 0x500(0x30)
	float IK_L_Handle_Alpha_CP; // 0x530(0x04)
	float IK_R_Handle_Alpha_CP; // 0x534(0x04)
	float RollTendency; // 0x538(0x04)
	float PitchTendency; // 0x53c(0x04)
	float TendencyFrame; // 0x540(0x04)
	bool bIsLanding_CP; // 0x544(0x01)
	char pad_545[0x3]; // 0x545(0x03)
	float LandingAlpha_CP; // 0x548(0x04)
	bool bIsMoving_CP; // 0x54c(0x01)
	bool bIsCollapsed_CP; // 0x54d(0x01)
	bool bIsManualCutoff_CP; // 0x54e(0x01)
	bool bIsAutoCutoff_CP; // 0x54f(0x01)
	float ParaAnimTimeFromStart_CP; // 0x550(0x04)
	float ClientRotYawScale; // 0x554(0x04)
	bool bUseNewParachuteAnims; // 0x558(0x01)
	char pad_559[0x7]; // 0x559(0x07)
	struct FName LeftItemBoneName; // 0x560(0x08)
	struct FName RightItemBoneName; // 0x568(0x08)
	struct FName LeftHandleBoneName; // 0x570(0x08)
	struct FName RightHandleBoneName; // 0x578(0x08)
	struct FName LeftStrapBoneName; // 0x580(0x08)
	struct FName RightStrapBoneName; // 0x588(0x08)
	float LandingCheckVelocityScalar; // 0x590(0x04)
	float LandingCheckStartAltitude; // 0x594(0x04)
	float LandingCheckTickTime; // 0x598(0x04)
	struct FVector TerminalVelocity_CP; // 0x59c(0x0c)
	float *9540a8ca08; // 0x5a8(0x04)
	float *d4d71455a0; // 0x5ac(0x04)
	struct FVector *e59d5eafbc; // 0x5b0(0x0c)
	float *a50da47fb0; // 0x5bc(0x04)
	struct TArray<struct FName> *03562175e0; // 0x5c0(0x10)
	bool *7f88d5b1cd; // 0x5d0(0x01)
	char pad_5D1[0x3]; // 0x5d1(0x03)
	struct FVector *3100c9a32c; // 0x5d4(0x0c)
	int32 *7cd6e29d5c; // 0x5e0(0x04)
	char pad_5E4[0x1c]; // 0x5e4(0x1c)

	void *3e43da2b86(); // Function TslGame.*004af35bc0.*3e43da2b86 // Final|Native|Public|BlueprintCallable // @ game+0x59a6f90
	void DetachPara_BP(); // Function TslGame.*004af35bc0.DetachPara_BP // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *fdbb4d5977(); // Function TslGame.*004af35bc0.*fdbb4d5977 // Final|Native|Public|BlueprintCallable // @ game+0x59a6f78
	void *805e6ee791(); // Function TslGame.*004af35bc0.*805e6ee791 // Final|Native|Public|BlueprintCallable // @ game+0x59a6fa4
};

// Class TslGame.*bc4fd88fb0
// Size: 0x318 (Inherited: 0x258)
struct U*bc4fd88fb0 : UUserWidget {
	struct U*63b14265fa* *83cf39dd24; // 0x258(0x08)
	char pad_260[0x48]; // 0x260(0x48)
	struct FMulticastDelegate WidgetDestroyEventDelegate; // 0x2a8(0x10)
	char pad_2B8[0x60]; // 0x2b8(0x60)

	void GetTslGameUserSettings(); // Function TslGame.*bc4fd88fb0.GetTslGameUserSettings // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ebcf8
	void GetDemoPlayerState(); // Function TslGame.*bc4fd88fb0.GetDemoPlayerState // Final|Native|Public|BlueprintCallable // @ game+0x59e92a0
	void ListenForInputAxis(); // Function TslGame.*bc4fd88fb0.ListenForInputAxis // Final|Native|Public|BlueprintCallable // @ game+0x59ef688
	void StopListeningForAllInputAxises(); // Function TslGame.*bc4fd88fb0.StopListeningForAllInputAxises // Final|Native|Public|BlueprintCallable // @ game+0x59f6288
	void SetupInputForBlueprint(); // Function TslGame.*bc4fd88fb0.SetupInputForBlueprint // Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void GetAxisMultiplier(); // Function TslGame.*bc4fd88fb0.GetAxisMultiplier // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e8630
	void IsInLobby(); // Function TslGame.*bc4fd88fb0.IsInLobby // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ed920
	void ContainOwnerUserFocus(); // Function TslGame.*bc4fd88fb0.ContainOwnerUserFocus // Final|Native|Public|BlueprintCallable // @ game+0x59e66d4
	void TransferUserFocusThroughReply(); // Function TslGame.*bc4fd88fb0.TransferUserFocusThroughReply // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0x59f6ac4
	void GetCachedGameState(); // Function TslGame.*bc4fd88fb0.GetCachedGameState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e88e0
	void ContainUserFocus(); // Function TslGame.*bc4fd88fb0.ContainUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x59e6710
	void NavigateUserFocus(); // Function TslGame.*bc4fd88fb0.NavigateUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x59efef8
	void IsParticipatedInRedeploy(); // Function TslGame.*bc4fd88fb0.IsParticipatedInRedeploy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ee3b0
	void *81bace3d37(); // Function TslGame.*bc4fd88fb0.*81bace3d37 // Final|Native|Private // @ game+0x59f0f3c
	void IsReplaying(); // Function TslGame.*bc4fd88fb0.IsReplaying // Final|Native|Public|BlueprintCallable // @ game+0x59ee59c
	void IsObserving(); // Function TslGame.*bc4fd88fb0.IsObserving // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ee304
	void ClearUserFocus(); // Function TslGame.*bc4fd88fb0.ClearUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x59e56bc
	void *50f9009c25(); // Function TslGame.*bc4fd88fb0.*50f9009c25 // Final|Native|Public // @ game+0x59f629c
	void GetCachedCharacter(); // Function TslGame.*bc4fd88fb0.GetCachedCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e88bc
	void IsSpectating(); // Function TslGame.*bc4fd88fb0.IsSpectating // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59eea80
	void GetCachedViewTargetTslCharacter(); // Function TslGame.*bc4fd88fb0.GetCachedViewTargetTslCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e8904
	void GetRawKeyValue(); // Function TslGame.*bc4fd88fb0.GetRawKeyValue // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x59ead9c
	void TslUserWidgetDestroyEvent__DelegateSignature(); // DelegateFunction TslGame.*bc4fd88fb0.TslUserWidgetDestroyEvent__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x22ddc4
};

// Class TslGame.*17234a7c9b
// Size: 0x418 (Inherited: 0x318)
struct U*17234a7c9b : U*bc4fd88fb0 {
	char pad_318[0x10]; // 0x318(0x10)
	char bUseEmergingAnimation : 1; // 0x328(0x01)
	char bUseVanishingAnimation : 1; // 0x328(0x01)
	char pad_328_2 : 6; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct F*e9e2558d2e EmergingAnimationBinder; // 0x330(0x20)
	struct F*e9e2558d2e VanishingAnimationBinder; // 0x350(0x20)
	struct U*6b11b3bf02* Emerging; // 0x370(0x08)
	struct U*6b11b3bf02* Vanishing; // 0x378(0x08)
	char pad_380[0x18]; // 0x380(0x18)
	enum class ESlateVisibility *0d5cd6f4af; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	float *c0604b00ca; // 0x39c(0x04)
	char pad_3A0[0x4]; // 0x3a0(0x04)
	int32 phase; // 0x3a4(0x04)
	int32 *89f3008bea; // 0x3a8(0x04)
	bool bUseFakeCursor; // 0x3ac(0x01)
	char pad_3AD[0x3]; // 0x3ad(0x03)
	struct F*f23e4e6c9e *883997f6a4; // 0x3b0(0x28)
	struct F*7f3debddd2 *f433842f00; // 0x3d8(0x20)
	struct TArray<struct F*b5b756ee54> *03d2cd4ca2; // 0x3f8(0x10)
	struct TArray<struct F*ed4ff83a65> *5f69c4e87d; // 0x408(0x10)

	void OnFakeCursorDown(); // Function TslGame.*17234a7c9b.OnFakeCursorDown // Native|Protected // @ game+0x59f021c
	void OnFakeCursorX(); // Function TslGame.*17234a7c9b.OnFakeCursorX // Native|Protected // @ game+0x59f024c
	void CheckWantRequestRender(); // Function TslGame.*17234a7c9b.CheckWantRequestRender // Native|Public|BlueprintCallable|BlueprintPure // @ game+0x59b662c
	void HandleMainPrepass(); // Function TslGame.*17234a7c9b.HandleMainPrepass // Native|Public // @ game+0x1ccb50
	void IsMouseOn(); // Function TslGame.*17234a7c9b.IsMouseOn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ee238
	void BindFakeCursor(); // Function TslGame.*17234a7c9b.BindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x59e4f64
	void SetFakeMouseMouseButtonUp(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonUp // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x59f48e0
	void UnBindFakeCursor(); // Function TslGame.*17234a7c9b.UnBindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x59f6cf8
	void RuntimeInitBP(); // Function TslGame.*17234a7c9b.RuntimeInitBP // BlueprintCosmetic|Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*17234a7c9b.SetFakeMouseMouseButtonDown // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x59f4838
	void OnFakeCursorY(); // Function TslGame.*17234a7c9b.OnFakeCursorY // Native|Protected // @ game+0x59f02e8
	void OnFakeCursorUp(); // Function TslGame.*17234a7c9b.OnFakeCursorUp // Native|Protected // @ game+0x59f0234
};

// Class TslGame.*f04b1d14fe
// Size: 0xab0 (Inherited: 0x418)
struct U*f04b1d14fe : U*17234a7c9b {
	char pad_418[0x30]; // 0x418(0x30)
	TScriptInterface<struct U*b015a9bf79> *dcd820f738; // 0x448(0x10)
	TScriptInterface<struct U*f1d1da18cf> SlotContainer; // 0x458(0x10)
	char pad_468[0x98]; // 0x468(0x98)
	struct FLinearColor DefaultSlotNameColor; // 0x500(0x10)
	struct FLinearColor DisabledSlotNameColor; // 0x510(0x10)
	char pad_520[0x50]; // 0x520(0x50)
	struct F*7f3debddd2 *54966ee236; // 0x570(0x20)
	struct F*7f3debddd2 *034a1310af; // 0x590(0x20)
	struct F*d3069d51ff *81e2095010; // 0x5b0(0x28)
	struct F*959656208f *f7985010c8; // 0x5d8(0x30)
	struct F*d3069d51ff *aa62a4afb8; // 0x608(0x28)
	struct F*f4f57b85a2 *b72934a3da; // 0x630(0x20)
	struct F*7f3debddd2 *24e6012fab; // 0x650(0x20)
	struct F*d3069d51ff *dfb6b0f7b4; // 0x670(0x28)
	struct F*d3069d51ff *9e4bb7440e; // 0x698(0x28)
	struct F*7f3debddd2 *e5df2606cc; // 0x6c0(0x20)
	struct F*d3069d51ff *27ba0a2765; // 0x6e0(0x28)
	struct F*d3069d51ff *6d1f81300e; // 0x708(0x28)
	struct F*b9afef7a3a *f90aba9df4; // 0x730(0x28)
	struct F*7f3debddd2 *0581d7d58a; // 0x758(0x20)
	struct F*f4f57b85a2 *2313768b08; // 0x778(0x20)
	struct F*f4f57b85a2 *60f6e78b17; // 0x798(0x20)
	struct F*f4f57b85a2 *85755c2b31; // 0x7b8(0x20)
	struct F*c69f8ed24a *0bcc0e53fe; // 0x7d8(0x28)
	struct F*f4f57b85a2 *e8b40173b4; // 0x800(0x20)
	struct F*959656208f *34f707acab; // 0x820(0x30)
	struct F*d3069d51ff *dcdf84700b; // 0x850(0x28)
	struct F*f4f57b85a2 *dc3e86a87b; // 0x878(0x20)
	struct F*f0cac2bec7 *3d28748427; // 0x898(0x28)
	struct F*f0cac2bec7 *9794e27f71; // 0x8c0(0x28)
	struct F*c69f8ed24a *5e37025815; // 0x8e8(0x28)
	struct F*7f3debddd2 *98c866faba; // 0x910(0x20)
	struct F*d3069d51ff *5970c9cc94; // 0x930(0x28)
	struct F*f4f57b85a2 *03f441c745; // 0x958(0x20)
	struct UClass* *cee67f1608; // 0x978(0x08)
	struct UTexture2D* SelectTexture; // 0x980(0x08)
	struct UTexture2D* FocusTexture; // 0x988(0x08)
	struct UTexture2D* LinkTexture; // 0x990(0x08)
	struct UTexture2D* NormalTexture; // 0x998(0x08)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x9a0(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x9b0(0x10)
	bool *e470b4a9a4; // 0x9c0(0x01)
	bool *85fe333e3e; // 0x9c1(0x01)
	char pad_9C2[0x6]; // 0x9c2(0x06)
	struct UEquipableItem* EquipableItem; // 0x9c8(0x08)
	struct UMaterialInstanceDynamic* *40e4d72841; // 0x9d0(0x08)
	struct UItem* *f1bd59f337; // 0x9d8(0x08)
	struct UMaterialInstanceDynamic* *053798b803; // 0x9e0(0x08)
	struct UProgressBar* CastingProgressBar; // 0x9e8(0x08)
	struct AInventory* *4d0a8351ae; // 0x9f0(0x08)
	struct UCastComponent* *1c6df080ba; // 0x9f8(0x08)
	struct UMaterialInstanceDynamic* *3b66295beb; // 0xa00(0x08)
	struct UMaterialInstanceDynamic* *c4f2663e76; // 0xa08(0x08)
	struct ATslCharacter* TslCharacter; // 0xa10(0x08)
	struct UTexture* Tex; // 0xa18(0x08)
	struct UImage* *e4cb9275e0; // 0xa20(0x08)
	struct U*023cfd3bca* *4d0b7e394f; // 0xa28(0x08)
	struct UItemToolTipWidget* *95442cb857; // 0xa30(0x08)
	struct F*387a87ac65 *01a8a34569; // 0xa38(0x78)

	void DispatchRefreshInnerList(); // Function TslGame.*f04b1d14fe.DispatchRefreshInnerList // Final|Native|Protected // @ game+0x59b8cc0
	void BroadCastSlotEnter(); // Function TslGame.*f04b1d14fe.BroadCastSlotEnter // Final|Native|Protected // @ game+0x59b609c
	void OnChangedStackCount(); // Function TslGame.*f04b1d14fe.OnChangedStackCount // Final|Native|Protected // @ game+0x59bda40
	void BroadCastSlotFocus(); // Function TslGame.*f04b1d14fe.BroadCastSlotFocus // Final|Native|Protected // @ game+0x59b61f4
	void BroadCastSlotLeave(); // Function TslGame.*f04b1d14fe.BroadCastSlotLeave // Final|Native|Protected // @ game+0x59b6368
};

// Class TslGame.*1a5524e277
// Size: 0xab8 (Inherited: 0xab0)
struct U*1a5524e277 : U*f04b1d14fe {
	struct U*0607ea6463* RadioMessage; // 0xab0(0x08)
};

// Class TslGame.*3ceeab2126
// Size: 0xb20 (Inherited: 0xab0)
struct U*3ceeab2126 : U*f04b1d14fe {
	struct U*7f757909f6* UserNickNamePlatformImageWidget; // 0xab0(0x08)
	struct F*8e32972a91 *7a895a250c; // 0xab8(0x28)
	float *af9144ad82; // 0xae0(0x04)
	float *9869b68a1f; // 0xae4(0x04)
	float *f9b2e1f191; // 0xae8(0x04)
	char pad_AEC[0x2c]; // 0xaec(0x2c)
	struct UProgressBar* Pgb_Durability; // 0xb18(0x08)

	void OnInputAReleased(); // Function TslGame.*3ceeab2126.OnInputAReleased // Final|Native|Protected // @ game+0x59befa0
	void OnInputLThumbPressed(); // Function TslGame.*3ceeab2126.OnInputLThumbPressed // Final|Native|Protected // @ game+0x59befc8
	void OnInputXReleased(); // Function TslGame.*3ceeab2126.OnInputXReleased // Final|Native|Protected // @ game+0x59bf028
	void OnInputLThumbReleased(); // Function TslGame.*3ceeab2126.OnInputLThumbReleased // Final|Native|Protected // @ game+0x59befdc
	void FocusState(); // Function TslGame.*3ceeab2126.FocusState // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void OnInputYPressed(); // Function TslGame.*3ceeab2126.OnInputYPressed // Final|Native|Protected // @ game+0x59bf03c
	void OnInputYReleased(); // Function TslGame.*3ceeab2126.OnInputYReleased // Final|Native|Protected // @ game+0x59bf050
	void NormalState(); // Function TslGame.*3ceeab2126.NormalState // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void SelfputState(); // Function TslGame.*3ceeab2126.SelfputState // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *081acfbf64(); // Function TslGame.*3ceeab2126.*081acfbf64 // Final|Native|Protected // @ game+0x59beff4
	void OnInputXPressed(); // Function TslGame.*3ceeab2126.OnInputXPressed // Final|Native|Protected // @ game+0x59bf014
	void OnInputAPressed(); // Function TslGame.*3ceeab2126.OnInputAPressed // Final|Native|Protected // @ game+0x59bef8c
	void LinkState(); // Function TslGame.*3ceeab2126.LinkState // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void OnInputBPressed(); // Function TslGame.*3ceeab2126.OnInputBPressed // Final|Native|Protected // @ game+0x59befb4
};

// Class TslGame.*60cae070bc
// Size: 0xb18 (Inherited: 0xab8)
struct U*60cae070bc : U*1a5524e277 {
	struct UBorder* HoverBorder; // 0xab8(0x08)
	struct UWidget* CapacityLayer; // 0xac0(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xac8(0x08)
	struct UTextBlock* MaxCapacityText; // 0xad0(0x08)
	struct FLinearColor TrunkDragEnterColor; // 0xad8(0x10)
	struct FLinearColor TrunkDragLeaveColor; // 0xae8(0x10)
	struct FLinearColor TrunkEmptyTextColor; // 0xaf8(0x10)
	struct UTexture2D* emptytexture; // 0xb08(0x08)
	char pad_B10[0x8]; // 0xb10(0x08)
};

// Class TslGame.*7960d7ce69
// Size: 0xb60 (Inherited: 0xb20)
struct U*7960d7ce69 : U*3ceeab2126 {
	struct UVerticalBox* CategoryAndCapacityBox; // 0xb20(0x08)
	struct UImage* Img_IconBg; // 0xb28(0x08)
	struct UGridPanel* IconGrp; // 0xb30(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xb38(0x08)
	struct UTextBlock* MaxCapacityText; // 0xb40(0x08)
	struct FLinearColor TrunkEmptyTextColor; // 0xb48(0x10)
	char pad_B58[0x8]; // 0xb58(0x08)
};

// Class TslGame.*02ed43dafb
// Size: 0x490 (Inherited: 0x418)
struct U*02ed43dafb : U*17234a7c9b {
	struct F*eaae7901d4 KeysPanel_Binder; // 0x418(0x20)
	struct FKey CtrlUnrealKey; // 0x438(0x18)
	struct FKey AltUnrealKey; // 0x450(0x18)
	struct FKey ShiftUnrealKey; // 0x468(0x18)
	struct TArray<struct U*699e83eed1*> *f44a30b4b2; // 0x480(0x10)
};

// Class TslGame.*067391b601
// Size: 0x480 (Inherited: 0x418)
struct U*067391b601 : U*17234a7c9b {
	struct F*f4f57b85a2 DescriptionTextBlock_Binder; // 0x418(0x20)
	struct F*8e32972a91 KeyImageHorizontalBox; // 0x438(0x28)
	struct F*f4f57b85a2 DebugTextBlock_Binder; // 0x460(0x20)
};

// Class TslGame.TslKeyHintContentWidget
// Size: 0x528 (Inherited: 0x418)
struct UTslKeyHintContentWidget : U*17234a7c9b {
	struct UClass* KeyImageWidgetClass; // 0x418(0x08)
	struct FMargin KeyIconPadding; // 0x420(0x10)
	float KeyIconDesiredHeight; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UHorizontalBox* KeyImagePanel; // 0x438(0x08)
	struct UTextBlock* InputModeText; // 0x440(0x08)
	struct U*0399764a34* DisplayNameFlowText; // 0x448(0x08)
	struct TArray<struct U*57d9afb849*> *6a65529fe8; // 0x450(0x10)
	struct F*785b71047d *6aaa469bf1; // 0x460(0xb0)
	char pad_510[0x18]; // 0x510(0x18)
};

// Class TslGame.*55cc1827d6
// Size: 0x560 (Inherited: 0x528)
struct U*55cc1827d6 : UTslKeyHintContentWidget {
	struct UTexture2D* *57473cfd76; // 0x528(0x08)
	struct FText *e3f53d4a78; // 0x530(0x18)
	struct FText *0f61a473be; // 0x548(0x18)
};

// Class TslGame.*099f45a76a
// Size: 0x560 (Inherited: 0x528)
struct U*099f45a76a : UTslKeyHintContentWidget {
	struct FName DummyActionName_Aim; // 0x528(0x08)
	struct FName DummyActionName_ADS; // 0x530(0x08)
	struct FName ActionName_Targeting; // 0x538(0x08)
	struct FName ActionName_Aim; // 0x540(0x08)
	struct FText HoldText; // 0x548(0x18)
};

// Class TslGame.*d6871feba4
// Size: 0x528 (Inherited: 0x528)
struct U*d6871feba4 : UTslKeyHintContentWidget {
};

// Class TslGame.*84ef0ad364
// Size: 0x468 (Inherited: 0x418)
struct U*84ef0ad364 : U*17234a7c9b {
	enum class EKeyHintType KeyHintType; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UClass* *e9152af020; // 0x420(0x08)
	struct F*7f3debddd2 *d86c940fe7; // 0x428(0x20)
	struct F*e9e2558d2e *efefe09fac; // 0x448(0x20)
};

// Class TslGame.*da4c2d1769
// Size: 0x4c0 (Inherited: 0x418)
struct U*da4c2d1769 : U*17234a7c9b {
	struct UDataTable* KeyHintDataTable; // 0x418(0x08)
	struct UDataTable* KeyHintInfoDataTable; // 0x420(0x08)
	struct UDataTable* KeyHintTableCheckerSetDataTable; // 0x428(0x08)
	struct UClass* ContentWidgetClass; // 0x430(0x08)
	struct FMargin KeyHintContentPadding; // 0x438(0x10)
	struct TArray<struct FName> DisabledGameModes; // 0x448(0x10)
	struct UVerticalBox* PanelA; // 0x458(0x08)
	struct UVerticalBox* PanelB; // 0x460(0x08)
	struct UInvalidationBox* InvalidationBox; // 0x468(0x08)
	struct U*6b11b3bf02* AnimationOnChangeHint; // 0x470(0x08)
	struct TArray<struct F*2e5b6fb73f> *2c215b6a79; // 0x478(0x10)
	char pad_488[0x10]; // 0x488(0x10)
	struct TArray<struct UTslKeyHintContentWidget*> *aba4460063; // 0x498(0x10)
	char pad_4A8[0x18]; // 0x4a8(0x18)

	void UpdateSelfPosition(); // Function TslGame.*da4c2d1769.UpdateSelfPosition // Final|Native|Protected // @ game+0xd6f778
	void OnNotifyUpdateKeyHint(); // Function TslGame.*da4c2d1769.OnNotifyUpdateKeyHint // Final|Native|Private // @ game+0xbe5558
	void OnGameUserSettingApplied(); // Function TslGame.*da4c2d1769.OnGameUserSettingApplied // Native|Protected // @ game+0x59bdba8
};

// Class TslGame.*7325c051a5
// Size: 0x4c0 (Inherited: 0x4c0)
struct U*7325c051a5 : U*da4c2d1769 {
};

// Class TslGame.*088ff0e3e3
// Size: 0x4c0 (Inherited: 0x4c0)
struct U*088ff0e3e3 : U*da4c2d1769 {
};

// Class TslGame.*658d907c9b
// Size: 0x440 (Inherited: 0x418)
struct U*658d907c9b : U*17234a7c9b {
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x418(0x08)
	struct USizeBox* KeyHint_SizeBox; // 0x420(0x08)
	float *8a605fe6c0; // 0x428(0x04)
	float *60f40d652e; // 0x42c(0x04)
	float *cbc4c97a32; // 0x430(0x04)
	char pad_434[0xc]; // 0x434(0x0c)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*658d907c9b.UpdatePositionOnMinimapExtended // Final|Native|Protected // @ game+0x59cd930
};

// Class TslGame.*94942e2434
// Size: 0x450 (Inherited: 0x440)
struct U*94942e2434 : U*658d907c9b {
	struct FName ActionName; // 0x440(0x08)
	struct U*1d68794586* KeyImage; // 0x448(0x08)

	void UpdateKeyImage(); // Function TslGame.*94942e2434.UpdateKeyImage // Final|Native|Protected // @ game+0x59cd68c
};

// Class TslGame.*86f8751b28
// Size: 0x498 (Inherited: 0x440)
struct U*86f8751b28 : U*658d907c9b {
	struct UVerticalBox* KeyHint_VerticalBox_Console; // 0x440(0x08)
	struct UVerticalBox* KeyHint_VerticalBox_Pc; // 0x448(0x08)
	struct TArray<struct F*a8a1f174f7> *4f94260d45; // 0x450(0x10)
	struct TArray<struct F*a8a1f174f7> *c7e191d455; // 0x460(0x10)
	char pad_470[0x28]; // 0x470(0x28)
};

// Class TslGame.*c9978a9b7d
// Size: 0x4a8 (Inherited: 0x498)
struct U*c9978a9b7d : U*86f8751b28 {
	char pad_498[0x10]; // 0x498(0x10)
};

// Class TslGame.*abd6301c0e
// Size: 0x450 (Inherited: 0x450)
struct U*abd6301c0e : U*94942e2434 {
};

// Class TslGame.*4a6fbcfe92
// Size: 0x4b8 (Inherited: 0x418)
struct U*4a6fbcfe92 : U*17234a7c9b {
	struct FMulticastDelegate OnKeyReceived; // 0x418(0x10)
	struct FTslInputKey OriginKey; // 0x428(0x20)
	struct FKey FirstDownKey; // 0x448(0x18)
	struct FTslInputKey CurrentDownKey; // 0x460(0x20)
	struct FTslInputKey LastDownedKey; // 0x480(0x20)
	bool bFocused; // 0x4a0(0x01)
	bool bEnableInput; // 0x4a1(0x01)
	bool bIsKeyUp; // 0x4a2(0x01)
	bool bAxisInput; // 0x4a3(0x01)
	float AxisScale; // 0x4a4(0x04)
	struct TArray<struct FKey> MouseButtons; // 0x4a8(0x10)

	void KeyUp(); // Function TslGame.*4a6fbcfe92.KeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x59bb2d8
	void GetLastDownedKeyName(); // Function TslGame.*4a6fbcfe92.GetLastDownedKeyName // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9b38
	void UpdateKeyDown(); // Function TslGame.*4a6fbcfe92.UpdateKeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x59cd5a8
	void UpdateKeyUp(); // Function TslGame.*4a6fbcfe92.UpdateKeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x59cd6a0
	void IsInputKeyDown(); // Function TslGame.*4a6fbcfe92.IsInputKeyDown // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb130
	void KeyDown(); // Function TslGame.*4a6fbcfe92.KeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x59bb1f4
};

// Class TslGame.*699e83eed1
// Size: 0x550 (Inherited: 0x418)
struct U*699e83eed1 : U*17234a7c9b {
	struct FString KeyName; // 0x418(0x10)
	struct FKey MatchingUnrealKey; // 0x428(0x18)
	struct FSlateFontInfo KeyNameFont; // 0x440(0x68)
	enum class EVerticalAlignment KeyNameVerticalAlignment; // 0x4a8(0x01)
	enum class EHorizontalAlignment KeyNameHorizontalAlignment; // 0x4a9(0x01)
	enum class ETextJustify KeyNameJustification; // 0x4aa(0x01)
	char pad_4AB[0x1]; // 0x4ab(0x01)
	float KeyNameWrapTextAt; // 0x4ac(0x04)
	struct FLinearColor NonSelectedBorderColor; // 0x4b0(0x10)
	struct FLinearColor SelectedBorderColor; // 0x4c0(0x10)
	struct FLinearColor NonSelectedTextColor; // 0x4d0(0x10)
	struct FLinearColor SelectedTextColor; // 0x4e0(0x10)
	struct UTexture2D* SelectedKeyBorderImage; // 0x4f0(0x08)
	struct UTexture2D* NonSelectedKeyBorderImage; // 0x4f8(0x08)
	bool bSelected; // 0x500(0x01)
	char pad_501[0x7]; // 0x501(0x07)
	struct F*f4f57b85a2 KeyNameTextBlock_Binder; // 0x508(0x20)
	struct F*d3069d51ff BorderImage_Binder; // 0x528(0x28)

	void SetSelected(); // Function TslGame.*699e83eed1.SetSelected // Final|Native|Public|BlueprintCallable // @ game+0x59cb348
	void IsSelected(); // Function TslGame.*699e83eed1.IsSelected // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb184
};

// Class TslGame.*16c81ca009
// Size: 0x488 (Inherited: 0x418)
struct U*16c81ca009 : U*17234a7c9b {
	struct F*7f3debddd2 *fd4be86453; // 0x418(0x20)
	struct F*7f3debddd2 *e57ddaee5c; // 0x438(0x20)
	struct F*f4f57b85a2 *0065785d88; // 0x458(0x20)
	DelegateProperty PopupButtonEvent; // 0x478(0x10)

	void OnClickedNoButtion(); // Function TslGame.*16c81ca009.OnClickedNoButtion // Final|Native|Private // @ game+0x59bdbd4
	void SetPopupWidget(); // Function TslGame.*16c81ca009.SetPopupWidget // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x59cade8
	void OnClickedYesButton(); // Function TslGame.*16c81ca009.OnClickedYesButton // Final|Native|Private // @ game+0x59bdc3c
};

// Class TslGame.*95503bb60a
// Size: 0x438 (Inherited: 0x418)
struct U*95503bb60a : U*17234a7c9b {
	struct F*e9e2558d2e *992607f2df; // 0x418(0x20)
};

// Class TslGame.*161ca53f4e
// Size: 0x430 (Inherited: 0x418)
struct U*161ca53f4e : U*17234a7c9b {
	float *f7bf85e77d; // 0x418(0x04)
	float *2f7fe07cad; // 0x41c(0x04)
	struct U*e866d9cf11* UI_KillMessageTextBorderWidget; // 0x420(0x08)
	struct U*2287bfd708* UI_KillMessageCounterWidget; // 0x428(0x08)
};

// Class TslGame.*2287bfd708
// Size: 0x4f0 (Inherited: 0x418)
struct U*2287bfd708 : U*17234a7c9b {
	struct UBorder* TeamKillBorder; // 0x418(0x08)
	struct UBorder* KillCounterBorder; // 0x420(0x08)
	struct UBorder* AssistCounterBorder; // 0x428(0x08)
	struct UScaleBox* AssistCounterScaleBox; // 0x430(0x08)
	struct UTextBlock* KillCurrentCount; // 0x438(0x08)
	struct UTextBlock* KillNextCount; // 0x440(0x08)
	struct UTextBlock* AssistCurrentCount; // 0x448(0x08)
	struct UTextBlock* AssistNextCount; // 0x450(0x08)
	struct UWidgetSwitcher* KillTextSwitcher; // 0x458(0x08)
	struct UWidgetSwitcher* AssistTextSwitcher; // 0x460(0x08)
	struct U*6b11b3bf02* KillCountUpEffect; // 0x468(0x08)
	struct U*6b11b3bf02* KillCountUpNoEffect; // 0x470(0x08)
	struct U*6b11b3bf02* AssistCountUp; // 0x478(0x08)
	struct U*6b11b3bf02* KillFadeInEffect; // 0x480(0x08)
	struct U*6b11b3bf02* KillFadeInNoEffect; // 0x488(0x08)
	struct U*6b11b3bf02* KillFadeInEffectWithoutAssistAnim; // 0x490(0x08)
	struct U*6b11b3bf02* KillFadeInNoEffectWithoutAssistAnim; // 0x498(0x08)
	struct U*6b11b3bf02* AssistFadeIn; // 0x4a0(0x08)
	struct U*6b11b3bf02* FadeInit; // 0x4a8(0x08)
	struct U*6b11b3bf02* CountInit; // 0x4b0(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x4b8(0x08)
	float *4a7ae50665; // 0x4c0(0x04)
	struct FVector2D *e7150608ba; // 0x4c4(0x08)
	float *8dc51d1e33; // 0x4cc(0x04)
	struct FVector2D *a66b3eeb91; // 0x4d0(0x08)
	char pad_4D8[0x18]; // 0x4d8(0x18)
};

// Class TslGame.*e882053470
// Size: 0x498 (Inherited: 0x418)
struct U*e882053470 : U*17234a7c9b {
	struct UClass* *27398035fd; // 0x418(0x08)
	struct UClass* *cdab23bdcf; // 0x420(0x08)
	struct F*c233adf9bd *94df7af7e0; // 0x428(0x20)
	struct U*b2c0d49a67* IconOtherKillMessage; // 0x448(0x08)
	struct F*c233adf9bd *cc9f4bb08d; // 0x450(0x20)
	struct U*161ca53f4e* *04a286a806; // 0x470(0x08)
	float *151d5602e1; // 0x478(0x04)
	float *9c1a8b02a9; // 0x47c(0x04)
	struct TArray<struct FDeathMessage> *f481c6f2ff; // 0x480(0x10)
	char pad_490[0x8]; // 0x490(0x08)

	void OnDisplayKilledMessage(); // Function TslGame.*e882053470.OnDisplayKilledMessage // Final|Native|Private|HasOutParms // @ game+0x9266d0
	void PushAssistMessage(); // Function TslGame.*e882053470.PushAssistMessage // Final|Native|Private|HasOutParms // @ game+0x59c4b94
};

// Class TslGame.*b2c0d49a67
// Size: 0x468 (Inherited: 0x418)
struct U*b2c0d49a67 : U*17234a7c9b {
	struct UClass* *43fdb5feba; // 0x418(0x08)
	struct F*f0cac2bec7 *50d4516f31; // 0x420(0x28)
	struct TArray<struct U*f57d00387b*> FreeMessageWidgets; // 0x448(0x10)
	float *35f18330eb; // 0x458(0x04)
	bool *b0ab1e550d; // 0x45c(0x01)
	bool *b27181ddd5; // 0x45d(0x01)
	char pad_45E[0x2]; // 0x45e(0x02)
	float *b4a0280363; // 0x460(0x04)
	int32 *d98c93b142; // 0x464(0x04)

	void SetKillMessageWidgetClass(); // Function TslGame.*b2c0d49a67.SetKillMessageWidgetClass // Final|Native|Public|BlueprintCallable // @ game+0x59ca548
	void OnListSizeLimitChange(); // Function TslGame.*b2c0d49a67.OnListSizeLimitChange // Final|Native|Private // @ game+0x59bf278
	void TrimKillMessageWidgetArrayByNumLimit(); // Function TslGame.*b2c0d49a67.TrimKillMessageWidgetArrayByNumLimit // Final|Native|Public|BlueprintCallable // @ game+0x59ccbf8
	void ReserveMessageWidgetPool(); // Function TslGame.*b2c0d49a67.ReserveMessageWidgetPool // Final|Native|Public|BlueprintCallable // @ game+0x59c4fac
	void EnqueueDeathMessage(); // Function TslGame.*b2c0d49a67.EnqueueDeathMessage // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x59b939c
	void OnVanishFinished(); // Function TslGame.*b2c0d49a67.OnVanishFinished // Final|Native|Public // @ game+0xb7e48c
};

// Class TslGame.*e866d9cf11
// Size: 0x438 (Inherited: 0x418)
struct U*e866d9cf11 : U*17234a7c9b {
	struct UGridPanel* KillMessageGrid; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)
};

// Class TslGame.*bfc64df4bb
// Size: 0x4f0 (Inherited: 0x418)
struct U*bfc64df4bb : U*17234a7c9b {
	struct U*6b11b3bf02* FadeInAnim; // 0x418(0x08)
	struct U*6b11b3bf02* Transition1to2; // 0x420(0x08)
	struct U*6b11b3bf02* Transition2to3; // 0x428(0x08)
	struct U*6b11b3bf02* Transition3to4; // 0x430(0x08)
	struct U*6b11b3bf02* Transition4to5; // 0x438(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x440(0x08)
	struct U*6b11b3bf02* InitAnim; // 0x448(0x08)
	struct U*7f757909f6* Player1Platform; // 0x450(0x08)
	struct UTslRichTextBlock* KillMsgBlock; // 0x458(0x08)
	struct U*7f757909f6* Player2Platform; // 0x460(0x08)
	struct UTslRichTextBlock* KillMsgBlock2; // 0x468(0x08)
	struct TMap<struct FName, struct FLinearColor> *9ae4db0c1e; // 0x470(0x50)
	char pad_4C0[0x30]; // 0x4c0(0x30)
};

// Class TslGame.*f57d00387b
// Size: 0x510 (Inherited: 0x418)
struct U*f57d00387b : U*17234a7c9b {
	struct FMulticastDelegate OnVanishFinished; // 0x418(0x10)
	struct TArray<struct F*1e851ff36a> *bad8f23d4d; // 0x428(0x10)
	struct TArray<struct F*170e1e642f> *78def6b55a; // 0x438(0x10)
	struct TArray<struct UTexture*> WeaponMasteryLevelIcons; // 0x448(0x10)
	struct F*c233adf9bd *9c51b14096; // 0x458(0x20)
	struct F*c233adf9bd *2f64c350e7; // 0x478(0x20)
	struct USizeBox* KillMessageSizebox; // 0x498(0x08)
	struct FText PlayZoneText; // 0x4a0(0x18)
	struct FText RedZoneText; // 0x4b8(0x18)
	struct FText *c37e91c149; // 0x4d0(0x18)
	struct FText *d90021170c; // 0x4e8(0x18)
	char pad_500[0x10]; // 0x500(0x10)

	void *2036515fcf(); // Function TslGame.*f57d00387b.*2036515fcf // Final|Native|Protected // @ game+0x59bff44
	void GetTextureFromConditionOfDeathCategory(); // Function TslGame.*f57d00387b.GetTextureFromConditionOfDeathCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5abe5b4
	void SetFontStyleAndSize(); // Function TslGame.*f57d00387b.SetFontStyleAndSize // Final|Native|Protected // @ game+0x5aca358
	void GetTextureFromDamageTypeCategory(); // Function TslGame.*f57d00387b.GetTextureFromDamageTypeCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5abe894
	void SetVanishTimer(); // Function TslGame.*f57d00387b.SetVanishTimer // Final|Native|Public // @ game+0x5acb620
	void *e178e6ac76(); // Function TslGame.*f57d00387b.*e178e6ac76 // Final|Native|Protected // @ game+0x5accb6c
};

// Class TslGame.*87890c32a2
// Size: 0x630 (Inherited: 0x510)
struct U*87890c32a2 : U*f57d00387b {
	struct FLinearColor NormalColor; // 0x510(0x10)
	struct FLinearColor *cdce2918c8; // 0x520(0x10)
	struct FLinearColor *0dd0ad744e; // 0x530(0x10)
	struct FLinearColor *484e917162; // 0x540(0x10)
	struct FLinearColor *8b5d985e37; // 0x550(0x10)
	struct FLinearColor *4005a71970; // 0x560(0x10)
	float *fd2b792e6a; // 0x570(0x04)
	char pad_574[0x4]; // 0x574(0x04)
	struct F*1e851ff36a *1da571a641; // 0x578(0x20)
	struct UWidgetSwitcher* BgSwitcher; // 0x598(0x08)
	struct UImage* SkinBgLeft; // 0x5a0(0x08)
	struct UImage* SkinBgRight; // 0x5a8(0x08)
	struct UTextBlock* KillerNameText; // 0x5b0(0x08)
	struct UTextBlock* VictimNameText; // 0x5b8(0x08)
	struct UImage* CauserImage; // 0x5c0(0x08)
	struct USizeBox* CauserSizeBox; // 0x5c8(0x08)
	struct UImage* WeaponMasteryImage; // 0x5d0(0x08)
	struct USizeBox* WeaponMasterySizeBox; // 0x5d8(0x08)
	struct UImage* HeadShotImage; // 0x5e0(0x08)
	struct USizeBox* HeadShotSizeBox; // 0x5e8(0x08)
	struct UImage* ConditionImage; // 0x5f0(0x08)
	struct USizeBox* ConditionSizeBox; // 0x5f8(0x08)
	struct UImage* SkinBgTint; // 0x600(0x08)
	struct TArray<struct UImage*> EffectImages; // 0x608(0x10)
	struct UImage* AdditionalEffect; // 0x618(0x08)
	struct U*f729112f02* KillerIcon; // 0x620(0x08)
	struct U*f729112f02* VictimIcon; // 0x628(0x08)

	void SetMessageColorAndOpacity(); // Function TslGame.*87890c32a2.SetMessageColorAndOpacity // Final|Native|Protected|HasDefaults // @ game+0x59ca9b4
	void *da7ea4b2db(); // Function TslGame.*87890c32a2.*da7ea4b2db // Final|Native|Protected // @ game+0x59ba748
	void SetLayoutTo(); // Function TslGame.*87890c32a2.SetLayoutTo // Final|Native|Protected // @ game+0x59ca7f4
};

// Class TslGame.*8afb294a12
// Size: 0x890 (Inherited: 0x510)
struct U*8afb294a12 : U*f57d00387b {
	struct UTexture* *d48213a5b0; // 0x510(0x08)
	struct UTexture* *0cd2f8496f; // 0x518(0x08)
	struct UTexture* *43b9bf3c44; // 0x520(0x08)
	struct UTexture* *12a8044854; // 0x528(0x08)
	struct FLinearColor *c0bb4a1a53; // 0x530(0x10)
	struct FLinearColor *efdec8e772; // 0x540(0x10)
	struct F*f4f57b85a2 *8aae7e4db6; // 0x550(0x20)
	struct F*f4f57b85a2 *692faf50fc; // 0x570(0x20)
	struct F*f4f57b85a2 *4c609f7329; // 0x590(0x20)
	struct F*f4f57b85a2 *b3d02cc541; // 0x5b0(0x20)
	struct F*f4f57b85a2 *c28c5e268f; // 0x5d0(0x20)
	struct F*f4f57b85a2 *a0a3aa04f3; // 0x5f0(0x20)
	struct F*b9afef7a3a *0608bef893; // 0x610(0x28)
	struct F*d3069d51ff *d8db1a1e8f; // 0x638(0x28)
	struct F*d3069d51ff *b43eac62e1; // 0x660(0x28)
	struct F*d3069d51ff *0f1c591728; // 0x688(0x28)
	struct F*b9afef7a3a *db671e018e; // 0x6b0(0x28)
	struct F*d3069d51ff *653a69a6e1; // 0x6d8(0x28)
	struct F*d3069d51ff *6cd42188a7; // 0x700(0x28)
	struct F*d3069d51ff *2b38da6c8b; // 0x728(0x28)
	struct F*d3069d51ff *cf1e068612; // 0x750(0x28)
	struct F*c69f8ed24a *eb81d0366a; // 0x778(0x28)
	struct F*c69f8ed24a *673c1a1adb; // 0x7a0(0x28)
	struct F*c69f8ed24a *c48df79bf4; // 0x7c8(0x28)
	struct F*d3069d51ff *9bd291eea1; // 0x7f0(0x28)
	struct F*959656208f *8b890b652c; // 0x818(0x30)
	struct F*8e32972a91 *3ef4bd5361; // 0x848(0x28)
	struct F*e9e2558d2e *30d5b8059f; // 0x870(0x20)

	void SetVictimMessageColorAndOpacity(); // Function TslGame.*8afb294a12.SetVictimMessageColorAndOpacity // Final|Native|Private|HasDefaults // @ game+0x59cba00
	void *fc1ffdf68a(); // Function TslGame.*8afb294a12.*fc1ffdf68a // Final|Native|Private // @ game+0x59ba328
	void SetLayoutTo(); // Function TslGame.*8afb294a12.SetLayoutTo // Final|Native|Private // @ game+0x59ca888
};

// Class TslGame.*6c98a404e3
// Size: 0x490 (Inherited: 0x418)
struct U*6c98a404e3 : U*17234a7c9b {
	struct TMap<enum class ELoadingScreenType, struct UTexture2D*> DefaultBackgroundsByType; // 0x418(0x50)
	struct UDataTable* LoadingScreenImageDataTable; // 0x468(0x08)
	struct UTexture2D* *355e051280; // 0x470(0x20)

	void OnUpdate(); // Function TslGame.*6c98a404e3.OnUpdate // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*fae9ecea58
// Size: 0x428 (Inherited: 0x418)
struct U*fae9ecea58 : U*17234a7c9b {
	struct USizeBox* LoadingSpinnerSizeBox; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void ShowSpinner(); // Function TslGame.*fae9ecea58.ShowSpinner // Final|Native|Protected // @ game+0x59cc108
};

// Class TslGame.*0c3942b94c
// Size: 0x460 (Inherited: 0x418)
struct U*0c3942b94c : U*17234a7c9b {
	struct UClass* LobbyNameNameTagWidgetClass; // 0x418(0x08)
	struct F*f23e4e6c9e *0ea70e2b09; // 0x420(0x28)
	bool bUseNameTagOffsetTranslations; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
	struct TArray<struct FVector> NameTagOffsetTranslations; // 0x450(0x10)

	void UpdateNameTagWidget_Internal(); // Function TslGame.*0c3942b94c.UpdateNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x59cd7ac
	void GetNameTagWidget_Internal(); // Function TslGame.*0c3942b94c.GetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x59b9d44
	void SetNameTagWidget_Internal(); // Function TslGame.*0c3942b94c.SetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x59caa60
	void ResetNameTagWidget_Internal(); // Function TslGame.*0c3942b94c.ResetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x59c51ec
};

// Class TslGame.*535e5949ee
// Size: 0x4c8 (Inherited: 0x418)
struct U*535e5949ee : U*17234a7c9b {
	struct UTextBlock* NickNameText; // 0x418(0x08)
	struct U*7f757909f6* UserPlatformImageWidget; // 0x420(0x08)
	struct U*d6fbd75522* RankEmblemWidget; // 0x428(0x08)
	struct UWidgetSwitcher* VoiceSwitcher; // 0x430(0x08)
	struct USizeBox* VoiceSizeBox; // 0x438(0x08)
	struct USizeBox* HostSizeBox; // 0x440(0x08)
	struct USizeBox* SizeBoxForStatus; // 0x448(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x450(0x08)
	struct USizeBox* SizeBoxForMiddle; // 0x458(0x08)
	struct U*aa6e1909ad* Clanplate; // 0x460(0x08)
	bool *89aa0ac919; // 0x468(0x01)
	bool bHideIfAlone; // 0x469(0x01)
	bool bHideStateIconIfAlone; // 0x46a(0x01)
	bool bHideIdleStateIcon; // 0x46b(0x01)
	struct FVector RankNameTagOffsetTranslations; // 0x46c(0x0c)
	char pad_478[0x4]; // 0x478(0x04)
	int32 SlotIndex; // 0x47c(0x04)
	struct FName NameTagSocketName; // 0x480(0x08)
	struct FVector NameTagOffsetTranslation; // 0x488(0x0c)
	bool bIsHost; // 0x494(0x01)
	bool bIsReady; // 0x495(0x01)
	bool bIsSpeaking; // 0x496(0x01)
	bool bIsLogout; // 0x497(0x01)
	struct FString Nickname; // 0x498(0x10)
	struct FString ClanTag; // 0x4a8(0x10)
	struct FString ClanplateId; // 0x4b8(0x10)

	void SetNickNameAndClanTag(); // Function TslGame.*535e5949ee.SetNickNameAndClanTag // Final|Native|Public|BlueprintCallable // @ game+0x59caaf0
	void SetSpeaking(); // Function TslGame.*535e5949ee.SetSpeaking // Final|Native|Private // @ game+0x59cb680
	void OnVoiceChatUpdated(); // Function TslGame.*535e5949ee.OnVoiceChatUpdated // Final|Native|Protected // @ game+0x59c3acc
	void *6ce341e425(); // Function TslGame.*535e5949ee.*6ce341e425 // Final|Native|Private|Const // @ game+0x59bb004
	void UpdateWidgetSwitchers(); // Function TslGame.*535e5949ee.UpdateWidgetSwitchers // Final|Native|Public|BlueprintCallable // @ game+0x59ce26c
	void SetRankEmblem(); // Function TslGame.*535e5949ee.SetRankEmblem // Final|Native|Private // @ game+0x59cb100
	void SetReady(); // Function TslGame.*535e5949ee.SetReady // Final|Native|Private // @ game+0xcdf690
	void SetOffsetTranslation(); // Function TslGame.*535e5949ee.SetOffsetTranslation // Final|Native|Public|HasOutParms|HasDefaults // @ game+0x59cacb0
	void UpdateNickNameAndClanName(); // Function TslGame.*535e5949ee.UpdateNickNameAndClanName // Final|Native|Public|BlueprintCallable // @ game+0x59cd83c
	void OnParticipantMuteChanged(); // Function TslGame.*535e5949ee.OnParticipantMuteChanged // Final|Native|Protected // @ game+0x59c0a3c
	void UpdateWidgetsVisibilities(); // Function TslGame.*535e5949ee.UpdateWidgetsVisibilities // Final|Native|Public|BlueprintCallable // @ game+0x59ce280
	void SetBinding(); // Function TslGame.*535e5949ee.SetBinding // Final|Native|Private // @ game+0x59c9f14
	void OnTeamVoiceChannelLeave(); // Function TslGame.*535e5949ee.OnTeamVoiceChannelLeave // Final|Native|Public // @ game+0x59c2740
	void SetNameTagProps(); // Function TslGame.*535e5949ee.SetNameTagProps // Final|Native|Public // @ game+0x59caa4c
	void InitWidget(); // Function TslGame.*535e5949ee.InitWidget // Final|Native|Public|BlueprintCallable // @ game+0x59baca4
	void SetPlatformIcon(); // Function TslGame.*535e5949ee.SetPlatformIcon // Final|Native|Private // @ game+0x59cad58
	void SetHost(); // Function TslGame.*535e5949ee.SetHost // Final|Native|Private // @ game+0xda48c4
};

// Class TslGame.*c28537c7d6
// Size: 0x428 (Inherited: 0x418)
struct U*c28537c7d6 : U*17234a7c9b {
	struct UImage* ImageTowerBind; // 0x418(0x08)
	enum class ETslMapMarkerTowerState *4ea4e1e26c; // 0x420(0x01)
	bool *5d3dadfdc7; // 0x421(0x01)
	char pad_422[0x6]; // 0x422(0x06)
};

// Class TslGame.*7ef495f1a9
// Size: 0x610 (Inherited: 0x418)
struct U*7ef495f1a9 : U*17234a7c9b {
	struct FSlateColor *1d8f1592be; // 0x418(0x28)
	struct FSlateFontInfo *1eeece612e; // 0x440(0x68)
	struct FSlateColor *9e85eaaefd; // 0x4a8(0x28)
	struct FSlateColor *c7650a4c1c; // 0x4d0(0x28)
	struct FSlateFontInfo *9bad433d4e; // 0x4f8(0x68)
	struct FSlateColor *4ee483cdf2; // 0x560(0x28)
	struct FSlateColor *ae71d3adf2; // 0x588(0x28)
	struct FSlateColor *c352b3140b; // 0x5b0(0x28)
	struct UTextBlock* TimestampTextBlock; // 0x5d8(0x08)
	struct U*7f757909f6* PlatformImageWidget; // 0x5e0(0x08)
	struct UTslRichTextBlock* MessageTextBlock; // 0x5e8(0x08)
	struct U*7f757909f6* PlatformImageWidget2; // 0x5f0(0x08)
	struct UTslRichTextBlock* MessageTextBlock2; // 0x5f8(0x08)
	struct UImage* HighlightImage; // 0x600(0x08)
	struct USizeBox* MatchLogContentSizeBox; // 0x608(0x08)

	void Update(); // Function TslGame.*7ef495f1a9.Update // Final|Native|Public|HasOutParms // @ game+0x59ccea4
};

// Class TslGame.*80a87b9639
// Size: 0x4a8 (Inherited: 0x418)
struct U*80a87b9639 : U*17234a7c9b {
	struct UClass* *4fa7de7070; // 0x418(0x08)
	float *71d3d71b5c; // 0x420(0x04)
	int32 *fd0fea3b99; // 0x424(0x04)
	struct U*f94da2b1a6* TabSelectorWidget; // 0x428(0x08)
	struct UScrollBox* ContentsScrollBox; // 0x430(0x08)
	struct U*f50ba61dee* GamepadScrollGuideKeyIcon; // 0x438(0x08)
	struct UButton* BackButton; // 0x440(0x08)
	struct USpacer* TopSpacer; // 0x448(0x08)
	struct USpacer* BottomSpacer; // 0x450(0x08)
	struct UVerticalBox* LogVerticalBox; // 0x458(0x08)
	struct UTextBlock* NoMatchLogTextBlock; // 0x460(0x08)
	struct TArray<struct FMatchLog> *7f8e8a2497; // 0x468(0x10)
	enum class EMatchLogTab CurrentTab; // 0x478(0x01)
	bool *0db29c7677; // 0x479(0x01)
	bool *6c896b87ae; // 0x47a(0x01)
	char pad_47B[0x5]; // 0x47b(0x05)
	struct TArray<struct U*7ef495f1a9*> *30b44981f1; // 0x480(0x10)
	struct TArray<bool> *ce54efd2e8; // 0x490(0x10)
	float *db37179e5f; // 0x4a0(0x04)
	float *e7859dac0c; // 0x4a4(0x04)

	void HandleScroll(); // Function TslGame.*80a87b9639.HandleScroll // Final|Native|Protected // @ game+0x59baa8c
	void HandleQuickScrollingDown(); // Function TslGame.*80a87b9639.HandleQuickScrollingDown // Final|Native|Protected // @ game+0x59baa3c
	void HandleRotateTabRight(); // Function TslGame.*80a87b9639.HandleRotateTabRight // Final|Native|Protected // @ game+0x59baa78
	void HandleQuickScrollingUp(); // Function TslGame.*80a87b9639.HandleQuickScrollingUp // Final|Native|Protected // @ game+0x59baa50
	void HandleRotateTabLeft(); // Function TslGame.*80a87b9639.HandleRotateTabLeft // Final|Native|Protected // @ game+0x59baa64
	void HandleTabRotated(); // Function TslGame.*80a87b9639.HandleTabRotated // Final|Native|Protected // @ game+0x59bab24
	void HandleNewMatchLogAdded(); // Function TslGame.*80a87b9639.HandleNewMatchLogAdded // Final|Native|Protected // @ game+0x59ba8b4
	void HandleBackButtonClicked(); // Function TslGame.*80a87b9639.HandleBackButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x59ba80c
};

// Class TslGame.*48e392ad61
// Size: 0x470 (Inherited: 0x418)
struct U*48e392ad61 : U*17234a7c9b {
	char pad_418[0x18]; // 0x418(0x18)
	struct F*f4f57b85a2 *36019e73ed; // 0x430(0x20)
	struct F*f4f57b85a2 *7393179105; // 0x450(0x20)
};

// Class TslGame.*5f1937f5a5
// Size: 0x548 (Inherited: 0x418)
struct U*5f1937f5a5 : U*17234a7c9b {
	struct UClass* PlayerInfoWidgetTemplate; // 0x418(0x08)
	struct F*f0cac2bec7 *6fe73dfffd; // 0x420(0x28)
	struct F*f4f57b85a2 *448bfde1b4; // 0x448(0x20)
	struct F*f4f57b85a2 *da19dd6d29; // 0x468(0x20)
	struct F*f4f57b85a2 *d1ca933e0a; // 0x488(0x20)
	struct F*f4f57b85a2 *31fc0b47d5; // 0x4a8(0x20)
	struct F*c233adf9bd *92952c6f44; // 0x4c8(0x20)
	struct F*e9e2558d2e *61c7751f6e; // 0x4e8(0x20)
	struct F*e9e2558d2e *d232fdb0e1; // 0x508(0x20)
	char pad_528[0x8]; // 0x528(0x08)
	struct TArray<struct U*48e392ad61*> *5023ba779c; // 0x530(0x10)
	char pad_540[0x8]; // 0x540(0x08)

	void *5d0cf72b73(); // Function TslGame.*5f1937f5a5.*5d0cf72b73 // Final|Native|Protected // @ game+0x59c25c4
};

// Class TslGame.TslMediaPlayerWidget
// Size: 0x460 (Inherited: 0x418)
struct UTslMediaPlayerWidget : U*17234a7c9b {
	char pad_418[0x8]; // 0x418(0x08)
	struct UMediaPlayer* MediaPlayer; // 0x420(0x08)
	struct UPlatformMediaSource* *1b7950d6f1; // 0x428(0x08)
	struct UAkAudioEvent* *b29c99b8c4; // 0x430(0x08)
	struct UAkAudioEvent* *bc48a0fdc4; // 0x438(0x08)
	bool *d066ac3489; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct USizeBox* VideoSizeBox; // 0x448(0x08)
	struct UAkComponent* *292d220d36; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)

	void OnVideoEnded(); // Function TslGame.TslMediaPlayerWidget.OnVideoEnded // Final|Native|Public // @ game+0x59c3820
	void OnSkipVideoPressed(); // Function TslGame.TslMediaPlayerWidget.OnSkipVideoPressed // Final|Native|Protected // @ game+0x59c21cc
};

// Class TslGame.*50335ff38b
// Size: 0x568 (Inherited: 0x418)
struct U*50335ff38b : U*17234a7c9b {
	struct TArray<struct F*917ae4cb1d> *8a8ed22b9b; // 0x418(0x10)
	struct F*7f3debddd2 *ed1bdbd972; // 0x428(0x20)
	struct F*7f3debddd2 *b69ee6fe99; // 0x448(0x20)
	struct F*7f3debddd2 *19e2d5869f; // 0x468(0x20)
	struct F*7f3debddd2 *47e2f58ca2; // 0x488(0x20)
	struct F*7f3debddd2 *aaf7483055; // 0x4a8(0x20)
	struct F*7f3debddd2 *7acb17765b; // 0x4c8(0x20)
	struct F*7f3debddd2 *dd3baa2582; // 0x4e8(0x20)
	struct F*7f3debddd2 *aae085c021; // 0x508(0x20)
	struct F*7f3debddd2 *fe43ec2c9a; // 0x528(0x20)
	struct U*bde5e52cf2* PubgIdWidget; // 0x548(0x08)
	float PubgIdLifeTime; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	struct UStringTable* UIStringTable; // 0x558(0x08)
	char pad_560[0x8]; // 0x560(0x08)

	void *be8ce40810(); // Function TslGame.*50335ff38b.*be8ce40810 // Final|Native|Private|HasOutParms // @ game+0x59b8cdc
	void UpdatePubgIdWidgetWithKiller(); // Function TslGame.*50335ff38b.UpdatePubgIdWidgetWithKiller // Final|Native|Private // @ game+0x59cd96c
	void *de806cb6de(); // Function TslGame.*50335ff38b.*de806cb6de // Final|Native|Private // @ game+0x59c4abc
	void OnDisplayVoiceChannelStateMessage(); // Function TslGame.*50335ff38b.OnDisplayVoiceChannelStateMessage // Final|Native|Private // @ game+0x59be420
	void CreateVoiceChannelStateMessage(); // Function TslGame.*50335ff38b.CreateVoiceChannelStateMessage // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void OnDisplayMessage(); // Function TslGame.*50335ff38b.OnDisplayMessage // Final|Native|Private // @ game+0xa8324c
	void *9312fbddf8(); // Function TslGame.*50335ff38b.*9312fbddf8 // Final|Native|Private // @ game+0x59bf360
	void *bab7fb96d8(); // Function TslGame.*50335ff38b.*bab7fb96d8 // Final|Native|Private // @ game+0x59be2ac
	void *94627bcb5a(); // Function TslGame.*50335ff38b.*94627bcb5a // Final|Native|Private // @ game+0x59baf48
	void *f1ef2124f0(); // Function TslGame.*50335ff38b.*f1ef2124f0 // Final|Native|Private // @ game+0x59ba3c8
	void *3e159737e2(); // Function TslGame.*50335ff38b.*3e159737e2 // Final|Native|Private // @ game+0x59b8bd0
	void CreateSystemMessage(); // Function TslGame.*50335ff38b.CreateSystemMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22ddc4
	void HidePubgIdWidget(); // Function TslGame.*50335ff38b.HidePubgIdWidget // Final|Native|Public // @ game+0x59bac7c
	void *957f30d941(); // Function TslGame.*50335ff38b.*957f30d941 // Final|Native|Private|HasOutParms // @ game+0x59c4e48
	void CreateGamePlayMessage(); // Function TslGame.*50335ff38b.CreateGamePlayMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*9d796cb601
// Size: 0x458 (Inherited: 0x418)
struct U*9d796cb601 : U*17234a7c9b {
	struct FString Name; // 0x418(0x10)
	int32 Level; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FString EmblemId; // 0x430(0x10)
	struct FString NameplateId; // 0x440(0x10)
	enum class EOutGamePlatformProvider Platform; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class TslGame.*6e13359b6c
// Size: 0x5b0 (Inherited: 0x418)
struct U*6e13359b6c : U*17234a7c9b {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*f0cac2bec7 MissionItemVerticalBox_Binder; // 0x420(0x28)
	struct F*f4f57b85a2 MissionGroupText_Binder; // 0x448(0x20)
	struct F*d3069d51ff ProgressImage_Binder; // 0x468(0x28)
	struct F*f4f57b85a2 ProgressText_Binder; // 0x490(0x20)
	struct F*e9e2558d2e LockWidgetAnimation_Binder; // 0x4b0(0x20)
	struct F*959656208f LockBorder_Binder; // 0x4d0(0x30)
	struct F*959656208f ButtonBorder_Binder; // 0x500(0x30)
	struct F*d3069d51ff ExpandImage_Binder; // 0x530(0x28)
	struct F*0d3e7cd17a WidgetBody_Binder; // 0x558(0x28)
	struct UTexture2D* ExpandTexture; // 0x580(0x08)
	struct UTexture2D* CollapsTexture; // 0x588(0x08)
	char pad_590[0x8]; // 0x590(0x08)
	struct U*8f410eb7f2* *431fc9005b; // 0x598(0x08)
	struct FMulticastDelegate OnExpanded; // 0x5a0(0x10)

	void *d85ee6ef8e(); // Function TslGame.*6e13359b6c.*d85ee6ef8e // Final|Native|Public // @ game+0x59b9c7c
	void NotifyWidgetInputA(); // Function TslGame.*6e13359b6c.NotifyWidgetInputA // Final|Native|Public|BlueprintCallable // @ game+0x59bca80
	void UpdateDesign_Normal(); // Function TslGame.*6e13359b6c.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void UpdateDesign_Focused(); // Function TslGame.*6e13359b6c.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void OnButtonDown(); // Function TslGame.*6e13359b6c.OnButtonDown // Final|Native|Private|HasOutParms // @ game+0x59bd528
	void *94cb81208c(); // Function TslGame.*6e13359b6c.*94cb81208c // Final|Native|Public // @ game+0x59b9ca8
};

// Class TslGame.*f7e6e1d954
// Size: 0x568 (Inherited: 0x418)
struct U*f7e6e1d954 : U*17234a7c9b {
	char pad_418[0x10]; // 0x418(0x10)
	struct UTextBlock* DescriptionText; // 0x428(0x08)
	struct UTextBlock* ProgressText; // 0x430(0x08)
	struct UImage* IconImage; // 0x438(0x08)
	struct UImage* StateImage; // 0x440(0x08)
	struct UImage* ProgressBarImage; // 0x448(0x08)
	struct UBorder* InfoBorder; // 0x450(0x08)
	struct UBorder* ProgressBarBorder; // 0x458(0x08)
	struct UBorder* MissionListBorder; // 0x460(0x08)
	struct TMap<struct FString, struct UTexture2D*> MissionIcons; // 0x468(0x50)
	struct UTexture2D* DefaultMissionIcon; // 0x4b8(0x08)
	struct UTexture2D* LockTexture; // 0x4c0(0x08)
	struct UTexture2D* CompleteTexture; // 0x4c8(0x08)
	float InactiveIconAlpha; // 0x4d0(0x04)
	float ActiveIconAlpha; // 0x4d4(0x04)
	float InactiveTextAlpha; // 0x4d8(0x04)
	float InactiveProgressBarBorderAlpha; // 0x4dc(0x04)
	int32 FontSizeForPC; // 0x4e0(0x04)
	int32 FontSizeForConsole; // 0x4e4(0x04)
	struct FLinearColor ActiveInfoBorderColor; // 0x4e8(0x10)
	struct FLinearColor AchievedInfoBorderColor; // 0x4f8(0x10)
	struct FLinearColor ActiveMissionBorderColor; // 0x508(0x10)
	struct FLinearColor AchievedMissionBorderColor; // 0x518(0x10)
	struct FName ScalarParamNameFirstEnd; // 0x528(0x08)
	struct FName ScalarParamNameSecondEnd; // 0x530(0x08)
	struct FString MissionId; // 0x538(0x10)
	struct FString MissionType; // 0x548(0x10)
	char pad_558[0x8]; // 0x558(0x08)
	struct U*8f410eb7f2* *431fc9005b; // 0x560(0x08)

	void UpdateDesign_Normal(); // Function TslGame.*f7e6e1d954.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void UpdateDesign_Focused(); // Function TslGame.*f7e6e1d954.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*dd77d9bfc8
// Size: 0x470 (Inherited: 0x418)
struct U*dd77d9bfc8 : U*17234a7c9b {
	struct F*eaae7901d4 KeysPanel_Binder; // 0x418(0x20)
	struct F*d3069d51ff MiddleMouseButton_Binder; // 0x438(0x28)
	struct TArray<struct FString> MiddleMouseButtonActionsOrAxies; // 0x460(0x10)
};

// Class TslGame.*e3367663b9
// Size: 0x4b0 (Inherited: 0x418)
struct U*e3367663b9 : U*17234a7c9b {
	struct F*d3069d51ff *ba1084862b; // 0x418(0x28)
	struct F*f4f57b85a2 *e7b5e06f52; // 0x440(0x20)
	struct F*f23e4e6c9e *4a660d1b71; // 0x460(0x28)
	struct FVector2D *9a8b0ac41d; // 0x488(0x08)
	struct UMaterialInstanceDynamic* *9dde375ff2; // 0x490(0x08)
	struct U*2679a92f7f* CastingBarInfoText; // 0x498(0x08)
	char pad_4A0[0x10]; // 0x4a0(0x10)
};

// Class TslGame.*066fd6c9ca
// Size: 0x4f8 (Inherited: 0x418)
struct U*066fd6c9ca : U*17234a7c9b {
	enum class EVerticalAlignment *52f9deefe3; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	int32 *7a7ab2e01e; // 0x41c(0x04)
	bool *be97afb0d5; // 0x420(0x01)
	bool *2604610b3b; // 0x421(0x01)
	char pad_422[0x6]; // 0x422(0x06)
	struct UCurveFloat* *3bf762738d; // 0x428(0x08)
	struct FVector2D BorderSize; // 0x430(0x08)
	bool *ea416c6b93; // 0x438(0x01)
	bool *63b7e64bed; // 0x439(0x01)
	char pad_43A[0x6]; // 0x43a(0x06)
	struct TArray<struct U*609efafa5b*> *53d744ab50; // 0x440(0x10)
	struct U*609efafa5b* *9e57c42ec4; // 0x450(0x08)
	struct F*7f3debddd2 *877a198a9a; // 0x458(0x20)
	struct F*7f3debddd2 *560b3cbf6a; // 0x478(0x20)
	struct F*7f3debddd2 *7ba24e74fc; // 0x498(0x20)
	struct FVector2D *4b1db01621; // 0x4b8(0x08)
	struct TArray<struct FVector2D> *d338affaae; // 0x4c0(0x10)
	float *f640ff97a1; // 0x4d0(0x04)
	struct FVector2D *74a0907f98; // 0x4d4(0x08)
	struct FVector2D *3660264e49; // 0x4dc(0x08)
	struct FVector2D *e51a94d790; // 0x4e4(0x08)
	float *0056c49f92; // 0x4ec(0x04)
	int32 Count; // 0x4f0(0x04)
	bool *8b7b50f892; // 0x4f4(0x01)
	char pad_4F5[0x3]; // 0x4f5(0x03)

	void *750a90d339(); // Function TslGame.*066fd6c9ca.*750a90d339 // Final|Native|Public // @ game+0x59cd91c
	void OnRemoveMessage(); // Function TslGame.*066fd6c9ca.OnRemoveMessage // Final|Native|Public // @ game+0xba996c
	void *2915afc34d(); // Function TslGame.*066fd6c9ca.*2915afc34d // Final|Native|Public // @ game+0x59babb4
	void *52f7dd647d(); // Function TslGame.*066fd6c9ca.*52f7dd647d // Final|Native|Protected // @ game+0x59cdaa8
	void *7d28ee47d2(); // Function TslGame.*066fd6c9ca.*7d28ee47d2 // Final|Native|Public // @ game+0x59b662c
	void *d42c21ec5e(); // Function TslGame.*066fd6c9ca.*d42c21ec5e // Final|Native|Protected // @ game+0x59bb670
	void SetSizeRule(); // Function TslGame.*066fd6c9ca.SetSizeRule // Final|Native|Protected // @ game+0x59cb3dc
	void *32a9ba497f(); // Function TslGame.*066fd6c9ca.*32a9ba497f // Final|Native|Protected // @ game+0x59b9c58
	void *e2d0e9d7a4(); // Function TslGame.*066fd6c9ca.*e2d0e9d7a4 // Final|Native|Protected // @ game+0x59bb110
};

// Class TslGame.*878bd5f6c4
// Size: 0x4f8 (Inherited: 0x4f8)
struct U*878bd5f6c4 : U*066fd6c9ca {
};

// Class TslGame.*609efafa5b
// Size: 0x478 (Inherited: 0x418)
struct U*609efafa5b : U*17234a7c9b {
	struct FText Message; // 0x418(0x18)
	float Duration; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UAkAudioEvent* Sound; // 0x438(0x08)
	struct FMulticastDelegate EndMessage; // 0x440(0x10)
	bool bUsed; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
	struct F*9c84e0ea54 *04a317aca0; // 0x458(0x08)
	struct UTextBlock* MessageTextBlock; // 0x460(0x08)
	struct U*6b11b3bf02* Anim_FadeIn; // 0x468(0x08)
	struct U*6b11b3bf02* Anim_FadeOut; // 0x470(0x08)

	void OnFadeInFinished(); // Function TslGame.*609efafa5b.OnFadeInFinished // Final|Native|Public // @ game+0x9b3c08
	void OnFadeOutFinished(); // Function TslGame.*609efafa5b.OnFadeOutFinished // Final|Native|Public // @ game+0xa8444c
	void StartFadeOut(); // Function TslGame.*609efafa5b.StartFadeOut // Final|Native|Public // @ game+0x7152e0
};

// Class TslGame.*55ba2832c8
// Size: 0x470 (Inherited: 0x418)
struct U*55ba2832c8 : U*17234a7c9b {
	struct U*ba1bff039c* TeamManagement; // 0x418(0x08)
	struct U*cc69409b78* TeamManagementPopup; // 0x420(0x08)
	struct U*f653452603* SystemMenu; // 0x428(0x08)
	struct U*3ac124ec5e* ReportPlayerWidget; // 0x430(0x08)
	struct TArray<struct ATeam*> *d137432a43; // 0x438(0x10)
	char pad_448[0x18]; // 0x448(0x18)
	struct U*fe8f9c39c2* MissionList; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	void OnSuccessfullyReportPlayer(); // Function TslGame.*55ba2832c8.OnSuccessfullyReportPlayer // Final|Native|Public // @ game+0x59c23b4
	void OnNotifyReportTeamMember(); // Function TslGame.*55ba2832c8.OnNotifyReportTeamMember // Event|Protected|BlueprintEvent // @ game+0x22ddc4
	void InitBinding(); // Function TslGame.*55ba2832c8.InitBinding // Final|Native|Public|BlueprintCallable // @ game+0x59bac90
	void OnReport(); // Function TslGame.*55ba2832c8.OnReport // Final|Native|Public // @ game+0x59c1a74
	void *b97811affe(); // Function TslGame.*55ba2832c8.*b97811affe // Final|Native|Protected // @ game+0x59b9a74
};

// Class TslGame.*61763b9809
// Size: 0x4f0 (Inherited: 0x418)
struct U*61763b9809 : U*17234a7c9b {
	struct UBorder* BorderNotificationMessage; // 0x418(0x08)
	struct UImage* ImageIcon; // 0x420(0x08)
	struct UWidgetSwitcher* SwitcherMessage; // 0x428(0x08)
	struct UTextBlock* TextMessage; // 0x430(0x08)
	struct UTslRichTextBlock* RichTextMessage; // 0x438(0x08)
	struct U*6b11b3bf02* AnimAppear; // 0x440(0x08)
	struct U*6b11b3bf02* AnimAppearLoop; // 0x448(0x08)
	struct U*6b11b3bf02* AnimDisappear; // 0x450(0x08)
	struct UDataTable* NotificationMessageTable; // 0x458(0x08)
	struct TMap<enum class ETslNotificationMessageColorType, struct FSlateColor> *4d421db150; // 0x460(0x50)
	struct F*3c352e82dd *8eabf3c7f1; // 0x4b0(0x38)
	char pad_4E8[0x8]; // 0x4e8(0x08)
};

// Class TslGame.*f8514d3992
// Size: 0x500 (Inherited: 0x418)
struct U*f8514d3992 : U*17234a7c9b {
	struct F*e9e2558d2e LastTeamsAnimBinder; // 0x418(0x20)
	struct F*e9e2558d2e LastTeamsSkipAnimBinder; // 0x438(0x20)
	struct F*e9e2558d2e LastTeamsInitAnimBinder; // 0x458(0x20)
	struct TArray<struct F*c233adf9bd> PlayerIconWidgetBinders; // 0x478(0x10)
	struct TArray<struct F*c233adf9bd> LastTeamInfoWidgetBinders; // 0x488(0x10)
	struct TMap<int32, struct U*8e60b74b55*> *cb0e5bfd83; // 0x498(0x50)
	struct U*b2d1f47a84* *4f5ec8b1bb; // 0x4e8(0x08)
	char pad_4F0[0x10]; // 0x4f0(0x10)

	void UpdateCurrentAliveCount(); // Function TslGame.*f8514d3992.UpdateCurrentAliveCount // Final|Native|Public // @ game+0x59cd320
	void OnInitLastTeams(); // Function TslGame.*f8514d3992.OnInitLastTeams // Final|Native|Public // @ game+0x59bef78
};

// Class TslGame.*8e60b74b55
// Size: 0x5a8 (Inherited: 0x418)
struct U*8e60b74b55 : U*17234a7c9b {
	struct TArray<struct F*d3069d51ff> PlayerImageWidgetBinders; // 0x418(0x10)
	struct F*d3069d51ff BGImageWidgetBinder; // 0x428(0x28)
	struct F*d3069d51ff PatternImageWidgetBinder; // 0x450(0x28)
	struct F*f4f57b85a2 NameTextWidgetBinder; // 0x478(0x20)
	struct F*959656208f LogoBorderWidgetBinder; // 0x498(0x30)
	struct F*b9afef7a3a LogoSwitcherWidgetBinder; // 0x4c8(0x28)
	struct F*d3069d51ff TeamIconImageWidgetBinder; // 0x4f0(0x28)
	struct F*e9e2558d2e EndAnimBinder; // 0x518(0x20)
	struct FLinearColor BGImageDimColor; // 0x538(0x10)
	struct FLinearColor NameTextNormalColor; // 0x548(0x10)
	struct FLinearColor NameTextDimColor; // 0x558(0x10)
	struct FLinearColor PlayerNormalColor; // 0x568(0x10)
	struct FLinearColor PlayerGroggyColor; // 0x578(0x10)
	struct FLinearColor PlayerDieColor; // 0x588(0x10)
	char pad_598[0x10]; // 0x598(0x10)
};

// Class TslGame.*aee10333db
// Size: 0x440 (Inherited: 0x418)
struct U*aee10333db : U*17234a7c9b {
	struct F*b9afef7a3a PlayerStateIconsSwitcherBinder; // 0x418(0x28)
};

// Class TslGame.*e7ff12396f
// Size: 0x4b0 (Inherited: 0x418)
struct U*e7ff12396f : U*17234a7c9b {
	struct F*959656208f LogoBorderWidgetBinder; // 0x418(0x30)
	struct F*eaae7901d4 LogoPanelWidgetBinder; // 0x448(0x20)
	struct F*d3069d51ff LastTeamPatternWidgetBinder; // 0x468(0x28)
	struct F*f4f57b85a2 LastTeamTextWidgetBinder; // 0x490(0x20)
};

// Class TslGame.*b7853ab010
// Size: 0x428 (Inherited: 0x418)
struct U*b7853ab010 : U*17234a7c9b {
	struct U*b2d1f47a84* Manager; // 0x418(0x08)
	struct U*7f757909f6* PlatformImage; // 0x420(0x08)
};

// Class TslGame.*7d0388ca2f
// Size: 0x630 (Inherited: 0x428)
struct U*7d0388ca2f : U*b7853ab010 {
	struct F*b9afef7a3a *645569ffd8; // 0x428(0x28)
	struct F*b9afef7a3a *a750dc88f9; // 0x450(0x28)
	struct F*e9e2558d2e *0c2508f220; // 0x478(0x20)
	struct F*c233adf9bd *7e8edef333; // 0x498(0x20)
	struct F*c233adf9bd *5dc24d6ef5; // 0x4b8(0x20)
	struct F*f4f57b85a2 *0dae719340; // 0x4d8(0x20)
	struct F*f4f57b85a2 *2d9489194e; // 0x4f8(0x20)
	struct F*e9e2558d2e *080f42f1ba; // 0x518(0x20)
	struct F*c233adf9bd *d74beb4c87; // 0x538(0x20)
	struct F*c233adf9bd *16257fec37; // 0x558(0x20)
	struct F*c233adf9bd *92ffc95d99; // 0x578(0x20)
	struct F*c233adf9bd *2b12949877; // 0x598(0x20)
	struct F*f4f57b85a2 *895202d8b6; // 0x5b8(0x20)
	struct F*f4f57b85a2 *4dd2bb6ec1; // 0x5d8(0x20)
	struct F*f4f57b85a2 *a97386cd13; // 0x5f8(0x20)
	struct UAkAudioEvent* *114be7f07d; // 0x618(0x08)
	char pad_620[0x10]; // 0x620(0x10)

	void *8d53c799db(); // Function TslGame.*7d0388ca2f.*8d53c799db // Final|Native|Private // @ game+0x59bb608
};

// Class TslGame.*b2d1f47a84
// Size: 0x478 (Inherited: 0x418)
struct U*b2d1f47a84 : U*17234a7c9b {
	char pad_418[0x10]; // 0x418(0x10)
	struct F*959656208f *320254f760; // 0x428(0x30)
	struct UClass* *6896716d9c; // 0x458(0x08)
	struct UClass* *5f044544a8; // 0x460(0x08)
	struct U*b7853ab010* CurrAnimWidget; // 0x468(0x08)
	struct U*f8514d3992* *f8514d3992; // 0x470(0x08)

	void IsEmpty(); // Function TslGame.*b2d1f47a84.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb09c
	void ProcData(); // Function TslGame.*b2d1f47a84.ProcData // Final|Native|Public|BlueprintCallable // @ game+0x59c4a38
	void Dequeue(); // Function TslGame.*b2d1f47a84.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x59b8b20
	void Clear(); // Function TslGame.*b2d1f47a84.Clear // Final|Native|Public|BlueprintCallable // @ game+0x59b6654
	void Enqueue(); // Function TslGame.*b2d1f47a84.Enqueue // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x59b8f4c
	void OnCurrAnimFinish(); // Function TslGame.*b2d1f47a84.OnCurrAnimFinish // Final|Native|Public|BlueprintCallable // @ game+0x59bdee0
	void OnTeamKillingSpree(); // Function TslGame.*b2d1f47a84.OnTeamKillingSpree // Final|Native|Protected // @ game+0x59c25d8
	void OnTeamWipeOut(); // Function TslGame.*b2d1f47a84.OnTeamWipeOut // Final|Native|Protected // @ game+0x59c2758
	void NumElems(); // Function TslGame.*b2d1f47a84.NumElems // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bcacc
	void OnPersonalKillingSpree(); // Function TslGame.*b2d1f47a84.OnPersonalKillingSpree // Final|Native|Protected // @ game+0x59c0bd4
	void IsBusy(); // Function TslGame.*b2d1f47a84.IsBusy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb064
	void Peek(); // Function TslGame.*b2d1f47a84.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x59c45a8
};

// Class TslGame.*9a635cc5c2
// Size: 0x518 (Inherited: 0x428)
struct U*9a635cc5c2 : U*b7853ab010 {
	struct F*c233adf9bd *051fa22064; // 0x428(0x20)
	struct F*c233adf9bd *a43f334615; // 0x448(0x20)
	struct F*c233adf9bd *acc6f25d11; // 0x468(0x20)
	struct F*c233adf9bd *89181af492; // 0x488(0x20)
	struct F*f4f57b85a2 *cf06884dae; // 0x4a8(0x20)
	struct F*f4f57b85a2 *d5cc5c4d81; // 0x4c8(0x20)
	struct F*e9e2558d2e *56e9530487; // 0x4e8(0x20)
	struct UAkAudioEvent* *e5534cd2e4; // 0x508(0x08)
	char pad_510[0x8]; // 0x510(0x08)

	void *3c87c909a1(); // Function TslGame.*9a635cc5c2.*3c87c909a1 // Final|Native|Protected // @ game+0x59bb608
};

// Class TslGame.*28cea59f92
// Size: 0x620 (Inherited: 0x428)
struct U*28cea59f92 : U*b7853ab010 {
	struct F*f4f57b85a2 *2d9489194e; // 0x428(0x20)
	struct F*f4f57b85a2 *4dd2bb6ec1; // 0x448(0x20)
	struct F*b9afef7a3a *dfbdadf92b; // 0x468(0x28)
	struct F*c233adf9bd *8ae71cae91; // 0x490(0x20)
	struct F*d3069d51ff *0d32cd716f; // 0x4b0(0x28)
	struct F*f4f57b85a2 *9a2526a090; // 0x4d8(0x20)
	struct F*d3069d51ff *13d185e249; // 0x4f8(0x28)
	struct F*f4f57b85a2 *911e4d5d06; // 0x520(0x20)
	struct F*d3069d51ff *8260ae4b8e; // 0x540(0x28)
	struct UTexture2D* KillingSpreeTexture; // 0x568(0x08)
	struct UTexture2D* DominatingTexture; // 0x570(0x08)
	struct F*e9e2558d2e AssistAnimBinder; // 0x578(0x20)
	struct F*e9e2558d2e FirstKillAnimBinder; // 0x598(0x20)
	struct F*e9e2558d2e ThirdKillAnimBinder; // 0x5b8(0x20)
	struct F*e9e2558d2e FifthKillAnimBinder; // 0x5d8(0x20)
	struct F*e9e2558d2e OverKillAnimBinder; // 0x5f8(0x20)
	struct UAkAudioEvent* ObserverTotalKillSound; // 0x618(0x08)
};

// Class TslGame.*47dd8e4d13
// Size: 0x460 (Inherited: 0x418)
struct U*47dd8e4d13 : U*17234a7c9b {
	struct UClass* TeamInfoWidgetTemplate; // 0x418(0x08)
	struct TArray<struct U*5f1937f5a5*> *69675e56a5; // 0x420(0x10)
	float *3fd4ccb5e3; // 0x430(0x04)
	float *143aa28b70; // 0x434(0x04)
	struct F*5f0ea4fd04 *8ddd17b830; // 0x438(0x28)
};

// Class TslGame.*b598a0851f
// Size: 0x498 (Inherited: 0x418)
struct U*b598a0851f : U*17234a7c9b {
	struct F*c233adf9bd *399cfd4f47; // 0x418(0x20)
	struct F*c233adf9bd *48e8ec853a; // 0x438(0x20)
	struct F*c233adf9bd *977519b103; // 0x458(0x20)
	struct F*e9e2558d2e *ac8339b7e7; // 0x478(0x20)
};

// Class TslGame.*8f6b05f877
// Size: 0x4f0 (Inherited: 0x418)
struct U*8f6b05f877 : U*17234a7c9b {
	struct F*f4f57b85a2 *43c321a40a; // 0x418(0x20)
	struct F*f4f57b85a2 *6bb33fb6f9; // 0x438(0x20)
	struct F*f4f57b85a2 *4af0d7aac1; // 0x458(0x20)
	struct F*d3069d51ff *c4e5c9fa86; // 0x478(0x28)
	struct F*c233adf9bd *2b12949877; // 0x4a0(0x20)
	struct F*e9e2558d2e *562207a6c3; // 0x4c0(0x20)
	enum class ELeagueMatchStatistic *7c71a10b47; // 0x4e0(0x01)
	char pad_4E1[0x3]; // 0x4e1(0x03)
	float *eaf27a9930; // 0x4e4(0x04)
	char pad_4E8[0x8]; // 0x4e8(0x08)

	void *d4bee6a2d3(); // Function TslGame.*8f6b05f877.*d4bee6a2d3 // Final|Native|Private // @ game+0x59c2340
};

// Class TslGame.*f729112f02
// Size: 0x460 (Inherited: 0x418)
struct U*f729112f02 : U*17234a7c9b {
	struct FVector2D *877b268e45; // 0x418(0x08)
	struct FVector2D *4a57cb3333; // 0x420(0x08)
	struct UWidgetSwitcher* SwitcherPlayerIcon; // 0x428(0x08)
	struct USizeBox* SizeboxPlayerIcon; // 0x430(0x08)
	struct UImage* ImagePlayerIcon; // 0x438(0x08)
	struct USizeBox* SizeboxPlayerNumber; // 0x440(0x08)
	struct UBorder* BorderPlayerNumber; // 0x448(0x08)
	struct UImage* ImagePattern; // 0x450(0x08)
	struct UTextBlock* TextNumber; // 0x458(0x08)

	void UpdatePlayerIcon(); // Function TslGame.*f729112f02.UpdatePlayerIcon // Final|Native|Public|BlueprintCallable // @ game+0x59cd864
};

// Class TslGame.*5bf84e35e0
// Size: 0x9d8 (Inherited: 0x418)
struct U*5bf84e35e0 : U*17234a7c9b {
	struct UTexture* UnArmedIcon; // 0x418(0x08)
	float UnArmedIconRatio; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct ATslCharacter* *2f2016c46b; // 0x428(0x08)
	int32 *997b5149db; // 0x430(0x04)
	int32 *33c9273227; // 0x434(0x04)
	int32 *590697892a; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct F*e9e2558d2e AmmoIncreasingAnimBinder; // 0x440(0x20)
	struct F*e9e2558d2e AmmoDecreasingAnimBinder; // 0x460(0x20)
	struct F*f4f57b85a2 *04d6956259; // 0x480(0x20)
	struct F*f4f57b85a2 *f89b4fa151; // 0x4a0(0x20)
	struct F*959656208f *70d4c4c139; // 0x4c0(0x30)
	struct F*f4f57b85a2 *da19dd6d29; // 0x4f0(0x20)
	struct F*959656208f *94735229c9; // 0x510(0x30)
	struct F*b9afef7a3a PatternSwitcherBinder; // 0x540(0x28)
	struct F*d3069d51ff *82741b3241; // 0x568(0x28)
	struct F*8e32972a91 *1e88c093f5; // 0x590(0x28)
	struct F*f4f57b85a2 *d64537dc36; // 0x5b8(0x20)
	struct F*f4f57b85a2 *33158c7e70; // 0x5d8(0x20)
	struct F*f4f57b85a2 *c25fbecbf5; // 0x5f8(0x20)
	struct F*f4f57b85a2 *d1ca933e0a; // 0x618(0x20)
	struct F*c233adf9bd *31c5bc43a6; // 0x638(0x20)
	struct F*c233adf9bd *4cb6148dc9; // 0x658(0x20)
	struct F*c233adf9bd *02b16500ae; // 0x678(0x20)
	struct F*c233adf9bd *5ae98e59ac; // 0x698(0x20)
	struct F*c233adf9bd *6ab5602afa; // 0x6b8(0x20)
	struct F*c233adf9bd *6c3a99b01f; // 0x6d8(0x20)
	struct F*c233adf9bd *6b5b75ac7e; // 0x6f8(0x20)
	struct F*c233adf9bd *f445394411; // 0x718(0x20)
	struct F*c233adf9bd *bc4312cdfb; // 0x738(0x20)
	struct F*d3069d51ff *3275f0a2bd; // 0x758(0x28)
	struct UTexture2D* DriverTexture; // 0x780(0x08)
	struct F*d3069d51ff WeaponIconImageBinder; // 0x788(0x28)
	struct F*c69f8ed24a WeaponIconImageSizeBoxBinder; // 0x7b0(0x28)
	struct F*d3069d51ff SecondWeaponIconImageBinder; // 0x7d8(0x28)
	struct F*c69f8ed24a SecondWeaponIconImageSizeBoxBinder; // 0x800(0x28)
	struct F*f4f57b85a2 MainWeaponName_Binder; // 0x828(0x20)
	struct F*f4f57b85a2 MainWeaponEmpty_Binder; // 0x848(0x20)
	struct F*f4f57b85a2 SecondWeaponEmpty_Binder; // 0x868(0x20)
	struct FName WeaponIconTextureParmName; // 0x888(0x08)
	struct FName WeaponIconColorParmName; // 0x890(0x08)
	struct FLinearColor WeaponColor_Armed; // 0x898(0x10)
	struct FLinearColor WeaponColor_Normal; // 0x8a8(0x10)
	struct FLinearColor SecondWeaponColor_Normal; // 0x8b8(0x10)
	struct F*fd985b6c41 WeaponColorSet_NoReload; // 0x8c8(0x10)
	struct F*fd985b6c41 SecondWeaponColorSet_NoReload; // 0x8d8(0x10)
	struct TMap<struct FName, struct UTexture2D*> WeaponAttachableTextureMap; // 0x8e8(0x50)
	struct TMap<enum class ECastAnim, struct UTexture2D*> CastableItemTextureMap; // 0x938(0x50)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x988(0x10)
	struct U*7f757909f6* UserPlatformImageWidget; // 0x998(0x08)
	struct FLinearColor *3c7e338480; // 0x9a0(0x10)
	struct FLinearColor *de61af4f50; // 0x9b0(0x10)
	struct UTexture2D* *eb7ad49f32; // 0x9c0(0x08)
	struct UTexture2D* *6e162af026; // 0x9c8(0x08)
	struct UTexture2D* *f40f9d67ba; // 0x9d0(0x08)
};

// Class TslGame.TslObserverPlayerListTileInfoWidget
// Size: 0x658 (Inherited: 0x418)
struct UTslObserverPlayerListTileInfoWidget : U*17234a7c9b {
	char pad_418[0x40]; // 0x418(0x40)
	struct ATslCharacter* Character; // 0x458(0x08)
	struct ATslPlayerState* *b3a6a36d0d; // 0x460(0x08)
	struct FLinearColor HighlightedColor; // 0x468(0x10)
	struct FLinearColor ActivatedColor; // 0x478(0x10)
	struct FLinearColor DeactivatedColor; // 0x488(0x10)
	struct U*0399764a34* PlayerNameFlowText; // 0x498(0x08)
	struct F*f4f57b85a2 TeamName; // 0x4a0(0x20)
	struct F*f4f57b85a2 PlayerKillCount; // 0x4c0(0x20)
	struct F*c233adf9bd LifeGaugeWidgetBinder; // 0x4e0(0x20)
	struct F*7f3debddd2 BtnPlayer; // 0x500(0x20)
	struct F*7f3debddd2 KickButton_Binder; // 0x520(0x20)
	struct F*7f3debddd2 ReportButton_Binder; // 0x540(0x20)
	struct F*c69f8ed24a TeamTagSizeBox_Binder; // 0x560(0x28)
	struct F*d3069d51ff TeamTagBG_Binder; // 0x588(0x28)
	struct F*d3069d51ff TeamTagColor_Binder; // 0x5b0(0x28)
	struct U*669c3b6ff9* *4551107787; // 0x5d8(0x08)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x5e0(0x10)
	struct U*7f757909f6* UserPlatformImageWidget; // 0x5f0(0x08)
	struct FString *77320b0e0b; // 0x5f8(0x10)
	struct FString PlayerName; // 0x608(0x10)
	struct FString *e80419cad3; // 0x618(0x10)
	struct FText *cf17a88333; // 0x628(0x18)
	char pad_640[0x18]; // 0x640(0x18)

	void OnMouseClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnMouseClicked // Final|Native|Private // @ game+0x59bff44
	void KickPlayer(); // Function TslGame.TslObserverPlayerListTileInfoWidget.KickPlayer // Final|Native|Private // @ game+0x59bb3bc
	void OnReportButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnReportButtonClicked // Final|Native|Public // @ game+0x59c1b84
	void OnKickButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnKickButtonClicked // Final|Native|Private // @ game+0x59bf064
};

// Class TslGame.TslObserverPlayerListTileWidget
// Size: 0x588 (Inherited: 0x418)
struct UTslObserverPlayerListTileWidget : U*17234a7c9b {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*eaae7901d4 InforPanel; // 0x420(0x20)
	struct F*7f3debddd2 TeamRank; // 0x440(0x20)
	struct F*f4f57b85a2 TeamRankText; // 0x460(0x20)
	struct F*b9afef7a3a SwitcherTeamLogo; // 0x480(0x28)
	struct F*d3069d51ff TeamImage; // 0x4a8(0x28)
	struct F*d3069d51ff TeamColor; // 0x4d0(0x28)
	struct F*d3069d51ff TeamListColor; // 0x4f8(0x28)
	struct F*f4f57b85a2 TeamNum; // 0x520(0x20)
	struct F*f4f57b85a2 TeamInfoKill; // 0x540(0x20)
	struct UTexture2D* *bda1591727; // 0x560(0x08)
	char pad_568[0x20]; // 0x568(0x20)

	void UpdateStripeTexture(); // Function TslGame.TslObserverPlayerListTileWidget.UpdateStripeTexture // Event|Protected|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*3181dcd77d
// Size: 0x428 (Inherited: 0x418)
struct U*3181dcd77d : U*17234a7c9b {
	char pad_418[0x10]; // 0x418(0x10)

	void Find(); // Function TslGame.*3181dcd77d.Find // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9538
	void Peek(); // Function TslGame.*3181dcd77d.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x59c4694
	void Clear(); // Function TslGame.*3181dcd77d.Clear // Final|Native|Public|BlueprintCallable // @ game+0x59b6670
	void IsEmpty(); // Function TslGame.*3181dcd77d.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb09c
	void Enqueue(); // Function TslGame.*3181dcd77d.Enqueue // Final|Native|Public|BlueprintCallable // @ game+0x59b9288
	void Dequeue(); // Function TslGame.*3181dcd77d.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x59b8b44
};

// Class TslGame.*45528684b4
// Size: 0x440 (Inherited: 0x418)
struct U*45528684b4 : U*17234a7c9b {
	char pad_418[0x10]; // 0x418(0x10)
	struct UCurveFloat* *529136b668; // 0x428(0x08)
	struct UCurveFloat* *01168b4278; // 0x430(0x08)
	float *19f94b0b95; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class TslGame.*08a5f2cace
// Size: 0x500 (Inherited: 0x440)
struct U*08a5f2cace : U*45528684b4 {
	char pad_440[0x8]; // 0x440(0x08)
	struct TArray<struct U*a9bd80b6db*> Icons; // 0x448(0x10)
	struct TMap<int32, struct UTexture2D*> *2442e3704b; // 0x458(0x50)
	struct UHorizontalBox* IconHorizontalBox; // 0x4a8(0x08)
	struct TMap<int32, struct ATslOPBuff*> *09ab4eb973; // 0x4b0(0x50)
};

// Class TslGame.*dfb13d7deb
// Size: 0x478 (Inherited: 0x440)
struct U*dfb13d7deb : U*45528684b4 {
	struct TArray<struct FLinearColor> *ee9805aa81; // 0x440(0x10)
	char pad_450[0x10]; // 0x450(0x10)
	struct UImage* Icon1; // 0x460(0x08)
	struct UImage* Icon2; // 0x468(0x08)
	struct UImage* Icon3; // 0x470(0x08)
};

// Class TslGame.*9d266de3c4
// Size: 0x4f0 (Inherited: 0x418)
struct U*9d266de3c4 : U*17234a7c9b {
	struct F*9c84e0ea54 *e9a95578ac; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
	struct U*08a5f2cace* MyBuffWidget; // 0x428(0x08)
	struct UCanvasPanel* BuffHeadManagerCanvasPanel; // 0x430(0x08)
	struct UScaleBox* TPP_Box; // 0x438(0x08)
	struct UScaleBox* FPP_Box; // 0x440(0x08)
	struct UScaleBox* FPPWithMonsterHp_Box; // 0x448(0x08)
	struct UScaleBox* IconBox; // 0x450(0x08)
	struct UClass* *5567f62fd0; // 0x458(0x08)
	struct UClass* *007757202a; // 0x460(0x08)
	struct TMap<struct ATslCharacter*, struct U*45528684b4*> *4c5035eb35; // 0x468(0x50)
	struct TArray<struct U*08a5f2cace*> *d2c2813985; // 0x4b8(0x10)
	struct TArray<struct U*dfb13d7deb*> *63a33a5b21; // 0x4c8(0x10)
	float *3172e2b812; // 0x4d8(0x04)
	float *8050fe9c4c; // 0x4dc(0x04)
	char pad_4E0[0x10]; // 0x4e0(0x10)

	void OnUpdateViewTarget(); // Function TslGame.*9d266de3c4.OnUpdateViewTarget // Final|Native|Protected // @ game+0x59c31e0
	void *a2b4158e18(); // Function TslGame.*9d266de3c4.*a2b4158e18 // Final|Native|Protected // @ game+0x59cd850
};

// Class TslGame.*5f8865c441
// Size: 0x4d0 (Inherited: 0x418)
struct U*5f8865c441 : U*17234a7c9b {
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x418(0x08)
	struct U*3cb5b0e933* PointWidget; // 0x420(0x08)
	struct U*3cb5b0e933* KillWidget; // 0x428(0x08)
	struct U*3cb5b0e933* AliveWidget; // 0x430(0x08)
	struct U*75df6275b9* MonsterHpWidget; // 0x438(0x08)
	struct UClass* *4014caf1e8; // 0x440(0x08)
	struct FName *36cb91ce3d; // 0x448(0x08)
	float *621e2abd5e; // 0x450(0x04)
	float *e5fca4b847; // 0x454(0x04)
	char pad_458[0x8]; // 0x458(0x08)
	struct TMap<struct ATslCharacterBase*, struct U*9e7a2f2990*> *308b6878af; // 0x460(0x50)
	struct TArray<struct U*9e7a2f2990*> *92cbd17831; // 0x4b0(0x10)
	char pad_4C0[0x10]; // 0x4c0(0x10)

	void UpdateCoinStackCount(); // Function TslGame.*5f8865c441.UpdateCoinStackCount // Final|Native|Protected|HasOutParms // @ game+0x59cd104
	void OnMatchStarted(); // Function TslGame.*5f8865c441.OnMatchStarted // Final|Native|Protected // @ game+0x59bf620
	void OnKillCountChanged(); // Function TslGame.*5f8865c441.OnKillCountChanged // Final|Native|Protected // @ game+0x59bf078
	void OnOPModeMonsterAttacked(); // Function TslGame.*5f8865c441.OnOPModeMonsterAttacked // Final|Native|Protected // @ game+0x59c086c
	void *043bc86332(); // Function TslGame.*5f8865c441.*043bc86332 // Final|Native|Protected // @ game+0x59bcd68
	void OnViewTargetUpdate(); // Function TslGame.*5f8865c441.OnViewTargetUpdate // Final|Native|Protected // @ game+0x59c38c4
	void UpdateCoin(); // Function TslGame.*5f8865c441.UpdateCoin // Final|Native|Protected // @ game+0x59cd0dc
};

// Class TslGame.*9e7a2f2990
// Size: 0x448 (Inherited: 0x418)
struct U*9e7a2f2990 : U*17234a7c9b {
	char pad_418[0x20]; // 0x418(0x20)
	struct UMaterialInstanceDynamic* *b378149ef3; // 0x438(0x08)
	struct UImage* HpImage; // 0x440(0x08)
};

// Class TslGame.*03b17e6ea9
// Size: 0x418 (Inherited: 0x418)
struct U*03b17e6ea9 : U*17234a7c9b {
};

// Class TslGame.*28728b885d
// Size: 0x428 (Inherited: 0x418)
struct U*28728b885d : U*17234a7c9b {
	struct U*5c719e1ded* ParachuteGaugeWidget; // 0x418(0x08)
	struct U*ff67c1c6e6* ParachuteAirSpeedWidget; // 0x420(0x08)
};

// Class TslGame.*01c84dbc27
// Size: 0x430 (Inherited: 0x418)
struct U*01c84dbc27 : U*17234a7c9b {
	struct USizeBox* FollowGuideSizeBox; // 0x418(0x08)
	struct UWidgetSwitcher* FollowGuideSwitcher; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*5c719e1ded
// Size: 0x468 (Inherited: 0x418)
struct U*5c719e1ded : U*17234a7c9b {
	struct USizeBox* FreeFallBar; // 0x418(0x08)
	struct USizeBox* ParachuteFallBar; // 0x420(0x08)
	struct USizeBox* GroundHeightBar; // 0x428(0x08)
	struct UTextBlock* AltitudeText; // 0x430(0x08)
	struct U*6b11b3bf02* PositionByPlayerAltitude; // 0x438(0x08)
	float *7ba8560192; // 0x440(0x04)
	struct ATslCharacter* ViewTargetCharacter; // 0x444(0x08)
	char pad_44C[0x1c]; // 0x44c(0x1c)

	void UpdateViewTarget(); // Function TslGame.*5c719e1ded.UpdateViewTarget // Final|Native|Public // @ game+0xadefcc
	void SetSkydiveState(); // Function TslGame.*5c719e1ded.SetSkydiveState // Final|Native|Public // @ game+0x59cb560
};

// Class TslGame.TslPlaneStanceWidget
// Size: 0x458 (Inherited: 0x418)
struct UTslPlaneStanceWidget : U*17234a7c9b {
	struct ATslCharacter* ViewTargetCharacter; // 0x418(0x08)
	struct UImage* PlaneImage; // 0x420(0x08)
	struct UGridPanel* SeatPanel; // 0x428(0x08)
	struct FName StateParamName; // 0x430(0x08)
	struct UTextBlock* RiderCountText; // 0x438(0x08)
	struct TArray<struct UImage*> *4a6a8f4013; // 0x440(0x10)
	char pad_450[0x8]; // 0x450(0x08)

	void UpdateViewTarget(); // Function TslGame.TslPlaneStanceWidget.UpdateViewTarget // Final|Native|Public // @ game+0x59cdddc
};

// Class TslGame.TslPlatoonCarePackageDropIndicatorWidget
// Size: 0x420 (Inherited: 0x418)
struct UTslPlatoonCarePackageDropIndicatorWidget : U*17234a7c9b {
	char pad_418[0x8]; // 0x418(0x08)

	void BP_UpdateIconType(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconType // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void BP_UpdateIconImage(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconImage // Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*bbc498abf3
// Size: 0x470 (Inherited: 0x418)
struct U*bbc498abf3 : U*17234a7c9b {
	struct UButton* CommandButton; // 0x418(0x08)
	struct UTslPlatoonCommandWidget* *5abbd4df7f; // 0x420(0x08)
	struct ATslGameState* *ba94c6f703; // 0x428(0x08)
	struct U*4175584972* MultipleKeyIconWidget; // 0x430(0x08)
	struct F*8e32972a91 *e59b1c2f74; // 0x438(0x28)
	enum class *43fe99eba5 *767422e5bf; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	float *675c29da44; // 0x464(0x04)
	float *babdc07e50; // 0x468(0x04)
	bool *14c825d63e; // 0x46c(0x01)
	bool *b7af1ca573; // 0x46d(0x01)
	bool *2a868307fb; // 0x46e(0x01)
	char pad_46F[0x1]; // 0x46f(0x01)

	void OnUpdatePlatoonCarePackageState(); // Function TslGame.*bbc498abf3.OnUpdatePlatoonCarePackageState // Final|Native|Public|HasOutParms // @ game+0x59c3028
	void OnUpdatePlatoonFireSupportState(); // Function TslGame.*bbc498abf3.OnUpdatePlatoonFireSupportState // Final|Native|Public|HasOutParms // @ game+0x59c30dc
	void OnButtonClicked(); // Function TslGame.*bbc498abf3.OnButtonClicked // Final|Native|Public // @ game+0x59bd514
	void BP_UpdateCommandType(); // Function TslGame.*bbc498abf3.BP_UpdateCommandType // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22ddc4
	void OnMatchStateChanged(); // Function TslGame.*bbc498abf3.OnMatchStateChanged // Final|Native|Public // @ game+0x59bf7d8
	void BP_UpdateEnablity(); // Function TslGame.*bbc498abf3.BP_UpdateEnablity // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void BP_UpdateProgress(); // Function TslGame.*bbc498abf3.BP_UpdateProgress // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void BP_UpdateHighlight(); // Function TslGame.*bbc498abf3.BP_UpdateHighlight // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void BP_UpdateClickability(); // Function TslGame.*bbc498abf3.BP_UpdateClickability // Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.TslPlatoonCommandWidget
// Size: 0x490 (Inherited: 0x418)
struct UTslPlatoonCommandWidget : U*17234a7c9b {
	struct UClass* *ecc873eebe; // 0x418(0x08)
	struct U*0922458349* *3464d1e496; // 0x420(0x08)
	struct U*c1ef4cc603* ButtonPanel; // 0x428(0x08)
	bool *135fa2ac62; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct TMap<enum class *43fe99eba5, struct U*bbc498abf3*> *b92412910d; // 0x438(0x50)
	struct U*bbc498abf3* *758ae1a752; // 0x488(0x08)

	void UpdateButtonsByManifest(); // Function TslGame.TslPlatoonCommandWidget.UpdateButtonsByManifest // Final|Native|Public|HasOutParms // @ game+0x59cd028
};

// Class TslGame.*34e5d20d5a
// Size: 0x420 (Inherited: 0x418)
struct U*34e5d20d5a : U*17234a7c9b {
	struct UTextBlock* BindTextDescription; // 0x418(0x08)
};

// Class TslGame.*ec819bcf04
// Size: 0x500 (Inherited: 0x418)
struct U*ec819bcf04 : U*17234a7c9b {
	struct UBorder* BindBorderNumberBg; // 0x418(0x08)
	struct UTextBlock* BindTextNumber; // 0x420(0x08)
	struct U*bde5e52cf2* BindWidgetPubgId; // 0x428(0x08)
	struct UWidget* BindWidgetDisable; // 0x430(0x08)
	struct UTextBlock* BindTextDisableText; // 0x438(0x08)
	struct UWidget* BindWidgetSelected; // 0x440(0x08)
	char pad_448[0xb8]; // 0x448(0xb8)
};

// Class TslGame.*32ba64381d
// Size: 0x500 (Inherited: 0x500)
struct U*32ba64381d : U*ec819bcf04 {
};

// Class TslGame.*6f3e8c8bdf
// Size: 0x500 (Inherited: 0x500)
struct U*6f3e8c8bdf : U*ec819bcf04 {
};

// Class TslGame.*c4bf206c76
// Size: 0x468 (Inherited: 0x418)
struct U*c4bf206c76 : U*17234a7c9b {
	float *de6e50ee5a; // 0x418(0x04)
	char pad_41C[0xc]; // 0x41c(0x0c)
	struct F*e9e2558d2e FadeInAnimation_Binder; // 0x428(0x20)
	struct F*e9e2558d2e FadeOutAnimation_Binder; // 0x448(0x20)
};

// Class TslGame.*c50c9c82ea
// Size: 0x4d0 (Inherited: 0x418)
struct U*c50c9c82ea : U*17234a7c9b {
	struct F*e9e2558d2e CountDownAnim_Ready; // 0x418(0x20)
	struct F*e9e2558d2e CountDownAnim_4; // 0x438(0x20)
	struct F*e9e2558d2e CountDownAnim_3; // 0x458(0x20)
	struct F*e9e2558d2e CountDownAnim_2; // 0x478(0x20)
	struct F*e9e2558d2e CountDownAnim_Go; // 0x498(0x20)
	struct UAkAudioEvent* *31895d3fa5; // 0x4b8(0x08)
	struct UAkAudioEvent* *7cf0ed86a8; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void CountAnimPlay(); // Function TslGame.*c50c9c82ea.CountAnimPlay // Final|Native|Protected // @ game+0x59b86a0
};

// Class TslGame.*2ea2d011d2
// Size: 0x460 (Inherited: 0x418)
struct U*2ea2d011d2 : U*17234a7c9b {
	struct F*f4f57b85a2 *c25a64039b; // 0x418(0x20)
	struct F*d3069d51ff *8178bdfe20; // 0x438(0x28)
};

// Class TslGame.*bb7bfcca66
// Size: 0x4d0 (Inherited: 0x460)
struct U*bb7bfcca66 : U*2ea2d011d2 {
	struct F*c233adf9bd UserPlatformImageWidget; // 0x460(0x20)
	struct F*f4f57b85a2 *fdb9ee0daa; // 0x480(0x20)
	struct F*f4f57b85a2 *a6ebdb8930; // 0x4a0(0x20)
	struct FString *ee17183a2b; // 0x4c0(0x10)

	void SetUserRankingInformation(); // Function TslGame.*bb7bfcca66.SetUserRankingInformation // Final|Native|Public|BlueprintCallable // @ game+0x59cb95c
};

// Class TslGame.*237b569505
// Size: 0x4d8 (Inherited: 0x418)
struct U*237b569505 : U*17234a7c9b {
	struct TArray<struct U*bb7bfcca66*> *a4af89efdd; // 0x418(0x10)
	struct UClass* *e2036c1232; // 0x428(0x08)
	struct F*8e32972a91 *290c81e22c; // 0x430(0x28)
	struct F*8e32972a91 *0cdc8f98f4; // 0x458(0x28)
	struct F*f4f57b85a2 *4ad7162f5c; // 0x480(0x20)
	struct F*f4f57b85a2 *761d82e309; // 0x4a0(0x20)
	int32 *e951b8a9da; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct ATslRacingPlayerState* *cc98a4089b; // 0x4c8(0x08)
	char pad_4D0[0x8]; // 0x4d0(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*237b569505.OnUpdateViewTarget // Final|Native|Public // @ game+0x59c3270
	void UpdateRankingList(); // Function TslGame.*237b569505.UpdateRankingList // Final|Native|Public|BlueprintCallable // @ game+0x59cda94
};

// Class TslGame.*5a79bab822
// Size: 0x4f8 (Inherited: 0x418)
struct U*5a79bab822 : U*17234a7c9b {
	struct F*f4f57b85a2 *c31e45ab0e; // 0x418(0x20)
	struct F*f4f57b85a2 *bdc0b7c11f; // 0x438(0x20)
	struct F*f4f57b85a2 *90eae8d67f; // 0x458(0x20)
	char pad_478[0x8]; // 0x478(0x08)
	struct F*d3069d51ff *0cf99a5296; // 0x480(0x28)
	int32 *9d32d18982; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)
	struct F*e9e2558d2e CheckPointReachAnim; // 0x4b0(0x20)
	struct F*f0cac2bec7 *e1adf65414; // 0x4d0(0x28)
};

// Class TslGame.*eefe68e6b3
// Size: 0x560 (Inherited: 0x418)
struct U*eefe68e6b3 : U*17234a7c9b {
	char pad_418[0x8]; // 0x418(0x08)
	struct FName *a0bf511087; // 0x420(0x08)
	struct UMaterialInstance* *72f48cee4c; // 0x428(0x08)
	float *52457b1462; // 0x430(0x04)
	float *f52da06002; // 0x434(0x04)
	struct F*959656208f *50674f70e9; // 0x438(0x30)
	struct UHorizontalBox* HighlightBgHorizontalBox; // 0x468(0x08)
	struct UBorder* HighlightBGBorder; // 0x470(0x08)
	struct UImage* HighlightBgImage; // 0x478(0x08)
	struct UTslRichTextBlock* RichTextBlock; // 0x480(0x08)
	struct UImage* Img_MsgFromOutgameIcon; // 0x488(0x08)
	struct UImage* Img_FocusBg; // 0x490(0x08)
	struct UImage* Img_FocusLine; // 0x498(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x4a0(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x4a8(0x08)
	struct U*6b11b3bf02* HighlightAnim; // 0x4b0(0x08)
	struct U*6b11b3bf02* Anim_MsgFromOutgameIconAppear; // 0x4b8(0x08)
	struct FLinearColor *082e550850; // 0x4c0(0x10)
	struct FSlateFontInfo *76ee35d15c; // 0x4d0(0x68)
	struct U*bfbc16799c* *8c46e66bbf; // 0x538(0x08)
	char pad_540[0x20]; // 0x540(0x20)

	void *904d26a7d2(); // Function TslGame.*eefe68e6b3.*904d26a7d2 // Final|Native|Public // @ game+0x59be448
	void *c5804c96f5(); // Function TslGame.*eefe68e6b3.*c5804c96f5 // Final|Native|Public // @ game+0x59be434
};

// Class TslGame.*d6fbd75522
// Size: 0x4e8 (Inherited: 0x418)
struct U*d6fbd75522 : U*17234a7c9b {
	struct F*d3069d51ff *524b8a9502; // 0x418(0x28)
	struct F*c69f8ed24a *b6a8025912; // 0x440(0x28)
	struct F*c69f8ed24a *2de9a8e607; // 0x468(0x28)
	struct TMap<enum class ERankType, struct F*b57bfafecc> *8b56ec83ce; // 0x490(0x50)
	char pad_4E0[0x8]; // 0x4e0(0x08)

	void SetRankEmblemFromRankType(); // Function TslGame.*d6fbd75522.SetRankEmblemFromRankType // Final|Native|Public|BlueprintCallable // @ game+0x59cb1dc
};

// Class TslGame.*0f3a9185b8
// Size: 0x418 (Inherited: 0x418)
struct U*0f3a9185b8 : U*17234a7c9b {

	void ExportRecoilData(); // Function TslGame.*0f3a9185b8.ExportRecoilData // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x59b9480
};

// Class TslGame.TslRedeployDebugWidget
// Size: 0x4b8 (Inherited: 0x418)
struct UTslRedeployDebugWidget : U*17234a7c9b {
	struct UTextBlock* MatchState_ElapsedTimeText; // 0x418(0x08)
	struct UTextBlock* GameState_GatherPhaseText; // 0x420(0x08)
	struct UTextBlock* GameState_FightPhaseText; // 0x428(0x08)
	struct UTextBlock* GameState_MaxPhaseText; // 0x430(0x08)
	struct UTextBlock* GameState_EnableText; // 0x438(0x08)
	struct UTextBlock* GameState_FightingText; // 0x440(0x08)
	struct UTextBlock* GameState_GatherStartText; // 0x448(0x08)
	struct UTextBlock* GameState_GatherEndText; // 0x450(0x08)
	struct UTextBlock* GameState_ReviveText; // 0x458(0x08)
	struct UTextBlock* GameState_FightStartText; // 0x460(0x08)
	struct UTextBlock* GameState_FightEndText; // 0x468(0x08)
	struct UTextBlock* GameState_RedeployText; // 0x470(0x08)
	struct UTextBlock* PlayerState_TargetFightPhaseText; // 0x478(0x08)
	struct UTextBlock* PlayerState_TargetReviveText; // 0x480(0x08)
	struct UTextBlock* PlayerState_CurrentStateText; // 0x488(0x08)
	struct UTextBlock* PlayerState_PreviousStateText; // 0x490(0x08)
	struct UTextBlock* RedeployComp_HideLoadingScreenTimerText; // 0x498(0x08)
	struct UTextBlock* RedeployComp_RedeployAlarmTimerText; // 0x4a0(0x08)
	struct UTextBlock* RedeployComp_RedeployTimerText; // 0x4a8(0x08)
	enum class ETslRedeployPlayerState CurrentState; // 0x4b0(0x01)
	enum class ETslRedeployPlayerState *16cfb80f58; // 0x4b1(0x01)
	char pad_4B2[0x6]; // 0x4b2(0x06)
};

// Class TslGame.*5bb182cfda
// Size: 0x468 (Inherited: 0x418)
struct U*5bb182cfda : U*17234a7c9b {
	struct TArray<struct U*815d2345a4*> *51cc2ba959; // 0x418(0x10)
	float *9ff4063150; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UImage* ArrowImage; // 0x430(0x08)
	struct UImage* RunningManImage; // 0x438(0x08)
	struct UImage* BarImage; // 0x440(0x08)
	struct UHorizontalBox* DotsHorizontalBox; // 0x448(0x08)
	struct UTextBlock* DescriptionText; // 0x450(0x08)
	struct UMaterialInstanceDynamic* *adadaab278; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)
};

// Class TslGame.*54455f6bf3
// Size: 0x4b0 (Inherited: 0x418)
struct U*54455f6bf3 : U*17234a7c9b {
	struct F*f123c875f4 *00072dff44; // 0x418(0x40)
	struct F*f123c875f4 *29cc77e14f; // 0x458(0x40)
	struct UVerticalBox* VerticalBox; // 0x498(0x08)
	struct U*6b97f3293f* *674edb3615; // 0x4a0(0x08)
	struct U*5bb182cfda* *1c88a76f42; // 0x4a8(0x08)
};

// Class TslGame.*6b97f3293f
// Size: 0x438 (Inherited: 0x418)
struct U*6b97f3293f : U*17234a7c9b {
	struct UHorizontalBox* TimerHorBox; // 0x418(0x08)
	struct UImage* Icon; // 0x420(0x08)
	struct UTextBlock* TimeText; // 0x428(0x08)
	struct ATslGameState* GameState; // 0x430(0x08)
};

// Class TslGame.TslReloadingGuideWidget
// Size: 0x510 (Inherited: 0x418)
struct UTslReloadingGuideWidget : U*17234a7c9b {
	struct F*9c84e0ea54 *84e0671228; // 0x418(0x08)
	struct F*959656208f *7cf12e1e90; // 0x420(0x30)
	struct U*4175584972* MultipleKeyIconWidget; // 0x450(0x08)
	struct F*e9e2558d2e *a98920866d; // 0x458(0x20)
	struct FName *137e139446; // 0x478(0x08)
	struct FText *e3f53d4a78; // 0x480(0x18)
	struct FText *0f61a473be; // 0x498(0x18)
	struct FText *8243eb5614; // 0x4b0(0x18)
	char pad_4C8[0x48]; // 0x4c8(0x48)

	void OnNotifyGroggy(); // Function TslGame.TslReloadingGuideWidget.OnNotifyGroggy // Final|Native|Private // @ game+0x59c05f0
	void UpdatePropertiesFromKeyBinding(); // Function TslGame.TslReloadingGuideWidget.UpdatePropertiesFromKeyBinding // Final|Native|Private // @ game+0x59cd958
	void OnInteractionWidgetEnabled(); // Function TslGame.TslReloadingGuideWidget.OnInteractionWidgetEnabled // Final|Native|Private // @ game+0x6f4c78
	void OnCharacterVault(); // Function TslGame.TslReloadingGuideWidget.OnCharacterVault // Final|Native|Private // @ game+0x59bdb94
	void OnCharacterDeath(); // Function TslGame.TslReloadingGuideWidget.OnCharacterDeath // Final|Native|Private // @ game+0x59bdb08
	void *bc4bd06424(); // Function TslGame.TslReloadingGuideWidget.*bc4bd06424 // Final|Native|Public|Const // @ game+0x59b65f4
	void OnReloadPadInput(); // Function TslGame.TslReloadingGuideWidget.OnReloadPadInput // Final|Native|Private // @ game+0xc3dd48
};

// Class TslGame.*84dbe7e5b9
// Size: 0x428 (Inherited: 0x418)
struct U*84dbe7e5b9 : U*17234a7c9b {
	struct U*bde5e52cf2* PubgIdWidget; // 0x418(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x420(0x08)

	void RefreshPubgIdBySpectator(); // Function TslGame.*84dbe7e5b9.RefreshPubgIdBySpectator // Final|Native|Protected // @ game+0x59c4c90
};

// Class TslGame.TslRichTextBlock
// Size: 0x648 (Inherited: 0x418)
struct UTslRichTextBlock : U*17234a7c9b {
	struct FText *01a6ca3f58; // 0x418(0x18)
	struct TMap<struct FString, struct F*c9e2b1ab63> *8e50c50ae0; // 0x430(0x50)
	struct FSlateFontInfo FontInfo; // 0x480(0x68)
	struct FSlateColor *157cdf2db7; // 0x4e8(0x28)
	struct FVector2D *ade98149bb; // 0x510(0x08)
	struct FLinearColor *e478c399e9; // 0x518(0x10)
	float *ea7bf7ca07; // 0x528(0x04)
	bool *2fd67b022c; // 0x52c(0x01)
	char pad_52D[0x3]; // 0x52d(0x03)
	float *4455cdaf73; // 0x530(0x04)
	enum class *00a79681fd *046e69ae98; // 0x534(0x01)
	bool *f8a3653053; // 0x535(0x01)
	char pad_536[0x1]; // 0x536(0x01)
	enum class EVerticalAlignment *0fc375487e; // 0x537(0x01)
	struct FSlateChildSize *d982d6a72d; // 0x538(0x08)
	float *88161e7aa0; // 0x540(0x04)
	struct FSlateChildSize *7dba0f7357; // 0x544(0x08)
	struct FVector2D *789452384a; // 0x54c(0x08)
	char pad_554[0x4]; // 0x554(0x04)
	struct UVerticalBox* MainVerticalBox; // 0x558(0x08)
	struct TArray<struct USpacer*> *80ea26efc5; // 0x560(0x10)
	struct TArray<struct UHorizontalBox*> *3af6a8f73d; // 0x570(0x10)
	struct TArray<struct UTextBlock*> *c46cc41cc4; // 0x580(0x10)
	struct TArray<struct UImage*> *118aacda04; // 0x590(0x10)
	struct TArray<struct USizeBox*> *84d3db8af9; // 0x5a0(0x10)
	struct TArray<struct UOverlay*> *39ca65b51b; // 0x5b0(0x10)
	struct UHorizontalBox* *6d2a215226; // 0x5c0(0x08)
	char pad_5C8[0x10]; // 0x5c8(0x10)
	struct UClass* KeyIconWidgetClass; // 0x5d8(0x08)
	char pad_5E0[0x18]; // 0x5e0(0x18)
	struct TMap<struct FName, struct F*68031af743> *8413ec12cf; // 0x5f8(0x50)

	void UpdateText(); // Function TslGame.TslRichTextBlock.UpdateText // Final|Native|Public|BlueprintCallable // @ game+0x59cdcec
};

// Class TslGame.*00685a4b01
// Size: 0x430 (Inherited: 0x418)
struct U*00685a4b01 : U*17234a7c9b {
	struct UWidgetSwitcher* SlotWidgetSwitcher; // 0x418(0x08)
	struct U*6b11b3bf02* Anim_Start; // 0x420(0x08)
	enum class ERoundEndPointType *0697609f76; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
};

// Class TslGame.*b41f3999ef
// Size: 0x4b8 (Inherited: 0x418)
struct U*b41f3999ef : U*17234a7c9b {
	struct UClass* RoundEndPointClass; // 0x418(0x08)
	float PointWidgetAnimDelayTime; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct FString *f112d8bd00; // 0x428(0x10)
	struct FString *e3ec5833e6; // 0x438(0x10)
	struct FString *741fd66f0b; // 0x448(0x10)
	struct FString *e89ed26fb6; // 0x458(0x10)
	struct FString *1a27da00e1; // 0x468(0x10)
	struct FString *3aeee55464; // 0x478(0x10)
	struct FString *a956b8c815; // 0x488(0x10)
	struct UStringTable* ST_RoundSystem; // 0x498(0x08)
	char pad_4A0[0x18]; // 0x4a0(0x18)

	void *8e0a56a149(); // Function TslGame.*b41f3999ef.*8e0a56a149 // Native|Protected // @ game+0x59c3d80
	void *3bc25a0c52(); // Function TslGame.*b41f3999ef.*3bc25a0c52 // Final|Native|Protected // @ game+0x59c481c
};

// Class TslGame.*6a9aba36d4
// Size: 0x4f0 (Inherited: 0x4b8)
struct U*6a9aba36d4 : U*b41f3999ef {
	struct UTextBlock* MatchEndText; // 0x4b8(0x08)
	struct UTextBlock* MatchResultText; // 0x4c0(0x08)
	struct UTextBlock* ObserverTeamName; // 0x4c8(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4d0(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4d8(0x08)
	struct U*6b11b3bf02* Victory_Anim; // 0x4e0(0x08)
	struct U*6b11b3bf02* Defeat_Anim; // 0x4e8(0x08)
};

// Class TslGame.*9eeafe83c9
// Size: 0x5b8 (Inherited: 0x4b8)
struct U*9eeafe83c9 : U*b41f3999ef {
	struct UTextBlock* CurrentRoundText; // 0x4b8(0x08)
	struct UTextBlock* CurrentRoundResultText; // 0x4c0(0x08)
	struct UTextBlock* CurrentRoundScoreText; // 0x4c8(0x08)
	struct UTextBlock* YourTeamText; // 0x4d0(0x08)
	struct UTextBlock* EnemyTeamText; // 0x4d8(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4e0(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4e8(0x08)
	struct U*7f757909f6* YourTeamPlatformIcon; // 0x4f0(0x08)
	struct U*7f757909f6* EnemyTeamPlatformIcon; // 0x4f8(0x08)
	struct UHorizontalBox* RoundPointHorizontalBox; // 0x500(0x08)
	struct TArray<struct U*00685a4b01*> *8d53587d0e; // 0x508(0x10)
	struct U*6b11b3bf02* WinEffectAnim; // 0x518(0x08)
	struct U*6b11b3bf02* LossEffectAnim; // 0x520(0x08)
	struct U*6b11b3bf02* DrawEffectAnim; // 0x528(0x08)
	struct F*eaae7901d4 NormalRoundPanel; // 0x530(0x20)
	struct F*eaae7901d4 ZombieDefensePanel; // 0x550(0x20)
	struct F*f4f57b85a2 RoundText; // 0x570(0x20)
	struct UStringTable* ZombieDefenseTable; // 0x590(0x08)
	struct UAkAudioEvent* *2fbb784618; // 0x598(0x08)
	struct UAkAudioEvent* *612b1a3159; // 0x5a0(0x08)
	struct U*1ff393c1cd* PlayerWinningStreak; // 0x5a8(0x08)
	struct U*1ff393c1cd* EnemyWinningStreak; // 0x5b0(0x08)
};

// Class TslGame.*4dec0d5f61
// Size: 0x478 (Inherited: 0x418)
struct U*4dec0d5f61 : U*17234a7c9b {
	struct UTextBlock* RoundNumberText; // 0x418(0x08)
	struct U*6b11b3bf02* RoundStart_Anim; // 0x420(0x08)
	struct UTextBlock* RoundText; // 0x428(0x08)
	struct UStringTable* ZombieDefenseTable; // 0x430(0x08)
	char pad_438[0x40]; // 0x438(0x40)

	void *8e0a56a149(); // Function TslGame.*4dec0d5f61.*8e0a56a149 // Final|Native|Protected // @ game+0x59c3f88
};

// Class TslGame.*a00958ae09
// Size: 0x458 (Inherited: 0x418)
struct U*a00958ae09 : U*17234a7c9b {
	struct UHorizontalBox* YourTeamPointBox; // 0x418(0x08)
	struct UHorizontalBox* EnemyTeamPointBox; // 0x420(0x08)
	struct UClass* RoundEndPointClass; // 0x428(0x08)
	struct TArray<struct U*00685a4b01*> *32b124f272; // 0x430(0x10)
	struct TArray<struct U*00685a4b01*> *c27716e21d; // 0x440(0x10)
	char pad_450[0x8]; // 0x450(0x08)

	void OnMatchStateChanged(); // Function TslGame.*a00958ae09.OnMatchStateChanged // Final|Native|Protected // @ game+0xd6f78c
	void UpdatePointList(); // Function TslGame.*a00958ae09.UpdatePointList // Final|Native|Protected // @ game+0x59cd908
	void *8e0a56a149(); // Function TslGame.*a00958ae09.*8e0a56a149 // Final|Native|Protected // @ game+0x59c418c
};

// Class TslGame.*9046b6fd8d
// Size: 0x420 (Inherited: 0x418)
struct U*9046b6fd8d : U*17234a7c9b {
	struct UWidgetSwitcher* KeyGuideSwitcher; // 0x418(0x08)
};

// Class TslGame.*2ee0f1ff92
// Size: 0x468 (Inherited: 0x418)
struct U*2ee0f1ff92 : U*17234a7c9b {
	char pad_418[0x10]; // 0x418(0x10)
	struct UTextBlock* TitleTextBlock; // 0x428(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x430(0x08)
	struct UClass* *4e948bf043; // 0x438(0x08)
	enum class ESandboxGroypType *81bbdcf16d; // 0x440(0x01)
	char pad_441[0x27]; // 0x441(0x27)
};

// Class TslGame.*946737677d
// Size: 0x470 (Inherited: 0x468)
struct U*946737677d : U*2ee0f1ff92 {
	bool *15ccf1f414; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
};

// Class TslGame.*546fa32acb
// Size: 0x470 (Inherited: 0x468)
struct U*546fa32acb : U*2ee0f1ff92 {
	struct UVerticalBox* RootVerticalBox; // 0x468(0x08)
};

// Class TslGame.*67726edb33
// Size: 0x470 (Inherited: 0x418)
struct U*67726edb33 : U*17234a7c9b {
	char pad_418[0x8]; // 0x418(0x08)
	bool *29f0d3ad02; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct UTextBlock* ItemTextBlock; // 0x428(0x08)
	struct U*0399764a34* ItemTextBlock_Flow; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
	struct FLinearColor *12fd9c3bc7; // 0x440(0x10)
	struct FLinearColor *7969c861ac; // 0x450(0x10)
	char pad_460[0x10]; // 0x460(0x10)
};

// Class TslGame.*f3292ffd90
// Size: 0x490 (Inherited: 0x470)
struct U*f3292ffd90 : U*67726edb33 {
	char pad_470[0x8]; // 0x470(0x08)
	struct UButton* ItemButton; // 0x478(0x08)
	struct UImage* Img_SelectOutLine; // 0x480(0x08)
	struct UImage* Img_SelectGradientBg; // 0x488(0x08)

	void OnHover_Button(); // Function TslGame.*f3292ffd90.OnHover_Button // Final|Native|Private // @ game+0x59bef18
	void OnUnhover_Button(); // Function TslGame.*f3292ffd90.OnUnhover_Button // Final|Native|Private // @ game+0x59c2e9c
	void OnClick_Button(); // Function TslGame.*f3292ffd90.OnClick_Button // Final|Native|Private // @ game+0x59bdba8
};

// Class TslGame.*168bb6e318
// Size: 0x4a0 (Inherited: 0x490)
struct U*168bb6e318 : U*f3292ffd90 {
	enum class ESandboxSpecialButtonType *fb89bc0044; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)
	struct UImage* ItemIcon_Image; // 0x498(0x08)
};

// Class TslGame.*7c08049d05
// Size: 0x4d8 (Inherited: 0x490)
struct U*7c08049d05 : U*f3292ffd90 {
	struct UClass* *4e948bf043; // 0x490(0x08)
	struct UBorder* ItemBorder; // 0x498(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x4a0(0x08)
	struct UWidgetSwitcher* ExpandSwitcher; // 0x4a8(0x08)
	char pad_4B0[0x28]; // 0x4b0(0x28)
};

// Class TslGame.*8da27f3b93
// Size: 0x4a0 (Inherited: 0x490)
struct U*8da27f3b93 : U*f3292ffd90 {
	struct UWidgetSwitcher* ItemWidgetSwitcher; // 0x490(0x08)
	enum class ESandboxPowerType *fa7b840ce4; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)

	void *18f710189d(); // Function TslGame.*8da27f3b93.*18f710189d // Final|Native|Private // @ game+0x59beb94
};

// Class TslGame.*4d40ea157d
// Size: 0x4b8 (Inherited: 0x470)
struct U*4d40ea157d : U*67726edb33 {
	char pad_470[0x8]; // 0x470(0x08)
	struct UImage* Img_SelectOutLine; // 0x478(0x08)
	struct UImage* Img_SelectGradientBg; // 0x480(0x08)
	struct FName ItemID; // 0x488(0x08)
	struct FText *0a7298ed37; // 0x490(0x18)
	char pad_4A8[0x8]; // 0x4a8(0x08)
	float *177b325cf5; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)
};

// Class TslGame.*3ad9ebe0b9
// Size: 0x4e8 (Inherited: 0x4b8)
struct U*3ad9ebe0b9 : U*4d40ea157d {
	struct UButton* ItemButton; // 0x4b8(0x08)
	struct UClass* *eb935de0c2; // 0x4c0(0x08)
	struct UItem* *0c03cda5ee; // 0x4c8(0x08)
	struct U*c766af2c23* *11e1405162; // 0x4d0(0x08)
	char pad_4D8[0x10]; // 0x4d8(0x10)

	void OnClicked_ItemButton(); // Function TslGame.*3ad9ebe0b9.OnClicked_ItemButton // Final|Native|Public // @ game+0x59bdc50
};

// Class TslGame.*8d0df6c5dc
// Size: 0x4d8 (Inherited: 0x4b8)
struct U*8d0df6c5dc : U*4d40ea157d {
	struct UBorder* ItemBorder; // 0x4b8(0x08)
	struct U*c6addfa12b* *c5d623a65e; // 0x4c0(0x08)
	char pad_4C8[0x10]; // 0x4c8(0x10)
};

// Class TslGame.*6d5c51ae3f
// Size: 0x4f8 (Inherited: 0x4d8)
struct U*6d5c51ae3f : U*8d0df6c5dc {
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct U*a276958e5c* SliderWidget; // 0x4e0(0x08)
	char pad_4E8[0x10]; // 0x4e8(0x10)
};

// Class TslGame.*5b34c8d236
// Size: 0x560 (Inherited: 0x4d8)
struct U*5b34c8d236 : U*8d0df6c5dc {
	char pad_4D8[0x78]; // 0x4d8(0x78)
	struct U*8f5d236427* StepperWidget; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)
};

// Class TslGame.*778ef3e4cb
// Size: 0x498 (Inherited: 0x470)
struct U*778ef3e4cb : U*67726edb33 {
	struct UTextBlock* CurNumberTextBlock; // 0x470(0x08)
	struct UTextBlock* MaxNumberTextBlock; // 0x478(0x08)
	struct UImage* SliderImage; // 0x480(0x08)
	enum class ESandboxQuantityType *f14a831a84; // 0x488(0x04)
	char pad_48C[0xc]; // 0x48c(0x0c)

	void *66d9166473(); // Function TslGame.*778ef3e4cb.*66d9166473 // Final|Native|Private // @ game+0x59c213c
};

// Class TslGame.*a4ae2a7d70
// Size: 0x418 (Inherited: 0x418)
struct U*a4ae2a7d70 : U*17234a7c9b {
};

// Class TslGame.*83aac0bdaf
// Size: 0x468 (Inherited: 0x418)
struct U*83aac0bdaf : U*17234a7c9b {
	struct TArray<struct UScreenIndicatorBaseWidget*> *eb6538eddb; // 0x418(0x10)
	struct UClass* *374bb7375a; // 0x428(0x08)
	struct F*f23e4e6c9e *333c4c00c5; // 0x430(0x28)
	char pad_458[0x10]; // 0x458(0x10)
};

// Class TslGame.*4f060e8de2
// Size: 0x4c8 (Inherited: 0x468)
struct U*4f060e8de2 : U*83aac0bdaf {
	struct TMap<struct FString, struct UCaptureObjectIndicatorWidget*> *205877f01d; // 0x468(0x50)
	struct TArray<struct ACaptureAreaActor*> *731f610630; // 0x4b8(0x10)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.*4f060e8de2.OnActivatedCaptureAreaUpdated // Final|Native|Protected|HasOutParms // @ game+0x59bcae4
};

// Class TslGame.*f51e379ce5
// Size: 0x478 (Inherited: 0x468)
struct U*f51e379ce5 : U*83aac0bdaf {
	struct TArray<struct U*ad41f2b83f*> *facf419e63; // 0x468(0x10)

	void SetSmokeIndicatorWidget(); // Function TslGame.*f51e379ce5.SetSmokeIndicatorWidget // Final|Native|Protected // @ game+0x59cb5f0
};

// Class TslGame.*e60b88f076
// Size: 0x470 (Inherited: 0x468)
struct U*e60b88f076 : U*83aac0bdaf {
	struct U*12e7062807* *a17825294c; // 0x468(0x08)
};

// Class TslGame.*107d56143b
// Size: 0x488 (Inherited: 0x468)
struct U*107d56143b : U*83aac0bdaf {
	struct TArray<struct U*09a973f12f*> *3a54243f0a; // 0x468(0x10)
	struct TArray<struct ATslCharacter*> *044ad6bc75; // 0x478(0x10)

	void AddDetectionHumans(); // Function TslGame.*107d56143b.AddDetectionHumans // Final|Native|Protected|HasOutParms // @ game+0x59b4fc4
};

// Class TslGame.*7d44972923
// Size: 0x480 (Inherited: 0x468)
struct U*7d44972923 : U*83aac0bdaf {
	char pad_468[0x18]; // 0x468(0x18)
};

// Class TslGame.*2e81ca5fca
// Size: 0x478 (Inherited: 0x468)
struct U*2e81ca5fca : U*83aac0bdaf {
	struct TArray<struct U*7e62be7364*> *9d512c833f; // 0x468(0x10)

	void *4cd8fd9118(); // Function TslGame.*2e81ca5fca.*4cd8fd9118 // Final|Native|Protected // @ game+0x59b508c
	void *ddf9eca1e4(); // Function TslGame.*2e81ca5fca.*ddf9eca1e4 // Final|Native|Protected // @ game+0x59b8730
};

// Class TslGame.*45675a1147
// Size: 0x490 (Inherited: 0x468)
struct U*45675a1147 : U*83aac0bdaf {
	struct UClass* *0e67549a89; // 0x468(0x08)
	struct TArray<struct UTeamMarkWidget*> *d0df02fd6a; // 0x470(0x10)
	struct U*c1ec15d465* *c1ec15d465; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)
};

// Class TslGame.*de1a9a2a1e
// Size: 0x458 (Inherited: 0x418)
struct U*de1a9a2a1e : U*17234a7c9b {
	struct UButton* ApplyButton; // 0x418(0x08)
	struct UWidgetSwitcher* MouseHoverSwitcher; // 0x420(0x08)
	struct UImage* ConsoleFocusImage; // 0x428(0x08)
	struct UImage* IconImage; // 0x430(0x08)
	struct UTextBlock* NameText; // 0x438(0x08)
	int32 *993e920d76; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct U*588043edf8* *7c278bc048; // 0x448(0x08)
	bool *028d517a1d; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class TslGame.*a7fec450db
// Size: 0x470 (Inherited: 0x458)
struct U*a7fec450db : U*de1a9a2a1e {
	struct U*6b11b3bf02* PressedPcAni; // 0x458(0x08)
	struct U*6b11b3bf02* PressedConsoleAni; // 0x460(0x08)
	struct FName *1bb52f298e; // 0x468(0x08)
};

// Class TslGame.*a276958e5c
// Size: 0x4d0 (Inherited: 0x418)
struct U*a276958e5c : U*17234a7c9b {
	char pad_418[0x78]; // 0x418(0x78)
	struct USlider* MainSlider; // 0x490(0x08)
	struct UEditableText* EditableValueText; // 0x498(0x08)
	struct UBorder* EditableTextBorder; // 0x4a0(0x08)
	char pad_4A8[0x28]; // 0x4a8(0x28)

	void HandleOnSliderValueChanged(); // Function TslGame.*a276958e5c.HandleOnSliderValueChanged // Final|Native|Private // @ game+0x59ba8c8
	void HandleOnTextValueChanged(); // Function TslGame.*a276958e5c.HandleOnTextValueChanged // Final|Native|Private|HasOutParms // @ game+0x59ba960
};

// Class TslGame.*55013c6405
// Size: 0x440 (Inherited: 0x418)
struct U*55013c6405 : U*17234a7c9b {
	char pad_418[0x28]; // 0x418(0x28)

	void OnSelected(); // Function TslGame.*55013c6405.OnSelected // Final|Native|Private // @ game+0x59bef18
};

// Class TslGame.TDMSpawnKitItemWidget
// Size: 0x4a8 (Inherited: 0x440)
struct UTDMSpawnKitItemWidget : U*55013c6405 {
	struct UWidgetSwitcher* SpawnKitButtonSwitcher; // 0x440(0x08)
	struct UButton* SpawnKitButtonDefaultButton; // 0x448(0x08)
	struct UButton* SpawnKitButtonSelectButton; // 0x450(0x08)
	struct UImage* DefaultSpawnKitWeaponIcon; // 0x458(0x08)
	struct UImage* SelectSpawnKitWeaponIcon; // 0x460(0x08)
	struct UTextBlock* DefaultSpawnKitName; // 0x468(0x08)
	struct UTextBlock* SelectSpawnKitName; // 0x470(0x08)
	struct UBorder* DefaultBorder; // 0x478(0x08)
	struct FLinearColor *97b7459e20; // 0x480(0x10)
	struct FLinearColor *0d54f39843; // 0x490(0x10)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void OnSelected(); // Function TslGame.TDMSpawnKitItemWidget.OnSelected // Native|Protected // @ game+0x59bef18
	void OnAsyncLoadIconFinished(); // Function TslGame.TDMSpawnKitItemWidget.OnAsyncLoadIconFinished // Final|Native|Private // @ game+0x59bce9c
};

// Class TslGame.TslSpawnKitItemWidget
// Size: 0x4b8 (Inherited: 0x440)
struct UTslSpawnKitItemWidget : U*55013c6405 {
	char pad_440[0x20]; // 0x440(0x20)
	struct UButton* ButtonForSelector; // 0x460(0x08)
	struct UTextBlock* TextBlockForTitle; // 0x468(0x08)
	struct UBorder* ButtonBorder; // 0x470(0x08)
	struct UWidget* CheckMarkSizeBox; // 0x478(0x08)
	struct UWidget* ButtonForSelectorFocus; // 0x480(0x08)
	struct FLinearColor *e0dca5cef1; // 0x488(0x10)
	struct FLinearColor *12c561f86a; // 0x498(0x10)
	struct FLinearColor *89025cadec; // 0x4a8(0x10)

	void OnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnHovered // Final|Native|Private // @ game+0x59bef30
	void OnUnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnUnHovered // Final|Native|Private // @ game+0x59c2e54
	void OnSelected(); // Function TslGame.TslSpawnKitItemWidget.OnSelected // Final|Native|Private // @ game+0x59bef18
};

// Class TslGame.*b731e2cfce
// Size: 0x428 (Inherited: 0x418)
struct U*b731e2cfce : U*17234a7c9b {
	struct U*bde5e52cf2* PubgIdWidget; // 0x418(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x420(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*b731e2cfce.OnUpdateViewTarget // Final|Native|Public // @ game+0x59c32fc
};

// Class TslGame.*37bcacb837
// Size: 0x440 (Inherited: 0x418)
struct U*37bcacb837 : U*17234a7c9b {
	struct F*b9afef7a3a *7616498344; // 0x418(0x28)

	void UpdateDesign_Normal(); // Function TslGame.*37bcacb837.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void UpdateDesign_Selected(); // Function TslGame.*37bcacb837.UpdateDesign_Selected // Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*405ca825a1
// Size: 0x460 (Inherited: 0x418)
struct U*405ca825a1 : U*17234a7c9b {
	float *8be79bb7b9; // 0x418(0x04)
	int32 *ba235b2674; // 0x41c(0x04)
	int32 *d57e4d2bc3; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct TArray<struct U*37bcacb837*> *a5f91f2b70; // 0x428(0x10)
	struct UClass* *834a9d4391; // 0x438(0x08)
	struct F*7f3debddd2 *0238dd1706; // 0x440(0x20)
};

// Class TslGame.*7c63a9789e
// Size: 0x480 (Inherited: 0x418)
struct U*7c63a9789e : U*17234a7c9b {
	struct FMulticastDelegate OnClickedTabButtonWidget; // 0x418(0x10)
	struct FString TitleKeyString; // 0x428(0x10)
	struct FText TitleText; // 0x438(0x18)
	struct UTextBlock* TitleNormal; // 0x450(0x08)
	struct UTextBlock* TitleSelected; // 0x458(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x460(0x08)
	struct UButton* OutsideButton; // 0x468(0x08)
	struct UImage* NotificationImage; // 0x470(0x08)
	bool bTurnOffNotificationIfClicked; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)

	void OnClicked(); // Function TslGame.*7c63a9789e.OnClicked // Native|Public // @ game+0x59bdba8
};

// Class TslGame.*cd61048c73
// Size: 0x490 (Inherited: 0x480)
struct U*cd61048c73 : U*7c63a9789e {
	char pad_480[0x10]; // 0x480(0x10)

	void OnNewCraftableItemAdded(); // Function TslGame.*cd61048c73.OnNewCraftableItemAdded // Final|Native|Private // @ game+0x59c05dc
	void OnCraftableItemRemoved(); // Function TslGame.*cd61048c73.OnCraftableItemRemoved // Final|Native|Private // @ game+0x59bdecc
	void OnViewTargetUpdated(); // Function TslGame.*cd61048c73.OnViewTargetUpdated // Final|Native|Private // @ game+0x59c3954
};

// Class TslGame.*f40a5ea5a7
// Size: 0x448 (Inherited: 0x418)
struct U*f40a5ea5a7 : U*17234a7c9b {
	struct FMulticastDelegate OnTabGroupUpdated; // 0x418(0x10)
	struct TArray<struct U*7c63a9789e*> *acddc294df; // 0x428(0x10)
	struct UWidget* TabHorizontalBox; // 0x438(0x08)
	char pad_440[0x8]; // 0x440(0x08)

	void UpdateIndexToBP(); // Function TslGame.*f40a5ea5a7.UpdateIndexToBP // Final|Native|Public|BlueprintCallable // @ game+0x59cd518
	void UpdateCurrentIndex(); // Function TslGame.*f40a5ea5a7.UpdateCurrentIndex // Final|Native|Public|BlueprintCallable // @ game+0x59cd334
	void ResetTabGroup(); // Function TslGame.*f40a5ea5a7.ResetTabGroup // Final|Native|Public|BlueprintCallable // @ game+0x59c527c
	void UpdateIndexTo(); // Function TslGame.*f40a5ea5a7.UpdateIndexTo // Final|Native|Public // @ game+0x59cd518
};

// Class TslGame.*8ad6576fd3
// Size: 0x508 (Inherited: 0x418)
struct U*8ad6576fd3 : U*17234a7c9b {
	DelegateProperty *63501e5574; // 0x418(0x10)
	struct FText TitleText; // 0x428(0x18)
	struct FString TitleKeyString; // 0x440(0x10)
	struct F*f4f57b85a2 *304d6a466d; // 0x450(0x20)
	struct F*f4f57b85a2 *bbc6108f92; // 0x470(0x20)
	struct F*b9afef7a3a *7616498344; // 0x490(0x28)
	struct F*7f3debddd2 *a1564ac60a; // 0x4b8(0x20)
	struct F*d3069d51ff *b1a5557fc5; // 0x4d8(0x28)
	char pad_500[0x8]; // 0x500(0x08)

	void OnClicked(); // Function TslGame.*8ad6576fd3.OnClicked // Final|Native|Public // @ game+0x59bdbc0
	void UpdateTitleText(); // Function TslGame.*8ad6576fd3.UpdateTitleText // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x59cdd00
	void UpdateDesign_Selected(); // Function TslGame.*8ad6576fd3.UpdateDesign_Selected // Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*8e3e737c04
// Size: 0x810 (Inherited: 0x418)
struct U*8e3e737c04 : U*17234a7c9b {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*8e32972a91 *2c113badb0; // 0x420(0x28)
	struct F*959656208f *1ed0bd479d; // 0x448(0x30)
	struct F*b9afef7a3a *0294d0bb97; // 0x478(0x28)
	struct F*c69f8ed24a *9051b1fc28; // 0x4a0(0x28)
	struct F*e9e2558d2e *855a1a79f1; // 0x4c8(0x20)
	struct F*e9e2558d2e *d70b087c0f; // 0x4e8(0x20)
	struct F*c233adf9bd *b0d6bb393d; // 0x508(0x20)
	struct F*fd985b6c41 *fd985b6c41; // 0x528(0x10)
	struct UWidgetSwitcher* PlayerStateIconsSwitcher; // 0x538(0x08)
	struct UTextBlock* PlayerNameText; // 0x540(0x08)
	struct UWidgetSwitcher* PlayerColorSwitcher; // 0x548(0x08)
	struct UWidgetSwitcher* PlayerIconNumberSwitcher; // 0x550(0x08)
	struct UImage* MarkerImage; // 0x558(0x08)
	struct UImage* PlayerBoostGaugeImage; // 0x560(0x08)
	struct UTextBlock* FollowNumTxt; // 0x568(0x08)
	struct UImage* FollowArrowImg; // 0x570(0x08)
	struct UImage* IconItemRequest; // 0x578(0x08)
	struct UImage* IconSpecificModeImage; // 0x580(0x08)
	char pad_588[0x8]; // 0x588(0x08)
	struct F*b9afef7a3a *ffc0a347b3; // 0x590(0x28)
	float *ae3ecefa56; // 0x5b8(0x04)
	float *bf5a1eab71; // 0x5bc(0x04)
	struct F*959656208f *efbe13be1c; // 0x5c0(0x30)
	struct F*f4f57b85a2 *238d5c553f; // 0x5f0(0x20)
	struct F*c233adf9bd *8ae71cae91; // 0x610(0x20)
	struct F*c69f8ed24a *29dfb3a2b9; // 0x630(0x28)
	struct F*b9afef7a3a *7e44993ad9; // 0x658(0x28)
	struct F*7f3debddd2 *0634a85240; // 0x680(0x20)
	struct F*b9afef7a3a *1b9726d94d; // 0x6a0(0x28)
	struct F*b9afef7a3a *f07e579b17; // 0x6c8(0x28)
	struct F*7f3debddd2 *57baa3765c; // 0x6f0(0x20)
	struct ATeam* Team; // 0x710(0x08)
	struct FLinearColor *acda625090; // 0x718(0x10)
	struct TArray<struct UTexture2D*> *b043984d4a; // 0x728(0x10)
	struct UTexture2D* *a7bb75ab40; // 0x738(0x08)
	struct F*d3069d51ff *0aa81400f6; // 0x740(0x28)
	struct UTextBlock* ComeBackWarRemainText; // 0x768(0x08)
	struct UTextBlock* BindTextComebackTime; // 0x770(0x08)
	struct UBorder* PlayerStateIconsBorder; // 0x778(0x08)
	struct UBorder* PlayerInfoBorder; // 0x780(0x08)
	struct UBorder* PlayerGaugeBorder; // 0x788(0x08)
	struct UBorder* TeamFollowBorder; // 0x790(0x08)
	struct UBorder* TeamVoiceBorder; // 0x798(0x08)
	struct UTexture2D* *4a2a27528a; // 0x7a0(0x08)
	struct UTexture2D* *dfcefd74c4; // 0x7a8(0x08)
	struct ATslCharacter* *855403ca25; // 0x7b0(0x08)
	char pad_7B8[0x10]; // 0x7b8(0x10)
	float *87c33c9323; // 0x7c8(0x04)
	bool *5f72e045aa; // 0x7cc(0x01)
	char pad_7CD[0x1]; // 0x7cd(0x01)
	bool *ba1113418e; // 0x7ce(0x01)
	char pad_7CF[0x41]; // 0x7cf(0x41)

	void *36a4cb28ae(); // Function TslGame.*8e3e737c04.*36a4cb28ae // Final|Native|Private // @ game+0x59b6088
	void *452f883e28(); // Function TslGame.*8e3e737c04.*452f883e28 // Final|Native|Private // @ game+0x59c516c
	void OnParticipantMuteChanged(); // Function TslGame.*8e3e737c04.OnParticipantMuteChanged // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *6d74ea3716(); // Function TslGame.*8e3e737c04.*6d74ea3716 // Final|Native|Private // @ game+0x59cdcd8
	void OnNativeParticipantMuteChanged(); // Function TslGame.*8e3e737c04.OnNativeParticipantMuteChanged // Final|Native|Private // @ game+0x59c0324
	void *09ad38e707(); // Function TslGame.*8e3e737c04.*09ad38e707 // Final|Native|Private // @ game+0x59cd8f4
	void OnLeaveTeamVoiceChannel(); // Function TslGame.*8e3e737c04.OnLeaveTeamVoiceChannel // Final|Native|Private // @ game+0x59bf260
	void OnNativeParticipantRestrictionChanged(); // Function TslGame.*8e3e737c04.OnNativeParticipantRestrictionChanged // Final|Native|Private // @ game+0x59c04bc
	void *56bf189255(); // Function TslGame.*8e3e737c04.*56bf189255 // Final|Native|Private // @ game+0x59cdcc4
	void *d2c9371cd5(); // Function TslGame.*8e3e737c04.*d2c9371cd5 // Final|Native|Public // @ game+0x59b9990
	void UpdateVoiceStatusOnly(); // Function TslGame.*8e3e737c04.UpdateVoiceStatusOnly // Final|Native|Private // @ game+0x53b4e4
	void NotifyEngageAttacked(); // Function TslGame.*8e3e737c04.NotifyEngageAttacked // Final|Native|Private // @ game+0x714418
	void *8963910f85(); // Function TslGame.*8e3e737c04.*8963910f85 // Final|Native|Private // @ game+0x59cd504
	void UpdateVoiceChat(); // Function TslGame.*8e3e737c04.UpdateVoiceChat // Final|Native|Private // @ game+0x59cdedc
	void *192534a0fd(); // Function TslGame.*8e3e737c04.*192534a0fd // Final|Native|Private // @ game+0x59c51bc
	void *095cfc1337(); // Function TslGame.*8e3e737c04.*095cfc1337 // Final|Native|Private // @ game+0x59cdc50
	void *589ece967a(); // Function TslGame.*8e3e737c04.*589ece967a // Final|Native|Private // @ game+0x59cd014
	void *138616108d(); // Function TslGame.*8e3e737c04.*138616108d // Final|Native|Private // @ game+0x59c39e4
	void *bd2a2a597f(); // Function TslGame.*8e3e737c04.*bd2a2a597f // Final|Native|Private // @ game+0x59cdc14
	void *d9754e3ed1(); // Function TslGame.*8e3e737c04.*d9754e3ed1 // Final|Native|Private // @ game+0x59cdad0
	void OnBlockUserUpdated(); // Function TslGame.*8e3e737c04.OnBlockUserUpdated // Final|Native|Private // @ game+0x59bd07c
	void SetTeam(); // Function TslGame.*8e3e737c04.SetTeam // Native|Public|BlueprintCallable // @ game+0x59cb710
	void OnParticipantRestrictionChanged(); // Function TslGame.*8e3e737c04.OnParticipantRestrictionChanged // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *227ffc55c4(); // Function TslGame.*8e3e737c04.*227ffc55c4 // Final|Native|Private // @ game+0x59ce0ec
	void *6947ec1b6d(); // Function TslGame.*8e3e737c04.*6947ec1b6d // Final|Native|Private // @ game+0x59cd3e4
	void *41b98ecd8f(); // Function TslGame.*8e3e737c04.*41b98ecd8f // Final|Native|Private // @ game+0x59cdc64
	void FollowParachuteAction(); // Function TslGame.*8e3e737c04.FollowParachuteAction // Final|Native|Public // @ game+0x59b96f8
	void *2cc1f28e49(); // Function TslGame.*8e3e737c04.*2cc1f28e49 // Final|Native|Private // @ game+0x59cdc28
	void *714ab814f1(); // Function TslGame.*8e3e737c04.*714ab814f1 // Final|Native|Private // @ game+0x59c503c
	void *a901140f58(); // Function TslGame.*8e3e737c04.*a901140f58 // Final|Native|Private // @ game+0x59c47f4
};

// Class TslGame.*55011c9936
// Size: 0x8d8 (Inherited: 0x810)
struct U*55011c9936 : U*8e3e737c04 {
	struct UImage* ClassIconImageWidget; // 0x810(0x08)
	struct U*c1ef4cc603* TeamInfoGroup; // 0x818(0x08)
	struct UImage* IconBackgroundImageWidget; // 0x820(0x08)
	struct UImage* MemberIndexBackgroundImageWidget; // 0x828(0x08)
	struct UImage* FullBackgroundImageWidget; // 0x830(0x08)
	struct U*c1ef4cc603* LevelPanelWidget; // 0x838(0x08)
	struct UTextBlock* PlayeLevelText; // 0x840(0x08)
	struct TMap<enum class EFBRClass, struct UTexture2D*> ClassTextureData; // 0x848(0x50)
	struct TArray<struct F*f883c0c9f4> ImageByMemberIndex; // 0x898(0x10)
	struct FMargin SlotPaddingOverride; // 0x8a8(0x10)
	struct FName MaterialParam_Texture; // 0x8b8(0x08)
	struct FName MaterialParam_IsGray; // 0x8c0(0x08)
	struct FName MaterialParam_IsBlink; // 0x8c8(0x08)
	char pad_8D0[0x8]; // 0x8d0(0x08)

	void OnTeamSpawnKitUpdated(); // Function TslGame.*55011c9936.OnTeamSpawnKitUpdated // Final|Native|Public // @ game+0x59c26b0
	void OnToggleClassSelectWidget(); // Function TslGame.*55011c9936.OnToggleClassSelectWidget // Final|Native|Public // @ game+0x59c2d18
};

// Class TslGame.*d4d7c56372
// Size: 0x510 (Inherited: 0x418)
struct U*d4d7c56372 : U*17234a7c9b {
	struct FMulticastDelegate OnReportButtonClicked; // 0x418(0x10)
	char pad_428[0x40]; // 0x428(0x40)
	struct FTslReportUserInfo *96b24db47d; // 0x468(0x70)
	struct F*d3069d51ff *fa79a2870f; // 0x4d8(0x28)
	float VisualVolumeModifier; // 0x500(0x04)
	float ActualVolumeMin; // 0x504(0x04)
	float ActualVolumeMax; // 0x508(0x04)
	char pad_50C[0x4]; // 0x50c(0x04)
};

// Class TslGame.*5fdcf92b78
// Size: 0x830 (Inherited: 0x510)
struct U*5fdcf92b78 : U*d4d7c56372 {
	char pad_510[0x40]; // 0x510(0x40)
	struct UWidgetSwitcher* RadioButtonSwitcher; // 0x550(0x08)
	struct UButton* RadioOnButton; // 0x558(0x08)
	struct UButton* RadioOffButton; // 0x560(0x08)
	struct UWidgetSwitcher* WaypointButtonSwitcher; // 0x568(0x08)
	struct UButton* WaypointOnButton; // 0x570(0x08)
	struct UButton* WaypointOffButton; // 0x578(0x08)
	struct F*b9afef7a3a *b823951027; // 0x580(0x28)
	struct F*c69f8ed24a *93305100ea; // 0x5a8(0x28)
	struct F*7f3debddd2 *351f9f7f31; // 0x5d0(0x20)
	struct F*7f3debddd2 *3fe3902408; // 0x5f0(0x20)
	struct F*c69f8ed24a *9370f63214; // 0x610(0x28)
	struct F*f4f57b85a2 *cb70a89746; // 0x638(0x20)
	struct F*959656208f *067b69c5dd; // 0x658(0x30)
	struct F*7f3debddd2 *fd0cdc88d3; // 0x688(0x20)
	struct F*b9afef7a3a *e4ebad8d7f; // 0x6a8(0x28)
	int32 *374a8359e1; // 0x6d0(0x04)
	int32 *6324d83efc; // 0x6d4(0x04)
	struct F*7f3debddd2 *c3094f9abf; // 0x6d8(0x20)
	struct F*7f3debddd2 *2e1f2971e3; // 0x6f8(0x20)
	struct F*7f3debddd2 *8954ff2ba3; // 0x718(0x20)
	struct F*f4f57b85a2 *ce2a48b8b4; // 0x738(0x20)
	struct F*c69f8ed24a *cddab7c310; // 0x758(0x28)
	struct F*c69f8ed24a *ced4666e47; // 0x780(0x28)
	struct F*959656208f *c97f77066b; // 0x7a8(0x30)
	struct FLinearColor *73135bfc90; // 0x7d8(0x10)
	struct FLinearColor *86d33f7966; // 0x7e8(0x10)
	struct FLinearColor *a3b5718144; // 0x7f8(0x10)
	struct FText *623e610a07; // 0x808(0x18)
	char pad_820[0x10]; // 0x820(0x10)

	void OnClickedWaypointOffButton(); // Function TslGame.*5fdcf92b78.OnClickedWaypointOffButton // Final|Native|Protected // @ game+0x59bdc04
	void NotifyToggleAvoidButtonClicked(); // Function TslGame.*5fdcf92b78.NotifyToggleAvoidButtonClicked // Final|Native|Protected // @ game+0x59bc9c0
	void OnClickedWaypointOnButton(); // Function TslGame.*5fdcf92b78.OnClickedWaypointOnButton // Final|Native|Protected // @ game+0x59bdc20
	void NotifyVolumeSliderUpdated(); // Function TslGame.*5fdcf92b78.NotifyVolumeSliderUpdated // Final|Native|Protected|BlueprintCallable // @ game+0x59bc9e8
	void OnClickedRadioOffButton(); // Function TslGame.*5fdcf92b78.OnClickedRadioOffButton // Final|Native|Protected // @ game+0x59bdbf0
	void OnClickedRadioOnButton(); // Function TslGame.*5fdcf92b78.OnClickedRadioOnButton // Final|Native|Protected // @ game+0x59bdbf0
	void NotifyToggleVoiceMuteButtonClicked(); // Function TslGame.*5fdcf92b78.NotifyToggleVoiceMuteButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x59bc9d4
	void NotifyReportButtonClicked(); // Function TslGame.*5fdcf92b78.NotifyReportButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x59bc9ac
};

// Class TslGame.*610c79ea49
// Size: 0x6c0 (Inherited: 0x510)
struct U*610c79ea49 : U*d4d7c56372 {
	struct FMulticastDelegate OnNavigate; // 0x510(0x10)
	struct FMulticastDelegate OnShowGamerCard; // 0x520(0x10)
	struct FMulticastDelegate OnToggleVoiceMute; // 0x530(0x10)
	struct FMulticastDelegate OnToggleAvoid; // 0x540(0x10)
	struct FMulticastDelegate OnRequestClose; // 0x550(0x10)
	char pad_560[0x8]; // 0x560(0x08)
	struct F*959656208f *0828a49b21; // 0x568(0x30)
	struct F*f4f57b85a2 *cb70a89746; // 0x598(0x20)
	struct F*b9afef7a3a *7a26c4058c; // 0x5b8(0x28)
	struct F*c233adf9bd *8ae71cae91; // 0x5e0(0x20)
	int32 *52edaeae2e; // 0x600(0x04)
	int32 *5a64403080; // 0x604(0x04)
	float *59d486f654; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct F*c69f8ed24a *2bbce55d1d; // 0x610(0x28)
	struct F*d3069d51ff *832c768a97; // 0x638(0x28)
	struct F*f4f57b85a2 *758bbc1fcd; // 0x660(0x20)
	struct FLinearColor FocusedContentColor; // 0x680(0x10)
	struct FLinearColor DefaultContentColor; // 0x690(0x10)
	struct FLinearColor FocusedBrushColor; // 0x6a0(0x10)
	struct FLinearColor DefaultBrushColor; // 0x6b0(0x10)
};

// Class TslGame.*63367fa20e
// Size: 0x4d8 (Inherited: 0x418)
struct U*63367fa20e : U*17234a7c9b {
	struct UImage* CookingTimerImage; // 0x418(0x08)
	struct UMaterialInstanceDynamic* *5e864c64a1; // 0x420(0x08)
	struct ATslWeapon_Throwable* *f8f0d42dbc; // 0x428(0x08)
	struct TMap<enum class EColorBlindType, struct FLinearColor> NormalColorMap; // 0x430(0x50)
	struct TMap<enum class EColorBlindType, struct FLinearColor> WarningColorMap; // 0x480(0x50)
	char pad_4D0[0x8]; // 0x4d0(0x08)

	void UpdateProgressColor(); // Function TslGame.*63367fa20e.UpdateProgressColor // Final|Native|Private // @ game+0x59cd944
	void OnUpdateViewTarget(); // Function TslGame.*63367fa20e.OnUpdateViewTarget // Final|Native|Private // @ game+0xcfebf8
};

// Class TslGame.*d44067549f
// Size: 0x498 (Inherited: 0x418)
struct U*d44067549f : U*17234a7c9b {
	char pad_418[0x18]; // 0x418(0x18)
	int32 *b0050c12ec; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UClass* WeaponType; // 0x438(0x08)
	struct UTexture* *e4cb9275e0; // 0x440(0x08)
	float *8a42cf2da7; // 0x448(0x04)
	struct FLinearColor NormalColor; // 0x44c(0x10)
	struct FLinearColor *77f04a6370; // 0x45c(0x10)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct UImage* Icon; // 0x470(0x08)
	struct UTextBlock* ItemCountText; // 0x478(0x08)
	struct USizeBox* IconSize; // 0x480(0x08)
	struct U*6b11b3bf02* Anim_Use; // 0x488(0x08)
	struct U*6b11b3bf02* Anim_Add; // 0x490(0x08)

	void GetThrowableItemCount(); // Function TslGame.*d44067549f.GetThrowableItemCount // Final|Native|Public|BlueprintCallable // @ game+0x59ba4ac
	void OnThrowableItemsUpdated(); // Function TslGame.*d44067549f.OnThrowableItemsUpdated // Final|Native|Private // @ game+0x59c2998
};

// Class TslGame.*01798c2b05
// Size: 0x448 (Inherited: 0x418)
struct U*01798c2b05 : U*17234a7c9b {
	struct UTextBlock* ToolTipTitleText; // 0x418(0x08)
	struct UTextBlock* ToolTipContentText; // 0x420(0x08)
	struct UWidget* *259ccb060f; // 0x428(0x08)
	char pad_430[0x18]; // 0x430(0x18)
};

// Class TslGame.*e8f24c89d8
// Size: 0x4b0 (Inherited: 0x418)
struct U*e8f24c89d8 : U*17234a7c9b {
	struct FText TrainingTitleText; // 0x418(0x18)
	struct FText TrainingDetailText; // 0x430(0x18)
	struct UTexture2D* ButtonImageTexture; // 0x448(0x08)
	enum class ETrainingPracticeType PracticeType; // 0x450(0x01)
	char pad_451[0x17]; // 0x451(0x17)
	struct FVector2D *6cf22b1d79; // 0x468(0x08)
	struct FVector2D *b906876cf6; // 0x470(0x08)
	struct UTextBlock* TitleText; // 0x478(0x08)
	struct UTextBlock* DetailText; // 0x480(0x08)
	struct UImage* ButtonImage; // 0x488(0x08)
	struct UImage* ConsoleHighlight; // 0x490(0x08)
	struct UButton* TrainingMenuButton; // 0x498(0x08)
	struct USizeBox* TrainingMenuButtonSizeBox; // 0x4a0(0x08)
	char pad_4A8[0x8]; // 0x4a8(0x08)

	void OnUnHoveredButton(); // Function TslGame.*e8f24c89d8.OnUnHoveredButton // Final|Native|Public // @ game+0x59c2e88
	void OnTrainingMenuSelect(); // Function TslGame.*e8f24c89d8.OnTrainingMenuSelect // Final|Native|Public // @ game+0x59c2e40
	void OnHoveredButton(); // Function TslGame.*e8f24c89d8.OnHoveredButton // Final|Native|Public // @ game+0x59bef64
};

// Class TslGame.*d2e7bedcd2
// Size: 0x458 (Inherited: 0x418)
struct U*d2e7bedcd2 : U*17234a7c9b {
	char pad_418[0x10]; // 0x418(0x10)
	struct U*95e9d8b07a* RoundCount; // 0x428(0x08)
	struct U*3212bb78c2* RoundTime; // 0x430(0x08)
	char pad_438[0x20]; // 0x438(0x20)
};

// Class TslGame.*c61de1fc76
// Size: 0x470 (Inherited: 0x458)
struct U*c61de1fc76 : U*d2e7bedcd2 {
	struct U*79daa5cc8d* ScorePoints; // 0x458(0x08)
	struct U*1ff393c1cd* WinningStreak; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)
};

// Class TslGame.*3573ccd810
// Size: 0x578 (Inherited: 0x458)
struct U*3573ccd810 : U*d2e7bedcd2 {
	struct U*78e1bd82d3* PlayerHeadManager; // 0x458(0x08)
	struct UBorder* HP_Border; // 0x460(0x08)
	struct U*79daa5cc8d* Player_Score; // 0x468(0x08)
	struct U*79daa5cc8d* Enemy_Score; // 0x470(0x08)
	struct UImage* Player_Gauge_Image; // 0x478(0x08)
	struct UImage* Enemy_Gauge_Image; // 0x480(0x08)
	struct U*7f757909f6* Player_PlatformIcon; // 0x488(0x08)
	struct U*7f757909f6* Enemy_PlatformIcon; // 0x490(0x08)
	struct UTextBlock* PlayerName_Text; // 0x498(0x08)
	struct UTextBlock* EnemyName_Text; // 0x4a0(0x08)
	struct U*6b11b3bf02* Hit0_Anim; // 0x4a8(0x08)
	struct U*6b11b3bf02* Hit1_Anim; // 0x4b0(0x08)
	struct U*6b11b3bf02* Open_Anim; // 0x4b8(0x08)
	char pad_4C0[0xa0]; // 0x4c0(0xa0)
	struct U*1ff393c1cd* PlayerWinningStreak; // 0x560(0x08)
	struct U*1ff393c1cd* EnemyWinningStreak; // 0x568(0x08)
	char pad_570[0x8]; // 0x570(0x08)
};

// Class TslGame.*829bb3405d
// Size: 0x438 (Inherited: 0x418)
struct U*829bb3405d : U*17234a7c9b {
	struct UWidgetSwitcher* ResultMark_Switcher; // 0x418(0x08)
	struct UWidgetSwitcher* ResultText_Switcher; // 0x420(0x08)
	struct U*6b11b3bf02* Anim_Start; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*7d2db8c7b6
// Size: 0x440 (Inherited: 0x418)
struct U*7d2db8c7b6 : U*17234a7c9b {
	struct U*829bb3405d* Round_Player; // 0x418(0x08)
	struct U*3212bb78c2* Round_Time; // 0x420(0x08)
	struct U*829bb3405d* Round_Enemy; // 0x428(0x08)
	struct U*6b11b3bf02* Anim_Start; // 0x430(0x08)
	struct UAkAudioEvent* *ac56f27efc; // 0x438(0x08)
};

// Class TslGame.*2d4b9d1d82
// Size: 0x4a0 (Inherited: 0x418)
struct U*2d4b9d1d82 : U*17234a7c9b {
	struct U*6b11b3bf02* Open_Anim; // 0x418(0x08)
	struct U*6b11b3bf02* Close_Anim; // 0x420(0x08)
	struct U*6b11b3bf02* Found_Anim; // 0x428(0x08)
	struct U*6b11b3bf02* MatchStart_Anim; // 0x430(0x08)
	struct U*6b11b3bf02* MatchEnd_Anim; // 0x438(0x08)
	struct UCanvasPanel* Search_CanvasPanel; // 0x440(0x08)
	struct UTextBlock* Search_Sub_TextBlock; // 0x448(0x08)
	struct UGridPanel* Search_GridPanel; // 0x450(0x08)
	struct UBorder* Search_Border; // 0x458(0x08)
	struct FText TimeTextFormat; // 0x460(0x18)
	struct FString *c74d964f2f; // 0x478(0x10)
	struct FString *181ec111e4; // 0x488(0x10)
	char pad_498[0x8]; // 0x498(0x08)

	void OnMatchFound(); // Function TslGame.*2d4b9d1d82.OnMatchFound // Final|Native|Private // @ game+0x59bf574
	void OnSearchCanceled(); // Function TslGame.*2d4b9d1d82.OnSearchCanceled // Final|Native|Private // @ game+0x59c1ff4
	void OnUpdateMatchWaitingElapsedTime(); // Function TslGame.*2d4b9d1d82.OnUpdateMatchWaitingElapsedTime // Final|Native|Private // @ game+0x59c2f90
	void OnSearchStarted(); // Function TslGame.*2d4b9d1d82.OnSearchStarted // Final|Native|Private // @ game+0x59c2008
};

// Class TslGame.*1ff393c1cd
// Size: 0x500 (Inherited: 0x418)
struct U*1ff393c1cd : U*17234a7c9b {
	struct FSlateBrush *ce39d3c02c; // 0x418(0x90)
	int32 *d0a95fa526; // 0x4a8(0x04)
	int32 *300188aef8; // 0x4ac(0x04)
	struct FMargin *f6555d1a8b; // 0x4b0(0x10)
	enum class EHorizontalAlignment *462c76461e; // 0x4c0(0x01)
	char pad_4C1[0x3]; // 0x4c1(0x03)
	struct FLinearColor *7fd22b62ca; // 0x4c4(0x10)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	struct UTextBlock* WinningStreakTitleText; // 0x4d8(0x08)
	struct UTextBlock* WinningStreakWinsText; // 0x4e0(0x08)
	struct USizeBox* WinningStreak_SizeBox; // 0x4e8(0x08)
	struct UHorizontalBox* WinningStreak_HorizontalBox; // 0x4f0(0x08)
	struct UBorder* WinningStreak_Border; // 0x4f8(0x08)
};

// Class TslGame.*9ca8a6b11f
// Size: 0x4a0 (Inherited: 0x418)
struct U*9ca8a6b11f : U*17234a7c9b {
	char pad_418[0x10]; // 0x418(0x10)
	float ScoreTextStartTime; // 0x428(0x04)
	float ScoreTextUpdateTime; // 0x42c(0x04)
	float ScoreTextMaxTime; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UAkAudioEvent* ScoreRiseSoundEvent; // 0x438(0x08)
	struct UAkAudioEvent* ScoreRiseSoundEndEvent; // 0x440(0x08)
	struct UImage* TrainingScoreIconImage; // 0x448(0x08)
	struct UTextBlock* TrainingScoreTitleText; // 0x450(0x08)
	struct UTextBlock* TrainingScoreNumberText; // 0x458(0x08)
	struct U*6b11b3bf02* Emerge; // 0x460(0x08)
	char pad_468[0x38]; // 0x468(0x38)

	void *e4c1439322(); // Function TslGame.*9ca8a6b11f.*e4c1439322 // Final|Native|Private // @ game+0x59ccfd8
	void *eba77398d5(); // Function TslGame.*9ca8a6b11f.*eba77398d5 // Final|Native|Private // @ game+0x59c4808
	void *59b969b124(); // Function TslGame.*9ca8a6b11f.*59b969b124 // Final|Native|Private // @ game+0x59cc450
};

// Class TslGame.*f2d85db64b
// Size: 0x430 (Inherited: 0x418)
struct U*f2d85db64b : U*17234a7c9b {
	struct UTextBlock* TurnNumber_Text; // 0x418(0x08)
	struct UTextBlock* WeaponName_Text; // 0x420(0x08)
	struct UImage* Weapon_Image; // 0x428(0x08)
};

// Class TslGame.*ecbc5062f1
// Size: 0x5a8 (Inherited: 0x418)
struct U*ecbc5062f1 : U*17234a7c9b {
	enum class ETslTrainingType *e56ca36683; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct FText TitleText; // 0x420(0x18)
	struct UTexture2D* BackGroundTexture; // 0x438(0x08)
	struct UTexture2D* *bdc46ad5d1; // 0x440(0x08)
	struct UImage* TrainingIconImage; // 0x448(0x08)
	struct UImage* BackgroundImage; // 0x450(0x08)
	struct UButton* TeleportButton; // 0x458(0x08)
	struct U*0399764a34* Title_Text; // 0x460(0x08)
	char pad_468[0x128]; // 0x468(0x128)
	struct U*f51c4d215d* *27fbc0e025; // 0x590(0x08)
	struct U*6b11b3bf02* OnBtnHovered_Anim; // 0x598(0x08)
	float *e4d10c2e3f; // 0x5a0(0x04)
	float *13a8769718; // 0x5a4(0x04)

	void OnBtnHovered(); // Function TslGame.*ecbc5062f1.OnBtnHovered // Final|Native|Protected|BlueprintCallable // @ game+0x59bd470
	void OnBtnHoverEnded(); // Function TslGame.*ecbc5062f1.OnBtnHoverEnded // Final|Native|Protected|BlueprintCallable // @ game+0x59bd3cc
	void OnBtnClicked(); // Function TslGame.*ecbc5062f1.OnBtnClicked // Final|Native|Protected|BlueprintCallable // @ game+0x59bd328
};

// Class TslGame.*7767a34479
// Size: 0x460 (Inherited: 0x418)
struct U*7767a34479 : U*17234a7c9b {
	char pad_418[0x30]; // 0x418(0x30)
	struct U*0399764a34* ToolTipTitleText; // 0x448(0x08)
	struct UImage* ToolTipImage; // 0x450(0x08)
	struct UImage* BackgroundImage; // 0x458(0x08)
};

// Class TslGame.*89173652b2
// Size: 0x430 (Inherited: 0x418)
struct U*89173652b2 : U*17234a7c9b {
	struct UImage* CapacityImage; // 0x418(0x08)
	struct UImage* FeedbackImage; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)

	void OnFocusItemSlot(); // Function TslGame.*89173652b2.OnFocusItemSlot // Final|Native|Private // @ game+0x59be7c4
	void OnAttachmentFocuseSlotID(); // Function TslGame.*89173652b2.OnAttachmentFocuseSlotID // Final|Native|Private // @ game+0x59bceb0
	void OnFocusItemSlotIDEquipment(); // Function TslGame.*89173652b2.OnFocusItemSlotIDEquipment // Final|Native|Private // @ game+0x59be938
	void OnFocusWeaponItemSlotIDEquipment(); // Function TslGame.*89173652b2.OnFocusWeaponItemSlotIDEquipment // Final|Native|Private // @ game+0x59be9c8
	void OnEnterItemSlot(); // Function TslGame.*89173652b2.OnEnterItemSlot // Final|Native|Private // @ game+0x59be470
	void OnLeaveItemSlot(); // Function TslGame.*89173652b2.OnLeaveItemSlot // Final|Native|Private // @ game+0x59bf108
};

// Class TslGame.*351b7047f7
// Size: 0x428 (Inherited: 0x418)
struct U*351b7047f7 : U*17234a7c9b {
	struct U*fc313b34f1* TutorialMissionListWidget; // 0x418(0x08)
	struct U*dcb110abe9* TutorialBannerWidget; // 0x420(0x08)
};

// Class TslGame.*6538a02a5c
// Size: 0x440 (Inherited: 0x418)
struct U*6538a02a5c : U*17234a7c9b {
	struct UTextBlock* TitleText; // 0x418(0x08)
	struct UTslRichTextBlock* MainText; // 0x420(0x08)
	struct U*6b11b3bf02* FadeInAnim; // 0x428(0x08)
	struct U*6b11b3bf02* FadeOutAnim; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class TslGame.*1321961a27
// Size: 0x478 (Inherited: 0x418)
struct U*1321961a27 : U*17234a7c9b {
	struct U*bfbc16799c* RadioMessageLogWidget; // 0x418(0x08)
	struct U*70c76f5bfa* VehicleStanceWidget; // 0x420(0x08)
	struct U*c9c849fd88* MortarCanvasWidget; // 0x428(0x08)
	struct U*f0e82267ba* TeamInfoListWidget; // 0x430(0x08)
	struct UWidgetSwitcher* TeamListSwitcher; // 0x438(0x08)
	struct USpacer* TeamListMatchResultSpacer; // 0x440(0x08)
	struct U*415ef1fc57* ObserverTeamInfoList; // 0x448(0x08)
	struct FVector2D *196e94ed94; // 0x450(0x08)
	struct FVector2D *18710e3d7c; // 0x458(0x08)
	struct FVector2D *38e383cd8a; // 0x460(0x08)
	struct FVector2D *6495c984e9; // 0x468(0x08)
	bool *89a2092dfa; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)
};

// Class TslGame.*d5ee607c6a
// Size: 0x480 (Inherited: 0x478)
struct U*d5ee607c6a : U*1321961a27 {
	struct U*c1ef4cc603* FBRClassSelectGuideOuterBox; // 0x478(0x08)

	void OnMatchStateChanged(); // Function TslGame.*d5ee607c6a.OnMatchStateChanged // Final|Native|Public // @ game+0x59bf748
	void OnToggleClassSelectWidgetVisibility(); // Function TslGame.*d5ee607c6a.OnToggleClassSelectWidgetVisibility // Final|Native|Public // @ game+0x59c2dac
};

// Class TslGame.*b595b186e4
// Size: 0x4a0 (Inherited: 0x418)
struct U*b595b186e4 : U*17234a7c9b {
	char pad_418[0xc]; // 0x418(0x0c)
	enum class ELeaningState CurrentLeanState; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	float *0fd88707c0; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FText DistanceTextFormat; // 0x430(0x18)
	struct UTextBlock* RangeFinderText; // 0x448(0x08)
	struct FText ScanningTimerText; // 0x450(0x18)
	struct UClass* *16e5aaf4f6; // 0x468(0x08)
	struct UVerticalBox* SpottingInfoVerticalBox; // 0x470(0x08)
	struct UHorizontalBox* StandardCrosshair; // 0x478(0x08)
	struct UImage* CrosshairActive; // 0x480(0x08)
	struct UOverlay* DistanceToTarget; // 0x488(0x08)
	struct UOverlay* Overlay_ScanningAll; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)

	void GetScanningPercent(); // Function TslGame.*b595b186e4.GetScanningPercent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba02c
	void GetScanningInProgressVisibility(); // Function TslGame.*b595b186e4.GetScanningInProgressVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9ffc
	void GetScanningVisibility(); // Function TslGame.*b595b186e4.GetScanningVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba044
	void GetScanningInterruptedVisibility(); // Function TslGame.*b595b186e4.GetScanningInterruptedVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba014
	void *16e1a99549(); // Function TslGame.*b595b186e4.*16e1a99549 // Final|Native|Public // @ game+0x59cd9fc
	void SetRangeFinderTextVisibility(); // Function TslGame.*b595b186e4.SetRangeFinderTextVisibility // Final|Native|Public // @ game+0x59cb06c
};

// Class TslGame.*7cffec35ec
// Size: 0x550 (Inherited: 0x418)
struct U*7cffec35ec : U*17234a7c9b {
	char pad_418[0xb8]; // 0x418(0xb8)
	float *fd09578373; // 0x4d0(0x04)
	char pad_4D4[0x64]; // 0x4d4(0x64)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x538(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x540(0x08)
	char pad_548[0x8]; // 0x548(0x08)

	void CallOnAttachmentFocused(); // Function TslGame.*7cffec35ec.CallOnAttachmentFocused // Final|Native|Protected // @ game+0x5ab57a4
	void *4dae901933(); // Function TslGame.*7cffec35ec.*4dae901933 // Final|Native|Protected // @ game+0x5ab559c
	void OnChildSlotRefreshFocus(); // Function TslGame.*7cffec35ec.OnChildSlotRefreshFocus // Native|Protected // @ game+0x59bdba8
	void CallOnWeaponEquipmentFocused(); // Function TslGame.*7cffec35ec.CallOnWeaponEquipmentFocused // Final|Native|Protected // @ game+0xccaaf8
};

// Class TslGame.*d24d56ec6e
// Size: 0x550 (Inherited: 0x550)
struct U*d24d56ec6e : U*7cffec35ec {
};

// Class TslGame.*c9cd84ddc9
// Size: 0x550 (Inherited: 0x550)
struct U*c9cd84ddc9 : U*d24d56ec6e {
};

// Class TslGame.*7b5990329a
// Size: 0x498 (Inherited: 0x418)
struct U*7b5990329a : U*17234a7c9b {
	struct TMap<int32, struct F*ac7e95618e> *b2cb6af05d; // 0x418(0x50)
	struct UTextBlock* NameText; // 0x468(0x08)
	struct UImage* BackgroundL; // 0x470(0x08)
	struct UImage* BackgroundR; // 0x478(0x08)
	struct UImage* AdditiveL; // 0x480(0x08)
	struct UImage* AdditiveR; // 0x488(0x08)
	struct U*6b11b3bf02* ShowAnim; // 0x490(0x08)
};

// Class TslGame.*ac31e6eef2
// Size: 0x480 (Inherited: 0x418)
struct U*ac31e6eef2 : U*17234a7c9b {
	struct F*8e32972a91 *739194340b; // 0x418(0x28)
	struct F*8e32972a91 *ef6218d1d2; // 0x440(0x28)
	char pad_468[0x18]; // 0x468(0x18)

	void FadeIn(); // Function TslGame.*ac31e6eef2.FadeIn // Event|Public|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.TslWebBrowserWidget
// Size: 0x4b8 (Inherited: 0x418)
struct UTslWebBrowserWidget : U*17234a7c9b {
	struct UButton* FullModeButton; // 0x418(0x08)
	struct UButton* WindowModeButton; // 0x420(0x08)
	struct F*dbaf7780f1 WebBrowserWidgetBinder; // 0x428(0x20)
	struct F*b9afef7a3a ScreenModeSwitcherBinder; // 0x448(0x28)
	struct F*959656208f WebBrowserBorderBinder; // 0x470(0x30)
	struct FVector2D WindowModePosition; // 0x4a0(0x08)
	struct FVector2D WindowModeScale; // 0x4a8(0x08)
	char pad_4B0[0x8]; // 0x4b0(0x08)

	void OnLoadURL(); // Function TslGame.TslWebBrowserWidget.OnLoadURL // Final|Native|Public // @ game+0x59bf28c
	void *40dea6b630(); // Function TslGame.TslWebBrowserWidget.*40dea6b630 // Final|Native|Public // @ game+0x59c4d20
	void OnFullMode(); // Function TslGame.TslWebBrowserWidget.OnFullMode // Final|Native|Public // @ game+0x59beb80
	void OnWindowMode(); // Function TslGame.TslWebBrowserWidget.OnWindowMode // Final|Native|Public // @ game+0x59c4594
	void OnPopup(); // Function TslGame.TslWebBrowserWidget.OnPopup // Final|Native|Public|BlueprintCallable // @ game+0x59c0f3c
	void *9b32d590e4(); // Function TslGame.TslWebBrowserWidget.*9b32d590e4 // Final|Native|Public // @ game+0x59c0e1c
};

// Class TslGame.*ba28387cae
// Size: 0x470 (Inherited: 0x418)
struct U*ba28387cae : U*17234a7c9b {
	char pad_418[0x50]; // 0x418(0x50)
	struct U*4b1a1c10ac* WebView; // 0x468(0x08)

	void CloseWebPopup(); // Function TslGame.*ba28387cae.CloseWebPopup // Final|Native|Public|BlueprintCallable // @ game+0x59b82d4
	void SetReuse(); // Function TslGame.*ba28387cae.SetReuse // Final|Native|Public|BlueprintCallable // @ game+0x59cb2b8
	void UpdateURLAndWidget(); // Function TslGame.*ba28387cae.UpdateURLAndWidget // Event|Public|HasOutParms|BlueprintEvent // @ game+0x22ddc4
	void SetWebPopupVisibility(); // Function TslGame.*ba28387cae.SetWebPopupVisibility // Final|Native|Public|BlueprintCallable // @ game+0x59cba98
	void IsWebPopupShow(); // Function TslGame.*ba28387cae.IsWebPopupShow // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb1dc
	void SetLayout(); // Function TslGame.*ba28387cae.SetLayout // Final|Native|Public|BlueprintCallable // @ game+0x59ca670
	void GetSaveWebPopupParam(); // Function TslGame.*ba28387cae.GetSaveWebPopupParam // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9f88
	void OnUpdateWebPopup(); // Function TslGame.*ba28387cae.OnUpdateWebPopup // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void UpdateWebPopup(); // Function TslGame.*ba28387cae.UpdateWebPopup // Final|Native|Public|BlueprintCallable // @ game+0x59ce118
	void IsReuse(); // Function TslGame.*ba28387cae.IsReuse // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb16c
};

// Class TslGame.*b45887366a
// Size: 0x470 (Inherited: 0x418)
struct U*b45887366a : U*17234a7c9b {
	struct UCanvasPanel* OutsidePanel; // 0x418(0x08)
	struct UWidgetSwitcher* FocusSwitcher; // 0x420(0x08)
	struct UOverlay* TargetImageOverlay; // 0x428(0x08)
	struct UImage* TargetImage; // 0x430(0x08)
	struct U*6b11b3bf02* InitAnim; // 0x438(0x08)
	struct U*6b11b3bf02* FadeOutForSelected; // 0x440(0x08)
	struct U*6b11b3bf02* FadeOutForNonSelected; // 0x448(0x08)
	int32 NonFocusedWidgetIndex; // 0x450(0x04)
	int32 FocusedWidgetIndex; // 0x454(0x04)
	int32 EmptyWidgetIndex; // 0x458(0x04)
	float *7e5bc026a3; // 0x45c(0x04)
	float *eb729dd3df; // 0x460(0x04)
	float *62fc4429e7; // 0x464(0x04)
	char pad_468[0x8]; // 0x468(0x08)

	void PlaySelectAnimation(); // Function TslGame.*b45887366a.PlaySelectAnimation // Native|Public|BlueprintCallable // @ game+0x59c4830
	void DoActionInLobby(); // Function TslGame.*b45887366a.DoActionInLobby // Native|Public|BlueprintCallable // @ game+0x59b8ea4
	void SetFocus(); // Function TslGame.*b45887366a.SetFocus // Final|Native|Public|BlueprintCallable // @ game+0x59ca3d0
	void SetEmpty(); // Function TslGame.*b45887366a.SetEmpty // Native|Public|BlueprintCallable // @ game+0x59ca158
	void DoAction(); // Function TslGame.*b45887366a.DoAction // Native|Public|BlueprintCallable // @ game+0x59b8dfc
	void GetNameText(); // Function TslGame.*b45887366a.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9de4
	void IsEmpty(); // Function TslGame.*b45887366a.IsEmpty // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb0b8
	void IsShowDescriptionText(); // Function TslGame.*b45887366a.IsShowDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb19c
	void GetDescriptionText(); // Function TslGame.*b45887366a.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9890
};

// Class TslGame.*850baea3c8
// Size: 0x4f0 (Inherited: 0x470)
struct U*850baea3c8 : U*b45887366a {
	struct FString ActionNamePrefix; // 0x470(0x10)
	struct FLinearColor EnbleImageColor; // 0x480(0x10)
	struct FLinearColor DisableImageColor; // 0x490(0x10)
	char pad_4A0[0x50]; // 0x4a0(0x50)

	void DoActionInLobby(); // Function TslGame.*850baea3c8.DoActionInLobby // Native|Public|BlueprintCallable // @ game+0x59b8ea4
	void GetDescriptionText(); // Function TslGame.*850baea3c8.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9890
	void DoAction(); // Function TslGame.*850baea3c8.DoAction // Native|Public|BlueprintCallable // @ game+0x59b8dfc
	void GetNameText(); // Function TslGame.*850baea3c8.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9de4
	void IsShowDescriptionText(); // Function TslGame.*850baea3c8.IsShowDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59bb19c
};

// Class TslGame.*67ac0eb5d3
// Size: 0x4d0 (Inherited: 0x470)
struct U*67ac0eb5d3 : U*b45887366a {
	struct UTextBlock* StackCountText; // 0x470(0x08)
	struct U*6b11b3bf02* FadeOutForNonSelected_NoItem; // 0x478(0x08)
	struct FLinearColor UnusableItemImageColor; // 0x480(0x10)
	struct FLinearColor UsableItemImageColor; // 0x490(0x10)
	struct FLinearColor UnusableItemNameColor; // 0x4a0(0x10)
	struct FLinearColor UsableItemNameColor; // 0x4b0(0x10)
	char pad_4C0[0x8]; // 0x4c0(0x08)
	struct FName ItemID; // 0x4c8(0x08)

	void GetDescriptionText(); // Function TslGame.*67ac0eb5d3.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9890
	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*67ac0eb5d3.OnDefaultITem_AsyncLoadIconFinished // Final|Native|Private // @ game+0x59be284
	void GetNameText(); // Function TslGame.*67ac0eb5d3.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9de4
	void *ecccadfb4f(); // Function TslGame.*67ac0eb5d3.*ecccadfb4f // Final|Native|Public // @ game+0x59bb630
	void PlaySelectAnimation(); // Function TslGame.*67ac0eb5d3.PlaySelectAnimation // Native|Public|BlueprintCallable // @ game+0x59c4830
	void DoAction(); // Function TslGame.*67ac0eb5d3.DoAction // Native|Public|BlueprintCallable // @ game+0x59b8dfc
	void UpdateItemImage(); // Function TslGame.*67ac0eb5d3.UpdateItemImage // Final|Native|Public // @ game+0x59be284
	void GetStackCount(); // Function TslGame.*67ac0eb5d3.GetStackCount // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba284
};

// Class TslGame.*b091bf68c0
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*b091bf68c0 : U*67ac0eb5d3 {
	struct FText CannotUseItemText; // 0x4d0(0x18)

	void DoAction(); // Function TslGame.*b091bf68c0.DoAction // Native|Protected|BlueprintCallable // @ game+0x59b8dfc
	void GetStackCount(); // Function TslGame.*b091bf68c0.GetStackCount // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba284
};

// Class TslGame.*b1379e739a
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*b1379e739a : U*67ac0eb5d3 {
	struct FText CannotUseItemText; // 0x4d0(0x18)

	void DoAction(); // Function TslGame.*b1379e739a.DoAction // Native|Protected|BlueprintCallable // @ game+0x59b8dfc
};

// Class TslGame.*602dc75c7b
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*602dc75c7b : U*67ac0eb5d3 {
	struct FText CannotEquipItemText; // 0x4d0(0x18)

	void DoAction(); // Function TslGame.*602dc75c7b.DoAction // Native|Protected|BlueprintCallable // @ game+0x59b8dfc
	void GetStackCount(); // Function TslGame.*602dc75c7b.GetStackCount // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba284
};

// Class TslGame.*aeb2b32afa
// Size: 0x4d0 (Inherited: 0x470)
struct U*aeb2b32afa : U*b45887366a {
	float Radius; // 0x470(0x04)
	float RadiusOffsetWhenSelected; // 0x474(0x04)
	struct FName RotationMaterialParameter; // 0x478(0x08)
	struct UImage* FocusedImage; // 0x480(0x08)
	struct UImage* NonFocusedImage; // 0x488(0x08)
	struct USizeBox* FocusedSizeBox; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)
	struct F*f7b0180537 *0c37f8df74; // 0x4a0(0x28)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void DoAction(); // Function TslGame.*aeb2b32afa.DoAction // Native|Protected|BlueprintCallable // @ game+0x59b8dfc
	void GetNameText(); // Function TslGame.*aeb2b32afa.GetNameText // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9de4
};

// Class TslGame.*5aaee3ed1a
// Size: 0x4a0 (Inherited: 0x418)
struct U*5aaee3ed1a : U*17234a7c9b {
	struct UOverlay* ImageOverlay; // 0x418(0x08)
	struct UImage* Img_Icon; // 0x420(0x08)
	struct U*6b11b3bf02* Anim_FocusOn; // 0x428(0x08)
	struct U*6b11b3bf02* Anim_FocusOff; // 0x430(0x08)
	struct U*6b11b3bf02* Anim_FocusOnTextColor; // 0x438(0x08)
	struct U*6b11b3bf02* Anim_FocusOffTextColor; // 0x440(0x08)
	struct U*6b11b3bf02* Anim_AlphaStrong_1; // 0x448(0x08)
	struct U*6b11b3bf02* Anim_AlphaStrong_2; // 0x450(0x08)
	struct U*6b11b3bf02* Anim_AlphaWeak_1; // 0x458(0x08)
	struct U*6b11b3bf02* Anim_AlphaWeak_2; // 0x460(0x08)
	char pad_468[0x20]; // 0x468(0x20)
	struct UImage* Img_CheckIcon; // 0x488(0x08)
	struct UTextBlock* Text_ItemName; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)
};

// Class TslGame.*d414dd6020
// Size: 0x520 (Inherited: 0x4a0)
struct U*d414dd6020 : U*5aaee3ed1a {
	struct UBorder* Bdr_Volume; // 0x4a0(0x08)
	struct UTextBlock* Txt_Volume; // 0x4a8(0x08)
	struct USizeBox* Szb_SlotNum; // 0x4b0(0x08)
	struct USizeBox* Szb_SlotNum_2; // 0x4b8(0x08)
	struct UTextBlock* TxtSlotNum; // 0x4c0(0x08)
	struct UTextBlock* Txt_SlotNum_2; // 0x4c8(0x08)
	char pad_4D0[0x20]; // 0x4d0(0x20)
	float EquippedSlotAlpha; // 0x4f0(0x04)
	struct FLinearColor UnUsableItemColor; // 0x4f4(0x10)
	char pad_504[0xc]; // 0x504(0x0c)
	struct FName ItemID; // 0x510(0x08)
	bool *24e90dcf9c; // 0x518(0x01)
	bool *db3b76268b; // 0x519(0x01)
	char pad_51A[0x6]; // 0x51a(0x06)

	void UpdateItemImage(); // Function TslGame.*d414dd6020.UpdateItemImage // Final|Native|Public // @ game+0x59be298
	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*d414dd6020.OnDefaultITem_AsyncLoadIconFinished // Final|Native|Private // @ game+0x59be298
	void GetStackCount(); // Function TslGame.*d414dd6020.GetStackCount // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba2ac
	void *ecccadfb4f(); // Function TslGame.*d414dd6020.*ecccadfb4f // Final|Native|Public // @ game+0x59bb644
};

// Class TslGame.*f51c4d215d
// Size: 0x480 (Inherited: 0x418)
struct U*f51c4d215d : U*17234a7c9b {
	struct UVerticalBox* info_VerticalBox; // 0x418(0x08)
	struct TArray<struct U*ecbc5062f1*> *ef9039893f; // 0x420(0x10)
	struct U*ecbc5062f1* *dc3ed8b730; // 0x430(0x08)
	struct TArray<struct U*2c69565f2e*> *e541715acd; // 0x438(0x10)
	struct FMulticastDelegate OnClickTeleportButton; // 0x448(0x10)
	struct FMulticastDelegate OnHoverTeleportButton; // 0x458(0x10)
	struct FMulticastDelegate OnUnHoverTeleportButton; // 0x468(0x10)
	struct U*8f13c061a8* *e345ac143d; // 0x478(0x08)

	void OnBtnClicked(); // Function TslGame.*f51c4d215d.OnBtnClicked // Final|Native|Protected|BlueprintCallable // @ game+0x59bd33c
	void OnBtnHoverEnded(); // Function TslGame.*f51c4d215d.OnBtnHoverEnded // Final|Native|Protected|BlueprintCallable // @ game+0x59bd3e0
	void *aad259341e(); // Function TslGame.*f51c4d215d.*aad259341e // Final|Native|Public // @ game+0x59baf5c
	void OnBtnHovered(); // Function TslGame.*f51c4d215d.OnBtnHovered // Final|Native|Protected|BlueprintCallable // @ game+0x59bd484
};

// Class TslGame.*b50bf4a466
// Size: 0x578 (Inherited: 0x418)
struct U*b50bf4a466 : U*17234a7c9b {
	struct U*830fa4a500* RespawnTimerUpdater; // 0x418(0x08)
	struct U*830fa4a500* TimeLimitTimerUpdater; // 0x420(0x08)
	struct F*f4f57b85a2 RespawnTimeTextBinder; // 0x428(0x20)
	struct F*f4f57b85a2 TimeLimitTextBinder; // 0x448(0x20)
	struct TArray<struct F*d3069d51ff> TeamValueImageBinders; // 0x468(0x10)
	struct TArray<struct F*f4f57b85a2> TeamValueTextBinders; // 0x478(0x10)
	struct TArray<struct F*f4f57b85a2> TeamMemberCountTextBinders; // 0x488(0x10)
	struct F*959656208f GameStatusMessageBorder_Binder; // 0x498(0x30)
	struct F*e9e2558d2e VSFadeInAnimation_Binder; // 0x4c8(0x20)
	struct F*e9e2558d2e VSFadeOutAnimation_Binder; // 0x4e8(0x20)
	struct F*f4f57b85a2 UpperTargetScoreText_Binder; // 0x508(0x20)
	struct FName ColorParamName; // 0x528(0x08)
	struct FName GaugeParamName; // 0x530(0x08)
	bool bUseRespawnTimer; // 0x538(0x01)
	bool bUseTimeLimitTimer; // 0x539(0x01)
	bool bUseAnimOnMatchStart; // 0x53a(0x01)
	bool bPlayGaugeAnim; // 0x53b(0x01)
	float GaugeAnimSpeed; // 0x53c(0x04)
	float GaugeAnimTime; // 0x540(0x04)
	char pad_544[0x4]; // 0x544(0x04)
	struct TArray<struct FLinearColor> TeamColors; // 0x548(0x10)
	char pad_558[0x20]; // 0x558(0x20)

	void OnRespawnTimeUpdated(); // Function TslGame.*b50bf4a466.OnRespawnTimeUpdated // Native|Protected // @ game+0x59c1bb0
	void OnModeInitialized(); // Function TslGame.*b50bf4a466.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x59bfa78
	void OnMyTeamRankChanged(); // Function TslGame.*b50bf4a466.OnMyTeamRankChanged // Native|Protected // @ game+0x59c00cc
	void OnMyTeamScoreChanged(); // Function TslGame.*b50bf4a466.OnMyTeamScoreChanged // Native|Protected // @ game+0x59c01f0
	void OnTimeLimitUpdated(); // Function TslGame.*b50bf4a466.OnTimeLimitUpdated // Native|Protected // @ game+0x59c29ac
	void OnHighEnemyScoreChanged(); // Function TslGame.*b50bf4a466.OnHighEnemyScoreChanged // Native|Protected // @ game+0x59bec28
	void OnMyGainScoreChanged(); // Function TslGame.*b50bf4a466.OnMyGainScoreChanged // Native|Protected // @ game+0x59bff98
	void OnResetLevel(); // Function TslGame.*b50bf4a466.OnResetLevel // Native|Protected // @ game+0x59c1b98
	void OnMatchStarted(); // Function TslGame.*b50bf4a466.OnMatchStarted // Native|Protected // @ game+0x59bf588
	void OnModeStarted(); // Function TslGame.*b50bf4a466.OnModeStarted // Native|Protected|HasOutParms // @ game+0x59bfbb4
};

// Class TslGame.BRTwoTeamScoreboardWidget
// Size: 0x590 (Inherited: 0x578)
struct UBRTwoTeamScoreboardWidget : U*b50bf4a466 {
	char pad_578[0x18]; // 0x578(0x18)
};

// Class TslGame.CustomTwoTeamScoreboardWidget
// Size: 0x5b8 (Inherited: 0x578)
struct UCustomTwoTeamScoreboardWidget : U*b50bf4a466 {
	struct F*f4f57b85a2 TargetScoreTextBinder; // 0x578(0x20)
	struct FText TargetScoreText; // 0x598(0x18)
	char pad_5B0[0x8]; // 0x5b0(0x08)

	void OnMyTeamScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamScoreChanged // Native|Protected // @ game+0x59c01f0
	void OnRespawnTimeUpdated(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnRespawnTimeUpdated // Native|Protected // @ game+0x59c1bb0
	void OnModeStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeStarted // Native|Protected|HasOutParms // @ game+0x59bfbb4
	void ShowInstantRespawnMessage(); // Function TslGame.CustomTwoTeamScoreboardWidget.ShowInstantRespawnMessage // Final|Native|Protected // @ game+0x59cbed0
	void OnMatchStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMatchStarted // Native|Protected // @ game+0x59bf588
	void OnMyGainScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyGainScoreChanged // Native|Protected // @ game+0x59bff98
	void OnMyTeamRankChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamRankChanged // Native|Protected // @ game+0x59c00cc
	void OnModeInitialized(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x59bfa78
	void OnTimeLimitUpdated(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnTimeLimitUpdated // Native|Protected // @ game+0x59c29ac
	void OnResetLevel(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnResetLevel // Native|Protected // @ game+0x59c1b98
	void OnHighEnemyScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnHighEnemyScoreChanged // Native|Protected // @ game+0x59bec28
};

// Class TslGame.ConquestModeWidget
// Size: 0x648 (Inherited: 0x5b8)
struct UConquestModeWidget : UCustomTwoTeamScoreboardWidget {
	struct UClass* *abcb79ee60; // 0x5b8(0x08)
	struct UClass* *6702471f1a; // 0x5c0(0x08)
	struct F*8e32972a91 *50fe2b8cf4; // 0x5c8(0x28)
	struct F*8e32972a91 *05159280d8; // 0x5f0(0x28)
	bool *d0bc1531c9; // 0x618(0x01)
	char pad_619[0x7]; // 0x619(0x07)
	struct FString *ccac28ff91; // 0x620(0x10)
	struct TArray<struct U*2266736abb*> *77c5218a22; // 0x630(0x10)
	struct U*2266736abb* *503cbe8be0; // 0x640(0x08)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.ConquestModeWidget.OnActivatedCaptureAreaUpdated // Final|Native|Private|HasOutParms // @ game+0x59bcba4
};

// Class TslGame.*e05bee1fa8
// Size: 0x5e8 (Inherited: 0x5b8)
struct U*e05bee1fa8 : UCustomTwoTeamScoreboardWidget {
	struct F*c69f8ed24a *778cbf4fc4; // 0x5b8(0x28)
	char pad_5E0[0x8]; // 0x5e0(0x08)

	void OnMyTeamScoreChanged(); // Function TslGame.*e05bee1fa8.OnMyTeamScoreChanged // Native|Protected // @ game+0x59c01f0
	void OnMatchStarted(); // Function TslGame.*e05bee1fa8.OnMatchStarted // Native|Protected // @ game+0x59bf588
	void OnModeInitialized(); // Function TslGame.*e05bee1fa8.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x59bfa78
	void OnHighEnemyScoreChanged(); // Function TslGame.*e05bee1fa8.OnHighEnemyScoreChanged // Native|Protected // @ game+0x59bec28
};

// Class TslGame.*ce9a3c8a0c
// Size: 0x638 (Inherited: 0x5b8)
struct U*ce9a3c8a0c : UCustomTwoTeamScoreboardWidget {
	struct F*f4f57b85a2 *835b6217c8; // 0x5b8(0x20)
	struct F*f4f57b85a2 *3b0478344e; // 0x5d8(0x20)
	struct F*e9e2558d2e *dfc8a8df4f; // 0x5f8(0x20)
	struct F*e9e2558d2e *2a5a084875; // 0x618(0x20)

	void OnMyTeamScoreChanged(); // Function TslGame.*ce9a3c8a0c.OnMyTeamScoreChanged // Native|Protected // @ game+0x59c01f0
	void *c29d14e6d6(); // Function TslGame.*ce9a3c8a0c.*c29d14e6d6 // Final|Native|Protected // @ game+0x59bf44c
	void OnHighEnemyScoreChanged(); // Function TslGame.*ce9a3c8a0c.OnHighEnemyScoreChanged // Native|Protected // @ game+0x59bec28
	void OnMatchStarted(); // Function TslGame.*ce9a3c8a0c.OnMatchStarted // Native|Protected // @ game+0x59bf588
	void OnModeInitialized(); // Function TslGame.*ce9a3c8a0c.OnModeInitialized // Final|Native|Protected|HasOutParms // @ game+0x59bfa78
	void OnMyGainScoreChanged(); // Function TslGame.*ce9a3c8a0c.OnMyGainScoreChanged // Native|Protected // @ game+0x59bff98
};

// Class TslGame.*10859b414d
// Size: 0x5c8 (Inherited: 0x578)
struct U*10859b414d : U*b50bf4a466 {
	char pad_578[0x28]; // 0x578(0x28)
	struct F*7f3debddd2 TimeLimitTimerSizeBoxBinder; // 0x5a0(0x20)
	struct UMaterialInterface* *4a34792481; // 0x5c0(0x08)

	void OnTimeLimitUpdated(); // Function TslGame.*10859b414d.OnTimeLimitUpdated // Native|Protected // @ game+0x59c29ac
};

// Class TslGame.*b4d5441dd6
// Size: 0x500 (Inherited: 0x418)
struct U*b4d5441dd6 : U*17234a7c9b {
	struct F*f4f57b85a2 Label; // 0x418(0x20)
	struct F*959656208f Border; // 0x438(0x30)
	char pad_468[0x98]; // 0x468(0x98)
};

// Class TslGame.*953faae2c4
// Size: 0x480 (Inherited: 0x418)
struct U*953faae2c4 : U*17234a7c9b {
	struct F*24ef768fdd EditText; // 0x418(0x20)
	struct F*f4f57b85a2 TextBlock; // 0x438(0x20)
	char pad_458[0x28]; // 0x458(0x28)

	void OnCloseButtonClicked(); // Function TslGame.*953faae2c4.OnCloseButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbdbb4c
	void OnOkayButtonClicked(); // Function TslGame.*953faae2c4.OnOkayButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbdbb4c
};

// Class TslGame.*c03b1ac3a3
// Size: 0x4c8 (Inherited: 0x480)
struct U*c03b1ac3a3 : U*953faae2c4 {
	struct F*f0cac2bec7 VerticalBox; // 0x480(0x28)
	struct UClass* *8c9098e50a; // 0x4a8(0x08)
	char pad_4B0[0x18]; // 0x4b0(0x18)
};

// Class TslGame.*3c1c3f404e
// Size: 0x4e0 (Inherited: 0x418)
struct U*3c1c3f404e : U*17234a7c9b {
	struct F*d3069d51ff OilGaugeImageBinder; // 0x418(0x28)
	struct F*d3069d51ff OilGaugeBgImageBinder; // 0x440(0x28)
	struct F*d3069d51ff OilArrowImageBinder; // 0x468(0x28)
	struct F*0d3e7cd17a GaugeBodyBinder; // 0x490(0x28)
	struct FLinearColor NormalColor; // 0x4b8(0x10)
	struct FLinearColor FuelEmptyColor; // 0x4c8(0x10)
	struct FName GaugePramName; // 0x4d8(0x08)
};

// Class TslGame.*229763a82b
// Size: 0x548 (Inherited: 0x4e0)
struct U*229763a82b : U*3c1c3f404e {
	char pad_4E0[0x8]; // 0x4e0(0x08)
	struct F*e9e2558d2e BoostGauge_Using; // 0x4e8(0x20)
	struct F*e9e2558d2e BoostGauge_Normal; // 0x508(0x20)
	struct F*e9e2558d2e BoostGauge_CantUse; // 0x528(0x20)
};

// Class TslGame.*a4c013a5c3
// Size: 0x448 (Inherited: 0x418)
struct U*a4c013a5c3 : U*17234a7c9b {
	struct UCheckBox* DriverCheckBox; // 0x418(0x08)
	struct UTextBlock* ChannelTextBlock; // 0x420(0x08)
	struct UProgressBar* VolumeProgressBar; // 0x428(0x08)
	struct USlider* PlayTimeBar; // 0x430(0x08)
	float *566c56b4b7; // 0x438(0x04)
	float *8407c9dca0; // 0x43c(0x04)
	bool *feb1f27e0e; // 0x440(0x01)
	bool *9ac7554482; // 0x441(0x01)
	bool *c972009a62; // 0x442(0x01)
	char pad_443[0x5]; // 0x443(0x05)
};

// Class TslGame.*2460094d76
// Size: 0x460 (Inherited: 0x418)
struct U*2460094d76 : U*17234a7c9b {
	int32 SeatIndex; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct FName StateParamName; // 0x420(0x08)
	struct F*d3069d51ff SeatImageBinder; // 0x428(0x28)
	struct APawn* *5a49690b64; // 0x450(0x08)
	struct U*5a1c6e8353* *473534eb52; // 0x458(0x08)

	void GetSeatState(); // Function TslGame.*2460094d76.GetSeatState // Native|Event|Protected|BlueprintEvent|Const // @ game+0x7262e0
};

// Class TslGame.*70c76f5bfa
// Size: 0x590 (Inherited: 0x418)
struct U*70c76f5bfa : U*17234a7c9b {
	struct F*f0cac2bec7 *03ac4360ab; // 0x418(0x28)
	struct F*7f3debddd2 *ffbf377a61; // 0x440(0x20)
	struct F*f4f57b85a2 *49032d98bf; // 0x460(0x20)
	struct F*f4f57b85a2 *c49271e9b0; // 0x480(0x20)
	struct F*c233adf9bd *c762dd0eda; // 0x4a0(0x20)
	struct F*c233adf9bd *2daf39f189; // 0x4c0(0x20)
	struct F*c233adf9bd *72985d767e; // 0x4e0(0x20)
	struct F*e9e2558d2e *20f8117693; // 0x500(0x20)
	struct F*e9e2558d2e *fa5855502f; // 0x520(0x20)
	struct F*e9e2558d2e *10a286b330; // 0x540(0x20)
	struct F*e9e2558d2e *97e54170fe; // 0x560(0x20)
	struct APawn* *5a49690b64; // 0x580(0x08)
	struct UUserWidget* *4c1a98e993; // 0x588(0x08)
};

// Class TslGame.*42297812cd
// Size: 0x4f0 (Inherited: 0x418)
struct U*42297812cd : U*17234a7c9b {
	struct F*f0cac2bec7 MainSizeBoxBinder; // 0x418(0x28)
	struct F*f23e4e6c9e MainCanvasBinder; // 0x440(0x28)
	struct F*607bfdb0fb VehicleIconInvalidationBoxBinder; // 0x468(0x28)
	struct F*f0cac2bec7 VehicleIconBoxBinder; // 0x490(0x28)
	struct F*d3069d51ff VehicleIconImageBinder; // 0x4b8(0x28)
	struct APawn* *5a49690b64; // 0x4e0(0x08)
	char pad_4E8[0x8]; // 0x4e8(0x08)
};

// Class TslGame.*aa8ac8a36c
// Size: 0x428 (Inherited: 0x418)
struct U*aa8ac8a36c : U*17234a7c9b {
	struct UProgressBar* ThrottleUp; // 0x418(0x08)
	struct UProgressBar* ThrottleDown; // 0x420(0x08)
};

// Class TslGame.*94877bdf65
// Size: 0x4a0 (Inherited: 0x418)
struct U*94877bdf65 : U*17234a7c9b {
	struct F*fd985b6c41 WheelColorSet; // 0x418(0x10)
	int32 WheelIndex; // 0x428(0x04)
	float HeavyDamagedThreshold; // 0x42c(0x04)
	struct F*d3069d51ff WheelImageBinder; // 0x430(0x28)
	struct F*d3069d51ff PunctureImageBinder; // 0x458(0x28)
	struct ATslWheeledVehicle* *5a49690b64; // 0x480(0x08)
	struct UTslWheeledVehicleMovement* *97ef1efd01; // 0x488(0x08)
	struct FName *3ad2a75205; // 0x490(0x08)
	struct FName *3a13bd1baa; // 0x498(0x08)
};

// Class TslGame.*ae27e747ae
// Size: 0x448 (Inherited: 0x418)
struct U*ae27e747ae : U*17234a7c9b {
	bool bReturnEmptyVersionTextIfNickNameInvalid; // 0x418(0x01)
	bool bHideRegionIfInvalid; // 0x419(0x01)
	char pad_41A[0x6]; // 0x41a(0x06)
	struct F*f4f57b85a2 VersionInfoTextBinder; // 0x420(0x20)
	bool bHideInfraCodeIfInvalid; // 0x440(0x01)
	bool *dd3683235e; // 0x441(0x01)
	char pad_442[0x6]; // 0x442(0x06)

	void ForceUpdate(); // Function TslGame.*ae27e747ae.ForceUpdate // Final|Native|Public // @ game+0x59b970c
};

// Class TslGame.*33fef58208
// Size: 0x460 (Inherited: 0x418)
struct U*33fef58208 : U*17234a7c9b {
	struct F*c233adf9bd *e44486e28b; // 0x418(0x20)
	struct F*91cf62c1f2 *812bd49e2e; // 0x438(0x28)
};

// Class TslGame.*173d3bfecd
// Size: 0x4a0 (Inherited: 0x418)
struct U*173d3bfecd : U*17234a7c9b {
	struct F*f4f57b85a2 *369e178bed; // 0x418(0x20)
	struct U*0399764a34* TeamLeaderNameFlowText; // 0x438(0x08)
	struct F*f4f57b85a2 *0fb733d583; // 0x440(0x20)
	struct FLinearColor *352d4a1bd5; // 0x460(0x10)
	struct FLinearColor *cc7a0582c5; // 0x470(0x10)
	struct F*7f3debddd2 *e0b3947bd9; // 0x480(0x20)
};

// Class TslGame.*127c5d0f80
// Size: 0x6b0 (Inherited: 0x418)
struct U*127c5d0f80 : U*17234a7c9b {
	struct TMap<int32, struct F*dcd05136fe> *4cfe108b5e; // 0x418(0x50)
	struct TArray<struct F*f0cac2bec7> *584a9ab14d; // 0x468(0x10)
	struct TArray<struct F*c69f8ed24a> *0eb8debf84; // 0x478(0x10)
	struct TArray<struct F*f4f57b85a2> *553328e89e; // 0x488(0x10)
	struct TArray<struct F*d3069d51ff> *fa59003db9; // 0x498(0x10)
	struct TArray<struct F*f4f57b85a2> *dd1fd7f2e0; // 0x4a8(0x10)
	struct TArray<struct F*f4f57b85a2> *73ad8f332b; // 0x4b8(0x10)
	struct TArray<struct F*f0cac2bec7> *ba81cf1caf; // 0x4c8(0x10)
	struct F*c233adf9bd *0e3d55a32a; // 0x4d8(0x20)
	struct UClass* *1a732852aa; // 0x4f8(0x08)
	int32 *d67f5492f8; // 0x500(0x04)
	char pad_504[0x4]; // 0x504(0x04)
	struct FName *ac8ec2905d; // 0x508(0x08)
	char pad_510[0x1a0]; // 0x510(0x1a0)

	void OnRep_StartModeProperties(); // Function TslGame.*127c5d0f80.OnRep_StartModeProperties // Final|Native|Protected|HasOutParms // @ game+0x59c1870
	void OnScoreChanged(); // Function TslGame.*127c5d0f80.OnScoreChanged // Final|Native|Protected // @ game+0x59c1fe0
	void *c29d14e6d6(); // Function TslGame.*127c5d0f80.*c29d14e6d6 // Final|Native|Static|Public // @ game+0x59bf374
	void *b17ee2b1af(); // Function TslGame.*127c5d0f80.*b17ee2b1af // Final|Native|Protected // @ game+0x59c0eb0
};

// Class TslGame.*0fc647e9fa
// Size: 0x548 (Inherited: 0x418)
struct U*0fc647e9fa : U*17234a7c9b {
	struct F*b9afef7a3a *32a208b606; // 0x418(0x28)
	struct F*e9e2558d2e *0fb4033b8c; // 0x440(0x20)
	struct F*e9e2558d2e *9c89684a10; // 0x460(0x20)
	struct F*e9e2558d2e *45175a0200; // 0x480(0x20)
	struct F*e9e2558d2e *d28397d13a; // 0x4a0(0x20)
	struct F*8e32972a91 *001895b498; // 0x4c0(0x28)
	struct F*d3069d51ff *6b210e4303; // 0x4e8(0x28)
	struct F*d3069d51ff *d5c744c2f3; // 0x510(0x28)
	int32 *5882b8ff4c; // 0x538(0x04)
	float *bcef8cc9c6; // 0x53c(0x04)
	int32 *ca2dcdc85b; // 0x540(0x04)
	bool *8010804542; // 0x544(0x01)
	char pad_545[0x3]; // 0x545(0x03)
};

// Class TslGame.WarModeWidget
// Size: 0x798 (Inherited: 0x418)
struct UWarModeWidget : U*17234a7c9b {
	struct U*830fa4a500* RespawnTimerUpdater; // 0x418(0x08)
	struct U*830fa4a500* TimeLimitTimerUpdater; // 0x420(0x08)
	struct F*c69f8ed24a *9a3c94b320; // 0x428(0x28)
	struct F*f4f57b85a2 *dc4c229d47; // 0x450(0x20)
	struct F*f4f57b85a2 *c2e034e497; // 0x470(0x20)
	struct F*b9afef7a3a *dc7f90ddf2; // 0x490(0x28)
	struct F*f4f57b85a2 *319daf83b9; // 0x4b8(0x20)
	struct F*f4f57b85a2 *4290d66ec5; // 0x4d8(0x20)
	struct F*f4f57b85a2 *73e5ecc101; // 0x4f8(0x20)
	struct F*f4f57b85a2 *cb2fedd8ba; // 0x518(0x20)
	struct F*f4f57b85a2 *d4a99bcbfd; // 0x538(0x20)
	struct F*f4f57b85a2 *f4bd4f0f6a; // 0x558(0x20)
	struct F*f4f57b85a2 *075603d70a; // 0x578(0x20)
	struct F*f4f57b85a2 *f101f00e6f; // 0x598(0x20)
	struct F*f4f57b85a2 *244a219887; // 0x5b8(0x20)
	struct F*f4f57b85a2 *3b0478344e; // 0x5d8(0x20)
	struct F*e9e2558d2e *dfc8a8df4f; // 0x5f8(0x20)
	struct F*e9e2558d2e *2a5a084875; // 0x618(0x20)
	struct F*b9afef7a3a *32a208b606; // 0x638(0x28)
	struct F*e9e2558d2e *0fb4033b8c; // 0x660(0x20)
	struct F*e9e2558d2e *9c89684a10; // 0x680(0x20)
	struct F*e9e2558d2e *45175a0200; // 0x6a0(0x20)
	struct F*e9e2558d2e *d28397d13a; // 0x6c0(0x20)
	struct F*8e32972a91 *001895b498; // 0x6e0(0x28)
	struct F*d3069d51ff *6b210e4303; // 0x708(0x28)
	struct F*d3069d51ff *d5c744c2f3; // 0x730(0x28)
	struct F*f23e4e6c9e *b1352339af; // 0x758(0x28)
	char pad_780[0x18]; // 0x780(0x18)

	void OnTimeLimitUpdated(); // Function TslGame.WarModeWidget.OnTimeLimitUpdated // Final|Native|Protected // @ game+0x59c2acc
	void OnModeStrated(); // Function TslGame.WarModeWidget.OnModeStrated // Final|Native|Protected|HasOutParms // @ game+0x59bfca0
	void ShowInstantRespawnMessage(); // Function TslGame.WarModeWidget.ShowInstantRespawnMessage // Final|Native|Private // @ game+0x59cbfec
	void *c29d14e6d6(); // Function TslGame.WarModeWidget.*c29d14e6d6 // Final|Native|Protected // @ game+0x59bf44c
	void OnHighEnemyScoreChanged(); // Function TslGame.WarModeWidget.OnHighEnemyScoreChanged // Final|Native|Protected // @ game+0x59becc4
	void OnMyTeamRankChanged(); // Function TslGame.WarModeWidget.OnMyTeamRankChanged // Final|Native|Protected // @ game+0x59c0160
	void OnRespawnTimeUpdated(); // Function TslGame.WarModeWidget.OnRespawnTimeUpdated // Final|Native|Protected // @ game+0x59c1cd0
	void CollapseKillcamButtonUI(); // Function TslGame.WarModeWidget.CollapseKillcamButtonUI // Final|Native|Private // @ game+0x59b8368
	void OnModeInitialized(); // Function TslGame.WarModeWidget.OnModeInitialized // Final|Native|Protected|HasOutParms // @ game+0x59bfb18
	void OnMyGainScoreChanged(); // Function TslGame.WarModeWidget.OnMyGainScoreChanged // Final|Native|Protected // @ game+0x59c0034
	void OnMyTeamScoreChanged(); // Function TslGame.WarModeWidget.OnMyTeamScoreChanged // Final|Native|Protected // @ game+0x59c028c
};

// Class TslGame.*3cb5fbdf1d
// Size: 0x7b0 (Inherited: 0x798)
struct U*3cb5fbdf1d : UWarModeWidget {
	struct UWidgetSwitcher* GameTimerBackgroundSwitcher; // 0x798(0x08)
	struct UOverlay* GameTimerOverlay; // 0x7a0(0x08)
	char pad_7A8[0x8]; // 0x7a8(0x08)

	void *9818b2de98(); // Function TslGame.*3cb5fbdf1d.*9818b2de98 // Final|Native|Public // @ game+0x59bd24c
};

// Class TslGame.*a6a2dcf842
// Size: 0x5a8 (Inherited: 0x418)
struct U*a6a2dcf842 : U*17234a7c9b {
	struct F*c233adf9bd CurrentWeaponSlotWidgetBinder; // 0x418(0x20)
	struct TArray<struct F*c233adf9bd> WeaponSlotWidgetBinderList; // 0x438(0x10)
	struct F*959656208f WeaponSlotListBorderBinder; // 0x448(0x30)
	struct F*e9e2558d2e FadeInSlotListAminBinder; // 0x478(0x20)
	struct F*e9e2558d2e FadeOutSlotListAminBinder; // 0x498(0x20)
	float SlotOffsetMultiply; // 0x4b8(0x04)
	float SlotPadding; // 0x4bc(0x04)
	struct F*51f63f4b27 MovingSequence; // 0x4c0(0xa0)
	char pad_560[0x38]; // 0x560(0x38)
	struct F*9c84e0ea54 *dfae79d7c1; // 0x598(0x08)
	struct UWeaponProcessorComponent* *8d1e55cf58; // 0x5a0(0x08)

	void OnNotifyWeaponArmed(); // Function TslGame.*a6a2dcf842.OnNotifyWeaponArmed // Final|Native|Public // @ game+0x59c0604
	void OnMovingStarted(); // Function TslGame.*a6a2dcf842.OnMovingStarted // Final|Native|Public // @ game+0x59bff84
	void OnNotifyWeaponChange(); // Function TslGame.*a6a2dcf842.OnNotifyWeaponChange // Final|Native|Public // @ game+0x59c0618
	void OnNotifyWeaponUnarm(); // Function TslGame.*a6a2dcf842.OnNotifyWeaponUnarm // Final|Native|Public // @ game+0x59c07d8
	void *e5b3630c17(); // Function TslGame.*a6a2dcf842.*e5b3630c17 // Final|Native|Public // @ game+0x59bff70
};

// Class TslGame.*0e8d4a8c4c
// Size: 0x438 (Inherited: 0x418)
struct U*0e8d4a8c4c : U*17234a7c9b {
	struct UTextBlock* Purchase_Text; // 0x418(0x08)
	struct UTextBlock* Price_Text; // 0x420(0x08)
	struct UWidgetSwitcher* Key_Switcher; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)

	void OnNotifyWeaponChange(); // Function TslGame.*0e8d4a8c4c.OnNotifyWeaponChange // Final|Native|Public // @ game+0x59c06f8
};

// Class TslGame.*dff1a3725f
// Size: 0x438 (Inherited: 0x418)
struct U*dff1a3725f : U*17234a7c9b {
	struct U*0399764a34* PlayerName; // 0x418(0x08)
	struct UTextBlock* Score_Text; // 0x420(0x08)
	struct UTextBlock* Rank_Text; // 0x428(0x08)
	struct U*7f757909f6* PlatformIcon; // 0x430(0x08)
};

// Class TslGame.*5bb029d6ef
// Size: 0x430 (Inherited: 0x418)
struct U*5bb029d6ef : U*17234a7c9b {
	struct UWrapBox* RankingList_WrapBox; // 0x418(0x08)
	char pad_420[0x10]; // 0x420(0x10)

	void RefreshInfo(); // Function TslGame.*5bb029d6ef.RefreshInfo // Final|Native|Public // @ game+0x59c4c7c
};

// Class TslGame.*c50a04078d
// Size: 0x440 (Inherited: 0x418)
struct U*c50a04078d : U*17234a7c9b {
	struct UTextBlock* PlayerName_Text; // 0x418(0x08)
	struct UTextBlock* Kill_Text; // 0x420(0x08)
	struct UTextBlock* Death_Text; // 0x428(0x08)
	struct UTextBlock* Score_Text; // 0x430(0x08)
	struct U*7f757909f6* PlatformIcon; // 0x438(0x08)
};

// Class TslGame.*dc31d4d60d
// Size: 0x478 (Inherited: 0x418)
struct U*dc31d4d60d : U*17234a7c9b {
	struct F*f4f57b85a2 ZeroingdistanceTextBinder; // 0x418(0x20)
	struct F*e9e2558d2e ZeroDistChangeAnimBinder; // 0x438(0x20)
	struct FText ZeroingTextFormat; // 0x458(0x18)
	int32 *d132e85de9; // 0x470(0x04)
	char pad_474[0x4]; // 0x474(0x04)
};

// Class TslGame.*7721787bb5
// Size: 0x4c8 (Inherited: 0x418)
struct U*7721787bb5 : U*17234a7c9b {
	struct U*830fa4a500* TimeLimitTimerUpdater; // 0x418(0x08)
	struct F*f4f57b85a2 TimeLimitTextBinder; // 0x420(0x20)
	struct UTextBlock* Coin_Text; // 0x440(0x08)
	struct UTextBlock* SpendCoin_Text; // 0x448(0x08)
	struct UTextBlock* CurrentStage_Text; // 0x450(0x08)
	struct UTextBlock* TotalStage_Text; // 0x458(0x08)
	struct UVerticalBox* StageInfo; // 0x460(0x08)
	struct UImage* Player_2; // 0x468(0x08)
	struct UImage* Player_3; // 0x470(0x08)
	struct UImage* Player_4; // 0x478(0x08)
	struct UImage* Player_5; // 0x480(0x08)
	struct UHorizontalBox* CoinInfo_HorizontalBox; // 0x488(0x08)
	struct U*6b11b3bf02* Anim_ConsumeBullets; // 0x490(0x08)
	struct FName *36cb91ce3d; // 0x498(0x08)
	bool *b7693cf52f; // 0x4a0(0x01)
	char pad_4A1[0x3]; // 0x4a1(0x03)
	float *9f5a968128; // 0x4a4(0x04)
	bool *19e13f2625; // 0x4a8(0x01)
	bool *2c77d2b992; // 0x4a9(0x01)
	char pad_4AA[0x1e]; // 0x4aa(0x1e)

	void OnTimeLimitUpdated(); // Function TslGame.*7721787bb5.OnTimeLimitUpdated // Final|Native|Protected // @ game+0x59c2be8
	void *201efe36b9(); // Function TslGame.*7721787bb5.*201efe36b9 // Final|Native|Protected // @ game+0x59c3cf0
	void *904d26a7d2(); // Function TslGame.*7721787bb5.*904d26a7d2 // Final|Native|Protected // @ game+0x59be45c
	void OnMatchStarted(); // Function TslGame.*7721787bb5.OnMatchStarted // Final|Native|Protected // @ game+0x59bf6b4
	void *40dea6b630(); // Function TslGame.*7721787bb5.*40dea6b630 // Final|Native|Public // @ game+0x59c4db4
	void *c29d14e6d6(); // Function TslGame.*7721787bb5.*c29d14e6d6 // Final|Native|Protected // @ game+0x59bf4e0
	void OnCraftFinished(); // Function TslGame.*7721787bb5.OnCraftFinished // Final|Native|Public|HasOutParms // @ game+0x59bddbc
	void *8e0a56a149(); // Function TslGame.*7721787bb5.*8e0a56a149 // Final|Native|Protected // @ game+0x59c4390
	void UpdateCoin(); // Function TslGame.*7721787bb5.UpdateCoin // Final|Native|Public // @ game+0x59cd0f0
	void *4cb6657db6(); // Function TslGame.*7721787bb5.*4cb6657db6 // Final|Native|Protected // @ game+0x59cdb70
	void UpdateTeamMark(); // Function TslGame.*7721787bb5.UpdateTeamMark // Final|Native|Protected // @ game+0x59cdc3c
	void *bd6573aeb6(); // Function TslGame.*7721787bb5.*bd6573aeb6 // Final|Native|Protected // @ game+0x59c2274
	void OnViewTargetChanged(); // Function TslGame.*7721787bb5.OnViewTargetChanged // Final|Native|Protected // @ game+0x59c3834
};

// Class TslGame.ZombieDefenseShopWidget
// Size: 0x4a8 (Inherited: 0x418)
struct UZombieDefenseShopWidget : U*17234a7c9b {
	char pad_418[0x28]; // 0x418(0x28)
	float *fd09578373; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct UTextBlock* Coin_Text; // 0x448(0x08)
	struct UTextBlock* Decrease_Text; // 0x450(0x08)
	struct UWrapBox* ItemList_WrapBox; // 0x458(0x08)
	struct U*6b11b3bf02* Anim_Decrease; // 0x460(0x08)
	struct FName *36cb91ce3d; // 0x468(0x08)
	struct UClass* ItemClass; // 0x470(0x08)
	struct TArray<struct F*dc7416fd19> *0d03f93b1c; // 0x478(0x10)
	struct TArray<struct U*cd8084a8e1*> *11001c7e3e; // 0x488(0x10)
	struct U*e2c62067d8* *9021b92759; // 0x498(0x08)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void UpdateGoldCoin(); // Function TslGame.ZombieDefenseShopWidget.UpdateGoldCoin // Final|Native|Protected // @ game+0x59cd3f8
	void UpdateGoldCoinStackCount(); // Function TslGame.ZombieDefenseShopWidget.UpdateGoldCoinStackCount // Final|Native|Protected|HasOutParms // @ game+0x59cd40c
	void OnCraftableItemCountChanged(); // Function TslGame.ZombieDefenseShopWidget.OnCraftableItemCountChanged // Final|Native|Protected // @ game+0x59bdeb8
};

// Class TslGame.*3cc1ef1fc1
// Size: 0x518 (Inherited: 0x4a8)
struct U*3cc1ef1fc1 : UZombieDefenseShopWidget {
	struct F*c233adf9bd *11b31e1df5; // 0x4a8(0x20)
	struct F*c233adf9bd *58f4ad784a; // 0x4c8(0x20)
	struct F*d3069d51ff *8c9539bf8c; // 0x4e8(0x28)
	int32 SlotIndex; // 0x510(0x04)
	bool *f201fc3b66; // 0x514(0x01)
	char pad_515[0x3]; // 0x515(0x03)
};

// Class TslGame.*afe89d7675
// Size: 0x270 (Inherited: 0x200)
struct U*afe89d7675 : UActorComponent {
	char pad_200[0x8]; // 0x200(0x08)
	bool *a233a29eba; // 0x208(0x01)
	char pad_209[0x7]; // 0x209(0x07)
	struct ATslRope* *2cfc205a48; // 0x210(0x08)
	struct AAscenderItemBase* *1942d09171; // 0x218(0x08)
	struct FRotator *0ce5d3e4af; // 0x220(0x0c)
	bool *7b0928ae3f; // 0x22c(0x01)
	char pad_22D[0x3]; // 0x22d(0x03)
	struct UAkComponent* AkSoundComp; // 0x230(0x08)
	float *beb5faacc3; // 0x238(0x04)
	char pad_23C[0x34]; // 0x23c(0x34)

	void OnRep_CurrentAscenderRope(); // Function TslGame.*afe89d7675.OnRep_CurrentAscenderRope // Final|Native|Private // @ game+0x59c125c
	void *b18527c263(); // Function TslGame.*afe89d7675.*b18527c263 // Final|Net|NetReliableNative|Event|Private|NetClient // @ game+0x59b7cb0
	void OnRep_IsAttachedToAscender(); // Function TslGame.*afe89d7675.OnRep_IsAttachedToAscender // Final|Native|Private // @ game+0x59c16c8
	void OnRep_HeldItem(); // Function TslGame.*afe89d7675.OnRep_HeldItem // Final|Native|Private // @ game+0x59c168c
	void *e28f2b5e03(); // Function TslGame.*afe89d7675.*e28f2b5e03 // Final|Native|Private // @ game+0x59baf34
	void *992f4babda(); // Function TslGame.*afe89d7675.*992f4babda // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x59c580c
	void *225f8658ad(); // Function TslGame.*afe89d7675.*225f8658ad // Final|Native|Private // @ game+0x59b8a88
	void *5499a1c62b(); // Function TslGame.*afe89d7675.*5499a1c62b // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x59c9498
};

// Class TslGame.TslVaultingHelper
// Size: 0x418 (Inherited: 0x408)
struct ATslVaultingHelper : AActor {
	struct USceneComponent* RootSceneComponent; // 0x408(0x08)
	struct USceneComponent* ActorAttachScene; // 0x410(0x08)

	void *8099579fee(); // Function TslGame.TslVaultingHelper.*8099579fee // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x59b97c4
};

// Class TslGame.TslVehicleAIManager
// Size: 0x860 (Inherited: 0x408)
struct ATslVehicleAIManager : AActor {
	char pad_408[0x10]; // 0x408(0x10)
	bool bDrawDebugInEditor; // 0x418(0x01)
	bool bDebugTargetLocation; // 0x419(0x01)
	char pad_41A[0x2]; // 0x41a(0x02)
	struct FVector DebugTargetLocation; // 0x41c(0x0c)
	struct TMap<struct F*f84ceae64b, struct F*de61ae727e> DebugTargetPointDistances; // 0x428(0x50)
	bool bOnlySpawnInSafetyZone; // 0x478(0x01)
	bool bQueueSpawns; // 0x479(0x01)
	char pad_47A[0x6]; // 0x47a(0x06)
	struct UDataTable* VehicleSpawnDataTable; // 0x480(0x20)
	struct FName AIPawnTag; // 0x4a0(0x08)
	int32 MaxConcurrentVehicles; // 0x4a8(0x04)
	int32 MaxVehiclesPerGame; // 0x4ac(0x04)
	char pad_4B0[0x4]; // 0x4b0(0x04)
	float SpawnPointCooldown; // 0x4b4(0x04)
	struct FName CurrentPathKeyName; // 0x4b8(0x08)
	struct FName CurrentPathInputKeyKeyName; // 0x4c0(0x08)
	struct FName PreviousPathInputKeyKeyName; // 0x4c8(0x08)
	struct FName IsPathingInReverseKeyName; // 0x4d0(0x08)
	struct FName IsStoppedKeyName; // 0x4d8(0x08)
	struct FName IsDebugForceStoppedKeyName; // 0x4e0(0x08)
	struct FName TargetPathKeyName; // 0x4e8(0x08)
	struct FName TargetPathInputKeyKeyName; // 0x4f0(0x08)
	struct FName UseSidePathsKeyName; // 0x4f8(0x08)
	enum class EVehicleAIAvoidanceMode AvoidanceMode; // 0x500(0x01)
	char pad_501[0x3]; // 0x501(0x03)
	float InitRetryDelay; // 0x504(0x04)
	int32 MaxInitRetries; // 0x508(0x04)
	char pad_50C[0x1c]; // 0x50c(0x1c)
	struct TArray<struct ATslVehicleAISpawner*> *231a48f5e9; // 0x528(0x10)
	struct TArray<struct ATslAIWaypointSegment*> *a85775c3aa; // 0x538(0x10)
	struct TArray<struct ATslVehicleAIPathZone*> *5da57c8695; // 0x548(0x10)
	struct TArray<enum class EGameZoneType> *6f79c83aa6; // 0x558(0x10)
	struct TMap<enum class EGameZoneType, struct F*5d58ecab67> *e6af6fcaab; // 0x568(0x50)
	struct TMap<struct F*f84ceae64b, struct F*1e7dc12f94> *2f1e68056a; // 0x5b8(0x50)
	struct TMap<enum class EGameZoneType, struct F*d7cf67187b> *213c158017; // 0x608(0x50)
	struct TMap<enum class EGameZoneType, struct F*d7cf67187b> *20dbdba838; // 0x658(0x50)
	int32 *3c6036f0c9; // 0x6a8(0x04)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	int32 *8c3cdff035; // 0x6b0(0x04)
	char pad_6B4[0x4]; // 0x6b4(0x04)
	struct TMap<struct ATslVehicleAISpawner*, float> *a8cf752eb4; // 0x6b8(0x50)
	char pad_708[0x58]; // 0x708(0x58)
	struct ATslGameMode* GameMode; // 0x760(0x08)
	char pad_768[0xf8]; // 0x768(0xf8)

	void StartPathZoneCalculations(); // Function TslGame.TslVehicleAIManager.StartPathZoneCalculations // Final|Native|Protected // @ game+0x59cc85c
	void *ff9103bdbd(); // Function TslGame.TslVehicleAIManager.*ff9103bdbd // Final|Native|Protected // @ game+0x59c4a5c
};

// Class TslGame.TslVehicleAIPathZone
// Size: 0x418 (Inherited: 0x408)
struct ATslVehicleAIPathZone : AActor {
	struct UBoxComponent* ZoneVolume; // 0x408(0x08)
	struct FName *fffc508c4e; // 0x410(0x08)
};

// Class TslGame.TslVehicleAISpawner
// Size: 0x458 (Inherited: 0x408)
struct ATslVehicleAISpawner : AActor {
	struct FGuid ID; // 0x408(0x10)
	struct FString SpawnTag; // 0x418(0x10)
	bool bIsSingleUse; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct USceneComponent* SpawnPoint; // 0x430(0x08)
	struct F*8d353075d0 StartingPath; // 0x438(0x10)
	float InitializeVehicleBehaviorDelay; // 0x448(0x04)
	bool bUsed; // 0x44c(0x01)
	char pad_44D[0x3]; // 0x44d(0x03)
	struct ATslVehicleAIManager* *8f3e634279; // 0x450(0x08)

	void *0560a1a9cf(); // Function TslGame.TslVehicleAISpawner.*0560a1a9cf // Native|Public // @ game+0x59c49a4
	void *7b12953e2b(); // Function TslGame.TslVehicleAISpawner.*7b12953e2b // Final|Native|Protected|BlueprintCallable // @ game+0x59b83f8
	void *0973d27aa9(); // Function TslGame.TslVehicleAISpawner.*0973d27aa9 // Native|Public // @ game+0x59c21e0
};

// Class TslGame.TslLootTruckAISpawner
// Size: 0x490 (Inherited: 0x458)
struct ATslLootTruckAISpawner : ATslVehicleAISpawner {
	struct USkeletalMeshComponent* DoorSkeletalMesh; // 0x458(0x08)
	struct UStaticMeshComponent* DoorStaticMesh; // 0x460(0x08)
	struct UStaticMeshComponent* DoorFrameStaticMesh; // 0x468(0x08)
	struct UStaticMeshComponent* GarageStaticMesh; // 0x470(0x08)
	struct UAkComponent* DoorSlideAudio; // 0x478(0x08)
	struct UAkAudioEvent* DoorSlideAudioEvent; // 0x480(0x08)
	float DoorOpeningTime; // 0x488(0x04)
	bool *b707dc1e43; // 0x48c(0x01)
	bool *fcdb256d84; // 0x48d(0x01)
	char pad_48E[0x2]; // 0x48e(0x02)

	void FinishGarageOpening(); // Function TslGame.TslLootTruckAISpawner.FinishGarageOpening // Final|Native|Private // @ game+0x59b9654
	void OnRep_GarageOpening(); // Function TslGame.TslLootTruckAISpawner.OnRep_GarageOpening // Final|Native|Private // @ game+0x59c1678
	void SetSkeletalMeshShouldUpdate(); // Function TslGame.TslLootTruckAISpawner.SetSkeletalMeshShouldUpdate // Final|Native|Private // @ game+0x59cb4cc
	void OnRep_Opened(); // Function TslGame.TslLootTruckAISpawner.OnRep_Opened // Final|Native|Private // @ game+0x59c1750
	void *aba97f226c(); // Function TslGame.TslLootTruckAISpawner.*aba97f226c // Final|Native|Private // @ game+0x59ba820
	void *0973d27aa9(); // Function TslGame.TslLootTruckAISpawner.*0973d27aa9 // Final|Native|Public // @ game+0x59c21e0
	void *0560a1a9cf(); // Function TslGame.TslLootTruckAISpawner.*0560a1a9cf // Final|Native|Public // @ game+0x59c49a4
};

// Class TslGame.*40d06648ff
// Size: 0xd30 (Inherited: 0x910)
struct U*40d06648ff : UVehicleAnimInstance {
	struct FRotator Rot_Steering_Left; // 0x908(0x0c)
	struct FRotator Rot_Steering_Right; // 0x914(0x0c)
	struct FRotator Rot_Steering_Final; // 0x920(0x0c)
	struct FRotator Rot_Speed_Left; // 0x92c(0x0c)
	struct FRotator Rot_Speed_Right; // 0x938(0x0c)
	float SpeedMax; // 0x944(0x04)
	struct FRotator Rot_Speed_Final; // 0x948(0x0c)
	struct FRotator Rot_RPM_Left; // 0x954(0x0c)
	struct FRotator Rot_RPM_Right; // 0x960(0x0c)
	float RPMMax; // 0x96c(0x04)
	struct FRotator Rot_Fuel_Empty; // 0x970(0x0c)
	struct FRotator Rot_Fuel_Full; // 0x97c(0x0c)
	struct FRotator Rot_Fuel_Final; // 0x988(0x0c)
	bool bTickSpeedIndicator; // 0x994(0x01)
	bool bTickRPMIndicator; // 0x995(0x01)
	bool bTickFuelIndicator; // 0x996(0x01)
	bool bUseAbsoluteSteeringRotation; // 0x997(0x01)
	bool bTickMotorbikeBody; // 0x998(0x01)
	struct FVector4 SpeedInMap; // 0x9a0(0x10)
	struct FVector4 SpeedOutMap; // 0x9b0(0x10)
	struct FVector4 DotVelocityMap; // 0x9c0(0x10)
	float DotVelocityPower; // 0x9d0(0x04)
	struct FVector2D LateralVelocityCompClamp; // 0x9d4(0x08)
	float LateralVelocityScalar; // 0x9dc(0x04)
	struct FVector4 SteerLowSpeedMap; // 0x9e0(0x10)
	float SteerLowSpeedStaticOffset; // 0x9f0(0x04)
	char pad_9F5[0xb]; // 0x9f5(0x0b)
	struct FVector4 SteerHighSpeedMap; // 0xa00(0x10)
	float SteerHighSpeedStaticOffset; // 0xa10(0x04)
	char pad_A14[0xc]; // 0xa14(0x0c)
	struct FVector4 SteerLERPSpeedMap; // 0xa20(0x10)
	struct FRotator *c075ea7492; // 0xa30(0x0c)
	struct FVector2D *cf15ea1a7d; // 0xa3c(0x08)
	char pad_A44[0xc]; // 0xa44(0x0c)
	struct FVector4 SteerRollMap; // 0xa50(0x10)
	bool bTickMotorbikeKickstand; // 0xa60(0x01)
	bool bUseInvertedKickstandAlpha; // 0xa61(0x01)
	char pad_A62[0x2]; // 0xa62(0x02)
	struct FRotator KickstandOffRotation; // 0xa64(0x0c)
	float KicstandInterpSpeed; // 0xa70(0x04)
	bool bUseSpeedRollMap; // 0xa74(0x01)
	char pad_A75[0x3]; // 0xa75(0x03)
	struct FVector2D LowSpeedRollMapIn; // 0xa78(0x08)
	struct FVector2D HighSpeedRollMapIn; // 0xa80(0x08)
	struct FRotator Rot_RPM_Final; // 0xa88(0x0c)
	char pad_A94[0x4]; // 0xa94(0x04)
	struct ATslWheeledVehicle* VehicleRef; // 0xa98(0x08)
	struct UTslWheeledVehicleMovement* VehicleMovementRef; // 0xaa0(0x08)
	struct FRotator SteerRollFinal; // 0xaa8(0x0c)
	struct FRotator SteerFL; // 0xab4(0x0c)
	struct FRotator SteerFR; // 0xac0(0x0c)
	struct FRotator BodyLean; // 0xacc(0x0c)
	bool *32c7e6c81f; // 0xad8(0x01)
	char pad_AD9[0x3]; // 0xad9(0x03)
	int32 *6c67822a91; // 0xadc(0x04)
	int32 *b030435a08; // 0xae0(0x04)
	int32 *e9be51ca2a; // 0xae4(0x04)
	int32 *9318ad4e1e; // 0xae8(0x04)
	int32 *b67cc6cb0a; // 0xaec(0x04)
	struct FVector *bbf647a519; // 0xaf0(0x0c)
	struct FVector *e3ebeb8906; // 0xafc(0x0c)
	bool *c359886ff6; // 0xb08(0x01)
	char pad_B09[0x3]; // 0xb09(0x03)
	struct FVector *f106a6666a; // 0xb0c(0x0c)
	struct FRotator DriveshaftR_Rot; // 0xb18(0x0c)
	struct FRotator DriveshaftR_Rot_Reversed; // 0xb24(0x0c)
	float KickstandAlpha; // 0xb30(0x04)
	bool *7fe96b25b8; // 0xb34(0x01)
	char pad_B35[0x3]; // 0xb35(0x03)
	struct TArray<int32> *9049b65ae1; // 0xb38(0x10)
	float *f08b24e8c8; // 0xb48(0x04)
	struct FVector AveragedWheelNormal; // 0xb4c(0x0c)
	struct FRotator AveragedWheelNormalRot; // 0xb58(0x0c)
	float SteerRollByWheelNormalScalar; // 0xb64(0x04)
	bool *45cbc953cf; // 0xb68(0x01)
	bool *9cf25d7676; // 0xb69(0x01)
	char pad_B6A[0x2]; // 0xb6a(0x02)
	struct FVector *3e0be11b29; // 0xb6c(0x0c)
	struct FVector *e396364abf; // 0xb78(0x0c)
	float *f0635190c3; // 0xb84(0x04)
	float *7df8cbf404; // 0xb88(0x04)
	float *693d73e799; // 0xb8c(0x04)
	char pad_B90[0xc]; // 0xb90(0x0c)
	float WaterAlpha; // 0xb9c(0x04)
	float FrontSplitterAlpha; // 0xba0(0x04)
	bool *b097a17035; // 0xba4(0x01)
	bool *55c321efea; // 0xba5(0x01)
	bool *4c3961bb4a; // 0xba6(0x01)
	bool *69a11bd7b0; // 0xba7(0x01)
	bool *6630c8ac19; // 0xba8(0x01)
	char pad_BA9[0x3]; // 0xba9(0x03)
	float *1fb9e50f62; // 0xbac(0x04)
	float DragScale; // 0xbb0(0x04)
	float *3c2b2fb130; // 0xbb4(0x04)
	float GravityScale; // 0xbb8(0x04)
	struct FVector ExternalForceAD; // 0xbbc(0x0c)
	struct FVector ExternalForceAD_World; // 0xbc8(0x0c)
	struct FVector ExternalForceAD_NoDrag; // 0xbd4(0x0c)
	struct FVector2D *448c07496f; // 0xbe0(0x08)
	struct FRotator HighShake; // 0xbe8(0x0c)
	struct FRotator MidShake; // 0xbf4(0x0c)
	struct FRotator LowShake; // 0xc00(0x0c)
	struct FRotator LowShakeReversed; // 0xc0c(0x0c)
	float EngineRPM_Alpha; // 0xc18(0x04)
	bool *022b3bd8c5; // 0xc1c(0x01)
	char pad_C1D[0x3]; // 0xc1d(0x03)
	struct FBox *e9e8fbbdea; // 0xc20(0x1c)
	struct FBox *796c14b8da; // 0xc3c(0x1c)
	struct FBox *9b3a74b879; // 0xc58(0x1c)
	float *730445050b; // 0xc74(0x04)
	float *47f9549e18; // 0xc78(0x04)
	bool *81d0651225; // 0xc7c(0x01)
	char pad_C7D[0x3]; // 0xc7d(0x03)
	struct FRotator *ee0c95a796; // 0xc80(0x0c)
	struct FRotator *c71c7c3e6c; // 0xc8c(0x0c)
	float *0fd819ab59; // 0xc98(0x04)
	float *a62ed06a41; // 0xc9c(0x04)
	struct FRotator AdditiveBoneRot; // 0xca0(0x0c)
	struct FRotator AdditiveBoneRot2; // 0xcac(0x0c)
	float WheelContactAlpha; // 0xcb8(0x04)
	bool *87f2e8789f; // 0xcbc(0x01)
	char pad_CBD[0x3]; // 0xcbd(0x03)
	float AimBackAlpha; // 0xcc0(0x04)
	bool *8fbf66fe27; // 0xcc4(0x01)
	char pad_CC5[0x3]; // 0xcc5(0x03)
	struct FVector2D ThrottleBasedSprintMap; // 0xcc8(0x08)
	struct FVector PedalLocationOffset_Sprint; // 0xcd0(0x0c)
	float PedalRotAlphaScale; // 0xcdc(0x04)
	struct FVector CurrentPedalLocationOffset; // 0xce0(0x0c)
	float PedalRotAlpha; // 0xcec(0x04)
	float ScaledPedalRotAlpha; // 0xcf0(0x04)
	struct FRotator CrankShaftRot; // 0xcf4(0x0c)
	float SprintAlpha; // 0xd00(0x04)
	float SpecialActionAlpha; // 0xd04(0x04)
	char pad_D08[0x28]; // 0xd08(0x28)
};

// Class TslGame.TslWheeledVehicle
// Size: 0xf70 (Inherited: 0x478)
struct ATslWheeledVehicle : AWheeledVehicle {
	char pad_478[0x80]; // 0x478(0x80)
	struct FMulticastDelegate *a07d2e7f8f; // 0x4f8(0x10)
	struct UInteractionComponent* *33a62c60ec; // 0x508(0x08)
	char pad_510[0x168]; // 0x510(0x168)
	struct TArray<struct UMeshComponent*> *505aa77fe7; // 0x678(0x10)
	char pad_688[0x18]; // 0x688(0x18)
	struct U*f478030d5d* *f478030d5d; // 0x6a0(0x08)
	struct UGamePadInputAixsComponent* GamePadInputAixsComponent; // 0x6a8(0x08)
	struct F*7e6fa106d6 *5c9e00781f; // 0x6b0(0x58)
	char pad_708[0x8]; // 0x708(0x08)
	bool *1830d185b2; // 0x710(0x01)
	char pad_711[0x3]; // 0x711(0x03)
	float *53a86c3cea; // 0x714(0x04)
	char pad_718[0x10]; // 0x718(0x10)
	struct TArray<struct UStaticMeshComponent*> *b543d6b705; // 0x728(0x10)
	struct TArray<struct UStaticMeshComponent*> *5b16c95f03; // 0x738(0x10)
	bool *4d230cd112; // 0x748(0x01)
	char pad_749[0x3]; // 0x749(0x03)
	float *21e920dcd6; // 0x74c(0x04)
	float *6fc5eb6cac; // 0x750(0x04)
	float *7c9225e7bc; // 0x754(0x04)
	char bCanTiresBePunctured : 1; // 0x758(0x01)
	char *e8a8d757af : 1; // 0x758(0x01)
	char pad_758_2 : 6; // 0x758(0x01)
	char pad_759[0x7]; // 0x759(0x07)
	struct TMap<enum class EDamageTypeCategory, float> *5975cd04e7; // 0x760(0x50)
	struct FName HeadLampBrightnessParameterName; // 0x7b0(0x08)
	struct FName TailLampBrightnessParameterName; // 0x7b8(0x08)
	struct FVector2D *1a6f4cb2d3; // 0x7c0(0x08)
	struct FVector2D *e4b1aff9a1; // 0x7c8(0x08)
	struct FVector2D *e4ad0fa143; // 0x7d0(0x08)
	struct FVector2D *d928a9f218; // 0x7d8(0x08)
	struct FVector2D *7cedd6415e; // 0x7e0(0x08)
	struct FVector2D *b5c417e303; // 0x7e8(0x08)
	float *daf7bfc330; // 0x7f0(0x04)
	float *428cf08766; // 0x7f4(0x04)
	float *70c825a68a; // 0x7f8(0x04)
	char pad_7FC[0x4]; // 0x7fc(0x04)
	struct F*47f4f83559 *1b6e51bd83; // 0x800(0x60)
	struct F*47f4f83559 *1cca14fb6b; // 0x860(0x60)
	struct UAkAudioEvent* StopSound; // 0x8c0(0x08)
	struct UAkAudioEvent* *5a514ebb0d; // 0x8c8(0x08)
	float MaxClampThrottleInClutch; // 0x8d0(0x04)
	char pad_8D4[0x4]; // 0x8d4(0x04)
	struct TMap<enum class *d77db828b2, struct F*d4f4966afc> ExhaustPopSettingsMap; // 0x8d8(0x50)
	bool bProcessThrottleReleaseEvent; // 0x928(0x01)
	bool bProcessRevLimiterHitEvent; // 0x929(0x01)
	bool *c37f191756; // 0x92a(0x01)
	char pad_92B[0x5]; // 0x92b(0x05)
	struct F*124ee50766 *124ee50766; // 0x930(0x78)
	struct FName *7f102fd34e; // 0x9a8(0x08)
	struct FName *e9dc28578b; // 0x9b0(0x08)
	bool bApplyTurnOverThirdPersonSpringArm; // 0x9b8(0x01)
	char pad_9B9[0x3]; // 0x9b9(0x03)
	float *0c3e700217; // 0x9bc(0x04)
	struct FVector *bbd232db79; // 0x9c0(0x0c)
	char pad_9CC[0xc]; // 0x9cc(0x0c)
	bool *cd8c872db0; // 0x9d8(0x01)
	char pad_9D9[0x3]; // 0x9d9(0x03)
	float *5473d5d929; // 0x9dc(0x04)
	struct F*6e09a38a03 *bcb030872f; // 0x9e0(0x10)
	struct F*6e09a38a03 *7a1cf68bb8; // 0x9f0(0x10)
	char pad_A00[0x1]; // 0xa00(0x01)
	bool *7d72a7dee0; // 0xa01(0x01)
	char pad_A02[0x6]; // 0xa02(0x06)
	struct UPhysicsConstraintComponent* *5a00bfe93f; // 0xa08(0x08)
	struct UPhysicsConstraintComponent* *0014778c36; // 0xa10(0x08)
	bool *8b4d4252fc; // 0xa18(0x01)
	bool *463df8e1ee; // 0xa19(0x01)
	bool *938b70ceb1; // 0xa1a(0x01)
	bool *795b786bb8; // 0xa1b(0x01)
	struct F*7264b47ffe *7264b47ffe; // 0xa1c(0x94)
	bool *eb2d9207f8; // 0xab0(0x01)
	char pad_AB1[0x3]; // 0xab1(0x03)
	struct F*342e89ddd9 *474322f236; // 0xab4(0x40)
	float *8fed25d438; // 0xaf4(0x04)
	struct FName *657ff00957; // 0xaf8(0x08)
	struct FName *d2072f856d; // 0xb00(0x08)
	float *fad5c49f40; // 0xb08(0x04)
	float *8ae3b3bd84; // 0xb0c(0x04)
	struct FVector2D *728af760d1; // 0xb10(0x08)
	struct FVector2D *ff7c390501; // 0xb18(0x08)
	float *b5f1532ef3; // 0xb20(0x04)
	float *197b229c9a; // 0xb24(0x04)
	float *541225c82d; // 0xb28(0x04)
	struct FVector2D *04e191f60e; // 0xb2c(0x08)
	struct FVector2D *d2883ed869; // 0xb34(0x08)
	float *bfb9a057ab; // 0xb3c(0x04)
	bool *ba6845dfca; // 0xb40(0x01)
	char pad_B41[0x3]; // 0xb41(0x03)
	float *9069cd1ff7; // 0xb44(0x04)
	float *4bd8dbffa0; // 0xb48(0x04)
	bool *1601f676ec; // 0xb4c(0x01)
	char pad_B4D[0x3]; // 0xb4d(0x03)
	struct UCurveFloat* *9180934cac; // 0xb50(0x08)
	struct UCurveFloat* *9969097474; // 0xb58(0x08)
	struct UCurveFloat* *a4ae4e2b54; // 0xb60(0x08)
	struct UCurveFloat* *9b41f3c1fe; // 0xb68(0x08)
	struct UCurveFloat* *44220f6dbd; // 0xb70(0x08)
	struct FName *66ae049796; // 0xb78(0x08)
	float *76cc622462; // 0xb80(0x04)
	struct FVector2D *43edcedc35; // 0xb84(0x08)
	float PingDuration; // 0xb8c(0x04)
	struct FName WorldMarkerAttachSocketName; // 0xb90(0x08)
	struct FVector PingOffset; // 0xb98(0x0c)
	char *270486a716 : 1; // 0xba4(0x01)
	char *6f42d3cbff : 1; // 0xba4(0x01)
	char pad_BA4_2 : 6; // 0xba4(0x01)
	char pad_BA5[0x3]; // 0xba5(0x03)
	struct F*0b356b0090 *a99691a5fa; // 0xba8(0x28)
	float *e0be23304d; // 0xbd0(0x04)
	bool *a53f5a23b5; // 0xbd4(0x01)
	char pad_BD5[0x3]; // 0xbd5(0x03)
	float *6adc0c803e; // 0xbd8(0x04)
	char pad_BDC[0x8]; // 0xbdc(0x08)
	bool bReplaceRadioWithTopLights; // 0xbe4(0x01)
	char pad_BE5[0x3]; // 0xbe5(0x03)
	struct U*3e97c5a753* VehicleHitComponent; // 0xbe8(0x08)
	struct U*d090adf675* CustomDamageEventComponent; // 0xbf0(0x08)
	struct U*456eb1620c* VehicleCommonComponent; // 0xbf8(0x08)
	struct U*5a1c6e8353* VehicleSeatComponent; // 0xc00(0x08)
	struct U*42c3c7f9b7* VehicleEffectComponent; // 0xc08(0x08)
	struct U*7804a94d4d* VehicleSyncComponent; // 0xc10(0x08)
	struct U*5a915b1d2c* *eb51722101; // 0xc18(0x08)
	struct U*0d6077029c* VehicleXRayComponent; // 0xc20(0x08)
	struct UTslPawnInputBindingComponent* TslPawnInputBindingComponent; // 0xc28(0x08)
	struct U*236f014c05* TslGamepadInputComponent; // 0xc30(0x08)
	struct U*b726b9268e* *b726b9268e; // 0xc38(0x08)
	struct UAkComponent* *bad6fc6cd4; // 0xc40(0x08)
	struct U*56790ff05e* RadioAudioComponent; // 0xc48(0x08)
	struct U*0ddd380bc9* TopLightsComponent; // 0xc50(0x08)
	struct U*6c9b903bd2* *0218ebd803; // 0xc58(0x08)
	struct USpringArmComponent* *1fa179cb8e; // 0xc60(0x08)
	struct UCameraComponent* *3b975296dc; // 0xc68(0x08)
	struct U*83f5889ba2* *7ed71cebbb; // 0xc70(0x08)
	struct UBuoyancyForceComponent* BuoyancyForceComponent; // 0xc78(0x08)
	bool *6f9dc6e7e2; // 0xc80(0x01)
	char pad_C81[0x7]; // 0xc81(0x07)
	struct FName *2669384747; // 0xc88(0x08)
	struct UClass* *06ea444d6a; // 0xc90(0x08)
	char pad_C98[0x8]; // 0xc98(0x08)
	struct U*0134b9e50d* BuffComponent; // 0xca0(0x08)
	struct UVehiclePawnInteractionComponent* VehiclePawnInteractionComponent; // 0xca8(0x08)
	struct TArray<struct UClass*> *9990b03fe1; // 0xcb0(0x10)
	char pad_CC0[0x8]; // 0xcc0(0x08)
	bool bProcessAutoEject; // 0xcc8(0x01)
	char pad_CC9[0x3]; // 0xcc9(0x03)
	float AutoEjectGroundDistance; // 0xccc(0x04)
	float AutoEjectRoll; // 0xcd0(0x04)
	float AutoEjectPitch; // 0xcd4(0x04)
	float AutoEject_RiseRate; // 0xcd8(0x04)
	float AutoEject_FallRate; // 0xcdc(0x04)
	char pad_CE0[0x4]; // 0xce0(0x04)
	bool bRunStabilizeOnEntry; // 0xce4(0x01)
	char pad_CE5[0x3]; // 0xce5(0x03)
	float StabilizeInitialTimer; // 0xce8(0x04)
	float *53be4651e6; // 0xcec(0x04)
	float SteeringYawBias; // 0xcf0(0x04)
	float ReloadSteerScalar; // 0xcf4(0x04)
	bool *1919e14899; // 0xcf8(0x01)
	char pad_CF9[0xf]; // 0xcf9(0x0f)
	bool bShouldProcessContact; // 0xd08(0x01)
	char pad_D09[0x1b]; // 0xd09(0x1b)
	bool *05223cfbab; // 0xd24(0x01)
	bool bShouldProcessAirControl; // 0xd25(0x01)
	bool bShouldProcessWheelie; // 0xd26(0x01)
	bool bShouldProcessGroundControl; // 0xd27(0x01)
	float *7350a74791; // 0xd28(0x04)
	char pad_D2C[0x4]; // 0xd2c(0x04)
	float *6a527710aa; // 0xd30(0x04)
	char pad_D34[0x4c]; // 0xd34(0x4c)
	struct F*7e6fa106d6 *4e7021b89f; // 0xd80(0x58)
	char pad_DD8[0x48]; // 0xdd8(0x48)
	struct TArray<struct ATslCharacter*> *20e5b83398; // 0xe20(0x10)
	char pad_E30[0x18]; // 0xe30(0x18)
	struct FVector *bf0de37154; // 0xe48(0x0c)
	char pad_E54[0x4]; // 0xe54(0x04)
	struct UPrimitiveComponent* *0bbc8e06ca; // 0xe58(0x08)
	char pad_E60[0x14]; // 0xe60(0x14)
	bool bIsAlwaysNetRelevantForObservers; // 0xe74(0x01)
	bool bIsLootTruck; // 0xe75(0x01)
	bool bIsKillTruck; // 0xe76(0x01)
	bool bTakeIdleDamage; // 0xe77(0x01)
	float IdleSpeed; // 0xe78(0x04)
	float IdleDamageTime; // 0xe7c(0x04)
	float IdleBleedingDamage; // 0xe80(0x04)
	char pad_E84[0x4]; // 0xe84(0x04)
	struct TArray<enum class ETirePunctureReason> ValidTirePunctureReasonsToStop; // 0xe88(0x10)
	struct FName IsStoppedBlackboardKeyName; // 0xe98(0x08)
	struct FName TargetLocationBlackboardKeyName; // 0xea0(0x08)
	struct FName PathingLocationBlackboardKeyName; // 0xea8(0x08)
	struct FName PathInputLocationBlackboardKeyName; // 0xeb0(0x08)
	float *74c270afda; // 0xeb8(0x04)
	char pad_EBC[0x4]; // 0xebc(0x04)
	struct UClass* *d38d0f1468; // 0xec0(0x08)
	float *9377f54409; // 0xec8(0x04)
	bool bOverrideTrunkProperty; // 0xecc(0x01)
	char pad_ECD[0x3]; // 0xecd(0x03)
	struct F*e43b2eeb30 *94823789dd; // 0xed0(0x28)
	struct ATslVehicleTrunk* Trunk; // 0xef8(0x08)
	struct U*6d8953a17d* AbilitySystemComponent; // 0xf00(0x08)
	struct U*f6c1abdcf9* AttributeSet; // 0xf08(0x08)
	struct U*f2c6c032e1* AnimSequenceManagerComponent; // 0xf10(0x08)
	char pad_F18[0x8]; // 0xf18(0x08)
	float *9a1d05b1dd; // 0xf20(0x04)
	char pad_F24[0xc]; // 0xf24(0x0c)
	struct FVector *4d80ef90ff; // 0xf30(0x0c)
	char pad_F3C[0x4]; // 0xf3c(0x04)
	struct FQuat *f05da0d3f2; // 0xf40(0x10)
	struct FVector *cc721158b4; // 0xf50(0x0c)
	char pad_F5C[0x4]; // 0xf5c(0x04)
	struct UClass* *92315a97d5; // 0xf60(0x08)
	bool *9824069112; // 0xf68(0x01)
	bool *dd2d58d70f; // 0xf69(0x01)
	char pad_F6A[0x6]; // 0xf6a(0x06)

	void *61b37f3103(); // Function TslGame.TslWheeledVehicle.*61b37f3103 // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0x5a60d50
	void *63c562b6c8(); // Function TslGame.TslWheeledVehicle.*63c562b6c8 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x5a69a48
	void *1976acdfef(); // Function TslGame.TslWheeledVehicle.*1976acdfef // Final|Native|Public // @ game+0x5a63fb0
	void *7bfb7ae66e(); // Function TslGame.TslWheeledVehicle.*7bfb7ae66e // Final|Native|Public // @ game+0x5a64634
	void OnBlockingWidgetOpened(); // Function TslGame.TslWheeledVehicle.OnBlockingWidgetOpened // Final|Native|Protected // @ game+0x5a6246c
	void UnBindCallbackToHUD(); // Function TslGame.TslWheeledVehicle.UnBindCallbackToHUD // Final|Native|Public // @ game+0xc4882c
	void OnRide(); // Function TslGame.TslWheeledVehicle.OnRide // Final|Native|Private // @ game+0x8882d4
	void *161d13e08e(); // Function TslGame.TslWheeledVehicle.*161d13e08e // Final|Native|Public // @ game+0x5a63de8
	void *6b9fe2fbb9(); // Function TslGame.TslWheeledVehicle.*6b9fe2fbb9 // Final|Native|Public // @ game+0x5a62ee0
	void OnLeave(); // Function TslGame.TslWheeledVehicle.OnLeave // Final|Native|Private // @ game+0xc04784
	void *825473a18b(); // Function TslGame.TslWheeledVehicle.*825473a18b // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a6a0fc
	void *d1d91eb13b(); // Function TslGame.TslWheeledVehicle.*d1d91eb13b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5fdc8
	void OnBreak(); // Function TslGame.TslWheeledVehicle.OnBreak // Final|Native|Private // @ game+0x5a62590
	void *2439e2734a(); // Function TslGame.TslWheeledVehicle.*2439e2734a // Final|Native|Public // @ game+0x5a63f8c
	void *823cc05b1d(); // Function TslGame.TslWheeledVehicle.*823cc05b1d // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0x5a54e08
	void *fe2fd81e3a(); // Function TslGame.TslWheeledVehicle.*fe2fd81e3a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5f018
	void BindCallbackToHUD(); // Function TslGame.TslWheeledVehicle.BindCallbackToHUD // Final|Native|Public // @ game+0xc3dde4
	void *498ebc287f(); // Function TslGame.TslWheeledVehicle.*498ebc287f // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x5a6ed88
	void *97a7c61f47(); // Function TslGame.TslWheeledVehicle.*97a7c61f47 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x5a6a694
	void *681e99c680(); // Function TslGame.TslWheeledVehicle.*681e99c680 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5fdb0
	void *f88dfba706(); // Function TslGame.TslWheeledVehicle.*f88dfba706 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5fa60
	void *4000f2aceb(); // Function TslGame.TslWheeledVehicle.*4000f2aceb // Net|Native|Event|NetMulticast|Public|HasDefaults // @ game+0x5a61850
	void *1cd9fdc1c2(); // Function TslGame.TslWheeledVehicle.*1cd9fdc1c2 // Net|Native|Event|NetMulticast|Protected // @ game+0x5a6106c
	void *ea775f95b6(); // Function TslGame.TslWheeledVehicle.*ea775f95b6 // Final|Native|Public // @ game+0x5a63db0
	void *c558333383(); // Function TslGame.TslWheeledVehicle.*c558333383 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5c0f0
	void *48fbee1aa5(); // Function TslGame.TslWheeledVehicle.*48fbee1aa5 // Final|Native|Public|BlueprintCallable // @ game+0x5a6ad44
	void *7072daf50a(); // Function TslGame.TslWheeledVehicle.*7072daf50a // Final|Native|Public // @ game+0x5a64c60
	void *a6419144c5(); // Function TslGame.TslWheeledVehicle.*a6419144c5 // Final|Native|Public // @ game+0x5a62ea0
	void *2fbff7d476(); // Function TslGame.TslWheeledVehicle.*2fbff7d476 // Final|Native|Public|BlueprintCallable // @ game+0x5a6ea84
	void NotifyHandbrake(); // Function TslGame.TslWheeledVehicle.NotifyHandbrake // Event|Public|BlueprintEvent // @ game+0x22ddc4
	void *cb5527fc78(); // Function TslGame.TslWheeledVehicle.*cb5527fc78 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5b24c
	void *d6a1702385(); // Function TslGame.TslWheeledVehicle.*d6a1702385 // Final|Native|Public // @ game+0x5a63fc4
	void OnRep_VehicleEngine(); // Function TslGame.TslWheeledVehicle.OnRep_VehicleEngine // Final|Native|Protected // @ game+0xc768b8
	void *0fb4c3d785(); // Function TslGame.TslWheeledVehicle.*0fb4c3d785 // Final|Native|Public // @ game+0x5a6dff8
	void *f8b555135f(); // Function TslGame.TslWheeledVehicle.*f8b555135f // Net|Native|Event|NetMulticast|Protected|HasDefaults // @ game+0x5a61be0
	void *c57c88df74(); // Function TslGame.TslWheeledVehicle.*c57c88df74 // Final|Native|Public // @ game+0x5a62eb8
	void *43e4e76756(); // Function TslGame.TslWheeledVehicle.*43e4e76756 // Net|NetReliableNative|Event|Public|NetClient|NetValidate // @ game+0x5a5646c
	void *329d42ccab(); // Function TslGame.TslWheeledVehicle.*329d42ccab // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5fde0
	void *a38dbd8da5(); // Function TslGame.TslWheeledVehicle.*a38dbd8da5 // Net|NetReliableNative|Event|Public|NetClient|NetValidate // @ game+0x9e3304
	void *eaa4bf2e96(); // Function TslGame.TslWheeledVehicle.*eaa4bf2e96 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5df38
	void *d20dbe3714(); // Function TslGame.TslWheeledVehicle.*d20dbe3714 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a69ff8
	void *7431bf42e6(); // Function TslGame.TslWheeledVehicle.*7431bf42e6 // Net|Native|Event|NetMulticast|Public|HasDefaults // @ game+0x5a61678
	void *72d6d0a9b8(); // Function TslGame.TslWheeledVehicle.*72d6d0a9b8 // Final|Native|Public // @ game+0x5a64698
	void *6b0bc5fe31(); // Function TslGame.TslWheeledVehicle.*6b0bc5fe31 // Final|Native|Public|BlueprintCallable // @ game+0x5a6e934
	void MoveForwardPad(); // Function TslGame.TslWheeledVehicle.MoveForwardPad // Final|Native|Public|BlueprintCallable // @ game+0x5a6070c
	void *6219b5903c(); // Function TslGame.TslWheeledVehicle.*6219b5903c // Final|Native|Public // @ game+0x5a62ef8
	void *e8a07bfa73(); // Function TslGame.TslWheeledVehicle.*e8a07bfa73 // Final|Native|Public // @ game+0x5a63f78
	void MoveForward(); // Function TslGame.TslWheeledVehicle.MoveForward // Final|Native|Public|BlueprintCallable // @ game+0x5a60674
	void *b0c0caa5be(); // Function TslGame.TslWheeledVehicle.*b0c0caa5be // Native|Public // @ game+0x59b82bc
	void OnDriverRide(); // Function TslGame.TslWheeledVehicle.OnDriverRide // Native|Public // @ game+0xcfd54c
	void *34d8ffb29b(); // Function TslGame.TslWheeledVehicle.*34d8ffb29b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5b264
	void OverrideVehicleHealth(); // Function TslGame.TslWheeledVehicle.OverrideVehicleHealth // Final|Exec|Native|Public // @ game+0x5a4040c
	void MoveRight(); // Function TslGame.TslWheeledVehicle.MoveRight // Final|Native|Public|BlueprintCallable // @ game+0x5a607b8
	void *5d32892cfa(); // Function TslGame.TslWheeledVehicle.*5d32892cfa // Final|Native|Public // @ game+0x5a64648
	void *599e47f4b5(); // Function TslGame.TslWheeledVehicle.*599e47f4b5 // Net|Native|Event|NetMulticast|Public|HasDefaults // @ game+0x5a613e4
	void OnHealthChange(); // Function TslGame.TslWheeledVehicle.OnHealthChange // Final|Native|Private // @ game+0xbb3050
	void OnCharacterHit(); // Function TslGame.TslWheeledVehicle.OnCharacterHit // Final|Native|Private // @ game+0x5a62664
	void *c3de08d478(); // Function TslGame.TslWheeledVehicle.*c3de08d478 // Final|Native|Public // @ game+0x5a63d9c
	void *26aa78af1e(); // Function TslGame.TslWheeledVehicle.*26aa78af1e // Final|Native|Public // @ game+0x5a64674
	void OnTirePunctured(); // Function TslGame.TslWheeledVehicle.OnTirePunctured // Final|Native|Protected // @ game+0x5a643e0
	void *8355368ed0(); // Function TslGame.TslWheeledVehicle.*8355368ed0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5f810
	void OnRep_WheeledVehicleBaseMovement(); // Function TslGame.TslWheeledVehicle.OnRep_WheeledVehicleBaseMovement // Native|Public // @ game+0x5a55758
	void OnPostDriverLeave(); // Function TslGame.TslWheeledVehicle.OnPostDriverLeave // Native|Public // @ game+0xba39ac
	void SetLightMaterialParameters(); // Function TslGame.TslWheeledVehicle.SetLightMaterialParameters // Native|Event|Public|BlueprintEvent // @ game+0x5a6bbcc
	void OnPostDriverRide(); // Function TslGame.TslWheeledVehicle.OnPostDriverRide // Native|Public // @ game+0xcbd24c
	void *ef755d1d8b(); // Function TslGame.TslWheeledVehicle.*ef755d1d8b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5be48
	void *7f16a337be(); // Function TslGame.TslWheeledVehicle.*7f16a337be // Final|Native|Public // @ game+0x5a6b560
	void *e990cbb95d(); // Function TslGame.TslWheeledVehicle.*e990cbb95d // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a69efc
	void *3d53407610(); // Function TslGame.TslWheeledVehicle.*3d53407610 // Native|Protected|BlueprintCallable // @ game+0x5a6bc9c
	void *146c4d7ab5(); // Function TslGame.TslWheeledVehicle.*146c4d7ab5 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a6a0b0
	void OverrideVehicleFuel(); // Function TslGame.TslWheeledVehicle.OverrideVehicleFuel // Final|Exec|Native|Public // @ game+0x5a64c78
	void *dd65ac9b57(); // Function TslGame.TslWheeledVehicle.*dd65ac9b57 // Native|Public // @ game+0x59c338c
	void *c02f1f6c1f(); // Function TslGame.TslWheeledVehicle.*c02f1f6c1f // Net|Native|Event|NetMulticast|Public // @ game+0x5a0136c
	void *fba42666c6(); // Function TslGame.TslWheeledVehicle.*fba42666c6 // Final|Native|Public // @ game+0x5a63dd4
	void *4364e0132d(); // Function TslGame.TslWheeledVehicle.*4364e0132d // Net|Native|Event|NetMulticast|Public|HasDefaults // @ game+0x5a61150
	void *b8fc1eaa37(); // Function TslGame.TslWheeledVehicle.*b8fc1eaa37 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5bfa8
	void *3b7341502d(); // Function TslGame.TslWheeledVehicle.*3b7341502d // Net|Native|Event|Protected|NetServer|NetValidate // @ game+0x5a6a6e0
	void *c76cfa6947(); // Function TslGame.TslWheeledVehicle.*c76cfa6947 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a69eb0
	void *91b21d32de(); // Function TslGame.TslWheeledVehicle.*91b21d32de // Net|Native|Event|NetMulticast|Protected|HasDefaults // @ game+0x5a61a28
	void *7da69eb275(); // Function TslGame.TslWheeledVehicle.*7da69eb275 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5e16c
	void HasDriver(); // Function TslGame.TslWheeledVehicle.HasDriver // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a5f030
};

// Class TslGame.TslFlyingVehicle
// Size: 0x1040 (Inherited: 0xf70)
struct ATslFlyingVehicle : ATslWheeledVehicle {
	char pad_F70[0x20]; // 0xf70(0x20)
	struct U*38e1ff6626* FlightComponent; // 0xf90(0x08)
	struct UClass* *aa151cf57e; // 0xf98(0x08)
	struct U*880e73319f* *8252ec4ae4; // 0xfa0(0x08)
	struct F*40c4e5f28e *40c4e5f28e; // 0xfa8(0x30)
	struct F*eb5898b578 *eb5898b578; // 0xfd8(0x40)
	struct FVector2D *6cdb6293ed; // 0x1018(0x08)
	float *b7eb8eced5; // 0x1020(0x04)
	struct F*d8777bfcee *03ad4c1c99; // 0x1024(0x10)
	char pad_1034[0xc]; // 0x1034(0x0c)

	void OnPostDriverRide(); // Function TslGame.TslFlyingVehicle.OnPostDriverRide // Native|Public // @ game+0xcbd24c
	void *b0c0caa5be(); // Function TslGame.TslFlyingVehicle.*b0c0caa5be // Native|Public // @ game+0x59b82bc
	void OnPostDriverLeave(); // Function TslGame.TslFlyingVehicle.OnPostDriverLeave // Native|Public // @ game+0xba39ac
};

// Class TslGame.*7f87a81afd
// Size: 0xe70 (Inherited: 0xd30)
struct U*7f87a81afd : U*40d06648ff {
	bool bTickFlightInstruments; // 0xd28(0x01)
	struct FRotator PropellerRotation; // 0xd2c(0x0c)
	struct FVector PropellerRotationMask; // 0xd38(0x0c)
	float MaxFlightSpeedInKm; // 0xd44(0x04)
	float MaxRPM; // 0xd48(0x04)
	float MaxFlightAltitudeInMeters; // 0xd4c(0x04)
	struct FRotator *de606981a6; // 0xd50(0x0c)
	struct FRotator *86d86dcd86; // 0xd5c(0x0c)
	struct FRotator *ff8596e510; // 0xd68(0x0c)
	struct FRotator *763cf8f938; // 0xd74(0x0c)
	struct FRotator *9b687bc02a; // 0xd80(0x0c)
	struct FRotator *8034a8a78c; // 0xd8c(0x0c)
	struct FRotator *39917230b9; // 0xd98(0x0c)
	struct FRotator *86bb703eea; // 0xda4(0x0c)
	struct FRotator Instrument_SpeedRot; // 0xdb0(0x0c)
	struct FRotator Instrument_RPMRot; // 0xdbc(0x0c)
	struct FRotator Instrument_AltRot; // 0xdc8(0x0c)
	struct FRotator Instrument_FuelRot; // 0xdd4(0x0c)
	float FastRotorAlpha; // 0xde0(0x04)
	struct FRotator WingRollRot; // 0xde4(0x0c)
	struct FVector WingRollRotMask; // 0xdf0(0x0c)
	struct FRotator WingPitchRot; // 0xdfc(0x0c)
	struct FVector WingPitchRotMask; // 0xe08(0x0c)
	struct FRotator WheelYawRot; // 0xe14(0x0c)
	struct FVector WheelYawRotMask; // 0xe20(0x0c)
	struct U*1ba2d2b086* *2597d6f73f; // 0xe30(0x08)
	float *e4b72d05de; // 0xe38(0x04)
	float PedalBrakeAlpha; // 0xe3c(0x04)
	float PedalThrottleAlpha; // 0xe40(0x04)
	float *972fdabd71; // 0xe44(0x04)
	char pad_E49[0xf]; // 0xe49(0x0f)
	struct U*38e1ff6626* *8e3671006e; // 0xe58(0x08)
	struct ATslFlyingVehicle* FlyingVehicle; // 0xe60(0x08)
	char pad_E68[0x8]; // 0xe68(0x08)
};

// Class TslGame.*2bb14fe2b0
// Size: 0xd40 (Inherited: 0xd30)
struct U*2bb14fe2b0 : U*40d06648ff {
	float BarrelPitchAcc; // 0xd28(0x04)
	bool bIsMortarLoadingCP; // 0xd2c(0x01)
	struct FMulticastDelegate MortarLoad; // 0xd30(0x10)
};

// Class TslGame.*f2c6c032e1
// Size: 0x240 (Inherited: 0x200)
struct U*f2c6c032e1 : UActorComponent {
	char pad_200[0x4]; // 0x200(0x04)
	float MaxRpmRatio; // 0x204(0x04)
	float LampStrength; // 0x208(0x04)
	bool bEngineOn; // 0x20c(0x01)
	char pad_20D[0x3]; // 0x20d(0x03)
	float Throttle; // 0x210(0x04)
	bool bBoostOn; // 0x214(0x01)
	char pad_215[0x3]; // 0x215(0x03)
	struct FString *9791d68c18; // 0x218(0x10)
	struct UAnimationAsset* *6d554d2d8a; // 0x228(0x08)
	char pad_230[0x10]; // 0x230(0x10)

	void SetLampStrength(); // Function TslGame.*f2c6c032e1.SetLampStrength // Final|Native|Public|BlueprintCallable // @ game+0x59ca5d8
	void SetThrottle(); // Function TslGame.*f2c6c032e1.SetThrottle // Final|Native|Public|BlueprintCallable // @ game+0x59cb7a4
	void SetMaxRpmRatio(); // Function TslGame.*f2c6c032e1.SetMaxRpmRatio // Final|Native|Public|BlueprintCallable // @ game+0x59ca91c
	void SetEngineOn(); // Function TslGame.*f2c6c032e1.SetEngineOn // Final|Native|Public|BlueprintCallable // @ game+0x59ca1f0
	void SetBoostOn(); // Function TslGame.*f2c6c032e1.SetBoostOn // Final|Native|Public|BlueprintCallable // @ game+0x59c9f28
};

// Class TslGame.TslVehicleConverter
// Size: 0x550 (Inherited: 0x408)
struct ATslVehicleConverter : AActor {
	char pad_408[0x8]; // 0x408(0x08)
	float *7c1e418048; // 0x410(0x04)
	char pad_414[0x4]; // 0x414(0x04)
	struct UClass* *b1b2756946; // 0x418(0x08)
	struct APawn* *4d61495e69; // 0x420(0x08)
	struct FStringClassReference *d2f9f5b7d3; // 0x428(0x10)
	struct ATslCharacter* *7943747ca9; // 0x438(0x08)
	struct U*588043edf8* *588043edf8; // 0x440(0x08)
	struct U*92b0622df8* *1f3d5db022; // 0x448(0x08)
	struct U*92b0622df8* *d3be80df9c; // 0x450(0x08)
	struct TArray<int32> *f8ed5f344a; // 0x458(0x10)
	char pad_468[0xe0]; // 0x468(0xe0)
	enum class EVehicleConvertState State; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)

	void OnUpdateState(); // Function TslGame.TslVehicleConverter.OnUpdateState // Final|Native|Protected // @ game+0x59c31a4
	void OnRide(); // Function TslGame.TslVehicleConverter.OnRide // Final|Native|Protected // @ game+0x59c1ef8
	void OnVehicleHealthChange(); // Function TslGame.TslVehicleConverter.OnVehicleHealthChange // Final|Native|Protected // @ game+0x59c33a4
	void OnVehicleHit(); // Function TslGame.TslVehicleConverter.OnVehicleHit // Final|Native|Protected|HasOutParms|HasDefaults // @ game+0x59c3560
	void OnRep_BaseVehicle(); // Function TslGame.TslVehicleConverter.OnRep_BaseVehicle // Final|Native|Protected // @ game+0x59c1248
	void OnRep_ReplaceVehicle(); // Function TslGame.TslVehicleConverter.OnRep_ReplaceVehicle // Final|Native|Protected // @ game+0x59c17c4
};

// Class TslGame.*731b4310e5
// Size: 0x48 (Inherited: 0x38)
struct U*731b4310e5 : UDataAsset {
	struct UAkAudioEvent* EventIn; // 0x38(0x08)
	int32 FadeOutTime; // 0x40(0x04)
	enum class *a6a176d0c8 InterpolationCurve; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// Class TslGame.*42c3c7f9b7
// Size: 0xad0 (Inherited: 0x200)
struct U*42c3c7f9b7 : UActorComponent {
	struct ATslWheeledVehicle* *27040869f8; // 0x200(0x08)
	char pad_208[0x8]; // 0x208(0x08)
	struct UMeshComponent* MeshComponent; // 0x210(0x08)
	struct UAkComponent* EngineSoundComponent; // 0x218(0x08)
	struct F*c0c8686f61 *c0c8686f61; // 0x220(0x130)
	struct F*b21adc33b9 *b21adc33b9; // 0x350(0x140)
	struct ATslParticle* *2a7f994258; // 0x490(0x08)
	struct ATslParticle* *80379c0c34; // 0x498(0x08)
	struct ATslParticle* *d0bd5105c6; // 0x4a0(0x08)
	struct ATslParticle* *4c2171236e; // 0x4a8(0x08)
	struct ATslParticle* *49eb3f65e6; // 0x4b0(0x08)
	struct ATslParticle* *13b7bf3b7f; // 0x4b8(0x08)
	struct ATslParticle* *68417d8a57; // 0x4c0(0x08)
	struct ATslParticle* *c11a118543; // 0x4c8(0x08)
	struct ATslParticle* *92eb904f7c; // 0x4d0(0x08)
	struct ATslParticle* *3701dc9a5a; // 0x4d8(0x08)
	struct ATslParticle* *2d63472fb7; // 0x4e0(0x08)
	struct ATslParticle* *bad7e82c1f; // 0x4e8(0x08)
	struct ATslParticle* *b159bc3655; // 0x4f0(0x08)
	struct ATslParticle* *3baa6d9eac; // 0x4f8(0x08)
	struct ATslParticle* *d815cd1a4a; // 0x500(0x08)
	struct ATslParticle* *2508b66be5; // 0x508(0x08)
	struct UStaticMeshComponent* *046f8995a2; // 0x510(0x08)
	char pad_518[0x44]; // 0x518(0x44)
	float *bb8630c751; // 0x55c(0x04)
	float *c312236418; // 0x560(0x04)
	bool *9b2a38866a; // 0x564(0x01)
	bool *5bbf5098f9; // 0x565(0x01)
	char pad_566[0xa]; // 0x566(0x0a)
	struct UMaterialInstanceDynamic* *26d4d88ef3; // 0x570(0x08)
	struct UMaterialInstanceDynamic* *472448fa11; // 0x578(0x08)
	struct UTextRenderComponent* *7c71451b8c; // 0x580(0x08)
	struct UTextRenderComponent* *90642bbdf3; // 0x588(0x08)
	struct ATslFloatingVehicle* *7f0435d25d; // 0x590(0x08)
	bool *6d8d7c78a7; // 0x598(0x01)
	bool *35790fe4ce; // 0x599(0x01)
	char pad_59A[0x6]; // 0x59a(0x06)
	struct UCurveFloat* *ed06c94147; // 0x5a0(0x08)
	bool *864ab1c204; // 0x5a8(0x01)
	char pad_5A9[0x7]; // 0x5a9(0x07)
	struct TMap<enum class ESurfaceEffect, struct U*731b4310e5*> SurfaceAudioMap; // 0x5b0(0x50)
	bool bUseNewSurfaceAudio; // 0x600(0x01)
	bool bAlwaysSendSurfaceParameters; // 0x601(0x01)
	bool bIgnoreHandbrake; // 0x602(0x01)
	char pad_603[0x5]; // 0x603(0x05)
	struct TArray<int32> MeasuredWheelIndices; // 0x608(0x10)
	struct TArray<int32> MeasuredWheelIndicesSlip; // 0x618(0x10)
	struct TArray<int32> MeasuredWheelIndicesSpin; // 0x628(0x10)
	struct TArray<int32> MeasuredWheelIndicesBrake; // 0x638(0x10)
	float SurfaceActivationValue; // 0x648(0x04)
	float SurfaceDeactivationValue; // 0x64c(0x04)
	float SurfaceValueRiseRate; // 0x650(0x04)
	float SurfaceValueFallRate; // 0x654(0x04)
	float DT_Multiplier; // 0x658(0x04)
	float MinVelocityForSurfaceCheck; // 0x65c(0x04)
	float MinRotationSpeedForSurfaceCheck; // 0x660(0x04)
	float MinSlip; // 0x664(0x04)
	float MinSpin; // 0x668(0x04)
	float MinVelocityForBreak; // 0x66c(0x04)
	float BrakeNoDriverMultiplier; // 0x670(0x04)
	int32 VelocityInterpSpeed; // 0x674(0x04)
	int32 SlipInterpSpeed; // 0x678(0x04)
	int32 SpinInterpSpeed; // 0x67c(0x04)
	int32 BrakeInterpSpeed; // 0x680(0x04)
	bool bDebugVisualizedMeasuredWheels; // 0x684(0x01)
	char pad_685[0x3]; // 0x685(0x03)
	float AngularVelocityCoefficient; // 0x688(0x04)
	float LateralVelocityCoeffictient; // 0x68c(0x04)
	float LateralVelocityClamp; // 0x690(0x04)
	bool bUseLatSlipMap; // 0x694(0x01)
	char pad_695[0x3]; // 0x695(0x03)
	struct FVector2D LatSlipInMap; // 0x698(0x08)
	bool bUseLongSlipMap; // 0x6a0(0x01)
	char pad_6A1[0x3]; // 0x6a1(0x03)
	struct FVector2D LongSlipInMap; // 0x6a4(0x08)
	bool bUseMaxSkid; // 0x6ac(0x01)
	bool bUseMaxSpin; // 0x6ad(0x01)
	char pad_6AE[0x2]; // 0x6ae(0x02)
	float SurfaceRestartTimeout; // 0x6b0(0x04)
	bool bProcessShiftStart; // 0x6b4(0x01)
	bool bProcessShiftEnd; // 0x6b5(0x01)
	bool bProcessReverse; // 0x6b6(0x01)
	bool bUseTargetGearForAudio; // 0x6b7(0x01)
	float ReverseThrottleScalar; // 0x6b8(0x04)
	char pad_6BC[0x4]; // 0x6bc(0x04)
	struct UAkAudioEvent* GearUpSound_Start; // 0x6c0(0x08)
	struct UAkAudioEvent* GearDownSound_Start; // 0x6c8(0x08)
	struct UAkAudioEvent* GearUpSound_End; // 0x6d0(0x08)
	struct UAkAudioEvent* GearDownSound_End; // 0x6d8(0x08)
	struct UAkAudioEvent* GearReverseSound; // 0x6e0(0x08)
	float NonBoostedThrottleScalar; // 0x6e8(0x04)
	float NonBoostedRPMScalar; // 0x6ec(0x04)
	float BoostRPMStaticOffset; // 0x6f0(0x04)
	float BoostAlphaInterpSpeed; // 0x6f4(0x04)
	float WaterRPMScalar; // 0x6f8(0x04)
	float WaterThrottleScalar; // 0x6fc(0x04)
	bool bUseRevLimiter; // 0x700(0x01)
	char pad_701[0x3]; // 0x701(0x03)
	float RevLimiterMinAlpha; // 0x704(0x04)
	float RevLimitMod; // 0x708(0x04)
	float RevLimitScale; // 0x70c(0x04)
	float RevLimitPower; // 0x710(0x04)
	bool bRevLimReverse; // 0x714(0x01)
	char pad_715[0x123]; // 0x715(0x123)
	struct TMap<int32, struct UMaterialInterface*> DestroyedMaterialMap; // 0x838(0x50)
	float ApplyDestroyedMaterialDelay; // 0x888(0x04)
	char pad_88C[0x4]; // 0x88c(0x04)
	struct TArray<struct F*5bcbe172cf> MeshPartDestroyedMaterialList; // 0x890(0x10)
	bool bUseDynamicDestroyedParam; // 0x8a0(0x01)
	char pad_8A1[0x7]; // 0x8a1(0x07)
	struct FName DynamicDestroyedParamName; // 0x8a8(0x08)
	bool bUseDynamicDashboardParam; // 0x8b0(0x01)
	bool bDashboardNGearWhenZeroRPM; // 0x8b1(0x01)
	char pad_8B2[0x6]; // 0x8b2(0x06)
	struct F*cda1b988ad DashboardSetting; // 0x8b8(0x30)
	struct FName DashboardRPMParameter; // 0x8e8(0x08)
	struct FName DashboardGearParameter; // 0x8f0(0x08)
	struct FName DashboardSpeedParameter; // 0x8f8(0x08)
	struct FName DashboardFuelParameter; // 0x900(0x08)
	struct UMaterialInstanceDynamic* *1c43d7f72a; // 0x908(0x08)
	char pad_910[0x10]; // 0x910(0x10)
	bool bUsesBoosting; // 0x920(0x01)
	char pad_921[0x7]; // 0x921(0x07)
	struct UAkAudioEvent* BoostStartAk; // 0x928(0x08)
	struct UAkAudioEvent* BoostEndAk; // 0x930(0x08)
	bool bShouldTickLights; // 0x938(0x01)
	char pad_939[0x3]; // 0x939(0x03)
	float BrakeLightThreshold; // 0x93c(0x04)
	struct F*a774748af6 LightSettings; // 0x940(0x68)
	bool bUseDynamicCamera; // 0x9a8(0x01)
	char pad_9A9[0x7]; // 0x9a9(0x07)
	struct F*c5660d51d8 CameraEffectSettings; // 0x9b0(0x98)
	char pad_A48[0x88]; // 0xa48(0x88)

	void *340d2f1b9f(); // Function TslGame.*42c3c7f9b7.*340d2f1b9f // Final|Native|Public|BlueprintCallable // @ game+0x59b5ed0
	void *b07c78c729(); // Function TslGame.*42c3c7f9b7.*b07c78c729 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba310
	void *46f41f0413(); // Function TslGame.*42c3c7f9b7.*46f41f0413 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9930
	void *bc8bd0f82c(); // Function TslGame.*42c3c7f9b7.*bc8bd0f82c // Final|Native|Public|BlueprintCallable // @ game+0x59ca284
	void *26bb9c0688(); // Function TslGame.*42c3c7f9b7.*26bb9c0688 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9954
	void OnHit(); // Function TslGame.*42c3c7f9b7.OnHit // Native|Event|Protected|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x57b280
	void OnDestroyedImpactEffect(); // Function TslGame.*42c3c7f9b7.OnDestroyedImpactEffect // Final|Native|Private // @ game+0xc4c364
	void OnHealthChange(); // Function TslGame.*42c3c7f9b7.OnHealthChange // Native|Event|Protected|BlueprintEvent // @ game+0x57a110
	void *c2374736b5(); // Function TslGame.*42c3c7f9b7.*c2374736b5 // Final|Native|Public|BlueprintCallable // @ game+0x59cb9ec
	void OnDeath(); // Function TslGame.*42c3c7f9b7.OnDeath // Native|Event|Protected|HasOutParms|BlueprintEvent // @ game+0x59be0b0
	void *637e821321(); // Function TslGame.*42c3c7f9b7.*637e821321 // Final|Native|Public|BlueprintCallable // @ game+0x59ca464
	void *5aa69b903d(); // Function TslGame.*42c3c7f9b7.*5aa69b903d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9a5c
};

// Class TslGame.*c075bf3b42
// Size: 0xb00 (Inherited: 0xad0)
struct U*c075bf3b42 : U*42c3c7f9b7 {
	bool *a154f7e7ab; // 0xac8(0x01)
	float *6ec01acf49; // 0xacc(0x04)
	struct F*d8777bfcee *4cc9232da2; // 0xad0(0x10)
	struct ATslParticle* *dd2dd6c219; // 0xae0(0x08)
	struct ATslParticle* *8be9236fe0; // 0xae8(0x08)
	struct UClass* WingEffectParticle; // 0xaf0(0x08)
	struct UClass* GroundEffectParticle; // 0xaf8(0x08)
};

// Class TslGame.*cd313b379c
// Size: 0xc00 (Inherited: 0xba0)
struct U*cd313b379c : UStaticMeshComponent {
	struct TMap<int32, struct UMaterialInterface*> *0ae0aecc95; // 0xba0(0x50)
	char pad_BF0[0x10]; // 0xbf0(0x10)
};

// Class TslGame.*d2cb5cce6d
// Size: 0x11e0 (Inherited: 0x1190)
struct U*d2cb5cce6d : USkeletalMeshComponent {
	struct TMap<int32, struct UMaterialInterface*> *0ae0aecc95; // 0x1188(0x50)
};

// Class TslGame.*8604bb4d0c
// Size: 0x30 (Inherited: 0x30)
struct U*8604bb4d0c : UInterface {

	void OnImpactedByVehicle(); // Function TslGame.*8604bb4d0c.OnImpactedByVehicle // Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent // @ game+0x22ddc4
};

// Class TslGame.*5a1c6e8353
// Size: 0x300 (Inherited: 0x200)
struct U*5a1c6e8353 : UActorComponent {
	struct FMulticastDelegate OnRide; // 0x200(0x10)
	struct FMulticastDelegate OnLeave; // 0x210(0x10)
	struct FMulticastDelegate OnDriverRide; // 0x220(0x10)
	struct FMulticastDelegate OnDriverLeave; // 0x230(0x10)
	struct FMulticastDelegate OnPostDriverRide; // 0x240(0x10)
	struct FMulticastDelegate OnPostDriverLeave; // 0x250(0x10)
	struct TArray<struct U*614c6d2b0f*> *44c1b2de32; // 0x260(0x10)
	bool bUseSeatCamera; // 0x270(0x01)
	bool bKillRidersOnDestroy; // 0x271(0x01)
	bool bEjectRidersOnDestroy; // 0x272(0x01)
	bool bDoFlipCheck; // 0x273(0x01)
	float FlipForce; // 0x274(0x04)
	bool bDoEntryAngleCheck; // 0x278(0x01)
	char pad_279[0x3]; // 0x279(0x03)
	float MinEntryAngle; // 0x27c(0x04)
	bool bDampenPlayerVelocityOnLeave; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	float OnLeaveVelocityMultiplier; // 0x284(0x04)
	bool bUseActiveStabilize; // 0x288(0x01)
	bool bRiderChangeSeat; // 0x289(0x01)
	bool bLockEntryForEnemies; // 0x28a(0x01)
	char pad_28B[0x1]; // 0x28b(0x01)
	struct ATslCharacter* *92df4d5066; // 0x28c(0x08)
	char pad_294[0x6c]; // 0x294(0x6c)

	void *9cafc93842(); // Function TslGame.*5a1c6e8353.*9cafc93842 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b996c
	void *e98dbd9530(); // Function TslGame.*5a1c6e8353.*e98dbd9530 // Native|Public|BlueprintCallable // @ game+0x59cccb4
	void Leave(); // Function TslGame.*5a1c6e8353.Leave // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0xbd3ad0
	void OnFuelChange(); // Function TslGame.*5a1c6e8353.OnFuelChange // Final|Native|Private // @ game+0xb5e3a8
	void *44040b2669(); // Function TslGame.*5a1c6e8353.*44040b2669 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9bac
	void *38db026121(); // Function TslGame.*5a1c6e8353.*38db026121 // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0x59cce8c
	void *7149c4f323(); // Function TslGame.*5a1c6e8353.*7149c4f323 // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0xcc7a50
	void *f971f5e26c(); // Function TslGame.*5a1c6e8353.*f971f5e26c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9e5c
	void *e12889ded4(); // Function TslGame.*5a1c6e8353.*e12889ded4 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9efc
	void *b91ad58427(); // Function TslGame.*5a1c6e8353.*b91ad58427 // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0x59ccc9c
	void GetDriver(); // Function TslGame.*5a1c6e8353.GetDriver // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59b9908
	void KillAllRiders(); // Function TslGame.*5a1c6e8353.KillAllRiders // Final|Native|Private|HasOutParms // @ game+0x59bb44c
	void *02021fe971(); // Function TslGame.*5a1c6e8353.*02021fe971 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba05c
	void Ride(); // Function TslGame.*5a1c6e8353.Ride // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0x811390
	void *110ddd9355(); // Function TslGame.*5a1c6e8353.*110ddd9355 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba580
	void *b66a5485f1(); // Function TslGame.*5a1c6e8353.*b66a5485f1 // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0xcfd574
	void *b672e5407d(); // Function TslGame.*5a1c6e8353.*b672e5407d // Native|Public|BlueprintCallable // @ game+0x59ccd98
};

// Class TslGame.TslVehicleSinkComponent
// Size: 0x2b0 (Inherited: 0x200)
struct UTslVehicleSinkComponent : UActorComponent {
	struct UClass* *fd012ad346; // 0x200(0x08)
	struct FName *f1a34dadad; // 0x208(0x08)
	struct TArray<struct FName> *a4ffa942a0; // 0x210(0x10)
	struct UCurveFloat* *64891f18f6; // 0x220(0x08)
	struct TArray<float> *0384ec56cd; // 0x228(0x10)
	struct UClass* *8be8d0c3ae; // 0x238(0x08)
	struct UCurveFloat* *3653750049; // 0x240(0x08)
	float *4720320f9f; // 0x248(0x04)
	float *2816a3520a; // 0x24c(0x04)
	struct UBuoyancyForceComponent* BuoyancyForceComponent; // 0x250(0x08)
	char pad_258[0x18]; // 0x258(0x18)
	struct USkeletalMeshComponent* MeshComponent; // 0x270(0x08)
	struct U*42c3c7f9b7* VehicleEffectComponent; // 0x278(0x08)
	struct UMovementComponent* MovementComponent; // 0x280(0x08)
	struct TArray<struct ATslParticle*> *b16ad52aaf; // 0x288(0x10)
	char pad_298[0x18]; // 0x298(0x18)
};

// Class TslGame.*92b0622df8
// Size: 0xd0 (Inherited: 0x30)
struct U*92b0622df8 : UObject {
	TScriptInterface<struct UTslVehicleInterface> *2b981a17cf; // 0x30(0x10)
	struct UVehicleSkinFXDataAsset* *18e2945313; // 0x40(0x08)
	struct TArray<struct USkeletalMeshComponent*> *91d2b3f6ba; // 0x48(0x10)
	struct TArray<struct U*555c720717*> *7b2ce5193a; // 0x58(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> *8ea46a9461; // 0x68(0x10)
	struct TArray<struct UMaterialInterface*> *eb8aa39a66; // 0x78(0x10)
	struct TArray<struct ATslParticle*> *b5b14c8e06; // 0x88(0x10)
	char pad_98[0x38]; // 0x98(0x38)
};

// Class TslGame.*6c9b903bd2
// Size: 0x260 (Inherited: 0x200)
struct U*6c9b903bd2 : UActorComponent {
	struct U*b79942152e* *b79942152e; // 0x200(0x08)
	int32 *ff157178a2; // 0x208(0x04)
	float *f7b514d342; // 0x20c(0x04)
	int8 CurrentIndex; // 0x210(0x01)
	char pad_211[0x4f]; // 0x211(0x4f)

	void *bfadcfc984(); // Function TslGame.*6c9b903bd2.*bfadcfc984 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x59c84ec
	void OnMontageFinished(); // Function TslGame.*6c9b903bd2.OnMontageFinished // Final|Native|Public // @ game+0x59bfe6c
	void *a2255af642(); // Function TslGame.*6c9b903bd2.*a2255af642 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x59c843c
	void OnRep_StuntEmote(); // Function TslGame.*6c9b903bd2.OnRep_StuntEmote // Final|Native|Public // @ game+0x59c1958
};

// Class TslGame.*7804a94d4d
// Size: 0x280 (Inherited: 0x200)
struct U*7804a94d4d : UActorComponent {
	struct FMulticastDelegate OnSyncHit; // 0x200(0x10)
	char pad_210[0xc]; // 0x210(0x0c)
	float *cbe86824bb; // 0x21c(0x04)
	char pad_220[0x4]; // 0x220(0x04)
	float *40306dbce4; // 0x224(0x04)
	char pad_228[0x4]; // 0x228(0x04)
	float *6a81788239; // 0x22c(0x04)
	char pad_230[0x8]; // 0x230(0x08)
	float *029e0e9066; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	float *dcc07cb989; // 0x240(0x04)
	float *5ca06c3991; // 0x244(0x04)
	char pad_248[0x4]; // 0x248(0x04)
	float *aba5c81070; // 0x24c(0x04)
	float *d35a49d46a; // 0x250(0x04)
	char pad_254[0x1c]; // 0x254(0x1c)
	float *b10ac5140e; // 0x270(0x04)
	bool *762b686d31; // 0x274(0x01)
	char pad_275[0x1]; // 0x275(0x01)
	bool *a8d656364d; // 0x276(0x01)
	char pad_277[0x1]; // 0x277(0x01)
	struct UPrimitiveComponent* *fb993e8d79; // 0x278(0x08)

	void *bdfa8ac4ab(); // Function TslGame.*7804a94d4d.*bdfa8ac4ab // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x59c5858
	void OnDriverLeave(); // Function TslGame.*7804a94d4d.OnDriverLeave // Final|Native|Private // @ game+0xbdbb4c
	void *c4a35f8f1a(); // Function TslGame.*7804a94d4d.*c4a35f8f1a // Final|Native|Public // @ game+0x59c2d04
	void *cf0e09f42a(); // Function TslGame.*7804a94d4d.*cf0e09f42a // Final|Net|NetReliableNative|Event|Private|NetClient // @ game+0x59b739c
	void *91953413c2(); // Function TslGame.*7804a94d4d.*91953413c2 // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x59c574c
	void *9c519eb933(); // Function TslGame.*7804a94d4d.*9c519eb933 // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x59c6f9c
	void *0a7ca3553d(); // Function TslGame.*7804a94d4d.*0a7ca3553d // Final|Net|Native|Event|Private|NetServer|NetValidate // @ game+0x59c6284
	void *e9b5a38954(); // Function TslGame.*7804a94d4d.*e9b5a38954 // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x59c5cd0
	void *f6ae62cc1a(); // Function TslGame.*7804a94d4d.*f6ae62cc1a // Final|Net|Native|Event|Private|NetServer|NetValidate // @ game+0x59c7a84
	void OnHitAtServer(); // Function TslGame.*7804a94d4d.OnHitAtServer // Final|Native|Private|HasOutParms|HasDefaults // @ game+0x59bed5c
	void *66cd921d93(); // Function TslGame.*7804a94d4d.*66cd921d93 // Final|Net|Native|Event|Private|NetServer|NetValidate // @ game+0x59c7754
	void OnHitAtClient(); // Function TslGame.*7804a94d4d.OnHitAtClient // Final|Native|Private|HasOutParms|HasDefaults // @ game+0xb0688c
	void *63ad50b4b6(); // Function TslGame.*7804a94d4d.*63ad50b4b6 // Final|Net|NetReliableNative|Event|Private|NetClient // @ game+0x59b718c
	void *309f97da8c(); // Function TslGame.*7804a94d4d.*309f97da8c // Final|Net|NetReliableNative|Event|Private|NetClient // @ game+0x59b67c8
	void *b2bd59b286(); // Function TslGame.*7804a94d4d.*b2bd59b286 // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x59c72cc
	void *039ca2550d(); // Function TslGame.*7804a94d4d.*039ca2550d // Net|NetReliableNative|Event|NetMulticast|Public // @ game+0x59bbabc
	void *4aaa55fd59(); // Function TslGame.*7804a94d4d.*4aaa55fd59 // Final|Net|Native|Event|Private|NetClient // @ game+0x59b78d4
	void *64527418eb(); // Function TslGame.*7804a94d4d.*64527418eb // Final|Net|Native|Event|Private|NetServer|NetValidate // @ game+0x59c66fc
	void OnDriverRide(); // Function TslGame.*7804a94d4d.OnDriverRide // Final|Native|Private // @ game+0xcb6424
	void *105403f36f(); // Function TslGame.*7804a94d4d.*105403f36f // Final|Net|Native|Event|Private|NetClient // @ game+0x59b6ec0
	void *4dc84fc95e(); // Function TslGame.*7804a94d4d.*4dc84fc95e // Final|Net|Native|Event|Private|NetClient // @ game+0x59b6cf8
	void *9671044afb(); // Function TslGame.*7804a94d4d.*9671044afb // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x59b668c
	void *4eaa4f3144(); // Function TslGame.*7804a94d4d.*4eaa4f3144 // Final|Net|Native|Event|Private|NetClient // @ game+0x59b76c4
	void *34569197e3(); // Function TslGame.*7804a94d4d.*34569197e3 // Final|Net|NetReliableNative|Event|Private|NetClient // @ game+0x59b69d4
	void OnRep_ServerCorrection(); // Function TslGame.*7804a94d4d.OnRep_ServerCorrection // Final|Native|Private // @ game+0x59c17d8
};

// Class TslGame.*5a915b1d2c
// Size: 0x210 (Inherited: 0x200)
struct U*5a915b1d2c : UActorComponent {
	float TickInterval; // 0x200(0x04)
	char pad_204[0xc]; // 0x204(0x0c)
};

// Class TslGame.TslVehicleValidationManager
// Size: 0x80 (Inherited: 0x30)
struct UTslVehicleValidationManager : UObject {
	struct TMap<enum class ECheatType, struct U*4622cffc5c*> *a3e1f74af7; // 0x30(0x50)
};

// Class TslGame.*4622cffc5c
// Size: 0x40 (Inherited: 0x30)
struct U*4622cffc5c : UObject {
	char pad_30[0x10]; // 0x30(0x10)
};

// Class TslGame.*cf433ab8c3
// Size: 0x48 (Inherited: 0x40)
struct U*cf433ab8c3 : U*4622cffc5c {
	char pad_40[0x8]; // 0x40(0x08)
};

// Class TslGame.*0d6077029c
// Size: 0x210 (Inherited: 0x200)
struct U*0d6077029c : UActorComponent {
	char pad_200[0x10]; // 0x200(0x10)
};

// Class TslGame.TslVendingMachineSpot
// Size: 0x410 (Inherited: 0x408)
struct ATslVendingMachineSpot : AActor {
	struct U*b00d9f92e9* SpotComponent; // 0x408(0x08)
};

// Class TslGame.*b00d9f92e9
// Size: 0x4e0 (Inherited: 0x4d0)
struct U*b00d9f92e9 : USceneComponent {
	enum class EVendingMachineType VendingMachineType; // 0x4d0(0x01)
	char pad_4D1[0xf]; // 0x4d1(0x0f)
};

// Class TslGame.*2895f931c5
// Size: 0x220 (Inherited: 0x200)
struct U*2895f931c5 : UActorComponent {
	struct TArray<struct F*a8910ecf86> *b9233b73d5; // 0x200(0x10)
	char pad_210[0x10]; // 0x210(0x10)

	void *ef5cb3b570(); // Function TslGame.*2895f931c5.*ef5cb3b570 // Final|Native|Public|BlueprintCallable // @ game+0x59b5dbc
	void *66c4960319(); // Function TslGame.*2895f931c5.*66c4960319 // Final|Native|Public|BlueprintCallable // @ game+0x59b5d1c
};

// Class TslGame.TslGameMode
// Size: 0x15f0 (Inherited: 0x4e8)
struct ATslGameMode : AGameMode {
	char pad_4E8[0x78]; // 0x4e8(0x78)
	struct UClass* MalePawnClass; // 0x560(0x08)
	struct FStringClassReference PerfBotPlayerControllerClass; // 0x568(0x10)
	struct FStringClassReference ModeControllerClass; // 0x578(0x10)
	struct TArray<struct FStringClassReference> AdditionalModeControllerClasses; // 0x588(0x10)
	struct UClass* testActor; // 0x598(0x08)
	struct FStringClassReference InitialItemDonatorClass; // 0x5a0(0x10)
	struct TArray<struct F*23be8024ca> MatchPreparerClasses; // 0x5b0(0x10)
	enum class EMatchStartType MatchStartType; // 0x5c0(0x01)
	char pad_5C1[0x7]; // 0x5c1(0x07)
	struct FStringClassReference SpawnKitClass; // 0x5c8(0x10)
	enum class ECameraViewBehaviour CameraViewBehaviour; // 0x5d8(0x01)
	bool bAllowObserverVoiceChatOutput; // 0x5d9(0x01)
	char pad_5DA[0x6]; // 0x5da(0x06)
	struct U*26253f21c4* *b6a90a9b58; // 0x5e0(0x08)
	struct U*bec9f5dc96* *e9a8a6bf90; // 0x5e8(0x08)
	char pad_5F0[0x2]; // 0x5f0(0x02)
	bool bFindPresetNameWithWeatherName; // 0x5f2(0x01)
	char pad_5F3[0x5]; // 0x5f3(0x05)
	struct FName PresetName; // 0x5f8(0x08)
	bool PlayerRespawn; // 0x600(0x01)
	bool PlayerRandomRespawnLocation; // 0x601(0x01)
	char pad_602[0x6]; // 0x602(0x06)
	struct TArray<struct F*ff324b46d9> LocalStringParameters; // 0x608(0x10)
	char pad_618[0x11]; // 0x618(0x11)
	bool bOverrideUseDestructableProp; // 0x629(0x01)
	bool bAllowGlobalVoiceChatbyMode; // 0x62a(0x01)
	bool bAllowTeamVoiceChatbyMode; // 0x62b(0x01)
	bool bAllowGlobalVoiceChatAtInit; // 0x62c(0x01)
	char pad_62D[0x3]; // 0x62d(0x03)
	float GlobalVoiceChannelMuteTimeInSeconds; // 0x630(0x04)
	int32 PostMatchWaitingTime; // 0x634(0x04)
	int32 NextRoundWaitingTime; // 0x638(0x04)
	int32 EndRoundWaitingTime; // 0x63c(0x04)
	int32 ServerQuitAfterLeavingMapTime; // 0x640(0x04)
	int32 MinPlayers; // 0x644(0x04)
	int32 MaxFPS; // 0x648(0x04)
	int32 PlayerSpawnTryMaxCount; // 0x64c(0x04)
	bool bEnablePerfBotInPIE; // 0x650(0x01)
	bool bEnablePerfBotLogin; // 0x651(0x01)
	bool bIsPerfBotSpawnToRandomPosition; // 0x652(0x01)
	bool bUseXboxUnauthorizedDevice; // 0x653(0x01)
	bool bCanRestartPerfBot; // 0x654(0x01)
	bool bEnableObserverInPIE; // 0x655(0x01)
	bool bPreventFinishMatchInPIE; // 0x656(0x01)
	char pad_657[0x1]; // 0x657(0x01)
	struct FString SelectedSpawnKit; // 0x658(0x10)
	struct FString PlatoonSpawnKit; // 0x668(0x10)
	struct FString EssentialSpawnKitName; // 0x678(0x10)
	struct FString AdditionalSpawnKit; // 0x688(0x10)
	bool bTakeoffAllItemAtEquipSpawnKit; // 0x698(0x01)
	bool *d37667f982; // 0x699(0x01)
	bool bForceEquipSpawnKit; // 0x69a(0x01)
	char pad_69B[0xd]; // 0x69b(0x0d)
	bool bUseTimerForResetLevelToNextMatch; // 0x6a8(0x01)
	char pad_6A9[0x3]; // 0x6a9(0x03)
	float TimeResetLevelToNextMatch; // 0x6ac(0x04)
	char pad_6B0[0x14]; // 0x6b0(0x14)
	bool bStartPlayerAtMatchStart; // 0x6c4(0x01)
	bool bShouldSpawnAtStartSpot; // 0x6c5(0x01)
	bool bEnableDBNO; // 0x6c6(0x01)
	bool bEnableAntiLean; // 0x6c7(0x01)
	char pad_6C8[0x2]; // 0x6c8(0x02)
	bool bUseCeremonyState; // 0x6ca(0x01)
	char pad_6CB[0x1]; // 0x6cb(0x01)
	int32 TeamSize; // 0x6cc(0x04)
	int32 LobbyBallsToSpawnPerStartLocation; // 0x6d0(0x04)
	char pad_6D4[0x4]; // 0x6d4(0x04)
	struct UClass* LobbyBallManagerClass; // 0x6d8(0x08)
	bool bEnableSquadInTeam; // 0x6e0(0x01)
	bool bEnablePlatoonCommander; // 0x6e1(0x01)
	char pad_6E2[0x2]; // 0x6e2(0x02)
	struct F*404b69bd7b PlatoonSupportRequestManifest; // 0x6e4(0x18)
	int32 SquadSize; // 0x6fc(0x04)
	bool bEnableBleedOut; // 0x700(0x01)
	bool bUsingSelectableSpawnKit; // 0x701(0x01)
	bool bUsingPlatoonSpawnKit; // 0x702(0x01)
	bool bOverrideEssentialSpawnKit; // 0x703(0x01)
	bool bUsingAdditionalSpawnKit; // 0x704(0x01)
	bool bEquipSpawnKitToAI; // 0x705(0x01)
	char pad_706[0x2]; // 0x706(0x02)
	struct FInt32Range AISpawnKitInex; // 0x708(0x10)
	bool bPreventAutoSpawnKitMessage; // 0x718(0x01)
	char bEnableClientPacketLossReport : 1; // 0x719(0x01)
	char bUseThermalScope : 1; // 0x719(0x01)
	char pad_719_2 : 6; // 0x719(0x01)
	char pad_71A[0x2]; // 0x71a(0x02)
	float CeremonyDuration; // 0x71c(0x04)
	float EndRoundCeremonyDuration; // 0x720(0x04)
	float RoundMatchCeremonyDuration; // 0x724(0x04)
	bool bShowCelebrateResult; // 0x728(0x01)
	bool bIsEditorTestZombieMode; // 0x729(0x01)
	bool bIsCustomGame; // 0x72a(0x01)
	bool bIsEventMode; // 0x72b(0x01)
	bool bCanAllSpectate; // 0x72c(0x01)
	bool bKillerSpectateMode; // 0x72d(0x01)
	bool bShowLastCircleMark; // 0x72e(0x01)
	char pad_72F[0x1]; // 0x72f(0x01)
	float LastCircleAlgorithmPercent; // 0x730(0x04)
	bool bChangeStartingPoint; // 0x734(0x01)
	bool bKeepLastCirclePosition; // 0x735(0x01)
	bool bCustomEmoteMode; // 0x736(0x01)
	bool bUsingInnerBlueZone; // 0x737(0x01)
	enum class EBlueZoneShape BlueZoneShape; // 0x738(0x01)
	char pad_739[0x3]; // 0x739(0x03)
	float BlueZoneRectangleAspectRatio; // 0x73c(0x04)
	struct FVector2D BlueZoneLeftTop; // 0x740(0x08)
	struct FVector2D BlueZoneRightBottom; // 0x748(0x08)
	bool bFixedStartBlueZoneLocation; // 0x750(0x01)
	char pad_751[0x3]; // 0x751(0x03)
	struct FVector2D FixedStartBlueZoneCenterLocationRatio; // 0x754(0x08)
	bool bUsingOuterBlueZone; // 0x75c(0x01)
	char pad_75D[0x3]; // 0x75d(0x03)
	float OuterBlueZoneSizeRatio; // 0x760(0x04)
	float OuterBlueZoneDamage; // 0x764(0x04)
	float OuterBlueZoneMargin; // 0x768(0x04)
	enum class EBlueZoneShape OuterBlueZoneShape; // 0x76c(0x01)
	bool bEnableDamageWhileRidingParachute; // 0x76d(0x01)
	bool bIsSurvivalIngameRewardActive; // 0x76e(0x01)
	bool bDisableAutoLooting; // 0x76f(0x01)
	bool bActiveLogPlayerHealed; // 0x770(0x01)
	bool bUsingStreamingLevelBound; // 0x771(0x01)
	char pad_772[0x2]; // 0x772(0x02)
	float OuterBlueZoneDistanceFromStreamingLevelBound; // 0x774(0x04)
	float StreamingLevelBoundEjectionAreaRatio; // 0x778(0x04)
	bool bAircraftFlightPathInStreamingLevelBounds; // 0x77c(0x01)
	bool bFinishNoConnections; // 0x77d(0x01)
	bool bDeleteSprayDecalWhenRestart; // 0x77e(0x01)
	char pad_77F[0x1]; // 0x77f(0x01)
	struct TArray<enum class ERadioMessageCategory> *13de9b02e0; // 0x780(0x10)
	bool bEnableVehicleTrunk; // 0x790(0x01)
	char pad_791[0x7]; // 0x791(0x07)
	SetProperty *9b9d589f73; // 0x798(0x50)
	bool bIsVehicleAiEnabled; // 0x7e8(0x01)
	bool bMakeVehicleModeComponent; // 0x7e9(0x01)
	char pad_7EA[0x2]; // 0x7ea(0x02)
	float EventBoosterTorqueOverrider; // 0x7ec(0x04)
	bool bRemoveVehicleAfterDeath; // 0x7f0(0x01)
	char pad_7F1[0x3]; // 0x7f1(0x03)
	float VehicleRemoveTimer; // 0x7f4(0x04)
	bool bUseOtherPlayerIcon; // 0x7f8(0x01)
	bool bUseTeamColorOnly; // 0x7f9(0x01)
	bool bUseTeamColorWidget; // 0x7fa(0x01)
	char pad_7FB[0x1]; // 0x7fb(0x01)
	struct F*b89eaf3c24 CustomGameUpdateCharacterInfo; // 0x7fc(0x0c)
	struct TArray<struct F*ec0b51269b> LimitCustomStringParameters; // 0x808(0x10)
	struct FString CustomWeaponDamage; // 0x818(0x10)
	struct TArray<struct FName> *19f69ef4cf; // 0x828(0x10)
	float MultiplierBlueZone; // 0x838(0x04)
	float MultiplierCarePackageNormal; // 0x83c(0x04)
	bool bFlareGun; // 0x840(0x01)
	char pad_841[0x3]; // 0x841(0x03)
	struct F*2910b8c0b8 RedZoneCustomOption; // 0x844(0x1c)
	struct F*81055234d7 BlackZoneCustomOption; // 0x860(0x40)
	struct F*7ded01e128 BlizzardZoneCustomOption; // 0x8a0(0x14)
	struct F*7ded01e128 SandStormZoneCustomOption; // 0x8b4(0x14)
	struct F*9758578d2c EmPickupCustomOption; // 0x8c8(0x14)
	char pad_8DC[0x4]; // 0x8dc(0x04)
	struct TArray<struct F*516301bedc> BlueZoneCustomOptions; // 0x8e0(0x10)
	struct F*18e5f91a4c LootTruckCustomOption; // 0x8f0(0x10)
	int32 TownWeight; // 0x900(0x04)
	int32 FieldWeight; // 0x904(0x04)
	int32 MountainWeight; // 0x908(0x04)
	bool bIsFixedLastCircle; // 0x90c(0x01)
	char pad_90D[0x3]; // 0x90d(0x03)
	struct FVector2D LastCircleCenterAsRatio; // 0x910(0x08)
	bool bHideNicknameOnKillfeed; // 0x918(0x01)
	bool bUseParachuteAutoDeploy; // 0x919(0x01)
	char pad_91A[0x2]; // 0x91a(0x02)
	float ParachuteAutoDeployAltitudeMultiplier; // 0x91c(0x04)
	float ParachuteStartDeployAltitudeMultiplier; // 0x920(0x04)
	float MultiplierParachuteLandingDamage; // 0x924(0x04)
	struct UMaterialInterface* OverrideParachuteMaterial; // 0x928(0x08)
	bool bHideVisualizeTslDebugInformation; // 0x930(0x01)
	bool bDisableClientGameEventObserverLog; // 0x931(0x01)
	char pad_932[0x2]; // 0x932(0x02)
	int32 ServerMaxTickRate; // 0x934(0x04)
	int32 *dda8cf3add; // 0x938(0x04)
	char pad_93C[0x4]; // 0x93c(0x04)
	struct FStringClassReference *06c5b6d519; // 0x940(0x10)
	struct FStringClassReference *a5c38c4b60; // 0x950(0x10)
	struct FStringClassReference ItemSpawnProcessorClass; // 0x960(0x10)
	struct FStringClassReference EventItemSpawnProcessorClass; // 0x970(0x10)
	struct FStringClassReference ThingSpawnProcessorClass; // 0x980(0x10)
	struct FStringClassReference TslSupplyBoxSpawnProcessorClass; // 0x990(0x10)
	struct FStringClassReference JukeBoxSpawnProcessorClass; // 0x9a0(0x10)
	struct FStringClassReference BlueChipTowerSpawnProcessorClass; // 0x9b0(0x10)
	struct FStringClassReference CabinetSpawnProcessorClass; // 0x9c0(0x10)
	struct FStringClassReference InteractionSupplySpawnProcessorClass; // 0x9d0(0x10)
	struct FStringClassReference GroupDeployedItemSpawnProcessorClass; // 0x9e0(0x10)
	struct FName BasicBeltItemIDForNoBelt; // 0x9f0(0x08)
	struct FStringClassReference *b68acc7f43; // 0x9f8(0x10)
	struct FStringClassReference *cf570399a5; // 0xa08(0x10)
	struct U*d78f350038* *7fc81979fc; // 0xa18(0x08)
	struct U*c0ddfbdeaa* *6a05065f64; // 0xa20(0x08)
	struct TMap<int32, struct ATslPlayerStart*> *24afc1aced; // 0xa28(0x50)
	struct TArray<struct APlayerStart*> PlayerStarts; // 0xa78(0x10)
	struct TArray<struct F*5c60d5a48b> *5c60d5a48b; // 0xa88(0x10)
	struct TMap<struct FString, struct ATslPlayerStart*> *6b1b2ff135; // 0xa98(0x50)
	int32 PlayerStartCount; // 0xae8(0x04)
	char pad_AEC[0x4]; // 0xaec(0x04)
	struct TArray<struct FRankingInfo> *366cbaf32c; // 0xaf0(0x10)
	struct TArray<struct FRankingInfo> *a58e5e7fde; // 0xb00(0x10)
	struct TArray<struct FPointInfo> *49cb8253e2; // 0xb10(0x10)
	char pad_B20[0x10]; // 0xb20(0x10)
	int32 *a2c923017d; // 0xb30(0x04)
	char pad_B34[0x4]; // 0xb34(0x04)
	struct TArray<int32> *08daf1349f; // 0xb38(0x10)
	struct FStringClassReference ModePresetClass; // 0xb48(0x10)
	float TeamKillDamageModifier; // 0xb58(0x04)
	float VehicleWheelDamageModifier; // 0xb5c(0x04)
	uint16 *a972a637ad; // 0xb60(0x02)
	bool *0be5c37e76; // 0xb62(0x01)
	char pad_B63[0x5]; // 0xb63(0x05)
	struct FMulticastDelegate OnMatchStarted; // 0xb68(0x10)
	char pad_B78[0x10]; // 0xb78(0x10)
	struct UGeneralItemSpawner* *80110285f4; // 0xb88(0x08)
	char pad_B90[0x8]; // 0xb90(0x08)
	struct UItemSpawnProcessor* ItemSpawnProcessor; // 0xb98(0x08)
	struct UThingSpawnProcessor* ThingSpawnProcessor; // 0xba0(0x08)
	struct UTslSupplyBoxSpawnProcessor* TslSupplyBoxSpawnProcessor; // 0xba8(0x08)
	struct UJukeBoxSpawnProcessor* JukeBoxSpawnProcessor; // 0xbb0(0x08)
	struct UTslBlueChipTowerSpawnProcessor* *450f76c4b6; // 0xbb8(0x08)
	struct UCabinetSpawnProcessor* CabinetSpawnProcessor; // 0xbc0(0x08)
	char pad_BC8[0x8]; // 0xbc8(0x08)
	struct UInteractionSupplySpawnProcessor* InteractionSupplySpawnProcessor; // 0xbd0(0x08)
	struct UEventItemSpawnProcessor* EventItemSpawnProcessor; // 0xbd8(0x08)
	struct UGroupDeployedItemSpawnProcessor* GroupDeployedItemSpawnProcessor; // 0xbe0(0x08)
	struct USpawnKit* SpawnKit; // 0xbe8(0x08)
	struct AModeController* ModeController; // 0xbf0(0x08)
	struct ADroppedItemGridManager* DroppedItemGridManager; // 0xbf8(0x08)
	struct AGameplayTracerManager* *b9e0c4c4b5; // 0xc00(0x08)
	struct AMissionManager* *c76954d359; // 0xc08(0x08)
	struct UModePreset* ModePreset; // 0xc10(0x08)
	struct UMatchPreparer* MatchPreparer; // 0xc18(0x08)
	struct UItemPackageProcessor* ItemPackageProcessor; // 0xc20(0x08)
	char pad_C28[0x8]; // 0xc28(0x08)
	struct TArray<struct AModeController*> *1e04314666; // 0xc30(0x10)
	char pad_C40[0x150]; // 0xc40(0x150)
	struct TMap<struct FString, struct ATslPlayerState*> *ea78f9ca27; // 0xd90(0x50)
	char pad_DE0[0xa0]; // 0xde0(0xa0)
	struct TArray<struct F*747577732c> *747577732c; // 0xe80(0x10)
	char pad_E90[0xa8]; // 0xe90(0xa8)
	int32 TeamId; // 0xf38(0x04)
	float FlareGunMsgDist; // 0xf3c(0x04)
	char pad_F40[0x18]; // 0xf40(0x18)
	struct U*63690e88de* *63690e88de; // 0xf58(0x08)
	char pad_F60[0x10]; // 0xf60(0x10)
	bool bCanUseRespawnedItem; // 0xf70(0x01)
	bool bRemoveDroppedItemPeriodically; // 0xf71(0x01)
	char pad_F72[0x2]; // 0xf72(0x02)
	float DroppedItemLifeTime; // 0xf74(0x04)
	float DroppedItemCheckInterval; // 0xf78(0x04)
	char pad_F7C[0x84]; // 0xf7c(0x84)
	bool *1b5541e0f1; // 0x1000(0x01)
	bool *401cd34b6f; // 0x1001(0x01)
	bool *f5c274c956; // 0x1002(0x01)
	char pad_1003[0x1]; // 0x1003(0x01)
	float *8c73ece91a; // 0x1004(0x04)
	float *b1d08b3017; // 0x1008(0x04)
	char pad_100C[0x5c]; // 0x100c(0x5c)
	struct U*71c71bb915* NpcManager; // 0x1068(0x08)
	struct ATslGameState* TslGameState; // 0x1070(0x08)
	char pad_1078[0x4]; // 0x1078(0x04)
	bool bIsStartGround; // 0x107c(0x01)
	char pad_107D[0x3]; // 0x107d(0x03)
	struct TMap<struct FName, int32> ItemLimits; // 0x1080(0x50)
	struct FWuLogMatchRating LogMatchRating; // 0x10d0(0x70)
	char pad_1140[0x50]; // 0x1140(0x50)
	struct UTslPlatoonCommanderSystem* *49f82aa84e; // 0x1190(0x08)
	struct TArray<struct F*634879c493> *b4b2aea412; // 0x1198(0x10)
	struct FString MatchingPoolType; // 0x11a8(0x10)
	bool bUseCountDownPlayerFence; // 0x11b8(0x01)
	bool *eb7fcd61d4; // 0x11b9(0x01)
	bool *6e4f9440bd; // 0x11ba(0x01)
	char pad_11BB[0x5]; // 0x11bb(0x05)
	struct FStringClassReference AIModePresetClass; // 0x11c0(0x10)
	struct UClass* UltronSystemManager; // 0x11d0(0x08)
	bool *d5abb6ffbd; // 0x11d8(0x01)
	char pad_11D9[0x3]; // 0x11d9(0x03)
	float *601ed927fe; // 0x11dc(0x04)
	struct U*fe9acc3351* *fcead8761a; // 0x11e0(0x08)
	struct AAIModeSupporter* *244ffe7fb3; // 0x11e8(0x08)
	struct ATslAIWorldVolume* *0c4519528b; // 0x11f0(0x08)
	struct U*a10c40ef1e* *b212f55b81; // 0x11f8(0x08)
	bool *97681444c5; // 0x1200(0x01)
	char TestAI : 1; // 0x1201(0x01)
	char pad_1201_1 : 7; // 0x1201(0x01)
	bool *13934f04a8; // 0x1202(0x01)
	bool bAutoFillBotPlayer; // 0x1203(0x01)
	char pad_1204[0x4]; // 0x1204(0x04)
	struct UAIModePreset* AIModePreset; // 0x1208(0x08)
	char pad_1210[0x40]; // 0x1210(0x40)
	struct U*78d60425ff* *ca8d1bbca5; // 0x1250(0x08)
	char pad_1258[0x8]; // 0x1258(0x08)
	struct ATslPhysicsVolume* *f6ddee4bed; // 0x1260(0x08)
	struct TArray<struct F*5c60d5a48b> *6ee94bf711; // 0x1268(0x10)
	char pad_1278[0x20]; // 0x1278(0x20)
	struct U*b8fd48b11a* *905658a0d0; // 0x1298(0x08)
	char pad_12A0[0x4]; // 0x12a0(0x04)
	bool bCanParachuteFollow; // 0x12a4(0x01)
	bool bCanCarry; // 0x12a5(0x01)
	bool bAscendersEnabled; // 0x12a6(0x01)
	bool bGasPumpsEnabled; // 0x12a7(0x01)
	bool bZiplinesEnabled; // 0x12a8(0x01)
	char pad_12A9[0x7]; // 0x12a9(0x07)
	struct TMap<enum class ETslBpRewardLogicType, struct FStringClassReference> *51e5af5a01; // 0x12b0(0x50)
	struct TMap<enum class ETslXpRewardLogicType, struct FStringClassReference> *e9230b5380; // 0x1300(0x50)
	struct TMap<enum class ETslApRewardLogicType, struct FStringClassReference> *7dfa2891d9; // 0x1350(0x50)
	struct UTslBpRewardCalculator* *bb24b4a2fa; // 0x13a0(0x08)
	struct UTslXpRewardCalculator* *0298e20b23; // 0x13a8(0x08)
	struct UTslApRewardCalculator* *18c2edf76f; // 0x13b0(0x08)
	char pad_13B8[0x38]; // 0x13b8(0x38)
	struct U*15ff740741* *15ff740741; // 0x13f0(0x08)
	char pad_13F8[0x68]; // 0x13f8(0x68)
	struct AAbstractRespawnProcessor* *112fbbb0bd; // 0x1460(0x08)
	struct ATslWhiteZoneController* *a7738402dc; // 0x1468(0x08)
	struct UClass* RespawnProcessorClass; // 0x1470(0x08)
	char pad_1478[0x40]; // 0x1478(0x40)
	struct F*8708410b7d *8708410b7d; // 0x14b8(0x60)
	char pad_1518[0xc8]; // 0x1518(0xc8)
	struct UClass* *c131374292; // 0x15e0(0x08)
	struct U*e62eca3016* *223a367bad; // 0x15e8(0x08)

	void *822ca4ff87(); // Function TslGame.TslGameMode.*822ca4ff87 // Final|Native|Public|BlueprintCallable // @ game+0x5a377d8
	void *364950b143(); // Function TslGame.TslGameMode.*364950b143 // Final|Native|Public // @ game+0xbdbb4c
	void *ad059848ff(); // Function TslGame.TslGameMode.*ad059848ff // Final|Native|Public // @ game+0x5a0769c
	void *1dfcc393d9(); // Function TslGame.TslGameMode.*1dfcc393d9 // Final|Native|Public // @ game+0x5a40ac8
	void *ae4c55ae58(); // Function TslGame.TslGameMode.*ae4c55ae58 // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x5a37d38
	void *c3e1752bc3(); // Function TslGame.TslGameMode.*c3e1752bc3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3da70
	void *37fc60aa04(); // Function TslGame.TslGameMode.*37fc60aa04 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3bac4
	void FinishMatch(); // Function TslGame.TslGameMode.FinishMatch // Final|Exec|Native|Public|BlueprintCallable // @ game+0x5a37878
	void *6a423767b6(); // Function TslGame.TslGameMode.*6a423767b6 // Final|Native|Public|BlueprintCallable // @ game+0x5a38694
	void *6ecb736576(); // Function TslGame.TslGameMode.*6ecb736576 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3bf80
	void *f15dbe6db5(); // Function TslGame.TslGameMode.*f15dbe6db5 // Final|Native|Public|BlueprintCallable // @ game+0x5a35a34
	void *6d63ecf79e(); // Function TslGame.TslGameMode.*6d63ecf79e // Native|Protected // @ game+0x5a415ac
	void *4c6a22edc5(); // Function TslGame.TslGameMode.*4c6a22edc5 // Final|Native|Public|BlueprintCallable // @ game+0x5a36220
	void *80e53d594b(); // Function TslGame.TslGameMode.*80e53d594b // Final|Native|Public|BlueprintCallable // @ game+0x5a416b0
	void *378fd52118(); // Function TslGame.TslGameMode.*378fd52118 // Final|Native|Public|Const // @ game+0x5a38744
	void *0838b3ee32(); // Function TslGame.TslGameMode.*0838b3ee32 // Final|Native|Public|BlueprintCallable // @ game+0x5a38670
	void *b12c0c0f5f(); // Function TslGame.TslGameMode.*b12c0c0f5f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3da88
	void *efcd250f27(); // Function TslGame.TslGameMode.*efcd250f27 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3a00c
	void *9aed0c3fce(); // Function TslGame.TslGameMode.*9aed0c3fce // Final|Native|Public // @ game+0x5a4b6f4
	void *e286e3da4e(); // Function TslGame.TslGameMode.*e286e3da4e // Final|Native|Public|BlueprintCallable // @ game+0x5a39574
	void *3b96dfa179(); // Function TslGame.TslGameMode.*3b96dfa179 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3c044
	void *82c1f6bc6f(); // Function TslGame.TslGameMode.*82c1f6bc6f // Final|Native|Public // @ game+0x5a4b6c4
	void *ce8a9afc10(); // Function TslGame.TslGameMode.*ce8a9afc10 // Final|Native|Public // @ game+0x5a3bf44
	void OnNetDriverError(); // Function TslGame.TslGameMode.OnNetDriverError // Final|Native|Public // @ game+0x5a3f7d8
	void *faf0d98619(); // Function TslGame.TslGameMode.*faf0d98619 // Final|Native|Public|BlueprintCallable // @ game+0x5a39c58
	void BenchmarkFinished(); // Function TslGame.TslGameMode.BenchmarkFinished // Final|Native|Public // @ game+0x5a3551c
	void *15acf96b7b(); // Function TslGame.TslGameMode.*15acf96b7b // Final|Native|Public|BlueprintCallable // @ game+0x5a3bdcc
	void *06941ed69a(); // Function TslGame.TslGameMode.*06941ed69a // Final|Native|Public|BlueprintCallable // @ game+0x5a39de4
	void OnConnectionClosedDueToSecurityViolation(); // Function TslGame.TslGameMode.OnConnectionClosedDueToSecurityViolation // Final|Native|Public|HasOutParms // @ game+0x5a3eb1c
	void *586f02c6f1(); // Function TslGame.TslGameMode.*586f02c6f1 // Final|Native|Public|Const // @ game+0x5a37e00
	void *35e18c41a5(); // Function TslGame.TslGameMode.*35e18c41a5 // Final|Native|Public|BlueprintCallable // @ game+0x5a39dcc
	void *769b799801(); // Function TslGame.TslGameMode.*769b799801 // Final|Native|Public|BlueprintCallable // @ game+0x5a38714
	void *75ca6f99dc(); // Function TslGame.TslGameMode.*75ca6f99dc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a4b6ac
	void *2121e18691(); // Function TslGame.TslGameMode.*2121e18691 // Final|Native|Public|HasOutParms // @ game+0x5a3f688
	void *20a89d68a1(); // Function TslGame.TslGameMode.*20a89d68a1 // Final|Native|Public // @ game+0x5a3bee4
	void *a7117afae7(); // Function TslGame.TslGameMode.*a7117afae7 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a362b0
	void *456d298367(); // Function TslGame.TslGameMode.*456d298367 // Final|Native|Public|Const // @ game+0x5a3872c
	void *bb5eccc0d3(); // Function TslGame.TslGameMode.*bb5eccc0d3 // Final|Native|Public|BlueprintCallable // @ game+0x5a3bc54
	void *dc53ea31cf(); // Function TslGame.TslGameMode.*dc53ea31cf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a39c1c
	void *7ef090a415(); // Function TslGame.TslGameMode.*7ef090a415 // Final|Native|Public|BlueprintCallable // @ game+0xbdbb4c
	void *8e3261e273(); // Function TslGame.TslGameMode.*8e3261e273 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a35d2c
	void *9989003212(); // Function TslGame.TslGameMode.*9989003212 // Final|Native|Public // @ game+0x5a3daac
	void LogNetDriverError(); // Function TslGame.TslGameMode.LogNetDriverError // Final|Native|Public // @ game+0x5a3dd90
	void *35abade6d4(); // Function TslGame.TslGameMode.*35abade6d4 // Final|Native|Public // @ game+0x5a0a7d4
	void OnConnectionTimeOutError(); // Function TslGame.TslGameMode.OnConnectionTimeOutError // Final|Native|Public // @ game+0x5a3ed78
	void *11f06568ff(); // Function TslGame.TslGameMode.*11f06568ff // Final|Native|Public|BlueprintCallable // @ game+0x5a3939c
	void *61505a8309(); // Function TslGame.TslGameMode.*61505a8309 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a3c560
};

// Class TslGame.*71c71bb915
// Size: 0x70 (Inherited: 0x30)
struct U*71c71bb915 : UObject {
	float *b10de450d0; // 0x30(0x04)
	float *63300d37a9; // 0x34(0x04)
	struct U*90af1ec441* SpawnSystem; // 0x38(0x08)
	struct U*248852d24f* *6edb9d2414; // 0x40(0x08)
	struct U*4cbaf935ec* *0c90b44cd6; // 0x48(0x08)
	struct TArray<struct ATslPlayerController*> *22d8ee3b15; // 0x50(0x10)
	struct TArray<struct ATslPlayerController*> *0535311753; // 0x60(0x10)

	void *5036d86dd2(); // Function TslGame.*71c71bb915.*5036d86dd2 // Final|Native|Static|Public|BlueprintCallable // @ game+0x5ab74ec
};

// Class TslGame.*248852d24f
// Size: 0xc8 (Inherited: 0x30)
struct U*248852d24f : UObject {
	struct TArray<struct F*f3ef9f53b9> *d431d007a4; // 0x30(0x10)
	int32 *38496726a5; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct F*f3ef9f53b9 *950f4939bd; // 0x48(0x18)
	int32 *b4cffe439d; // 0x60(0x04)
	int32 *1eaabb56c3; // 0x64(0x04)
	int32 *2b4b542246; // 0x68(0x04)
	int32 *6ed9636c30; // 0x6c(0x04)
	SetProperty *a2ee7194c5; // 0x70(0x50)
	char pad_C0[0x8]; // 0xc0(0x08)
};

// Class TslGame.TslWeapon
// Size: 0xa80 (Inherited: 0x408)
struct ATslWeapon : AActor {
	char pad_408[0x38]; // 0x408(0x38)
	struct UTexture* WeaponIcon; // 0x440(0x08)
	float WeaponIconRatio; // 0x448(0x04)
	int32 LogWeaponFirePerFireCount; // 0x44c(0x04)
	struct TArray<struct FName> *c155fef74a; // 0x450(0x10)
	struct TArray<struct F*ecb5dc86e0> *56cd1c3333; // 0x460(0x10)
	bool *3341b9d93a; // 0x470(0x01)
	char pad_471[0x27]; // 0x471(0x27)
	struct FMulticastDelegate OnUpdatedAttachment; // 0x498(0x10)
	struct FMulticastDelegate OnUpdatedSkinData; // 0x4a8(0x10)
	struct FMulticastDelegate OnUpdatedMasteryItem; // 0x4b8(0x10)
	struct FMulticastDelegate OnUpdatedAttachmentOnServer; // 0x4c8(0x10)
	struct FMulticastDelegate OnUpdatedCharacterEvent; // 0x4d8(0x10)
	char pad_4E8[0x8]; // 0x4e8(0x08)
	struct F*5f311a1843 WeaponConfig; // 0x4f0(0x2b0)
	enum class EWeaponHand *f18c90b2ae; // 0x7a0(0x01)
	char pad_7A1[0x7]; // 0x7a1(0x07)
	struct TArray<enum class EWeaponClass> *7cb75cac39; // 0x7a8(0x10)
	bool *86f1c6387c; // 0x7b8(0x01)
	bool *7e9d78a885; // 0x7b9(0x01)
	char pad_7BA[0x6]; // 0x7ba(0x06)
	struct U*3af93f9c2e* *2d194f4cc4; // 0x7c0(0x08)
	struct USceneComponent* RootScene; // 0x7c8(0x08)
	int8 *27e4906d44; // 0x7d0(0x01)
	char pad_7D1[0x1]; // 0x7d1(0x01)
	enum class EAttachmentCalculateType *3ea9da9a0e; // 0x7d2(0x01)
	char pad_7D3[0x5]; // 0x7d3(0x05)
	struct TArray<struct F*9a7d2121a8> *9a4c8c08cf; // 0x7d8(0x10)
	struct TArray<struct F*14b35072c4> *940ebc12ee; // 0x7e8(0x10)
	struct TArray<int32> *833175daed; // 0x7f8(0x10)
	struct TArray<struct U*b86f0faf8a*> *f5312e20ec; // 0x808(0x10)
	struct FName *1f656f1871; // 0x818(0x08)
	int32 *f9256717b9; // 0x820(0x04)
	char pad_824[0x4]; // 0x824(0x04)
	struct FText ItemName; // 0x828(0x18)
	enum class EAccessorySlot *3ec5c97e34; // 0x840(0x01)
	enum class EAllowedThrowMode *50f53b4cde; // 0x841(0x01)
	char pad_842[0x6]; // 0x842(0x06)
	struct UAkComponent* AkComponent; // 0x848(0x08)
	char pad_850[0x8]; // 0x850(0x08)
	struct FName *97d49f0835; // 0x858(0x08)
	struct FName *ec1581f603; // 0x860(0x08)
	struct UParticleSystem* *725e22d51d; // 0x868(0x08)
	struct FName *330e24db7a; // 0x870(0x08)
	struct UClass* *e5d5cea52e; // 0x878(0x08)
	struct UParticleSystemComponent* *6544dadae4; // 0x880(0x08)
	struct UParticleSystemComponent* *098c1c747f; // 0x888(0x08)
	struct UForceFeedbackEffect* *75d00854b4; // 0x890(0x08)
	enum class EAnimWeaponType *bb82accf81; // 0x898(0x01)
	char pad_899[0x7]; // 0x899(0x07)
	struct F*fac7c5caf9 *86a6db2ad3; // 0x8a0(0x18)
	struct F*becb5c24a7 *49cd660b29; // 0x8b8(0x10)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *6370a8cd3c; // 0x8c8(0x50)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *adec0791a6; // 0x918(0x50)
	float *752bff0868; // 0x968(0x04)
	bool *74659a8463; // 0x96c(0x01)
	char pad_96D[0x3]; // 0x96d(0x03)
	char *1c7d9775b0 : 1; // 0x970(0x01)
	char pad_970_1 : 7; // 0x970(0x01)
	char pad_971[0x2f]; // 0x971(0x2f)
	bool *5a9282e985; // 0x9a0(0x01)
	bool *6d2b45d1da; // 0x9a1(0x01)
	bool *8dab78c1b1; // 0x9a2(0x01)
	char pad_9A3[0x1d]; // 0x9a3(0x1d)
	struct F*1b7d567481 *1b7d567481; // 0x9c0(0x20)
	struct F*e48280cd1f *e48280cd1f; // 0x9e0(0x04)
	struct F*e48280cd1f *80962ea54b; // 0x9e4(0x04)
	struct FName WeaponMeshName; // 0x9e8(0x08)
	struct U*175e1c70da* *175e1c70da; // 0x9f0(0x08)
	char pad_9F8[0x18]; // 0x9f8(0x18)
	struct UMeshComponent* *885c68132c; // 0xa10(0x08)
	bool *a8852a54b0; // 0xa18(0x01)
	char pad_A19[0x67]; // 0xa19(0x67)

	void GetWeaponMesh(); // Function TslGame.TslWeapon.GetWeaponMesh // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecc34
	void *92c6714274(); // Function TslGame.TslWeapon.*92c6714274 // Final|Native|Public|Const // @ game+0x59b9840
	void *df3a28f51b(); // Function TslGame.TslWeapon.*df3a28f51b // Final|Native|Protected|HasOutParms|HasDefaults // @ game+0x59f58ac
	void *9e6f52576e(); // Function TslGame.TslWeapon.*9e6f52576e // Final|Native|Private // @ game+0x59f7070
	void *b3915a5951(); // Function TslGame.TslWeapon.*b3915a5951 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e7e70
	void *fd8888e99b(); // Function TslGame.TslWeapon.*fd8888e99b // Final|Native|Public|BlueprintCallable // @ game+0x59f729c
	void *c59a1a39a7(); // Function TslGame.TslWeapon.*c59a1a39a7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xaf9954
	void *9e629e353f(); // Function TslGame.TslWeapon.*9e629e353f // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x59eb8d8
	void *0a5b74ded0(); // Function TslGame.TslWeapon.*0a5b74ded0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e9a98
	void *d464ccf37e(); // Function TslGame.TslWeapon.*d464ccf37e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ec914
	void *bf2ccd9e4c(); // Function TslGame.TslWeapon.*bf2ccd9e4c // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59eb808
	void *9eb0fb792e(); // Function TslGame.TslWeapon.*9eb0fb792e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ec9bc
	void *993510ee2d(); // Function TslGame.TslWeapon.*993510ee2d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59eaf60
	void Weapon_AttachShoulder(); // Function TslGame.TslWeapon.Weapon_AttachShoulder // Final|Native|Public|BlueprintCallable // @ game+0x59f72b0
	void *409979cf20(); // Function TslGame.TslWeapon.*409979cf20 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e8454
	void OnRep_ReplicatedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedMasteryItem // Final|Native|Private // @ game+0x59f0b6c
	void OnRep_AttachedItemIndexes(); // Function TslGame.TslWeapon.OnRep_AttachedItemIndexes // Final|Native|Protected|HasOutParms // @ game+0x59f0498
	void *3f63db3390(); // Function TslGame.TslWeapon.*3f63db3390 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59eeeac
	void *37e6f06e9f(); // Function TslGame.TslWeapon.*37e6f06e9f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecbe0
	void *ed960dd846(); // Function TslGame.TslWeapon.*ed960dd846 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x59ea030
	void *bd52f37902(); // Function TslGame.TslWeapon.*bd52f37902 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59eb9b4
	void *de1b1da8db(); // Function TslGame.TslWeapon.*de1b1da8db // Native|Public|HasDefaults|BlueprintCallable // @ game+0x59e4b68
	void *80ccc1a430(); // Function TslGame.TslWeapon.*80ccc1a430 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ba650
	void *9069af2968(); // Function TslGame.TslWeapon.*9069af2968 // Native|Public|BlueprintCallable // @ game+0x59f5160
	void OnAttachmentChanged(); // Function TslGame.TslWeapon.OnAttachmentChanged // Final|Native|Public // @ game+0x59f0194
	void *ee655344c1(); // Function TslGame.TslWeapon.*ee655344c1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ea340
	void *3541dc50d3(); // Function TslGame.TslWeapon.*3541dc50d3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e92e0
	void *f06a897eae(); // Function TslGame.TslWeapon.*f06a897eae // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecb20
	void *8149f05cc5(); // Function TslGame.TslWeapon.*8149f05cc5 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59f3290
	void *b1a672045b(); // Function TslGame.TslWeapon.*b1a672045b // Final|Native|Public|BlueprintCallable // @ game+0x59e843c
	void *43b3984ab0(); // Function TslGame.TslWeapon.*43b3984ab0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ec7e8
	void *a0e978c938(); // Function TslGame.TslWeapon.*a0e978c938 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x59e4c0c
	void *0f8d1c9da1(); // Function TslGame.TslWeapon.*0f8d1c9da1 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ec8bc
	void OnRep_ReplicatedAssignedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedAssignedMasteryItem // Final|Native|Private // @ game+0xbdbb4c
	void *82c7e1475c(); // Function TslGame.TslWeapon.*82c7e1475c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e7e1c
	void *c818d8b4a8(); // Function TslGame.TslWeapon.*c818d8b4a8 // Final|Native|Public|BlueprintCallable // @ game+0x59f6f40
	void *b8ff67e657(); // Function TslGame.TslWeapon.*b8ff67e657 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ec7a8
	void *449559473e(); // Function TslGame.TslWeapon.*449559473e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb4ea2c
	void *62149faccf(); // Function TslGame.TslWeapon.*62149faccf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ea358
	void *fcfbaa8fba(); // Function TslGame.TslWeapon.*fcfbaa8fba // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ec7d0
	void *13d2f0af87(); // Function TslGame.TslWeapon.*13d2f0af87 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecbf8
	void *ed72fe7d51(); // Function TslGame.TslWeapon.*ed72fe7d51 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecb3c
	void OnLoadedAttachmentAssetDatas(); // Function TslGame.TslWeapon.OnLoadedAttachmentAssetDatas // Native|Public|HasOutParms // @ game+0x6fb2c0
	void *cd1b7ea700(); // Function TslGame.TslWeapon.*cd1b7ea700 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecce8
	void *96ae496225(); // Function TslGame.TslWeapon.*96ae496225 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59e8044
	void *8923970e6a(); // Function TslGame.TslWeapon.*8923970e6a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecb08
	void OnRep_ItemIndex(); // Function TslGame.TslWeapon.OnRep_ItemIndex // Final|Native|Protected // @ game+0xc6b498
	void *84decf0242(); // Function TslGame.TslWeapon.*84decf0242 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ea370
	void *11aac3845f(); // Function TslGame.TslWeapon.*11aac3845f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59ecb54
	void *393e1d26d7(); // Function TslGame.TslWeapon.*393e1d26d7 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x59f00a8
	void OnRep_ReplicatedSkinParam(); // Function TslGame.TslWeapon.OnRep_ReplicatedSkinParam // Final|Native|Private // @ game+0x59f0bec
	void *97abf1dde7(); // Function TslGame.TslWeapon.*97abf1dde7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x6f459c
	void *21d53206aa(); // Function TslGame.TslWeapon.*21d53206aa // Final|Native|Public|Const // @ game+0x59ecc1c
};

// Class TslGame.TslWeapon_Gun
// Size: 0x1000 (Inherited: 0xa80)
struct ATslWeapon_Gun : ATslWeapon {
	bool bSpawnBulletFromBarrel; // 0xa78(0x01)
	bool *2b7a712987; // 0xa79(0x01)
	enum class EWeaponState CurrentState; // 0xa7a(0x01)
	int32 *f6c1f1f79e; // 0xa7c(0x04)
	int32 *33d57d6922; // 0xa80(0x04)
	int32 *acb0ec39b8; // 0xa84(0x04)
	int32 *68abd40105; // 0xa88(0x04)
	char *5f0123dd56 : 1; // 0xa8c(0x01)
	char *1d3b2a4774 : 1; // 0xa8c(0x01)
	char *a565bd132e : 1; // 0xa8c(0x01)
	char pad_A93_3 : 5; // 0xa93(0x01)
	char pad_A94[0x2c]; // 0xa94(0x2c)
	int32 *fa1d80b941; // 0xac0(0x04)
	bool *151c600d42; // 0xac4(0x01)
	char pad_AC5[0x7b]; // 0xac5(0x7b)
	struct F*9c84e0ea54 *210e3c2d6b; // 0xb40(0x08)
	char pad_B48[0x58]; // 0xb48(0x58)
	struct F*c0c1470287 *c2acb84dc9; // 0xba0(0xa8)
	struct U*b77f654b52* *b77f654b52; // 0xc48(0x08)
	struct F*5d1a10b2e2 *8a6321f206; // 0xc50(0x20)
	struct FName ScopingAttachPoint; // 0xc70(0x08)
	struct FName *425762ecff; // 0xc78(0x08)
	struct FName *9b36050d56; // 0xc80(0x08)
	char pad_C88[0x278]; // 0xc88(0x278)
	int32 GripTypeIndexOverride; // 0xf00(0x04)
	bool *6ef5792022; // 0xf04(0x01)
	char pad_F05[0x3]; // 0xf05(0x03)
	float *6e83d3b242; // 0xf08(0x04)
	char pad_F0C[0xc]; // 0xf0c(0x0c)
	struct U*d8975ea1b4* WeaponGunData; // 0xf18(0x08)
	char pad_F20[0x20]; // 0xf20(0x20)
	struct UAkAudioEvent* *08518cce0d; // 0xf40(0x08)
	struct F*33858a901d *33858a901d; // 0xf48(0x20)
	struct UStaticMeshComponent* *33914398f4; // 0xf68(0x08)
	struct U*45324caa2d* *428417a959; // 0xf70(0x08)
	char pad_F78[0x4]; // 0xf78(0x04)
	struct FVector ShootTargetLoc; // 0xf7c(0x0c)
	char pad_F88[0x78]; // 0xf88(0x78)

	void *31a5a8fd05(); // Function TslGame.TslWeapon_Gun.*31a5a8fd05 // Net|Native|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x837f48
	void *7d242ae9ea(); // Function TslGame.TslWeapon_Gun.*7d242ae9ea // Final|Native|Protected // @ game+0x5a2a05c
	void *ad46cc8961(); // Function TslGame.TslWeapon_Gun.*ad46cc8961 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x837128
	void *248de7d776(); // Function TslGame.TslWeapon_Gun.*248de7d776 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xce8adc
	void *d8d6fcafa2(); // Function TslGame.TslWeapon_Gun.*d8d6fcafa2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a088ec
	void *d841e1ce81(); // Function TslGame.TslWeapon_Gun.*d841e1ce81 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a1fa04
	void *979d42dd86(); // Function TslGame.TslWeapon_Gun.*979d42dd86 // Final|Native|Public|BlueprintCallable // @ game+0x5a26758
	void *642b61ab64(); // Function TslGame.TslWeapon_Gun.*642b61ab64 // Final|Native|Public|BlueprintCallable // @ game+0x5a272bc
	void *7dfbc4507a(); // Function TslGame.TslWeapon_Gun.*7dfbc4507a // Final|Native|Public|BlueprintCallable // @ game+0x59fccc4
	void *058d3c8a98(); // Function TslGame.TslWeapon_Gun.*058d3c8a98 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a081bc
	void *afaa6e52f4(); // Function TslGame.TslWeapon_Gun.*afaa6e52f4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a07b18
	void *2300d5a3f9(); // Function TslGame.TslWeapon_Gun.*2300d5a3f9 // Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable // @ game+0x59feb0c
	void *1407df09a9(); // Function TslGame.TslWeapon_Gun.*1407df09a9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c6e4
	void *4bc831ce42(); // Function TslGame.TslWeapon_Gun.*4bc831ce42 // Final|Native|Protected // @ game+0x5a15964
	void *9bd94faf4b(); // Function TslGame.TslWeapon_Gun.*9bd94faf4b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc3c8d8
	void *d2085cbee4(); // Function TslGame.TslWeapon_Gun.*d2085cbee4 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a08724
	void *aa24209ff8(); // Function TslGame.TslWeapon_Gun.*aa24209ff8 // Final|Native|Protected // @ game+0x5a15944
	void *a5589df59c(); // Function TslGame.TslWeapon_Gun.*a5589df59c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0a9c8
	void *ad59dc5059(); // Function TslGame.TslWeapon_Gun.*ad59dc5059 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0f890
	void *bdd6ec6f74(); // Function TslGame.TslWeapon_Gun.*bdd6ec6f74 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x5a17e30
	void *cad8a68f27(); // Function TslGame.TslWeapon_Gun.*cad8a68f27 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0819c
	void *b92e9dd84d(); // Function TslGame.TslWeapon_Gun.*b92e9dd84d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a2a4ac
	void *3c5f715473(); // Function TslGame.TslWeapon_Gun.*3c5f715473 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc428b0
	void *2b49eec055(); // Function TslGame.TslWeapon_Gun.*2b49eec055 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0d65c
	void *09b4d793b3(); // Function TslGame.TslWeapon_Gun.*09b4d793b3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a09f40
	void *06b64efd0c(); // Function TslGame.TslWeapon_Gun.*06b64efd0c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c110
	void *e29bc6bca6(); // Function TslGame.TslWeapon_Gun.*e29bc6bca6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a080c0
	void *71e2a0d4c8(); // Function TslGame.TslWeapon_Gun.*71e2a0d4c8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5a09e04
	void *a412d4c137(); // Function TslGame.TslWeapon_Gun.*a412d4c137 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a1e574
	void *6911194f85(); // Function TslGame.TslWeapon_Gun.*6911194f85 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a08060
	void *17b45558a1(); // Function TslGame.TslWeapon_Gun.*17b45558a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbe3180
	void *ef222655fb(); // Function TslGame.TslWeapon_Gun.*ef222655fb // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x837a94
	void *edc8ab42c4(); // Function TslGame.TslWeapon_Gun.*edc8ab42c4 // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x836f7c
	void *584e366a85(); // Function TslGame.TslWeapon_Gun.*584e366a85 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59fd480
	void *f84543f3b8(); // Function TslGame.TslWeapon_Gun.*f84543f3b8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc889f4
	void *a2c5e23427(); // Function TslGame.TslWeapon_Gun.*a2c5e23427 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0bec0
	void *d419db682b(); // Function TslGame.TslWeapon_Gun.*d419db682b // Native|Protected // @ game+0x59cc844
	void *2339731b60(); // Function TslGame.TslWeapon_Gun.*2339731b60 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c210
	void *0cc1972262(); // Function TslGame.TslWeapon_Gun.*0cc1972262 // Final|Native|Public|BlueprintCallable // @ game+0x59fccb0
	void *4f288ed422(); // Function TslGame.TslWeapon_Gun.*4f288ed422 // Final|Native|Public // @ game+0x59fd95c
	void *a103ef2847(); // Function TslGame.TslWeapon_Gun.*a103ef2847 // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x5a00674
	void *ea5c3ed034(); // Function TslGame.TslWeapon_Gun.*ea5c3ed034 // Final|Native|Public|BlueprintCallable // @ game+0x5a27a4c
	void IsReloading(); // Function TslGame.TslWeapon_Gun.IsReloading // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0eea4
	void *35b690c7e0(); // Function TslGame.TslWeapon_Gun.*35b690c7e0 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c5d4
	void *2e244869ed(); // Function TslGame.TslWeapon_Gun.*2e244869ed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb0df48
	void *5eb735ec1e(); // Function TslGame.TslWeapon_Gun.*5eb735ec1e // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0xcbd24c
	void *4081d80647(); // Function TslGame.TslWeapon_Gun.*4081d80647 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a086c0
	void *5ffe6c4211(); // Function TslGame.TslWeapon_Gun.*5ffe6c4211 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c1e4
	void *f67b8314a5(); // Function TslGame.TslWeapon_Gun.*f67b8314a5 // Final|Native|Public // @ game+0x59fe3c0
	void OnAttachmentAngledScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentAngledScopeLoaded // Final|Native|Protected // @ game+0x5a11524
	void *0bd17782e3(); // Function TslGame.TslWeapon_Gun.*0bd17782e3 // Final|Native|Public // @ game+0x59fe298
	void *b4940e5522(); // Function TslGame.TslWeapon_Gun.*b4940e5522 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a24a24
	void OnRep_AmmoCount(); // Function TslGame.TslWeapon_Gun.OnRep_AmmoCount // Final|Native|Protected // @ game+0xaf7578
	void *8d491aa10e(); // Function TslGame.TslWeapon_Gun.*8d491aa10e // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a094b0
	void *c5cba59887(); // Function TslGame.TslWeapon_Gun.*c5cba59887 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a08080
	void *25602c2058(); // Function TslGame.TslWeapon_Gun.*25602c2058 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c0d0
	void *e6d0f3205e(); // Function TslGame.TslWeapon_Gun.*e6d0f3205e // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a1e3f0
	void *e1e715b080(); // Function TslGame.TslWeapon_Gun.*e1e715b080 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0bef4
	void *431255a2c0(); // Function TslGame.TslWeapon_Gun.*431255a2c0 // Final|Native|Public|BlueprintCallable // @ game+0x59fcd00
	void *147dcb989d(); // Function TslGame.TslWeapon_Gun.*147dcb989d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a09d44
	void *7919c207fd(); // Function TslGame.TslWeapon_Gun.*7919c207fd // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0adc0
	void *b9c362567d(); // Function TslGame.TslWeapon_Gun.*b9c362567d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5a09e30
	void OnInventoryUpdated(); // Function TslGame.TslWeapon_Gun.OnInventoryUpdated // Final|Native|Protected // @ game+0x5a12804
	void OnAttachmentMainScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentMainScopeLoaded // Final|Native|Protected // @ game+0x5a11538
	void *dfb18e05e6(); // Function TslGame.TslWeapon_Gun.*dfb18e05e6 // Final|Native|Public|BlueprintCallable // @ game+0x59fccec
	void *e3078ac333(); // Function TslGame.TslWeapon_Gun.*e3078ac333 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c95c
	void *dbcf469757(); // Function TslGame.TslWeapon_Gun.*dbcf469757 // Net|NetReliableNative|Event|NetMulticast|Protected|NetClient|NetValidate // @ game+0x5a00da0
	void *7b810e1014(); // Function TslGame.TslWeapon_Gun.*7b810e1014 // Net|Native|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x7a29e8
	void *13909e8741(); // Function TslGame.TslWeapon_Gun.*13909e8741 // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x59b82bc
	void *fca772fdb3(); // Function TslGame.TslWeapon_Gun.*fca772fdb3 // Final|Native|Public|BlueprintCallable // @ game+0x59fcd14
	void *e0d752cc0f(); // Function TslGame.TslWeapon_Gun.*e0d752cc0f // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0xba39ac
	void *6c302122d1(); // Function TslGame.TslWeapon_Gun.*6c302122d1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a081dc
	void *8816c72958(); // Function TslGame.TslWeapon_Gun.*8816c72958 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a19084
	void *df3b281adc(); // Function TslGame.TslWeapon_Gun.*df3b281adc // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a1ff18
	void *2b04054063(); // Function TslGame.TslWeapon_Gun.*2b04054063 // Net|NetReliableNative|Event|Public|NetClient // @ game+0x5a03844
	void *62a2805823(); // Function TslGame.TslWeapon_Gun.*62a2805823 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a09e9c
	void *14907961bd(); // Function TslGame.TslWeapon_Gun.*14907961bd // Final|Native|Public|BlueprintCallable // @ game+0x59fccd8
	void OnRep_FiringModeIndex(); // Function TslGame.TslWeapon_Gun.OnRep_FiringModeIndex // Final|Native|Public // @ game+0xbee96c
	void OnRep_CurrentZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentZeroLevel // Final|Native|Protected // @ game+0x5a136b0
	void *c330b37b02(); // Function TslGame.TslWeapon_Gun.*c330b37b02 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a07c3c
	void OnGameUserSettingApplied(); // Function TslGame.TslWeapon_Gun.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x5a12030
	void *5f414c349a(); // Function TslGame.TslWeapon_Gun.*5f414c349a // Final|Native|Protected // @ game+0x59fc7ec
	void OnRep_CurrentCantedZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentCantedZeroLevel // Final|Native|Protected // @ game+0x5a13620
	void *0b55220f54(); // Function TslGame.TslWeapon_Gun.*0b55220f54 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a080a0
	void *4eec5e67c0(); // Function TslGame.TslWeapon_Gun.*4eec5e67c0 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a232c4
	void *129bd82b0f(); // Function TslGame.TslWeapon_Gun.*129bd82b0f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x7a0178
	void *35ed504bf5(); // Function TslGame.TslWeapon_Gun.*35ed504bf5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a09f60
	void *25f18f4409(); // Function TslGame.TslWeapon_Gun.*25f18f4409 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a081fc
	void *393e1d26d7(); // Function TslGame.TslWeapon_Gun.*393e1d26d7 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x59f00a8
	void *e67c19557c(); // Function TslGame.TslWeapon_Gun.*e67c19557c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c0e8
	void *f624637ea6(); // Function TslGame.TslWeapon_Gun.*f624637ea6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a07710
	void *598c9973c6(); // Function TslGame.TslWeapon_Gun.*598c9973c6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0803c
	void *5e6fcef5e4(); // Function TslGame.TslWeapon_Gun.*5e6fcef5e4 // Final|Native|Protected // @ game+0x59fc7ec
	void *40a96b2766(); // Function TslGame.TslWeapon_Gun.*40a96b2766 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c0b8
	void *7484e185ed(); // Function TslGame.TslWeapon_Gun.*7484e185ed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0a9e8
	void *8bd011ab27(); // Function TslGame.TslWeapon_Gun.*8bd011ab27 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a086e4
	void *8320442aa8(); // Function TslGame.TslWeapon_Gun.*8320442aa8 // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5a08ab0
	void *35451f816e(); // Function TslGame.TslWeapon_Gun.*35451f816e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x83ca4c
	void *6c14d99f00(); // Function TslGame.TslWeapon_Gun.*6c14d99f00 // Final|Native|Public|BlueprintCallable // @ game+0x5a092dc
	void *09ace472f0(); // Function TslGame.TslWeapon_Gun.*09ace472f0 // Native|Protected // @ game+0x59bb658
	void *ce01855a38(); // Function TslGame.TslWeapon_Gun.*ce01855a38 // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x5a23c74
	void *f721879a8b(); // Function TslGame.TslWeapon_Gun.*f721879a8b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0f870
	void *44b1af90ce(); // Function TslGame.TslWeapon_Gun.*44b1af90ce // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0c094
	void *f7c44a6a47(); // Function TslGame.TslWeapon_Gun.*f7c44a6a47 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a0f8b0
	void *23b49fdaf1(); // Function TslGame.TslWeapon_Gun.*23b49fdaf1 // Final|Native|Public // @ game+0x59fcdbc
	void *9571e10fa6(); // Function TslGame.TslWeapon_Gun.*9571e10fa6 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a1e290
	void *e33b09c09d(); // Function TslGame.TslWeapon_Gun.*e33b09c09d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a07b34
	void *1cff387ce1(); // Function TslGame.TslWeapon_Gun.*1cff387ce1 // Final|Native|Protected // @ game+0x5a15abc
	void *497f900211(); // Function TslGame.TslWeapon_Gun.*497f900211 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5a1fb24
};

// Class TslGame.TslWeapon_Gun_Launcher
// Size: 0x1080 (Inherited: 0x1000)
struct ATslWeapon_Gun_Launcher : ATslWeapon_Gun {
	struct UClass* *653adb61af; // 0xf90(0x08)
	float *f88a0c0452; // 0xf98(0x04)
	struct UCurveFloat* *9fa9a39b5e; // 0xfa0(0x08)
	float *90d02c51a1; // 0xfa8(0x04)
	float *ccff47a1d9; // 0xfac(0x04)
	float *8ca3c3f9ab; // 0xfb0(0x04)
	struct UAnimMontage* *41e94f299f; // 0xfb8(0x08)
	struct F*4892bd8b99 *ce2565ed6a; // 0xfc0(0x28)
	char pad_1050[0x30]; // 0x1050(0x30)

	void *e65a618e87(); // Function TslGame.TslWeapon_Gun_Launcher.*e65a618e87 // Final|Native|Public // @ game+0x59b840c
	void *5156a12858(); // Function TslGame.TslWeapon_Gun_Launcher.*5156a12858 // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0x59bb9a0
	void *615aef68c3(); // Function TslGame.TslWeapon_Gun_Launcher.*615aef68c3 // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0x59bb83c
	void *a87ca88c88(); // Function TslGame.TslWeapon_Gun_Launcher.*a87ca88c88 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59c96a8
	void OnBlockingWidgetOpened(); // Function TslGame.TslWeapon_Gun_Launcher.OnBlockingWidgetOpened // Final|Native|Public // @ game+0x59bd110
