// AnimBlueprintGeneratedClass ABP_Vantage.ABP_Vantage_C
// Size: 0x4f50 (Inherited: 0xd40)
struct UABP_Vantage_C : U*287b8eb21b {
	struct F*a3d8ff36c0 UberGraphFrame; // 0xd40(0x08)
	struct FAnimNode_Root _e47e69fd28_D8EA554F4C955192492F9E856CB1FBDF; // 0xd48(0x48)
	struct FAnimNode_MeshSpaceRefPose _b35b703941_1ED9130249A0B648F246258D28A25F9E; // 0xd90(0x30)
	struct FAnimNode_ModifyBone _cac7fc2d7b_1C88291D452A366BB0BE3F8A53A747D1; // 0xdc0(0x140)
	struct FAnimNode_ModifyBone _cac7fc2d7b_CEE5BE0C48BBF78331B2E2839FD1059D; // 0xf00(0x140)
	struct FAnimNode_ModifyBone _cac7fc2d7b_223630024882F120B1D061B2CA895ECC; // 0x1040(0x140)
	struct FAnimNode_ModifyBone _cac7fc2d7b_C101F17D4D2CF53AC5BCED8976DD942A; // 0x1180(0x140)
	struct FAnimNode_ModifyBone _cac7fc2d7b_E3C6FCEE4F4059315DF4DFA4F71F63EF; // 0x12c0(0x140)
	struct FAnimNode_BoneDrivenController _24ad7232c5_5E2DA44D486DCD20DFB3D7A29CF41075; // 0x1400(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_AD7918FE453E4D12F679CF8E01A08CB8; // 0x1570(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_E1033AD9439F76393FF522954E91DFE7; // 0x16e0(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_B810A3B24212CCC80A6989AFAAAF525F; // 0x1850(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_ED2ECF6E4D2833DECE46E594C15843DF; // 0x19c0(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_68E05A4646374482331AC4A20BA94CD4; // 0x1b30(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_175BC46C49FC62FC129FC6804F58A6ED; // 0x1ca0(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_F9245701480567B383A1DA96BC4891F6; // 0x1e10(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_07D954314091BD5FA1D6178B1879364B; // 0x1f80(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_6252969C46C3C294E1D0189B1B7E4E90; // 0x20f0(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_AC095A9F42A6DE37CF48F69399A83594; // 0x2260(0x170)
	struct FAnimNode_BoneDrivenController _24ad7232c5_6DE3275B42C81D4465C0F6A153906885; // 0x23d0(0x170)
	struct FAnimNode_LookAt _03cd01367b_73C33EFA4E060E002B465F8C62847F4A; // 0x2540(0x200)
	struct FAnimNode_LookAt _03cd01367b_7E0C264E481082E73C70FAB379F7DDDD; // 0x2740(0x200)
	struct FAnimNode_LookAt _03cd01367b_5430FCC14AF8896CBD110A80389852D6; // 0x2940(0x200)
	struct FAnimNode_LookAt _03cd01367b_677538C64A71B1DA103F3CB92E876662; // 0x2b40(0x200)
	struct FAnimNode_LookAt _03cd01367b_33B71EB2433BB73D92B04EA208142364; // 0x2d40(0x200)
	struct FAnimNode_LookAt _03cd01367b_B896AB38465072C0098B0D9072EB4B70; // 0x2f40(0x200)
	struct FAnimNode_LookAt _03cd01367b_3549C6154F3182A076BF75BA5E863E6C; // 0x3140(0x200)
	struct FAnimNode_LookAt _03cd01367b_410EB34F48339CE7B4A9FDB1D552A309; // 0x3340(0x200)
	struct FAnimNode_LookAt _03cd01367b_58282DB94907DA5A7D38D4A1CDD94A38; // 0x3540(0x200)
	struct FAnimNode_LookAt _03cd01367b_86E4982F4A7BE24E4006F684CCB5E551; // 0x3740(0x200)
	struct FAnimNode_LookAt _03cd01367b_998B2282474BE2D5916BBBA6A8DAC68D; // 0x3940(0x200)
	struct FAnimNode_LookAt _03cd01367b_7A9A32124636B224F023619129711DF3; // 0x3b40(0x200)
	struct FAnimNode_LookAt _03cd01367b_27230110484FDAB622AB1DAF23300E77; // 0x3d40(0x200)
	struct FAnimNode_LookAt _03cd01367b_C18E5200435CD88923E4E38DED66A72F; // 0x3f40(0x200)
	struct FAnimNode_LookAt _03cd01367b_D3EB0992446E8E7DE0E0F794632DBE23; // 0x4140(0x200)
	struct FAnimNode_LookAt _03cd01367b_B5A92C7A41C4537E669B4FB4172EFB80; // 0x4340(0x200)
	struct FAnimNode_ModifyBone _cac7fc2d7b_65735C8B450B9DB1C9E53287A930339B; // 0x4540(0x140)
	struct FAnimNode_RotationMultiplier _ebe7983204_3D479706464CE9948506A4A0DD2B2D27; // 0x4680(0x130)
	struct FAnimNode_ModifyBone _cac7fc2d7b_DEDCFA4D4A83D9174D971A9346ABAD0C; // 0x47b0(0x140)
	struct FAnimNode_RotationMultiplier _ebe7983204_5B76E0E0412120181573E19B939EAA40; // 0x48f0(0x130)
	struct FAnimNode_RotationMultiplier _ebe7983204_392E2B2F4539B014C5DA88BF7C0EEBA7; // 0x4a20(0x130)
	struct FAnimNode_RotationMultiplier _ebe7983204_FC3A84504A2753DE09592291527C8981; // 0x4b50(0x130)
	struct FAnimNode_ConvertComponentToLocalSpace _36d9debb93_FC0AFD2E4EF5849696AC86855E8E47D9; // 0x4c80(0x48)
	struct FAnimNode_ApplyAdditive _1bbf6b5994_7F91A1334FAD7BA1C726A3A1D517410F; // 0x4cc8(0x108)
	struct FAnimNode_SequenceEvaluator _3e8da72dff_F6F23FA64F0B640039F267AC6E095B8A; // 0x4dd0(0x70)
	struct FAnimNode_WheelHandler AnimGraphNode_WheelHandler_886B6E3745C8E80CCB3D96826F05C9E7; // 0x4e40(0x110)

	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*3e8da72dff_F6F23FA64F0B640039F267AC6E095B8A(); // Function ABP_Vantage.ABP_Vantage_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*3e8da72dff_F6F23FA64F0B640039F267AC6E095B8A // BlueprintEvent // @ game+0x21d2c4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*cac7fc2d7b_DEDCFA4D4A83D9174D971A9346ABAD0C(); // Function ABP_Vantage.ABP_Vantage_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*cac7fc2d7b_DEDCFA4D4A83D9174D971A9346ABAD0C // BlueprintEvent // @ game+0x21d2c4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*cac7fc2d7b_65735C8B450B9DB1C9E53287A930339B(); // Function ABP_Vantage.ABP_Vantage_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*cac7fc2d7b_65735C8B450B9DB1C9E53287A930339B // BlueprintEvent // @ game+0x21d2c4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*cac7fc2d7b_1C88291D452A366BB0BE3F8A53A747D1(); // Function ABP_Vantage.ABP_Vantage_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Vantage_*cac7fc2d7b_1C88291D452A366BB0BE3F8A53A747D1 // BlueprintEvent // @ game+0x21d2c4
	void ExecuteUbergraph_ABP_Vantage(); // Function ABP_Vantage.ABP_Vantage_C.ExecuteUbergraph_ABP_Vantage //  // @ game+0x21d2c4
};

