// BlueprintGeneratedClass BP_MasteryPose_Mannequins.BP_MasteryPose_Mannequins_C
// Size: 0x490 (Inherited: 0x448)
struct ABP_MasteryPose_Mannequins_C : ABP_MasteryPose_C {
	struct UAsyncStaticMeshComponent* PlayerCardMannequin2; // 0x448(0x08)
	struct UAsyncStaticMeshComponent* PlayerCardMannequin1; // 0x450(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Back2; // 0x458(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Back1; // 0x460(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Front2; // 0x468(0x08)
	struct UAsyncStaticMeshComponent* MannequinMesh_Front1; // 0x470(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x478(0x08)
	struct USpotLightComponent* LobbySpotLight; // 0x480(0x08)
	struct USpotLightComponent* spotlight; // 0x488(0x08)

	void UserConstructionScript(); // Function BP_MasteryPose_Mannequins.BP_MasteryPose_Mannequins_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x21d2c4
};

