// Class ORCA.ORCAManager
// Size: 0x470 (Inherited: 0x3f8)
struct AORCAManager : AActor {
	char pad_3F8[0x50]; // 0x3f8(0x50)
	struct FString *12671cc458; // 0x448(0x10)
	float NeighborDist; // 0x458(0x04)
	int32 MaxNeighbors; // 0x45c(0x04)
	float TimeHorizon; // 0x460(0x04)
	float Radius; // 0x464(0x04)
	float MaxSpeed; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
};

