// Class TslGame.AbstractRespawnProcessor
// Size: 0x480 (Inherited: 0x3f8)
struct AAbstractRespawnProcessor : AActor {
	float *8a03dc8c46; // 0x3f8(0x04)
	float *328be9d4dc; // 0x3fc(0x04)
	bool *32b14976a3; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct TArray<struct UClass*> *bd4a4d050c; // 0x408(0x10)
	struct FMulticastDelegate OnRespawnStarted; // 0x418(0x10)
	struct FMulticastDelegate OnRespawnEnded; // 0x428(0x10)
	struct FMulticastDelegate OnRespawned; // 0x438(0x10)
	struct FMulticastDelegate OnCharacterDead; // 0x448(0x10)
	struct FMulticastDelegate OnRespawnedByRound; // 0x458(0x10)
	struct TArray<struct F*df332186d2> *13f1ba577b; // 0x468(0x10)
	char pad_478[0x8]; // 0x478(0x08)

	void OnCharactersRespawnedImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharactersRespawnedImpl // Native|Protected // @ game+0x5900b94
	void *9c8f2fb196(); // Function TslGame.AbstractRespawnProcessor.*9c8f2fb196 // Native|Protected // @ game+0x5900ab4
	void OnRoundUpdatedImpl(); // Function TslGame.AbstractRespawnProcessor.OnRoundUpdatedImpl // Native|Protected // @ game+0x5900bac
	void OnCharacterDeadImpl(); // Function TslGame.AbstractRespawnProcessor.OnCharacterDeadImpl // Native|Protected // @ game+0x5900a20
};

// Class TslGame.*591287be08
// Size: 0x600 (Inherited: 0x3a8)
struct U*591287be08 : UAnimInstance {
	struct ATslCharacter* *dfcbe27960; // 0x3a8(0x08)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct FRotator ParachuteRotation_CP; // 0x3b8(0x0c)
	float ParaTurn_CP; // 0x3c4(0x04)
	float ParaPitch_CP; // 0x3c8(0x04)
	bool bIsReleased_CP; // 0x3cc(0x01)
	bool bIsReplayJumping_CP; // 0x3cd(0x01)
	char pad_3CE[0x2]; // 0x3ce(0x02)
	struct FTransform IK_L_CP; // 0x3d0(0x30)
	struct FTransform IK_R_CP; // 0x400(0x30)
	struct FVector IK_L_Location_CP; // 0x430(0x0c)
	struct FRotator IK_L_Rotation_CP; // 0x43c(0x0c)
	struct FVector IK_R_Location_CP; // 0x448(0x0c)
	struct FRotator IK_R_Rotation_CP; // 0x454(0x0c)
	float EnableIKAlpha_CP; // 0x460(0x04)
	float RigidbodyAlpha; // 0x464(0x04)
	float PhysicsBlendAlpha; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct FTransform IK_L_Handle_CP; // 0x470(0x30)
	struct FTransform IK_R_Handle_CP; // 0x4a0(0x30)
	struct FTransform IK_L_Strap_CP; // 0x4d0(0x30)
	struct FTransform IK_R_Strap_CP; // 0x500(0x30)
	float IK_L_Handle_Alpha_CP; // 0x530(0x04)
	float IK_R_Handle_Alpha_CP; // 0x534(0x04)
	float RollTendency; // 0x538(0x04)
	float PitchTendency; // 0x53c(0x04)
	float TendencyFrame; // 0x540(0x04)
	bool bIsLanding_CP; // 0x544(0x01)
	char pad_545[0x3]; // 0x545(0x03)
	float LandingAlpha_CP; // 0x548(0x04)
	bool bIsMoving_CP; // 0x54c(0x01)
	bool bIsCollapsed_CP; // 0x54d(0x01)
	bool bIsManualCutoff_CP; // 0x54e(0x01)
	bool bIsAutoCutoff_CP; // 0x54f(0x01)
	float ParaAnimTimeFromStart_CP; // 0x550(0x04)
	float ClientRotYawScale; // 0x554(0x04)
	bool bUseNewParachuteAnims; // 0x558(0x01)
	char pad_559[0x7]; // 0x559(0x07)
	struct FName LeftItemBoneName; // 0x560(0x08)
	struct FName RightItemBoneName; // 0x568(0x08)
	struct FName LeftHandleBoneName; // 0x570(0x08)
	struct FName RightHandleBoneName; // 0x578(0x08)
	struct FName LeftStrapBoneName; // 0x580(0x08)
	struct FName RightStrapBoneName; // 0x588(0x08)
	float LandingCheckVelocityScalar; // 0x590(0x04)
	float LandingCheckStartAltitude; // 0x594(0x04)
	float LandingCheckTickTime; // 0x598(0x04)
	struct FVector TerminalVelocity_CP; // 0x59c(0x0c)
	float *b00d562539; // 0x5a8(0x04)
	float *ed06b20e6c; // 0x5ac(0x04)
	struct FVector *05e0073d2c; // 0x5b0(0x0c)
	float *1cbcd972f8; // 0x5bc(0x04)
	struct TArray<struct FName> *5beae6dc54; // 0x5c0(0x10)
	bool *727097d441; // 0x5d0(0x01)
	char pad_5D1[0x3]; // 0x5d1(0x03)
	struct FVector *13204e3aee; // 0x5d4(0x0c)
	int32 *109cd1c351; // 0x5e0(0x04)
	char pad_5E4[0x1c]; // 0x5e4(0x1c)

	void *5b0473300f(); // Function TslGame.*591287be08.*5b0473300f // Final|Native|Public|BlueprintCallable // @ game+0x5900a0c
	void *b198d84ed5(); // Function TslGame.*591287be08.*b198d84ed5 // Final|Native|Public|BlueprintCallable // @ game+0x59009f8
	void DetachPara_BP(); // Function TslGame.*591287be08.DetachPara_BP // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void *53d9412ab1(); // Function TslGame.*591287be08.*53d9412ab1 // Final|Native|Public|BlueprintCallable // @ game+0x59009e0
};

// Class TslGame.*477b63fdaa
// Size: 0x318 (Inherited: 0x258)
struct U*477b63fdaa : UUserWidget {
	struct U*37a897c2a6* *55556884b0; // 0x258(0x08)
	char pad_260[0x48]; // 0x260(0x48)
	struct FMulticastDelegate WidgetDestroyEventDelegate; // 0x2a8(0x10)
	char pad_2B8[0x60]; // 0x2b8(0x60)

	void TransferUserFocusThroughReply(); // Function TslGame.*477b63fdaa.TransferUserFocusThroughReply // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0x5956210
	void GetTslGameUserSettings(); // Function TslGame.*477b63fdaa.GetTslGameUserSettings // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594b318
	void StopListeningForAllInputAxises(); // Function TslGame.*477b63fdaa.StopListeningForAllInputAxises // Final|Native|Public|BlueprintCallable // @ game+0x59559d4
	void SetupInputForBlueprint(); // Function TslGame.*477b63fdaa.SetupInputForBlueprint // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void GetDemoPlayerState(); // Function TslGame.*477b63fdaa.GetDemoPlayerState // Final|Native|Public|BlueprintCallable // @ game+0x5948a10
	void IsObserving(); // Function TslGame.*477b63fdaa.IsObserving // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594dbf4
	void GetCachedViewTargetTslCharacter(); // Function TslGame.*477b63fdaa.GetCachedViewTargetTslCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594815c
	void GetCachedCharacter(); // Function TslGame.*477b63fdaa.GetCachedCharacter // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5948114
	void TslUserWidgetDestroyEvent__DelegateSignature(); // DelegateFunction TslGame.*477b63fdaa.TslUserWidgetDestroyEvent__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x21d2c4
	void NavigateUserFocus(); // Function TslGame.*477b63fdaa.NavigateUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x594f8a8
	void ContainOwnerUserFocus(); // Function TslGame.*477b63fdaa.ContainOwnerUserFocus // Final|Native|Public|BlueprintCallable // @ game+0x5945f98
	void IsSpectating(); // Function TslGame.*477b63fdaa.IsSpectating // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594e3d0
	void GetRawKeyValue(); // Function TslGame.*477b63fdaa.GetRawKeyValue // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x594a398
	void GetCachedGameState(); // Function TslGame.*477b63fdaa.GetCachedGameState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5948138
	void IsParticipatedInRedeploy(); // Function TslGame.*477b63fdaa.IsParticipatedInRedeploy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594dca0
	void IsInLobby(); // Function TslGame.*477b63fdaa.IsInLobby // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594d0f0
	void IsReplaying(); // Function TslGame.*477b63fdaa.IsReplaying // Final|Native|Public|BlueprintCallable // @ game+0x594ded8
	void *464adbec98(); // Function TslGame.*477b63fdaa.*464adbec98 // Final|Native|Public // @ game+0x59559e8
	void ListenForInputAxis(); // Function TslGame.*477b63fdaa.ListenForInputAxis // Final|Native|Public|BlueprintCallable // @ game+0x594efb4
	void *890de8615c(); // Function TslGame.*477b63fdaa.*890de8615c // Final|Native|Private // @ game+0x59507d8
	void ContainUserFocus(); // Function TslGame.*477b63fdaa.ContainUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x5945fd4
	void GetAxisMultiplier(); // Function TslGame.*477b63fdaa.GetAxisMultiplier // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5947eb0
	void ClearUserFocus(); // Function TslGame.*477b63fdaa.ClearUserFocus // Final|Native|Static|Public|BlueprintCallable // @ game+0x5944f80
};

// Class TslGame.*eb79fdee2a
// Size: 0x418 (Inherited: 0x318)
struct U*eb79fdee2a : U*477b63fdaa {
	char pad_318[0x10]; // 0x318(0x10)
	char bUseEmergingAnimation : 1; // 0x328(0x01)
	char bUseVanishingAnimation : 1; // 0x328(0x01)
	char pad_328_2 : 6; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct F*03af4cd0fb EmergingAnimationBinder; // 0x330(0x20)
	struct F*03af4cd0fb VanishingAnimationBinder; // 0x350(0x20)
	struct U*3335e92189* Emerging; // 0x370(0x08)
	struct U*3335e92189* Vanishing; // 0x378(0x08)
	char pad_380[0x18]; // 0x380(0x18)
	enum class ESlateVisibility *79ed7be120; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	float *2570feca19; // 0x39c(0x04)
	char pad_3A0[0x4]; // 0x3a0(0x04)
	int32 phase; // 0x3a4(0x04)
	int32 *3af3024d2e; // 0x3a8(0x04)
	bool bUseFakeCursor; // 0x3ac(0x01)
	char pad_3AD[0x3]; // 0x3ad(0x03)
	struct F*8e4dc0564e *bb44873097; // 0x3b0(0x28)
	struct F*6351b5e701 *ac638d2d0b; // 0x3d8(0x20)
	struct TArray<struct F*bae9cf052b> *c2643949dd; // 0x3f8(0x10)
	struct TArray<struct F*b085b6bd84> *59b9a91835; // 0x408(0x10)

	void CheckWantRequestRender(); // Function TslGame.*eb79fdee2a.CheckWantRequestRender // Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5908218
	void OnFakeCursorDown(); // Function TslGame.*eb79fdee2a.OnFakeCursorDown // Native|Protected // @ game+0x594fbcc
	void HandleMainPrepass(); // Function TslGame.*eb79fdee2a.HandleMainPrepass // Native|Public // @ game+0x5900a4
	void OnFakeCursorY(); // Function TslGame.*eb79fdee2a.OnFakeCursorY // Native|Protected // @ game+0x594fc98
	void SetFakeMouseMouseButtonDown(); // Function TslGame.*eb79fdee2a.SetFakeMouseMouseButtonDown // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x5953f98
	void OnFakeCursorUp(); // Function TslGame.*eb79fdee2a.OnFakeCursorUp // Native|Protected // @ game+0x594fbe4
	void RuntimeInitBP(); // Function TslGame.*eb79fdee2a.RuntimeInitBP // BlueprintCosmetic|Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void IsMouseOn(); // Function TslGame.*eb79fdee2a.IsMouseOn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594da30
	void SetFakeMouseMouseButtonUp(); // Function TslGame.*eb79fdee2a.SetFakeMouseMouseButtonUp // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x5954040
	void BindFakeCursor(); // Function TslGame.*eb79fdee2a.BindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x5944828
	void OnFakeCursorX(); // Function TslGame.*eb79fdee2a.OnFakeCursorX // Native|Protected // @ game+0x594fbfc
	void UnBindFakeCursor(); // Function TslGame.*eb79fdee2a.UnBindFakeCursor // Final|Native|Protected|BlueprintCallable // @ game+0x5956444
};

// Class TslGame.*c096fc50a0
// Size: 0x438 (Inherited: 0x418)
struct U*c096fc50a0 : U*eb79fdee2a {
	struct ATslCharacter* *50ba5e44aa; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)

	void *71a0919bf2(); // Function TslGame.*c096fc50a0.*71a0919bf2 // Final|Native|Protected // @ game+0x5a3f12c
	void OnUpdateViewTarget(); // Function TslGame.*c096fc50a0.OnUpdateViewTarget // Final|Native|Protected // @ game+0x770e48
	void OnMatchStarted(); // Function TslGame.*c096fc50a0.OnMatchStarted // Final|Native|Protected // @ game+0x5918c28
};

// Class TslGame.*b793ee570a
// Size: 0x460 (Inherited: 0x438)
struct U*b793ee570a : U*c096fc50a0 {
	struct UTslHpAndBoostGaugeHudWidget* HpAndBoostGaugeHudWidget; // 0x438(0x08)
	struct U*2bd579413d* CharacterStanceWidget; // 0x440(0x08)
	struct URetainerBox* CharacterStanceRetainerBoxWidget; // 0x448(0x08)
	struct U*0509217951* VolumeReducerIconWidget; // 0x450(0x08)
	struct U*76f831ff87* VoiceChatMicWidget; // 0x458(0x08)
};

// Class TslGame.*3ce5b91187
// Size: 0x460 (Inherited: 0x460)
struct U*3ce5b91187 : U*b793ee570a {
};

// Class TslGame.*4d4aa7b773
// Size: 0x4b0 (Inherited: 0x438)
struct U*4d4aa7b773 : U*c096fc50a0 {
	struct UImage* Hp_Image; // 0x438(0x08)
	struct UImage* HitImage; // 0x440(0x08)
	struct UTextBlock* Hp_Text; // 0x448(0x08)
	struct U*3335e92189* HitAnim; // 0x450(0x08)
	struct U*3335e92189* MyHitAnim; // 0x458(0x08)
	struct UStringTable* *9446af54af; // 0x460(0x08)
	int32 DecimalPlacesNum; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct U*49d671c8a8* LifeGaugeColorData; // 0x470(0x08)
	bool *9b13bdacef; // 0x478(0x01)
	char pad_479[0x37]; // 0x479(0x37)

	void OnInitChickenWidget(); // Function TslGame.*4d4aa7b773.OnInitChickenWidget // Final|Native|Public // @ game+0x59117e4
	void OnUpdateHP(); // Function TslGame.*4d4aa7b773.OnUpdateHP // Final|Native|Public // @ game+0x5916b90
	void *1efa4bf848(); // Function TslGame.*4d4aa7b773.*1efa4bf848 // Final|Native|Public // @ game+0x590c410
};

// Class TslGame.*e689349ce9
// Size: 0x498 (Inherited: 0x438)
struct U*e689349ce9 : U*c096fc50a0 {
	enum class EEquipSlotID EquipSlotID; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct UMaterial* EquipableIconMaterial; // 0x440(0x08)
	float *42fdba0ccc; // 0x448(0x04)
	float *524a2a8f97; // 0x44c(0x04)
	struct UImage* EquipableItemIconImage; // 0x450(0x08)
	struct UEquipableItem* *2dad977ac6; // 0x458(0x08)
	char pad_460[0x18]; // 0x460(0x18)
	struct AInventoryFacade* InventoryFacade; // 0x478(0x08)
	struct AEquipment* Equipment; // 0x480(0x08)
	char pad_488[0x10]; // 0x488(0x10)

	void OnUpdateIconGauge(); // Function TslGame.*e689349ce9.OnUpdateIconGauge // Final|Native|Protected // @ game+0xdd360c
	void OnUpdateIcon(); // Function TslGame.*e689349ce9.OnUpdateIcon // Final|Native|Protected // @ game+0xe0d268
	void OnUpdateEquipment(); // Function TslGame.*e689349ce9.OnUpdateEquipment // Final|Native|Protected // @ game+0x5916b68
};

// Class TslGame.*d96b823b54
// Size: 0x4a8 (Inherited: 0x498)
struct U*d96b823b54 : U*e689349ce9 {
	struct AInventory* Inventory; // 0x498(0x08)
	struct U*3335e92189* CapacityFullWarning; // 0x4a0(0x08)

	void OnUpdateSpaceGague(); // Function TslGame.*d96b823b54.OnUpdateSpaceGague // Final|Native|Protected|HasOutParms // @ game+0xd086a4
	void OnNoBagSpaceEvent(); // Function TslGame.*d96b823b54.OnNoBagSpaceEvent // Final|Native|Protected // @ game+0x5913780
};

// Class TslGame.*6ad1120237
// Size: 0x498 (Inherited: 0x498)
struct U*6ad1120237 : U*e689349ce9 {
};

// Class TslGame.TslHpAndBoostGaugeHudWidget
// Size: 0x460 (Inherited: 0x438)
struct UTslHpAndBoostGaugeHudWidget : U*c096fc50a0 {
	struct F*ed3419bf49 *a9590ed2c4; // 0x438(0x18)
	struct U*9004fde711* BoostGaugeWidget; // 0x450(0x08)
	struct U*d3862eb406* HpGaugeWidget; // 0x458(0x08)

	void OnReset(); // Function TslGame.TslHpAndBoostGaugeHudWidget.OnReset // Final|Native|Protected // @ game+0x5914d44
};

// Class TslGame.*d3862eb406
// Size: 0x588 (Inherited: 0x438)
struct U*d3862eb406 : U*c096fc50a0 {
	struct U*49d671c8a8* LifeGaugeColorData; // 0x438(0x08)
	struct TMap<int32, struct FLinearColor> *d8ce810ac4; // 0x440(0x50)
	char pad_490[0x8]; // 0x490(0x08)
	struct UImage* HpBar; // 0x498(0x08)
	struct UProgressBar* BluezoneBlocker_ProgressBar; // 0x4a0(0x08)
	struct UOverlay* EffectLayerBinder; // 0x4a8(0x08)
	struct UBorder* InnerBg; // 0x4b0(0x08)
	struct UWidgetSwitcher* HpBgSwitcher; // 0x4b8(0x08)
	struct UTextBlock* HpText; // 0x4c0(0x08)
	struct UTextBlock* MaxHpText; // 0x4c8(0x08)
	struct U*3335e92189* Warning; // 0x4d0(0x08)
	struct U*3335e92189* ZombieVirus; // 0x4d8(0x08)
	struct U*3335e92189* ZombieDBNO; // 0x4e0(0x08)
	bool bUseEffect; // 0x4e8(0x01)
	char pad_4E9[0x7]; // 0x4e9(0x07)
	struct UClass* DamageEffectClass; // 0x4f0(0x08)
	struct UClass* HealEffectClass; // 0x4f8(0x08)
	struct UClass* HealAmountEffectClass; // 0x500(0x08)
	int32 DamageEffectMax; // 0x508(0x04)
	int32 HealEffectMax; // 0x50c(0x04)
	bool *ad532c6146; // 0x510(0x01)
	bool *9b13bdacef; // 0x511(0x01)
	char pad_512[0x2]; // 0x512(0x02)
	struct FLinearColor *4c185b2dcb; // 0x514(0x10)
	struct FLinearColor *ffbb8b96c4; // 0x524(0x10)
	char pad_534[0x14]; // 0x534(0x14)
	struct U*0afeb6c687* *d2e79b9fbf; // 0x548(0x08)
	struct TArray<struct U*0afeb6c687*> *c3b9ca8233; // 0x550(0x10)
	struct TArray<struct U*0afeb6c687*> *bf9fef1452; // 0x560(0x10)
	char pad_570[0x18]; // 0x570(0x18)

	void OnDestoryHealEffect(); // Function TslGame.*d3862eb406.OnDestoryHealEffect // Final|Native|Protected // @ game+0x59104b0
	void OnDestoryDamageEffect(); // Function TslGame.*d3862eb406.OnDestoryDamageEffect // Final|Native|Protected // @ game+0xbe5594
	void OnUpdateHP(); // Function TslGame.*d3862eb406.OnUpdateHP // Final|Native|Protected // @ game+0x99f348
	void OnCharacterDeath(); // Function TslGame.*d3862eb406.OnCharacterDeath // Final|Native|Protected // @ game+0x99fbf8
	void *157e5a5f8f(); // Function TslGame.*d3862eb406.*157e5a5f8f // Final|Native|Protected // @ game+0x5915088
	void OnUsingCastObject(); // Function TslGame.*d3862eb406.OnUsingCastObject // Final|Native|Protected // @ game+0x99e328
};

// Class TslGame.*0509217951
// Size: 0x448 (Inherited: 0x438)
struct U*0509217951 : U*c096fc50a0 {
	struct UImage* VolumeDuckingImage; // 0x438(0x08)
	struct UInvalidationBox* VolumeDuckingInvalidationBox; // 0x440(0x08)

	void UpdateDuckingState(); // Function TslGame.*0509217951.UpdateDuckingState // Final|Native|Public // @ game+0x59215c8
};

// Class TslGame.*5ed89846fa
// Size: 0x4d0 (Inherited: 0x438)
struct U*5ed89846fa : U*c096fc50a0 {
	struct U*3335e92189* Timer_FadeIn; // 0x438(0x08)
	struct U*3335e92189* Timer_FadeOut; // 0x440(0x08)
	struct U*3335e92189* Notification_FadeIn; // 0x448(0x08)
	struct U*3335e92189* Notification_FadeOut; // 0x450(0x08)
	struct U*3335e92189* Message_FadeIn; // 0x458(0x08)
	struct U*3335e92189* Message_FadeOut; // 0x460(0x08)
	struct U*3335e92189* Message_Active; // 0x468(0x08)
	struct U*3335e92189* Top5_FadeIn; // 0x470(0x08)
	struct U*3335e92189* Top5_FadeOut; // 0x478(0x08)
	struct UUserWidget* SignalNotificationWidget; // 0x480(0x08)
	struct U*5aae53c4da* SignalTop5NotificationWidget; // 0x488(0x08)
	struct U*6810bce8f5* SignalTimerWidget; // 0x490(0x08)
	struct UImage* Top5GlowImage; // 0x498(0x08)
	struct UOverlay* SignalMessageParticleOverlay; // 0x4a0(0x08)
	struct UTextBlock* SignalMessageText; // 0x4a8(0x08)
	struct UTextBlock* Top5MessageText; // 0x4b0(0x08)
	int32 CPPResultShowTime; // 0x4b8(0x04)
	bool *642c6fd315; // 0x4bc(0x01)
	char pad_4BD[0x3]; // 0x4bd(0x03)
	float *691f0a1e02; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct F*b2f5f3e08e *a7b95af7ec; // 0x4c8(0x08)

	void OnUpdateGroggy(); // Function TslGame.*5ed89846fa.OnUpdateGroggy // Final|Native|Protected // @ game+0x5916b7c
	void OnUpdateSignalZone(); // Function TslGame.*5ed89846fa.OnUpdateSignalZone // Final|Native|Protected // @ game+0x5916f24
	void OnNotifyCPPWinResult(); // Function TslGame.*5ed89846fa.OnNotifyCPPWinResult // Final|Native|Protected // @ game+0x5913794
	void OnPlayMessageActiveAnimation(); // Function TslGame.*5ed89846fa.OnPlayMessageActiveAnimation // Final|Native|Private // @ game+0x59140e8
	void *419c731c24(); // Function TslGame.*5ed89846fa.*419c731c24 // Final|Native|Private // @ game+0x590c290
	void OnNotifyCPPWinShow(); // Function TslGame.*5ed89846fa.OnNotifyCPPWinShow // Final|Native|Protected // @ game+0x5913828
};

// Class TslGame.*859cde2232
// Size: 0x4a0 (Inherited: 0x438)
struct U*859cde2232 : U*c096fc50a0 {
	struct UImage* SignalGaugeBarImage; // 0x438(0x08)
	struct UOverlay* EffectLayerBinder; // 0x440(0x08)
	struct UClass* DecreaseSignalEffectClass; // 0x448(0x08)
	struct UClass* IncreaseSignalEffectClass; // 0x450(0x08)
	struct UClass* SignalAmountEffectClass; // 0x458(0x08)
	int32 DecreaseSignalEffectMax; // 0x460(0x04)
	int32 IncreaseSignalEffectMax; // 0x464(0x04)
	struct U*ce9ec5c2d7* *b947a2da04; // 0x468(0x08)
	struct TArray<struct U*ce9ec5c2d7*> *320c9a1808; // 0x470(0x10)
	struct TArray<struct U*ce9ec5c2d7*> *59e2a74c78; // 0x480(0x10)
	float SignalAmount; // 0x490(0x04)
	float Signal; // 0x494(0x04)
	float *db34ff6e49; // 0x498(0x04)
	float *d5d3292b69; // 0x49c(0x04)

	void OnUpdateSignal(); // Function TslGame.*859cde2232.OnUpdateSignal // Final|Native|Protected|BlueprintCallable // @ game+0x5916f10
	void *5fb911661b(); // Function TslGame.*859cde2232.*5fb911661b // Final|Native|Protected // @ game+0x5921d50
	void OnUsingCastObject(); // Function TslGame.*859cde2232.OnUsingCastObject // Final|Native|Protected // @ game+0x591727c
	void *b7e55ac873(); // Function TslGame.*859cde2232.*b7e55ac873 // Final|Native|Protected // @ game+0x59103d8
	void *6831110346(); // Function TslGame.*859cde2232.*6831110346 // Final|Native|Protected // @ game+0x590b4c4
	void OnDestoryIncreaseEffect(); // Function TslGame.*859cde2232.OnDestoryIncreaseEffect // Final|Native|Protected // @ game+0x5910540
	void OnDestoryDecreaseEffect(); // Function TslGame.*859cde2232.OnDestoryDecreaseEffect // Final|Native|Protected // @ game+0x5910414
	void UpdateWidget(); // Function TslGame.*859cde2232.UpdateWidget // Final|Native|Protected // @ game+0x5921708
	void UpdateGauge(); // Function TslGame.*859cde2232.UpdateGauge // Final|Native|Protected // @ game+0x5921708
	void *e41eeac8e1(); // Function TslGame.*859cde2232.*e41eeac8e1 // Final|Native|Protected // @ game+0x59117d0
};

// Class TslGame.*6810bce8f5
// Size: 0x458 (Inherited: 0x438)
struct U*6810bce8f5 : U*c096fc50a0 {
	struct UImage* SignalGaugeImage; // 0x438(0x08)
	struct UTextBlock* SignalCounterText; // 0x440(0x08)
	int32 Countdown; // 0x448(0x04)
	int32 *0572f6fa49; // 0x44c(0x04)
	struct F*b2f5f3e08e *cb3e790476; // 0x450(0x08)

	void *206f8410d1(); // Function TslGame.*6810bce8f5.*206f8410d1 // Final|Native|Private // @ game+0x590a77c
	void *40ee82081e(); // Function TslGame.*6810bce8f5.*40ee82081e // Final|Native|Public // @ game+0x590cdd4
	void UpdateWidget(); // Function TslGame.*6810bce8f5.UpdateWidget // Final|Native|Private // @ game+0x590a77c
	void *1c5dee5d7f(); // Function TslGame.*6810bce8f5.*1c5dee5d7f // Final|Native|Public // @ game+0x590b978
};

// Class TslGame.*f0c8021ef1
// Size: 0x518 (Inherited: 0x438)
struct U*f0c8021ef1 : U*c096fc50a0 {
	struct U*4644aa7e52* StageInfoWidget; // 0x438(0x08)
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x440(0x08)
	struct U*75a405b0fd* TutorialMissionListWidget; // 0x448(0x08)
	struct UTextBlock* TextKillBind; // 0x450(0x08)
	struct U*e5a715f983* HungerGaugeWidget; // 0x458(0x08)
	struct U*19a8839134* AdditionalIcon; // 0x460(0x08)
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x468(0x08)
	struct U*2a65f5fa67* KeyHintPcIconCrafting; // 0x470(0x08)
	struct U*2a65f5fa67* KeyHintPcIconScoreBoard; // 0x478(0x08)
	struct U*2a65f5fa67* KeyHintPcIconRules; // 0x480(0x08)
	struct F*7e7e97b5c1 *6c7d36fcf3; // 0x488(0x20)
	struct F*7e7e97b5c1 *1682d1d4ac; // 0x4a8(0x20)
	struct FText *677c284fa3; // 0x4c8(0x18)
	struct UClass* *2cbbc6ac38; // 0x4e0(0x08)
	struct ATslSLBPlayerState* *6651f67abc; // 0x4e8(0x08)
	struct U*d91cd0745b* *ff911cb1be; // 0x4f0(0x08)
	char pad_4F8[0x20]; // 0x4f8(0x20)

	void OnReset(); // Function TslGame.*f0c8021ef1.OnReset // Final|Native|Protected // @ game+0x5914d44
	void OnChangeMissionCount(); // Function TslGame.*f0c8021ef1.OnChangeMissionCount // Final|Native|Protected // @ game+0x590f8e8
	void *72ea720cd3(); // Function TslGame.*f0c8021ef1.*72ea720cd3 // Final|Native|Protected // @ game+0x5916e80
	void *8e86160b62(); // Function TslGame.*f0c8021ef1.*8e86160b62 // Final|Native|Protected // @ game+0x5911e9c
	void *bfb63350cf(); // Function TslGame.*f0c8021ef1.*bfb63350cf // Final|Native|Protected // @ game+0x5911f2c
	void *211834dcff(); // Function TslGame.*f0c8021ef1.*211834dcff // Final|Native|Protected // @ game+0x59150cc
	void *1e37a42156(); // Function TslGame.*f0c8021ef1.*1e37a42156 // Final|Native|Protected // @ game+0x59212f8
	void OnSLBModeMonsterAttacked(); // Function TslGame.*f0c8021ef1.OnSLBModeMonsterAttacked // Final|Native|Protected // @ game+0x591515c
	void OnGameUserSettingApplied(); // Function TslGame.*f0c8021ef1.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x5911218
	void *0fa0253d22(); // Function TslGame.*f0c8021ef1.*0fa0253d22 // Final|Native|Protected // @ game+0x591836c
	void UpdateOpenLastGateMission(); // Function TslGame.*f0c8021ef1.UpdateOpenLastGateMission // Final|Native|Protected // @ game+0x5921b4c
};

// Class TslGame.*e5a715f983
// Size: 0x4c0 (Inherited: 0x438)
struct U*e5a715f983 : U*c096fc50a0 {
	char pad_438[0x8]; // 0x438(0x08)
	struct FVector4 SplitPoint; // 0x440(0x10)
	struct UImage* ImageIcon; // 0x450(0x08)
	struct UOverlay* PanelGauge; // 0x458(0x08)
	struct UImage* ImageGauge; // 0x460(0x08)
	struct UMaterialInstanceDynamic* *1c5acb27ce; // 0x468(0x08)
	struct UMaterialInstanceDynamic* *1ce0241583; // 0x470(0x08)
	char pad_478[0x48]; // 0x478(0x48)

	void *cadbb6552a(); // Function TslGame.*e5a715f983.*cadbb6552a // Final|Native|Protected // @ game+0x59081f0
	void *4a11374067(); // Function TslGame.*e5a715f983.*4a11374067 // Final|Native|Protected // @ game+0x590f808
};

// Class TslGame.*76f831ff87
// Size: 0x440 (Inherited: 0x438)
struct U*76f831ff87 : U*c096fc50a0 {
	struct UImage* MicIcon; // 0x438(0x08)

	void OnSetCurrVoiceInputMode(); // Function TslGame.*76f831ff87.OnSetCurrVoiceInputMode // Final|Native|Protected // @ game+0x5915564
	void OnMuteVoiceFromMe(); // Function TslGame.*76f831ff87.OnMuteVoiceFromMe // Final|Native|Protected // @ game+0x5913094
};

// Class TslGame.*501a0f809e
// Size: 0x468 (Inherited: 0x438)
struct U*501a0f809e : U*c096fc50a0 {
	struct UTslWeaponHudWidget* WeaponHudWidget; // 0x438(0x08)
	struct UWidgetSwitcher* WeaponIconSwitcherWidget; // 0x440(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x448(0x08)
	float *b49d2fc2fd; // 0x450(0x04)
	float *d46b1f2f5c; // 0x454(0x04)
	float *652196a1dd; // 0x458(0x04)
	float *11dc2ed996; // 0x45c(0x04)
	char pad_460[0x8]; // 0x460(0x08)

	void OnReset(); // Function TslGame.*501a0f809e.OnReset // Final|Native|Protected // @ game+0x5914d44
};

// Class TslGame.TslWeaponHudWidget
// Size: 0x458 (Inherited: 0x438)
struct UTslWeaponHudWidget : U*c096fc50a0 {
	struct UBackgroundBlur* WeaponHudBackgroundBlur; // 0x438(0x08)
	struct UBorder* WeaponHudBorder; // 0x440(0x08)
	struct USizeBox* BreathIconSizeBox; // 0x448(0x08)
	float *d917e2ea08; // 0x450(0x04)
	float *e858bc46fa; // 0x454(0x04)
};

// Class TslGame.*2e304fa25e
// Size: 0x488 (Inherited: 0x438)
struct U*2e304fa25e : U*c096fc50a0 {
	struct FLinearColor *39700c77f4; // 0x438(0x10)
	struct FLinearColor *4b7031fb1b; // 0x448(0x10)
	struct FLinearColor *34e410cf74; // 0x458(0x10)
	float *e89de9ffbc; // 0x468(0x04)
	char pad_46C[0x14]; // 0x46c(0x14)
	struct AEquipment* *b69c56ace1; // 0x480(0x08)

	void OnChangedWeapon(); // Function TslGame.*2e304fa25e.OnChangedWeapon // Final|Native|Protected // @ game+0x590f934
	void OnUpdateWeapon(); // Function TslGame.*2e304fa25e.OnUpdateWeapon // Final|Native|Protected // @ game+0x9ff6c0
};

// Class TslGame.*496cd902dd
// Size: 0x4a8 (Inherited: 0x488)
struct U*496cd902dd : U*2e304fa25e {
	struct UImage* DoubleBarrelLeft; // 0x488(0x08)
	struct UImage* DoubleBarrelRight; // 0x490(0x08)
	struct UTexture2D* *5b481c0848; // 0x498(0x08)
	struct UTexture2D* *bdc8d932ab; // 0x4a0(0x08)
};

// Class TslGame.*7a26f613d3
// Size: 0x550 (Inherited: 0x488)
struct U*7a26f613d3 : U*2e304fa25e {
	struct UWidgetSwitcher* CurrentFiremodeSwitcher; // 0x488(0x08)
	struct UWidgetSwitcher* NextFiremodeSwitcher; // 0x490(0x08)
	struct UBorder* NextFiremodeBorder; // 0x498(0x08)
	struct U*3335e92189* FiremodeIconChange; // 0x4a0(0x08)
	struct F*2c3de5c408 *a8e73fe9d6; // 0x4a8(0x50)
	struct TMap<struct FName, struct F*2c3de5c408> *2e6d333ac2; // 0x4f8(0x50)
	char pad_548[0x8]; // 0x548(0x08)
};

// Class TslGame.*c7519171ba
// Size: 0x4c8 (Inherited: 0x488)
struct U*c7519171ba : U*2e304fa25e {
	struct UTextBlock* CurrentWeaponLoadedAmmoText; // 0x488(0x08)
	struct UTextBlock* NextWeaponLoadedAmmoText; // 0x490(0x08)
	struct U*3335e92189* LoadedAmmoDecreasing; // 0x498(0x08)
	struct U*3335e92189* LoadedAmmoIncreasing; // 0x4a0(0x08)
	struct F*6a15aeee08 *dc7b844eb6; // 0x4a8(0x10)
	char pad_4B8[0x8]; // 0x4b8(0x08)
	struct ATslWeapon_Gun* *f91836eeeb; // 0x4c0(0x08)

	void OnGameUserSettingApplied(); // Function TslGame.*c7519171ba.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x591122c
	void OnUpdatedInventory(); // Function TslGame.*c7519171ba.OnUpdatedInventory // Final|Native|Protected|HasOutParms // @ game+0xa01b00
};

// Class TslGame.*bc1418099f
// Size: 0x4d0 (Inherited: 0x488)
struct U*bc1418099f : U*2e304fa25e {
	struct UTextBlock* CurrentWeaponReserveAmmoText; // 0x488(0x08)
	struct UTextBlock* NextWeaponReserveAmmoText; // 0x490(0x08)
	struct UWidgetSwitcher* SwitcherNext; // 0x498(0x08)
	struct UWidgetSwitcher* SwitcherCurrent; // 0x4a0(0x08)
	struct U*3335e92189* ReserveAmmoDecreasing; // 0x4a8(0x08)
	struct U*3335e92189* ReserveAmmoIncreasing; // 0x4b0(0x08)
	struct F*6a15aeee08 *dc7b844eb6; // 0x4b8(0x10)
	char pad_4C8[0x8]; // 0x4c8(0x08)
};

// Class TslGame.*0185a3621d
// Size: 0x510 (Inherited: 0x488)
struct U*0185a3621d : U*2e304fa25e {
	struct UBorder* BorderHealmodeBind; // 0x488(0x08)
	struct UWidgetSwitcher* SwitcherHealmodeBind; // 0x490(0x08)
	struct UTextBlock* TextHealItemCountBind; // 0x498(0x08)
	struct U*3335e92189* AnimIconChangeBind; // 0x4a0(0x08)
	struct F*26bc02150b *548d2cd6a4; // 0x4a8(0x50)
	struct F*6a15aeee08 *dc7b844eb6; // 0x4f8(0x10)
	char pad_508[0x8]; // 0x508(0x08)

	void OnUpdateInventoryItem(); // Function TslGame.*0185a3621d.OnUpdateInventoryItem // Final|Native|Protected|HasOutParms // @ game+0xd40748
};

// Class TslGame.*84a85f0ae3
// Size: 0x490 (Inherited: 0x418)
struct U*84a85f0ae3 : U*eb79fdee2a {
	struct UBorder* FrameBorder; // 0x418(0x08)
	struct UImage* ItemImage; // 0x420(0x08)
	struct UTextBlock* ItemCountText; // 0x428(0x08)
	struct UItem* *48f9888583; // 0x430(0x08)
	struct UItem* *5fad357274; // 0x438(0x08)
	struct FName IconTextureParamName; // 0x440(0x08)
	struct FName BlinkFrameParamName; // 0x448(0x08)
	struct UCurveFloat* BlinkCurve; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)
	struct UTexture* *43009a338c; // 0x460(0x20)
	char pad_480[0x10]; // 0x480(0x10)

	void GetCachedItem(); // Function TslGame.*84a85f0ae3.GetCachedItem // Final|Native|Public|BlueprintCallable // @ game+0x590aa98
};

// Class TslGame.*97a3f7fd58
// Size: 0x4a8 (Inherited: 0x418)
struct U*97a3f7fd58 : U*eb79fdee2a {
	struct TArray<struct F*6351b5e701> Slots; // 0x418(0x10)
	struct TMap<struct FName, struct F*4f2a86e400> *1ac7b624ff; // 0x428(0x50)
	struct UDataTable* *225e13f5f0; // 0x478(0x20)
	char pad_498[0x10]; // 0x498(0x10)

	void LoadDataTable(); // Function TslGame.*97a3f7fd58.LoadDataTable // Final|Native|Private // @ game+0x590cde8
	void OnInventoryUpdated(); // Function TslGame.*97a3f7fd58.OnInventoryUpdated // Final|Native|Protected // @ game+0x59118e8
};

// Class TslGame.*941d8dd642
// Size: 0x458 (Inherited: 0x418)
struct U*941d8dd642 : U*eb79fdee2a {
	struct UInvalidationBox* CachedInvalidationBox; // 0x418(0x08)
	int32 IconIndex; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct UMaterialInterface* MI_ProgressBar; // 0x428(0x08)
	struct FName ProgressBarMaterialParam; // 0x430(0x08)
	struct UMaterialInstanceDynamic* *ece5a5b42d; // 0x438(0x08)
	char pad_440[0x8]; // 0x440(0x08)
	struct FName *82a00bce6b; // 0x448(0x08)
	bool bHideCountText; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class TslGame.*b20d46b5ab
// Size: 0x570 (Inherited: 0x458)
struct U*b20d46b5ab : U*941d8dd642 {
	struct UImage* SkillIconImage; // 0x458(0x08)
	struct UImage* SkillProgressBar_Image; // 0x460(0x08)
	struct UTextBlock* SkillCountText; // 0x468(0x08)
	struct UTextBlock* SkillIndexText; // 0x470(0x08)
	struct UBorder* SkillIcon_Border; // 0x478(0x08)
	struct UGridPanel* SkillCountGridPanel; // 0x480(0x08)
	struct U*975c51dc1d* GamepadKeyIcon; // 0x488(0x08)
	struct FLinearColor SkillIconImage_ActivatedColor; // 0x490(0x10)
	struct FLinearColor SkillIconImage_DeactivatedColor; // 0x4a0(0x10)
	struct FLinearColor SkillIconBorder_ActivatedColor; // 0x4b0(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedColor; // 0x4c0(0x10)
	struct FLinearColor SkillIconBorder_ActivatedBrushColor; // 0x4d0(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedBrushColor; // 0x4e0(0x10)
	struct FSlateColor SkillCountText_ActivatedColor; // 0x4f0(0x28)
	struct FSlateColor SkillCountText_DeactivatedColor; // 0x518(0x28)
	char pad_540[0x30]; // 0x540(0x30)

	void OnUpdateIconColor(); // Function TslGame.*b20d46b5ab.OnUpdateIconColor // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*117783bba4
// Size: 0x568 (Inherited: 0x458)
struct U*117783bba4 : U*941d8dd642 {
	struct UImage* SkillIconImage; // 0x458(0x08)
	struct UImage* SkillProgressBar_Image; // 0x460(0x08)
	struct UTextBlock* SkillCountText; // 0x468(0x08)
	struct UTextBlock* SkillIndexText; // 0x470(0x08)
	struct UBorder* SkillIcon_Border; // 0x478(0x08)
	struct U*975c51dc1d* GamepadKeyIcon; // 0x480(0x08)
	struct FLinearColor SkillIconImage_ActivatedColor; // 0x488(0x10)
	struct FLinearColor SkillIconImage_DeactivatedColor; // 0x498(0x10)
	struct FLinearColor SkillIconBorder_ActivatedColor; // 0x4a8(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedColor; // 0x4b8(0x10)
	struct FLinearColor SkillIconBorder_ActivatedBrushColor; // 0x4c8(0x10)
	struct FLinearColor SkillIconBorder_DeactivatedBrushColor; // 0x4d8(0x10)
	struct FSlateColor SkillCountText_ActivatedColor; // 0x4e8(0x28)
	struct FSlateColor SkillCountText_DeactivatedColor; // 0x510(0x28)
	char pad_538[0x30]; // 0x538(0x30)

	void OnUpdateIconColor(); // Function TslGame.*117783bba4.OnUpdateIconColor // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*281028027e
// Size: 0x520 (Inherited: 0x418)
struct U*281028027e : U*eb79fdee2a {
	struct UHorizontalBox* IconHorizontalBox; // 0x418(0x08)
	struct USpacer* IconSpacer; // 0x420(0x08)
	struct U*07b4f93ab9* BuffIconDataAsset; // 0x428(0x08)
	struct FStringClassReference SpawnKitClass; // 0x430(0x10)
	struct TArray<struct U*941d8dd642*> *829598a379; // 0x440(0x10)
	struct U*941d8dd642* *0b58b3146f; // 0x450(0x08)
	struct USpawnKit* SpawnKit; // 0x458(0x08)
	struct TArray<struct F*971f7222f0> *971f7222f0; // 0x460(0x10)
	struct F*66a4bdc3fc *ee577bc9a3; // 0x470(0x68)
	enum class EFBRClass *e9607f42c4; // 0x4d8(0x01)
	char pad_4D9[0x7]; // 0x4d9(0x07)
	struct TArray<struct U*eb79fdee2a*> *3825db35f4; // 0x4e0(0x10)
	char pad_4F0[0x10]; // 0x4f0(0x10)
	bool bCollapseEmptyIconWidget; // 0x500(0x01)
	char pad_501[0x1f]; // 0x501(0x1f)

	void OnMatchStateChanged(); // Function TslGame.*281028027e.OnMatchStateChanged // Final|Native|Protected // @ game+0x59124c0
	void OnSelectableSpawnKit(); // Function TslGame.*281028027e.OnSelectableSpawnKit // Final|Native|Protected // @ game+0x5915370
	void OnUpdateSpawnKit(); // Function TslGame.*281028027e.OnUpdateSpawnKit // Final|Native|Protected // @ game+0x5916f38
	void OnWeaponArmed(); // Function TslGame.*281028027e.OnWeaponArmed // Final|Native|Protected // @ game+0x5917b70
	void OnWeaponUnArmed(); // Function TslGame.*281028027e.OnWeaponUnArmed // Final|Native|Protected // @ game+0x5917bc0
	void OnUpdateViewTarget(); // Function TslGame.*281028027e.OnUpdateViewTarget // Final|Native|Protected // @ game+0x5917018
	void OnUpdateViewTargetSpawnKit(); // Function TslGame.*281028027e.OnUpdateViewTargetSpawnKit // Final|Native|Protected // @ game+0x59171c4
};

// Class TslGame.TslWeapon
// Size: 0xa70 (Inherited: 0x3f8)
struct ATslWeapon : AActor {
	char pad_3F8[0x38]; // 0x3f8(0x38)
	struct UTexture* WeaponIcon; // 0x430(0x08)
	float WeaponIconRatio; // 0x438(0x04)
	int32 LogWeaponFirePerFireCount; // 0x43c(0x04)
	struct TArray<struct FName> *9cf5db4143; // 0x440(0x10)
	struct TArray<struct F*e7a62cd871> *77ce26ba71; // 0x450(0x10)
	bool *21474e31c1; // 0x460(0x01)
	char pad_461[0x27]; // 0x461(0x27)
	struct FMulticastDelegate OnUpdatedAttachment; // 0x488(0x10)
	struct FMulticastDelegate OnUpdatedSkinData; // 0x498(0x10)
	struct FMulticastDelegate OnUpdatedMasteryItem; // 0x4a8(0x10)
	struct FMulticastDelegate OnUpdatedAttachmentOnServer; // 0x4b8(0x10)
	struct FMulticastDelegate OnUpdatedCharacterEvent; // 0x4c8(0x10)
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct F*aa6eed4343 WeaponConfig; // 0x4e0(0x2b0)
	enum class EWeaponHand *bd87a451c0; // 0x790(0x01)
	char pad_791[0x7]; // 0x791(0x07)
	struct TArray<enum class EWeaponClass> *50f4d82887; // 0x798(0x10)
	bool *4745c62df3; // 0x7a8(0x01)
	bool *5c31745d70; // 0x7a9(0x01)
	char pad_7AA[0x6]; // 0x7aa(0x06)
	struct U*fd901ab3b7* *b65f59b724; // 0x7b0(0x08)
	struct USceneComponent* RootScene; // 0x7b8(0x08)
	int8 *a38695bd55; // 0x7c0(0x01)
	char pad_7C1[0x1]; // 0x7c1(0x01)
	enum class EAttachmentCalculateType *d30dc6e513; // 0x7c2(0x01)
	char pad_7C3[0x5]; // 0x7c3(0x05)
	struct TArray<struct F*864e650453> *85d438273a; // 0x7c8(0x10)
	struct TArray<struct F*5f2a4acf67> *66ac709d22; // 0x7d8(0x10)
	struct TArray<int32> *22bc69b994; // 0x7e8(0x10)
	struct TArray<struct U*77f16baaa5*> *93c088414d; // 0x7f8(0x10)
	struct FName *c5a1d5561f; // 0x808(0x08)
	int32 *8e549d748b; // 0x810(0x04)
	char pad_814[0x4]; // 0x814(0x04)
	struct FText ItemName; // 0x818(0x18)
	enum class EAccessorySlot *203375ec47; // 0x830(0x01)
	enum class EAllowedThrowMode *46c8070c0d; // 0x831(0x01)
	char pad_832[0x6]; // 0x832(0x06)
	struct UAkComponent* AkComponent; // 0x838(0x08)
	char pad_840[0x8]; // 0x840(0x08)
	struct FName *e95cb01404; // 0x848(0x08)
	struct FName *0c45e46359; // 0x850(0x08)
	struct UParticleSystem* *ecd994cb7e; // 0x858(0x08)
	struct FName *89ed696ed3; // 0x860(0x08)
	struct UClass* *b23fdf85dc; // 0x868(0x08)
	struct UParticleSystemComponent* *76636c4812; // 0x870(0x08)
	struct UParticleSystemComponent* *a9350ab9f0; // 0x878(0x08)
	struct UForceFeedbackEffect* *009d6a071d; // 0x880(0x08)
	enum class EAnimWeaponType *260ea1b96d; // 0x888(0x01)
	char pad_889[0x7]; // 0x889(0x07)
	struct F*b050c2aeb4 *d1f33c670f; // 0x890(0x18)
	struct F*c95f961a31 *7917586ba0; // 0x8a8(0x10)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *855441cf43; // 0x8b8(0x50)
	struct TMap<enum class EAccessorySlot, struct FAnimMontageData> *f8727ee67b; // 0x908(0x50)
	float *d9570279c6; // 0x958(0x04)
	bool *25bc6865fc; // 0x95c(0x01)
	char pad_95D[0x3]; // 0x95d(0x03)
	char *dc4ef12537 : 1; // 0x960(0x01)
	char pad_960_1 : 7; // 0x960(0x01)
	char pad_961[0x2f]; // 0x961(0x2f)
	bool *0317946803; // 0x990(0x01)
	bool *e67e75a35a; // 0x991(0x01)
	bool *c7686610ea; // 0x992(0x01)
	char pad_993[0x1d]; // 0x993(0x1d)
	struct F*dad71c8c98 *dad71c8c98; // 0x9b0(0x20)
	struct F*58be30f0f2 *58be30f0f2; // 0x9d0(0x04)
	struct F*58be30f0f2 *b360ab63df; // 0x9d4(0x04)
	struct FName WeaponMeshName; // 0x9d8(0x08)
	struct U*6c8ea2d2c5* *6c8ea2d2c5; // 0x9e0(0x08)
	char pad_9E8[0x18]; // 0x9e8(0x18)
	struct UMeshComponent* *0e3674d1bb; // 0xa00(0x08)
	bool *0007577586; // 0xa08(0x01)
	char pad_A09[0x67]; // 0xa09(0x67)

	void *a89102d3bb(); // Function TslGame.TslWeapon.*a89102d3bb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c004
	void *2945119f1b(); // Function TslGame.TslWeapon.*2945119f1b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949ac8
	void OnAttachmentChanged(); // Function TslGame.TslWeapon.OnAttachmentChanged // Final|Native|Public // @ game+0x594fb44
	void *ad9a6f6410(); // Function TslGame.TslWeapon.*ad9a6f6410 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594bf04
	void OnRep_ReplicatedSkinParam(); // Function TslGame.TslWeapon.OnRep_ReplicatedSkinParam // Final|Native|Private // @ game+0x5950488
	void *9c92045362(); // Function TslGame.TslWeapon.*9c92045362 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c184
	void *1f9bf00468(); // Function TslGame.TslWeapon.*1f9bf00468 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c228
	void *b13390fac0(); // Function TslGame.TslWeapon.*b13390fac0 // Final|Native|Public|BlueprintCallable // @ game+0x5956ab8
	void *4fe8686d15(); // Function TslGame.TslWeapon.*4fe8686d15 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc0f18c
	void *713d05afc3(); // Function TslGame.TslWeapon.*713d05afc3 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x594fa58
	void *fa105c1d1d(); // Function TslGame.TslWeapon.*fa105c1d1d // Final|Native|Private // @ game+0x595688c
	void *be845f6247(); // Function TslGame.TslWeapon.*be845f6247 // Native|Public|HasDefaults|BlueprintCallable // @ game+0x59443e0
	void OnRep_ReplicatedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedMasteryItem // Final|Native|Private // @ game+0x5950408
	void *7efc705c03(); // Function TslGame.TslWeapon.*7efc705c03 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594bf5c
	void *5392f7c75f(); // Function TslGame.TslWeapon.*5392f7c75f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594be18
	void *c905723cde(); // Function TslGame.TslWeapon.*c905723cde // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c2ec
	void *5618acf64f(); // Function TslGame.TslWeapon.*5618acf64f // Final|Native|Protected|HasOutParms|HasDefaults // @ game+0x5954ff8
	void *d775536e69(); // Function TslGame.TslWeapon.*d775536e69 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5948a50
	void *7bc94dddff(); // Function TslGame.TslWeapon.*7bc94dddff // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5947908
	void *cd273919d5(); // Function TslGame.TslWeapon.*cd273919d5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcfc974
	void *155f763fa9(); // Function TslGame.TslWeapon.*155f763fa9 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59476e0
	void Weapon_AttachShoulder(); // Function TslGame.TslWeapon.Weapon_AttachShoulder // Final|Native|Public|BlueprintCallable // @ game+0x5956acc
	void *69fd9937e5(); // Function TslGame.TslWeapon.*69fd9937e5 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594a55c
	void *e8d75821a6(); // Function TslGame.TslWeapon.*e8d75821a6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c168
	void *b82dc5ebb8(); // Function TslGame.TslWeapon.*b82dc5ebb8 // Final|Native|Public|Const // @ game+0x592d2b4
	void *b03da5672f(); // Function TslGame.TslWeapon.*b03da5672f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c19c
	void *5897daed1f(); // Function TslGame.TslWeapon.*5897daed1f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594afd4
	void *da6a378538(); // Function TslGame.TslWeapon.*da6a378538 // Final|Native|Public|BlueprintCallable // @ game+0x59566c0
	void OnLoadedAttachmentAssetDatas(); // Function TslGame.TslWeapon.OnLoadedAttachmentAssetDatas // Native|Public|HasOutParms // @ game+0x501cd8
	void *0448f78e7e(); // Function TslGame.TslWeapon.*0448f78e7e // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594ae28
	void *fe00df4778(); // Function TslGame.TslWeapon.*fe00df4778 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5947d18
	void *040e0c40ce(); // Function TslGame.TslWeapon.*040e0c40ce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x5944484
	void *32bf76dbf8(); // Function TslGame.TslWeapon.*32bf76dbf8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5947734
	void *fb78c3d10d(); // Function TslGame.TslWeapon.*fb78c3d10d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594be30
	void *f684547eec(); // Function TslGame.TslWeapon.*f684547eec // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594bdf0
	void *a3d4a9be91(); // Function TslGame.TslWeapon.*a3d4a9be91 // Final|Native|Public|BlueprintCallable // @ game+0x5947d00
	void *9d1e587563(); // Function TslGame.TslWeapon.*9d1e587563 // Native|Public|BlueprintCallable // @ game+0x59548c0
	void *e2ae5b0906(); // Function TslGame.TslWeapon.*e2ae5b0906 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x59497dc
	void *1119cabf8b(); // Function TslGame.TslWeapon.*1119cabf8b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949a98
	void GetWeaponMesh(); // Function TslGame.TslWeapon.GetWeaponMesh // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c27c
	void *9209687411(); // Function TslGame.TslWeapon.*9209687411 // Final|Native|Public|Const // @ game+0x594c264
	void *6a8f50dfec(); // Function TslGame.TslWeapon.*6a8f50dfec // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594aef8
	void *6d1d02a324(); // Function TslGame.TslWeapon.*6d1d02a324 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59529f0
	void *64a4022295(); // Function TslGame.TslWeapon.*64a4022295 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949244
	void *0221967311(); // Function TslGame.TslWeapon.*0221967311 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b888
	void *70cd88e0b7(); // Function TslGame.TslWeapon.*70cd88e0b7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5949ab0
	void OnRep_ItemIndex(); // Function TslGame.TslWeapon.OnRep_ItemIndex // Final|Native|Protected // @ game+0xbe948c
	void OnRep_AttachedItemIndexes(); // Function TslGame.TslWeapon.OnRep_AttachedItemIndexes // Final|Native|Protected|HasOutParms // @ game+0xb9f200
	void *8efca3994b(); // Function TslGame.TslWeapon.*8efca3994b // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c150
	void OnRep_ReplicatedAssignedMasteryItem(); // Function TslGame.TslWeapon.OnRep_ReplicatedAssignedMasteryItem // Final|Native|Private // @ game+0xbf2d88
	void *2154a1d58c(); // Function TslGame.TslWeapon.*2154a1d58c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594e824
	void *737147fbb7(); // Function TslGame.TslWeapon.*737147fbb7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbfe2e0
	void *087eac1408(); // Function TslGame.TslWeapon.*087eac1408 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x594c240
};

// Class TslGame.TslWeapon_Gun
// Size: 0xf80 (Inherited: 0xa70)
struct ATslWeapon_Gun : ATslWeapon {
	bool *6c7caf9b9c; // 0xa68(0x01)
	enum class EWeaponState CurrentState; // 0xa69(0x01)
	int32 *59a2e39591; // 0xa6c(0x04)
	int32 *e6055f67cb; // 0xa70(0x04)
	int32 *fd5b10d355; // 0xa74(0x04)
	int32 *a7234112c7; // 0xa78(0x04)
	char *10c926630f : 1; // 0xa7c(0x01)
	char *296358d7cc : 1; // 0xa7c(0x01)
	char *f3e17ff0f1 : 1; // 0xa7c(0x01)
	char pad_A82_3 : 5; // 0xa82(0x01)
	char pad_A83[0x29]; // 0xa83(0x29)
	int32 *b687d5ab58; // 0xaac(0x04)
	char pad_AB0[0x78]; // 0xab0(0x78)
	struct F*b2f5f3e08e *8488a09410; // 0xb28(0x08)
	char pad_B30[0x58]; // 0xb30(0x58)
	struct F*48577663d4 *672d9097b5; // 0xb88(0xa8)
	struct U*eacccdb9b5* *eacccdb9b5; // 0xc30(0x08)
	struct F*88219ba181 *461b3f2149; // 0xc38(0x20)
	struct FName ScopingAttachPoint; // 0xc58(0x08)
	struct FName *8ceb6108e5; // 0xc60(0x08)
	struct FName *170ee566b5; // 0xc68(0x08)
	char pad_C70[0x210]; // 0xc70(0x210)
	int32 GripTypeIndexOverride; // 0xe80(0x04)
	char pad_E84[0x14]; // 0xe84(0x14)
	float *8ebfc99562; // 0xe98(0x04)
	char pad_E9C[0xc]; // 0xe9c(0x0c)
	struct U*327a00d97e* WeaponGunData; // 0xea8(0x08)
	char pad_EB0[0x20]; // 0xeb0(0x20)
	struct UAkAudioEvent* *c556a4f4e7; // 0xed0(0x08)
	struct F*d297bbc2d5 *d297bbc2d5; // 0xed8(0x20)
	struct UStaticMeshComponent* *16f41eaa9f; // 0xef8(0x08)
	struct FName *b62fd1652d; // 0xf00(0x08)
	struct U*3c96bba018* *1156231ad8; // 0xf08(0x08)
	char pad_F10[0x4]; // 0xf10(0x04)
	struct FVector ShootTargetLoc; // 0xf14(0x0c)
	char pad_F20[0x60]; // 0xf20(0x60)

	void IsReloading(); // Function TslGame.TslWeapon_Gun.IsReloading // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596ea68
	void OnRep_AmmoCount(); // Function TslGame.TslWeapon_Gun.OnRep_AmmoCount // Final|Native|Protected // @ game+0xb060ac
	void *b8fa524831(); // Function TslGame.TslWeapon_Gun.*b8fa524831 // Final|Native|Public|BlueprintCallable // @ game+0x595ca20
	void *40b79e15c9(); // Function TslGame.TslWeapon_Gun.*40b79e15c9 // Final|Native|Protected // @ game+0x595c4f8
	void *f3769984da(); // Function TslGame.TslWeapon_Gun.*f3769984da // Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable // @ game+0xd4aad4
	void *1a2458d4a1(); // Function TslGame.TslWeapon_Gun.*1a2458d4a1 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5967f18
	void *cfece32da8(); // Function TslGame.TslWeapon_Gun.*cfece32da8 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x597eff0
	void *8e40adef06(); // Function TslGame.TslWeapon_Gun.*8e40adef06 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596bd04
	void *c2c57cb020(); // Function TslGame.TslWeapon_Gun.*c2c57cb020 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596d448
	void *e63297f87c(); // Function TslGame.TslWeapon_Gun.*e63297f87c // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596bea4
	void OnGameUserSettingApplied(); // Function TslGame.TslWeapon_Gun.OnGameUserSettingApplied // Final|Native|Protected // @ game+0x5971b18
	void *69dbc37808(); // Function TslGame.TslWeapon_Gun.*69dbc37808 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc56db0
	void *c85f6009c7(); // Function TslGame.TslWeapon_Gun.*c85f6009c7 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5967ef4
	void *e3393acf0f(); // Function TslGame.TslWeapon_Gun.*e3393acf0f // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x5968968
	void *409d6bec3d(); // Function TslGame.TslWeapon_Gun.*409d6bec3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd28738
	void *c32fce5e5d(); // Function TslGame.TslWeapon_Gun.*c32fce5e5d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc5ab14
	void *81b4d94506(); // Function TslGame.TslWeapon_Gun.*81b4d94506 // Net|Native|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x718c44
	void *5cdcc13316(); // Function TslGame.TslWeapon_Gun.*5cdcc13316 // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x7de278
	void *f1aa16ac0f(); // Function TslGame.TslWeapon_Gun.*f1aa16ac0f // Final|Native|Protected // @ game+0x5975290
	void *5faeee6d11(); // Function TslGame.TslWeapon_Gun.*5faeee6d11 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5968094
	void *298d508bcf(); // Function TslGame.TslWeapon_Gun.*298d508bcf // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x598271c
	void *fa67d546f1(); // Function TslGame.TslWeapon_Gun.*fa67d546f1 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59789b0
	void *bca5350fc8(); // Function TslGame.TslWeapon_Gun.*bca5350fc8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x596bfd0
	void *d1c9696973(); // Function TslGame.TslWeapon_Gun.*d1c9696973 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596a85c
	void OnAttachmentMainScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentMainScopeLoaded // Final|Native|Protected // @ game+0x5970ea0
	void *8500a4dd90(); // Function TslGame.TslWeapon_Gun.*8500a4dd90 // Final|Native|Public|BlueprintCallable // @ game+0x595ca0c
	void *1589d9e867(); // Function TslGame.TslWeapon_Gun.*1589d9e867 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596f2ac
	void *a6bf43253b(); // Function TslGame.TslWeapon_Gun.*a6bf43253b // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0xd07abc
	void *7c0e095724(); // Function TslGame.TslWeapon_Gun.*7c0e095724 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xa46180
	void *a8ffc24f26(); // Function TslGame.TslWeapon_Gun.*a8ffc24f26 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5969d0c
	void *3f083a6633(); // Function TslGame.TslWeapon_Gun.*3f083a6633 // Final|Native|Public|BlueprintCallable // @ game+0x5985bb0
	void *f57a46e00a(); // Function TslGame.TslWeapon_Gun.*f57a46e00a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5967f38
	void *e20b918ac5(); // Function TslGame.TslWeapon_Gun.*e20b918ac5 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5969b7c
	void *59dc961c0f(); // Function TslGame.TslWeapon_Gun.*59dc961c0f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xc80c70
	void *63f7adbf96(); // Function TslGame.TslWeapon_Gun.*63f7adbf96 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x597d75c
	void *e25d603867(); // Function TslGame.TslWeapon_Gun.*e25d603867 // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x597775c
	void *f19a03c92a(); // Function TslGame.TslWeapon_Gun.*f19a03c92a // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5989898
	void *88f25ef176(); // Function TslGame.TslWeapon_Gun.*88f25ef176 // Final|Native|Protected // @ game+0x5975270
	void *da5a79f25d(); // Function TslGame.TslWeapon_Gun.*da5a79f25d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xb67190
	void *ac02255ec6(); // Function TslGame.TslWeapon_Gun.*ac02255ec6 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59674c8
	void *4707a7df85(); // Function TslGame.TslWeapon_Gun.*4707a7df85 // Final|Native|Protected // @ game+0x5989448
	void *8a9718000d(); // Function TslGame.TslWeapon_Gun.*8a9718000d // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x597eed0
	void *7b8f21a215(); // Function TslGame.TslWeapon_Gun.*7b8f21a215 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59685dc
	void *4a854d5882(); // Function TslGame.TslWeapon_Gun.*4a854d5882 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x5983e7c
	void *458b77b479(); // Function TslGame.TslWeapon_Gun.*458b77b479 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x595d18c
	void OnInventoryUpdated(); // Function TslGame.TslWeapon_Gun.OnInventoryUpdated // Final|Native|Protected // @ game+0x5972204
	void *918a2520d5(); // Function TslGame.TslWeapon_Gun.*918a2520d5 // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x596056c
	void *8f4c0483ec(); // Function TslGame.TslWeapon_Gun.*8f4c0483ec // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x596ac54
	void *268453e7fa(); // Function TslGame.TslWeapon_Gun.*268453e7fa // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5969c68
	void *ed50808bf1(); // Function TslGame.TslWeapon_Gun.*ed50808bf1 // Final|Native|Public // @ game+0x595e234
	void *b4c9644779(); // Function TslGame.TslWeapon_Gun.*b4c9644779 // Native|Protected // @ game+0x5920b50
	void *535263a097(); // Function TslGame.TslWeapon_Gun.*535263a097 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596a87c
	void *2a47c2d6cf(); // Function TslGame.TslWeapon_Gun.*2a47c2d6cf // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5968578
	void *89cf1ec5fc(); // Function TslGame.TslWeapon_Gun.*89cf1ec5fc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59680b4
	void *b45c81cfc9(); // Function TslGame.TslWeapon_Gun.*b45c81cfc9 // Native|Protected // @ game+0x590ced0
	void *7bc4bf7f8f(); // Function TslGame.TslWeapon_Gun.*7bc4bf7f8f // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5969abc
	void *f3d9eb6a6b(); // Function TslGame.TslWeapon_Gun.*f3d9eb6a6b // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x597d8bc
	void *7746216d43(); // Function TslGame.TslWeapon_Gun.*7746216d43 // Net|Native|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x550d24
	void *f38ad92864(); // Function TslGame.TslWeapon_Gun.*f38ad92864 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5968054
	void *33d3a47e73(); // Function TslGame.TslWeapon_Gun.*33d3a47e73 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596859c
	void *77120744d8(); // Function TslGame.TslWeapon_Gun.*77120744d8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59678d0
	void *da88f72d9d(); // Function TslGame.TslWeapon_Gun.*da88f72d9d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcd58b0
	void *c29d4f5ce8(); // Function TslGame.TslWeapon_Gun.*c29d4f5ce8 // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xcaf01c
	void *4aad6f22ea(); // Function TslGame.TslWeapon_Gun.*4aad6f22ea // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59693cc
	void *713d05afc3(); // Function TslGame.TslWeapon_Gun.*713d05afc3 // Native|Public|HasOutParms|BlueprintCallable // @ game+0x594fa58
	void *2f772bb26d(); // Function TslGame.TslWeapon_Gun.*2f772bb26d // Final|Native|Public|BlueprintCallable // @ game+0x5986e38
	void OnRep_CurrentZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentZeroLevel // Final|Native|Protected // @ game+0x5973150
	void *1aad5c4e56(); // Function TslGame.TslWeapon_Gun.*1aad5c4e56 // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0x80f700
	void *9788d4a903(); // Function TslGame.TslWeapon_Gun.*9788d4a903 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596befc
	void *9d847bc3a2(); // Function TslGame.TslWeapon_Gun.*9d847bc3a2 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5969d2c
	void *1f37734bcc(); // Function TslGame.TslWeapon_Gun.*1f37734bcc // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0xd16738
	void *ca9b71f956(); // Function TslGame.TslWeapon_Gun.*ca9b71f956 // Final|Native|Public|BlueprintCallable // @ game+0x595c9e4
	void OnRep_CurrentCantedZeroLevel(); // Function TslGame.TslWeapon_Gun.OnRep_CurrentCantedZeroLevel // Final|Native|Protected // @ game+0x59730c0
	void *911c27e248(); // Function TslGame.TslWeapon_Gun.*911c27e248 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59687a4
	void *3d2ce836fb(); // Function TslGame.TslWeapon_Gun.*3d2ce836fb // Final|Native|Public|BlueprintCallable // @ game+0x595c9bc
	void *bbf9f2fe9d(); // Function TslGame.TslWeapon_Gun.*bbf9f2fe9d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59679c0
	void *70dba0a896(); // Function TslGame.TslWeapon_Gun.*70dba0a896 // Final|Native|Public|BlueprintCallable // @ game+0x595c9d0
	void *87e538d596(); // Function TslGame.TslWeapon_Gun.*87e538d596 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xbf13c4
	void *f872701ecd(); // Function TslGame.TslWeapon_Gun.*f872701ecd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5967f78
	void *9b85feee25(); // Function TslGame.TslWeapon_Gun.*9b85feee25 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5969ba8
	void *8900e21acf(); // Function TslGame.TslWeapon_Gun.*8900e21acf // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x597da40
	void *367fc8b502(); // Function TslGame.TslWeapon_Gun.*367fc8b502 // Final|Native|Protected // @ game+0x595c4f8
	void *499aab3d57(); // Function TslGame.TslWeapon_Gun.*499aab3d57 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596f2cc
	void *cdff553460(); // Function TslGame.TslWeapon_Gun.*cdff553460 // Final|Native|Public // @ game+0x595cac8
	void *004f07a93c(); // Function TslGame.TslWeapon_Gun.*004f07a93c // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0x59830cc
	void *0b8b7f042a(); // Function TslGame.TslWeapon_Gun.*0b8b7f042a // Final|Native|Public // @ game+0x595e344
	void *f820c70eae(); // Function TslGame.TslWeapon_Gun.*f820c70eae // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x596bcd0
	void *79ba8a1fc8(); // Function TslGame.TslWeapon_Gun.*79ba8a1fc8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596bebc
	void *daa443bfdd(); // Function TslGame.TslWeapon_Gun.*daa443bfdd // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596f2ec
	void *3cf905e5ef(); // Function TslGame.TslWeapon_Gun.*3cf905e5ef // Final|Native|Public|BlueprintCallable // @ game+0x595c9f8
	void *ccdef7f392(); // Function TslGame.TslWeapon_Gun.*ccdef7f392 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596bed4
	void *31b43f55c9(); // Function TslGame.TslWeapon_Gun.*31b43f55c9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x596bffc
	void OnAttachmentAngledScopeLoaded(); // Function TslGame.TslWeapon_Gun.OnAttachmentAngledScopeLoaded // Final|Native|Protected // @ game+0x5970e8c
	void *71afbd41fc(); // Function TslGame.TslWeapon_Gun.*71afbd41fc // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x597f3e4
	void *0248745afa(); // Function TslGame.TslWeapon_Gun.*0248745afa // Final|Native|Protected // @ game+0x59753e8
	void *9e04e0fafd(); // Function TslGame.TslWeapon_Gun.*9e04e0fafd // Net|NetReliableNative|Event|Public|NetClient // @ game+0x59635d4
	void *4e9759d053(); // Function TslGame.TslWeapon_Gun.*4e9759d053 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596c3c0
	void *d81e833056(); // Function TslGame.TslWeapon_Gun.*d81e833056 // Final|Native|Public|BlueprintCallable // @ game+0x598667c
	void *57e377c6bb(); // Function TslGame.TslWeapon_Gun.*57e377c6bb // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x7ddbc4
	void OnRep_FiringModeIndex(); // Function TslGame.TslWeapon_Gun.OnRep_FiringModeIndex // Final|Native|Public // @ game+0xbd9fd4
	void *a038e09fe8(); // Function TslGame.TslWeapon_Gun.*a038e09fe8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5967acc
	void *ac77bfb37c(); // Function TslGame.TslWeapon_Gun.*ac77bfb37c // Final|Native|Public // @ game+0x595d8f8
	void *d3dbece81b(); // Function TslGame.TslWeapon_Gun.*d3dbece81b // Net|NetReliableNative|Event|NetMulticast|Protected|BlueprintCallable // @ game+0xcb73b0
	void *c3fdc9db80(); // Function TslGame.TslWeapon_Gun.*c3fdc9db80 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5967f58
	void *94e182c025(); // Function TslGame.TslWeapon_Gun.*94e182c025 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5968074
	void *fbf1a317b8(); // Function TslGame.TslWeapon_Gun.*fbf1a317b8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xce7074
	void *e530ac1701(); // Function TslGame.TslWeapon_Gun.*e530ac1701 // Net|NetReliableNative|Event|NetMulticast|Protected|NetClient|NetValidate // @ game+0x5960c98
	void *7b19ab61a3(); // Function TslGame.TslWeapon_Gun.*7b19ab61a3 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596c4d0
	void *9a1d5d4a1a(); // Function TslGame.TslWeapon_Gun.*9a1d5d4a1a // Final|Native|Public|BlueprintCallable // @ game+0x59691f8
};

// Class TslGame.TslWeapon_Trajectory
// Size: 0x1080 (Inherited: 0xf80)
struct ATslWeapon_Trajectory : ATslWeapon_Gun {
	struct TMap<float, struct UClass*> *ef7c9043ab; // 0xf28(0x50)
	float *bba1c4532b; // 0xf78(0x04)
	struct UParticleSystem* *3e006c4718; // 0xf80(0x08)
	struct FMulticastDelegate OnWeaponRecoil; // 0xfb0(0x10)
	struct UClass* *452ca594ff; // 0xfc8(0x08)
	struct UClass* *7bd034eb28; // 0xfd0(0x08)
	struct FName *a9eb9c5671; // 0xfe0(0x08)
	float TrajectoryGravityZ; // 0xff4(0x04)
	char pad_1008[0x8]; // 0x1008(0x08)
	struct UWeaponTrajectoryData* WeaponTrajectoryData; // 0x1010(0x08)
	char pad_1018[0x68]; // 0x1018(0x68)

	void *5d843573d8(); // Function TslGame.TslWeapon_Trajectory.*5d843573d8 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x59a14b0
	void *35329f35e7(); // Function TslGame.TslWeapon_Trajectory.*35329f35e7 // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x59962d0
	void *0731fd5b8b(); // Function TslGame.TslWeapon_Trajectory.*0731fd5b8b // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x599878c
	void *0b17024b75(); // Function TslGame.TslWeapon_Trajectory.*0b17024b75 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x596bebc
	void *1977135bd8(); // Function TslGame.TslWeapon_Trajectory.*1977135bd8 // Net|Native|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x59a4210
	void *0448f78e7e(); // Function TslGame.TslWeapon_Trajectory.*0448f78e7e // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x594ae28
	void *4914a02b21(); // Function TslGame.TslWeapon_Trajectory.*4914a02b21 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x34b2f0
	void *87d2b8bfea(); // Function TslGame.TslWeapon_Trajectory.*87d2b8bfea // Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x59a177c
	void *9b270b3df8(); // Function TslGame.TslWeapon_Trajectory.*9b270b3df8 // Final|Native|Private|HasDefaults // @ game+0x59a09e0
	void *b90ac610c5(); // Function TslGame.TslWeapon_Trajectory.*b90ac610c5 // Net|NetReliableNative|Event|Protected|HasDefaults|NetClient|Const // @ game+0x599647c
	void *735c523b76(); // Function TslGame.TslWeapon_Trajectory.*735c523b76 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x599aa08
	void *58df92eb30(); // Function TslGame.TslWeapon_Trajectory.*58df92eb30 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59987b4
	void *fe39339382(); // Function TslGame.TslWeapon_Trajectory.*fe39339382 // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults|BlueprintCallable // @ game+0xbf362c
	void *998bb4b014(); // Function TslGame.TslWeapon_Trajectory.*998bb4b014 // Net|Native|Event|Protected|NetServer|NetValidate // @ game+0x59a1608
	void *83b0eafb88(); // Function TslGame.TslWeapon_Trajectory.*83b0eafb88 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x59a37e4
	void *4c46ef2d3d(); // Function TslGame.TslWeapon_Trajectory.*4c46ef2d3d // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x599c0d4
	void *1e68f5720d(); // Function TslGame.TslWeapon_Trajectory.*1e68f5720d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x59980bc
	void *8bab5446bd(); // Function TslGame.TslWeapon_Trajectory.*8bab5446bd // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0x59a2d6c
	void *8ea96d105c(); // Function TslGame.TslWeapon_Trajectory.*8ea96d105c // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x59a9f6c
	void OnRep_WeaponSpread(); // Function TslGame.TslWeapon_Trajectory.OnRep_WeaponSpread // Final|Native|Protected // @ game+0x599fdcc
	void *51b0287537(); // Function TslGame.TslWeapon_Trajectory.*51b0287537 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x59987f8
	void *ef907eb92d(); // Function TslGame.TslWeapon_Trajectory.*ef907eb92d // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x59a9d4c
	void *b1882be02d(); // Function TslGame.TslWeapon_Trajectory.*b1882be02d // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5998a0c
	void *b64aa03485(); // Function TslGame.TslWeapon_Trajectory.*b64aa03485 // Net|Native|Event|NetMulticast|Protected|HasDefaults|BlueprintCallable // @ game+0x5ea04c
	void *4bcb5d3a2a(); // Function TslGame.TslWeapon_Trajectory.*4bcb5d3a2a // Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults // @ game+0x59a9e30
	void *17f7c8c427(); // Function TslGame.TslWeapon_Trajectory.*17f7c8c427 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x599a9f0
	void *c7b192906a(); // Function TslGame.TslWeapon_Trajectory.*c7b192906a // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59a1308
	void *86678ddcc1(); // Function TslGame.TslWeapon_Trajectory.*86678ddcc1 // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0x59a38e8
	void *a7d44fadd8(); // Function TslGame.TslWeapon_Trajectory.*a7d44fadd8 // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x599a9d0
	void *0e99414bbc(); // Function TslGame.TslWeapon_Trajectory.*0e99414bbc // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x5998088
	void *49421a03c8(); // Function TslGame.TslWeapon_Trajectory.*49421a03c8 // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|Const|NetValidate // @ game+0x59a39f4
	void *4a4be361f9(); // Function TslGame.TslWeapon_Trajectory.*4a4be361f9 // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x59a2ee0
};

// Class TslGame.TslFBRWeapon_GatlingGun
// Size: 0x1100 (Inherited: 0x1080)
struct ATslFBRWeapon_GatlingGun : ATslWeapon_Trajectory {
	char pad_1080[0x20]; // 0x1080(0x20)
	float *068bf7418c; // 0x10a0(0x04)
	float *e1bf8095ec; // 0x10a4(0x04)
	enum class EHeatState *5cbbeceaa7; // 0x10a8(0x01)
	char pad_10A9[0x57]; // 0x10a9(0x57)

	void *892996058a(); // Function TslGame.TslFBRWeapon_GatlingGun.*892996058a // Net|NetReliableNative|Event|Protected|NetClient // @ game+0x59089a4
	void OnRep_HeatState(); // Function TslGame.TslFBRWeapon_GatlingGun.OnRep_HeatState // Final|Native|Protected // @ game+0x59147f0
};

// Class TslGame.*2059c1a77e
// Size: 0x458 (Inherited: 0x418)
struct U*2059c1a77e : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct UImage* GatlingGauge_Image; // 0x420(0x08)
	struct UMaterialInstanceDynamic* *5c86602a63; // 0x428(0x08)
	char pad_430[0x28]; // 0x430(0x28)

	void *67654dfb74(); // Function TslGame.*2059c1a77e.*67654dfb74 // Final|Native|Protected // @ game+0x59113dc
};

// Class TslGame.*be5d6c2623
// Size: 0x440 (Inherited: 0x418)
struct U*be5d6c2623 : U*eb79fdee2a {
	struct UTextBlock* MVP_PlayerName_Text; // 0x418(0x08)
	struct UWidgetSwitcher* Result_Switcher; // 0x420(0x08)
	struct U*3335e92189* Anim_End; // 0x428(0x08)
	char pad_430[0x10]; // 0x430(0x10)
};

// Class TslGame.*650249e066
// Size: 0x430 (Inherited: 0x418)
struct U*650249e066 : U*eb79fdee2a {
	struct UTextBlock* PlayerName_Text; // 0x418(0x08)
	struct U*3335e92189* Anim_GoalNotify; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*77d64ac7b6
// Size: 0x498 (Inherited: 0x418)
struct U*77d64ac7b6 : U*eb79fdee2a {
	struct UTextBlock* HomeGoalCount_Text; // 0x418(0x08)
	struct UTextBlock* AwayGoalCount_Text; // 0x420(0x08)
	struct UTextBlock* Home_Text; // 0x428(0x08)
	struct UTextBlock* Away_Text; // 0x430(0x08)
	struct UImage* HomeBar_Image; // 0x438(0x08)
	struct UImage* AwayBar_Image; // 0x440(0x08)
	struct FLinearColor *db8fd8b40e; // 0x448(0x10)
	struct FLinearColor *9058ea75ae; // 0x458(0x10)
	struct FText *7514efc9a9; // 0x468(0x18)
	struct FText *9face385ba; // 0x480(0x18)
};

// Class TslGame.*0459ea953e
// Size: 0x430 (Inherited: 0x418)
struct U*0459ea953e : U*eb79fdee2a {
	struct UWidgetSwitcher* Round_Switcher; // 0x418(0x08)
	struct UTextBlock* Min_Text; // 0x420(0x08)
	struct UTextBlock* Sec_Text; // 0x428(0x08)
};

// Class TslGame.*49a7830040
// Size: 0x430 (Inherited: 0x418)
struct U*49a7830040 : U*eb79fdee2a {
	struct U*0459ea953e* TimeInfo; // 0x418(0x08)
	struct U*77d64ac7b6* Score; // 0x420(0x08)
	struct U*650249e066* GoalNotify; // 0x428(0x08)

	void NotifyStartCountdown(); // Function TslGame.*49a7830040.NotifyStartCountdown // Native|Event|Public|BlueprintEvent // @ game+0x590e38c
	void NotifyPlayerReconnect(); // Function TslGame.*49a7830040.NotifyPlayerReconnect // Native|Event|Public|BlueprintEvent // @ game+0x590e34c
	void NotifyPhaseStart(); // Function TslGame.*49a7830040.NotifyPhaseStart // Native|Event|Public|BlueprintEvent // @ game+0x590e2b8
	void OnMatchStarted(); // Function TslGame.*49a7830040.OnMatchStarted // Final|Native|Public // @ game+0x591227c
};

// Class TslGame.*4e609a0816
// Size: 0x440 (Inherited: 0x418)
struct U*4e609a0816 : U*eb79fdee2a {
	struct UTextBlock* Goal_Text; // 0x418(0x08)
	struct UTextBlock* Kill_Text; // 0x420(0x08)
	struct UTextBlock* PlayerName_Text; // 0x428(0x08)
	struct UBorder* Info_Border; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class TslGame.*ed6d4d2b10
// Size: 0x490 (Inherited: 0x418)
struct U*ed6d4d2b10 : U*eb79fdee2a {
	struct UButton* TopbarButton; // 0x418(0x08)
	struct U*3335e92189* Anim_In; // 0x420(0x08)
	struct U*3335e92189* Anim_Out; // 0x428(0x08)
	struct UButton* UploadButton; // 0x430(0x08)
	struct UButton* DownloadButton; // 0x438(0x08)
	struct UTextBlock* TitleText; // 0x440(0x08)
	struct UTextBlock* DescriptionText; // 0x448(0x08)
	struct UTextBlock* UploadText; // 0x450(0x08)
	struct UTextBlock* DownloadText; // 0x458(0x08)
	DelegateProperty OnSavePopupButtonPressEvent; // 0x460(0x10)
	DelegateProperty OnLoadPopupButtonPressEvent; // 0x470(0x10)
	struct U*7515c31f07* *f4bbb1a0f3; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)

	void OnTopbarButtonHovered(); // Function TslGame.*ed6d4d2b10.OnTopbarButtonHovered // Final|Native|Public // @ game+0x591076c
	void OnTopbarButtonClicked(); // Function TslGame.*ed6d4d2b10.OnTopbarButtonClicked // Final|Native|Public // @ game+0x5916a1c
	void OnDownloadButtonClicked(); // Function TslGame.*ed6d4d2b10.OnDownloadButtonClicked // Final|Native|Public // @ game+0x5910758
	void OnUploadButtonHovered(); // Function TslGame.*ed6d4d2b10.OnUploadButtonHovered // Final|Native|Public // @ game+0x591076c
	void OnLoadPopupButtonPressed(); // Function TslGame.*ed6d4d2b10.OnLoadPopupButtonPressed // Final|Native|Public // @ game+0x5911d4c
	void OnSavePopupButtonPressed(); // Function TslGame.*ed6d4d2b10.OnSavePopupButtonPressed // Final|Native|Public // @ game+0x59151ec
	void OnDownloadButtonHovered(); // Function TslGame.*ed6d4d2b10.OnDownloadButtonHovered // Final|Native|Public // @ game+0x591076c
	void OnUploadButtonClicked(); // Function TslGame.*ed6d4d2b10.OnUploadButtonClicked // Final|Native|Public // @ game+0x5917254
};

// Class TslGame.*c4352ca226
// Size: 0x5b8 (Inherited: 0x418)
struct U*c4352ca226 : U*eb79fdee2a {
	struct F*0ea5cd51ef *a4f709f916; // 0x418(0xd0)
	struct F*471718b397 DisplayNameText_Binder; // 0x4e8(0x20)
	struct F*6351b5e701 SupplementaryWidgetSizeBox_Binder; // 0x508(0x20)
	struct F*6351b5e701 SupplementaryWidgetSwitcher_Binder; // 0x528(0x20)
	struct TMap<enum class ETslGameOptionSupplementaryType, struct UClass*> SupplementaryWidgetClasses; // 0x548(0x50)
	struct U*46534bdc1f* LinkButton; // 0x598(0x08)
	struct UTextBlock* LinkButtonText; // 0x5a0(0x08)
	char pad_5A8[0x10]; // 0x5a8(0x10)

	void OnClicked_LinkButton(); // Function TslGame.*c4352ca226.OnClicked_LinkButton // Final|Native|Private // @ game+0x590fbb4
};

// Class TslGame.*ff1d25560c
// Size: 0x468 (Inherited: 0x418)
struct U*ff1d25560c : U*eb79fdee2a {
	struct F*03af4cd0fb EnterHover; // 0x418(0x20)
	struct F*03af4cd0fb LeaveHover; // 0x438(0x20)
	struct UImage* ConsolImage; // 0x458(0x08)
	struct UImage* PcImage; // 0x460(0x08)
};

// Class TslGame.*bb83e7b39d
// Size: 0x528 (Inherited: 0x418)
struct U*bb83e7b39d : U*eb79fdee2a {
	struct TArray<struct FKey> *7fc712eaf8; // 0x418(0x10)
	struct U*053d05ca97* Owner; // 0x428(0x08)
	int32 SlotIndex; // 0x430(0x04)
	bool *b47a675019; // 0x434(0x01)
	bool *93333bd9cd; // 0x435(0x01)
	bool *5171c2c9f9; // 0x436(0x01)
	bool *8a16ad3299; // 0x437(0x01)
	struct TArray<struct FKey> *18243fecb4; // 0x438(0x10)
	struct FTslInputKey *4c8238bd96; // 0x448(0x20)
	struct FTslInputKey *b9ae72e36a; // 0x468(0x20)
	bool bForceToUseLeftModifierKeys; // 0x488(0x01)
	char pad_489[0x7]; // 0x489(0x07)
	struct F*07222da915 InputKeyDisplayBorder_Binder; // 0x490(0x30)
	struct F*6351b5e701 InputKeyIconizer_Binder; // 0x4c0(0x20)
	struct F*6351b5e701 Highlighter_Binder; // 0x4e0(0x20)
	struct UTexture2D* BackgroundTextureNormal; // 0x500(0x08)
	struct UTexture2D* BackgroundTextureHighlighted; // 0x508(0x08)
	struct UTexture2D* BackgroundTextureInput; // 0x510(0x08)
	struct FMulticastDelegate OnKeyBinderSlotValueChangeEvent; // 0x518(0x10)
};

// Class TslGame.*d9766abfe4
// Size: 0x4c0 (Inherited: 0x418)
struct U*d9766abfe4 : U*eb79fdee2a {
	struct U*53d36b2825* Owner; // 0x418(0x08)
	int32 Index; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct F*92d5c0f2ef SizeBox_Binder; // 0x428(0x28)
	struct F*6351b5e701 Button_Binder; // 0x450(0x20)
	struct F*07222da915 InnerBorder_Binder; // 0x470(0x30)
	struct FLinearColor ColorNormal; // 0x4a0(0x10)
	struct FLinearColor ColorHighlighted; // 0x4b0(0x10)

	void OnClicked(); // Function TslGame.*d9766abfe4.OnClicked // Final|Native|Public // @ game+0x590faf0
};

// Class TslGame.*f2449ae720
// Size: 0x458 (Inherited: 0x418)
struct U*f2449ae720 : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct U*917dfbfd61* *56965143e0; // 0x420(0x08)
	struct F*192d15bd13 *0aa12aae59; // 0x428(0x14)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct F*192d15bd13 *b94f6b5e2d; // 0x440(0x14)
	char pad_454[0x4]; // 0x454(0x04)
};

// Class TslGame.*099f53f000
// Size: 0x7d8 (Inherited: 0x458)
struct U*099f53f000 : U*f2449ae720 {
	char pad_458[0x1b0]; // 0x458(0x1b0)
	struct F*0ea5cd51ef *22c46ae08a; // 0x608(0xd0)
	struct FName *6241ed93c1; // 0x6d8(0x08)
	struct FName *97228d8417; // 0x6e0(0x08)
	struct FName *38c2b1448d; // 0x6e8(0x08)
	struct FName ItemName; // 0x6f0(0x08)
	int32 *a392b09480; // 0x6f8(0x04)
	char pad_6FC[0x4]; // 0x6fc(0x04)
	struct FText DescriptionText; // 0x700(0x18)
	bool *25afd4d55e; // 0x718(0x01)
	bool *a897e466c3; // 0x719(0x01)
	bool *d0336d4db4; // 0x71a(0x01)
	bool *b47a675019; // 0x71b(0x01)
	char pad_71C[0x4]; // 0x71c(0x04)
	struct U*622d0cd619* *7072cacc34; // 0x720(0x08)
	struct U*7515c31f07* *f4bbb1a0f3; // 0x728(0x08)
	struct UBorder* IndentationBorder; // 0x730(0x08)
	struct U*d426ac14c0* DisplayNameFlowText; // 0x738(0x08)
	struct UButton* HoverHighlightButton; // 0x740(0x08)
	struct UImage* TooltipIconImage; // 0x748(0x08)
	struct F*6351b5e701 Highlit_Binder; // 0x750(0x20)
	struct FLinearColor ColorNormal; // 0x770(0x10)
	struct FLinearColor ColorHighlighted; // 0x780(0x10)
	struct FLinearColor ColorTooltipIconHighlighted; // 0x790(0x10)
	struct FLinearColor ColorEnabled; // 0x7a0(0x10)
	struct FLinearColor ColorDisabled; // 0x7b0(0x10)
	float IndentationSize; // 0x7c0(0x04)
	char pad_7C4[0x4]; // 0x7c4(0x04)
	struct FMulticastDelegate OnGamepadYEvent; // 0x7c8(0x10)

	void UpdateWidgetOnDependentSlider(); // Function TslGame.*099f53f000.UpdateWidgetOnDependentSlider // Final|Native|Public // @ game+0x5a09f04
	void UpdateWidgetByDependentStepper(); // Function TslGame.*099f53f000.UpdateWidgetByDependentStepper // Final|Native|Public // @ game+0x5a09d74
	void *dc77151194(); // Function TslGame.*099f53f000.*dc77151194 // Final|Native|Public // @ game+0x5a0a2dc
	void UpdateWidgetOnSlider(); // Function TslGame.*099f53f000.UpdateWidgetOnSlider // Final|Native|Public // @ game+0x5a0a0a0
	void UpdateWidget(); // Function TslGame.*099f53f000.UpdateWidget // Final|Native|Public // @ game+0x5a09ce8
	void OnCloudOptionTooltipActivated(); // Function TslGame.*099f53f000.OnCloudOptionTooltipActivated // Final|Native|Public // @ game+0x59ffcc8
	void OnCloudOptionTooltipDeactivated(); // Function TslGame.*099f53f000.OnCloudOptionTooltipDeactivated // Final|Native|Public // @ game+0x59ffcdc
};

// Class TslGame.*52bc233bdd
// Size: 0x870 (Inherited: 0x7d8)
struct U*52bc233bdd : U*099f53f000 {
	float *2cf2fdc44f; // 0x7d8(0x04)
	char pad_7DC[0x4]; // 0x7dc(0x04)
	struct UButton* OptionButton; // 0x7e0(0x08)
	struct UTextBlock* OptionButtonText; // 0x7e8(0x08)
	char pad_7F0[0x70]; // 0x7f0(0x70)
	bool *e4c2782568; // 0x860(0x01)
	char pad_861[0x7]; // 0x861(0x07)
	struct F*b2f5f3e08e *ba9c0c9c62; // 0x868(0x08)

	void OnPopupButtonPressedEvent(); // Function TslGame.*52bc233bdd.OnPopupButtonPressedEvent // Final|Native|Protected // @ game+0x59142dc
	void ShowPopupDialogEx(); // Function TslGame.*52bc233bdd.ShowPopupDialogEx // Final|Native|Protected // @ game+0x59203ec
};

// Class TslGame.*90bdb4fc86
// Size: 0x898 (Inherited: 0x7d8)
struct U*90bdb4fc86 : U*099f53f000 {
	bool *289cc3d9f1; // 0x7d8(0x01)
	char pad_7D9[0x3]; // 0x7d9(0x03)
	int32 *36a908fa21; // 0x7dc(0x04)
	int32 *971d561fc4; // 0x7e0(0x04)
	char pad_7E4[0x4]; // 0x7e4(0x04)
	struct TArray<struct F*d62b28a672> *91fe7b7fce; // 0x7e8(0x10)
	struct U*143a7e59f2* *fbf3e37d71; // 0x7f8(0x08)
	struct TArray<struct U*143a7e59f2*> *1505a7129b; // 0x800(0x10)
	int32 *3c9c364a46; // 0x810(0x04)
	bool *ce32554ecf; // 0x814(0x01)
	char pad_815[0x3]; // 0x815(0x03)
	struct UStringTable* DropDownListStringTable; // 0x818(0x08)
	struct UStringTable* DropDownListDetailedStringTable; // 0x820(0x08)
	struct F*6351b5e701 DropDownList_Binder; // 0x828(0x20)
	struct F*7935e10e39 DownArrowImage_Binder; // 0x848(0x28)
	struct UClass* DropDownListSelectableWidgetClass; // 0x870(0x08)
	enum class EHorizontalAlignment *391dbd86a5; // 0x878(0x01)
	char pad_879[0x7]; // 0x879(0x07)
	struct FMulticastDelegate OnDropDownListSelectionChangeEvent; // 0x880(0x10)
	int32 *d065df6d9c; // 0x890(0x04)
	char pad_894[0x4]; // 0x894(0x04)

	void OnComboBoxSelectionChanged(); // Function TslGame.*90bdb4fc86.OnComboBoxSelectionChanged // Final|Native|Public // @ game+0x590fd74
	void OnAfterGenerateWidget(); // Function TslGame.*90bdb4fc86.OnAfterGenerateWidget // Final|Native|Public // @ game+0x590e6c4
	void OnGenerateWidget(); // Function TslGame.*90bdb4fc86.OnGenerateWidget // Final|Native|Public // @ game+0x5911240
	void OnComboBoxOpening(); // Function TslGame.*90bdb4fc86.OnComboBoxOpening // Final|Native|Public // @ game+0x590fd60
	void *93b5e38e52(); // Function TslGame.*90bdb4fc86.*93b5e38e52 // Final|Native|Public // @ game+0x590fd4c
};

// Class TslGame.*4279ba5131
// Size: 0x8a8 (Inherited: 0x898)
struct U*4279ba5131 : U*90bdb4fc86 {
	struct TArray<struct FName> *2d82895065; // 0x898(0x10)

	void OnMusicSelectionChanged(); // Function TslGame.*4279ba5131.OnMusicSelectionChanged // Final|Native|Public // @ game+0x5912ebc
};

// Class TslGame.*78a1fc22ef
// Size: 0x870 (Inherited: 0x7d8)
struct U*78a1fc22ef : U*099f53f000 {
	float *d47b71175a; // 0x7d8(0x04)
	char pad_7DC[0x4]; // 0x7dc(0x04)
	struct FText DetailedDescriptionText; // 0x7e0(0x18)
	struct FVector2D *dc312fcd3b; // 0x7f8(0x08)
	int32 *ed6e76cc3d; // 0x800(0x04)
	float *b5f87b7165; // 0x804(0x04)
	bool *cacdfec578; // 0x808(0x01)
	bool *fe3646c21b; // 0x809(0x01)
	char pad_80A[0x6]; // 0x80a(0x06)
	struct F*6351b5e701 Slider_Binder; // 0x810(0x20)
	struct F*6351b5e701 SliderEditableValueText_Binder; // 0x830(0x20)
	struct FMulticastDelegate OnSliderValueChangeEvent; // 0x850(0x10)
	float *22fe218c88; // 0x860(0x04)
	char pad_864[0x4]; // 0x864(0x04)
	float *fa71386511; // 0x868(0x04)
	float *9ca2f1b258; // 0x86c(0x04)

	void OnSliderAdjustmentEnd(); // Function TslGame.*78a1fc22ef.OnSliderAdjustmentEnd // Final|Native|Public // @ game+0x5915620
	void OnSliderAdjustmentBegin(); // Function TslGame.*78a1fc22ef.OnSliderAdjustmentBegin // Final|Native|Public // @ game+0x5915608
	void OnSliderValueTextChanged(); // Function TslGame.*78a1fc22ef.OnSliderValueTextChanged // Final|Native|Public|HasOutParms // @ game+0x59156d0
	void OnSliderValueTextCommitted(); // Function TslGame.*78a1fc22ef.OnSliderValueTextCommitted // Final|Native|Public|HasOutParms // @ game+0x59157ac
	void *8f03538363(); // Function TslGame.*78a1fc22ef.*8f03538363 // Final|Native|Private // @ game+0x59196b4
	void OnSliderValueChanged(); // Function TslGame.*78a1fc22ef.OnSliderValueChanged // Native|Public // @ game+0x5915634
};

// Class TslGame.*186d637819
// Size: 0x8b8 (Inherited: 0x870)
struct U*186d637819 : U*78a1fc22ef {
	struct UWidgetSwitcher* VolumePreviewButtonSwitcher; // 0x870(0x08)
	struct UButton* VolumePreviewButtonPlay; // 0x878(0x08)
	struct UButton* VolumePreviewButtonStop; // 0x880(0x08)
	struct UAkComponent* *63b7870e7f; // 0x888(0x08)
	struct UAkAudioEvent* *2261c843de; // 0x890(0x08)
	struct UAkAudioEvent* *8cb65c7525; // 0x898(0x08)
	bool *5608a590c0; // 0x8a0(0x01)
	char pad_8A1[0x3]; // 0x8a1(0x03)
	float *aec956faff; // 0x8a4(0x04)
	struct FName RTPC_Name; // 0x8a8(0x08)
	char pad_8B0[0x8]; // 0x8b0(0x08)

	void *905725c523(); // Function TslGame.*186d637819.*905725c523 // Final|Native|Protected // @ game+0x590b864
	void StopGuideAkEvent(); // Function TslGame.*186d637819.StopGuideAkEvent // Final|Native|Public|BlueprintCallable // @ game+0x5920b7c
	void *94a5c98dfc(); // Function TslGame.*186d637819.*94a5c98dfc // Final|Native|Protected // @ game+0x59081dc
	void StartGuideAkEvent(); // Function TslGame.*186d637819.StartGuideAkEvent // Final|Native|Public|BlueprintCallable // @ game+0x5920b3c
};

// Class TslGame.*53d36b2825
// Size: 0x8e0 (Inherited: 0x7d8)
struct U*53d36b2825 : U*099f53f000 {
	bool *da0fe71394; // 0x7d8(0x01)
	bool *475125562d; // 0x7d9(0x01)
	char pad_7DA[0x2]; // 0x7da(0x02)
	int32 *85c9f02e17; // 0x7dc(0x04)
	int32 *971d561fc4; // 0x7e0(0x04)
	char pad_7E4[0x4]; // 0x7e4(0x04)
	struct TArray<struct F*d62b28a672> *d97f6efbca; // 0x7e8(0x10)
	struct UStringTable* StepperStringTable; // 0x7f8(0x08)
	struct UStringTable* StepperDetailedStringTable; // 0x800(0x08)
	struct U*d426ac14c0* StepperFlowText; // 0x808(0x08)
	struct F*093563bf09 StepperIndicatorHorizontalBox_Binder; // 0x810(0x28)
	struct UClass* StepperIndicatorWidgetClass; // 0x838(0x08)
	struct F*6351b5e701 LeftArrowButton_Binder; // 0x840(0x20)
	struct F*6351b5e701 RightArrowButton_Binder; // 0x860(0x20)
	struct FMulticastDelegate OnStepperValueChangeEvent; // 0x880(0x10)
	struct TArray<struct F*b59010788e> *566c199562; // 0x890(0x10)
	char pad_8A0[0x40]; // 0x8a0(0x40)

	void OnRightArrowButtonClicked(); // Function TslGame.*53d36b2825.OnRightArrowButtonClicked // Final|Native|Public // @ game+0x59150b8
	void OnLeftArrowButtonClicked(); // Function TslGame.*53d36b2825.OnLeftArrowButtonClicked // Final|Native|Public // @ game+0x5911c7c
};

// Class TslGame.*ee924c13b2
// Size: 0x8f0 (Inherited: 0x8e0)
struct U*ee924c13b2 : U*53d36b2825 {
	struct TArray<struct FName> *2d82895065; // 0x8e0(0x10)

	void OnRightButtonClicked(); // Function TslGame.*ee924c13b2.OnRightButtonClicked // Final|Native|Private // @ game+0x5911c90
	void OnLeftButtonClicked(); // Function TslGame.*ee924c13b2.OnLeftButtonClicked // Final|Native|Private // @ game+0x5911c90
	void OnMusicSelectionChanged(); // Function TslGame.*ee924c13b2.OnMusicSelectionChanged // Final|Native|Public // @ game+0x5913004
};

// Class TslGame.*e49b33e3e6
// Size: 0x430 (Inherited: 0x418)
struct U*e49b33e3e6 : U*eb79fdee2a {
	struct UClass* SubTabLabelWidgetClass; // 0x418(0x08)
	struct UHorizontalBox* TabLabels; // 0x420(0x08)
	float LabelIntervalWidth; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
};

// Class TslGame.*353351ce37
// Size: 0x418 (Inherited: 0x418)
struct U*353351ce37 : U*eb79fdee2a {
};

// Class TslGame.*24430f3d52
// Size: 0x440 (Inherited: 0x418)
struct U*24430f3d52 : U*353351ce37 {
	struct F*7935e10e39 Image_Binder; // 0x418(0x28)
};

// Class TslGame.*10e3da1836
// Size: 0x4a0 (Inherited: 0x418)
struct U*10e3da1836 : U*353351ce37 {
	struct F*7935e10e39 Image_Binder; // 0x418(0x28)
	struct TMap<struct FString, struct F*de373e9aba> *ba7c32a8a3; // 0x440(0x50)
	struct FString *f2071676eb; // 0x490(0x10)
};

// Class TslGame.*767d27e8e1
// Size: 0x440 (Inherited: 0x418)
struct U*767d27e8e1 : U*353351ce37 {
	struct F*7935e10e39 Crosshair_Binder; // 0x418(0x28)
};

// Class TslGame.*908ccce503
// Size: 0x418 (Inherited: 0x418)
struct U*908ccce503 : U*353351ce37 {

	void UpdateVolumeUnitMeter(); // Function TslGame.*908ccce503.UpdateVolumeUnitMeter // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnMicVuMeterUpdated(); // Function TslGame.*908ccce503.OnMicVuMeterUpdated // Final|Native|Public // @ game+0x591287c
};

// Class TslGame.*57196c3db1
// Size: 0x4c0 (Inherited: 0x418)
struct U*57196c3db1 : U*eb79fdee2a {
	struct FName *5cf637e13e; // 0x418(0x08)
	struct F*6351b5e701 LabelButton_Binder; // 0x420(0x20)
	struct F*471718b397 LabelText_Binder; // 0x440(0x20)
	struct F*093563bf09 HighlightDecoration_Binder; // 0x460(0x28)
	struct FLinearColor LabelTextNormalColor; // 0x488(0x10)
	struct FLinearColor LabelTextHighlightColor; // 0x498(0x10)
	struct UBorder* Active_Border; // 0x4a8(0x08)
	char pad_4B0[0x10]; // 0x4b0(0x10)

	void OnLabelButtonClicked(); // Function TslGame.*57196c3db1.OnLabelButtonClicked // Final|Native|Private // @ game+0x59119a0
};

// Class TslGame.*bd1efb5078
// Size: 0x450 (Inherited: 0x418)
struct U*bd1efb5078 : U*eb79fdee2a {
	struct UClass* TabLabelWidgetClass; // 0x418(0x08)
	struct F*093563bf09 TabLabelWidgetsBox_Binder; // 0x420(0x28)
	float LabelIntervalWidth; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
};

// Class TslGame.*b06010e185
// Size: 0x438 (Inherited: 0x418)
struct U*b06010e185 : U*eb79fdee2a {
	struct UTextBlock* OptionTooltipText; // 0x418(0x08)
	struct FVector2D PositionOffset; // 0x420(0x08)
	struct UWidget* *8d62e45b5a; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*1375e4b079
// Size: 0x4d0 (Inherited: 0x418)
struct U*1375e4b079 : U*eb79fdee2a {
	struct F*6351b5e701 *94086e89eb; // 0x418(0x20)
	struct F*7eab766f7b *b29ca1db5a; // 0x438(0x28)
	struct F*7eab766f7b *3b1ae42bbc; // 0x460(0x28)
	struct F*0f89a77c6d *0a5779f25c; // 0x488(0x20)
	struct F*0f89a77c6d *124296740c; // 0x4a8(0x20)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void NotifyWeaponUnarmed(); // Function TslGame.*1375e4b079.NotifyWeaponUnarmed // Final|Native|Private // @ game+0xcfb860
	void NotifyReloadingNeed(); // Function TslGame.*1375e4b079.NotifyReloadingNeed // Final|Native|Private // @ game+0x590e364
	void RuntimeInit_Implementation(); // Function TslGame.*1375e4b079.RuntimeInit_Implementation // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnPossessPawnChanged(); // Function TslGame.*1375e4b079.OnPossessPawnChanged // Final|Native|Private // @ game+0xbf2d88
	void OnStanceChanged(); // Function TslGame.*1375e4b079.OnStanceChanged // Final|Native|Private // @ game+0xc4c274
};

// Class TslGame.*928524a676
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*928524a676 : U*1375e4b079 {
	struct USizeBox* KeyHint_SizeBox; // 0x4d0(0x08)
	float *845fbfa4ae; // 0x4d8(0x04)
	float *4ed4dbd545; // 0x4dc(0x04)
	char pad_4E0[0x8]; // 0x4e0(0x08)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*928524a676.UpdatePositionOnMinimapExtended // Final|Native|Private // @ game+0x5921c40
};

// Class TslGame.*ee2a1fe649
// Size: 0x440 (Inherited: 0x418)
struct U*ee2a1fe649 : U*eb79fdee2a {
	struct F*89ccd1e174 *77a25ff78d; // 0x418(0x28)
};

// Class TslGame.*10ce637e8f
// Size: 0x458 (Inherited: 0x418)
struct U*10ce637e8f : U*eb79fdee2a {
	struct F*471718b397 *ad68b512c0; // 0x418(0x20)
	struct F*471718b397 *f2da9826f5; // 0x438(0x20)
};

// Class TslGame.*16bc0f7575
// Size: 0x450 (Inherited: 0x418)
struct U*16bc0f7575 : U*eb79fdee2a {
	char pad_418[0x18]; // 0x418(0x18)
	struct F*471718b397 *ad68b512c0; // 0x430(0x20)
};

// Class TslGame.*21dc24b9d3
// Size: 0x478 (Inherited: 0x418)
struct U*21dc24b9d3 : U*eb79fdee2a {
	struct UMaterialInstanceDynamic* *e069c42dda; // 0x418(0x08)
	struct UMaterialInterface* *c6b81fb1df; // 0x420(0x08)
	struct F*7935e10e39 *eb6306234d; // 0x428(0x28)
	struct F*7935e10e39 *eca281ff78; // 0x450(0x28)
};

// Class TslGame.*b0f3fcd182
// Size: 0x4a8 (Inherited: 0x418)
struct U*b0f3fcd182 : U*eb79fdee2a {
	struct F*cd4c9d7cc4 *3f5939e590; // 0x418(0x28)
	struct F*cd4c9d7cc4 *1cd0004eda; // 0x440(0x28)
	bool *de3700e7fb; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct UClass* ItemSlotClass; // 0x470(0x08)
	int32 WidgetReserveCount; // 0x478(0x04)
	bool bCacheFirstInnerSlot; // 0x47c(0x01)
	char pad_47D[0x3]; // 0x47d(0x03)
	int32 InnerSlotReserveCount; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct F*44b330afde *c9fcf10dcc; // 0x488(0x18)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void *bc799d338e(); // Function TslGame.*b0f3fcd182.*bc799d338e // Final|Native|Protected // @ game+0x5911ca8
};

// Class TslGame.*af3d76efec
// Size: 0x478 (Inherited: 0x418)
struct U*af3d76efec : U*eb79fdee2a {
	struct U*f4ed9006de* KillerDebuff_Widget; // 0x418(0x08)
	struct U*f4ed9006de* SurvivorExhausted_Widget; // 0x420(0x08)
	struct UImage* Bleeding_Image; // 0x428(0x08)
	struct U*82b85d0410* EndGameGauge; // 0x430(0x08)
	struct U*17b3c486a1* Interaction_Widget; // 0x438(0x08)
	struct U*338d4f13c8* HASQTEWidget; // 0x440(0x08)
	struct U*990d11e094* Indicator_Widget0; // 0x448(0x08)
	struct U*990d11e094* Indicator_Widget1; // 0x450(0x08)
	struct U*990d11e094* Indicator_Widget2; // 0x458(0x08)
	struct TArray<struct U*990d11e094*> *fe69903c83; // 0x460(0x10)
	char pad_470[0x8]; // 0x470(0x08)
};

// Class TslGame.*990d11e094
// Size: 0x428 (Inherited: 0x418)
struct U*990d11e094 : U*eb79fdee2a {
	struct AActor* *c3fc58bfdf; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
};

// Class TslGame.*19b21038e3
// Size: 0x448 (Inherited: 0x418)
struct U*19b21038e3 : U*eb79fdee2a {
	struct UImage* KeyImage; // 0x418(0x08)
	struct FKey Key; // 0x420(0x18)
	float DesiredWidgetHeight; // 0x438(0x04)
	bool bForceKeyboardIcon; // 0x43c(0x01)
	char pad_43D[0xb]; // 0x43d(0x0b)

	void UpdateByInputKey(); // Function TslGame.*19b21038e3.UpdateByInputKey // Native|Public|HasOutParms|BlueprintCallable // @ game+0x5a47068
};

// Class TslGame.*2a65f5fa67
// Size: 0x470 (Inherited: 0x448)
struct U*2a65f5fa67 : U*19b21038e3 {
	bool bShift; // 0x448(0x01)
	bool bCtrl; // 0x449(0x01)
	bool bAlt; // 0x44a(0x01)
	char pad_44B[0x5]; // 0x44b(0x05)
	struct U*d76301fdac* ModifierPanel; // 0x450(0x08)
	struct UImage* ModifierKeyImage; // 0x458(0x08)
	struct UTextBlock* PlusTextBlock; // 0x460(0x08)
	int32 DesiredPlusTextFontSize; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
};

// Class TslGame.*832c7aefcc
// Size: 0x4d0 (Inherited: 0x470)
struct U*832c7aefcc : U*2a65f5fa67 {
	struct UImage* KeyboardHoldSpinner; // 0x470(0x08)
	struct U*d76301fdac* KeyboardHoldSpinnerPanel; // 0x478(0x08)
	struct UImage* MouseHoldSpinner; // 0x480(0x08)
	struct U*d76301fdac* MouseHoldSpinnerPanel; // 0x488(0x08)
	struct UImage* DoubleTapImage; // 0x490(0x08)
	struct UImage* HoldTriangleImage; // 0x498(0x08)
	struct U*3335e92189* HoldAnimation; // 0x4a0(0x08)
	struct UMaterialParameterCollection* InteractionHoldMPC; // 0x4a8(0x08)
	float HoldDuration; // 0x4b0(0x04)
	float *8fdeb4c248; // 0x4b4(0x04)
	bool *15e7e06760; // 0x4b8(0x01)
	bool *875cbd484a; // 0x4b9(0x01)
	bool *30dfef94d3; // 0x4ba(0x01)
	enum class EKeyboardKeyIconDisplayType *855da8df9d; // 0x4bb(0x01)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct FName ActionName; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void HoldKeyboard(); // Function TslGame.*832c7aefcc.HoldKeyboard // Final|Native|Protected // @ game+0x590c2c4
};

// Class TslGame.*17b3c486a1
// Size: 0x608 (Inherited: 0x418)
struct U*17b3c486a1 : U*eb79fdee2a {
	struct TMap<enum class ETslHASInteractionMethod, struct UTexture2D*> InteractionTextureMap; // 0x418(0x50)
	struct TMap<enum class ETslHASInteractionType, struct FText> InteractionTextMap; // 0x468(0x50)
	struct UMaterialInstanceDynamic* *c3555d8fee; // 0x4b8(0x08)
	struct FName CancelPcKeyName; // 0x4c0(0x08)
	struct FName SelfHealPcKeyName; // 0x4c8(0x08)
	struct FName FirePcKeyName; // 0x4d0(0x08)
	struct FText CancelPcKeyText; // 0x4d8(0x18)
	struct FText SelfHealPcKeyText; // 0x4f0(0x18)
	struct FText FirePcKeyText; // 0x508(0x18)
	struct F*9600f52900 CancelPadKeyInfo; // 0x520(0x30)
	struct F*9600f52900 SelfHealPadKeyInfo; // 0x550(0x30)
	struct F*9600f52900 FirePadKeyInfo; // 0x580(0x30)
	struct UHorizontalBox* Interaction_HBox; // 0x5b0(0x08)
	struct UTextBlock* Interaction_TextBlock; // 0x5b8(0x08)
	struct UImage* Interaction_Image; // 0x5c0(0x08)
	struct UImage* InteractionGauge_Image; // 0x5c8(0x08)
	struct UImage* BuffIcon_Image; // 0x5d0(0x08)
	struct UImage* SelfHealLimit_Image; // 0x5d8(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x5e0(0x08)
	struct U*1293241049* UniversalInputVisibilitySwitcher; // 0x5e8(0x08)
	struct U*832c7aefcc* PCKeyGuideIcon; // 0x5f0(0x08)
	struct UTextBlock* PCGuideText; // 0x5f8(0x08)
	struct U*9f8efe6c51* PadKeyGuideIcon; // 0x600(0x08)
};

// Class TslGame.*e5bce14aca
// Size: 0x538 (Inherited: 0x418)
struct U*e5bce14aca : U*eb79fdee2a {
	struct TMap<struct FName, struct UTexture2D*> KillerWeaponIconMap; // 0x418(0x50)
	struct TMap<enum class EHASSurvivorItemLevel, struct UTexture2D*> SurvivorItemBackgroundMap; // 0x468(0x50)
	struct TMap<enum class EHASSurvivorItemType, struct UTexture2D*> SurvivorItemIconMap; // 0x4b8(0x50)
	struct UImage* Bg_Image; // 0x508(0x08)
	struct UImage* ItemGauge_Image; // 0x510(0x08)
	struct UImage* Item_Image; // 0x518(0x08)
	struct UTextBlock* Count_Text; // 0x520(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x528(0x08)
	struct USizeBox* FireSizeBox; // 0x530(0x08)
};

// Class TslGame.*82b85d0410
// Size: 0x490 (Inherited: 0x418)
struct U*82b85d0410 : U*eb79fdee2a {
	struct UImage* LastGauge_Image; // 0x418(0x08)
	struct UEditableTextBox* ProgressPercent_TextBox; // 0x420(0x08)
	struct UMaterialInstanceDynamic* *1ccb13cf68; // 0x428(0x08)
	struct FName *2884b9fac0; // 0x430(0x08)
	struct FName *3c7778beca; // 0x438(0x08)
	struct FName *7acb0e0211; // 0x440(0x08)
	struct U*3335e92189* HAS_Alarm_Final_Collapse_Lv1; // 0x448(0x08)
	struct U*3335e92189* HAS_Alarm_Final_Collapse_Lv2; // 0x450(0x08)
	struct U*3335e92189* HAS_Alarm_Final_Collapse_Lv3; // 0x458(0x08)
	struct U*3335e92189* HAS_Alarm_Final_Collapse_Lv4; // 0x460(0x08)
	char pad_468[0x1]; // 0x468(0x01)
	bool bDBNOCharacterInEndGame; // 0x469(0x01)
	char pad_46A[0x26]; // 0x46a(0x26)
};

// Class TslGame.*87ba78a3fe
// Size: 0x530 (Inherited: 0x418)
struct U*87ba78a3fe : U*eb79fdee2a {
	char pad_418[0x18]; // 0x418(0x18)
	struct TMap<enum class EHASSurvivorItemType, struct UTexture2D*> SurvivorItemTextureMap; // 0x430(0x50)
	struct TMap<enum class EHASSurvivorState, struct UTexture2D*> SurvivorStateTextureMap; // 0x480(0x50)
	float NameTextOpacityWhenAlive; // 0x4d0(0x04)
	float NameTextOpacityWhenDead; // 0x4d4(0x04)
	struct UMaterialInstanceDynamic* *bb42940d5a; // 0x4d8(0x08)
	struct UImage* SquadBg_Image; // 0x4e0(0x08)
	struct UImage* Role_Image; // 0x4e8(0x08)
	struct UImage* Warning_Image; // 0x4f0(0x08)
	struct UImage* State_Image; // 0x4f8(0x08)
	struct U*ff4e3d7a7a* PlatformImage; // 0x500(0x08)
	struct UTextBlock* Name_TextBlock; // 0x508(0x08)
	struct UImage* Gauge_Image; // 0x510(0x08)
	struct UImage* Cabinet1_Image; // 0x518(0x08)
	struct UImage* Cabinet2_Image; // 0x520(0x08)
	struct UImage* Cabinet3_Image; // 0x528(0x08)
};

// Class TslGame.*8be0152c2f
// Size: 0x438 (Inherited: 0x418)
struct U*8be0152c2f : U*eb79fdee2a {
	struct UClass* *ff6339481a; // 0x418(0x08)
	struct TArray<struct U*87ba78a3fe*> *e14850f8d0; // 0x420(0x10)
	struct UVerticalBox* Squard_VBox; // 0x430(0x08)
};

// Class TslGame.*8174f6c8fe
// Size: 0x440 (Inherited: 0x418)
struct U*8174f6c8fe : U*eb79fdee2a {
	struct UImage* Phase_Image; // 0x418(0x08)
	struct UTextBlock* Engine_TextBlock; // 0x420(0x08)
	struct UTexture2D* *2183a4d486; // 0x428(0x08)
	struct UTexture2D* *5e95056f98; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class TslGame.*6d32e0120c
// Size: 0x428 (Inherited: 0x418)
struct U*6d32e0120c : U*eb79fdee2a {
	struct UImage* SkillIcon_Image; // 0x418(0x08)
	struct UTextBlock* SkillDesc_Text; // 0x420(0x08)
};

// Class TslGame.*9667a441b1
// Size: 0x4a0 (Inherited: 0x418)
struct U*9667a441b1 : U*eb79fdee2a {
	enum class *a081601528 WeaponType; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UTexture2D* *db9d7a1756; // 0x420(0x08)
	bool *4c524e5b04; // 0x428(0x01)
	bool *7ed2ee10f4; // 0x429(0x01)
	bool *f9af393b25; // 0x42a(0x01)
	bool *954a550606; // 0x42b(0x01)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UMaterialInstanceDynamic* *8618dc3786; // 0x430(0x08)
	struct UImage* Item_Image; // 0x438(0x08)
	struct UImage* CoolTimeGraphImage; // 0x440(0x08)
	struct UTextBlock* Count_Text; // 0x448(0x08)
	struct UImage* FireDarkBg; // 0x450(0x08)
	struct USizeBox* FireSizeBox; // 0x458(0x08)
	struct U*832c7aefcc* FirePcIcon; // 0x460(0x08)
	struct U*975c51dc1d* FirePadIcon; // 0x468(0x08)
	struct UBorder* ExplosionBorder; // 0x470(0x08)
	struct U*832c7aefcc* EquipPcIcon; // 0x478(0x08)
	struct U*975c51dc1d* EquipConsoleIcon; // 0x480(0x08)
	struct U*3335e92189* SelectAni; // 0x488(0x08)
	struct U*3335e92189* UnSelectAni; // 0x490(0x08)
	struct U*3335e92189* ExplosionHighlightAni; // 0x498(0x08)
};

// Class TslGame.*145b3573ec
// Size: 0x438 (Inherited: 0x418)
struct U*145b3573ec : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct U*9667a441b1* KillerItemSlot_1; // 0x420(0x08)
	struct U*9667a441b1* KillerItemSlot_2; // 0x428(0x08)
	struct U*9667a441b1* KillerItemSlot_3; // 0x430(0x08)
};

// Class TslGame.*ccf39fb373
// Size: 0x430 (Inherited: 0x418)
struct U*ccf39fb373 : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct U*3335e92189* Anim_Emerge; // 0x420(0x08)
	struct U*3335e92189* Anim_Vanish; // 0x428(0x08)
};

// Class TslGame.*f4ed9006de
// Size: 0x428 (Inherited: 0x418)
struct U*f4ed9006de : U*eb79fdee2a {
	struct UMaterialInstanceDynamic* *9bfc469d83; // 0x418(0x08)
	struct UImage* Gauge_Image; // 0x420(0x08)
};

// Class TslGame.*7aa8827814
// Size: 0x448 (Inherited: 0x418)
struct U*7aa8827814 : U*eb79fdee2a {
	struct U*2e0c470dec* RadioMessageLogWidget; // 0x418(0x08)
	struct U*8be0152c2f* SurvivorList_Widget; // 0x420(0x08)
	struct U*8174f6c8fe* RemainGeneratorWidget; // 0x428(0x08)
	struct UWidgetSwitcher* KillerSurvivorSwitcher; // 0x430(0x08)
	struct U*e5bce14aca* ItemSlot_Widget; // 0x438(0x08)
	struct U*145b3573ec* KillerItemSlot_Widget; // 0x440(0x08)
};

// Class TslGame.*6a799203b7
// Size: 0x480 (Inherited: 0x418)
struct U*6a799203b7 : U*eb79fdee2a {
	struct AInventory* *ddf6128f92; // 0x418(0x08)
	struct F*b2f5f3e08e *83d211de3e; // 0x420(0x08)
	struct F*b2f5f3e08e *3b91b7d5ab; // 0x428(0x08)
	enum class ECastableItemType *1859ab3f4c; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct TArray<struct F*b54b11c920> *ee3f6e2a5b; // 0x438(0x10)
	struct F*7935e10e39 *01b1c467b7; // 0x448(0x28)
	struct FVector2D *c0aabbb7d9; // 0x470(0x08)
	struct FVector2D *bbc2dd060d; // 0x478(0x08)

	void *64a8fd76cc(); // Function TslGame.*6a799203b7.*64a8fd76cc // Final|Native|Public // @ game+0x591535c
	void *d7fabb5957(); // Function TslGame.*6a799203b7.*d7fabb5957 // Final|Native|Public // @ game+0x5917268
	void *7f5df2ad80(); // Function TslGame.*6a799203b7.*7f5df2ad80 // Final|Native|Public // @ game+0x591146c
	void *11ae4aa32c(); // Function TslGame.*6a799203b7.*11ae4aa32c // Final|Native|Public // @ game+0x590e20c
};

// Class TslGame.*b0d87ab354
// Size: 0x448 (Inherited: 0x418)
struct U*b0d87ab354 : U*eb79fdee2a {
	struct UImage* GaugeImage; // 0x418(0x08)
	bool *6d46bb9032; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct U*49d671c8a8* *be14f8234d; // 0x428(0x08)
	char pad_430[0x18]; // 0x430(0x18)
};

// Class TslGame.*06b0acaf1b
// Size: 0x468 (Inherited: 0x448)
struct U*06b0acaf1b : U*b0d87ab354 {
	struct FLinearColor *8c52631875; // 0x448(0x10)
	struct UBorder* GuageBody; // 0x458(0x08)
	struct U*3335e92189* WarningAnim; // 0x460(0x08)
};

// Class TslGame.*1f8097d10d
// Size: 0x480 (Inherited: 0x418)
struct U*1f8097d10d : U*eb79fdee2a {
	struct ATslCharacter* *1cdee9d9f7; // 0x418(0x08)
	struct F*03af4cd0fb *2516838f46; // 0x420(0x20)
	struct F*03af4cd0fb *a1be110bce; // 0x440(0x20)
	struct F*03af4cd0fb *2048b53b7e; // 0x460(0x20)

	void NotifyHit(); // Function TslGame.*1f8097d10d.NotifyHit // Final|Native|Public // @ game+0x590e220
};

// Class TslGame.*90436700db
// Size: 0x478 (Inherited: 0x418)
struct U*90436700db : U*eb79fdee2a {
	struct UCanvasPanel* CanvasPanel; // 0x418(0x08)
	struct UImage* HitImage; // 0x420(0x08)
	struct U*3335e92189* FadeOutAnim; // 0x428(0x08)
	int32 *b5cb63c828; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UClass* *45267c1c46; // 0x438(0x08)
	struct UMaterialInterface* *12a5e173d5; // 0x440(0x08)
	struct UAkAudioEvent* *a4dae40d54; // 0x448(0x08)
	struct UAkAudioEvent* *68d0df5403; // 0x450(0x08)
	struct TArray<struct UUserWidget*> *e38203c8db; // 0x458(0x10)
	struct AActor* *1f521ce508; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)

	void OnHitNotify(); // Function TslGame.*90436700db.OnHitNotify // Final|Native|Public|BlueprintCallable // @ game+0x77b260
};

// Class TslGame.*b8dc2e39a3
// Size: 0x430 (Inherited: 0x418)
struct U*b8dc2e39a3 : U*eb79fdee2a {
	struct F*192d15bd13 *4b684585bc; // 0x418(0x14)
	char pad_42C[0x4]; // 0x42c(0x04)

	void NotifyOnGamepadA(); // Function TslGame.*b8dc2e39a3.NotifyOnGamepadA // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void NotifyOnGamepadDown(); // Function TslGame.*b8dc2e39a3.NotifyOnGamepadDown // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void NotifyOnGamepadUp(); // Function TslGame.*b8dc2e39a3.NotifyOnGamepadUp // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void NotifyOnGamepadB(); // Function TslGame.*b8dc2e39a3.NotifyOnGamepadB // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void NotifyOnFocusReceived(); // Function TslGame.*b8dc2e39a3.NotifyOnFocusReceived // Event|Protected|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*6509f4c7c8
// Size: 0x418 (Inherited: 0x418)
struct U*6509f4c7c8 : U*eb79fdee2a {

	void SetHUD(); // Function TslGame.*6509f4c7c8.SetHUD // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*9e30a4ecf5
// Size: 0x498 (Inherited: 0x418)
struct U*9e30a4ecf5 : U*eb79fdee2a {
	char pad_418[0x38]; // 0x418(0x38)
	TScriptInterface<struct U*805c10668b> SlotContainer; // 0x450(0x10)
	char pad_460[0x10]; // 0x460(0x10)
	struct TArray<struct U*d528f2c6cf*> *06fe5df0d2; // 0x470(0x10)
	struct UVerticalBox* ItemList; // 0x480(0x08)
	struct UClass* ItemSlotClass; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)

	void OnSlotLeave(); // Function TslGame.*9e30a4ecf5.OnSlotLeave // Final|Native|Protected // @ game+0x5915a48
	void OnSlotEnter(); // Function TslGame.*9e30a4ecf5.OnSlotEnter // Final|Native|Protected // @ game+0x59158f0
	void OnSlotFocus(); // Function TslGame.*9e30a4ecf5.OnSlotFocus // Final|Native|Protected // @ game+0xc4087c
};

// Class TslGame.*fc3a6c0744
// Size: 0x550 (Inherited: 0x418)
struct U*fc3a6c0744 : U*eb79fdee2a {
	struct F*471718b397 *49ef4ce893; // 0x418(0x20)
	struct F*471718b397 *24ecac5c27; // 0x438(0x20)
	struct F*07222da915 *872556d359; // 0x458(0x30)
	struct F*093563bf09 *703db46f05; // 0x488(0x28)
	struct F*03af4cd0fb *ac843036a0; // 0x4b0(0x20)
	struct UWidgetSwitcher* InteractKeySwitcher; // 0x4d0(0x08)
	struct U*19b21038e3* PC_KeyIcon; // 0x4d8(0x08)
	struct U*9f8efe6c51* Console_KeyIcon; // 0x4e0(0x08)
	struct F*07222da915 *c2f60575e6; // 0x4e8(0x30)
	struct FText InteractNameText; // 0x518(0x18)
	bool bBlinkInteractName; // 0x530(0x01)
	char pad_531[0x1f]; // 0x531(0x1f)
};

// Class TslGame.*35e13b8199
// Size: 0x440 (Inherited: 0x418)
struct U*35e13b8199 : U*eb79fdee2a {
	struct U*3335e92189* InfoBlink; // 0x418(0x08)
	struct U*3335e92189* InfoEmerging; // 0x420(0x08)
	struct U*3335e92189* InfoVanishing; // 0x428(0x08)
	struct UTextBlock* EmoteMessageText; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)

	void OnInteract(); // Function TslGame.*35e13b8199.OnInteract // Final|Native|Public // @ game+0x59118d4
};

// Class TslGame.*d593979aa4
// Size: 0x480 (Inherited: 0x418)
struct U*d593979aa4 : U*eb79fdee2a {
	struct F*7935e10e39 *5f36742e2f; // 0x418(0x28)
	struct F*7935e10e39 *ffa59ad9c4; // 0x440(0x28)
	float GameMaxSpace; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct AInventory* *ddf6128f92; // 0x470(0x08)
	char pad_478[0x8]; // 0x478(0x08)

	void OnInventoryUpdateEvent(); // Function TslGame.*d593979aa4.OnInventoryUpdateEvent // Final|Native|Public // @ game+0x76a654
	void OnStackCountChanged(); // Function TslGame.*d593979aa4.OnStackCountChanged // Final|Native|Public // @ game+0x5915d78
};

// Class TslGame.*86689ff85e
// Size: 0x418 (Inherited: 0x418)
struct U*86689ff85e : U*eb79fdee2a {
};

// Class TslGame.*1ec7a9b30a
// Size: 0x440 (Inherited: 0x418)
struct U*1ec7a9b30a : U*eb79fdee2a {
	struct F*7935e10e39 *50c69d58e6; // 0x418(0x28)
};

// Class TslGame.*49c773a5f5
// Size: 0x560 (Inherited: 0x418)
struct U*49c773a5f5 : U*eb79fdee2a {
	struct F*471718b397 *2de0ec66a3; // 0x418(0x20)
	struct F*471718b397 *e73279127b; // 0x438(0x20)
	struct F*471718b397 *5554c51a6f; // 0x458(0x20)
	struct F*471718b397 *a8041256a5; // 0x478(0x20)
	struct F*471718b397 *43444a5c88; // 0x498(0x20)
	struct F*471718b397 *fff3656048; // 0x4b8(0x20)
	struct F*471718b397 *803d58efbc; // 0x4d8(0x20)
	struct F*89ccd1e174 *b7ce79fe2e; // 0x4f8(0x28)
	struct F*6351b5e701 *e113131b6e; // 0x520(0x20)
	struct UButton* *7af2726228; // 0x540(0x08)
	struct U*7b4b64c0bd* *3234ee374b; // 0x548(0x08)
	int32 SlotIndex; // 0x550(0x04)
	char pad_554[0xc]; // 0x554(0x0c)

	void OnClicked(); // Function TslGame.*49c773a5f5.OnClicked // Final|Native|Public // @ game+0x590fb04
};

// Class TslGame.*ce9ef83ec9
// Size: 0x430 (Inherited: 0x418)
struct U*ce9ef83ec9 : U*eb79fdee2a {
	struct U*3335e92189* Show_Anim; // 0x418(0x08)
	struct UImage* Bg_Image; // 0x420(0x08)
	struct UImage* Icon_Image; // 0x428(0x08)
};

// Class TslGame.*8356f8e0dd
// Size: 0x510 (Inherited: 0x418)
struct U*8356f8e0dd : U*eb79fdee2a {
	char pad_418[0x58]; // 0x418(0x58)
	enum class EEquipSlotID EquipSlotID; // 0x470(0x01)
	char pad_471[0x3]; // 0x471(0x03)
	int32 WeaponSlotIndex; // 0x474(0x04)
	struct UTexture* SlotBackground_NormalEmpty; // 0x478(0x08)
	struct UTexture* SlotBackground_Normal; // 0x480(0x08)
	struct UTexture* SlotBackground_On; // 0x488(0x08)
	struct UTexture* SlotBackGround_SubOn; // 0x490(0x08)
	struct UTexture* SlotBackground_Over; // 0x498(0x08)
	struct FName TexParm; // 0x4a0(0x08)
	struct UClass* *c8a82e63a6; // 0x4a8(0x08)
	float IconSize; // 0x4b0(0x04)
	float ToolTipShowDelaytime; // 0x4b4(0x04)
	struct UImage* ItemIcon; // 0x4b8(0x08)
	struct UAkAudioEvent* *a694bbabf4; // 0x4c0(0x08)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x4c8(0x08)
	struct UMaterialInstanceDynamic* SlotDynamicMaterial; // 0x4d0(0x08)
	struct AEquipment* Equipment; // 0x4d8(0x08)
	struct UItem* Item; // 0x4e0(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x4e8(0x08)
	struct U*2dba23f78e* InventoryWidget; // 0x4f0(0x08)
	struct UItemToolTipWidget* *e41e6fd169; // 0x4f8(0x08)
	struct ATslCharacter* *d3ae0fa9c2; // 0x500(0x08)
	char pad_508[0x8]; // 0x508(0x08)

	void OnPressedWidgetInputB(); // Function TslGame.*8356f8e0dd.OnPressedWidgetInputB // Final|Native|Public // @ game+0xbf2d88
	void OnPressedUIWidgetInputY(); // Function TslGame.*8356f8e0dd.OnPressedUIWidgetInputY // Native|Public // @ game+0x5914458
	void OnEquipmentUpdated(); // Function TslGame.*8356f8e0dd.OnEquipmentUpdated // Final|Native|Private // @ game+0x5a1b590
	void IsCharacterCasting(); // Function TslGame.*8356f8e0dd.IsCharacterCasting // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x5a19374
};

// Class TslGame.*ab41364987
// Size: 0x6d8 (Inherited: 0x510)
struct U*ab41364987 : U*8356f8e0dd {
	char pad_510[0x20]; // 0x510(0x20)
	struct F*8e4dc0564e CanvasPanel_Binder; // 0x530(0x28)
	struct F*07222da915 BackgroundSlot_Binder; // 0x558(0x30)
	struct F*6351b5e701 IconBlock_Binder; // 0x588(0x20)
	struct F*7935e10e39 Icon_Bidner; // 0x5a8(0x28)
	struct F*cd4c9d7cc4 DurabilityGaugeBlock_Binder; // 0x5d0(0x28)
	struct F*6351b5e701 DurabilityIconBlock_Binder; // 0x5f8(0x20)
	struct F*7935e10e39 DestroyedItemTint_Binder; // 0x618(0x28)
	struct F*471718b397 DurabilityNumber_Binder; // 0x640(0x20)
	struct F*89ccd1e174 DurabilityIconSwitcher_Binder; // 0x660(0x28)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x688(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x698(0x10)
	struct FLinearColor BlockedIconColor; // 0x6a8(0x10)
	struct UMaterialInstanceDynamic* *624da75eba; // 0x6b8(0x08)
	struct UEquipableItem* EquipableItem; // 0x6c0(0x08)
	char pad_6C8[0x8]; // 0x6c8(0x08)
	struct U*ce9ef83ec9* RadioMessage; // 0x6d0(0x08)
};

// Class TslGame.*3b4c0cfb56
// Size: 0x720 (Inherited: 0x6d8)
struct U*3b4c0cfb56 : U*ab41364987 {
	struct F*7935e10e39 DurabilityGauge_Binder; // 0x6d8(0x28)
	struct F*6351b5e701 ItemIconLayer_Binder; // 0x700(0x20)
};

// Class TslGame.*dbde0740c0
// Size: 0x6f0 (Inherited: 0x6d8)
struct U*dbde0740c0 : U*ab41364987 {
	struct UProgressBar* Pgb_Durability; // 0x6d8(0x08)
	float *0cddb19d2f; // 0x6e0(0x04)
	char pad_6E4[0xc]; // 0x6e4(0x0c)

	void NormalState(); // Function TslGame.*dbde0740c0.NormalState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void FocusState(); // Function TslGame.*dbde0740c0.FocusState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void LinkState(); // Function TslGame.*dbde0740c0.LinkState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnPressedX(); // Function TslGame.*dbde0740c0.OnPressedX // Final|Native|Protected // @ game+0xc87004
	void OnReleasedX(); // Function TslGame.*dbde0740c0.OnReleasedX // Final|Native|Protected // @ game+0xcdc644
	void OnPressedLThumb(); // Function TslGame.*dbde0740c0.OnPressedLThumb // Final|Native|Protected // @ game+0x5914444
	void OnReleasedLThumb(); // Function TslGame.*dbde0740c0.OnReleasedLThumb // Final|Native|Protected // @ game+0x59145fc
};

// Class TslGame.*9d793476ab
// Size: 0x7e0 (Inherited: 0x720)
struct U*9d793476ab : U*3b4c0cfb56 {
	struct TArray<struct FName> Items; // 0x720(0x10)
	struct F*471718b397 ItemCountTextBinder; // 0x730(0x20)
	struct F*7935e10e39 ItemIconImageBinder; // 0x750(0x28)
	struct F*92d5c0f2ef ItemIconImageSizeBoxBinder; // 0x778(0x28)
	struct FName ItemIconTextureParamName; // 0x7a0(0x08)
	float ItemIconImageSizeBoxHeight; // 0x7a8(0x04)
	char pad_7AC[0x4]; // 0x7ac(0x04)
	struct UTexture* IconTexture; // 0x7b0(0x08)
	float NoItemOpacity; // 0x7b8(0x04)
	float DragItemOpacity; // 0x7bc(0x04)
	float HasItemOpacity; // 0x7c0(0x04)
	float DragBackgroundState; // 0x7c4(0x04)
	float ItemPresentBackgroundState; // 0x7c8(0x04)
	char pad_7CC[0x4]; // 0x7cc(0x04)
	struct UClass* LoadoutToolTipClass; // 0x7d0(0x08)
	int32 ItemsCount; // 0x7d8(0x04)
	char pad_7DC[0x4]; // 0x7dc(0x04)

	void OnEquipmentUpdated(); // Function TslGame.*9d793476ab.OnEquipmentUpdated // Final|Native|Public // @ game+0x5910a6c
	void OnInventoryUpdated(); // Function TslGame.*9d793476ab.OnInventoryUpdated // Final|Native|Public // @ game+0x5910a6c
	void OnStackCountChanged(); // Function TslGame.*9d793476ab.OnStackCountChanged // Final|Native|Public // @ game+0x5910a6c
	void OnUpdateItemBlueprint(); // Function TslGame.*9d793476ab.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*d765a797f6
// Size: 0x720 (Inherited: 0x720)
struct U*d765a797f6 : U*3b4c0cfb56 {

	void OnUpdateItemBlueprint(); // Function TslGame.*d765a797f6.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*eb173ca3d9
// Size: 0x660 (Inherited: 0x510)
struct U*eb173ca3d9 : U*8356f8e0dd {
	char pad_510[0x90]; // 0x510(0x90)
	struct U*150e6ad570* *8077a77d58; // 0x5a0(0x08)
	struct UWeaponItem* WeaponItem; // 0x5a8(0x08)
	char pad_5B0[0x10]; // 0x5b0(0x10)
	struct F*cd4c9d7cc4 AttachmentIconBlock_Binder; // 0x5c0(0x28)
	struct F*7935e10e39 AttachmentIcon_Binder; // 0x5e8(0x28)
	struct F*07222da915 AttachmentSlotBackground_Binder; // 0x610(0x30)
	enum class EWeaponAttachmentSlotID *40ad4ac699; // 0x640(0x01)
	char pad_641[0x7]; // 0x641(0x07)
	struct U*ce9ef83ec9* RadioMessage; // 0x648(0x08)
	struct AInventory* Inventory; // 0x650(0x08)
	struct U*2dba23f78e* *9cfe6751ff; // 0x658(0x08)
};

// Class TslGame.*d2f46b6bff
// Size: 0x6a0 (Inherited: 0x660)
struct U*d2f46b6bff : U*eb173ca3d9 {
	struct F*8e4dc0564e CanvasPanel_Binder; // 0x660(0x28)
	struct UImage* Recommend_Image; // 0x688(0x08)
	struct UImage* RecommendBG_Image; // 0x690(0x08)
	char pad_698[0x8]; // 0x698(0x08)
};

// Class TslGame.*bdaa5de013
// Size: 0x6b0 (Inherited: 0x660)
struct U*bdaa5de013 : U*eb173ca3d9 {
	struct F*cd4c9d7cc4 SizeBox_Binder; // 0x660(0x28)
	struct UImage* Img_Arrow; // 0x688(0x08)
	struct UImage* ImgBG; // 0x690(0x08)
	struct U*3335e92189* Anim_Arrow; // 0x698(0x08)
	float HoldDuration; // 0x6a0(0x04)
	char pad_6A4[0xc]; // 0x6a4(0x0c)

	void NormalState(); // Function TslGame.*bdaa5de013.NormalState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void FocusState(); // Function TslGame.*bdaa5de013.FocusState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void SelfPutState(); // Function TslGame.*bdaa5de013.SelfPutState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void DisableState(); // Function TslGame.*bdaa5de013.DisableState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnInputLThumbReleased(); // Function TslGame.*bdaa5de013.OnInputLThumbReleased // Final|Native|Protected // @ game+0x5911874
	void OnInputLThumbPressed(); // Function TslGame.*bdaa5de013.OnInputLThumbPressed // Final|Native|Protected // @ game+0x5911848
	void PlayArrowAnimation(); // Function TslGame.*bdaa5de013.PlayArrowAnimation // Final|Native|Public|BlueprintCallable // @ game+0x5918bd8
	void LinkState(); // Function TslGame.*bdaa5de013.LinkState // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*021f8cddf0
// Size: 0x6a0 (Inherited: 0x6a0)
struct U*021f8cddf0 : U*d2f46b6bff {
	struct UImage* DisabledImage; // 0x698(0x08)
};

// Class TslGame.TslWeapon_SoftRole
// Size: 0xaa0 (Inherited: 0xa70)
struct ATslWeapon_SoftRole : ATslWeapon {
	struct FName AnimNotifyNameCloseSoftRole; // 0xa68(0x08)
	struct FName AnimNotifyNameOpenSoftRole; // 0xa70(0x08)
	struct FName AnimNotifyNameInspectSoftRole; // 0xa78(0x08)
	enum class ESoftRoleState *63cfd57b1a; // 0xa80(0x01)
	struct FVector VehicleFppOffset; // 0xa84(0x0c)
	struct U*39f048c30b* *39f048c30b; // 0xa90(0x08)
	char pad_A9D[0x3]; // 0xa9d(0x03)

	void *31b43f55c9(); // Function TslGame.TslWeapon_SoftRole.*31b43f55c9 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594c1f4
	void *bca5350fc8(); // Function TslGame.TslWeapon_SoftRole.*bca5350fc8 // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x594c1c0
};

// Class TslGame.TslWeapon_TacPack
// Size: 0xab0 (Inherited: 0xaa0)
struct ATslWeapon_TacPack : ATslWeapon_SoftRole {
	float *619049a0d5; // 0xaa0(0x04)
	bool *edc4c24db8; // 0xaa4(0x01)
	char pad_AA5[0xb]; // 0xaa5(0x0b)

	void UpdatedCharacterEvent(); // Function TslGame.TslWeapon_TacPack.UpdatedCharacterEvent // Final|Native|Protected|HasOutParms // @ game+0x5922920
	void *ce44d2d4d6(); // Function TslGame.TslWeapon_TacPack.*ce44d2d4d6 // Final|Native|Protected // @ game+0x5916ff0
};

// Class TslGame.*161a4ef4a7
// Size: 0x7d0 (Inherited: 0x6a0)
struct U*161a4ef4a7 : U*d2f46b6bff {
	struct F*7935e10e39 *5f36742e2f; // 0x698(0x28)
	struct F*7935e10e39 *ffa59ad9c4; // 0x6c0(0x28)
	struct F*7935e10e39 *12dd98b0fe; // 0x6e8(0x28)
	struct F*7935e10e39 *3f64aad311; // 0x710(0x28)
	struct F*89ccd1e174 *22753b88f0; // 0x738(0x28)
	struct F*6351b5e701 *98428be27a; // 0x760(0x20)
	struct F*471718b397 *e86be30620; // 0x780(0x20)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x7a0(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x7b0(0x10)
	struct UTextBlock* TextStackCount; // 0x7c0(0x08)
	struct UMaterialInstanceDynamic* *db1aa4bc52; // 0x7c8(0x08)
};

// Class TslGame.*56adda7b5a
// Size: 0x7f0 (Inherited: 0x6b0)
struct U*56adda7b5a : U*bdaa5de013 {
	struct F*7935e10e39 *5f36742e2f; // 0x6b0(0x28)
	struct F*7935e10e39 *ffa59ad9c4; // 0x6d8(0x28)
	struct F*7935e10e39 *3f64aad311; // 0x700(0x28)
	struct F*89ccd1e174 *22753b88f0; // 0x728(0x28)
	struct F*6351b5e701 *98428be27a; // 0x750(0x20)
	struct F*471718b397 *e86be30620; // 0x770(0x20)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x790(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x7a0(0x10)
	struct UMaterialInstanceDynamic* *db1aa4bc52; // 0x7b0(0x08)
	struct F*6351b5e701 *1d5721b779; // 0x7b8(0x20)
	struct UTextBlock* TextStackCount; // 0x7d8(0x08)
	struct UProgressBar* Pgb_Durability; // 0x7e0(0x08)
	char pad_7E8[0x8]; // 0x7e8(0x08)
};

// Class TslGame.ViewModeStudio
// Size: 0x460 (Inherited: 0x3f8)
struct AViewModeStudio : AActor {
	struct UCameraComponent* CameraComponent; // 0x3f8(0x08)
	struct USceneCaptureComponent2D* SceneCaptureComponent; // 0x400(0x08)
	char pad_408[0x8]; // 0x408(0x08)
	struct FTransform *1fb2c4b426; // 0x410(0x30)
	struct UTextureRenderTarget2D* TextureTarget; // 0x440(0x08)
	struct FName CameraSocketName; // 0x448(0x08)
	float MaxViewDistance; // 0x450(0x04)
	float ViewSlaveLocationDuration; // 0x454(0x04)
	float *ca7e46bcf6; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)

	void AddPitch(); // Function TslGame.ViewModeStudio.AddPitch // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59d4874
	void SetViewModeAbleActor(); // Function TslGame.ViewModeStudio.SetViewModeAbleActor // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59ea824
	void AddViewDistance(); // Function TslGame.ViewModeStudio.AddViewDistance // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x590dde4
	void AddRoll(); // Function TslGame.ViewModeStudio.AddRoll // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59d4910
	void *c98d2e22e3(); // Function TslGame.ViewModeStudio.*c98d2e22e3 // Final|Native|Public|BlueprintCallable // @ game+0x59e84b8
	void *79d3cedff4(); // Function TslGame.ViewModeStudio.*79d3cedff4 // Final|Native|Public|BlueprintCallable // @ game+0x59d49ac
	void *d6757ada9d(); // Function TslGame.ViewModeStudio.*d6757ada9d // Final|Native|Public|BlueprintCallable // @ game+0x59ea418
	void AddYaw(); // Function TslGame.ViewModeStudio.AddYaw // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x59d4a44
};

// Class TslGame.ItemStudio
// Size: 0x460 (Inherited: 0x460)
struct AItemStudio : AViewModeStudio {

	void SetMeshTransform(); // Function TslGame.ItemStudio.SetMeshTransform // Native|Event|Public|BlueprintEvent // @ game+0x591ec04
	void UpdateComponentToWorld(); // Function TslGame.ItemStudio.UpdateComponentToWorld // Native|Public|BlueprintCallable // @ game+0x5921508
	void SetItem(); // Function TslGame.ItemStudio.SetItem // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x5900a20
};

// Class TslGame.*bc342f5871
// Size: 0x730 (Inherited: 0x510)
struct U*bc342f5871 : U*8356f8e0dd {
	struct UTextureRenderTarget2D* RenderTargetTexture; // 0x510(0x08)
	struct UClass* ItemStudioClass; // 0x518(0x08)
	int32 MaxWeaponNameLength; // 0x520(0x04)
	char pad_524[0x4]; // 0x524(0x04)
	struct F*07222da915 BackgroundBorder_Binder; // 0x528(0x30)
	struct F*6351b5e701 WeaponInfoText_Bidner; // 0x558(0x20)
	struct F*471718b397 WeaponHandsOnLoadedAmmoCount_Binder; // 0x578(0x20)
	struct F*7935e10e39 AmmoIcon_Binder; // 0x598(0x28)
	struct F*471718b397 WeaponHandsOnUnloadedAmmoCount_Binder; // 0x5c0(0x20)
	struct F*471718b397 WeaponName_Binder; // 0x5e0(0x20)
	struct F*471718b397 KeyName_Binder; // 0x600(0x20)
	struct F*471718b397 AmmoName_Bidner; // 0x620(0x20)
	struct F*7935e10e39 AmmoBg_Binder; // 0x640(0x28)
	struct F*7935e10e39 WeaponCaptureImage_Binder; // 0x668(0x28)
	struct F*7935e10e39 LockIcon_Binder; // 0x690(0x28)
	struct FSlateColor ImageDisabledColor; // 0x6b8(0x28)
	struct UWidgetSwitcher* UnloadedSwitcher; // 0x6e0(0x08)
	char pad_6E8[0x8]; // 0x6e8(0x08)
	struct UEquipableItem* EquipableItem; // 0x6f0(0x08)
	struct ATslWeapon* Weapon; // 0x6f8(0x08)
	struct ATslWeapon_Gun* *77d47f4a84; // 0x700(0x08)
	struct UMaterialInstanceDynamic* *93077ec9bb; // 0x708(0x08)
	struct UMaterialInstanceDynamic* *c30b3c5be8; // 0x710(0x08)
	struct UUserWidget* *40bcf61f9d; // 0x718(0x08)
	struct AInventory* *ddf6128f92; // 0x720(0x08)
	char pad_728[0x8]; // 0x728(0x08)

	void OnSpawnActorInSceneCaptureWorld(); // Function TslGame.*bc342f5871.OnSpawnActorInSceneCaptureWorld // Native|Protected // @ game+0x5915c50
	void InitBody(); // Function TslGame.*bc342f5871.InitBody // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x21d2c4
	void DestroyItemStudio(); // Function TslGame.*bc342f5871.DestroyItemStudio // Final|Native|Public // @ game+0x5909fac
};

// Class TslGame.*5a075f30fc
// Size: 0x730 (Inherited: 0x730)
struct U*5a075f30fc : U*bc342f5871 {
};

// Class TslGame.*8d41501b84
// Size: 0x730 (Inherited: 0x730)
struct U*8d41501b84 : U*bc342f5871 {

	void SelfPutState(); // Function TslGame.*8d41501b84.SelfPutState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void NormalState(); // Function TslGame.*8d41501b84.NormalState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void FocusState(); // Function TslGame.*8d41501b84.FocusState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void LinkState(); // Function TslGame.*8d41501b84.LinkState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnPressedUIWidgetInputY(); // Function TslGame.*8d41501b84.OnPressedUIWidgetInputY // Native|Protected // @ game+0x5914458
};

// Class TslGame.*63e102a651
// Size: 0x768 (Inherited: 0x730)
struct U*63e102a651 : U*5a075f30fc {
	char pad_730[0x8]; // 0x730(0x08)
	struct TArray<struct F*5f2a4acf67> *80a175bc09; // 0x738(0x10)
	struct UHorizontalBox* AmmoHorizontalBox; // 0x748(0x08)
	char pad_750[0x18]; // 0x750(0x18)

	void OnSpawnActorInSceneCaptureWorld(); // Function TslGame.*63e102a651.OnSpawnActorInSceneCaptureWorld // Native|Public // @ game+0x5915c50
};

// Class TslGame.*150e6ad570
// Size: 0x770 (Inherited: 0x510)
struct U*150e6ad570 : U*8356f8e0dd {
	char pad_510[0x10]; // 0x510(0x10)
	int32 SlotIndex; // 0x520(0x04)
	char pad_524[0xac]; // 0x524(0xac)
	struct U*6b159585ed* *3adfd04caf; // 0x5d0(0x08)
	struct TArray<struct U*eb173ca3d9*> *0cbfd8c142; // 0x5d8(0x10)
	char pad_5E8[0x50]; // 0x5e8(0x50)
	struct F*093563bf09 AttachmentSlotHorizontalBox_Binder; // 0x638(0x28)
	struct F*093563bf09 TacPackAttachmentSlotHorizontalBox_Binder; // 0x660(0x28)
	struct F*8e4dc0564e AttachmentSlotPanel_Binder; // 0x688(0x28)
	struct F*07222da915 BackgroundSlot_Binder; // 0x6b0(0x30)
	struct UTextureRenderTarget2D* RenderTargetTexture; // 0x6e0(0x08)
	struct UClass* ItemStudioClass; // 0x6e8(0x08)
	int32 MaxWeaponNameLength; // 0x6f0(0x04)
	char pad_6F4[0x4]; // 0x6f4(0x04)
	struct UMaterialInterface* *d2ecfa0383; // 0x6f8(0x08)
	struct UMaterialInterface* *4ea191ad40; // 0x700(0x08)
	struct UMaterialInterface* *3a7fc55c2b; // 0x708(0x08)
	struct U*ce9ef83ec9* RadioMessage; // 0x710(0x08)
	struct UUserWidget* *40bcf61f9d; // 0x718(0x08)
	struct AInventory* Inventory; // 0x720(0x08)
	struct AItemStudio* WeaponStudio; // 0x728(0x08)
	struct UMaterialInstanceDynamic* *93077ec9bb; // 0x730(0x08)
	struct UEquipableItem* EquipableItem; // 0x738(0x08)
	struct UWeaponItem* WeaponItem; // 0x740(0x08)
	struct UThrowableItem* ThrowableItem; // 0x748(0x08)
	struct ATslWeapon_Gun* *77d47f4a84; // 0x750(0x08)
	struct UEquipableItem* *9c083e466c; // 0x758(0x08)
	struct UWeaponItem* *bd6aeeea50; // 0x760(0x08)
	struct UThrowableItem* *1d0b880172; // 0x768(0x08)

	void *49d055de3b(); // Function TslGame.*150e6ad570.*49d055de3b // Final|Native|Protected // @ game+0x590e83c
	void OnAttachmentFocusedEvent(); // Function TslGame.*150e6ad570.OnAttachmentFocusedEvent // Final|Native|Protected // @ game+0x590ebac
	void OnPressedUIWidgetInputY(); // Function TslGame.*150e6ad570.OnPressedUIWidgetInputY // Native|Public // @ game+0x5914458
	void OnLeaveSlotFunction(); // Function TslGame.*150e6ad570.OnLeaveSlotFunction // Final|Native|Protected // @ game+0x5911b0c
	void OnEnterSlotFunction(); // Function TslGame.*150e6ad570.OnEnterSlotFunction // Final|Native|Protected // @ game+0x5910914
};

// Class TslGame.*96945bbcf5
// Size: 0x770 (Inherited: 0x770)
struct U*96945bbcf5 : U*150e6ad570 {
};

// Class TslGame.*d64dfdfe8e
// Size: 0x790 (Inherited: 0x770)
struct U*d64dfdfe8e : U*150e6ad570 {
	float *23b868777f; // 0x770(0x04)
	float *8b5f08620b; // 0x774(0x04)
	float *3f1e8b1baf; // 0x778(0x04)
	char pad_77C[0x14]; // 0x77c(0x14)

	void OnWidgetInputAReleased(); // Function TslGame.*d64dfdfe8e.OnWidgetInputAReleased // Final|Native|Protected // @ game+0x5917cf4
	void *0124e0eb5b(); // Function TslGame.*d64dfdfe8e.*0124e0eb5b // Final|Native|Protected // @ game+0x5918e44
	void SetSizeToTacticalGearWidget(); // Function TslGame.*d64dfdfe8e.SetSizeToTacticalGearWidget // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void SetSizeToThrowableWeaponWidget(); // Function TslGame.*d64dfdfe8e.SetSizeToThrowableWeaponWidget // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void *3d5539038f(); // Function TslGame.*d64dfdfe8e.*3d5539038f // Final|Native|Protected // @ game+0x59193c8
	void PressedDetachInput(); // Function TslGame.*d64dfdfe8e.PressedDetachInput // Final|Native|Protected // @ game+0xa21040
	void SetSizeToGunWeaponWidget(); // Function TslGame.*d64dfdfe8e.SetSizeToGunWeaponWidget // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void NormalState(); // Function TslGame.*d64dfdfe8e.NormalState // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void FocusState(); // Function TslGame.*d64dfdfe8e.FocusState // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void ReleasedDropInput(); // Function TslGame.*d64dfdfe8e.ReleasedDropInput // Final|Native|Protected // @ game+0x59194ac
	void PressedDropInput(); // Function TslGame.*d64dfdfe8e.PressedDropInput // Final|Native|Protected // @ game+0x5918e30
	void LinkState(); // Function TslGame.*d64dfdfe8e.LinkState // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void OnWidgetInputL3Pressed(); // Function TslGame.*d64dfdfe8e.OnWidgetInputL3Pressed // Final|Native|Protected // @ game+0x5917d08
	void OnWidgetInputL3Released(); // Function TslGame.*d64dfdfe8e.OnWidgetInputL3Released // Final|Native|Protected // @ game+0x5917d1c
	void OnWidgetInputAPressed(); // Function TslGame.*d64dfdfe8e.OnWidgetInputAPressed // Final|Native|Protected // @ game+0x5917ce0
	void OnWidgetInputR3Released(); // Function TslGame.*d64dfdfe8e.OnWidgetInputR3Released // Final|Native|Protected // @ game+0x5917d48
	void OnWidgetInputR3Pressed(); // Function TslGame.*d64dfdfe8e.OnWidgetInputR3Pressed // Final|Native|Protected // @ game+0x5917d34
	void ReleaseDetachInput(); // Function TslGame.*d64dfdfe8e.ReleaseDetachInput // Final|Native|Protected // @ game+0xa20624
};

// Class TslGame.*71a1ce26a3
// Size: 0x790 (Inherited: 0x770)
struct U*71a1ce26a3 : U*96945bbcf5 {
	DelegateProperty *507c3b82e1; // 0x770(0x10)
	struct U*0855634eb6* *62eaa63a9a; // 0x780(0x08)
	char pad_788[0x8]; // 0x788(0x08)

	void ProcessBuy(); // Function TslGame.*71a1ce26a3.ProcessBuy // Final|Native|Private // @ game+0x5918f60
	void OnUpdateItemBlueprint(); // Function TslGame.*71a1ce26a3.OnUpdateItemBlueprint // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.TslItemDragWidget
// Size: 0x540 (Inherited: 0x418)
struct UTslItemDragWidget : U*eb79fdee2a {
	struct F*7935e10e39 *2a4427f830; // 0x418(0x28)
	struct F*7935e10e39 *772cb38b0d; // 0x440(0x28)
	struct F*7935e10e39 *01b1c467b7; // 0x468(0x28)
	struct F*cd4c9d7cc4 *45b6d9c653; // 0x490(0x28)
	struct F*471718b397 *5fb2895271; // 0x4b8(0x20)
	struct UItem* *99999986a5; // 0x4d8(0x08)
	TScriptInterface<struct U*e28414a307> *d80ca50d68; // 0x4e0(0x10)
	char pad_4F0[0x20]; // 0x4f0(0x20)
	struct UTexture* *818cdb518d; // 0x510(0x08)
	struct UTexture* *15257f852e; // 0x518(0x08)
	struct UTexture* *0f9efe1921; // 0x520(0x08)
	struct ATslPlayerController* ShooterPlayerController; // 0x528(0x08)
	struct AInventory* Inventory; // 0x530(0x08)
	struct UMaterialInstanceDynamic* *7dd32e9982; // 0x538(0x08)

	void *fd7af33ba1(); // Function TslGame.TslItemDragWidget.*fd7af33ba1 // Final|Native|Public // @ game+0x5910aa4
};

// Class TslGame.*f8ec54c2e7
// Size: 0x720 (Inherited: 0x418)
struct U*f8ec54c2e7 : U*eb79fdee2a {
	char pad_418[0x68]; // 0x418(0x68)
	struct TArray<enum class EItemCategory> *773586122c; // 0x480(0x10)
	struct UClass* *8076fe4a17; // 0x490(0x08)
	bool *c11bb3a77a; // 0x498(0x01)
	bool *30bb451316; // 0x499(0x01)
	char pad_49A[0x96]; // 0x49a(0x96)
	float *7b4efdf29d; // 0x530(0x04)
	char pad_534[0x14]; // 0x534(0x14)
	struct F*92d5c0f2ef *3d2720adb9; // 0x548(0x28)
	struct F*8071e70734 *3c219b50d0; // 0x570(0x28)
	struct F*07222da915 *d8cabf36d4; // 0x598(0x30)
	struct F*cd4c9d7cc4 *3201da5b03; // 0x5c8(0x28)
	struct F*6351b5e701 *7ec79d5a67; // 0x5f0(0x20)
	struct F*6351b5e701 *e58aadccad; // 0x610(0x20)
	struct F*471718b397 *1967a3e6ef; // 0x630(0x20)
	struct F*471718b397 *4801985594; // 0x650(0x20)
	struct UClass* *5cc5ca6afc; // 0x670(0x08)
	struct FSlateColor *f67f8e77be; // 0x678(0x28)
	struct FSlateColor *c5296d8d31; // 0x6a0(0x28)
	float *e6d352161e; // 0x6c8(0x04)
	float *5206a848df; // 0x6cc(0x04)
	int32 *c73fb0bedf; // 0x6d0(0x04)
	char pad_6D4[0x4]; // 0x6d4(0x04)
	struct TArray<struct U*d528f2c6cf*> *791d2f68cc; // 0x6d8(0x10)
	struct ANearbyInteractiveItemExplorer* ItemExplorer; // 0x6e8(0x08)
	TScriptInterface<struct U*805c10668b> Container; // 0x6f0(0x10)
	struct TArray<TScriptInterface<struct U*e28414a307>> *07e616fbfe; // 0x700(0x10)
	TScriptInterface<struct U*e28414a307> *a067e269d5; // 0x710(0x10)

	void RefreshList(); // Function TslGame.*f8ec54c2e7.RefreshList // Final|Native|Public // @ game+0xd3a3b4
	void HandleOnLeaveChildSlot(); // Function TslGame.*f8ec54c2e7.HandleOnLeaveChildSlot // Final|Native|Public // @ game+0x590bcd4
	void OnClickBtn_Time(); // Function TslGame.*f8ec54c2e7.OnClickBtn_Time // Native|Protected // @ game+0x9ff6c0
	void OnClickBtn_Type(); // Function TslGame.*f8ec54c2e7.OnClickBtn_Type // Native|Protected // @ game+0xe0def8
	void *76252b97ff(); // Function TslGame.*f8ec54c2e7.*76252b97ff // Final|Native|Public // @ game+0x5910dbc
	void *e1fac7e525(); // Function TslGame.*f8ec54c2e7.*e1fac7e525 // Final|Native|Public // @ game+0x5909d38
	void OnSlotFocus(); // Function TslGame.*f8ec54c2e7.OnSlotFocus // Native|Public // @ game+0xc410f0
	void OnEquipmentUpdated(); // Function TslGame.*f8ec54c2e7.OnEquipmentUpdated // Final|Native|Private // @ game+0x5910a80
	void OnRepCharacterInventory(); // Function TslGame.*f8ec54c2e7.OnRepCharacterInventory // Final|Native|Private // @ game+0x5914614
	void OnRefreshFocus(); // Function TslGame.*f8ec54c2e7.OnRefreshFocus // Native|Public // @ game+0x77d960
	void *3b98884383(); // Function TslGame.*f8ec54c2e7.*3b98884383 // Native|Protected // @ game+0x59145e4
	void OnInventoryUpdated(); // Function TslGame.*f8ec54c2e7.OnInventoryUpdated // Final|Native|Private // @ game+0xd4aab4
	void HandleOnDoSlotAction(); // Function TslGame.*f8ec54c2e7.HandleOnDoSlotAction // Final|Native|Public // @ game+0x590bb60
	void HandleOnEnterSlot(); // Function TslGame.*f8ec54c2e7.HandleOnEnterSlot // Final|Native|Public // @ game+0xcb7770
	void IsEmptyList(); // Function TslGame.*f8ec54c2e7.IsEmptyList // Final|Native|Public|BlueprintCallable // @ game+0x590c860
	void HandleOnEnterChildSlot(); // Function TslGame.*f8ec54c2e7.HandleOnEnterChildSlot // Final|Native|Public // @ game+0x590bb7c
	void HandleOnLeaveSlot(); // Function TslGame.*f8ec54c2e7.HandleOnLeaveSlot // Final|Native|Public // @ game+0x590be2c
	void OnChangedStackCount(); // Function TslGame.*f8ec54c2e7.OnChangedStackCount // Final|Native|Protected // @ game+0x590f8fc
};

// Class TslGame.*918fdc4ad0
// Size: 0x720 (Inherited: 0x720)
struct U*918fdc4ad0 : U*f8ec54c2e7 {
};

// Class TslGame.*625b31efc3
// Size: 0x728 (Inherited: 0x720)
struct U*625b31efc3 : U*f8ec54c2e7 {
	char pad_720[0x8]; // 0x720(0x08)
};

// Class TslGame.*d528f2c6cf
// Size: 0xab0 (Inherited: 0x418)
struct U*d528f2c6cf : U*eb79fdee2a {
	char pad_418[0x30]; // 0x418(0x30)
	TScriptInterface<struct U*e28414a307> *345a212ebf; // 0x448(0x10)
	TScriptInterface<struct U*805c10668b> SlotContainer; // 0x458(0x10)
	char pad_468[0x98]; // 0x468(0x98)
	struct FLinearColor DefaultSlotNameColor; // 0x500(0x10)
	struct FLinearColor DisabledSlotNameColor; // 0x510(0x10)
	char pad_520[0x50]; // 0x520(0x50)
	struct F*6351b5e701 *66ba02510b; // 0x570(0x20)
	struct F*6351b5e701 *11ff11c301; // 0x590(0x20)
	struct F*7935e10e39 *221af52d5e; // 0x5b0(0x28)
	struct F*07222da915 *5194b31f4f; // 0x5d8(0x30)
	struct F*7935e10e39 *a05c03af3e; // 0x608(0x28)
	struct F*471718b397 *85faf691f6; // 0x630(0x20)
	struct F*6351b5e701 *9791853170; // 0x650(0x20)
	struct F*7935e10e39 *2a4427f830; // 0x670(0x28)
	struct F*7935e10e39 *50c69d58e6; // 0x698(0x28)
	struct F*6351b5e701 *1d5721b779; // 0x6c0(0x20)
	struct F*7935e10e39 *12dd98b0fe; // 0x6e0(0x28)
	struct F*7935e10e39 *3f64aad311; // 0x708(0x28)
	struct F*89ccd1e174 *22753b88f0; // 0x730(0x28)
	struct F*6351b5e701 *98428be27a; // 0x758(0x20)
	struct F*471718b397 *e86be30620; // 0x778(0x20)
	struct F*471718b397 *2d25b44482; // 0x798(0x20)
	struct F*471718b397 *65b4a67d0f; // 0x7b8(0x20)
	struct F*92d5c0f2ef *45b6d9c653; // 0x7d8(0x28)
	struct F*471718b397 *5fb2895271; // 0x800(0x20)
	struct F*07222da915 *46634fe069; // 0x820(0x30)
	struct F*7935e10e39 *2717eb53fa; // 0x850(0x28)
	struct F*471718b397 *e7eeaa8ca1; // 0x878(0x20)
	struct F*cd4c9d7cc4 *db31b7ea7c; // 0x898(0x28)
	struct F*cd4c9d7cc4 *1961e313e2; // 0x8c0(0x28)
	struct F*92d5c0f2ef *c1ae20aefb; // 0x8e8(0x28)
	struct F*6351b5e701 *8207e737c4; // 0x910(0x20)
	struct F*7935e10e39 *5ef806313c; // 0x930(0x28)
	struct F*471718b397 *1d381fbf8c; // 0x958(0x20)
	struct UClass* *372806b4bd; // 0x978(0x08)
	struct UTexture2D* SelectTexture; // 0x980(0x08)
	struct UTexture2D* FocusTexture; // 0x988(0x08)
	struct UTexture2D* LinkTexture; // 0x990(0x08)
	struct UTexture2D* NormalTexture; // 0x998(0x08)
	struct FLinearColor DurabilityNumberDamagedColor; // 0x9a0(0x10)
	struct FLinearColor DurabilityNumberNormalColor; // 0x9b0(0x10)
	bool *fd1600ae77; // 0x9c0(0x01)
	bool *11d443b250; // 0x9c1(0x01)
	char pad_9C2[0x6]; // 0x9c2(0x06)
	struct UEquipableItem* EquipableItem; // 0x9c8(0x08)
	struct UMaterialInstanceDynamic* *7dd32e9982; // 0x9d0(0x08)
	struct UItem* *b10ddb36ce; // 0x9d8(0x08)
	struct UMaterialInstanceDynamic* *0cbf2e1782; // 0x9e0(0x08)
	struct UProgressBar* CastingProgressBar; // 0x9e8(0x08)
	struct AInventory* *08e7e9b481; // 0x9f0(0x08)
	struct UCastComponent* *219b36c22e; // 0x9f8(0x08)
	struct UMaterialInstanceDynamic* *db1aa4bc52; // 0xa00(0x08)
	struct UMaterialInstanceDynamic* *e4d11d4a68; // 0xa08(0x08)
	struct ATslCharacter* TslCharacter; // 0xa10(0x08)
	struct UTexture* Tex; // 0xa18(0x08)
	struct UImage* *af5fdede08; // 0xa20(0x08)
	struct U*2dba23f78e* *9cfe6751ff; // 0xa28(0x08)
	struct UItemToolTipWidget* *e41e6fd169; // 0xa30(0x08)
	struct F*a3e4749da2 *9d3f4f8e13; // 0xa38(0x78)

	void BroadCastSlotFocus(); // Function TslGame.*d528f2c6cf.BroadCastSlotFocus // Final|Native|Protected // @ game+0xc406b8
	void DispatchRefreshInnerList(); // Function TslGame.*d528f2c6cf.DispatchRefreshInnerList // Final|Native|Protected // @ game+0xe11348
	void OnChangedStackCount(); // Function TslGame.*d528f2c6cf.OnChangedStackCount // Final|Native|Protected // @ game+0x590f918
	void BroadCastSlotEnter(); // Function TslGame.*d528f2c6cf.BroadCastSlotEnter // Final|Native|Protected // @ game+0x5907dd4
	void BroadCastSlotLeave(); // Function TslGame.*d528f2c6cf.BroadCastSlotLeave // Final|Native|Protected // @ game+0x5907f2c
};

// Class TslGame.*9834396dc6
// Size: 0xab8 (Inherited: 0xab0)
struct U*9834396dc6 : U*d528f2c6cf {
	struct U*ce9ef83ec9* RadioMessage; // 0xab0(0x08)
};

// Class TslGame.*b39e999cb4
// Size: 0xb20 (Inherited: 0xab0)
struct U*b39e999cb4 : U*d528f2c6cf {
	struct U*ff4e3d7a7a* UserNickNamePlatformImageWidget; // 0xab0(0x08)
	struct F*093563bf09 *a66d81d16d; // 0xab8(0x28)
	float *8b5f08620b; // 0xae0(0x04)
	float *23b868777f; // 0xae4(0x04)
	float *32ee0fcd23; // 0xae8(0x04)
	char pad_AEC[0x2c]; // 0xaec(0x2c)
	struct UProgressBar* Pgb_Durability; // 0xb18(0x08)

	void SelfPutState(); // Function TslGame.*b39e999cb4.SelfPutState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnInputAPressed(); // Function TslGame.*b39e999cb4.OnInputAPressed // Final|Native|Protected // @ game+0x591180c
	void FocusState(); // Function TslGame.*b39e999cb4.FocusState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnInputXPressed(); // Function TslGame.*b39e999cb4.OnInputXPressed // Final|Native|Protected // @ game+0xa20d88
	void OnInputLThumbPressed(); // Function TslGame.*b39e999cb4.OnInputLThumbPressed // Final|Native|Protected // @ game+0x5911834
	void *6031734877(); // Function TslGame.*b39e999cb4.*6031734877 // Final|Native|Protected // @ game+0x591188c
	void OnInputYPressed(); // Function TslGame.*b39e999cb4.OnInputYPressed // Final|Native|Protected // @ game+0x59118ac
	void OnInputYReleased(); // Function TslGame.*b39e999cb4.OnInputYReleased // Final|Native|Protected // @ game+0x59118c0
	void OnInputBPressed(); // Function TslGame.*b39e999cb4.OnInputBPressed // Final|Native|Protected // @ game+0xa20cd8
	void LinkState(); // Function TslGame.*b39e999cb4.LinkState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnInputXReleased(); // Function TslGame.*b39e999cb4.OnInputXReleased // Final|Native|Protected // @ game+0xa20dec
	void OnInputAReleased(); // Function TslGame.*b39e999cb4.OnInputAReleased // Final|Native|Protected // @ game+0x5911820
	void NormalState(); // Function TslGame.*b39e999cb4.NormalState // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnInputLThumbReleased(); // Function TslGame.*b39e999cb4.OnInputLThumbReleased // Final|Native|Protected // @ game+0x591185c
};

// Class TslGame.*551da9234d
// Size: 0xb18 (Inherited: 0xab8)
struct U*551da9234d : U*9834396dc6 {
	struct UBorder* HoverBorder; // 0xab8(0x08)
	struct UWidget* CapacityLayer; // 0xac0(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xac8(0x08)
	struct UTextBlock* MaxCapacityText; // 0xad0(0x08)
	struct FLinearColor TrunkDragEnterColor; // 0xad8(0x10)
	struct FLinearColor TrunkDragLeaveColor; // 0xae8(0x10)
	struct FLinearColor TrunkEmptyTextColor; // 0xaf8(0x10)
	struct UTexture2D* emptytexture; // 0xb08(0x08)
	char pad_B10[0x8]; // 0xb10(0x08)
};

// Class TslGame.*366b712a27
// Size: 0xb60 (Inherited: 0xb20)
struct U*366b712a27 : U*b39e999cb4 {
	struct UVerticalBox* CategoryAndCapacityBox; // 0xb20(0x08)
	struct UImage* Img_IconBg; // 0xb28(0x08)
	struct UGridPanel* IconGrp; // 0xb30(0x08)
	struct UTextBlock* CurrentCapacityText; // 0xb38(0x08)
	struct UTextBlock* MaxCapacityText; // 0xb40(0x08)
	struct FLinearColor TrunkEmptyTextColor; // 0xb48(0x10)
	char pad_B58[0x8]; // 0xb58(0x08)
};

// Class TslGame.*b92a40640f
// Size: 0x490 (Inherited: 0x418)
struct U*b92a40640f : U*eb79fdee2a {
	struct F*0c169a22f8 KeysPanel_Binder; // 0x418(0x20)
	struct FKey CtrlUnrealKey; // 0x438(0x18)
	struct FKey AltUnrealKey; // 0x450(0x18)
	struct FKey ShiftUnrealKey; // 0x468(0x18)
	struct TArray<struct U*93e455dd98*> *d4949af69a; // 0x480(0x10)
};

// Class TslGame.*15f6110575
// Size: 0x480 (Inherited: 0x418)
struct U*15f6110575 : U*eb79fdee2a {
	struct F*471718b397 DescriptionTextBlock_Binder; // 0x418(0x20)
	struct F*093563bf09 KeyImageHorizontalBox; // 0x438(0x28)
	struct F*471718b397 DebugTextBlock_Binder; // 0x460(0x20)
};

// Class TslGame.TslKeyHintContentWidget
// Size: 0x528 (Inherited: 0x418)
struct UTslKeyHintContentWidget : U*eb79fdee2a {
	struct UClass* KeyImageWidgetClass; // 0x418(0x08)
	struct FMargin KeyIconPadding; // 0x420(0x10)
	float KeyIconDesiredHeight; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UHorizontalBox* KeyImagePanel; // 0x438(0x08)
	struct UTextBlock* InputModeText; // 0x440(0x08)
	struct U*d426ac14c0* DisplayNameFlowText; // 0x448(0x08)
	struct TArray<struct U*19b21038e3*> *d60e189760; // 0x450(0x10)
	struct F*f503912892 *b2c07af6b0; // 0x460(0xb0)
	char pad_510[0x18]; // 0x510(0x18)
};

// Class TslGame.*2dcbd8fe56
// Size: 0x560 (Inherited: 0x528)
struct U*2dcbd8fe56 : UTslKeyHintContentWidget {
	struct UTexture2D* *bcd3b2747f; // 0x528(0x08)
	struct FText *f24f57e232; // 0x530(0x18)
	struct FText *42c532b70b; // 0x548(0x18)
};

// Class TslGame.*027a63c48c
// Size: 0x560 (Inherited: 0x528)
struct U*027a63c48c : UTslKeyHintContentWidget {
	struct FName DummyActionName_Aim; // 0x528(0x08)
	struct FName DummyActionName_ADS; // 0x530(0x08)
	struct FName ActionName_Targeting; // 0x538(0x08)
	struct FName ActionName_Aim; // 0x540(0x08)
	struct FText HoldText; // 0x548(0x18)
};

// Class TslGame.*84ecd04af1
// Size: 0x528 (Inherited: 0x528)
struct U*84ecd04af1 : UTslKeyHintContentWidget {
};

// Class TslGame.*30f93884d0
// Size: 0x468 (Inherited: 0x418)
struct U*30f93884d0 : U*eb79fdee2a {
	enum class EKeyHintType KeyHintType; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UClass* *e33a6ca029; // 0x420(0x08)
	struct F*6351b5e701 *067c25d363; // 0x428(0x20)
	struct F*03af4cd0fb *f0d1a97c55; // 0x448(0x20)
};

// Class TslGame.*710d446da8
// Size: 0x4c0 (Inherited: 0x418)
struct U*710d446da8 : U*eb79fdee2a {
	struct UDataTable* KeyHintDataTable; // 0x418(0x08)
	struct UDataTable* KeyHintInfoDataTable; // 0x420(0x08)
	struct UDataTable* KeyHintTableCheckerSetDataTable; // 0x428(0x08)
	struct UClass* ContentWidgetClass; // 0x430(0x08)
	struct FMargin KeyHintContentPadding; // 0x438(0x10)
	struct TArray<struct FName> DisabledGameModes; // 0x448(0x10)
	struct UVerticalBox* PanelA; // 0x458(0x08)
	struct UVerticalBox* PanelB; // 0x460(0x08)
	struct UInvalidationBox* InvalidationBox; // 0x468(0x08)
	struct U*3335e92189* AnimationOnChangeHint; // 0x470(0x08)
	struct TArray<struct F*8b8b538cc8> *0286bd10cb; // 0x478(0x10)
	char pad_488[0x10]; // 0x488(0x10)
	struct TArray<struct UTslKeyHintContentWidget*> *b2240068d3; // 0x498(0x10)
	char pad_4A8[0x18]; // 0x4a8(0x18)

	void OnNotifyUpdateKeyHint(); // Function TslGame.*710d446da8.OnNotifyUpdateKeyHint // Final|Native|Private // @ game+0xc08548
	void UpdateSelfPosition(); // Function TslGame.*710d446da8.UpdateSelfPosition // Final|Native|Protected // @ game+0x5921d3c
	void OnGameUserSettingApplied(); // Function TslGame.*710d446da8.OnGameUserSettingApplied // Native|Protected // @ game+0x590fad8
};

// Class TslGame.*ad4c7ba77a
// Size: 0x4c0 (Inherited: 0x4c0)
struct U*ad4c7ba77a : U*710d446da8 {
};

// Class TslGame.*759b091f3e
// Size: 0x4c0 (Inherited: 0x4c0)
struct U*759b091f3e : U*710d446da8 {
};

// Class TslGame.*5571353d70
// Size: 0x440 (Inherited: 0x418)
struct U*5571353d70 : U*eb79fdee2a {
	struct UWidgetSwitcher* KeyHint_Switcher; // 0x418(0x08)
	struct USizeBox* KeyHint_SizeBox; // 0x420(0x08)
	float *845fbfa4ae; // 0x428(0x04)
	float *4ed4dbd545; // 0x42c(0x04)
	float *bc80b0bbc7; // 0x430(0x04)
	char pad_434[0xc]; // 0x434(0x0c)

	void UpdatePositionOnMinimapExtended(); // Function TslGame.*5571353d70.UpdatePositionOnMinimapExtended // Final|Native|Protected // @ game+0x5921c54
};

// Class TslGame.*fae9800701
// Size: 0x450 (Inherited: 0x440)
struct U*fae9800701 : U*5571353d70 {
	struct FName ActionName; // 0x440(0x08)
	struct U*2a65f5fa67* KeyImage; // 0x448(0x08)

	void UpdateKeyImage(); // Function TslGame.*fae9800701.UpdateKeyImage // Final|Native|Protected // @ game+0x59219b0
};

// Class TslGame.*bd7600b1d5
// Size: 0x498 (Inherited: 0x440)
struct U*bd7600b1d5 : U*5571353d70 {
	struct UVerticalBox* KeyHint_VerticalBox_Console; // 0x440(0x08)
	struct UVerticalBox* KeyHint_VerticalBox_Pc; // 0x448(0x08)
	struct TArray<struct F*2bee84db49> *50ea6e6345; // 0x450(0x10)
	struct TArray<struct F*2bee84db49> *e54a89103f; // 0x460(0x10)
	char pad_470[0x28]; // 0x470(0x28)
};

// Class TslGame.*eae75ecc9a
// Size: 0x4a8 (Inherited: 0x498)
struct U*eae75ecc9a : U*bd7600b1d5 {
	char pad_498[0x10]; // 0x498(0x10)
};

// Class TslGame.*05b21fbbf4
// Size: 0x450 (Inherited: 0x450)
struct U*05b21fbbf4 : U*fae9800701 {
};

// Class TslGame.*52fb228a9b
// Size: 0x4b8 (Inherited: 0x418)
struct U*52fb228a9b : U*eb79fdee2a {
	struct FMulticastDelegate OnKeyReceived; // 0x418(0x10)
	struct FTslInputKey OriginKey; // 0x428(0x20)
	struct FKey FirstDownKey; // 0x448(0x18)
	struct FTslInputKey CurrentDownKey; // 0x460(0x20)
	struct FTslInputKey LastDownedKey; // 0x480(0x20)
	bool bFocused; // 0x4a0(0x01)
	bool bEnableInput; // 0x4a1(0x01)
	bool bIsKeyUp; // 0x4a2(0x01)
	bool bAxisInput; // 0x4a3(0x01)
	float AxisScale; // 0x4a4(0x04)
	struct TArray<struct FKey> MouseButtons; // 0x4a8(0x10)

	void KeyDown(); // Function TslGame.*52fb228a9b.KeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x590c998
	void IsInputKeyDown(); // Function TslGame.*52fb228a9b.IsInputKeyDown // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x590c8d4
	void UpdateKeyDown(); // Function TslGame.*52fb228a9b.UpdateKeyDown // Final|Native|Protected|BlueprintCallable // @ game+0x59218cc
	void UpdateKeyUp(); // Function TslGame.*52fb228a9b.UpdateKeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x59219c4
	void GetLastDownedKeyName(); // Function TslGame.*52fb228a9b.GetLastDownedKeyName // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x590ad64
	void KeyUp(); // Function TslGame.*52fb228a9b.KeyUp // Final|Native|Protected|BlueprintCallable // @ game+0x590ca7c
};

// Class TslGame.*93e455dd98
// Size: 0x550 (Inherited: 0x418)
struct U*93e455dd98 : U*eb79fdee2a {
	struct FString KeyName; // 0x418(0x10)
	struct FKey MatchingUnrealKey; // 0x428(0x18)
	struct FSlateFontInfo KeyNameFont; // 0x440(0x68)
	enum class EVerticalAlignment KeyNameVerticalAlignment; // 0x4a8(0x01)
	enum class EHorizontalAlignment KeyNameHorizontalAlignment; // 0x4a9(0x01)
	enum class ETextJustify KeyNameJustification; // 0x4aa(0x01)
	char pad_4AB[0x1]; // 0x4ab(0x01)
	float KeyNameWrapTextAt; // 0x4ac(0x04)
	struct FLinearColor NonSelectedBorderColor; // 0x4b0(0x10)
	struct FLinearColor SelectedBorderColor; // 0x4c0(0x10)
	struct FLinearColor NonSelectedTextColor; // 0x4d0(0x10)
	struct FLinearColor SelectedTextColor; // 0x4e0(0x10)
	struct UTexture2D* SelectedKeyBorderImage; // 0x4f0(0x08)
	struct UTexture2D* NonSelectedKeyBorderImage; // 0x4f8(0x08)
	bool bSelected; // 0x500(0x01)
	char pad_501[0x7]; // 0x501(0x07)
	struct F*471718b397 KeyNameTextBlock_Binder; // 0x508(0x20)
	struct F*7935e10e39 BorderImage_Binder; // 0x528(0x28)

	void IsSelected(); // Function TslGame.*93e455dd98.IsSelected // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c928
	void SetSelected(); // Function TslGame.*93e455dd98.SetSelected // Final|Native|Public|BlueprintCallable // @ game+0x591f62c
};

// Class TslGame.*cc3b1e7007
// Size: 0x488 (Inherited: 0x418)
struct U*cc3b1e7007 : U*eb79fdee2a {
	struct F*6351b5e701 *2e7067e804; // 0x418(0x20)
	struct F*6351b5e701 *ac8843f005; // 0x438(0x20)
	struct F*471718b397 *867e94ecb0; // 0x458(0x20)
	DelegateProperty PopupButtonEvent; // 0x478(0x10)

	void SetPopupWidget(); // Function TslGame.*cc3b1e7007.SetPopupWidget // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x591f0cc
	void OnClickedNoButtion(); // Function TslGame.*cc3b1e7007.OnClickedNoButtion // Final|Native|Private // @ game+0x590fb2c
	void OnClickedYesButton(); // Function TslGame.*cc3b1e7007.OnClickedYesButton // Final|Native|Private // @ game+0x590fb8c
};

// Class TslGame.*494f85a75b
// Size: 0x438 (Inherited: 0x418)
struct U*494f85a75b : U*eb79fdee2a {
	struct F*03af4cd0fb *558bc52b52; // 0x418(0x20)
};

// Class TslGame.*41039572ca
// Size: 0x430 (Inherited: 0x418)
struct U*41039572ca : U*eb79fdee2a {
	float *8695c2a35b; // 0x418(0x04)
	float *f929d511dc; // 0x41c(0x04)
	struct U*4f6fb71889* UI_KillMessageTextBorderWidget; // 0x420(0x08)
	struct U*87f8af29a9* UI_KillMessageCounterWidget; // 0x428(0x08)
};

// Class TslGame.*87f8af29a9
// Size: 0x4f0 (Inherited: 0x418)
struct U*87f8af29a9 : U*eb79fdee2a {
	struct UBorder* TeamKillBorder; // 0x418(0x08)
	struct UBorder* KillCounterBorder; // 0x420(0x08)
	struct UBorder* AssistCounterBorder; // 0x428(0x08)
	struct UScaleBox* AssistCounterScaleBox; // 0x430(0x08)
	struct UTextBlock* KillCurrentCount; // 0x438(0x08)
	struct UTextBlock* KillNextCount; // 0x440(0x08)
	struct UTextBlock* AssistCurrentCount; // 0x448(0x08)
	struct UTextBlock* AssistNextCount; // 0x450(0x08)
	struct UWidgetSwitcher* KillTextSwitcher; // 0x458(0x08)
	struct UWidgetSwitcher* AssistTextSwitcher; // 0x460(0x08)
	struct U*3335e92189* KillCountUpEffect; // 0x468(0x08)
	struct U*3335e92189* KillCountUpNoEffect; // 0x470(0x08)
	struct U*3335e92189* AssistCountUp; // 0x478(0x08)
	struct U*3335e92189* KillFadeInEffect; // 0x480(0x08)
	struct U*3335e92189* KillFadeInNoEffect; // 0x488(0x08)
	struct U*3335e92189* KillFadeInEffectWithoutAssistAnim; // 0x490(0x08)
	struct U*3335e92189* KillFadeInNoEffectWithoutAssistAnim; // 0x498(0x08)
	struct U*3335e92189* AssistFadeIn; // 0x4a0(0x08)
	struct U*3335e92189* FadeInit; // 0x4a8(0x08)
	struct U*3335e92189* CountInit; // 0x4b0(0x08)
	struct U*3335e92189* FadeOutAnim; // 0x4b8(0x08)
	float *351041b44e; // 0x4c0(0x04)
	struct FVector2D *4b1d69f4e9; // 0x4c4(0x08)
	float *51053d6029; // 0x4cc(0x04)
	struct FVector2D *9e59358c6f; // 0x4d0(0x08)
	char pad_4D8[0x18]; // 0x4d8(0x18)
};

// Class TslGame.*208a332134
// Size: 0x498 (Inherited: 0x418)
struct U*208a332134 : U*eb79fdee2a {
	struct UClass* *dec905fc57; // 0x418(0x08)
	struct UClass* *0452badd17; // 0x420(0x08)
	struct F*0f89a77c6d *490569d755; // 0x428(0x20)
	struct U*f172d2aabe* IconOtherKillMessage; // 0x448(0x08)
	struct F*0f89a77c6d *735ee6d6eb; // 0x450(0x20)
	struct U*41039572ca* *a93db467ff; // 0x470(0x08)
	float *cff8670790; // 0x478(0x04)
	float *7f8a3047f8; // 0x47c(0x04)
	struct TArray<struct FDeathMessage> *6ccc479ac7; // 0x480(0x10)
	char pad_490[0x8]; // 0x490(0x08)

	void PushAssistMessage(); // Function TslGame.*208a332134.PushAssistMessage // Final|Native|Private|HasOutParms // @ game+0x5919114
	void OnDisplayKilledMessage(); // Function TslGame.*208a332134.OnDisplayKilledMessage // Final|Native|Private|HasOutParms // @ game+0x529460
};

// Class TslGame.*f172d2aabe
// Size: 0x468 (Inherited: 0x418)
struct U*f172d2aabe : U*eb79fdee2a {
	struct UClass* *00a17f70c1; // 0x418(0x08)
	struct F*cd4c9d7cc4 *a4fc93a5f3; // 0x420(0x28)
	struct TArray<struct U*01d82fbef6*> FreeMessageWidgets; // 0x448(0x10)
	float *527c29396c; // 0x458(0x04)
	bool *cb221c152c; // 0x45c(0x01)
	bool *0ce71bb629; // 0x45d(0x01)
	char pad_45E[0x2]; // 0x45e(0x02)
	float *a35b7dbbd0; // 0x460(0x04)
	int32 *7cbcc8e738; // 0x464(0x04)

	void OnVanishFinished(); // Function TslGame.*f172d2aabe.OnVanishFinished // Final|Native|Public // @ game+0xb60798
	void EnqueueDeathMessage(); // Function TslGame.*f172d2aabe.EnqueueDeathMessage // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x590a698
	void TrimKillMessageWidgetArrayByNumLimit(); // Function TslGame.*f172d2aabe.TrimKillMessageWidgetArrayByNumLimit // Final|Native|Public|BlueprintCallable // @ game+0x5920f18
	void ReserveMessageWidgetPool(); // Function TslGame.*f172d2aabe.ReserveMessageWidgetPool // Final|Native|Public|BlueprintCallable // @ game+0x5919624
	void OnListSizeLimitChange(); // Function TslGame.*f172d2aabe.OnListSizeLimitChange // Final|Native|Private // @ game+0x5911d38
	void SetKillMessageWidgetClass(); // Function TslGame.*f172d2aabe.SetKillMessageWidgetClass // Final|Native|Public|BlueprintCallable // @ game+0x591e798
};

// Class TslGame.*4f6fb71889
// Size: 0x438 (Inherited: 0x418)
struct U*4f6fb71889 : U*eb79fdee2a {
	struct UGridPanel* KillMessageGrid; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)
};

// Class TslGame.*94bf95f683
// Size: 0x4f0 (Inherited: 0x418)
struct U*94bf95f683 : U*eb79fdee2a {
	struct U*3335e92189* FadeInAnim; // 0x418(0x08)
	struct U*3335e92189* Transition1to2; // 0x420(0x08)
	struct U*3335e92189* Transition2to3; // 0x428(0x08)
	struct U*3335e92189* Transition3to4; // 0x430(0x08)
	struct U*3335e92189* Transition4to5; // 0x438(0x08)
	struct U*3335e92189* FadeOutAnim; // 0x440(0x08)
	struct U*3335e92189* InitAnim; // 0x448(0x08)
	struct U*ff4e3d7a7a* Player1Platform; // 0x450(0x08)
	struct UTslRichTextBlock* KillMsgBlock; // 0x458(0x08)
	struct U*ff4e3d7a7a* Player2Platform; // 0x460(0x08)
	struct UTslRichTextBlock* KillMsgBlock2; // 0x468(0x08)
	struct TMap<struct FName, struct FLinearColor> *9a55eadf08; // 0x470(0x50)
	char pad_4C0[0x30]; // 0x4c0(0x30)
};

// Class TslGame.*01d82fbef6
// Size: 0x510 (Inherited: 0x418)
struct U*01d82fbef6 : U*eb79fdee2a {
	struct FMulticastDelegate OnVanishFinished; // 0x418(0x10)
	struct TArray<struct F*e75674a2ea> *b86f90ef7a; // 0x428(0x10)
	struct TArray<struct F*46866f9d35> *d7ad0b9b59; // 0x438(0x10)
	struct TArray<struct UTexture*> WeaponMasteryLevelIcons; // 0x448(0x10)
	struct F*0f89a77c6d *ed32df4ce5; // 0x458(0x20)
	struct F*0f89a77c6d *fd9e6958ff; // 0x478(0x20)
	struct USizeBox* KillMessageSizebox; // 0x498(0x08)
	struct FText PlayZoneText; // 0x4a0(0x18)
	struct FText RedZoneText; // 0x4b8(0x18)
	struct FText *a9c59be27a; // 0x4d0(0x18)
	struct FText *d79f86f627; // 0x4e8(0x18)
	char pad_500[0x10]; // 0x500(0x10)

	void *0663bc5547(); // Function TslGame.*01d82fbef6.*0663bc5547 // Final|Native|Protected // @ game+0x5a46648
	void SetVanishTimer(); // Function TslGame.*01d82fbef6.SetVanishTimer // Final|Native|Public // @ game+0x5a45188
	void SetFontStyleAndSize(); // Function TslGame.*01d82fbef6.SetFontStyleAndSize // Final|Native|Protected // @ game+0x5a43fd0
	void GetTextureFromDamageTypeCategory(); // Function TslGame.*01d82fbef6.GetTextureFromDamageTypeCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5a31de8
	void GetTextureFromConditionOfDeathCategory(); // Function TslGame.*01d82fbef6.GetTextureFromConditionOfDeathCategory // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5a31b08
	void *e2ee1a569a(); // Function TslGame.*01d82fbef6.*e2ee1a569a // Final|Native|Protected // @ game+0x5912e68
};

// Class TslGame.*5ea238530e
// Size: 0x630 (Inherited: 0x510)
struct U*5ea238530e : U*01d82fbef6 {
	struct FLinearColor NormalColor; // 0x510(0x10)
	struct FLinearColor *c4b63ff30b; // 0x520(0x10)
	struct FLinearColor *d52de54573; // 0x530(0x10)
	struct FLinearColor *a19c66abc9; // 0x540(0x10)
	struct FLinearColor *da95e0d814; // 0x550(0x10)
	struct FLinearColor *4710d87130; // 0x560(0x10)
	float *57df7016b6; // 0x570(0x04)
	char pad_574[0x4]; // 0x574(0x04)
	struct F*e75674a2ea *2c7247d916; // 0x578(0x20)
	struct UWidgetSwitcher* BgSwitcher; // 0x598(0x08)
	struct UImage* SkinBgLeft; // 0x5a0(0x08)
	struct UImage* SkinBgRight; // 0x5a8(0x08)
	struct UTextBlock* KillerNameText; // 0x5b0(0x08)
	struct UTextBlock* VictimNameText; // 0x5b8(0x08)
	struct UImage* CauserImage; // 0x5c0(0x08)
	struct USizeBox* CauserSizeBox; // 0x5c8(0x08)
	struct UImage* WeaponMasteryImage; // 0x5d0(0x08)
	struct USizeBox* WeaponMasterySizeBox; // 0x5d8(0x08)
	struct UImage* HeadShotImage; // 0x5e0(0x08)
	struct USizeBox* HeadShotSizeBox; // 0x5e8(0x08)
	struct UImage* ConditionImage; // 0x5f0(0x08)
	struct USizeBox* ConditionSizeBox; // 0x5f8(0x08)
	struct UImage* SkinBgTint; // 0x600(0x08)
	struct TArray<struct UImage*> EffectImages; // 0x608(0x10)
	struct UImage* AdditionalEffect; // 0x618(0x08)
	struct U*b88f564a03* KillerIcon; // 0x620(0x08)
	struct U*b88f564a03* VictimIcon; // 0x628(0x08)

	void *0002326e20(); // Function TslGame.*5ea238530e.*0002326e20 // Final|Native|Protected // @ game+0x590b8b4
	void SetMessageColorAndOpacity(); // Function TslGame.*5ea238530e.SetMessageColorAndOpacity // Final|Native|Protected|HasDefaults // @ game+0x591ec98
	void SetLayoutTo(); // Function TslGame.*5ea238530e.SetLayoutTo // Final|Native|Protected // @ game+0x591ea44
};

// Class TslGame.*4980edf7ac
// Size: 0x890 (Inherited: 0x510)
struct U*4980edf7ac : U*01d82fbef6 {
	struct UTexture* *da6ffe5627; // 0x510(0x08)
	struct UTexture* *4c42ac0c05; // 0x518(0x08)
	struct UTexture* *e94c2320a9; // 0x520(0x08)
	struct UTexture* *fd6421cbc4; // 0x528(0x08)
	struct FLinearColor *33a4c9c062; // 0x530(0x10)
	struct FLinearColor *75e76b9eb9; // 0x540(0x10)
	struct F*471718b397 *7e615c909d; // 0x550(0x20)
	struct F*471718b397 *4ab74a44dc; // 0x570(0x20)
	struct F*471718b397 *8b6e9b2b97; // 0x590(0x20)
	struct F*471718b397 *918e20411d; // 0x5b0(0x20)
	struct F*471718b397 *feb24ec03f; // 0x5d0(0x20)
	struct F*471718b397 *e4f9a81ef8; // 0x5f0(0x20)
	struct F*89ccd1e174 *7c55f5b737; // 0x610(0x28)
	struct F*7935e10e39 *4a52aa97fe; // 0x638(0x28)
	struct F*7935e10e39 *f8f53ede93; // 0x660(0x28)
	struct F*7935e10e39 *7ff09aac95; // 0x688(0x28)
	struct F*89ccd1e174 *feafb1c017; // 0x6b0(0x28)
	struct F*7935e10e39 *98dec60e0d; // 0x6d8(0x28)
	struct F*7935e10e39 *693ae3a9c6; // 0x700(0x28)
	struct F*7935e10e39 *6304bf04eb; // 0x728(0x28)
	struct F*7935e10e39 *047953905e; // 0x750(0x28)
	struct F*92d5c0f2ef *3cf6c47243; // 0x778(0x28)
	struct F*92d5c0f2ef *411475d09f; // 0x7a0(0x28)
	struct F*92d5c0f2ef *4e1c999667; // 0x7c8(0x28)
	struct F*7935e10e39 *8f8461c2a9; // 0x7f0(0x28)
	struct F*07222da915 *8e30fc3b5a; // 0x818(0x30)
	struct F*093563bf09 *9567798d89; // 0x848(0x28)
	struct F*03af4cd0fb *1a93d6ea16; // 0x870(0x20)

	void *2e7cf0d0a6(); // Function TslGame.*4980edf7ac.*2e7cf0d0a6 // Final|Native|Private // @ game+0x590b564
	void SetVictimMessageColorAndOpacity(); // Function TslGame.*4980edf7ac.SetVictimMessageColorAndOpacity // Final|Native|Private|HasDefaults // @ game+0x591fce4
	void SetLayoutTo(); // Function TslGame.*4980edf7ac.SetLayoutTo // Final|Native|Private // @ game+0x591ead8
};

// Class TslGame.*9e2add5893
// Size: 0x490 (Inherited: 0x418)
struct U*9e2add5893 : U*eb79fdee2a {
	struct TMap<enum class ELoadingScreenType, struct UTexture2D*> DefaultBackgroundsByType; // 0x418(0x50)
	struct UDataTable* LoadingScreenImageDataTable; // 0x468(0x08)
	struct UTexture2D* *f7c1500b0d; // 0x470(0x20)

	void OnUpdate(); // Function TslGame.*9e2add5893.OnUpdate // Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*74880356e5
// Size: 0x428 (Inherited: 0x418)
struct U*74880356e5 : U*eb79fdee2a {
	struct USizeBox* LoadingSpinnerSizeBox; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void ShowSpinner(); // Function TslGame.*74880356e5.ShowSpinner // Final|Native|Protected // @ game+0x5920400
};

// Class TslGame.*6d52358df4
// Size: 0x460 (Inherited: 0x418)
struct U*6d52358df4 : U*eb79fdee2a {
	struct UClass* LobbyNameNameTagWidgetClass; // 0x418(0x08)
	struct F*8e4dc0564e *33d2ba17c9; // 0x420(0x28)
	bool bUseNameTagOffsetTranslations; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
	struct TArray<struct FVector> NameTagOffsetTranslations; // 0x450(0x10)

	void ResetNameTagWidget_Internal(); // Function TslGame.*6d52358df4.ResetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x59198a8
	void UpdateNameTagWidget_Internal(); // Function TslGame.*6d52358df4.UpdateNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x5921aa8
	void GetNameTagWidget_Internal(); // Function TslGame.*6d52358df4.GetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x590af70
	void SetNameTagWidget_Internal(); // Function TslGame.*6d52358df4.SetNameTagWidget_Internal // Final|Native|Public|BlueprintCallable // @ game+0x591ed44
};

// Class TslGame.*396f8af97a
// Size: 0x4c8 (Inherited: 0x418)
struct U*396f8af97a : U*eb79fdee2a {
	struct UTextBlock* NickNameText; // 0x418(0x08)
	struct U*ff4e3d7a7a* UserPlatformImageWidget; // 0x420(0x08)
	struct U*f86887334f* RankEmblemWidget; // 0x428(0x08)
	struct UWidgetSwitcher* VoiceSwitcher; // 0x430(0x08)
	struct USizeBox* VoiceSizeBox; // 0x438(0x08)
	struct USizeBox* HostSizeBox; // 0x440(0x08)
	struct USizeBox* SizeBoxForStatus; // 0x448(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x450(0x08)
	struct USizeBox* SizeBoxForMiddle; // 0x458(0x08)
	struct U*ae0e73d03c* Clanplate; // 0x460(0x08)
	bool *eb2e4c1674; // 0x468(0x01)
	bool bHideIfAlone; // 0x469(0x01)
	bool bHideStateIconIfAlone; // 0x46a(0x01)
	bool bHideIdleStateIcon; // 0x46b(0x01)
	struct FVector RankNameTagOffsetTranslations; // 0x46c(0x0c)
	char pad_478[0x4]; // 0x478(0x04)
	int32 SlotIndex; // 0x47c(0x04)
	struct FName NameTagSocketName; // 0x480(0x08)
	struct FVector NameTagOffsetTranslation; // 0x488(0x0c)
	bool bIsHost; // 0x494(0x01)
	bool bIsReady; // 0x495(0x01)
	bool bIsSpeaking; // 0x496(0x01)
	bool bIsLogout; // 0x497(0x01)
	struct FString Nickname; // 0x498(0x10)
	struct FString ClanTag; // 0x4a8(0x10)
	struct FString ClanplateId; // 0x4b8(0x10)

	void InitWidget(); // Function TslGame.*396f8af97a.InitWidget // Final|Native|Public|BlueprintCallable // @ game+0x590c424
	void SetNickNameAndClanTag(); // Function TslGame.*396f8af97a.SetNickNameAndClanTag // Final|Native|Public|BlueprintCallable // @ game+0x591edd4
	void SetSpeaking(); // Function TslGame.*396f8af97a.SetSpeaking // Final|Native|Private // @ game+0x591f964
	void SetReady(); // Function TslGame.*396f8af97a.SetReady // Final|Native|Private // @ game+0xd4f49c
	void SetOffsetTranslation(); // Function TslGame.*396f8af97a.SetOffsetTranslation // Final|Native|Public|HasOutParms|HasDefaults // @ game+0x591ef94
	void SetNameTagProps(); // Function TslGame.*396f8af97a.SetNameTagProps // Final|Native|Public // @ game+0x591ed30
	void SetPlatformIcon(); // Function TslGame.*396f8af97a.SetPlatformIcon // Final|Native|Private // @ game+0x591f03c
	void SetBinding(); // Function TslGame.*396f8af97a.SetBinding // Final|Native|Private // @ game+0x591e164
	void OnVoiceChatUpdated(); // Function TslGame.*396f8af97a.OnVoiceChatUpdated // Final|Native|Protected // @ game+0x5917974
	void SetRankEmblem(); // Function TslGame.*396f8af97a.SetRankEmblem // Final|Native|Private // @ game+0x591f3e4
	void OnTeamVoiceChannelLeave(); // Function TslGame.*396f8af97a.OnTeamVoiceChannelLeave // Final|Native|Public // @ game+0x5916304
	void SetHost(); // Function TslGame.*396f8af97a.SetHost // Final|Native|Private // @ game+0xdfd074
	void UpdateWidgetsVisibilities(); // Function TslGame.*396f8af97a.UpdateWidgetsVisibilities // Final|Native|Public|BlueprintCallable // @ game+0x592272c
	void *c425e041d3(); // Function TslGame.*396f8af97a.*c425e041d3 // Final|Native|Private|Const // @ game+0x590c784
	void OnParticipantMuteChanged(); // Function TslGame.*396f8af97a.OnParticipantMuteChanged // Final|Native|Protected // @ game+0x5913d08
	void UpdateNickNameAndClanName(); // Function TslGame.*396f8af97a.UpdateNickNameAndClanName // Final|Native|Public|BlueprintCallable // @ game+0x5921b38
	void UpdateWidgetSwitchers(); // Function TslGame.*396f8af97a.UpdateWidgetSwitchers // Final|Native|Public|BlueprintCallable // @ game+0x5922718
};

// Class TslGame.*979bcc966b
// Size: 0x428 (Inherited: 0x418)
struct U*979bcc966b : U*eb79fdee2a {
	struct UImage* ImageTowerBind; // 0x418(0x08)
	enum class ETslMapMarkerTowerState *32de2274e5; // 0x420(0x01)
	bool *591c26c64d; // 0x421(0x01)
	char pad_422[0x6]; // 0x422(0x06)
};

// Class TslGame.*4db1074e02
// Size: 0x610 (Inherited: 0x418)
struct U*4db1074e02 : U*eb79fdee2a {
	struct FSlateColor *d14ffa0a4a; // 0x418(0x28)
	struct FSlateFontInfo *3cdf90fcb1; // 0x440(0x68)
	struct FSlateColor *f93a397091; // 0x4a8(0x28)
	struct FSlateColor *1c8c923321; // 0x4d0(0x28)
	struct FSlateFontInfo *d5f6dcdbf8; // 0x4f8(0x68)
	struct FSlateColor *43cfaa6f56; // 0x560(0x28)
	struct FSlateColor *7f152e4a9a; // 0x588(0x28)
	struct FSlateColor *d04415de77; // 0x5b0(0x28)
	struct UTextBlock* TimestampTextBlock; // 0x5d8(0x08)
	struct U*ff4e3d7a7a* PlatformImageWidget; // 0x5e0(0x08)
	struct UTslRichTextBlock* MessageTextBlock; // 0x5e8(0x08)
	struct U*ff4e3d7a7a* PlatformImageWidget2; // 0x5f0(0x08)
	struct UTslRichTextBlock* MessageTextBlock2; // 0x5f8(0x08)
	struct UImage* HighlightImage; // 0x600(0x08)
	struct USizeBox* MatchLogContentSizeBox; // 0x608(0x08)

	void Update(); // Function TslGame.*4db1074e02.Update // Final|Native|Public|HasOutParms // @ game+0x59211c4
};

// Class TslGame.*955449aaf4
// Size: 0x4a8 (Inherited: 0x418)
struct U*955449aaf4 : U*eb79fdee2a {
	struct UClass* *69471d65ff; // 0x418(0x08)
	float *4e2ce0b302; // 0x420(0x04)
	int32 *1c5562a232; // 0x424(0x04)
	struct U*61f9f61a04* TabSelectorWidget; // 0x428(0x08)
	struct UScrollBox* ContentsScrollBox; // 0x430(0x08)
	struct U*975c51dc1d* GamepadScrollGuideKeyIcon; // 0x438(0x08)
	struct UButton* BackButton; // 0x440(0x08)
	struct USpacer* TopSpacer; // 0x448(0x08)
	struct USpacer* BottomSpacer; // 0x450(0x08)
	struct UVerticalBox* LogVerticalBox; // 0x458(0x08)
	struct UTextBlock* NoMatchLogTextBlock; // 0x460(0x08)
	struct TArray<struct FMatchLog> *526634a560; // 0x468(0x10)
	enum class EMatchLogTab CurrentTab; // 0x478(0x01)
	bool *62b1a2643b; // 0x479(0x01)
	bool *9ab16cb56e; // 0x47a(0x01)
	char pad_47B[0x5]; // 0x47b(0x05)
	struct TArray<struct U*4db1074e02*> *214f2ca053; // 0x480(0x10)
	struct TArray<bool> *0c32417dff; // 0x490(0x10)
	float *4fc9abec22; // 0x4a0(0x04)
	float *6de9a27795; // 0x4a4(0x04)

	void HandleRotateTabLeft(); // Function TslGame.*955449aaf4.HandleRotateTabLeft // Final|Native|Protected // @ game+0x590c120
	void HandleTabRotated(); // Function TslGame.*955449aaf4.HandleTabRotated // Final|Native|Protected // @ game+0x590c1e0
	void HandleBackButtonClicked(); // Function TslGame.*955449aaf4.HandleBackButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x590b98c
	void HandleScroll(); // Function TslGame.*955449aaf4.HandleScroll // Final|Native|Protected // @ game+0x590c148
	void HandleQuickScrollingDown(); // Function TslGame.*955449aaf4.HandleQuickScrollingDown // Final|Native|Protected // @ game+0x590c0f8
	void HandleQuickScrollingUp(); // Function TslGame.*955449aaf4.HandleQuickScrollingUp // Final|Native|Protected // @ game+0x590c10c
	void HandleNewMatchLogAdded(); // Function TslGame.*955449aaf4.HandleNewMatchLogAdded // Final|Native|Protected // @ game+0x590ba34
	void HandleRotateTabRight(); // Function TslGame.*955449aaf4.HandleRotateTabRight // Final|Native|Protected // @ game+0x590c134
};

// Class TslGame.*eb3fb19996
// Size: 0x470 (Inherited: 0x418)
struct U*eb3fb19996 : U*eb79fdee2a {
	char pad_418[0x18]; // 0x418(0x18)
	struct F*471718b397 *d7fd973682; // 0x430(0x20)
	struct F*471718b397 *b3a0692348; // 0x450(0x20)
};

// Class TslGame.*ebece7d30c
// Size: 0x548 (Inherited: 0x418)
struct U*ebece7d30c : U*eb79fdee2a {
	struct UClass* PlayerInfoWidgetTemplate; // 0x418(0x08)
	struct F*cd4c9d7cc4 *9d4de09324; // 0x420(0x28)
	struct F*471718b397 *0666aa9f95; // 0x448(0x20)
	struct F*471718b397 *4b59261f2b; // 0x468(0x20)
	struct F*471718b397 *1586e2eecf; // 0x488(0x20)
	struct F*471718b397 *288550943b; // 0x4a8(0x20)
	struct F*0f89a77c6d *d99725e6da; // 0x4c8(0x20)
	struct F*03af4cd0fb *8d816c8b25; // 0x4e8(0x20)
	struct F*03af4cd0fb *09b09c482b; // 0x508(0x20)
	char pad_528[0x8]; // 0x528(0x08)
	struct TArray<struct U*eb3fb19996*> *ea197bde74; // 0x530(0x10)
	char pad_540[0x8]; // 0x540(0x08)

	void *b1dfcca1d6(); // Function TslGame.*ebece7d30c.*b1dfcca1d6 // Final|Native|Protected // @ game+0x5916188
};

// Class TslGame.TslMediaPlayerWidget
// Size: 0x460 (Inherited: 0x418)
struct UTslMediaPlayerWidget : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct UMediaPlayer* MediaPlayer; // 0x420(0x08)
	struct UPlatformMediaSource* *ff47d0e8f4; // 0x428(0x08)
	struct UAkAudioEvent* *031360cb2c; // 0x430(0x08)
	struct UAkAudioEvent* *7e83fd1bc2; // 0x438(0x08)
	bool *69b8ba0e1a; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct USizeBox* VideoSizeBox; // 0x448(0x08)
	struct UAkComponent* *19159c0c8f; // 0x450(0x08)
	char pad_458[0x8]; // 0x458(0x08)

	void OnSkipVideoPressed(); // Function TslGame.TslMediaPlayerWidget.OnSkipVideoPressed // Final|Native|Protected // @ game+0x59155f4
	void OnVideoEnded(); // Function TslGame.TslMediaPlayerWidget.OnVideoEnded // Final|Native|Public // @ game+0x59176c8
};

// Class TslGame.*2d62daf26a
// Size: 0x568 (Inherited: 0x418)
struct U*2d62daf26a : U*eb79fdee2a {
	struct TArray<struct F*9333421ac1> *064000f26f; // 0x418(0x10)
	struct F*6351b5e701 *9735153fbf; // 0x428(0x20)
	struct F*6351b5e701 *93015cb26b; // 0x448(0x20)
	struct F*6351b5e701 *ae3e7648f9; // 0x468(0x20)
	struct F*6351b5e701 *a9168e86d1; // 0x488(0x20)
	struct F*6351b5e701 *cf61c4804e; // 0x4a8(0x20)
	struct F*6351b5e701 *5221b8be5b; // 0x4c8(0x20)
	struct F*6351b5e701 *a11986e2d5; // 0x4e8(0x20)
	struct F*6351b5e701 *a923c772db; // 0x508(0x20)
	struct F*6351b5e701 *53b3ea911e; // 0x528(0x20)
	struct U*bd5a2cbd9c* PubgIdWidget; // 0x548(0x08)
	float PubgIdLifeTime; // 0x550(0x04)
	char pad_554[0x4]; // 0x554(0x04)
	struct UStringTable* UIStringTable; // 0x558(0x08)
	char pad_560[0x8]; // 0x560(0x08)

	void CreateGamePlayMessage(); // Function TslGame.*2d62daf26a.CreateGamePlayMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x21d2c4
	void *55249bd2da(); // Function TslGame.*2d62daf26a.*55249bd2da // Final|Native|Private|HasOutParms // @ game+0x5909fc0
	void CreateSystemMessage(); // Function TslGame.*2d62daf26a.CreateSystemMessage // Event|Public|HasOutParms|BlueprintEvent // @ game+0x21d2c4
	void *166c33f8ae(); // Function TslGame.*2d62daf26a.*166c33f8ae // Final|Native|Private // @ game+0x5909ebc
	void UpdatePubgIdWidgetWithKiller(); // Function TslGame.*2d62daf26a.UpdatePubgIdWidgetWithKiller // Final|Native|Private // @ game+0xb30ff8
	void *ac070f483a(); // Function TslGame.*2d62daf26a.*ac070f483a // Final|Native|Private // @ game+0x590b604
	void OnDisplayMessage(); // Function TslGame.*2d62daf26a.OnDisplayMessage // Final|Native|Private // @ game+0x93a3f0
	void *0c44ddb707(); // Function TslGame.*2d62daf26a.*0c44ddb707 // Final|Native|Private // @ game+0x59105d0
	void HidePubgIdWidget(); // Function TslGame.*2d62daf26a.HidePubgIdWidget // Final|Native|Public // @ game+0x590c2b0
	void *bda8809545(); // Function TslGame.*2d62daf26a.*bda8809545 // Final|Native|Private // @ game+0x590c6c8
	void *e11c2923ae(); // Function TslGame.*2d62daf26a.*e11c2923ae // Final|Native|Private // @ game+0x5911fbc
	void *e6de187366(); // Function TslGame.*2d62daf26a.*e6de187366 // Final|Native|Private|HasOutParms // @ game+0x59194c0
	void CreateVoiceChannelStateMessage(); // Function TslGame.*2d62daf26a.CreateVoiceChannelStateMessage // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void *54521112cb(); // Function TslGame.*2d62daf26a.*54521112cb // Final|Native|Private // @ game+0x591903c
	void OnDisplayVoiceChannelStateMessage(); // Function TslGame.*2d62daf26a.OnDisplayVoiceChannelStateMessage // Final|Native|Private // @ game+0x5910744
};

// Class TslGame.*aa3fdd87c6
// Size: 0x458 (Inherited: 0x418)
struct U*aa3fdd87c6 : U*eb79fdee2a {
	struct FString Name; // 0x418(0x10)
	int32 Level; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FString EmblemId; // 0x430(0x10)
	struct FString NameplateId; // 0x440(0x10)
	enum class EOutGamePlatformProvider Platform; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class TslGame.*90cc3e99e8
// Size: 0x5b0 (Inherited: 0x418)
struct U*90cc3e99e8 : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*cd4c9d7cc4 MissionItemVerticalBox_Binder; // 0x420(0x28)
	struct F*471718b397 MissionGroupText_Binder; // 0x448(0x20)
	struct F*7935e10e39 ProgressImage_Binder; // 0x468(0x28)
	struct F*471718b397 ProgressText_Binder; // 0x490(0x20)
	struct F*03af4cd0fb LockWidgetAnimation_Binder; // 0x4b0(0x20)
	struct F*07222da915 LockBorder_Binder; // 0x4d0(0x30)
	struct F*07222da915 ButtonBorder_Binder; // 0x500(0x30)
	struct F*7935e10e39 ExpandImage_Binder; // 0x530(0x28)
	struct F*334c0e7a9a WidgetBody_Binder; // 0x558(0x28)
	struct UTexture2D* ExpandTexture; // 0x580(0x08)
	struct UTexture2D* CollapsTexture; // 0x588(0x08)
	char pad_590[0x8]; // 0x590(0x08)
	struct U*917dfbfd61* *b53a44cd1d; // 0x598(0x08)
	struct FMulticastDelegate OnExpanded; // 0x5a0(0x10)

	void *dec2164c65(); // Function TslGame.*90cc3e99e8.*dec2164c65 // Final|Native|Public // @ game+0x590aed4
	void OnButtonDown(); // Function TslGame.*90cc3e99e8.OnButtonDown // Final|Native|Private|HasOutParms // @ game+0x590f224
	void UpdateDesign_Normal(); // Function TslGame.*90cc3e99e8.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void UpdateDesign_Focused(); // Function TslGame.*90cc3e99e8.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void NotifyWidgetInputA(); // Function TslGame.*90cc3e99e8.NotifyWidgetInputA // Final|Native|Public|BlueprintCallable // @ game+0x590e4e0
	void *c54926c674(); // Function TslGame.*90cc3e99e8.*c54926c674 // Final|Native|Public // @ game+0x590aea8
};

// Class TslGame.*052e4b481c
// Size: 0x568 (Inherited: 0x418)
struct U*052e4b481c : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	struct UTextBlock* DescriptionText; // 0x428(0x08)
	struct UTextBlock* ProgressText; // 0x430(0x08)
	struct UImage* IconImage; // 0x438(0x08)
	struct UImage* StateImage; // 0x440(0x08)
	struct UImage* ProgressBarImage; // 0x448(0x08)
	struct UBorder* InfoBorder; // 0x450(0x08)
	struct UBorder* ProgressBarBorder; // 0x458(0x08)
	struct UBorder* MissionListBorder; // 0x460(0x08)
	struct TMap<struct FString, struct UTexture2D*> MissionIcons; // 0x468(0x50)
	struct UTexture2D* DefaultMissionIcon; // 0x4b8(0x08)
	struct UTexture2D* LockTexture; // 0x4c0(0x08)
	struct UTexture2D* CompleteTexture; // 0x4c8(0x08)
	float InactiveIconAlpha; // 0x4d0(0x04)
	float ActiveIconAlpha; // 0x4d4(0x04)
	float InactiveTextAlpha; // 0x4d8(0x04)
	float InactiveProgressBarBorderAlpha; // 0x4dc(0x04)
	int32 FontSizeForPC; // 0x4e0(0x04)
	int32 FontSizeForConsole; // 0x4e4(0x04)
	struct FLinearColor ActiveInfoBorderColor; // 0x4e8(0x10)
	struct FLinearColor AchievedInfoBorderColor; // 0x4f8(0x10)
	struct FLinearColor ActiveMissionBorderColor; // 0x508(0x10)
	struct FLinearColor AchievedMissionBorderColor; // 0x518(0x10)
	struct FName ScalarParamNameFirstEnd; // 0x528(0x08)
	struct FName ScalarParamNameSecondEnd; // 0x530(0x08)
	struct FString MissionId; // 0x538(0x10)
	struct FString MissionType; // 0x548(0x10)
	char pad_558[0x8]; // 0x558(0x08)
	struct U*917dfbfd61* *b53a44cd1d; // 0x560(0x08)

	void UpdateDesign_Focused(); // Function TslGame.*052e4b481c.UpdateDesign_Focused // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void UpdateDesign_Normal(); // Function TslGame.*052e4b481c.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*da75ff3191
// Size: 0x450 (Inherited: 0x418)
struct U*da75ff3191 : U*eb79fdee2a {
	char pad_418[0x20]; // 0x418(0x20)
	struct UMaterialInstanceDynamic* *c461142f8b; // 0x438(0x08)
	struct UImage* HpImage; // 0x440(0x08)
	float *87f73202a8; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
};

// Class TslGame.*b01c481f96
// Size: 0x470 (Inherited: 0x418)
struct U*b01c481f96 : U*eb79fdee2a {
	struct F*0c169a22f8 KeysPanel_Binder; // 0x418(0x20)
	struct F*7935e10e39 MiddleMouseButton_Binder; // 0x438(0x28)
	struct TArray<struct FString> MiddleMouseButtonActionsOrAxies; // 0x460(0x10)
};

// Class TslGame.*132670e04f
// Size: 0x4b0 (Inherited: 0x418)
struct U*132670e04f : U*eb79fdee2a {
	struct F*7935e10e39 *5aa3174e74; // 0x418(0x28)
	struct F*471718b397 *72da595071; // 0x440(0x20)
	struct F*8e4dc0564e *de931c067e; // 0x460(0x28)
	struct FVector2D *e693c9141f; // 0x488(0x08)
	struct UMaterialInstanceDynamic* *86586afb97; // 0x490(0x08)
	struct U*fc3a6c0744* CastingBarInfoText; // 0x498(0x08)
	char pad_4A0[0x10]; // 0x4a0(0x10)
};

// Class TslGame.*5a1844701a
// Size: 0x4f8 (Inherited: 0x418)
struct U*5a1844701a : U*eb79fdee2a {
	enum class EVerticalAlignment *0466d5a3c8; // 0x418(0x01)
	char pad_419[0x3]; // 0x419(0x03)
	int32 *93a1cc0b17; // 0x41c(0x04)
	bool *caf0588571; // 0x420(0x01)
	bool *da5779b81d; // 0x421(0x01)
	char pad_422[0x6]; // 0x422(0x06)
	struct UCurveFloat* *322e37e79b; // 0x428(0x08)
	struct FVector2D BorderSize; // 0x430(0x08)
	bool *205dcab0c2; // 0x438(0x01)
	bool *b43175931e; // 0x439(0x01)
	char pad_43A[0x6]; // 0x43a(0x06)
	struct TArray<struct U*9a37980126*> *271a4cdfbe; // 0x440(0x10)
	struct U*9a37980126* *bf24b24281; // 0x450(0x08)
	struct F*6351b5e701 *78983c7658; // 0x458(0x20)
	struct F*6351b5e701 *02c20db215; // 0x478(0x20)
	struct F*6351b5e701 *0b619dab32; // 0x498(0x20)
	struct FVector2D *48474f2310; // 0x4b8(0x08)
	struct TArray<struct FVector2D> *3ed9c312ed; // 0x4c0(0x10)
	float *c6451bb697; // 0x4d0(0x04)
	struct FVector2D *d927ed3e65; // 0x4d4(0x08)
	struct FVector2D *9228dd6e06; // 0x4dc(0x08)
	struct FVector2D *171cab2e08; // 0x4e4(0x08)
	float *cb3861d991; // 0x4ec(0x04)
	int32 Count; // 0x4f0(0x04)
	bool *99d2b60f2b; // 0x4f4(0x01)
	char pad_4F5[0x3]; // 0x4f5(0x03)

	void *e41d4a09b0(); // Function TslGame.*5a1844701a.*e41d4a09b0 // Final|Native|Public // @ game+0x5908218
	void OnRemoveMessage(); // Function TslGame.*5a1844701a.OnRemoveMessage // Final|Native|Public // @ game+0xc08834
	void *b70e72e1eb(); // Function TslGame.*5a1844701a.*b70e72e1eb // Final|Native|Protected // @ game+0x590c8b4
	void *efd2b24285(); // Function TslGame.*5a1844701a.*efd2b24285 // Final|Native|Protected // @ game+0x590cee8
	void SetSizeRule(); // Function TslGame.*5a1844701a.SetSizeRule // Final|Native|Protected // @ game+0x591f6c0
	void *b02b8c310c(); // Function TslGame.*5a1844701a.*b02b8c310c // Final|Native|Protected // @ game+0x590ae84
	void *b5f9e4d7a7(); // Function TslGame.*5a1844701a.*b5f9e4d7a7 // Final|Native|Public // @ game+0x590c270
	void *ee75a60165(); // Function TslGame.*5a1844701a.*ee75a60165 // Final|Native|Public // @ game+0x5921c2c
	void *ebe48db43a(); // Function TslGame.*5a1844701a.*ebe48db43a // Final|Native|Protected // @ game+0x5921e78
};

// Class TslGame.*80c87c06de
// Size: 0x4f8 (Inherited: 0x4f8)
struct U*80c87c06de : U*5a1844701a {
};

// Class TslGame.*9a37980126
// Size: 0x478 (Inherited: 0x418)
struct U*9a37980126 : U*eb79fdee2a {
	struct FText Message; // 0x418(0x18)
	float Duration; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UAkAudioEvent* Sound; // 0x438(0x08)
	struct FMulticastDelegate EndMessage; // 0x440(0x10)
	bool bUsed; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
	struct F*b2f5f3e08e *102fd867eb; // 0x458(0x08)
	struct UTextBlock* MessageTextBlock; // 0x460(0x08)
	struct U*3335e92189* Anim_FadeIn; // 0x468(0x08)
	struct U*3335e92189* Anim_FadeOut; // 0x470(0x08)

	void OnFadeOutFinished(); // Function TslGame.*9a37980126.OnFadeOutFinished // Final|Native|Public // @ game+0xcb294c
	void OnFadeInFinished(); // Function TslGame.*9a37980126.OnFadeInFinished // Final|Native|Public // @ game+0x87fe20
	void StartFadeOut(); // Function TslGame.*9a37980126.StartFadeOut // Final|Native|Public // @ game+0xc25d50
};

// Class TslGame.*e1c5fbd011
// Size: 0x470 (Inherited: 0x418)
struct U*e1c5fbd011 : U*eb79fdee2a {
	struct U*362c113e89* TeamManagement; // 0x418(0x08)
	struct U*3915dc3268* TeamManagementPopup; // 0x420(0x08)
	struct U*7bbc92c60f* SystemMenu; // 0x428(0x08)
	struct U*cbe030de8f* ReportPlayerWidget; // 0x430(0x08)
	struct TArray<struct ATeam*> *f809cf9fe9; // 0x438(0x10)
	char pad_448[0x18]; // 0x448(0x18)
	struct U*92eaeb68ac* MissionList; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	void OnReport(); // Function TslGame.*e1c5fbd011.OnReport // Final|Native|Public // @ game+0x5914c20
	void OnSuccessfullyReportPlayer(); // Function TslGame.*e1c5fbd011.OnSuccessfullyReportPlayer // Final|Native|Public // @ game+0x5915f78
	void InitBinding(); // Function TslGame.*e1c5fbd011.InitBinding // Final|Native|Public|BlueprintCallable // @ game+0x590c3fc
	void OnNotifyReportTeamMember(); // Function TslGame.*e1c5fbd011.OnNotifyReportTeamMember // Event|Protected|BlueprintEvent // @ game+0x21d2c4
	void *7e066b1233(); // Function TslGame.*e1c5fbd011.*7e066b1233 // Final|Native|Protected // @ game+0x590aca0
};

// Class TslGame.*3b4b8309be
// Size: 0x4f0 (Inherited: 0x418)
struct U*3b4b8309be : U*eb79fdee2a {
	struct UBorder* BorderNotificationMessage; // 0x418(0x08)
	struct UImage* ImageIcon; // 0x420(0x08)
	struct UWidgetSwitcher* SwitcherMessage; // 0x428(0x08)
	struct UTextBlock* TextMessage; // 0x430(0x08)
	struct UTslRichTextBlock* RichTextMessage; // 0x438(0x08)
	struct U*3335e92189* AnimAppear; // 0x440(0x08)
	struct U*3335e92189* AnimAppearLoop; // 0x448(0x08)
	struct U*3335e92189* AnimDisappear; // 0x450(0x08)
	struct UDataTable* NotificationMessageTable; // 0x458(0x08)
	struct TMap<enum class ETslNotificationMessageColorType, struct FSlateColor> *c7301f8f4d; // 0x460(0x50)
	struct F*2edf616f74 *f80bb71a4c; // 0x4b0(0x38)
	char pad_4E8[0x8]; // 0x4e8(0x08)
};

// Class TslGame.*887aeec8d7
// Size: 0x500 (Inherited: 0x418)
struct U*887aeec8d7 : U*eb79fdee2a {
	struct F*03af4cd0fb LastTeamsAnimBinder; // 0x418(0x20)
	struct F*03af4cd0fb LastTeamsSkipAnimBinder; // 0x438(0x20)
	struct F*03af4cd0fb LastTeamsInitAnimBinder; // 0x458(0x20)
	struct TArray<struct F*0f89a77c6d> PlayerIconWidgetBinders; // 0x478(0x10)
	struct TArray<struct F*0f89a77c6d> LastTeamInfoWidgetBinders; // 0x488(0x10)
	struct TMap<int32, struct U*08552a251c*> *60a8d62bd5; // 0x498(0x50)
	struct U*ea30b81fd7* *6c5e2c4d34; // 0x4e8(0x08)
	char pad_4F0[0x10]; // 0x4f0(0x10)

	void OnInitLastTeams(); // Function TslGame.*887aeec8d7.OnInitLastTeams // Final|Native|Public // @ game+0x59117f8
	void UpdateCurrentAliveCount(); // Function TslGame.*887aeec8d7.UpdateCurrentAliveCount // Final|Native|Public // @ game+0x592159c
};

// Class TslGame.*08552a251c
// Size: 0x5a8 (Inherited: 0x418)
struct U*08552a251c : U*eb79fdee2a {
	struct TArray<struct F*7935e10e39> PlayerImageWidgetBinders; // 0x418(0x10)
	struct F*7935e10e39 BGImageWidgetBinder; // 0x428(0x28)
	struct F*7935e10e39 PatternImageWidgetBinder; // 0x450(0x28)
	struct F*471718b397 NameTextWidgetBinder; // 0x478(0x20)
	struct F*07222da915 LogoBorderWidgetBinder; // 0x498(0x30)
	struct F*89ccd1e174 LogoSwitcherWidgetBinder; // 0x4c8(0x28)
	struct F*7935e10e39 TeamIconImageWidgetBinder; // 0x4f0(0x28)
	struct F*03af4cd0fb EndAnimBinder; // 0x518(0x20)
	struct FLinearColor BGImageDimColor; // 0x538(0x10)
	struct FLinearColor NameTextNormalColor; // 0x548(0x10)
	struct FLinearColor NameTextDimColor; // 0x558(0x10)
	struct FLinearColor PlayerNormalColor; // 0x568(0x10)
	struct FLinearColor PlayerGroggyColor; // 0x578(0x10)
	struct FLinearColor PlayerDieColor; // 0x588(0x10)
	char pad_598[0x10]; // 0x598(0x10)
};

// Class TslGame.*3bd0cbb98b
// Size: 0x440 (Inherited: 0x418)
struct U*3bd0cbb98b : U*eb79fdee2a {
	struct F*89ccd1e174 PlayerStateIconsSwitcherBinder; // 0x418(0x28)
};

// Class TslGame.*276511c21b
// Size: 0x4b0 (Inherited: 0x418)
struct U*276511c21b : U*eb79fdee2a {
	struct F*07222da915 LogoBorderWidgetBinder; // 0x418(0x30)
	struct F*0c169a22f8 LogoPanelWidgetBinder; // 0x448(0x20)
	struct F*7935e10e39 LastTeamPatternWidgetBinder; // 0x468(0x28)
	struct F*471718b397 LastTeamTextWidgetBinder; // 0x490(0x20)
};

// Class TslGame.*077d8ab529
// Size: 0x428 (Inherited: 0x418)
struct U*077d8ab529 : U*eb79fdee2a {
	struct U*ea30b81fd7* Manager; // 0x418(0x08)
	struct U*ff4e3d7a7a* PlatformImage; // 0x420(0x08)
};

// Class TslGame.*10bf26f08f
// Size: 0x630 (Inherited: 0x428)
struct U*10bf26f08f : U*077d8ab529 {
	struct F*89ccd1e174 *b9f4896e7f; // 0x428(0x28)
	struct F*89ccd1e174 *376b1809aa; // 0x450(0x28)
	struct F*03af4cd0fb *d0f913e451; // 0x478(0x20)
	struct F*0f89a77c6d *abbfb7d8e7; // 0x498(0x20)
	struct F*0f89a77c6d *0bccc49e9d; // 0x4b8(0x20)
	struct F*471718b397 *b74f9c43f3; // 0x4d8(0x20)
	struct F*471718b397 *10cda11edc; // 0x4f8(0x20)
	struct F*03af4cd0fb *c750bd118b; // 0x518(0x20)
	struct F*0f89a77c6d *fb26a16139; // 0x538(0x20)
	struct F*0f89a77c6d *80cb951eb3; // 0x558(0x20)
	struct F*0f89a77c6d *e5f7464d61; // 0x578(0x20)
	struct F*0f89a77c6d *a2de012851; // 0x598(0x20)
	struct F*471718b397 *f198c33b6a; // 0x5b8(0x20)
	struct F*471718b397 *1cb7d70ccc; // 0x5d8(0x20)
	struct F*471718b397 *2c38a5a5b0; // 0x5f8(0x20)
	struct UAkAudioEvent* *86ea34a67e; // 0x618(0x08)
	char pad_620[0x10]; // 0x620(0x10)

	void *47569ea118(); // Function TslGame.*10bf26f08f.*47569ea118 // Final|Native|Private // @ game+0x590cdac
};

// Class TslGame.*ea30b81fd7
// Size: 0x478 (Inherited: 0x418)
struct U*ea30b81fd7 : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	struct F*07222da915 *4a30806d97; // 0x428(0x30)
	struct UClass* *5575f34a44; // 0x458(0x08)
	struct UClass* *ff467e3ad4; // 0x460(0x08)
	struct U*077d8ab529* CurrAnimWidget; // 0x468(0x08)
	struct U*887aeec8d7* *887aeec8d7; // 0x470(0x08)

	void Dequeue(); // Function TslGame.*ea30b81fd7.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x5909e0c
	void IsEmpty(); // Function TslGame.*ea30b81fd7.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c81c
	void Clear(); // Function TslGame.*ea30b81fd7.Clear // Final|Native|Public|BlueprintCallable // @ game+0x5908240
	void IsBusy(); // Function TslGame.*ea30b81fd7.IsBusy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c7e4
	void OnPersonalKillingSpree(); // Function TslGame.*ea30b81fd7.OnPersonalKillingSpree // Final|Native|Protected // @ game+0x5913ea0
	void Peek(); // Function TslGame.*ea30b81fd7.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x591898c
	void NumElems(); // Function TslGame.*ea30b81fd7.NumElems // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590e52c
	void Enqueue(); // Function TslGame.*ea30b81fd7.Enqueue // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x590a230
	void OnTeamKillingSpree(); // Function TslGame.*ea30b81fd7.OnTeamKillingSpree // Final|Native|Protected // @ game+0x591619c
	void OnCurrAnimFinish(); // Function TslGame.*ea30b81fd7.OnCurrAnimFinish // Final|Native|Public|BlueprintCallable // @ game+0x590ffe0
	void ProcData(); // Function TslGame.*ea30b81fd7.ProcData // Final|Native|Public|BlueprintCallable // @ game+0x5918f28
	void OnTeamWipeOut(); // Function TslGame.*ea30b81fd7.OnTeamWipeOut // Final|Native|Protected // @ game+0x591631c
};

// Class TslGame.*07169f9072
// Size: 0x518 (Inherited: 0x428)
struct U*07169f9072 : U*077d8ab529 {
	struct F*0f89a77c6d *715d4ab257; // 0x428(0x20)
	struct F*0f89a77c6d *e200b015bc; // 0x448(0x20)
	struct F*0f89a77c6d *9c2cf8182d; // 0x468(0x20)
	struct F*0f89a77c6d *eaca57a828; // 0x488(0x20)
	struct F*471718b397 *3e48d10341; // 0x4a8(0x20)
	struct F*471718b397 *2d99d312c7; // 0x4c8(0x20)
	struct F*03af4cd0fb *84cefcbb22; // 0x4e8(0x20)
	struct UAkAudioEvent* *3220c302e6; // 0x508(0x08)
	char pad_510[0x8]; // 0x510(0x08)

	void *cdd7a9f285(); // Function TslGame.*07169f9072.*cdd7a9f285 // Final|Native|Protected // @ game+0x590cdac
};

// Class TslGame.*e238094161
// Size: 0x620 (Inherited: 0x428)
struct U*e238094161 : U*077d8ab529 {
	struct F*471718b397 *10cda11edc; // 0x428(0x20)
	struct F*471718b397 *1cb7d70ccc; // 0x448(0x20)
	struct F*89ccd1e174 *11c46e0725; // 0x468(0x28)
	struct F*0f89a77c6d *15206b10a8; // 0x490(0x20)
	struct F*7935e10e39 *3073bc33c6; // 0x4b0(0x28)
	struct F*471718b397 *8f7119db80; // 0x4d8(0x20)
	struct F*7935e10e39 *04d1d4a043; // 0x4f8(0x28)
	struct F*471718b397 *2b739156f2; // 0x520(0x20)
	struct F*7935e10e39 *21eeabfcb1; // 0x540(0x28)
	struct UTexture2D* KillingSpreeTexture; // 0x568(0x08)
	struct UTexture2D* DominatingTexture; // 0x570(0x08)
	struct F*03af4cd0fb AssistAnimBinder; // 0x578(0x20)
	struct F*03af4cd0fb FirstKillAnimBinder; // 0x598(0x20)
	struct F*03af4cd0fb ThirdKillAnimBinder; // 0x5b8(0x20)
	struct F*03af4cd0fb FifthKillAnimBinder; // 0x5d8(0x20)
	struct F*03af4cd0fb OverKillAnimBinder; // 0x5f8(0x20)
	struct UAkAudioEvent* ObserverTotalKillSound; // 0x618(0x08)
};

// Class TslGame.*57271290fc
// Size: 0x460 (Inherited: 0x418)
struct U*57271290fc : U*eb79fdee2a {
	struct UClass* TeamInfoWidgetTemplate; // 0x418(0x08)
	struct TArray<struct U*ebece7d30c*> *04d1545e8b; // 0x420(0x10)
	float *f581bc8f29; // 0x430(0x04)
	float *4b693566b9; // 0x434(0x04)
	struct F*c204d7664a *11afb3a5ca; // 0x438(0x28)
};

// Class TslGame.*7126ed3ed8
// Size: 0x498 (Inherited: 0x418)
struct U*7126ed3ed8 : U*eb79fdee2a {
	struct F*0f89a77c6d *5ab4c2a0ca; // 0x418(0x20)
	struct F*0f89a77c6d *50013b50af; // 0x438(0x20)
	struct F*0f89a77c6d *b290cb39d5; // 0x458(0x20)
	struct F*03af4cd0fb *3326622310; // 0x478(0x20)
};

// Class TslGame.*45941ee68a
// Size: 0x4f0 (Inherited: 0x418)
struct U*45941ee68a : U*eb79fdee2a {
	struct F*471718b397 *ba915e9abf; // 0x418(0x20)
	struct F*471718b397 *0d64811e37; // 0x438(0x20)
	struct F*471718b397 *91ad432699; // 0x458(0x20)
	struct F*7935e10e39 *d6f4996c70; // 0x478(0x28)
	struct F*0f89a77c6d *a2de012851; // 0x4a0(0x20)
	struct F*03af4cd0fb *17a8b0da64; // 0x4c0(0x20)
	enum class ELeagueMatchStatistic *ac80a7101b; // 0x4e0(0x01)
	char pad_4E1[0x3]; // 0x4e1(0x03)
	float *aa13dad494; // 0x4e4(0x04)
	char pad_4E8[0x8]; // 0x4e8(0x08)

	void *c401323cef(); // Function TslGame.*45941ee68a.*c401323cef // Final|Native|Private // @ game+0x5915f04
};

// Class TslGame.*b88f564a03
// Size: 0x460 (Inherited: 0x418)
struct U*b88f564a03 : U*eb79fdee2a {
	struct FVector2D *eceaa2fbf0; // 0x418(0x08)
	struct FVector2D *22c3a5f116; // 0x420(0x08)
	struct UWidgetSwitcher* SwitcherPlayerIcon; // 0x428(0x08)
	struct USizeBox* SizeboxPlayerIcon; // 0x430(0x08)
	struct UImage* ImagePlayerIcon; // 0x438(0x08)
	struct USizeBox* SizeboxPlayerNumber; // 0x440(0x08)
	struct UBorder* BorderPlayerNumber; // 0x448(0x08)
	struct UImage* ImagePattern; // 0x450(0x08)
	struct UTextBlock* TextNumber; // 0x458(0x08)

	void UpdatePlayerIcon(); // Function TslGame.*b88f564a03.UpdatePlayerIcon // Final|Native|Public|BlueprintCallable // @ game+0x5921b74
};

// Class TslGame.*72e25ee864
// Size: 0x9e0 (Inherited: 0x418)
struct U*72e25ee864 : U*eb79fdee2a {
	struct UTexture* UnArmedIcon; // 0x418(0x08)
	float UnArmedIconRatio; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct ATslCharacter* *1cdee9d9f7; // 0x428(0x08)
	int32 *25bfa1fded; // 0x430(0x04)
	int32 *ef7a7a160a; // 0x434(0x04)
	int32 *c8727c06f1; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct F*03af4cd0fb AmmoIncreasingAnimBinder; // 0x440(0x20)
	struct F*03af4cd0fb AmmoDecreasingAnimBinder; // 0x460(0x20)
	struct F*471718b397 *c8871c0bf2; // 0x480(0x20)
	struct F*471718b397 *9a3a62bd31; // 0x4a0(0x20)
	struct F*07222da915 *7ab4afdca2; // 0x4c0(0x30)
	struct F*471718b397 *4b59261f2b; // 0x4f0(0x20)
	struct F*07222da915 *171fc77da4; // 0x510(0x30)
	struct F*89ccd1e174 PatternSwitcherBinder; // 0x540(0x28)
	struct F*7935e10e39 *483d9aa3bf; // 0x568(0x28)
	struct F*093563bf09 *c1f386a3bf; // 0x590(0x28)
	struct F*471718b397 *4c660891d8; // 0x5b8(0x20)
	struct F*471718b397 *bee8b970c9; // 0x5d8(0x20)
	struct F*471718b397 *ff3dc40f23; // 0x5f8(0x20)
	struct F*471718b397 *1586e2eecf; // 0x618(0x20)
	struct F*0f89a77c6d *c08ea6636b; // 0x638(0x20)
	struct F*0f89a77c6d *be2f0fdc02; // 0x658(0x20)
	struct F*0f89a77c6d *973df0c1e1; // 0x678(0x20)
	struct F*0f89a77c6d *e14c4f0274; // 0x698(0x20)
	struct F*0f89a77c6d *c36847f7d2; // 0x6b8(0x20)
	struct F*0f89a77c6d *7af2b192f8; // 0x6d8(0x20)
	struct F*0f89a77c6d *abe250567e; // 0x6f8(0x20)
	struct F*0f89a77c6d *d5ea0c5eea; // 0x718(0x20)
	struct F*0f89a77c6d *45336925c0; // 0x738(0x20)
	struct F*7935e10e39 *c0a76f6934; // 0x758(0x28)
	struct UTexture2D* DriverTexture; // 0x780(0x08)
	struct F*7935e10e39 WeaponIconImageBinder; // 0x788(0x28)
	struct F*92d5c0f2ef WeaponIconImageSizeBoxBinder; // 0x7b0(0x28)
	struct F*7935e10e39 SecondWeaponIconImageBinder; // 0x7d8(0x28)
	struct F*92d5c0f2ef SecondWeaponIconImageSizeBoxBinder; // 0x800(0x28)
	struct F*471718b397 MainWeaponName_Binder; // 0x828(0x20)
	struct F*471718b397 MainWeaponEmpty_Binder; // 0x848(0x20)
	struct F*471718b397 SecondWeaponEmpty_Binder; // 0x868(0x20)
	struct FName WeaponIconTextureParmName; // 0x888(0x08)
	struct FName WeaponIconColorParmName; // 0x890(0x08)
	struct FLinearColor WeaponColor_Armed; // 0x898(0x10)
	struct FLinearColor WeaponColor_Normal; // 0x8a8(0x10)
	struct FLinearColor SecondWeaponColor_Normal; // 0x8b8(0x10)
	struct F*6a15aeee08 WeaponColorSet_NoReload; // 0x8c8(0x10)
	struct F*6a15aeee08 SecondWeaponColorSet_NoReload; // 0x8d8(0x10)
	struct TMap<struct FName, struct UTexture2D*> WeaponAttachableTextureMap; // 0x8e8(0x50)
	struct TMap<enum class ECastAnim, struct UTexture2D*> CastableItemTextureMap; // 0x938(0x50)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x988(0x10)
	struct U*ff4e3d7a7a* UserPlatformImageWidget; // 0x998(0x08)
	struct FLinearColor *a6392feb4d; // 0x9a0(0x10)
	struct FLinearColor *bd48ee3bce; // 0x9b0(0x10)
	struct UTexture2D* *ea4aa9358a; // 0x9c0(0x08)
	struct UTexture2D* *8d92b23a44; // 0x9c8(0x08)
	struct UTexture2D* *1e202ccbab; // 0x9d0(0x08)
	char pad_9D8[0x8]; // 0x9d8(0x08)
};

// Class TslGame.TslObserverPlayerListTileInfoWidget
// Size: 0x658 (Inherited: 0x418)
struct UTslObserverPlayerListTileInfoWidget : U*eb79fdee2a {
	char pad_418[0x40]; // 0x418(0x40)
	struct ATslCharacter* Character; // 0x458(0x08)
	struct ATslPlayerState* *9d3374ae0c; // 0x460(0x08)
	struct FLinearColor HighlightedColor; // 0x468(0x10)
	struct FLinearColor ActivatedColor; // 0x478(0x10)
	struct FLinearColor DeactivatedColor; // 0x488(0x10)
	struct U*d426ac14c0* PlayerNameFlowText; // 0x498(0x08)
	struct F*471718b397 TeamName; // 0x4a0(0x20)
	struct F*471718b397 PlayerKillCount; // 0x4c0(0x20)
	struct F*0f89a77c6d LifeGaugeWidgetBinder; // 0x4e0(0x20)
	struct F*6351b5e701 BtnPlayer; // 0x500(0x20)
	struct F*6351b5e701 KickButton_Binder; // 0x520(0x20)
	struct F*6351b5e701 ReportButton_Binder; // 0x540(0x20)
	struct F*92d5c0f2ef TeamTagSizeBox_Binder; // 0x560(0x28)
	struct F*7935e10e39 TeamTagBG_Binder; // 0x588(0x28)
	struct F*7935e10e39 TeamTagColor_Binder; // 0x5b0(0x28)
	struct U*06bdb57ed3* *953233924c; // 0x5d8(0x08)
	struct TArray<struct UTexture2D*> TeamBackgroundTextures; // 0x5e0(0x10)
	struct U*ff4e3d7a7a* UserPlatformImageWidget; // 0x5f0(0x08)
	struct FString *d3d6a1cddb; // 0x5f8(0x10)
	struct FString PlayerName; // 0x608(0x10)
	struct FString *1aadf1eb69; // 0x618(0x10)
	struct FText *680ea51a21; // 0x628(0x18)
	char pad_640[0x18]; // 0x640(0x18)

	void OnKickButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnKickButtonClicked // Final|Native|Private // @ game+0x59118fc
	void OnMouseClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnMouseClicked // Final|Native|Private // @ game+0x5912e68
	void KickPlayer(); // Function TslGame.TslObserverPlayerListTileInfoWidget.KickPlayer // Final|Native|Private // @ game+0x590cb60
	void OnReportButtonClicked(); // Function TslGame.TslObserverPlayerListTileInfoWidget.OnReportButtonClicked // Final|Native|Public // @ game+0x5914d30
};

// Class TslGame.TslObserverPlayerListTileWidget
// Size: 0x588 (Inherited: 0x418)
struct UTslObserverPlayerListTileWidget : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*0c169a22f8 InforPanel; // 0x420(0x20)
	struct F*6351b5e701 TeamRank; // 0x440(0x20)
	struct F*471718b397 TeamRankText; // 0x460(0x20)
	struct F*89ccd1e174 SwitcherTeamLogo; // 0x480(0x28)
	struct F*7935e10e39 TeamImage; // 0x4a8(0x28)
	struct F*7935e10e39 TeamColor; // 0x4d0(0x28)
	struct F*7935e10e39 TeamListColor; // 0x4f8(0x28)
	struct F*471718b397 TeamNum; // 0x520(0x20)
	struct F*471718b397 TeamInfoKill; // 0x540(0x20)
	struct UTexture2D* *1c958ddb4f; // 0x560(0x08)
	char pad_568[0x20]; // 0x568(0x20)

	void UpdateStripeTexture(); // Function TslGame.TslObserverPlayerListTileWidget.UpdateStripeTexture // Event|Protected|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*29fcffc5c0
// Size: 0x428 (Inherited: 0x418)
struct U*29fcffc5c0 : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)

	void Dequeue(); // Function TslGame.*29fcffc5c0.Dequeue // Final|Native|Public|BlueprintCallable // @ game+0x5909e30
	void Enqueue(); // Function TslGame.*29fcffc5c0.Enqueue // Final|Native|Public|BlueprintCallable // @ game+0x590a56c
	void Clear(); // Function TslGame.*29fcffc5c0.Clear // Final|Native|Public|BlueprintCallable // @ game+0x590825c
	void IsEmpty(); // Function TslGame.*29fcffc5c0.IsEmpty // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c81c
	void Peek(); // Function TslGame.*29fcffc5c0.Peek // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x5918a78
	void Find(); // Function TslGame.*29fcffc5c0.Find // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x590a848
};

// Class TslGame.*bb37447acf
// Size: 0x440 (Inherited: 0x418)
struct U*bb37447acf : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	struct UCurveFloat* *fe7cea8328; // 0x428(0x08)
	struct UCurveFloat* *d7ee2263e8; // 0x430(0x08)
	float *f68327bffe; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class TslGame.*1d47610609
// Size: 0x500 (Inherited: 0x440)
struct U*1d47610609 : U*bb37447acf {
	char pad_440[0x8]; // 0x440(0x08)
	struct TArray<struct U*0662214b8a*> Icons; // 0x448(0x10)
	struct TMap<int32, struct UTexture2D*> *4f8ce62d8d; // 0x458(0x50)
	struct UHorizontalBox* IconHorizontalBox; // 0x4a8(0x08)
	struct TMap<int32, struct ATslOPBuff*> *4537111824; // 0x4b0(0x50)
};

// Class TslGame.*cd3a2e7c5b
// Size: 0x478 (Inherited: 0x440)
struct U*cd3a2e7c5b : U*bb37447acf {
	struct TArray<struct FLinearColor> *3e8b2b831a; // 0x440(0x10)
	char pad_450[0x10]; // 0x450(0x10)
	struct UImage* Icon1; // 0x460(0x08)
	struct UImage* Icon2; // 0x468(0x08)
	struct UImage* Icon3; // 0x470(0x08)
};

// Class TslGame.*f8bbd0c319
// Size: 0x4f0 (Inherited: 0x418)
struct U*f8bbd0c319 : U*eb79fdee2a {
	struct F*b2f5f3e08e *08c0440fa3; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)
	struct U*1d47610609* MyBuffWidget; // 0x428(0x08)
	struct UCanvasPanel* BuffHeadManagerCanvasPanel; // 0x430(0x08)
	struct UScaleBox* TPP_Box; // 0x438(0x08)
	struct UScaleBox* FPP_Box; // 0x440(0x08)
	struct UScaleBox* FPPWithMonsterHp_Box; // 0x448(0x08)
	struct UScaleBox* IconBox; // 0x450(0x08)
	struct UClass* *be06fde8c7; // 0x458(0x08)
	struct UClass* *d19e778ca2; // 0x460(0x08)
	struct TMap<struct ATslCharacter*, struct U*bb37447acf*> *41993eea8e; // 0x468(0x50)
	struct TArray<struct U*1d47610609*> *99e1d06c0e; // 0x4b8(0x10)
	struct TArray<struct U*cd3a2e7c5b*> *7c42b01dae; // 0x4c8(0x10)
	float *481a7a4dd3; // 0x4d8(0x04)
	float *e83d3918c9; // 0x4dc(0x04)
	char pad_4E0[0x10]; // 0x4e0(0x10)

	void *c57ec948ab(); // Function TslGame.*f8bbd0c319.*c57ec948ab // Final|Native|Protected // @ game+0x5921b60
	void OnUpdateViewTarget(); // Function TslGame.*f8bbd0c319.OnUpdateViewTarget // Final|Native|Protected // @ game+0x59170a8
};

// Class TslGame.*4102300170
// Size: 0x468 (Inherited: 0x418)
struct U*4102300170 : U*eb79fdee2a {
	struct UCanvasPanel* HeadWidgetManagerCanvasPanel; // 0x418(0x08)
	struct U*6a46a497f9* PointWidget; // 0x420(0x08)
	struct U*6a46a497f9* KillWidget; // 0x428(0x08)
	struct U*6a46a497f9* AliveWidget; // 0x430(0x08)
	struct U*ff84d7d94b* MonsterHpWidget; // 0x438(0x08)
	struct FName *f1ba47f04d; // 0x440(0x08)
	struct UClass* *2cbbc6ac38; // 0x448(0x08)
	struct U*d91cd0745b* *ff911cb1be; // 0x450(0x08)
	char pad_458[0x10]; // 0x458(0x10)

	void UpdateCoin(); // Function TslGame.*4102300170.UpdateCoin // Final|Native|Protected // @ game+0x59213e8
	void OnViewTargetUpdate(); // Function TslGame.*4102300170.OnViewTargetUpdate // Final|Native|Protected // @ game+0x591776c
	void UpdateCoinStackCount(); // Function TslGame.*4102300170.UpdateCoinStackCount // Final|Native|Protected|HasOutParms // @ game+0x5921410
	void *f08fc374db(); // Function TslGame.*4102300170.*f08fc374db // Final|Native|Protected // @ game+0x590e6f4
	void OnKillCountChanged(); // Function TslGame.*4102300170.OnKillCountChanged // Final|Native|Protected // @ game+0x5911910
	void OnOPModeMonsterAttacked(); // Function TslGame.*4102300170.OnOPModeMonsterAttacked // Final|Native|Protected // @ game+0x5913b38
	void OnMatchStarted(); // Function TslGame.*4102300170.OnMatchStarted // Final|Native|Protected // @ game+0x5912308
};

// Class TslGame.*fcf4a3bec3
// Size: 0x418 (Inherited: 0x418)
struct U*fcf4a3bec3 : U*eb79fdee2a {
};

// Class TslGame.*039cfaed73
// Size: 0x428 (Inherited: 0x418)
struct U*039cfaed73 : U*eb79fdee2a {
	struct U*66e91e2adf* ParachuteGaugeWidget; // 0x418(0x08)
	struct U*df5feb7c8d* ParachuteAirSpeedWidget; // 0x420(0x08)
};

// Class TslGame.*0133089b7d
// Size: 0x430 (Inherited: 0x418)
struct U*0133089b7d : U*eb79fdee2a {
	struct USizeBox* FollowGuideSizeBox; // 0x418(0x08)
	struct UWidgetSwitcher* FollowGuideSwitcher; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)
};

// Class TslGame.*66e91e2adf
// Size: 0x468 (Inherited: 0x418)
struct U*66e91e2adf : U*eb79fdee2a {
	struct USizeBox* FreeFallBar; // 0x418(0x08)
	struct USizeBox* ParachuteFallBar; // 0x420(0x08)
	struct USizeBox* GroundHeightBar; // 0x428(0x08)
	struct UTextBlock* AltitudeText; // 0x430(0x08)
	struct U*3335e92189* PositionByPlayerAltitude; // 0x438(0x08)
	float *279a6096fa; // 0x440(0x04)
	struct ATslCharacter* ViewTargetCharacter; // 0x444(0x08)
	char pad_44C[0x1c]; // 0x44c(0x1c)

	void SetSkydiveState(); // Function TslGame.*66e91e2adf.SetSkydiveState // Final|Native|Public // @ game+0x591f844
	void UpdateViewTarget(); // Function TslGame.*66e91e2adf.UpdateViewTarget // Final|Native|Public // @ game+0x925590
};

// Class TslGame.TslPlaneStanceWidget
// Size: 0x458 (Inherited: 0x418)
struct UTslPlaneStanceWidget : U*eb79fdee2a {
	struct ATslCharacter* ViewTargetCharacter; // 0x418(0x08)
	struct UImage* PlaneImage; // 0x420(0x08)
	struct UGridPanel* SeatPanel; // 0x428(0x08)
	struct FName StateParamName; // 0x430(0x08)
	struct UTextBlock* RiderCountText; // 0x438(0x08)
	struct TArray<struct UImage*> *cecf7d01c8; // 0x440(0x10)
	char pad_450[0x8]; // 0x450(0x08)

	void UpdateViewTarget(); // Function TslGame.TslPlaneStanceWidget.UpdateViewTarget // Final|Native|Public // @ game+0x5922184
};

// Class TslGame.TslPlatoonCarePackageDropIndicatorWidget
// Size: 0x420 (Inherited: 0x418)
struct UTslPlatoonCarePackageDropIndicatorWidget : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)

	void BP_UpdateIconImage(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconImage // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void BP_UpdateIconType(); // Function TslGame.TslPlatoonCarePackageDropIndicatorWidget.BP_UpdateIconType // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*f595e62d14
// Size: 0x470 (Inherited: 0x418)
struct U*f595e62d14 : U*eb79fdee2a {
	struct UButton* CommandButton; // 0x418(0x08)
	struct UTslPlatoonCommandWidget* *c6181e343e; // 0x420(0x08)
	struct ATslGameState* *c4fb854b80; // 0x428(0x08)
	struct U*9f8efe6c51* MultipleKeyIconWidget; // 0x430(0x08)
	struct F*093563bf09 *1db5b5e2a7; // 0x438(0x28)
	enum class *0833c21d41 *3df7d6ebd9; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	float *e1bf8095ec; // 0x464(0x04)
	float *2b36bc849e; // 0x468(0x04)
	bool *c1f3cbdae1; // 0x46c(0x01)
	bool *a55393cf42; // 0x46d(0x01)
	bool *49b3b8871a; // 0x46e(0x01)
	char pad_46F[0x1]; // 0x46f(0x01)

	void OnMatchStateChanged(); // Function TslGame.*f595e62d14.OnMatchStateChanged // Final|Native|Public // @ game+0x5912550
	void OnUpdatePlatoonFireSupportState(); // Function TslGame.*f595e62d14.OnUpdatePlatoonFireSupportState // Final|Native|Public|HasOutParms // @ game+0x5916dcc
	void BP_UpdateClickability(); // Function TslGame.*f595e62d14.BP_UpdateClickability // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void BP_UpdateEnablity(); // Function TslGame.*f595e62d14.BP_UpdateEnablity // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void BP_UpdateProgress(); // Function TslGame.*f595e62d14.BP_UpdateProgress // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void BP_UpdateHighlight(); // Function TslGame.*f595e62d14.BP_UpdateHighlight // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void OnButtonClicked(); // Function TslGame.*f595e62d14.OnButtonClicked // Final|Native|Public // @ game+0x590f210
	void OnUpdatePlatoonCarePackageState(); // Function TslGame.*f595e62d14.OnUpdatePlatoonCarePackageState // Final|Native|Public|HasOutParms // @ game+0x5916d18
	void BP_UpdateCommandType(); // Function TslGame.*f595e62d14.BP_UpdateCommandType // Event|Public|HasOutParms|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.TslPlatoonCommandWidget
// Size: 0x490 (Inherited: 0x418)
struct UTslPlatoonCommandWidget : U*eb79fdee2a {
	struct UClass* *5a2df16284; // 0x418(0x08)
	struct U*37728624dd* *1dbab12997; // 0x420(0x08)
	struct U*d76301fdac* ButtonPanel; // 0x428(0x08)
	bool *687a9bbf6e; // 0x430(0x01)
	char pad_431[0x7]; // 0x431(0x07)
	struct TMap<enum class *0833c21d41, struct U*f595e62d14*> *1b1d331965; // 0x438(0x50)
	struct U*f595e62d14* *03cd287c27; // 0x488(0x08)

	void UpdateButtonsByManifest(); // Function TslGame.TslPlatoonCommandWidget.UpdateButtonsByManifest // Final|Native|Public|HasOutParms // @ game+0x5921334
};

// Class TslGame.*e9ac8b0c50
// Size: 0x420 (Inherited: 0x418)
struct U*e9ac8b0c50 : U*eb79fdee2a {
	struct UTextBlock* BindTextDescription; // 0x418(0x08)
};

// Class TslGame.*d2dfb537b6
// Size: 0x500 (Inherited: 0x418)
struct U*d2dfb537b6 : U*eb79fdee2a {
	struct UBorder* BindBorderNumberBg; // 0x418(0x08)
	struct UTextBlock* BindTextNumber; // 0x420(0x08)
	struct U*bd5a2cbd9c* BindWidgetPubgId; // 0x428(0x08)
	struct UWidget* BindWidgetDisable; // 0x430(0x08)
	struct UTextBlock* BindTextDisableText; // 0x438(0x08)
	struct UWidget* BindWidgetSelected; // 0x440(0x08)
	char pad_448[0xb8]; // 0x448(0xb8)
};

// Class TslGame.*cc652c9201
// Size: 0x500 (Inherited: 0x500)
struct U*cc652c9201 : U*d2dfb537b6 {
};

// Class TslGame.*f9a5c42be3
// Size: 0x500 (Inherited: 0x500)
struct U*f9a5c42be3 : U*d2dfb537b6 {
};

// Class TslGame.*176eec0aee
// Size: 0x468 (Inherited: 0x418)
struct U*176eec0aee : U*eb79fdee2a {
	float *af2c86d9dd; // 0x418(0x04)
	char pad_41C[0xc]; // 0x41c(0x0c)
	struct F*03af4cd0fb FadeInAnimation_Binder; // 0x428(0x20)
	struct F*03af4cd0fb FadeOutAnimation_Binder; // 0x448(0x20)
};

// Class TslGame.*abd2722565
// Size: 0x4d0 (Inherited: 0x418)
struct U*abd2722565 : U*eb79fdee2a {
	struct F*03af4cd0fb CountDownAnim_Ready; // 0x418(0x20)
	struct F*03af4cd0fb CountDownAnim_4; // 0x438(0x20)
	struct F*03af4cd0fb CountDownAnim_3; // 0x458(0x20)
	struct F*03af4cd0fb CountDownAnim_2; // 0x478(0x20)
	struct F*03af4cd0fb CountDownAnim_Go; // 0x498(0x20)
	struct UAkAudioEvent* *204041452e; // 0x4b8(0x08)
	struct UAkAudioEvent* *f2f8aaf823; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void CountAnimPlay(); // Function TslGame.*abd2722565.CountAnimPlay // Final|Native|Protected // @ game+0x5909c78
};

// Class TslGame.*b80a47d562
// Size: 0x460 (Inherited: 0x418)
struct U*b80a47d562 : U*eb79fdee2a {
	struct F*471718b397 *f26ce4b927; // 0x418(0x20)
	struct F*7935e10e39 *b5feb81c97; // 0x438(0x28)
};

// Class TslGame.*b50d118a5a
// Size: 0x4d0 (Inherited: 0x460)
struct U*b50d118a5a : U*b80a47d562 {
	struct F*0f89a77c6d UserPlatformImageWidget; // 0x460(0x20)
	struct F*471718b397 *7d982a0b5b; // 0x480(0x20)
	struct F*471718b397 *8f9920ab0f; // 0x4a0(0x20)
	struct FString *16c8c8c7e2; // 0x4c0(0x10)

	void SetUserRankingInformation(); // Function TslGame.*b50d118a5a.SetUserRankingInformation // Final|Native|Public|BlueprintCallable // @ game+0x591fc40
};

// Class TslGame.*57ef815b5b
// Size: 0x4d8 (Inherited: 0x418)
struct U*57ef815b5b : U*eb79fdee2a {
	struct TArray<struct U*b50d118a5a*> *5086384e19; // 0x418(0x10)
	struct UClass* *dbd56946c9; // 0x428(0x08)
	struct F*093563bf09 *3fedb22eec; // 0x430(0x28)
	struct F*093563bf09 *03a1631414; // 0x458(0x28)
	struct F*471718b397 *1c69f98f55; // 0x480(0x20)
	struct F*471718b397 *091e94adab; // 0x4a0(0x20)
	int32 *234f599a7b; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct ATslRacingPlayerState* *07e22bb58f; // 0x4c8(0x08)
	char pad_4D0[0x8]; // 0x4d0(0x08)

	void UpdateRankingList(); // Function TslGame.*57ef815b5b.UpdateRankingList // Final|Native|Public|BlueprintCallable // @ game+0x5921d28
	void OnUpdateViewTarget(); // Function TslGame.*57ef815b5b.OnUpdateViewTarget // Final|Native|Public // @ game+0x5917138
};

// Class TslGame.*9a919f9a75
// Size: 0x4f8 (Inherited: 0x418)
struct U*9a919f9a75 : U*eb79fdee2a {
	struct F*471718b397 *c2b9c78db1; // 0x418(0x20)
	struct F*471718b397 *fd280a7c41; // 0x438(0x20)
	struct F*471718b397 *d7364af379; // 0x458(0x20)
	char pad_478[0x8]; // 0x478(0x08)
	struct F*7935e10e39 *a5c377a90d; // 0x480(0x28)
	int32 *545835c7f3; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)
	struct F*03af4cd0fb CheckPointReachAnim; // 0x4b0(0x20)
	struct F*cd4c9d7cc4 *ccc0da703a; // 0x4d0(0x28)
};

// Class TslGame.*3e606631ed
// Size: 0x560 (Inherited: 0x418)
struct U*3e606631ed : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct FName *7725075984; // 0x420(0x08)
	struct UMaterialInstance* *8a7218d791; // 0x428(0x08)
	float *f1d13f07df; // 0x430(0x04)
	float *5dd3615eb6; // 0x434(0x04)
	struct F*07222da915 *3887bbcaa1; // 0x438(0x30)
	struct UHorizontalBox* HighlightBgHorizontalBox; // 0x468(0x08)
	struct UBorder* HighlightBGBorder; // 0x470(0x08)
	struct UImage* HighlightBgImage; // 0x478(0x08)
	struct UTslRichTextBlock* RichTextBlock; // 0x480(0x08)
	struct UImage* Img_MsgFromOutgameIcon; // 0x488(0x08)
	struct UImage* Img_FocusBg; // 0x490(0x08)
	struct UImage* Img_FocusLine; // 0x498(0x08)
	struct U*3335e92189* FadeInAnim; // 0x4a0(0x08)
	struct U*3335e92189* FadeOutAnim; // 0x4a8(0x08)
	struct U*3335e92189* HighlightAnim; // 0x4b0(0x08)
	struct U*3335e92189* Anim_MsgFromOutgameIconAppear; // 0x4b8(0x08)
	struct FLinearColor *e6ce79fa06; // 0x4c0(0x10)
	struct FSlateFontInfo *ffa5f5bbc6; // 0x4d0(0x68)
	struct U*2e0c470dec* *140e541b42; // 0x538(0x08)
	char pad_540[0x20]; // 0x540(0x20)

	void *d25bfb3cd8(); // Function TslGame.*3e606631ed.*d25bfb3cd8 // Final|Native|Public // @ game+0x5910780
	void *d8d49e868f(); // Function TslGame.*3e606631ed.*d8d49e868f // Final|Native|Public // @ game+0x5910794
};

// Class TslGame.*f86887334f
// Size: 0x4e8 (Inherited: 0x418)
struct U*f86887334f : U*eb79fdee2a {
	struct F*7935e10e39 *94053f797d; // 0x418(0x28)
	struct F*92d5c0f2ef *d2317aca90; // 0x440(0x28)
	struct F*92d5c0f2ef *a2f0d92d22; // 0x468(0x28)
	struct TMap<enum class ERankType, struct F*06ae18bb44> *d7791b26fc; // 0x490(0x50)
	char pad_4E0[0x8]; // 0x4e0(0x08)

	void SetRankEmblemFromRankType(); // Function TslGame.*f86887334f.SetRankEmblemFromRankType // Final|Native|Public|BlueprintCallable // @ game+0x591f4c0
};

// Class TslGame.*93b4e6955c
// Size: 0x418 (Inherited: 0x418)
struct U*93b4e6955c : U*eb79fdee2a {

	void ExportRecoilData(); // Function TslGame.*93b4e6955c.ExportRecoilData // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x590a790
};

// Class TslGame.TslRedeployDebugWidget
// Size: 0x4b8 (Inherited: 0x418)
struct UTslRedeployDebugWidget : U*eb79fdee2a {
	struct UTextBlock* MatchState_ElapsedTimeText; // 0x418(0x08)
	struct UTextBlock* GameState_GatherPhaseText; // 0x420(0x08)
	struct UTextBlock* GameState_FightPhaseText; // 0x428(0x08)
	struct UTextBlock* GameState_MaxPhaseText; // 0x430(0x08)
	struct UTextBlock* GameState_EnableText; // 0x438(0x08)
	struct UTextBlock* GameState_FightingText; // 0x440(0x08)
	struct UTextBlock* GameState_GatherStartText; // 0x448(0x08)
	struct UTextBlock* GameState_GatherEndText; // 0x450(0x08)
	struct UTextBlock* GameState_ReviveText; // 0x458(0x08)
	struct UTextBlock* GameState_FightStartText; // 0x460(0x08)
	struct UTextBlock* GameState_FightEndText; // 0x468(0x08)
	struct UTextBlock* GameState_RedeployText; // 0x470(0x08)
	struct UTextBlock* PlayerState_TargetFightPhaseText; // 0x478(0x08)
	struct UTextBlock* PlayerState_TargetReviveText; // 0x480(0x08)
	struct UTextBlock* PlayerState_CurrentStateText; // 0x488(0x08)
	struct UTextBlock* PlayerState_PreviousStateText; // 0x490(0x08)
	struct UTextBlock* RedeployComp_HideLoadingScreenTimerText; // 0x498(0x08)
	struct UTextBlock* RedeployComp_RedeployAlarmTimerText; // 0x4a0(0x08)
	struct UTextBlock* RedeployComp_RedeployTimerText; // 0x4a8(0x08)
	enum class ETslRedeployPlayerState CurrentState; // 0x4b0(0x01)
	enum class ETslRedeployPlayerState *320575f772; // 0x4b1(0x01)
	char pad_4B2[0x6]; // 0x4b2(0x06)
};

// Class TslGame.*7f7fb97208
// Size: 0x468 (Inherited: 0x418)
struct U*7f7fb97208 : U*eb79fdee2a {
	struct TArray<struct U*3747d9d33b*> *4033cc42ea; // 0x418(0x10)
	float *6b14c988b4; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct UImage* ArrowImage; // 0x430(0x08)
	struct UImage* RunningManImage; // 0x438(0x08)
	struct UImage* BarImage; // 0x440(0x08)
	struct UHorizontalBox* DotsHorizontalBox; // 0x448(0x08)
	struct UTextBlock* DescriptionText; // 0x450(0x08)
	struct UMaterialInstanceDynamic* *ff81137c4a; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)
};

// Class TslGame.*ee31645017
// Size: 0x4b0 (Inherited: 0x418)
struct U*ee31645017 : U*eb79fdee2a {
	struct F*33345791b8 *1388525bed; // 0x418(0x40)
	struct F*33345791b8 *66218f0aa7; // 0x458(0x40)
	struct UVerticalBox* VerticalBox; // 0x498(0x08)
	struct U*107bcdaf4d* *730f777ffe; // 0x4a0(0x08)
	struct U*7f7fb97208* *b856dd460a; // 0x4a8(0x08)
};

// Class TslGame.*107bcdaf4d
// Size: 0x438 (Inherited: 0x418)
struct U*107bcdaf4d : U*eb79fdee2a {
	struct UHorizontalBox* TimerHorBox; // 0x418(0x08)
	struct UImage* Icon; // 0x420(0x08)
	struct UTextBlock* TimeText; // 0x428(0x08)
	struct ATslGameState* GameState; // 0x430(0x08)
};

// Class TslGame.TslReloadingGuideWidget
// Size: 0x510 (Inherited: 0x418)
struct UTslReloadingGuideWidget : U*eb79fdee2a {
	struct F*b2f5f3e08e *0df780950b; // 0x418(0x08)
	struct F*07222da915 *a78ab93bb8; // 0x420(0x30)
	struct U*9f8efe6c51* MultipleKeyIconWidget; // 0x450(0x08)
	struct F*03af4cd0fb *b2841dc79e; // 0x458(0x20)
	struct FName *a7e2812c6e; // 0x478(0x08)
	struct FText *f24f57e232; // 0x480(0x18)
	struct FText *42c532b70b; // 0x498(0x18)
	struct FText *2b2866dbd3; // 0x4b0(0x18)
	char pad_4C8[0x48]; // 0x4c8(0x48)

	void OnReloadPadInput(); // Function TslGame.TslReloadingGuideWidget.OnReloadPadInput // Final|Native|Private // @ game+0xc955b0
	void *d0434f93dc(); // Function TslGame.TslReloadingGuideWidget.*d0434f93dc // Final|Native|Public|Const // @ game+0x59081b8
	void OnNotifyGroggy(); // Function TslGame.TslReloadingGuideWidget.OnNotifyGroggy // Final|Native|Private // @ game+0x59138bc
	void OnCharacterDeath(); // Function TslGame.TslReloadingGuideWidget.OnCharacterDeath // Final|Native|Private // @ game+0xe05880
	void OnInteractionWidgetEnabled(); // Function TslGame.TslReloadingGuideWidget.OnInteractionWidgetEnabled // Final|Native|Private // @ game+0x52c5d8
	void OnCharacterVault(); // Function TslGame.TslReloadingGuideWidget.OnCharacterVault // Final|Native|Private // @ game+0x590fac4
	void UpdatePropertiesFromKeyBinding(); // Function TslGame.TslReloadingGuideWidget.UpdatePropertiesFromKeyBinding // Final|Native|Private // @ game+0x5921c7c
};

// Class TslGame.*53c55b2be1
// Size: 0x428 (Inherited: 0x418)
struct U*53c55b2be1 : U*eb79fdee2a {
	struct U*bd5a2cbd9c* PubgIdWidget; // 0x418(0x08)
	struct U*3335e92189* FadeInAnim; // 0x420(0x08)

	void RefreshPubgIdBySpectator(); // Function TslGame.*53c55b2be1.RefreshPubgIdBySpectator // Final|Native|Protected // @ game+0x5919210
};

// Class TslGame.TslRichTextBlock
// Size: 0x650 (Inherited: 0x418)
struct UTslRichTextBlock : U*eb79fdee2a {
	struct FText *262aff413a; // 0x418(0x18)
	struct TMap<struct FString, struct F*fe626a3bcc> *5ddd1028d1; // 0x430(0x50)
	struct FSlateFontInfo FontInfo; // 0x480(0x68)
	struct FSlateColor *c29e648895; // 0x4e8(0x28)
	struct FVector2D *25654b6d0e; // 0x510(0x08)
	struct FLinearColor *846b8a0bb4; // 0x518(0x10)
	float *06ba1cc24e; // 0x528(0x04)
	bool *4ba287d8f5; // 0x52c(0x01)
	char pad_52D[0x3]; // 0x52d(0x03)
	float *fe62d4d67e; // 0x530(0x04)
	enum class *0dc3e7b6eb *c06c9142d4; // 0x534(0x01)
	bool *6f28003f6f; // 0x535(0x01)
	char pad_536[0x1]; // 0x536(0x01)
	enum class EVerticalAlignment *29a8752087; // 0x537(0x01)
	struct FSlateChildSize *5fd3463e0b; // 0x538(0x08)
	float *4fe26654ac; // 0x540(0x04)
	struct FSlateChildSize *e7b1f4c966; // 0x544(0x08)
	struct FVector2D *823efa28f1; // 0x54c(0x08)
	char pad_554[0x4]; // 0x554(0x04)
	struct UVerticalBox* MainVerticalBox; // 0x558(0x08)
	struct TArray<struct USpacer*> *3d0362a2e3; // 0x560(0x10)
	struct TArray<struct UHorizontalBox*> *782f931e1c; // 0x570(0x10)
	struct TArray<struct UTextBlock*> *4391619b08; // 0x580(0x10)
	struct TArray<struct UImage*> *51f38f1030; // 0x590(0x10)
	struct TArray<struct USizeBox*> *dbfb288d2d; // 0x5a0(0x10)
	struct TArray<struct UOverlay*> *679e22792c; // 0x5b0(0x10)
	struct UHorizontalBox* *3455603ea8; // 0x5c0(0x08)
	char pad_5C8[0x10]; // 0x5c8(0x10)
	struct UClass* KeyIconWidgetClass; // 0x5d8(0x08)
	char pad_5E0[0x18]; // 0x5e0(0x18)
	struct TMap<struct FName, struct F*65c31adf7d> *5d1e12c863; // 0x5f8(0x50)
	char pad_648[0x8]; // 0x648(0x08)

	void UpdateText(); // Function TslGame.TslRichTextBlock.UpdateText // Final|Native|Public|BlueprintCallable // @ game+0x5922094
};

// Class TslGame.*a7585c7c37
// Size: 0x430 (Inherited: 0x418)
struct U*a7585c7c37 : U*eb79fdee2a {
	struct UWidgetSwitcher* SlotWidgetSwitcher; // 0x418(0x08)
	struct U*3335e92189* Anim_Start; // 0x420(0x08)
	enum class ERoundEndPointType *66de5b7bd3; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
};

// Class TslGame.*f0238d6d38
// Size: 0x4b8 (Inherited: 0x418)
struct U*f0238d6d38 : U*eb79fdee2a {
	struct UClass* RoundEndPointClass; // 0x418(0x08)
	float PointWidgetAnimDelayTime; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct FString *423df8d07a; // 0x428(0x10)
	struct FString *5b01f1351b; // 0x438(0x10)
	struct FString *ed02463fcc; // 0x448(0x10)
	struct FString *be6eedbbd0; // 0x458(0x10)
	struct FString *75c8f4a384; // 0x468(0x10)
	struct FString *1972cc84ae; // 0x478(0x10)
	struct FString *2e77a17dec; // 0x488(0x10)
	struct UStringTable* ST_RoundSystem; // 0x498(0x08)
	char pad_4A0[0x18]; // 0x4a0(0x18)

	void *eb4e49715c(); // Function TslGame.*f0238d6d38.*eb4e49715c // Final|Native|Protected // @ game+0x5918c14
	void *0fa0253d22(); // Function TslGame.*f0238d6d38.*0fa0253d22 // Native|Protected // @ game+0x5917d5c
};

// Class TslGame.*35e5a3695b
// Size: 0x4f0 (Inherited: 0x4b8)
struct U*35e5a3695b : U*f0238d6d38 {
	struct UTextBlock* MatchEndText; // 0x4b8(0x08)
	struct UTextBlock* MatchResultText; // 0x4c0(0x08)
	struct UTextBlock* ObserverTeamName; // 0x4c8(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4d0(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4d8(0x08)
	struct U*3335e92189* Victory_Anim; // 0x4e0(0x08)
	struct U*3335e92189* Defeat_Anim; // 0x4e8(0x08)
};

// Class TslGame.*564db54eab
// Size: 0x5b8 (Inherited: 0x4b8)
struct U*564db54eab : U*f0238d6d38 {
	struct UTextBlock* CurrentRoundText; // 0x4b8(0x08)
	struct UTextBlock* CurrentRoundResultText; // 0x4c0(0x08)
	struct UTextBlock* CurrentRoundScoreText; // 0x4c8(0x08)
	struct UTextBlock* YourTeamText; // 0x4d0(0x08)
	struct UTextBlock* EnemyTeamText; // 0x4d8(0x08)
	struct UTextBlock* YourTeamScoreText; // 0x4e0(0x08)
	struct UTextBlock* EnemyTeamScoreText; // 0x4e8(0x08)
	struct U*ff4e3d7a7a* YourTeamPlatformIcon; // 0x4f0(0x08)
	struct U*ff4e3d7a7a* EnemyTeamPlatformIcon; // 0x4f8(0x08)
	struct UHorizontalBox* RoundPointHorizontalBox; // 0x500(0x08)
	struct TArray<struct U*a7585c7c37*> *7631f92b59; // 0x508(0x10)
	struct U*3335e92189* WinEffectAnim; // 0x518(0x08)
	struct U*3335e92189* LossEffectAnim; // 0x520(0x08)
	struct U*3335e92189* DrawEffectAnim; // 0x528(0x08)
	struct F*0c169a22f8 NormalRoundPanel; // 0x530(0x20)
	struct F*0c169a22f8 ZombieDefensePanel; // 0x550(0x20)
	struct F*471718b397 RoundText; // 0x570(0x20)
	struct UStringTable* ZombieDefenseTable; // 0x590(0x08)
	struct UAkAudioEvent* *5f2c5c5b59; // 0x598(0x08)
	struct UAkAudioEvent* *687b7b9328; // 0x5a0(0x08)
	struct U*d48539b74d* PlayerWinningStreak; // 0x5a8(0x08)
	struct U*d48539b74d* EnemyWinningStreak; // 0x5b0(0x08)
};

// Class TslGame.*733ee0ef54
// Size: 0x478 (Inherited: 0x418)
struct U*733ee0ef54 : U*eb79fdee2a {
	struct UTextBlock* RoundNumberText; // 0x418(0x08)
	struct U*3335e92189* RoundStart_Anim; // 0x420(0x08)
	struct UTextBlock* RoundText; // 0x428(0x08)
	struct UStringTable* ZombieDefenseTable; // 0x430(0x08)
	char pad_438[0x40]; // 0x438(0x40)

	void *0fa0253d22(); // Function TslGame.*733ee0ef54.*0fa0253d22 // Final|Native|Protected // @ game+0x5917f64
};

// Class TslGame.*a99918b816
// Size: 0x458 (Inherited: 0x418)
struct U*a99918b816 : U*eb79fdee2a {
	struct UHorizontalBox* YourTeamPointBox; // 0x418(0x08)
	struct UHorizontalBox* EnemyTeamPointBox; // 0x420(0x08)
	struct UClass* RoundEndPointClass; // 0x428(0x08)
	struct TArray<struct U*a7585c7c37*> *4c4eb3ceee; // 0x430(0x10)
	struct TArray<struct U*a7585c7c37*> *1d1c694eeb; // 0x440(0x10)
	char pad_450[0x8]; // 0x450(0x08)

	void UpdatePointList(); // Function TslGame.*a99918b816.UpdatePointList // Final|Native|Protected // @ game+0x5921c18
	void OnMatchStateChanged(); // Function TslGame.*a99918b816.OnMatchStateChanged // Final|Native|Protected // @ game+0x59125e0
	void *0fa0253d22(); // Function TslGame.*a99918b816.*0fa0253d22 // Final|Native|Protected // @ game+0x5918168
};

// Class TslGame.*76768ee98f
// Size: 0x420 (Inherited: 0x418)
struct U*76768ee98f : U*eb79fdee2a {
	struct UWidgetSwitcher* KeyGuideSwitcher; // 0x418(0x08)
};

// Class TslGame.*6fd1d26f94
// Size: 0x468 (Inherited: 0x418)
struct U*6fd1d26f94 : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	struct UTextBlock* TitleTextBlock; // 0x428(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x430(0x08)
	struct UClass* *dc6314b573; // 0x438(0x08)
	enum class ESandboxGroypType *391af44d86; // 0x440(0x01)
	char pad_441[0x27]; // 0x441(0x27)
};

// Class TslGame.*1cd4f26fd0
// Size: 0x470 (Inherited: 0x468)
struct U*1cd4f26fd0 : U*6fd1d26f94 {
	bool *4c781def58; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
};

// Class TslGame.*312dd6898e
// Size: 0x470 (Inherited: 0x468)
struct U*312dd6898e : U*6fd1d26f94 {
	struct UVerticalBox* RootVerticalBox; // 0x468(0x08)
};

// Class TslGame.*e9d4596909
// Size: 0x470 (Inherited: 0x418)
struct U*e9d4596909 : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	bool *ad9aaceb68; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct UTextBlock* ItemTextBlock; // 0x428(0x08)
	struct U*d426ac14c0* ItemTextBlock_Flow; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
	struct FLinearColor *c795edff5e; // 0x440(0x10)
	struct FLinearColor *7d5dd9f1d5; // 0x450(0x10)
	char pad_460[0x10]; // 0x460(0x10)
};

// Class TslGame.*53364a9b5d
// Size: 0x490 (Inherited: 0x470)
struct U*53364a9b5d : U*e9d4596909 {
	char pad_470[0x8]; // 0x470(0x08)
	struct UButton* ItemButton; // 0x478(0x08)
	struct UImage* Img_SelectOutLine; // 0x480(0x08)
	struct UImage* Img_SelectGradientBg; // 0x488(0x08)

	void OnUnhover_Button(); // Function TslGame.*53364a9b5d.OnUnhover_Button // Final|Native|Private // @ game+0x590e34c
	void OnHover_Button(); // Function TslGame.*53364a9b5d.OnHover_Button // Final|Native|Private // @ game+0x5911770
	void OnClick_Button(); // Function TslGame.*53364a9b5d.OnClick_Button // Final|Native|Private // @ game+0x590fad8
};

// Class TslGame.*46c5622238
// Size: 0x4a0 (Inherited: 0x490)
struct U*46c5622238 : U*53364a9b5d {
	enum class ESandboxSpecialButtonType *466d4d9ab0; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)
	struct UImage* ItemIcon_Image; // 0x498(0x08)
};

// Class TslGame.*ed2c2f897f
// Size: 0x4d8 (Inherited: 0x490)
struct U*ed2c2f897f : U*53364a9b5d {
	struct UClass* *dc6314b573; // 0x490(0x08)
	struct UBorder* ItemBorder; // 0x498(0x08)
	struct UVerticalBox* SubWidgetVerticalBox; // 0x4a0(0x08)
	struct UWidgetSwitcher* ExpandSwitcher; // 0x4a8(0x08)
	char pad_4B0[0x28]; // 0x4b0(0x28)
};

// Class TslGame.*775edda765
// Size: 0x4a0 (Inherited: 0x490)
struct U*775edda765 : U*53364a9b5d {
	struct UWidgetSwitcher* ItemWidgetSwitcher; // 0x490(0x08)
	enum class ESandboxPowerType *8d7a713b96; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)

	void *6f4a676abd(); // Function TslGame.*775edda765.*6f4a676abd // Final|Native|Private // @ game+0x5911348
};

// Class TslGame.*2b38f3ee48
// Size: 0x4b8 (Inherited: 0x470)
struct U*2b38f3ee48 : U*e9d4596909 {
	char pad_470[0x8]; // 0x470(0x08)
	struct UImage* Img_SelectOutLine; // 0x478(0x08)
	struct UImage* Img_SelectGradientBg; // 0x480(0x08)
	struct FName ItemID; // 0x488(0x08)
	struct FText *3f05db8526; // 0x490(0x18)
	char pad_4A8[0x8]; // 0x4a8(0x08)
	float *00429bb550; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)
};

// Class TslGame.*20aa6c2f69
// Size: 0x4e8 (Inherited: 0x4b8)
struct U*20aa6c2f69 : U*2b38f3ee48 {
	struct UButton* ItemButton; // 0x4b8(0x08)
	struct UClass* *6f7806dda4; // 0x4c0(0x08)
	struct UItem* *48f9888583; // 0x4c8(0x08)
	struct U*f51611ba60* *104ca25916; // 0x4d0(0x08)
	char pad_4D8[0x10]; // 0x4d8(0x10)

	void OnClicked_ItemButton(); // Function TslGame.*20aa6c2f69.OnClicked_ItemButton // Final|Native|Public // @ game+0x590fba0
};

// Class TslGame.*26d719b2c5
// Size: 0x4d8 (Inherited: 0x4b8)
struct U*26d719b2c5 : U*2b38f3ee48 {
	struct UBorder* ItemBorder; // 0x4b8(0x08)
	struct U*6091c8a476* *e691730c15; // 0x4c0(0x08)
	char pad_4C8[0x10]; // 0x4c8(0x10)
};

// Class TslGame.*a9616f2e40
// Size: 0x4f8 (Inherited: 0x4d8)
struct U*a9616f2e40 : U*26d719b2c5 {
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct U*c9650c5749* SliderWidget; // 0x4e0(0x08)
	char pad_4E8[0x10]; // 0x4e8(0x10)
};

// Class TslGame.*b243dccac8
// Size: 0x560 (Inherited: 0x4d8)
struct U*b243dccac8 : U*26d719b2c5 {
	char pad_4D8[0x78]; // 0x4d8(0x78)
	struct U*6d6bbb2270* StepperWidget; // 0x550(0x08)
	char pad_558[0x8]; // 0x558(0x08)
};

// Class TslGame.*ef0b2cb82b
// Size: 0x498 (Inherited: 0x470)
struct U*ef0b2cb82b : U*e9d4596909 {
	struct UTextBlock* CurNumberTextBlock; // 0x470(0x08)
	struct UTextBlock* MaxNumberTextBlock; // 0x478(0x08)
	struct UImage* SliderImage; // 0x480(0x08)
	enum class ESandboxQuantityType *60b852b1bd; // 0x488(0x04)
	char pad_48C[0xc]; // 0x48c(0x0c)

	void *537c1e6156(); // Function TslGame.*ef0b2cb82b.*537c1e6156 // Final|Native|Private // @ game+0x59154d4
};

// Class TslGame.*742806fe5f
// Size: 0x418 (Inherited: 0x418)
struct U*742806fe5f : U*eb79fdee2a {
};

// Class TslGame.*e4f9a9f090
// Size: 0x468 (Inherited: 0x418)
struct U*e4f9a9f090 : U*eb79fdee2a {
	struct TArray<struct UScreenIndicatorBaseWidget*> *63fabc5f99; // 0x418(0x10)
	struct UClass* *3b599351c3; // 0x428(0x08)
	struct F*8e4dc0564e *d1e5cd099d; // 0x430(0x28)
	char pad_458[0x10]; // 0x458(0x10)
};

// Class TslGame.*0a2d7fa6f3
// Size: 0x4c8 (Inherited: 0x468)
struct U*0a2d7fa6f3 : U*e4f9a9f090 {
	struct TMap<struct FString, struct UCaptureObjectIndicatorWidget*> *fdda4f4d5c; // 0x468(0x50)
	struct TArray<struct ACaptureAreaActor*> *f4cf943a5a; // 0x4b8(0x10)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.*0a2d7fa6f3.OnActivatedCaptureAreaUpdated // Final|Native|Protected|HasOutParms // @ game+0x590e544
};

// Class TslGame.*ff7b9ca567
// Size: 0x478 (Inherited: 0x468)
struct U*ff7b9ca567 : U*e4f9a9f090 {
	struct TArray<struct U*9b178e8766*> *eace1f554e; // 0x468(0x10)

	void SetSmokeIndicatorWidget(); // Function TslGame.*ff7b9ca567.SetSmokeIndicatorWidget // Final|Native|Protected // @ game+0x591f8d4
};

// Class TslGame.*dd755d2684
// Size: 0x470 (Inherited: 0x468)
struct U*dd755d2684 : U*e4f9a9f090 {
	struct U*bc598ea873* *01e57f44f7; // 0x468(0x08)
};

// Class TslGame.*4c4f85b551
// Size: 0x488 (Inherited: 0x468)
struct U*4c4f85b551 : U*e4f9a9f090 {
	struct TArray<struct U*0e99c5da45*> *0e8a14fd09; // 0x468(0x10)
	struct TArray<struct ATslCharacter*> *057725fbba; // 0x478(0x10)

	void AddDetectionHumans(); // Function TslGame.*4c4f85b551.AddDetectionHumans // Final|Native|Protected|HasOutParms // @ game+0x5907c1c
};

// Class TslGame.*cfc2558b82
// Size: 0x480 (Inherited: 0x468)
struct U*cfc2558b82 : U*e4f9a9f090 {
	char pad_468[0x18]; // 0x468(0x18)
};

// Class TslGame.*9252c9127b
// Size: 0x470 (Inherited: 0x468)
struct U*9252c9127b : U*e4f9a9f090 {
	struct U*c791d10be6* *b94c983fb5; // 0x468(0x08)
};

// Class TslGame.*35f8753151
// Size: 0x478 (Inherited: 0x468)
struct U*35f8753151 : U*e4f9a9f090 {
	struct TArray<struct U*5f4219744c*> *a0bc4e6ad4; // 0x468(0x10)

	void *3b5c111aaf(); // Function TslGame.*35f8753151.*3b5c111aaf // Final|Native|Protected // @ game+0x5909d08
	void *de72b1c991(); // Function TslGame.*35f8753151.*de72b1c991 // Final|Native|Protected // @ game+0x5907ce4
};

// Class TslGame.*c6d7b9169e
// Size: 0x490 (Inherited: 0x468)
struct U*c6d7b9169e : U*e4f9a9f090 {
	struct UClass* *89b4a6e9df; // 0x468(0x08)
	struct TArray<struct UTeamMarkWidget*> *bd49f88f64; // 0x470(0x10)
	struct U*fbd165cbda* *fbd165cbda; // 0x480(0x08)
	char pad_488[0x8]; // 0x488(0x08)
};

// Class TslGame.*9385a9b7b8
// Size: 0x458 (Inherited: 0x418)
struct U*9385a9b7b8 : U*eb79fdee2a {
	struct UButton* ApplyButton; // 0x418(0x08)
	struct UWidgetSwitcher* MouseHoverSwitcher; // 0x420(0x08)
	struct UImage* ConsoleFocusImage; // 0x428(0x08)
	struct UImage* IconImage; // 0x430(0x08)
	struct UTextBlock* NameText; // 0x438(0x08)
	int32 *fae6fb9f59; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct U*1b36483031* *7c440264b0; // 0x448(0x08)
	bool *488c3b7c13; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
};

// Class TslGame.*61b8a49d2a
// Size: 0x470 (Inherited: 0x458)
struct U*61b8a49d2a : U*9385a9b7b8 {
	struct U*3335e92189* PressedPcAni; // 0x458(0x08)
	struct U*3335e92189* PressedConsoleAni; // 0x460(0x08)
	struct FName *11f61bab54; // 0x468(0x08)
};

// Class TslGame.*e909cde588
// Size: 0x438 (Inherited: 0x418)
struct U*e909cde588 : U*eb79fdee2a {
	enum class ETslSLBStageDifficulty Difficulty; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct UImage* ImageS1; // 0x420(0x08)
	struct UImage* ImageS2; // 0x428(0x08)
	struct UImage* ImageS3; // 0x430(0x08)
};

// Class TslGame.*4644aa7e52
// Size: 0x470 (Inherited: 0x418)
struct U*4644aa7e52 : U*eb79fdee2a {
	struct TMap<enum class ETslSLBStage, struct FText> *083f07ca9d; // 0x418(0x50)
	struct UTextBlock* TextStage; // 0x468(0x08)
};

// Class TslGame.*4feb85e909
// Size: 0x488 (Inherited: 0x418)
struct U*4feb85e909 : U*eb79fdee2a {
	struct UTexture2D* *882bc47ad5; // 0x418(0x08)
	struct UTexture2D* *72bf23fda8; // 0x420(0x08)
	struct UTexture2D* *fa56456b61; // 0x428(0x08)
	struct UTexture2D* *ed25edc935; // 0x430(0x08)
	struct FName *ea8bf644be; // 0x438(0x08)
	float *6c05266c0f; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	struct UImage* ImageIcon; // 0x448(0x08)
	struct UImage* ImageGauge; // 0x450(0x08)
	struct U*d76301fdac* SwitcherKeyGuideIcon; // 0x458(0x08)
	struct UMaterialInstanceDynamic* *bd5dd4b036; // 0x460(0x08)
	char pad_468[0x20]; // 0x468(0x20)

	void *0fa0253d22(); // Function TslGame.*4feb85e909.*0fa0253d22 // Final|Native|Protected // @ game+0x5918570
	void OnCancelInteractionCast(); // Function TslGame.*4feb85e909.OnCancelInteractionCast // Final|Native|Protected // @ game+0x590f734
	void OnFinishInteractionCastOnClient(); // Function TslGame.*4feb85e909.OnFinishInteractionCastOnClient // Final|Native|Protected // @ game+0x5910d30
};

// Class TslGame.*7745fa15cf
// Size: 0x468 (Inherited: 0x418)
struct U*7745fa15cf : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	struct FText Label; // 0x428(0x18)
	enum class ETslSLBStageDifficulty ID; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct UTextBlock* TextName; // 0x448(0x08)
	struct U*46534bdc1f* Button; // 0x450(0x08)
	struct U*a0b7bb7a7a* VoteStatus; // 0x458(0x08)
	struct U*e909cde588* IconDifficulty; // 0x460(0x08)

	void HandleOnClick(); // Function TslGame.*7745fa15cf.HandleOnClick // Final|Native|Protected // @ game+0x590ba48
};

// Class TslGame.*408838a434
// Size: 0x4a0 (Inherited: 0x418)
struct U*408838a434 : U*eb79fdee2a {
	char pad_418[0x20]; // 0x418(0x20)
	struct TArray<struct U*7745fa15cf*> *6b4c6d0ba5; // 0x438(0x10)
	struct TMap<enum class ETslSLBStageDifficulty, struct U*7745fa15cf*> *af19eb45be; // 0x448(0x50)
	struct UHorizontalBox* PanelList; // 0x498(0x08)

	void HandleOnClick(); // Function TslGame.*408838a434.HandleOnClick // Final|Native|Protected|HasOutParms // @ game+0x590ba7c
};

// Class TslGame.*f37d306a10
// Size: 0x458 (Inherited: 0x418)
struct U*f37d306a10 : U*eb79fdee2a {
	enum class ETslSLBStageDifficulty ID; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct FText Name; // 0x420(0x18)
	bool *0f2fb6d8a1; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct UTextBlock* TextName; // 0x440(0x08)
	struct U*e909cde588* IconDifficulty; // 0x448(0x08)
	struct UImage* ImageSeparator; // 0x450(0x08)
};

// Class TslGame.*a7a05c2635
// Size: 0x4f8 (Inherited: 0x418)
struct U*a7a05c2635 : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	enum class ETslSLBStage ID; // 0x428(0x01)
	char pad_429[0x7]; // 0x429(0x07)
	struct FText *f4f1ced051; // 0x430(0x18)
	struct UTexture2D* *2e312cebe7; // 0x448(0x08)
	struct TMap<enum class ETslSLBStageDifficulty, struct UTexture2D*> *62572529f6; // 0x450(0x50)
	struct TArray<struct U*a0ea3514e1*> *78a3fd9fd5; // 0x4a0(0x10)
	struct U*e909cde588* IconDifficulty; // 0x4b0(0x08)
	struct UImage* ImageStage; // 0x4b8(0x08)
	struct UImage* ImageConsol; // 0x4c0(0x08)
	struct UTextBlock* TextName; // 0x4c8(0x08)
	struct U*46534bdc1f* Button; // 0x4d0(0x08)
	struct U*a0b7bb7a7a* VoteStatus; // 0x4d8(0x08)
	struct UBorder* PanelHistoryBorder; // 0x4e0(0x08)
	struct UHorizontalBox* PanelHistory; // 0x4e8(0x08)
	struct USizeBox* PanelMyHistory; // 0x4f0(0x08)

	void HandleOnClick(); // Function TslGame.*a7a05c2635.HandleOnClick // Final|Native|Protected // @ game+0x590bb2c
};

// Class TslGame.*a0ea3514e1
// Size: 0x430 (Inherited: 0x418)
struct U*a0ea3514e1 : U*eb79fdee2a {
	struct UBorder* PlayerColorBorder; // 0x418(0x08)
	struct U*e909cde588* IconDifficulty; // 0x420(0x08)
	struct UTextBlock* NumberTextBlock; // 0x428(0x08)
};

// Class TslGame.*7d07b62ebf
// Size: 0x4a8 (Inherited: 0x418)
struct U*7d07b62ebf : U*eb79fdee2a {
	char pad_418[0x28]; // 0x418(0x28)
	struct TArray<struct U*a7a05c2635*> *6b4c6d0ba5; // 0x440(0x10)
	struct TMap<enum class ETslSLBStage, struct U*a7a05c2635*> *af19eb45be; // 0x450(0x50)
	struct UWrapBox* PanelList; // 0x4a0(0x08)

	void HandleOnClick(); // Function TslGame.*7d07b62ebf.HandleOnClick // Final|Native|Protected|HasOutParms // @ game+0x590ba7c
};

// Class TslGame.*a0b7bb7a7a
// Size: 0x448 (Inherited: 0x418)
struct U*a0b7bb7a7a : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	struct UImage* ImageMine; // 0x428(0x08)
	struct UImage* ImageP1; // 0x430(0x08)
	struct UImage* ImageP2; // 0x438(0x08)
	struct UImage* ImageP3; // 0x440(0x08)
};

// Class TslGame.*c9650c5749
// Size: 0x4d0 (Inherited: 0x418)
struct U*c9650c5749 : U*eb79fdee2a {
	char pad_418[0x78]; // 0x418(0x78)
	struct USlider* MainSlider; // 0x490(0x08)
	struct UEditableText* EditableValueText; // 0x498(0x08)
	struct UBorder* EditableTextBorder; // 0x4a0(0x08)
	char pad_4A8[0x28]; // 0x4a8(0x28)

	void HandleOnTextValueChanged(); // Function TslGame.*c9650c5749.HandleOnTextValueChanged // Final|Native|Private|HasOutParms // @ game+0x590c01c
	void HandleOnSliderValueChanged(); // Function TslGame.*c9650c5749.HandleOnSliderValueChanged // Final|Native|Private // @ game+0x590bf84
};

// Class TslGame.*5afe5e234c
// Size: 0x440 (Inherited: 0x418)
struct U*5afe5e234c : U*eb79fdee2a {
	char pad_418[0x28]; // 0x418(0x28)

	void OnSelected(); // Function TslGame.*5afe5e234c.OnSelected // Final|Native|Private // @ game+0x5911770
};

// Class TslGame.TDMSpawnKitItemWidget
// Size: 0x4a8 (Inherited: 0x440)
struct UTDMSpawnKitItemWidget : U*5afe5e234c {
	struct UWidgetSwitcher* SpawnKitButtonSwitcher; // 0x440(0x08)
	struct UButton* SpawnKitButtonDefaultButton; // 0x448(0x08)
	struct UButton* SpawnKitButtonSelectButton; // 0x450(0x08)
	struct UImage* DefaultSpawnKitWeaponIcon; // 0x458(0x08)
	struct UImage* SelectSpawnKitWeaponIcon; // 0x460(0x08)
	struct UTextBlock* DefaultSpawnKitName; // 0x468(0x08)
	struct UTextBlock* SelectSpawnKitName; // 0x470(0x08)
	struct UBorder* DefaultBorder; // 0x478(0x08)
	struct FLinearColor *b27e7b07d9; // 0x480(0x10)
	struct FLinearColor *3ad8f9cbb3; // 0x490(0x10)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void OnAsyncLoadIconFinished(); // Function TslGame.TDMSpawnKitItemWidget.OnAsyncLoadIconFinished // Final|Native|Private // @ game+0x590e828
	void OnSelected(); // Function TslGame.TDMSpawnKitItemWidget.OnSelected // Native|Protected // @ game+0x5911770
};

// Class TslGame.TslSpawnKitItemWidget
// Size: 0x4b8 (Inherited: 0x440)
struct UTslSpawnKitItemWidget : U*5afe5e234c {
	char pad_440[0x20]; // 0x440(0x20)
	struct UButton* ButtonForSelector; // 0x460(0x08)
	struct UTextBlock* TextBlockForTitle; // 0x468(0x08)
	struct UBorder* ButtonBorder; // 0x470(0x08)
	struct UWidget* CheckMarkSizeBox; // 0x478(0x08)
	struct UWidget* ButtonForSelectorFocus; // 0x480(0x08)
	struct FLinearColor *65003cf1e0; // 0x488(0x10)
	struct FLinearColor *00a6ccd500; // 0x498(0x10)
	struct FLinearColor *1c7d58382f; // 0x4a8(0x10)

	void OnUnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnUnHovered // Final|Native|Private // @ game+0x5916a44
	void OnHovered(); // Function TslGame.TslSpawnKitItemWidget.OnHovered // Final|Native|Private // @ game+0x5911788
	void OnSelected(); // Function TslGame.TslSpawnKitItemWidget.OnSelected // Final|Native|Private // @ game+0x5911770
};

// Class TslGame.*6abc43d291
// Size: 0x428 (Inherited: 0x418)
struct U*6abc43d291 : U*eb79fdee2a {
	struct U*bd5a2cbd9c* PubgIdWidget; // 0x418(0x08)
	struct U*3335e92189* FadeInAnim; // 0x420(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*6abc43d291.OnUpdateViewTarget // Final|Native|Public // @ game+0xb31b00
};

// Class TslGame.*3bb8b4dcc9
// Size: 0x440 (Inherited: 0x418)
struct U*3bb8b4dcc9 : U*eb79fdee2a {
	struct F*89ccd1e174 *0755755705; // 0x418(0x28)

	void UpdateDesign_Selected(); // Function TslGame.*3bb8b4dcc9.UpdateDesign_Selected // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void UpdateDesign_Normal(); // Function TslGame.*3bb8b4dcc9.UpdateDesign_Normal // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*318a264b8b
// Size: 0x460 (Inherited: 0x418)
struct U*318a264b8b : U*eb79fdee2a {
	float *31e591e31d; // 0x418(0x04)
	int32 *2141d58634; // 0x41c(0x04)
	int32 *412bda5848; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct TArray<struct U*3bb8b4dcc9*> *0603e128cd; // 0x428(0x10)
	struct UClass* *73daa6a1c0; // 0x438(0x08)
	struct F*6351b5e701 *a2a0eda551; // 0x440(0x20)
};

// Class TslGame.*c2cae3b6d2
// Size: 0x480 (Inherited: 0x418)
struct U*c2cae3b6d2 : U*eb79fdee2a {
	struct FMulticastDelegate OnClickedTabButtonWidget; // 0x418(0x10)
	struct FString TitleKeyString; // 0x428(0x10)
	struct FText TitleText; // 0x438(0x18)
	struct UTextBlock* TitleNormal; // 0x450(0x08)
	struct UTextBlock* TitleSelected; // 0x458(0x08)
	struct UWidgetSwitcher* StateSwitcher; // 0x460(0x08)
	struct UButton* OutsideButton; // 0x468(0x08)
	struct UImage* NotificationImage; // 0x470(0x08)
	bool bTurnOffNotificationIfClicked; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)

	void OnClicked(); // Function TslGame.*c2cae3b6d2.OnClicked // Native|Public // @ game+0x590fad8
};

// Class TslGame.*51b131d2ea
// Size: 0x490 (Inherited: 0x480)
struct U*51b131d2ea : U*c2cae3b6d2 {
	char pad_480[0x10]; // 0x480(0x10)

	void OnCraftableItemRemoved(); // Function TslGame.*51b131d2ea.OnCraftableItemRemoved // Final|Native|Private // @ game+0x590ffcc
	void OnNewCraftableItemAdded(); // Function TslGame.*51b131d2ea.OnNewCraftableItemAdded // Final|Native|Private // @ game+0x591376c
	void OnViewTargetUpdated(); // Function TslGame.*51b131d2ea.OnViewTargetUpdated // Final|Native|Private // @ game+0x59177fc
};

// Class TslGame.*b95585e4f8
// Size: 0x448 (Inherited: 0x418)
struct U*b95585e4f8 : U*eb79fdee2a {
	struct FMulticastDelegate OnTabGroupUpdated; // 0x418(0x10)
	struct TArray<struct U*c2cae3b6d2*> *d5db8dd3b9; // 0x428(0x10)
	struct UWidget* TabHorizontalBox; // 0x438(0x08)
	char pad_440[0x8]; // 0x440(0x08)

	void UpdateIndexTo(); // Function TslGame.*b95585e4f8.UpdateIndexTo // Final|Native|Public // @ game+0x592183c
	void UpdateIndexToBP(); // Function TslGame.*b95585e4f8.UpdateIndexToBP // Final|Native|Public|BlueprintCallable // @ game+0x592183c
	void UpdateCurrentIndex(); // Function TslGame.*b95585e4f8.UpdateCurrentIndex // Final|Native|Public|BlueprintCallable // @ game+0x59215b0
	void ResetTabGroup(); // Function TslGame.*b95585e4f8.ResetTabGroup // Final|Native|Public|BlueprintCallable // @ game+0x5919938
};

// Class TslGame.*d4399f19a3
// Size: 0x508 (Inherited: 0x418)
struct U*d4399f19a3 : U*eb79fdee2a {
	DelegateProperty *39d7cc32a1; // 0x418(0x10)
	struct FText TitleText; // 0x428(0x18)
	struct FString TitleKeyString; // 0x440(0x10)
	struct F*471718b397 *693e44712f; // 0x450(0x20)
	struct F*471718b397 *9b3f79b8d9; // 0x470(0x20)
	struct F*89ccd1e174 *0755755705; // 0x490(0x28)
	struct F*6351b5e701 *e113131b6e; // 0x4b8(0x20)
	struct F*7935e10e39 *75239ee89a; // 0x4d8(0x28)
	char pad_500[0x8]; // 0x500(0x08)

	void UpdateTitleText(); // Function TslGame.*d4399f19a3.UpdateTitleText // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x59220a8
	void OnClicked(); // Function TslGame.*d4399f19a3.OnClicked // Final|Native|Public // @ game+0x590fb18
	void UpdateDesign_Selected(); // Function TslGame.*d4399f19a3.UpdateDesign_Selected // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.*19a8839134
// Size: 0x488 (Inherited: 0x418)
struct U*19a8839134 : U*eb79fdee2a {
	struct FVector2D IconSize; // 0x418(0x08)
	struct TMap<int32, struct UImage*> *4f8ce62d8d; // 0x420(0x50)
	struct TArray<struct UImage*> *95f1182261; // 0x470(0x10)
	struct UHorizontalBox* PanelHorBox; // 0x480(0x08)
};

// Class TslGame.*4eb7768c2b
// Size: 0x868 (Inherited: 0x418)
struct U*4eb7768c2b : U*eb79fdee2a {
	char pad_418[0x8]; // 0x418(0x08)
	struct F*093563bf09 *a7badf1403; // 0x420(0x28)
	struct F*07222da915 *379a32fd92; // 0x448(0x30)
	struct F*89ccd1e174 *ed0c65d2c9; // 0x478(0x28)
	struct F*92d5c0f2ef *72e347a027; // 0x4a0(0x28)
	struct F*03af4cd0fb *7a2bc9608f; // 0x4c8(0x20)
	struct F*03af4cd0fb *d7f3e24507; // 0x4e8(0x20)
	struct F*0f89a77c6d *3ed18d7a75; // 0x508(0x20)
	struct F*6a15aeee08 *6a15aeee08; // 0x528(0x10)
	struct UWidgetSwitcher* PlayerStateIconsSwitcher; // 0x538(0x08)
	struct UTextBlock* PlayerNameText; // 0x540(0x08)
	struct UWidgetSwitcher* PlayerColorSwitcher; // 0x548(0x08)
	struct UWidgetSwitcher* PlayerIconNumberSwitcher; // 0x550(0x08)
	struct UImage* MarkerImage; // 0x558(0x08)
	struct UImage* PlayerBoostGaugeImage; // 0x560(0x08)
	struct UTextBlock* FollowNumTxt; // 0x568(0x08)
	struct UImage* FollowArrowImg; // 0x570(0x08)
	struct UImage* IconItemRequest; // 0x578(0x08)
	struct UImage* IconSpecificModeImage; // 0x580(0x08)
	char pad_588[0x8]; // 0x588(0x08)
	struct F*89ccd1e174 *dead9ec274; // 0x590(0x28)
	float *9ac3bb2ef0; // 0x5b8(0x04)
	float *d150a4985c; // 0x5bc(0x04)
	struct F*07222da915 *5f2c202b06; // 0x5c0(0x30)
	struct F*471718b397 *53e2de0a82; // 0x5f0(0x20)
	struct F*0f89a77c6d *15206b10a8; // 0x610(0x20)
	struct F*92d5c0f2ef *f3e292f672; // 0x630(0x28)
	struct F*89ccd1e174 *e44023ddfd; // 0x658(0x28)
	struct F*6351b5e701 *4ce2bbd019; // 0x680(0x20)
	struct F*89ccd1e174 *6bdfd44503; // 0x6a0(0x28)
	struct F*89ccd1e174 *3b956c82a8; // 0x6c8(0x28)
	struct F*6351b5e701 *8d79a56e23; // 0x6f0(0x20)
	struct ATeam* Team; // 0x710(0x08)
	struct FLinearColor *c4782f0c7f; // 0x718(0x10)
	struct TArray<struct UTexture2D*> *d435fcb0a2; // 0x728(0x10)
	struct UTexture2D* *a763ddf1f6; // 0x738(0x08)
	struct F*7935e10e39 *70976add5b; // 0x740(0x28)
	struct UTextBlock* ComeBackWarRemainText; // 0x768(0x08)
	struct UTextBlock* BindTextComebackTime; // 0x770(0x08)
	struct UBorder* PlayerStateIconsBorder; // 0x778(0x08)
	struct UBorder* PlayerInfoBorder; // 0x780(0x08)
	struct UBorder* PlayerGaugeBorder; // 0x788(0x08)
	struct UBorder* TeamFollowBorder; // 0x790(0x08)
	struct UBorder* TeamVoiceBorder; // 0x798(0x08)
	struct U*19a8839134* AdditionalIcon; // 0x7a0(0x08)
	struct UTexture2D* *213219681c; // 0x7a8(0x08)
	struct UTexture2D* *474a77dc05; // 0x7b0(0x08)
	struct ATslCharacter* *6239171378; // 0x7b8(0x08)
	char pad_7C0[0x10]; // 0x7c0(0x10)
	struct TMap<struct UMaterialInterface*, struct UMaterialInstanceDynamic*> *2335cc967d; // 0x7d0(0x50)
	float *89c80bc7b3; // 0x820(0x04)
	bool *8ed19658b7; // 0x824(0x01)
	char pad_825[0x1]; // 0x825(0x01)
	bool *fb6e0b9245; // 0x826(0x01)
	char pad_827[0x41]; // 0x827(0x41)

	void OnParticipantMuteChanged(); // Function TslGame.*4eb7768c2b.OnParticipantMuteChanged // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void *146cffc9bb(); // Function TslGame.*4eb7768c2b.*146cffc9bb // Final|Native|Private // @ game+0x5907dc0
	void UpdateVoiceChat(); // Function TslGame.*4eb7768c2b.UpdateVoiceChat // Final|Native|Private // @ game+0x5922284
	void *35aeac2dc5(); // Function TslGame.*4eb7768c2b.*35aeac2dc5 // Final|Native|Private // @ game+0x5921fbc
	void *b53f1e4feb(); // Function TslGame.*4eb7768c2b.*b53f1e4feb // Final|Native|Private // @ game+0x5921320
	void *9fdae47ae7(); // Function TslGame.*4eb7768c2b.*9fdae47ae7 // Final|Native|Private // @ game+0x592206c
	void *9b7257c732(); // Function TslGame.*4eb7768c2b.*9b7257c732 // Final|Native|Private // @ game+0x5921c04
	void OnNativeParticipantMuteChanged(); // Function TslGame.*4eb7768c2b.OnNativeParticipantMuteChanged // Final|Native|Private // @ game+0x59134b4
	void OnNativeParticipantRestrictionChanged(); // Function TslGame.*4eb7768c2b.OnNativeParticipantRestrictionChanged // Final|Native|Private // @ game+0x591364c
	void *a19f224d5a(); // Function TslGame.*4eb7768c2b.*a19f224d5a // Final|Native|Private // @ game+0x5921e8c
	void OnParticipantRestrictionChanged(); // Function TslGame.*4eb7768c2b.OnParticipantRestrictionChanged // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void NotifyEngageAttacked(); // Function TslGame.*4eb7768c2b.NotifyEngageAttacked // Final|Native|Private // @ game+0x99ca6c
	void *e1951fe7b6(); // Function TslGame.*4eb7768c2b.*e1951fe7b6 // Final|Native|Private // @ game+0x5919878
	void *81075f59a6(); // Function TslGame.*4eb7768c2b.*81075f59a6 // Final|Native|Private // @ game+0x59196f8
	void *d42d5956c2(); // Function TslGame.*4eb7768c2b.*d42d5956c2 // Final|Native|Private // @ game+0x5922480
	void OnLeaveTeamVoiceChannel(); // Function TslGame.*4eb7768c2b.OnLeaveTeamVoiceChannel // Final|Native|Private // @ game+0x5911c64
	void *b29da0790f(); // Function TslGame.*4eb7768c2b.*b29da0790f // Final|Native|Private // @ game+0x5921fd0
	void *7cdae72d21(); // Function TslGame.*4eb7768c2b.*7cdae72d21 // Final|Native|Private // @ game+0x59216f4
	void *8772d2a676(); // Function TslGame.*4eb7768c2b.*8772d2a676 // Final|Native|Public // @ game+0x590abbc
	void UpdateVoiceStatusOnly(); // Function TslGame.*4eb7768c2b.UpdateVoiceStatusOnly // Final|Native|Private // @ game+0x5922494
	void *bea90f10c6(); // Function TslGame.*4eb7768c2b.*bea90f10c6 // Final|Native|Private // @ game+0x5922080
	void *ec946c052d(); // Function TslGame.*4eb7768c2b.*ec946c052d // Final|Native|Private // @ game+0x5921ff8
	void *10438725d4(); // Function TslGame.*4eb7768c2b.*10438725d4 // Final|Native|Private // @ game+0x5918bec
	void *7b4494d0dc(); // Function TslGame.*4eb7768c2b.*7b4494d0dc // Final|Native|Private // @ game+0x591788c
	void FollowParachuteAction(); // Function TslGame.*4eb7768c2b.FollowParachuteAction // Final|Native|Public // @ game+0x590aa08
	void SetTeam(); // Function TslGame.*4eb7768c2b.SetTeam // Native|Public|BlueprintCallable // @ game+0x591f9f4
	void *892515047e(); // Function TslGame.*4eb7768c2b.*892515047e // Final|Native|Private // @ game+0x592200c
	void OnBlockUserUpdated(); // Function TslGame.*4eb7768c2b.OnBlockUserUpdated // Final|Native|Private // @ game+0x590ed78
	void *18a973a012(); // Function TslGame.*4eb7768c2b.*18a973a012 // Final|Native|Private // @ game+0x5921828
	void *c8e48f1809(); // Function TslGame.*4eb7768c2b.*c8e48f1809 // Final|Native|Private // @ game+0x5919828
};

// Class TslGame.*6a8994291a
// Size: 0x930 (Inherited: 0x868)
struct U*6a8994291a : U*4eb7768c2b {
	struct UImage* ClassIconImageWidget; // 0x868(0x08)
	struct U*d76301fdac* TeamInfoGroup; // 0x870(0x08)
	struct UImage* IconBackgroundImageWidget; // 0x878(0x08)
	struct UImage* MemberIndexBackgroundImageWidget; // 0x880(0x08)
	struct UImage* FullBackgroundImageWidget; // 0x888(0x08)
	struct U*d76301fdac* LevelPanelWidget; // 0x890(0x08)
	struct UTextBlock* PlayeLevelText; // 0x898(0x08)
	struct TMap<enum class EFBRClass, struct UTexture2D*> ClassTextureData; // 0x8a0(0x50)
	struct TArray<struct F*e00483e6d6> ImageByMemberIndex; // 0x8f0(0x10)
	struct FMargin SlotPaddingOverride; // 0x900(0x10)
	struct FName MaterialParam_Texture; // 0x910(0x08)
	struct FName MaterialParam_IsGray; // 0x918(0x08)
	struct FName MaterialParam_IsBlink; // 0x920(0x08)
	char pad_928[0x8]; // 0x928(0x08)

	void OnToggleClassSelectWidget(); // Function TslGame.*6a8994291a.OnToggleClassSelectWidget // Final|Native|Public // @ game+0x59168dc
	void OnTeamSpawnKitUpdated(); // Function TslGame.*6a8994291a.OnTeamSpawnKitUpdated // Final|Native|Public // @ game+0x5916274
};

// Class TslGame.*abbf0486d6
// Size: 0x510 (Inherited: 0x418)
struct U*abbf0486d6 : U*eb79fdee2a {
	struct FMulticastDelegate OnReportButtonClicked; // 0x418(0x10)
	char pad_428[0x40]; // 0x428(0x40)
	struct FTslReportUserInfo *bc508b33c5; // 0x468(0x70)
	struct F*7935e10e39 *6099a2d142; // 0x4d8(0x28)
	float VisualVolumeModifier; // 0x500(0x04)
	float ActualVolumeMin; // 0x504(0x04)
	float ActualVolumeMax; // 0x508(0x04)
	char pad_50C[0x4]; // 0x50c(0x04)
};

// Class TslGame.*caa3e97a4d
// Size: 0x830 (Inherited: 0x510)
struct U*caa3e97a4d : U*abbf0486d6 {
	char pad_510[0x40]; // 0x510(0x40)
	struct UWidgetSwitcher* RadioButtonSwitcher; // 0x550(0x08)
	struct UButton* RadioOnButton; // 0x558(0x08)
	struct UButton* RadioOffButton; // 0x560(0x08)
	struct UWidgetSwitcher* WaypointButtonSwitcher; // 0x568(0x08)
	struct UButton* WaypointOnButton; // 0x570(0x08)
	struct UButton* WaypointOffButton; // 0x578(0x08)
	struct F*89ccd1e174 *2c59a282b2; // 0x580(0x28)
	struct F*92d5c0f2ef *d1232bb792; // 0x5a8(0x28)
	struct F*6351b5e701 *c7a01439aa; // 0x5d0(0x20)
	struct F*6351b5e701 *92acd83569; // 0x5f0(0x20)
	struct F*92d5c0f2ef *1f48f5029a; // 0x610(0x28)
	struct F*471718b397 *fb1372d612; // 0x638(0x20)
	struct F*07222da915 *ddb4f0faaf; // 0x658(0x30)
	struct F*6351b5e701 *613224f033; // 0x688(0x20)
	struct F*89ccd1e174 *94d649be45; // 0x6a8(0x28)
	int32 *8d18b0efd9; // 0x6d0(0x04)
	int32 *c706db6147; // 0x6d4(0x04)
	struct F*6351b5e701 *8584b5ad4c; // 0x6d8(0x20)
	struct F*6351b5e701 *8f72783806; // 0x6f8(0x20)
	struct F*6351b5e701 *9519c69508; // 0x718(0x20)
	struct F*471718b397 *385e08579f; // 0x738(0x20)
	struct F*92d5c0f2ef *b3fed628f9; // 0x758(0x28)
	struct F*92d5c0f2ef *eb2e03ded7; // 0x780(0x28)
	struct F*07222da915 *a8f7459d2e; // 0x7a8(0x30)
	struct FLinearColor *8c52631875; // 0x7d8(0x10)
	struct FLinearColor *0eafa060c1; // 0x7e8(0x10)
	struct FLinearColor *06c5ddf642; // 0x7f8(0x10)
	struct FText *97ac63846b; // 0x808(0x18)
	char pad_820[0x10]; // 0x820(0x10)

	void OnClickedRadioOffButton(); // Function TslGame.*caa3e97a4d.OnClickedRadioOffButton // Final|Native|Protected // @ game+0x590fb40
	void OnClickedRadioOnButton(); // Function TslGame.*caa3e97a4d.OnClickedRadioOnButton // Final|Native|Protected // @ game+0x590fb40
	void NotifyReportButtonClicked(); // Function TslGame.*caa3e97a4d.NotifyReportButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x590e378
	void OnClickedWaypointOffButton(); // Function TslGame.*caa3e97a4d.OnClickedWaypointOffButton // Final|Native|Protected // @ game+0x590fb54
	void NotifyToggleAvoidButtonClicked(); // Function TslGame.*caa3e97a4d.NotifyToggleAvoidButtonClicked // Final|Native|Protected // @ game+0x590e420
	void NotifyVolumeSliderUpdated(); // Function TslGame.*caa3e97a4d.NotifyVolumeSliderUpdated // Final|Native|Protected|BlueprintCallable // @ game+0x590e448
	void NotifyToggleVoiceMuteButtonClicked(); // Function TslGame.*caa3e97a4d.NotifyToggleVoiceMuteButtonClicked // Final|Native|Protected|BlueprintCallable // @ game+0x590e434
	void OnClickedWaypointOnButton(); // Function TslGame.*caa3e97a4d.OnClickedWaypointOnButton // Final|Native|Protected // @ game+0x590fb70
};

// Class TslGame.*16cf99f1ff
// Size: 0x6c0 (Inherited: 0x510)
struct U*16cf99f1ff : U*abbf0486d6 {
	struct FMulticastDelegate OnNavigate; // 0x510(0x10)
	struct FMulticastDelegate OnShowGamerCard; // 0x520(0x10)
	struct FMulticastDelegate OnToggleVoiceMute; // 0x530(0x10)
	struct FMulticastDelegate OnToggleAvoid; // 0x540(0x10)
	struct FMulticastDelegate OnRequestClose; // 0x550(0x10)
	char pad_560[0x8]; // 0x560(0x08)
	struct F*07222da915 *72841af56c; // 0x568(0x30)
	struct F*471718b397 *fb1372d612; // 0x598(0x20)
	struct F*89ccd1e174 *169a296a8a; // 0x5b8(0x28)
	struct F*0f89a77c6d *15206b10a8; // 0x5e0(0x20)
	int32 *4d2ab3e7d9; // 0x600(0x04)
	int32 *1d4bda33ff; // 0x604(0x04)
	float *3134bef83e; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct F*92d5c0f2ef *5633e3aa34; // 0x610(0x28)
	struct F*7935e10e39 *4cfddd05db; // 0x638(0x28)
	struct F*471718b397 *b04175dd3f; // 0x660(0x20)
	struct FLinearColor FocusedContentColor; // 0x680(0x10)
	struct FLinearColor DefaultContentColor; // 0x690(0x10)
	struct FLinearColor FocusedBrushColor; // 0x6a0(0x10)
	struct FLinearColor DefaultBrushColor; // 0x6b0(0x10)
};

// Class TslGame.*78fdcfed52
// Size: 0x4d8 (Inherited: 0x418)
struct U*78fdcfed52 : U*eb79fdee2a {
	struct UImage* CookingTimerImage; // 0x418(0x08)
	struct UMaterialInstanceDynamic* *3c1e3c86f1; // 0x420(0x08)
	struct ATslWeapon_Throwable* *b4cb56b962; // 0x428(0x08)
	struct TMap<enum class EColorBlindType, struct FLinearColor> NormalColorMap; // 0x430(0x50)
	struct TMap<enum class EColorBlindType, struct FLinearColor> WarningColorMap; // 0x480(0x50)
	char pad_4D0[0x8]; // 0x4d0(0x08)

	void OnUpdateViewTarget(); // Function TslGame.*78fdcfed52.OnUpdateViewTarget // Final|Native|Private // @ game+0xc92f8c
	void UpdateProgressColor(); // Function TslGame.*78fdcfed52.UpdateProgressColor // Final|Native|Private // @ game+0x5921c68
};

// Class TslGame.*eb0bb20363
// Size: 0x498 (Inherited: 0x418)
struct U*eb0bb20363 : U*eb79fdee2a {
	char pad_418[0x18]; // 0x418(0x18)
	int32 *1594cbf627; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UClass* WeaponType; // 0x438(0x08)
	struct UTexture* *af5fdede08; // 0x440(0x08)
	float *662d93a2ce; // 0x448(0x04)
	struct FLinearColor NormalColor; // 0x44c(0x10)
	struct FLinearColor *551500a48c; // 0x45c(0x10)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct UImage* Icon; // 0x470(0x08)
	struct UTextBlock* ItemCountText; // 0x478(0x08)
	struct USizeBox* IconSize; // 0x480(0x08)
	struct U*3335e92189* Anim_Use; // 0x488(0x08)
	struct U*3335e92189* Anim_Add; // 0x490(0x08)

	void OnThrowableItemsUpdated(); // Function TslGame.*eb0bb20363.OnThrowableItemsUpdated // Final|Native|Private // @ game+0x591655c
	void GetThrowableItemCount(); // Function TslGame.*eb0bb20363.GetThrowableItemCount // Final|Native|Public|BlueprintCallable // @ game+0x590b6e8
};

// Class TslGame.*7720021511
// Size: 0x448 (Inherited: 0x418)
struct U*7720021511 : U*eb79fdee2a {
	struct UTextBlock* ToolTipTitleText; // 0x418(0x08)
	struct UTextBlock* ToolTipContentText; // 0x420(0x08)
	struct UWidget* *8d62e45b5a; // 0x428(0x08)
	char pad_430[0x18]; // 0x430(0x18)
};

// Class TslGame.*8864733a17
// Size: 0x488 (Inherited: 0x418)
struct U*8864733a17 : U*eb79fdee2a {
	struct UButton* ExitButton; // 0x418(0x08)
	struct UButton* AimTrainingButton; // 0x420(0x08)
	struct UButton* SoundTrainingButton; // 0x428(0x08)
	struct UButton* RecordRange10Button; // 0x430(0x08)
	struct UButton* RecordRange50Button; // 0x438(0x08)
	struct UButton* RecordRange100Button; // 0x440(0x08)
	struct UWidgetSwitcher* RecordInfoSwitcher; // 0x448(0x08)
	struct U*47cfde0080* LatestAimRecordInfoWidget; // 0x450(0x08)
	struct U*47cfde0080* BestAimRecordInfoWidget; // 0x458(0x08)
	struct U*47cfde0080* LatestSoundRecordInfoWidget; // 0x460(0x08)
	struct U*47cfde0080* BestSoundRecordInfoWidget; // 0x468(0x08)
	struct U*8e9f071bf4* RecordGraphWidget; // 0x470(0x08)
	struct UCanvasPanel* EmptyDataBlockerPanel; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)

	void OnHoveredButton(); // Function TslGame.*8864733a17.OnHoveredButton // Final|Native|Private // @ game+0xbf2d88
	void OnCloseDashboard(); // Function TslGame.*8864733a17.OnCloseDashboard // Final|Native|Public // @ game+0x590fd38
	void OnAimTrainingButton(); // Function TslGame.*8864733a17.OnAimTrainingButton // Final|Native|Private // @ game+0x590e6d8
	void OnSoundTrainingButton(); // Function TslGame.*8864733a17.OnSoundTrainingButton // Final|Native|Private // @ game+0x5915ba0
	void OnDashboardRange10Button(); // Function TslGame.*8864733a17.OnDashboardRange10Button // Final|Native|Private // @ game+0x5910010
	void OnDashboardRange50Button(); // Function TslGame.*8864733a17.OnDashboardRange50Button // Final|Native|Private // @ game+0x591002c
	void OnDashboardRange100Button(); // Function TslGame.*8864733a17.OnDashboardRange100Button // Final|Native|Private // @ game+0x590fff4
};

// Class TslGame.*47cfde0080
// Size: 0x420 (Inherited: 0x418)
struct U*47cfde0080 : U*eb79fdee2a {
	struct UTextBlock* InfoTypeText; // 0x418(0x08)
};

// Class TslGame.*e6b89fa3d5
// Size: 0x470 (Inherited: 0x420)
struct U*e6b89fa3d5 : U*47cfde0080 {
	struct UTextBlock* ScoreText; // 0x420(0x08)
	struct UTextBlock* AccuracyText; // 0x428(0x08)
	struct UTextBlock* HeadShotKillText; // 0x430(0x08)
	struct UTextBlock* KillText; // 0x438(0x08)
	struct UTextBlock* WeaponText; // 0x440(0x08)
	struct UTextBlock* HeadHitText; // 0x448(0x08)
	struct UTextBlock* ArmHitText; // 0x450(0x08)
	struct UTextBlock* TorsoHitText; // 0x458(0x08)
	struct UTextBlock* PelvisHitText; // 0x460(0x08)
	struct UTextBlock* LegHitText; // 0x468(0x08)
};

// Class TslGame.*e278c52d56
// Size: 0x440 (Inherited: 0x420)
struct U*e278c52d56 : U*47cfde0080 {
	struct UTextBlock* ScoreText; // 0x420(0x08)
	struct UTextBlock* AccuracyText; // 0x428(0x08)
	struct UTextBlock* ReactionRateText; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class TslGame.*a40758e12a
// Size: 0x4b0 (Inherited: 0x418)
struct U*a40758e12a : U*eb79fdee2a {
	struct FText TrainingTitleText; // 0x418(0x18)
	struct FText TrainingDetailText; // 0x430(0x18)
	struct UTexture2D* ButtonImageTexture; // 0x448(0x08)
	enum class ETrainingPracticeType PracticeType; // 0x450(0x01)
	char pad_451[0x17]; // 0x451(0x17)
	struct FVector2D *5f231b7d4b; // 0x468(0x08)
	struct FVector2D *a0312e5970; // 0x470(0x08)
	struct UTextBlock* TitleText; // 0x478(0x08)
	struct UTextBlock* DetailText; // 0x480(0x08)
	struct UImage* ButtonImage; // 0x488(0x08)
	struct UImage* ConsoleHighlight; // 0x490(0x08)
	struct UButton* TrainingMenuButton; // 0x498(0x08)
	struct USizeBox* TrainingMenuButtonSizeBox; // 0x4a0(0x08)
	char pad_4A8[0x8]; // 0x4a8(0x08)

	void OnTrainingMenuSelect(); // Function TslGame.*a40758e12a.OnTrainingMenuSelect // Final|Native|Public // @ game+0x5916a30
	void OnUnHoveredButton(); // Function TslGame.*a40758e12a.OnUnHoveredButton // Final|Native|Public // @ game+0x5916a78
	void OnHoveredButton(); // Function TslGame.*a40758e12a.OnHoveredButton // Final|Native|Public // @ game+0x59117bc
};

// Class TslGame.*c23fb26977
// Size: 0x458 (Inherited: 0x418)
struct U*c23fb26977 : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	struct U*9e4f5cc3db* RoundCount; // 0x428(0x08)
	struct U*a0e03b0aa3* RoundTime; // 0x430(0x08)
	char pad_438[0x20]; // 0x438(0x20)
};

// Class TslGame.*48051b2deb
// Size: 0x470 (Inherited: 0x458)
struct U*48051b2deb : U*c23fb26977 {
	struct U*bda58c64ea* ScorePoints; // 0x458(0x08)
	struct U*d48539b74d* WinningStreak; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)
};

// Class TslGame.*4343f9a00d
// Size: 0x578 (Inherited: 0x458)
struct U*4343f9a00d : U*c23fb26977 {
	struct U*52caabdff9* PlayerHeadManager; // 0x458(0x08)
	struct UBorder* HP_Border; // 0x460(0x08)
	struct U*bda58c64ea* Player_Score; // 0x468(0x08)
	struct U*bda58c64ea* Enemy_Score; // 0x470(0x08)
	struct UImage* Player_Gauge_Image; // 0x478(0x08)
	struct UImage* Enemy_Gauge_Image; // 0x480(0x08)
	struct U*ff4e3d7a7a* Player_PlatformIcon; // 0x488(0x08)
	struct U*ff4e3d7a7a* Enemy_PlatformIcon; // 0x490(0x08)
	struct UTextBlock* PlayerName_Text; // 0x498(0x08)
	struct UTextBlock* EnemyName_Text; // 0x4a0(0x08)
	struct U*3335e92189* Hit0_Anim; // 0x4a8(0x08)
	struct U*3335e92189* Hit1_Anim; // 0x4b0(0x08)
	struct U*3335e92189* Open_Anim; // 0x4b8(0x08)
	char pad_4C0[0xa0]; // 0x4c0(0xa0)
	struct U*d48539b74d* PlayerWinningStreak; // 0x560(0x08)
	struct U*d48539b74d* EnemyWinningStreak; // 0x568(0x08)
	char pad_570[0x8]; // 0x570(0x08)
};

// Class TslGame.*bc1f2ea9eb
// Size: 0x438 (Inherited: 0x418)
struct U*bc1f2ea9eb : U*eb79fdee2a {
	struct UWidgetSwitcher* ResultMark_Switcher; // 0x418(0x08)
	struct UWidgetSwitcher* ResultText_Switcher; // 0x420(0x08)
	struct U*3335e92189* Anim_Start; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
};

// Class TslGame.*f730653843
// Size: 0x440 (Inherited: 0x418)
struct U*f730653843 : U*eb79fdee2a {
	struct U*bc1f2ea9eb* Round_Player; // 0x418(0x08)
	struct U*a0e03b0aa3* Round_Time; // 0x420(0x08)
	struct U*bc1f2ea9eb* Round_Enemy; // 0x428(0x08)
	struct U*3335e92189* Anim_Start; // 0x430(0x08)
	struct UAkAudioEvent* *2a9556d3a4; // 0x438(0x08)
};

// Class TslGame.*826c939821
// Size: 0x4a0 (Inherited: 0x418)
struct U*826c939821 : U*eb79fdee2a {
	struct U*3335e92189* Open_Anim; // 0x418(0x08)
	struct U*3335e92189* Close_Anim; // 0x420(0x08)
	struct U*3335e92189* Found_Anim; // 0x428(0x08)
	struct U*3335e92189* MatchStart_Anim; // 0x430(0x08)
	struct U*3335e92189* MatchEnd_Anim; // 0x438(0x08)
	struct UCanvasPanel* Search_CanvasPanel; // 0x440(0x08)
	struct UTextBlock* Search_Sub_TextBlock; // 0x448(0x08)
	struct UGridPanel* Search_GridPanel; // 0x450(0x08)
	struct UBorder* Search_Border; // 0x458(0x08)
	struct FText TimeTextFormat; // 0x460(0x18)
	struct FString *a6408e5d09; // 0x478(0x10)
	struct FString *27521e03de; // 0x488(0x10)
	char pad_498[0x8]; // 0x498(0x08)

	void OnSearchStarted(); // Function TslGame.*826c939821.OnSearchStarted // Final|Native|Private // @ game+0x59152b8
	void OnMatchFound(); // Function TslGame.*826c939821.OnMatchFound // Final|Native|Private // @ game+0x59121d0
	void OnSearchCanceled(); // Function TslGame.*826c939821.OnSearchCanceled // Final|Native|Private // @ game+0x59152a4
	void OnUpdateMatchWaitingElapsedTime(); // Function TslGame.*826c939821.OnUpdateMatchWaitingElapsedTime // Final|Native|Private // @ game+0x5916c80
};

// Class TslGame.*d48539b74d
// Size: 0x500 (Inherited: 0x418)
struct U*d48539b74d : U*eb79fdee2a {
	struct FSlateBrush *ebd8c9784f; // 0x418(0x90)
	int32 *60270d510b; // 0x4a8(0x04)
	int32 *7cbf92bbb5; // 0x4ac(0x04)
	struct FMargin *0d405c8bbc; // 0x4b0(0x10)
	enum class EHorizontalAlignment *e3d4ba2478; // 0x4c0(0x01)
	char pad_4C1[0x3]; // 0x4c1(0x03)
	struct FLinearColor *629ec25e1b; // 0x4c4(0x10)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	struct UTextBlock* WinningStreakTitleText; // 0x4d8(0x08)
	struct UTextBlock* WinningStreakWinsText; // 0x4e0(0x08)
	struct USizeBox* WinningStreak_SizeBox; // 0x4e8(0x08)
	struct UHorizontalBox* WinningStreak_HorizontalBox; // 0x4f0(0x08)
	struct UBorder* WinningStreak_Border; // 0x4f8(0x08)
};

// Class TslGame.*22031abcf8
// Size: 0x4a0 (Inherited: 0x418)
struct U*22031abcf8 : U*eb79fdee2a {
	char pad_418[0x10]; // 0x418(0x10)
	float ScoreTextStartTime; // 0x428(0x04)
	float ScoreTextUpdateTime; // 0x42c(0x04)
	float ScoreTextMaxTime; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UAkAudioEvent* ScoreRiseSoundEvent; // 0x438(0x08)
	struct UAkAudioEvent* ScoreRiseSoundEndEvent; // 0x440(0x08)
	struct UImage* TrainingScoreIconImage; // 0x448(0x08)
	struct UTextBlock* TrainingScoreTitleText; // 0x450(0x08)
	struct UTextBlock* TrainingScoreNumberText; // 0x458(0x08)
	struct U*3335e92189* Emerge; // 0x460(0x08)
	char pad_468[0x38]; // 0x468(0x38)

	void *5224e45a66(); // Function TslGame.*22031abcf8.*5224e45a66 // Final|Native|Private // @ game+0x5918c00
	void *d344512b16(); // Function TslGame.*22031abcf8.*d344512b16 // Final|Native|Private // @ game+0x592130c
	void *8e50d615c6(); // Function TslGame.*22031abcf8.*8e50d615c6 // Final|Native|Private // @ game+0x5920748
};

// Class TslGame.*e0e203d881
// Size: 0x430 (Inherited: 0x418)
struct U*e0e203d881 : U*eb79fdee2a {
	struct UTextBlock* TurnNumber_Text; // 0x418(0x08)
	struct UTextBlock* WeaponName_Text; // 0x420(0x08)
	struct UImage* Weapon_Image; // 0x428(0x08)
};

// Class TslGame.*2a1620a8b7
// Size: 0x5a8 (Inherited: 0x418)
struct U*2a1620a8b7 : U*eb79fdee2a {
	enum class ETslTrainingType *7b39eea7cb; // 0x418(0x01)
	char pad_419[0x7]; // 0x419(0x07)
	struct FText TitleText; // 0x420(0x18)
	struct UTexture2D* BackGroundTexture; // 0x438(0x08)
	struct UTexture2D* *79f862829c; // 0x440(0x08)
	struct UImage* TrainingIconImage; // 0x448(0x08)
	struct UImage* BackgroundImage; // 0x450(0x08)
	struct UButton* TeleportButton; // 0x458(0x08)
	struct U*d426ac14c0* Title_Text; // 0x460(0x08)
	char pad_468[0x128]; // 0x468(0x128)
	struct U*fefa361ea5* *3234ee374b; // 0x590(0x08)
	struct U*3335e92189* OnBtnHovered_Anim; // 0x598(0x08)
	float *8f1a3aeed2; // 0x5a0(0x04)
	float *3115fed3d8; // 0x5a4(0x04)

	void OnBtnHoverEnded(); // Function TslGame.*2a1620a8b7.OnBtnHoverEnded // Final|Native|Protected|BlueprintCallable // @ game+0x590f0c8
	void OnBtnHovered(); // Function TslGame.*2a1620a8b7.OnBtnHovered // Final|Native|Protected|BlueprintCallable // @ game+0x590f16c
	void OnBtnClicked(); // Function TslGame.*2a1620a8b7.OnBtnClicked // Final|Native|Protected|BlueprintCallable // @ game+0x590f024
};

// Class TslGame.*97b6a14770
// Size: 0x460 (Inherited: 0x418)
struct U*97b6a14770 : U*eb79fdee2a {
	char pad_418[0x30]; // 0x418(0x30)
	struct U*d426ac14c0* ToolTipTitleText; // 0x448(0x08)
	struct UImage* ToolTipImage; // 0x450(0x08)
	struct UImage* BackgroundImage; // 0x458(0x08)
};

// Class TslGame.*731b3158d6
// Size: 0x430 (Inherited: 0x418)
struct U*731b3158d6 : U*eb79fdee2a {
	struct UImage* CapacityImage; // 0x418(0x08)
	struct UImage* FeedbackImage; // 0x420(0x08)
	char pad_428[0x8]; // 0x428(0x08)

	void OnLeaveItemSlot(); // Function TslGame.*731b3158d6.OnLeaveItemSlot // Final|Native|Private // @ game+0x59119b4
	void OnEnterItemSlot(); // Function TslGame.*731b3158d6.OnEnterItemSlot // Final|Native|Private // @ game+0x59107bc
	void OnFocusItemSlotIDEquipment(); // Function TslGame.*731b3158d6.OnFocusItemSlotIDEquipment // Final|Native|Private // @ game+0x5910fbc
	void OnFocusWeaponItemSlotIDEquipment(); // Function TslGame.*731b3158d6.OnFocusWeaponItemSlotIDEquipment // Final|Native|Private // @ game+0x591104c
	void OnAttachmentFocuseSlotID(); // Function TslGame.*731b3158d6.OnAttachmentFocuseSlotID // Final|Native|Private // @ game+0x590e9f4
	void OnFocusItemSlot(); // Function TslGame.*731b3158d6.OnFocusItemSlot // Final|Native|Private // @ game+0x5910e48
};

// Class TslGame.*0158ecccc0
// Size: 0x428 (Inherited: 0x418)
struct U*0158ecccc0 : U*eb79fdee2a {
	struct U*75a405b0fd* TutorialMissionListWidget; // 0x418(0x08)
	struct U*d2281c1e12* TutorialBannerWidget; // 0x420(0x08)
};

// Class TslGame.*3200841f42
// Size: 0x440 (Inherited: 0x418)
struct U*3200841f42 : U*eb79fdee2a {
	struct UTextBlock* TitleText; // 0x418(0x08)
	struct UTslRichTextBlock* MainText; // 0x420(0x08)
	struct U*3335e92189* FadeInAnim; // 0x428(0x08)
	struct U*3335e92189* FadeOutAnim; // 0x430(0x08)
	char pad_438[0x8]; // 0x438(0x08)
};

// Class TslGame.*1b68f65df3
// Size: 0x478 (Inherited: 0x418)
struct U*1b68f65df3 : U*eb79fdee2a {
	struct U*2e0c470dec* RadioMessageLogWidget; // 0x418(0x08)
	struct U*e7ebd1ef79* VehicleStanceWidget; // 0x420(0x08)
	struct U*48201da0f4* MortarCanvasWidget; // 0x428(0x08)
	struct U*f31fb9e0e5* TeamInfoListWidget; // 0x430(0x08)
	struct UWidgetSwitcher* TeamListSwitcher; // 0x438(0x08)
	struct USpacer* TeamListMatchResultSpacer; // 0x440(0x08)
	struct U*93d4f9ab2f* ObserverTeamInfoList; // 0x448(0x08)
	struct FVector2D *80dc281145; // 0x450(0x08)
	struct FVector2D *8d7026bf36; // 0x458(0x08)
	struct FVector2D *94d413ccd6; // 0x460(0x08)
	struct FVector2D *c1793f4d94; // 0x468(0x08)
	bool *cc3ee2e756; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)
};

// Class TslGame.*6ce257ca33
// Size: 0x480 (Inherited: 0x478)
struct U*6ce257ca33 : U*1b68f65df3 {
	struct U*d76301fdac* FBRClassSelectGuideOuterBox; // 0x478(0x08)

	void OnToggleClassSelectWidgetVisibility(); // Function TslGame.*6ce257ca33.OnToggleClassSelectWidgetVisibility // Final|Native|Public // @ game+0x5916970
	void OnMatchStateChanged(); // Function TslGame.*6ce257ca33.OnMatchStateChanged // Final|Native|Public // @ game+0x5912430
};

// Class TslGame.*17b5cd3ffa
// Size: 0x4a0 (Inherited: 0x418)
struct U*17b5cd3ffa : U*eb79fdee2a {
	char pad_418[0xc]; // 0x418(0x0c)
	enum class ELeaningState CurrentLeanState; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	float *f29c044c7c; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FText DistanceTextFormat; // 0x430(0x18)
	struct UTextBlock* RangeFinderText; // 0x448(0x08)
	struct FText ScanningTimerText; // 0x450(0x18)
	struct UClass* *66ddc6887e; // 0x468(0x08)
	struct UVerticalBox* SpottingInfoVerticalBox; // 0x470(0x08)
	struct UHorizontalBox* StandardCrosshair; // 0x478(0x08)
	struct UImage* CrosshairActive; // 0x480(0x08)
	struct UOverlay* DistanceToTarget; // 0x488(0x08)
	struct UOverlay* Overlay_ScanningAll; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)

	void SetRangeFinderTextVisibility(); // Function TslGame.*17b5cd3ffa.SetRangeFinderTextVisibility // Final|Native|Public // @ game+0x591f350
	void *26ab84b9aa(); // Function TslGame.*17b5cd3ffa.*26ab84b9aa // Final|Native|Public // @ game+0x5921c90
	void GetScanningVisibility(); // Function TslGame.*17b5cd3ffa.GetScanningVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b270
	void GetScanningInterruptedVisibility(); // Function TslGame.*17b5cd3ffa.GetScanningInterruptedVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b240
	void GetScanningInProgressVisibility(); // Function TslGame.*17b5cd3ffa.GetScanningInProgressVisibility // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b228
	void GetScanningPercent(); // Function TslGame.*17b5cd3ffa.GetScanningPercent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b258
};

// Class TslGame.*6b159585ed
// Size: 0x550 (Inherited: 0x418)
struct U*6b159585ed : U*eb79fdee2a {
	char pad_418[0xb8]; // 0x418(0xb8)
	float *7b4efdf29d; // 0x4d0(0x04)
	char pad_4D4[0x64]; // 0x4d4(0x64)
	struct UWeaponProcessorComponent* WeaponProcessor; // 0x538(0x08)
	struct UTslItemDragDropOperation* TslItemDragDropOperation; // 0x540(0x08)
	char pad_548[0x8]; // 0x548(0x08)

	void CallOnWeaponEquipmentFocused(); // Function TslGame.*6b159585ed.CallOnWeaponEquipmentFocused // Final|Native|Protected // @ game+0xc9c36c
	void CallOnAttachmentFocused(); // Function TslGame.*6b159585ed.CallOnAttachmentFocused // Final|Native|Protected // @ game+0x5a1483c
	void *4639bbf082(); // Function TslGame.*6b159585ed.*4639bbf082 // Final|Native|Protected // @ game+0x5a14634
	void OnChildSlotRefreshFocus(); // Function TslGame.*6b159585ed.OnChildSlotRefreshFocus // Native|Protected // @ game+0x590fad8
};

// Class TslGame.*dcf769428a
// Size: 0x550 (Inherited: 0x550)
struct U*dcf769428a : U*6b159585ed {
};

// Class TslGame.*f97d1ca96f
// Size: 0x550 (Inherited: 0x550)
struct U*f97d1ca96f : U*dcf769428a {
};

// Class TslGame.*8bccffcb86
// Size: 0x498 (Inherited: 0x418)
struct U*8bccffcb86 : U*eb79fdee2a {
	struct TMap<int32, struct F*65017b093c> *0c7d7ccdb9; // 0x418(0x50)
	struct UTextBlock* NameText; // 0x468(0x08)
	struct UImage* BackgroundL; // 0x470(0x08)
	struct UImage* BackgroundR; // 0x478(0x08)
	struct UImage* AdditiveL; // 0x480(0x08)
	struct UImage* AdditiveR; // 0x488(0x08)
	struct U*3335e92189* ShowAnim; // 0x490(0x08)
};

// Class TslGame.*94568ceae9
// Size: 0x480 (Inherited: 0x418)
struct U*94568ceae9 : U*eb79fdee2a {
	struct F*093563bf09 *1c948139a1; // 0x418(0x28)
	struct F*093563bf09 *24badfafa8; // 0x440(0x28)
	char pad_468[0x18]; // 0x468(0x18)

	void FadeIn(); // Function TslGame.*94568ceae9.FadeIn // Event|Public|BlueprintEvent // @ game+0x21d2c4
};

// Class TslGame.TslWebBrowserWidget
// Size: 0x4b8 (Inherited: 0x418)
struct UTslWebBrowserWidget : U*eb79fdee2a {
	struct UButton* FullModeButton; // 0x418(0x08)
	struct UButton* WindowModeButton; // 0x420(0x08)
	struct F*eaf798361e WebBrowserWidgetBinder; // 0x428(0x20)
	struct F*89ccd1e174 ScreenModeSwitcherBinder; // 0x448(0x28)
	struct F*07222da915 WebBrowserBorderBinder; // 0x470(0x30)
	struct FVector2D WindowModePosition; // 0x4a0(0x08)
	struct FVector2D WindowModeScale; // 0x4a8(0x08)
	char pad_4B0[0x8]; // 0x4b0(0x08)

	void *f4fd4067d1(); // Function TslGame.TslWebBrowserWidget.*f4fd4067d1 // Final|Native|Public // @ game+0x59140fc
	void OnPopup(); // Function TslGame.TslWebBrowserWidget.OnPopup // Final|Native|Public|BlueprintCallable // @ game+0x591421c
	void OnFullMode(); // Function TslGame.TslWebBrowserWidget.OnFullMode // Final|Native|Public // @ game+0x5911204
	void OnWindowMode(); // Function TslGame.TslWebBrowserWidget.OnWindowMode // Final|Native|Public // @ game+0x5918978
	void *47d1d9d0c0(); // Function TslGame.TslWebBrowserWidget.*47d1d9d0c0 // Final|Native|Public // @ game+0x59192a0
	void OnLoadURL(); // Function TslGame.TslWebBrowserWidget.OnLoadURL // Final|Native|Public // @ game+0x5911ddc
};

// Class TslGame.*24d35c94e7
// Size: 0x470 (Inherited: 0x418)
struct U*24d35c94e7 : U*eb79fdee2a {
	char pad_418[0x50]; // 0x418(0x50)
	struct U*466fd1452f* WebView; // 0x468(0x08)

	void IsReuse(); // Function TslGame.*24d35c94e7.IsReuse // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c910
	void IsWebPopupShow(); // Function TslGame.*24d35c94e7.IsWebPopupShow // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c980
	void SetReuse(); // Function TslGame.*24d35c94e7.SetReuse // Final|Native|Public|BlueprintCallable // @ game+0x591f59c
	void GetSaveWebPopupParam(); // Function TslGame.*24d35c94e7.GetSaveWebPopupParam // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b1b4
	void UpdateURLAndWidget(); // Function TslGame.*24d35c94e7.UpdateURLAndWidget // Event|Public|HasOutParms|BlueprintEvent // @ game+0x21d2c4
	void OnUpdateWebPopup(); // Function TslGame.*24d35c94e7.OnUpdateWebPopup // Event|Public|BlueprintEvent // @ game+0x21d2c4
	void UpdateWebPopup(); // Function TslGame.*24d35c94e7.UpdateWebPopup // Final|Native|Public|BlueprintCallable // @ game+0x59225c4
	void CloseWebPopup(); // Function TslGame.*24d35c94e7.CloseWebPopup // Final|Native|Public|BlueprintCallable // @ game+0x59098ac
	void SetWebPopupVisibility(); // Function TslGame.*24d35c94e7.SetWebPopupVisibility // Final|Native|Public|BlueprintCallable // @ game+0x591fd7c
	void SetLayout(); // Function TslGame.*24d35c94e7.SetLayout // Final|Native|Public|BlueprintCallable // @ game+0x591e8c0
};

// Class TslGame.*f42f81b671
// Size: 0x470 (Inherited: 0x418)
struct U*f42f81b671 : U*eb79fdee2a {
	struct UCanvasPanel* OutsidePanel; // 0x418(0x08)
	struct UWidgetSwitcher* FocusSwitcher; // 0x420(0x08)
	struct UOverlay* TargetImageOverlay; // 0x428(0x08)
	struct UImage* TargetImage; // 0x430(0x08)
	struct U*3335e92189* InitAnim; // 0x438(0x08)
	struct U*3335e92189* FadeOutForSelected; // 0x440(0x08)
	struct U*3335e92189* FadeOutForNonSelected; // 0x448(0x08)
	int32 NonFocusedWidgetIndex; // 0x450(0x04)
	int32 FocusedWidgetIndex; // 0x454(0x04)
	int32 EmptyWidgetIndex; // 0x458(0x04)
	float *8ac3fa5b6f; // 0x45c(0x04)
	float *a749f0d8f6; // 0x460(0x04)
	float *5910bab45c; // 0x464(0x04)
	char pad_468[0x8]; // 0x468(0x08)

	void DoAction(); // Function TslGame.*f42f81b671.DoAction // Native|Public|BlueprintCallable // @ game+0x590a0e0
	void DoActionInLobby(); // Function TslGame.*f42f81b671.DoActionInLobby // Native|Public|BlueprintCallable // @ game+0x590a188
	void GetDescriptionText(); // Function TslGame.*f42f81b671.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590aabc
	void GetNameText(); // Function TslGame.*f42f81b671.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b010
	void IsEmpty(); // Function TslGame.*f42f81b671.IsEmpty // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c838
	void IsShowDescriptionText(); // Function TslGame.*f42f81b671.IsShowDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c940
	void SetFocus(); // Function TslGame.*f42f81b671.SetFocus // Final|Native|Public|BlueprintCallable // @ game+0x591e620
	void PlaySelectAnimation(); // Function TslGame.*f42f81b671.PlaySelectAnimation // Native|Public|BlueprintCallable // @ game+0x5918c28
	void SetEmpty(); // Function TslGame.*f42f81b671.SetEmpty // Native|Public|BlueprintCallable // @ game+0x591e3a8
};

// Class TslGame.*700f0a4083
// Size: 0x4f0 (Inherited: 0x470)
struct U*700f0a4083 : U*f42f81b671 {
	struct FString ActionNamePrefix; // 0x470(0x10)
	struct FLinearColor EnbleImageColor; // 0x480(0x10)
	struct FLinearColor DisableImageColor; // 0x490(0x10)
	char pad_4A0[0x50]; // 0x4a0(0x50)

	void GetNameText(); // Function TslGame.*700f0a4083.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b010
	void DoActionInLobby(); // Function TslGame.*700f0a4083.DoActionInLobby // Native|Public|BlueprintCallable // @ game+0x590a188
	void DoAction(); // Function TslGame.*700f0a4083.DoAction // Native|Public|BlueprintCallable // @ game+0x590a0e0
	void GetDescriptionText(); // Function TslGame.*700f0a4083.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590aabc
	void IsShowDescriptionText(); // Function TslGame.*700f0a4083.IsShowDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590c940
};

// Class TslGame.*84ed41a8f3
// Size: 0x4d0 (Inherited: 0x470)
struct U*84ed41a8f3 : U*f42f81b671 {
	struct UTextBlock* StackCountText; // 0x470(0x08)
	struct U*3335e92189* FadeOutForNonSelected_NoItem; // 0x478(0x08)
	struct FLinearColor UnusableItemImageColor; // 0x480(0x10)
	struct FLinearColor UsableItemImageColor; // 0x490(0x10)
	struct FLinearColor UnusableItemNameColor; // 0x4a0(0x10)
	struct FLinearColor UsableItemNameColor; // 0x4b0(0x10)
	char pad_4C0[0x8]; // 0x4c0(0x08)
	struct FName ItemID; // 0x4c8(0x08)

	void PlaySelectAnimation(); // Function TslGame.*84ed41a8f3.PlaySelectAnimation // Native|Public|BlueprintCallable // @ game+0x5918c28
	void DoAction(); // Function TslGame.*84ed41a8f3.DoAction // Native|Public|BlueprintCallable // @ game+0x590a0e0
	void GetStackCount(); // Function TslGame.*84ed41a8f3.GetStackCount // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b4e4
	void GetDescriptionText(); // Function TslGame.*84ed41a8f3.GetDescriptionText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590aabc
	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*84ed41a8f3.OnDefaultITem_AsyncLoadIconFinished // Final|Native|Private // @ game+0x59103ec
	void *b13e09f209(); // Function TslGame.*84ed41a8f3.*b13e09f209 // Final|Native|Public // @ game+0x590cea8
	void UpdateItemImage(); // Function TslGame.*84ed41a8f3.UpdateItemImage // Final|Native|Public // @ game+0x59103ec
	void GetNameText(); // Function TslGame.*84ed41a8f3.GetNameText // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b010
};

// Class TslGame.*5a39067b5f
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*5a39067b5f : U*84ed41a8f3 {
	struct FText CannotUseItemText; // 0x4d0(0x18)

	void GetStackCount(); // Function TslGame.*5a39067b5f.GetStackCount // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x590b4e4
	void DoAction(); // Function TslGame.*5a39067b5f.DoAction // Native|Protected|BlueprintCallable // @ game+0x590a0e0
};

// Class TslGame.*e058378059
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*e058378059 : U*84ed41a8f3 {
	struct FText CannotUseItemText; // 0x4d0(0x18)

	void DoAction(); // Function TslGame.*e058378059.DoAction // Native|Protected|BlueprintCallable // @ game+0x590a0e0
};

// Class TslGame.*f7c3efa02e
// Size: 0x4e8 (Inherited: 0x4d0)
struct U*f7c3efa02e : U*84ed41a8f3 {
	struct FText CannotEquipItemText; // 0x4d0(0x18)

	void GetStackCount(); // Function TslGame.*f7c3efa02e.GetStackCount // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x590b4e4
	void DoAction(); // Function TslGame.*f7c3efa02e.DoAction // Native|Protected|BlueprintCallable // @ game+0x590a0e0
};

// Class TslGame.*30642d35e0
// Size: 0x4d0 (Inherited: 0x470)
struct U*30642d35e0 : U*f42f81b671 {
	float Radius; // 0x470(0x04)
	float RadiusOffsetWhenSelected; // 0x474(0x04)
	struct FName RotationMaterialParameter; // 0x478(0x08)
	struct UImage* FocusedImage; // 0x480(0x08)
	struct UImage* NonFocusedImage; // 0x488(0x08)
	struct USizeBox* FocusedSizeBox; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)
	struct F*850f6938af *28a80745a4; // 0x4a0(0x28)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void GetNameText(); // Function TslGame.*30642d35e0.GetNameText // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x590b010
	void DoAction(); // Function TslGame.*30642d35e0.DoAction // Native|Protected|BlueprintCallable // @ game+0x590a0e0
};

// Class TslGame.*d7198d030e
// Size: 0x4a0 (Inherited: 0x418)
struct U*d7198d030e : U*eb79fdee2a {
	struct UOverlay* ImageOverlay; // 0x418(0x08)
	struct UImage* Img_Icon; // 0x420(0x08)
	struct U*3335e92189* Anim_FocusOn; // 0x428(0x08)
	struct U*3335e92189* Anim_FocusOff; // 0x430(0x08)
	struct U*3335e92189* Anim_FocusOnTextColor; // 0x438(0x08)
	struct U*3335e92189* Anim_FocusOffTextColor; // 0x440(0x08)
	struct U*3335e92189* Anim_AlphaStrong_1; // 0x448(0x08)
	struct U*3335e92189* Anim_AlphaStrong_2; // 0x450(0x08)
	struct U*3335e92189* Anim_AlphaWeak_1; // 0x458(0x08)
	struct U*3335e92189* Anim_AlphaWeak_2; // 0x460(0x08)
	char pad_468[0x20]; // 0x468(0x20)
	struct UImage* Img_CheckIcon; // 0x488(0x08)
	struct UTextBlock* Text_ItemName; // 0x490(0x08)
	char pad_498[0x8]; // 0x498(0x08)
};

// Class TslGame.*18c25e7406
// Size: 0x520 (Inherited: 0x4a0)
struct U*18c25e7406 : U*d7198d030e {
	struct UBorder* Bdr_Volume; // 0x4a0(0x08)
	struct UTextBlock* Txt_Volume; // 0x4a8(0x08)
	struct USizeBox* Szb_SlotNum; // 0x4b0(0x08)
	struct USizeBox* Szb_SlotNum_2; // 0x4b8(0x08)
	struct UTextBlock* TxtSlotNum; // 0x4c0(0x08)
	struct UTextBlock* Txt_SlotNum_2; // 0x4c8(0x08)
	char pad_4D0[0x20]; // 0x4d0(0x20)
	float EquippedSlotAlpha; // 0x4f0(0x04)
	struct FLinearColor UnUsableItemColor; // 0x4f4(0x10)
	char pad_504[0xc]; // 0x504(0x0c)
	struct FName ItemID; // 0x510(0x08)
	bool *472ead8757; // 0x518(0x01)
	bool *3eef3feb98; // 0x519(0x01)
	char pad_51A[0x6]; // 0x51a(0x06)

	void *b13e09f209(); // Function TslGame.*18c25e7406.*b13e09f209 // Final|Native|Public // @ game+0x590cebc
	void UpdateItemImage(); // Function TslGame.*18c25e7406.UpdateItemImage // Final|Native|Public // @ game+0x5910400
	void OnDefaultITem_AsyncLoadIconFinished(); // Function TslGame.*18c25e7406.OnDefaultITem_AsyncLoadIconFinished // Final|Native|Private // @ game+0x5910400
	void GetStackCount(); // Function TslGame.*18c25e7406.GetStackCount // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x590b50c
};

// Class TslGame.*fefa361ea5
// Size: 0x480 (Inherited: 0x418)
struct U*fefa361ea5 : U*eb79fdee2a {
	struct UVerticalBox* info_VerticalBox; // 0x418(0x08)
	struct TArray<struct U*2a1620a8b7*> *1f59b17c63; // 0x420(0x10)
	struct U*2a1620a8b7* *d31baa49fb; // 0x430(0x08)
	struct TArray<struct U*28a8288909*> *cefc9ca256; // 0x438(0x10)
	struct FMulticastDelegate OnClickTeleportButton; // 0x448(0x10)
	struct FMulticastDelegate OnHoverTeleportButton; // 0x458(0x10)
	struct FMulticastDelegate OnUnHoverTeleportButton; // 0x468(0x10)
	struct U*87c45c44a1* *7e9765ce89; // 0x478(0x08)

	void OnBtnHovered(); // Function TslGame.*fefa361ea5.OnBtnHovered // Final|Native|Protected|BlueprintCallable // @ game+0x590f180
	void OnBtnClicked(); // Function TslGame.*fefa361ea5.OnBtnClicked // Final|Native|Protected|BlueprintCallable // @ game+0x590f038
	void OnBtnHoverEnded(); // Function TslGame.*fefa361ea5.OnBtnHoverEnded // Final|Native|Protected|BlueprintCallable // @ game+0x590f0dc
	void *0b05933638(); // Function TslGame.*fefa361ea5.*0b05933638 // Final|Native|Public // @ game+0x590c6dc
};

// Class TslGame.*3ad7ca9e8a
// Size: 0x578 (Inherited: 0x418)
struct U*3ad7ca9e8a : U*eb79fdee2a {
	struct U*e593aa6673* RespawnTimerUpdater; // 0x418(0x08)
	struct U*e593aa6673* TimeLimitTimerUpdater; // 0x420(0x08)
	struct F*471718b397 RespawnTimeTextBinder; // 0x428(0x20)
	struct F*471718b397 TimeLimitTextBinder; // 0x448(0x20)
	struct TArray<struct F*7935e10e39> TeamValueImageBinders; // 0x468(0x10)
	struct TArray<struct F*471718b397> TeamValueTextBinders; // 0x478(0x10)
	struct TArray<struct F*471718b397> TeamMemberCountTextBinders; // 0x488(0x10)
	struct F*07222da915 GameStatusMessageBorder_Binder; // 0x498(0x30)
	struct F*03af4cd0fb VSFadeInAnimation_Binder; // 0x4c8(0x20)
	struct F*03af4cd0fb VSFadeOutAnimation_Binder; // 0x4e8(0x20)
	struct F*471718b397 UpperTargetScoreText_Binder; // 0x508(0x20)
	struct FName ColorParamName; // 0x528(0x08)
	struct FName GaugeParamName; // 0x530(0x08)
	bool bUseRespawnTimer; // 0x538(0x01)
	bool bUseTimeLimitTimer; // 0x539(0x01)
	bool bUseAnimOnMatchStart; // 0x53a(0x01)
	bool bPlayGaugeAnim; // 0x53b(0x01)
	float GaugeAnimSpeed; // 0x53c(0x04)
	float GaugeAnimTime; // 0x540(0x04)
	char pad_544[0x4]; // 0x544(0x04)
	struct TArray<struct FLinearColor> TeamColors; // 0x548(0x10)
	char pad_558[0x20]; // 0x558(0x20)

	void OnModeStarted(); // Function TslGame.*3ad7ca9e8a.OnModeStarted // Native|Protected|HasOutParms // @ game+0x5912ad8
	void OnTimeLimitUpdated(); // Function TslGame.*3ad7ca9e8a.OnTimeLimitUpdated // Native|Protected // @ game+0x5916570
	void OnModeInitialized(); // Function TslGame.*3ad7ca9e8a.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x591299c
	void OnMyGainScoreChanged(); // Function TslGame.*3ad7ca9e8a.OnMyGainScoreChanged // Native|Protected // @ game+0x5913128
	void OnMyTeamRankChanged(); // Function TslGame.*3ad7ca9e8a.OnMyTeamRankChanged // Native|Protected // @ game+0x591325c
	void OnResetLevel(); // Function TslGame.*3ad7ca9e8a.OnResetLevel // Native|Protected // @ game+0x5914d60
	void OnMatchStarted(); // Function TslGame.*3ad7ca9e8a.OnMatchStarted // Native|Protected // @ game+0x59121e4
	void OnRespawnTimeUpdated(); // Function TslGame.*3ad7ca9e8a.OnRespawnTimeUpdated // Native|Protected // @ game+0x5914d78
	void OnMyTeamScoreChanged(); // Function TslGame.*3ad7ca9e8a.OnMyTeamScoreChanged // Native|Protected // @ game+0x5913380
	void OnHighEnemyScoreChanged(); // Function TslGame.*3ad7ca9e8a.OnHighEnemyScoreChanged // Native|Protected // @ game+0x5911480
};

// Class TslGame.BRTwoTeamScoreboardWidget
// Size: 0x590 (Inherited: 0x578)
struct UBRTwoTeamScoreboardWidget : U*3ad7ca9e8a {
	char pad_578[0x18]; // 0x578(0x18)
};

// Class TslGame.CustomTwoTeamScoreboardWidget
// Size: 0x5b8 (Inherited: 0x578)
struct UCustomTwoTeamScoreboardWidget : U*3ad7ca9e8a {
	struct F*471718b397 TargetScoreTextBinder; // 0x578(0x20)
	struct FText TargetScoreText; // 0x598(0x18)
	char pad_5B0[0x8]; // 0x5b0(0x08)

	void OnModeStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeStarted // Native|Protected|HasOutParms // @ game+0x5912ad8
	void OnTimeLimitUpdated(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnTimeLimitUpdated // Native|Protected // @ game+0x5916570
	void OnHighEnemyScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnHighEnemyScoreChanged // Native|Protected // @ game+0x5911480
	void OnMatchStarted(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMatchStarted // Native|Protected // @ game+0x59121e4
	void OnResetLevel(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnResetLevel // Native|Protected // @ game+0x5914d60
	void OnMyTeamRankChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamRankChanged // Native|Protected // @ game+0x591325c
	void OnMyTeamScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyTeamScoreChanged // Native|Protected // @ game+0x5913380
	void OnRespawnTimeUpdated(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnRespawnTimeUpdated // Native|Protected // @ game+0x5914d78
	void ShowInstantRespawnMessage(); // Function TslGame.CustomTwoTeamScoreboardWidget.ShowInstantRespawnMessage // Final|Native|Protected // @ game+0x59201b4
	void OnMyGainScoreChanged(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnMyGainScoreChanged // Native|Protected // @ game+0x5913128
	void OnModeInitialized(); // Function TslGame.CustomTwoTeamScoreboardWidget.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x591299c
};

// Class TslGame.ConquestModeWidget
// Size: 0x648 (Inherited: 0x5b8)
struct UConquestModeWidget : UCustomTwoTeamScoreboardWidget {
	struct UClass* *2f907062a2; // 0x5b8(0x08)
	struct UClass* *1ed8ab3169; // 0x5c0(0x08)
	struct F*093563bf09 *733f559936; // 0x5c8(0x28)
	struct F*093563bf09 *38593618ed; // 0x5f0(0x28)
	bool *42a0d0756b; // 0x618(0x01)
	char pad_619[0x7]; // 0x619(0x07)
	struct FString *9205b0d675; // 0x620(0x10)
	struct TArray<struct U*f313501fd3*> *0697c694e9; // 0x630(0x10)
	struct U*f313501fd3* *5a7c24d798; // 0x640(0x08)

	void OnActivatedCaptureAreaUpdated(); // Function TslGame.ConquestModeWidget.OnActivatedCaptureAreaUpdated // Final|Native|Private|HasOutParms // @ game+0x590e604
};

// Class TslGame.*d66adc5215
// Size: 0x5e8 (Inherited: 0x5b8)
struct U*d66adc5215 : UCustomTwoTeamScoreboardWidget {
	struct F*92d5c0f2ef *f8ac1ead93; // 0x5b8(0x28)
	char pad_5E0[0x8]; // 0x5e0(0x08)

	void OnHighEnemyScoreChanged(); // Function TslGame.*d66adc5215.OnHighEnemyScoreChanged // Native|Protected // @ game+0x5911480
	void OnMyTeamScoreChanged(); // Function TslGame.*d66adc5215.OnMyTeamScoreChanged // Native|Protected // @ game+0x5913380
	void OnMatchStarted(); // Function TslGame.*d66adc5215.OnMatchStarted // Native|Protected // @ game+0x59121e4
	void OnModeInitialized(); // Function TslGame.*d66adc5215.OnModeInitialized // Native|Protected|HasOutParms // @ game+0x591299c
};

// Class TslGame.*d31b63b3be
// Size: 0x638 (Inherited: 0x5b8)
struct U*d31b63b3be : UCustomTwoTeamScoreboardWidget {
	struct F*471718b397 *7f21009bb0; // 0x5b8(0x20)
	struct F*471718b397 *de2316d30b; // 0x5d8(0x20)
	struct F*03af4cd0fb *d3b2c90d4c; // 0x5f8(0x20)
	struct F*03af4cd0fb *1796f060e1; // 0x618(0x20)

	void OnMyGainScoreChanged(); // Function TslGame.*d31b63b3be.OnMyGainScoreChanged // Native|Protected // @ game+0x5913128
	void OnModeInitialized(); // Function TslGame.*d31b63b3be.OnModeInitialized // Final|Native|Protected|HasOutParms // @ game+0x591299c
	void OnHighEnemyScoreChanged(); // Function TslGame.*d31b63b3be.OnHighEnemyScoreChanged // Native|Protected // @ game+0x5911480
	void OnMatchStarted(); // Function TslGame.*d31b63b3be.OnMatchStarted // Native|Protected // @ game+0x59121e4
	void *521a96d91b(); // Function TslGame.*d31b63b3be.*521a96d91b // Final|Native|Protected // @ game+0x59120a8
	void OnMyTeamScoreChanged(); // Function TslGame.*d31b63b3be.OnMyTeamScoreChanged // Native|Protected // @ game+0x5913380
};

// Class TslGame.*e2062c0500
// Size: 0x5c8 (Inherited: 0x578)
struct U*e2062c0500 : U*3ad7ca9e8a {
	char pad_578[0x28]; // 0x578(0x28)
	struct F*6351b5e701 TimeLimitTimerSizeBoxBinder; // 0x5a0(0x20)
	struct UMaterialInterface* *56cf8b2409; // 0x5c0(0x08)

	void OnTimeLimitUpdated(); // Function TslGame.*e2062c0500.OnTimeLimitUpdated // Native|Protected // @ game+0x5916570
};

// Class TslGame.*f8bdb3ef06
// Size: 0x500 (Inherited: 0x418)
struct U*f8bdb3ef06 : U*eb79fdee2a {
	struct F*471718b397 Label; // 0x418(0x20)
	struct F*07222da915 Border; // 0x438(0x30)
	char pad_468[0x98]; // 0x468(0x98)
};

// Class TslGame.*33e295e9b9
// Size: 0x480 (Inherited: 0x418)
struct U*33e295e9b9 : U*eb79fdee2a {
	struct F*ca2a13fb88 EditText; // 0x418(0x20)
	struct F*471718b397 TextBlock; // 0x438(0x20)
	char pad_458[0x28]; // 0x458(0x28)

	void OnOkayButtonClicked(); // Function TslGame.*33e295e9b9.OnOkayButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbf2d88
	void OnCloseButtonClicked(); // Function TslGame.*33e295e9b9.OnCloseButtonClicked // Final|Native|Public|BlueprintCallable // @ game+0xbf2d88
};

// Class TslGame.*daae3261e9
// Size: 0x4c8 (Inherited: 0x480)
struct U*daae3261e9 : U*33e295e9b9 {
	struct F*cd4c9d7cc4 VerticalBox; // 0x480(0x28)
	struct UClass* *49451cd867; // 0x4a8(0x08)
	char pad_4B0[0x18]; // 0x4b0(0x18)
};

// Class TslGame.*28abc61cb8
// Size: 0x4e0 (Inherited: 0x418)
struct U*28abc61cb8 : U*eb79fdee2a {
	struct F*7935e10e39 OilGaugeImageBinder; // 0x418(0x28)
	struct F*7935e10e39 OilGaugeBgImageBinder; // 0x440(0x28)
	struct F*7935e10e39 OilArrowImageBinder; // 0x468(0x28)
	struct F*334c0e7a9a GaugeBodyBinder; // 0x490(0x28)
	struct FLinearColor NormalColor; // 0x4b8(0x10)
	struct FLinearColor FuelEmptyColor; // 0x4c8(0x10)
	struct FName GaugePramName; // 0x4d8(0x08)
};

// Class TslGame.*c0982bafb4
// Size: 0x548 (Inherited: 0x4e0)
struct U*c0982bafb4 : U*28abc61cb8 {
	char pad_4E0[0x8]; // 0x4e0(0x08)
	struct F*03af4cd0fb BoostGauge_Using; // 0x4e8(0x20)
	struct F*03af4cd0fb BoostGauge_Normal; // 0x508(0x20)
	struct F*03af4cd0fb BoostGauge_CantUse; // 0x528(0x20)
};

// Class TslGame.*2c0eef8811
// Size: 0x448 (Inherited: 0x418)
struct U*2c0eef8811 : U*eb79fdee2a {
	struct UCheckBox* DriverCheckBox; // 0x418(0x08)
	struct UTextBlock* ChannelTextBlock; // 0x420(0x08)
